{
  "updated_at": "2025-09-24T23:23:57.361Z",
  "articles": [
    {
      "id": "e276eb9cb594",
      "title": "Menopausal Hormone Therapy and Cardiovascular Diseases in Women With Vasomotor Symptoms: A Secondary Analysis of the Women`s Health Initiative Randomized Clinical Trials.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48260265/117680",
      "abstract": "Identification of appropriate patients for treatment of vasomotor symptoms (VMS) with menopausal hormone therapy (HT) is challenging. To assess risk of cardiovascular disease (CVD) due to HT in women with VMS. In this secondary analysis of 2 randomized clinical trials of HT, postmenopausal women aged 50 to 79 years from 40 US clinical centers were included. Data were collected from November 1993 to September 2012, and data were analyzed from December 2024 to May 2025. Conjugated equine estrogens (CEE), 0.625 mg per day, or CEE with medroxyprogesterone acetate (MPA), 2.5 mg per day, vs placebo. Atherosclerotic CVD (ASCVD; defined as composite of nonfatal myocardial infarction, hospitalization for angina, coronary revascularization, ischemic stroke, peripheral arterial disease, carotid artery disease, or CVD death). Of 27 347 included postmenopausal women, the mean (SD) age was 63.4 (7.2) years; a total of 10 739 (39.3%) had a hysterectomy, and 16 608 (60.7%) had an intact uterus. The median (IQR) follow-up was 7.2 (6.4-8.1) years and 5.6 (4.8-6.5) years for those in the CEE alone trial and the CEE plus MPA trial, respectively. In the CEE alone trial, moderate or severe VMS were present at baseline in 905 (27.6%), 705 (14.7%), and 220 (8.7%) women aged 50 to 59 years, 60 to 69 years, and 70 to 79 years, respectively; in the CEE plus MPA trial, moderate or severe VMS was present in 1225 (22.4%), 649 (8.7%), and 172 (4.8%), respectively. Among women with moderate or severe VMS at enrollment, 3382 (96.7%) recalled having symptoms near menopause onset. CEE alone reduced VMS by 41% across all age groups (overall relative risk [RR], 0.59; 95% CI, 0.53-0.66). However, in the CEE plus MPA trial, VMS reduction was attenuated with age (age 50-59 years: RR, 0.41; 95% CI, 0.35-0.48; age 60-69 years: RR, 0.72; 95% CI, 0.61-0.85; age 70-79 years: RR, 1.20; 95% CI, 0.91-1.59; interaction P for trend < .001). Both CEE alone and CEE plus MPA appeared to have neutral effects on ASCVD in women with moderate or severe VMS aged 50 to 59 years (CEE alone: hazard ratio [HR], 0.85; 95% CI, 0.53-1.35; CEE plus MPA: HR, 0.84; 95% CI, 0.44-1.57). While the estimated risk was higher for CEE alone in women with VMS aged 60 to 69 years, there was no clear signal of harm (CEE alone: HR, 1.31; 95% CI, 0.90-1.90; CEE plus MPA: HR, 0.84; 95% CI, 0.51-1.39). However, women with VMS 70 years and older had increased risks of ASCVD (CEE alone: HR, 1.95; 95% CI, 1.06-3.59; 217 excess events per 10 000 person-years; interaction P for trend = .03; CEE plus MPA: HR, 3.22; 95% CI, 1.36-7.63; 382 excess events per 10 000 person-years; interaction P for trend = .02). In this secondary analysis of 2 randomized clinical trials, among younger postmenopausal women aged 50 to 59 years, both CEE alone and CEE plus MPA reduced VMS without significantly affecting ASCVD risk. In women with VMS 70 years and older, risks for ASCVD were increased in both trials. The findings support guideline recommendations for treatment of VMS with HT in women aged 50 to 59 years, caution if initiating HT in women aged 60 to 69 years, and avoidance of HT in women 70 years and older. ClinicalTrials.gov Identifier: NCT00000611.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Identification of appropriate patients for treatment of vasomotor symptoms (VMS) with menopausal hormone therapy (HT) is challenging."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess risk of cardiovascular disease (CVD) due to HT in women with VMS."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "In this secondary analysis of 2 randomized clinical trials of HT, postmenopausal women aged 50 to 79 years from 40 US clinical centers were included. Data were collected from November 1993 to September 2012, and data were analyzed from December 2024 to May 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Conjugated equine estrogens (CEE), 0.625 mg per day, or CEE with medroxyprogesterone acetate (MPA), 2.5 mg per day, vs placebo."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Atherosclerotic CVD (ASCVD; defined as composite of nonfatal myocardial infarction, hospitalization for angina, coronary revascularization, ischemic stroke, peripheral arterial disease, carotid artery disease, or CVD death)."
        },
        {
          "label": "RESULTS",
          "text": "Of 27 347 included postmenopausal women, the mean (SD) age was 63.4 (7.2) years; a total of 10 739 (39.3%) had a hysterectomy, and 16 608 (60.7%) had an intact uterus. The median (IQR) follow-up was 7.2 (6.4-8.1) years and 5.6 (4.8-6.5) years for those in the CEE alone trial and the CEE plus MPA trial, respectively. In the CEE alone trial, moderate or severe VMS were present at baseline in 905 (27.6%), 705 (14.7%), and 220 (8.7%) women aged 50 to 59 years, 60 to 69 years, and 70 to 79 years, respectively; in the CEE plus MPA trial, moderate or severe VMS was present in 1225 (22.4%), 649 (8.7%), and 172 (4.8%), respectively. Among women with moderate or severe VMS at enrollment, 3382 (96.7%) recalled having symptoms near menopause onset. CEE alone reduced VMS by 41% across all age groups (overall relative risk [RR], 0.59; 95% CI, 0.53-0.66). However, in the CEE plus MPA trial, VMS reduction was attenuated with age (age 50-59 years: RR, 0.41; 95% CI, 0.35-0.48; age 60-69 years: RR, 0.72; 95% CI, 0.61-0.85; age 70-79 years: RR, 1.20; 95% CI, 0.91-1.59; interaction P for trend < .001). Both CEE alone and CEE plus MPA appeared to have neutral effects on ASCVD in women with moderate or severe VMS aged 50 to 59 years (CEE alone: hazard ratio [HR], 0.85; 95% CI, 0.53-1.35; CEE plus MPA: HR, 0.84; 95% CI, 0.44-1.57). While the estimated risk was higher for CEE alone in women with VMS aged 60 to 69 years, there was no clear signal of harm (CEE alone: HR, 1.31; 95% CI, 0.90-1.90; CEE plus MPA: HR, 0.84; 95% CI, 0.51-1.39). However, women with VMS 70 years and older had increased risks of ASCVD (CEE alone: HR, 1.95; 95% CI, 1.06-3.59; 217 excess events per 10 000 person-years; interaction P for trend = .03; CEE plus MPA: HR, 3.22; 95% CI, 1.36-7.63; 382 excess events per 10 000 person-years; interaction P for trend = .02)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this secondary analysis of 2 randomized clinical trials, among younger postmenopausal women aged 50 to 59 years, both CEE alone and CEE plus MPA reduced VMS without significantly affecting ASCVD risk. In women with VMS 70 years and older, risks for ASCVD were increased in both trials. The findings support guideline recommendations for treatment of VMS with HT in women aged 50 to 59 years, caution if initiating HT in women aged 60 to 69 years, and avoidance of HT in women 70 years and older."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT00000611."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40952729/",
      "pubDate": "2025 Sep 15",
      "doi": "10.1001/jamainternmed.2025.4510",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Hormone therapy effectively treats vasomotor symptoms in younger postmenopausal women without increasing cardiovascular risk, but increases cardiovascular risk in women aged 70 and older."
    },
    {
      "id": "35e4ce8628ab",
      "title": "Oral Semaglutide at a Dose of 25 mg in Adults with Overweight or Obesity.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48260265/117628",
      "abstract": "Orforglipron, a small-molecule, nonpeptide oral glucagon-like peptide-1 (GLP-1) receptor agonist, is being investigated as a treatment for obesity. In this phase 3, multinational, randomized, double-blind trial, we examined the safety and efficacy of once-daily orforglipron at doses of 6 mg, 12 mg, or 36 mg, as compared with placebo (assigned in a 3:3:3:4 ratio) as an adjunct to healthy diet and physical activity for 72 weeks. All the patients had obesity without diabetes mellitus. The primary end point was the percent change in body weight from baseline to week 72, as assessed according to the treatment-regimen estimand in the intention-to-treat population. A total of 3127 patients underwent randomization. The mean change in body weight from baseline to week 72 was -7.5% (95% confidence interval [CI], -8.2 to -6.8) with 6 mg of orforglipron, -8.4% (95% CI, -9.1 to -7.7) with 12 mg of orforglipron, and -11.2% (95% CI, -12.0 to -10.4) with 36 mg of orforglipron, as compared with -2.1% (95% CI, -2.8 to -1.4) with placebo (P<0.001 for all comparisons with placebo). Among the patients in the orforglipron 36-mg group, 54.6% had a reduction of 10% or more, 36.0% had a reduction of 15% or more, and 18.4% had a reduction of 20% or more, as compared with 12.9%, 5.9%, and 2.8% of the patients, respectively, in the placebo group. Waist circumference, systolic blood pressure, triglyceride levels, and non-HDL cholesterol levels significantly improved with orforglipron treatment as compared with placebo. Adverse events resulted in treatment discontinuation in 5.3 to 10.3% of the patients in the orforglipron groups and in 2.7% of those in the placebo group. The most common adverse events with orforglipron were gastrointestinal effects, which were mostly mild to moderate. In adults with obesity, 72-week treatment with orforglipron led to significantly greater reductions in body weight than placebo; the adverse-event profile was consistent with that of other GLP-1 receptor agonists. (Funded by Eli Lilly; ATTAIN-1 ClinicalTrials.gov number, NCT05869903.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Orforglipron, a small-molecule, nonpeptide oral glucagon-like peptide-1 (GLP-1) receptor agonist, is being investigated as a treatment for obesity."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3, multinational, randomized, double-blind trial, we examined the safety and efficacy of once-daily orforglipron at doses of 6 mg, 12 mg, or 36 mg, as compared with placebo (assigned in a 3:3:3:4 ratio) as an adjunct to healthy diet and physical activity for 72 weeks. All the patients had obesity without diabetes mellitus. The primary end point was the percent change in body weight from baseline to week 72, as assessed according to the treatment-regimen estimand in the intention-to-treat population."
        },
        {
          "label": "RESULTS",
          "text": "A total of 3127 patients underwent randomization. The mean change in body weight from baseline to week 72 was -7.5% (95% confidence interval [CI], -8.2 to -6.8) with 6 mg of orforglipron, -8.4% (95% CI, -9.1 to -7.7) with 12 mg of orforglipron, and -11.2% (95% CI, -12.0 to -10.4) with 36 mg of orforglipron, as compared with -2.1% (95% CI, -2.8 to -1.4) with placebo (P<0.001 for all comparisons with placebo). Among the patients in the orforglipron 36-mg group, 54.6% had a reduction of 10% or more, 36.0% had a reduction of 15% or more, and 18.4% had a reduction of 20% or more, as compared with 12.9%, 5.9%, and 2.8% of the patients, respectively, in the placebo group. Waist circumference, systolic blood pressure, triglyceride levels, and non-HDL cholesterol levels significantly improved with orforglipron treatment as compared with placebo. Adverse events resulted in treatment discontinuation in 5.3 to 10.3% of the patients in the orforglipron groups and in 2.7% of those in the placebo group. The most common adverse events with orforglipron were gastrointestinal effects, which were mostly mild to moderate."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In adults with obesity, 72-week treatment with orforglipron led to significantly greater reductions in body weight than placebo; the adverse-event profile was consistent with that of other GLP-1 receptor agonists. (Funded by Eli Lilly; ATTAIN-1 ClinicalTrials.gov number, NCT05869903.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40960239/",
      "pubDate": "2025 Sep 16",
      "doi": "10.1056/NEJMoa2511774",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Orforglipron resulted in significantly more weight loss compared to placebo in obese adults, with side effects similar to other GLP-1 receptor agonists."
    },
    {
      "id": "ba0792328dbb",
      "title": "The Efficacy of Aromatherapy on Pain and Anxiety During Needle-Related Procedures in Adults: A Systematic Review and Meta-Analysis.",
      "journal": "J Pain Res",
      "score": "5/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48260265/117478",
      "abstract": "Pain and anxiety resulting from needle-related manipulation are major causes of patient refusal and missed optimal treatment. This study focuses on assessing the effectiveness and benefits of aromatherapy in adult patients undergoing needle-related manipulation for pain and anxiety. The researchers conducted detailed searches of a total of five databases, the Cochrane Library, Web of Science, Embase Databases, and Scopus, from the period of the library's construction until November 23, 2024. Inclusion criteria involved adults undergoing needle-related manipulation, aromatherapy as an intervention, and outcome indicators such as pain, anxiety, and satisfaction. And the results were analyzed in subgroups. This study used RevMan 5.4.1 software to analyse the included data. This meta-analysis and systematic review included a total of 9 studies. A meta-analysis demonstrated that aromatherapy as an intervention significantly reduced pain (MD = -1.82, 95% CI [-2.35, -1.30], p < 0.00001) and anxiety (SMD = -0.92, 95% CI [-1.71, -0.14], p = 0.02) in adult patients undergoing needle-related invasive procedures compared to placebo and conventional interventions. Subgroup analyses indicated aromatherapy reduced pain during needle procedures for arteriovenous fistulae (AVF) and catheter placement, and alleviated anxiety in AVF patients. Lavender oil effectively reduced both pain and anxiety. The 5-minute duration of action is superior to the 3-minute duration of action. Both inhalation and topical application reduced pain. This meta-analysis supports aromatherapy for needle-related pain relief and targeted anxiety reduction. However, protocol standardization in future RCTs is needed to address high heterogeneity and methodological limitations.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Pain and anxiety resulting from needle-related manipulation are major causes of patient refusal and missed optimal treatment. This study focuses on assessing the effectiveness and benefits of aromatherapy in adult patients undergoing needle-related manipulation for pain and anxiety."
        },
        {
          "label": "METHODS",
          "text": "The researchers conducted detailed searches of a total of five databases, the Cochrane Library, Web of Science, Embase Databases, and Scopus, from the period of the library's construction until November 23, 2024. Inclusion criteria involved adults undergoing needle-related manipulation, aromatherapy as an intervention, and outcome indicators such as pain, anxiety, and satisfaction. And the results were analyzed in subgroups. This study used RevMan 5.4.1 software to analyse the included data."
        },
        {
          "label": "RESULTS",
          "text": "This meta-analysis and systematic review included a total of 9 studies. A meta-analysis demonstrated that aromatherapy as an intervention significantly reduced pain (MD = -1.82, 95% CI [-2.35, -1.30], p < 0.00001) and anxiety (SMD = -0.92, 95% CI [-1.71, -0.14], p = 0.02) in adult patients undergoing needle-related invasive procedures compared to placebo and conventional interventions. Subgroup analyses indicated aromatherapy reduced pain during needle procedures for arteriovenous fistulae (AVF) and catheter placement, and alleviated anxiety in AVF patients. Lavender oil effectively reduced both pain and anxiety. The 5-minute duration of action is superior to the 3-minute duration of action. Both inhalation and topical application reduced pain."
        },
        {
          "label": "CONCLUSION",
          "text": "This meta-analysis supports aromatherapy for needle-related pain relief and targeted anxiety reduction. However, protocol standardization in future RCTs is needed to address high heterogeneity and methodological limitations."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40827258/",
      "pubDate": "2025",
      "doi": "10.2147/JPR.S533076",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Aromatherapy effectively alleviates needle-related pain and anxiety, but future research needs standardized protocols."
    },
    {
      "id": "a5106acb6516",
      "title": "Patient and Caregiver Outcomes of Health System, Community-Based, and Usual Dementia Care: A Prespecified Analysis of the Dementia Care Study (D-CARE) Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48190384/117607",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true
    },
    {
      "id": "dc0fb63b159b",
      "title": "Racial disparities in the incidence and risk factors of major bleeding during extended anticoagulant therapy for venous thromboembolism.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48190384/117596",
      "abstract": "Guidelines recommend extended anticoagulation after a first unprovoked venous thromboembolism (VTE) for individuals at low risk of bleeding. However, racial disparities in bleeding risks during extended treatment remain understudied. To compare risks of anticoagulant-associated bleeding and performance of a risk assessment model by racial group during extended VTE treatment. We analyzed 2 prospective cohorts of patients (223 Black participants and 4314 White participants) with a first unprovoked/weakly provoked VTE who continued anticoagulation after ≥3 months of initial treatment. Primary outcome was adjudicated International Society on Thrombosis and Haemostasis-defined major bleeding. Secondary outcomes included intracranial hemorrhage, fatal bleeding, and clinically relevant nonmajor bleeding. We determined incidence and hazard ratios (HRs) by race, then adjusted for bleeding risk factors that included the Creatinine, Hemoglobin, Age, antiPlatelet model. Black participants had higher prevalence of bleeding risk factors and a 1.9-fold higher risk of major bleeding (HR, 1.87; 95% CI, 1.04-3.36) compared with White participants. Adjustment attenuated racial difference for major bleeding but not intracranial hemorrhage (adjusted HR, 2.35; 95% CI, 1.23-4.48). Among those classified as low risk by Creatinine, Hemoglobin, Age, antiPlatelet model, Black participants had numerically higher major bleeding incidence than White participants (2.5 vs 1.1 per 100 person-years). We did not observe racial disparities in fatal bleeding or clinically relevant nonmajor bleeding. Black individuals on extended anticoagulation have higher risk of major bleeding compared with White individuals. This effect appears to persist in those classified as low risk for bleeding. Risk assessment models for anticoagulant-associated bleeding that are generalizable to racialized populations are needed.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Guidelines recommend extended anticoagulation after a first unprovoked venous thromboembolism (VTE) for individuals at low risk of bleeding. However, racial disparities in bleeding risks during extended treatment remain understudied."
        },
        {
          "label": "OBJECTIVES",
          "text": "To compare risks of anticoagulant-associated bleeding and performance of a risk assessment model by racial group during extended VTE treatment."
        },
        {
          "label": "METHODS",
          "text": "We analyzed 2 prospective cohorts of patients (223 Black participants and 4314 White participants) with a first unprovoked/weakly provoked VTE who continued anticoagulation after ≥3 months of initial treatment. Primary outcome was adjudicated International Society on Thrombosis and Haemostasis-defined major bleeding. Secondary outcomes included intracranial hemorrhage, fatal bleeding, and clinically relevant nonmajor bleeding. We determined incidence and hazard ratios (HRs) by race, then adjusted for bleeding risk factors that included the Creatinine, Hemoglobin, Age, antiPlatelet model."
        },
        {
          "label": "RESULTS",
          "text": "Black participants had higher prevalence of bleeding risk factors and a 1.9-fold higher risk of major bleeding (HR, 1.87; 95% CI, 1.04-3.36) compared with White participants. Adjustment attenuated racial difference for major bleeding but not intracranial hemorrhage (adjusted HR, 2.35; 95% CI, 1.23-4.48). Among those classified as low risk by Creatinine, Hemoglobin, Age, antiPlatelet model, Black participants had numerically higher major bleeding incidence than White participants (2.5 vs 1.1 per 100 person-years). We did not observe racial disparities in fatal bleeding or clinically relevant nonmajor bleeding."
        },
        {
          "label": "CONCLUSION",
          "text": "Black individuals on extended anticoagulation have higher risk of major bleeding compared with White individuals. This effect appears to persist in those classified as low risk for bleeding. Risk assessment models for anticoagulant-associated bleeding that are generalizable to racialized populations are needed."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40769433/",
      "pubDate": "2025 Aug 05",
      "doi": "10.1016/j.jtha.2025.07.026",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Black individuals on long-term blood thinners experience a greater risk of serious bleeding than White individuals, even when considered low-risk."
    },
    {
      "id": "3b433b12cd48",
      "title": "Simultaneous initiation of finerenone and empagliflozin across the spectrum of kidney risk in the CONFIDENCE trial.",
      "journal": "Nephrol Dial Transplant",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48190384/117591",
      "abstract": "The CONFIDENCE (COmbinatioN effect of FInerenone anD EmpaglifloziN in participants with CKD and type 2 diabetes using a UACR Endpoint) trial investigated the safety and efficacy of simultaneously initiating finerenone and empagliflozin for patients with chronic kidney disease (CKD) and type 2 diabetes. This prespecified analysis aimed to determine if the predicted risk of kidney disease progression, based on KDIGO risk categories, influenced the benefits and safety of this combination therapy. The double-blind, double-dummy trial randomized 818 adults with CKD and type 2 diabetes [urine albumin-creatinine ratio (UACR) ≥100 to <5000 mg/g] to receive once-daily finerenone plus empagliflozin, finerenone alone or empagliflozin alone, all in addition to a renin-angiotensin system inhibitor. The relative change in UACR from baseline to day 180 (primary endpoint) and a >30% reduction in UACR (secondary endpoint) across KDIGO risk categories was assessed. At baseline, among 781 with available data, 11.3% of participants were classified as low/moderate risk, 29.6% as high risk and 59.2% as very high risk. At 180 days, combination therapy significantly reduced UACR levels across all KDIGO risk categories (low/moderate: -61.7%; high: -60.7%; very high: -52.4%). This reduction was consistently greater than that achieved with either monotherapy alone. More than half of patients on combination therapy experienced UACR reductions of >30% (low/moderate: 58.1%; high: 74.2%; very high: 70.6%), again outperforming monotherapies across all risk groups. While hyperkalemia was more common with combination therapy, early eGFR declines (>30% within 30 days) were less frequent in individuals with higher KDIGO risk compared with lower risk. Overall, the safety profile of combination therapy remained consistent across all KDIGO risk categories, with no unexpected safety signals. The CONFIDENCE trial demonstrates that the relative efficacy and safety of simultaneous finerenone and empagliflozin combination therapy are consistent across a wide spectrum of predicted kidney disease risk. NCT05254002; EudraCT 2021-003037-11.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The CONFIDENCE (COmbinatioN effect of FInerenone anD EmpaglifloziN in participants with CKD and type 2 diabetes using a UACR Endpoint) trial investigated the safety and efficacy of simultaneously initiating finerenone and empagliflozin for patients with chronic kidney disease (CKD) and type 2 diabetes. This prespecified analysis aimed to determine if the predicted risk of kidney disease progression, based on KDIGO risk categories, influenced the benefits and safety of this combination therapy."
        },
        {
          "label": "METHODS",
          "text": "The double-blind, double-dummy trial randomized 818 adults with CKD and type 2 diabetes [urine albumin-creatinine ratio (UACR) ≥100 to <5000 mg/g] to receive once-daily finerenone plus empagliflozin, finerenone alone or empagliflozin alone, all in addition to a renin-angiotensin system inhibitor. The relative change in UACR from baseline to day 180 (primary endpoint) and a >30% reduction in UACR (secondary endpoint) across KDIGO risk categories was assessed."
        },
        {
          "label": "RESULTS",
          "text": "At baseline, among 781 with available data, 11.3% of participants were classified as low/moderate risk, 29.6% as high risk and 59.2% as very high risk. At 180 days, combination therapy significantly reduced UACR levels across all KDIGO risk categories (low/moderate: -61.7%; high: -60.7%; very high: -52.4%). This reduction was consistently greater than that achieved with either monotherapy alone. More than half of patients on combination therapy experienced UACR reductions of >30% (low/moderate: 58.1%; high: 74.2%; very high: 70.6%), again outperforming monotherapies across all risk groups. While hyperkalemia was more common with combination therapy, early eGFR declines (>30% within 30 days) were less frequent in individuals with higher KDIGO risk compared with lower risk. Overall, the safety profile of combination therapy remained consistent across all KDIGO risk categories, with no unexpected safety signals."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The CONFIDENCE trial demonstrates that the relative efficacy and safety of simultaneous finerenone and empagliflozin combination therapy are consistent across a wide spectrum of predicted kidney disease risk."
        },
        {
          "label": "CLINICAL TRIAL REGISTRATION",
          "text": "NCT05254002; EudraCT 2021-003037-11."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886054/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1093/ndt/gfaf160",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Finerenone and empagliflozin combination therapy shows consistent effectiveness and safety in treating kidney disease across various risk levels."
    },
    {
      "id": "a61b588d7919",
      "title": "Occurrence of Psychosis and Bipolar Disorder in Individuals With Attention-Deficit/Hyperactivity Disorder Treated With Stimulants: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48190384/117577",
      "abstract": "Individuals with attention-deficit/hyperactivity disorder (ADHD) may present with psychosis or bipolar disorder (BD) following treatment with stimulants. The extent to which this occurs is currently unclear. To meta-analytically quantify the occurrence of psychosis or BD after exposure to stimulants in individuals with ADHD and assess possible moderating factors. PubMed, Web of Science, Ovid/PsycINFO, and Cochrane Central Register of Reviews were searched from inception until October 1, 2024, without language restrictions. Studies of any design with DSM or International Classification of Diseases-defined ADHD populations exposed to stimulants, where psychosis or BD outcomes were evaluated. PRISMA Preferred Reporting Items for Systematic Reviews and Meta-analyses and MOOSE Meta-analysis of Observational Studies in Epidemiology guidelines were followed, the protocol was registered, and the Newcastle-Ottawa scale and Cochrane risk of bias-2 tool were used for quality appraisal. Random-effects meta-analysis, subgroup analyses, and meta-regressions were conducted. For the proportion of individuals developing psychotic symptoms, psychotic disorders, and BD, effect sizes are reported as percentages with 95% CIs. For the comparison between amphetamines and methylphenidate, effect sizes are presented as odds ratios with 95% CIs. Sixteen studies (N = 391 043; mean [range] age, 12.6 [8.5-31.1] years; 288 199 [73.7%] male) were eligible. Among individuals with ADHD prescribed stimulants, 2.76% (95% CI, 0.73-9.88; k = 10; n = 237 035), 2.29% (95% CI, 1.52-3.40; k = 4; n = 91 437), and 3.72% (95% CI, 0.77-16.05; k = 4; n = 92 945) developed psychotic symptoms, a psychotic disorder, and BD, respectively. Heterogeneity across the studies was significant (I2 > 95%). Psychosis occurrence risk was significantly higher in individuals exposed to amphetamines than to methylphenidate (odds ratio [OR], 1.57, 95% CI, 1.15-2.16; k = 3, n = 231 325). Subgroup analyses showed significantly higher prevalence of psychotic symptoms in studies from North America and in those with longer follow-up periods. Increased psychosis occurrence was associated with a higher proportion of female participants, smaller sample sizes, and higher dose of stimulants. This systematic review and meta-analysis found a nonnegligible occurrence of psychotic symptoms, psychotic disorders, or BD in individuals with ADHD treated with stimulants. Amphetamines were associated with higher occurrence compared to methylphenidate. The included studies cannot establish causality, highlighting the need for further research, including randomized clinical trials and mirror-image studies comparing individuals exposed and not exposed to stimulants. Nonetheless, clinicians should inform patients about the increased occurrence of psychosis or BD when discussing stimulant pharmacotherapy and systematically monitor for these conditions throughout treatment.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Individuals with attention-deficit/hyperactivity disorder (ADHD) may present with psychosis or bipolar disorder (BD) following treatment with stimulants. The extent to which this occurs is currently unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To meta-analytically quantify the occurrence of psychosis or BD after exposure to stimulants in individuals with ADHD and assess possible moderating factors."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, Web of Science, Ovid/PsycINFO, and Cochrane Central Register of Reviews were searched from inception until October 1, 2024, without language restrictions."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Studies of any design with DSM or International Classification of Diseases-defined ADHD populations exposed to stimulants, where psychosis or BD outcomes were evaluated."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "PRISMA Preferred Reporting Items for Systematic Reviews and Meta-analyses and MOOSE Meta-analysis of Observational Studies in Epidemiology guidelines were followed, the protocol was registered, and the Newcastle-Ottawa scale and Cochrane risk of bias-2 tool were used for quality appraisal. Random-effects meta-analysis, subgroup analyses, and meta-regressions were conducted."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "For the proportion of individuals developing psychotic symptoms, psychotic disorders, and BD, effect sizes are reported as percentages with 95% CIs. For the comparison between amphetamines and methylphenidate, effect sizes are presented as odds ratios with 95% CIs."
        },
        {
          "label": "RESULTS",
          "text": "Sixteen studies (N = 391 043; mean [range] age, 12.6 [8.5-31.1] years; 288 199 [73.7%] male) were eligible. Among individuals with ADHD prescribed stimulants, 2.76% (95% CI, 0.73-9.88; k = 10; n = 237 035), 2.29% (95% CI, 1.52-3.40; k = 4; n = 91 437), and 3.72% (95% CI, 0.77-16.05; k = 4; n = 92 945) developed psychotic symptoms, a psychotic disorder, and BD, respectively. Heterogeneity across the studies was significant (I2 > 95%). Psychosis occurrence risk was significantly higher in individuals exposed to amphetamines than to methylphenidate (odds ratio [OR], 1.57, 95% CI, 1.15-2.16; k = 3, n = 231 325). Subgroup analyses showed significantly higher prevalence of psychotic symptoms in studies from North America and in those with longer follow-up periods. Increased psychosis occurrence was associated with a higher proportion of female participants, smaller sample sizes, and higher dose of stimulants."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review and meta-analysis found a nonnegligible occurrence of psychotic symptoms, psychotic disorders, or BD in individuals with ADHD treated with stimulants. Amphetamines were associated with higher occurrence compared to methylphenidate. The included studies cannot establish causality, highlighting the need for further research, including randomized clinical trials and mirror-image studies comparing individuals exposed and not exposed to stimulants. Nonetheless, clinicians should inform patients about the increased occurrence of psychosis or BD when discussing stimulant pharmacotherapy and systematically monitor for these conditions throughout treatment."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40900605/",
      "pubDate": "2025 Sep 03",
      "doi": "10.1001/jamapsychiatry.2025.2311",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Stimulant treatment for ADHD is associated with an increased occurrence of psychotic symptoms, psychotic disorders, or bipolar disorder, with amphetamines potentially posing a higher risk than methylphenidate, thus requiring patient education and monitoring."
    },
    {
      "id": "c8b1840e3c96",
      "title": "Different Acupuncture Treatments for Myofascial Pain Syndrome in Neck or Shoulder: A Network Meta-Analysis Based on Randomized Controlled Trials.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48190384/117575",
      "abstract": "Myofascial Pain Syndrome (MPS) is a prevalent musculoskeletal condition. Acupuncture therapy demonstrates significant advantages due to its unique mechanism of action. However, there are notable discrepancies in the evidence levels among various acupuncture therapies, and direct comparative data between different treatments remain scarce. Randomized controlled trials (RCTs) investigating acupuncture therapy for MPS in Neck or shoulder were systematically retrieved from CNKI, Wanfang, VIP, CBM, PubMed, EMbase, Cochrane Library, and Web of Science up to April 30, 2025. Network Meta-analysis was conducted using Stata 16.0. This study included 29 RCTs, involving a total of 2424 patients. Thirteen types of interventions were evaluated in the experimental groups: Fu's subcutaneous needling, Internal heat acupuncture, Electroacupuncture, Round-point needle, Needle knife, Moxibustion, Sunken cord, Acupoint injection, Conventional acupuncture + Moxibustion, Conventional acupuncture + Bloodletting, Conventional acupuncture + Traditional Chinese Medicine (TCM), Conventional acupuncture + Tuina, and Conventional acupuncture + Exercise. Regarding the Visual Analog Scale (VAS) scores:The top three therapies based on the Surface Under the Cumulative Ranking Curve (SUCRA) values were Moxibustion (0.84), Internal heat acupuncture (0.84), and Conventional acupuncture + Moxibustion (0.79). In terms of efficacy, based on the SUCRA rankings for both outcome indicators, Internal heat acupuncture was identified as having the best overall effect. Based on the findings of this study, multiple acupuncture methods exhibit significant advantages over conventional acupuncture. Comprehensive analysis indicates that Internal heat acupuncture has the most favorable therapeutic effect.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Myofascial Pain Syndrome (MPS) is a prevalent musculoskeletal condition. Acupuncture therapy demonstrates significant advantages due to its unique mechanism of action. However, there are notable discrepancies in the evidence levels among various acupuncture therapies, and direct comparative data between different treatments remain scarce."
        },
        {
          "label": "METHODS",
          "text": "Randomized controlled trials (RCTs) investigating acupuncture therapy for MPS in Neck or shoulder were systematically retrieved from CNKI, Wanfang, VIP, CBM, PubMed, EMbase, Cochrane Library, and Web of Science up to April 30, 2025. Network Meta-analysis was conducted using Stata 16.0."
        },
        {
          "label": "RESULTS",
          "text": "This study included 29 RCTs, involving a total of 2424 patients. Thirteen types of interventions were evaluated in the experimental groups: Fu's subcutaneous needling, Internal heat acupuncture, Electroacupuncture, Round-point needle, Needle knife, Moxibustion, Sunken cord, Acupoint injection, Conventional acupuncture + Moxibustion, Conventional acupuncture + Bloodletting, Conventional acupuncture + Traditional Chinese Medicine (TCM), Conventional acupuncture + Tuina, and Conventional acupuncture + Exercise. Regarding the Visual Analog Scale (VAS) scores:The top three therapies based on the Surface Under the Cumulative Ranking Curve (SUCRA) values were Moxibustion (0.84), Internal heat acupuncture (0.84), and Conventional acupuncture + Moxibustion (0.79). In terms of efficacy, based on the SUCRA rankings for both outcome indicators, Internal heat acupuncture was identified as having the best overall effect."
        },
        {
          "label": "CONCLUSION",
          "text": "Based on the findings of this study, multiple acupuncture methods exhibit significant advantages over conventional acupuncture. Comprehensive analysis indicates that Internal heat acupuncture has the most favorable therapeutic effect."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40893120/",
      "pubDate": "2025",
      "doi": "10.2147/JPR.S543756",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Internal heat acupuncture demonstrates the most beneficial therapeutic effects compared to conventional and other acupuncture methods."
    },
    {
      "id": "5bad65312270",
      "title": "Efficacy and Safety of Baxdrostat in Uncontrolled and Resistant Hypertension.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48190384/117566",
      "abstract": "Aldosterone dysregulation plays an important pathogenic role in hard-to-control hypertension. In several studies, baxdrostat, an aldosterone synthase inhibitor, reduced the seated systolic blood pressure of patients with uncontrolled or resistant hypertension. In this phase 3, multinational, double-blind, randomized, placebo-controlled trial, we recruited patients with a seated systolic blood pressure of between 140 mm Hg and less than 170 mm Hg despite the receipt of stable treatment with two antihypertensive medications (uncontrolled hypertension) or three or more such medications (resistant hypertension), including a diuretic. After a 2-week placebo run-in period, we randomly assigned patients with a seated systolic blood pressure of 135 mm Hg or more in a 1:1:1 ratio to receive baxdrostat at a dose of 1 mg, baxdrostat at a dose of 2 mg, or placebo once daily for 12 weeks. The primary end point was the change in seated systolic blood pressure from baseline to week 12. A total of 796 patients underwent randomization and 794 received 1-mg baxdrostat (264 patients), 2-mg baxdrostat (266 patients), or placebo (264 patients) in addition to background therapy. At 12 weeks, the change from baseline in the least-squares mean seated systolic blood pressure was -14.5 mm Hg (95% confidence interval [CI], -16.5 to -12.5) with 1-mg baxdrostat, -15.7 mm Hg (95% CI, -17.6 to -13.7) with 2-mg baxdrostat, and -5.8 mm Hg (95% CI, -7.9 to -3.8) with placebo. The estimated difference from placebo (placebo-corrected difference) was -8.7 mm Hg (95% CI, -11.5 to -5.8) with 1-mg baxdrostat and -9.8 mm Hg (95% CI, -12.6 to -7.0) with 2-mg baxdrostat (P<0.001 for both comparisons). A potassium level of more than 6.0 mmol per liter was reported in 6 patients (2.3%) with 1-mg baxdrostat, in 8 patients (3.0%) with 2-mg baxdrostat, and in 1 patient (0.4%) with placebo. Among patients with uncontrolled or resistant hypertension, the addition of baxdrostat to background therapy resulted in a significantly lower seated systolic blood pressure at 12 weeks than placebo. (Funded by AstraZeneca and others; BaxHTN ClinicalTrials.gov number, NCT06034743.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Aldosterone dysregulation plays an important pathogenic role in hard-to-control hypertension. In several studies, baxdrostat, an aldosterone synthase inhibitor, reduced the seated systolic blood pressure of patients with uncontrolled or resistant hypertension."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3, multinational, double-blind, randomized, placebo-controlled trial, we recruited patients with a seated systolic blood pressure of between 140 mm Hg and less than 170 mm Hg despite the receipt of stable treatment with two antihypertensive medications (uncontrolled hypertension) or three or more such medications (resistant hypertension), including a diuretic. After a 2-week placebo run-in period, we randomly assigned patients with a seated systolic blood pressure of 135 mm Hg or more in a 1:1:1 ratio to receive baxdrostat at a dose of 1 mg, baxdrostat at a dose of 2 mg, or placebo once daily for 12 weeks. The primary end point was the change in seated systolic blood pressure from baseline to week 12."
        },
        {
          "label": "RESULTS",
          "text": "A total of 796 patients underwent randomization and 794 received 1-mg baxdrostat (264 patients), 2-mg baxdrostat (266 patients), or placebo (264 patients) in addition to background therapy. At 12 weeks, the change from baseline in the least-squares mean seated systolic blood pressure was -14.5 mm Hg (95% confidence interval [CI], -16.5 to -12.5) with 1-mg baxdrostat, -15.7 mm Hg (95% CI, -17.6 to -13.7) with 2-mg baxdrostat, and -5.8 mm Hg (95% CI, -7.9 to -3.8) with placebo. The estimated difference from placebo (placebo-corrected difference) was -8.7 mm Hg (95% CI, -11.5 to -5.8) with 1-mg baxdrostat and -9.8 mm Hg (95% CI, -12.6 to -7.0) with 2-mg baxdrostat (P<0.001 for both comparisons). A potassium level of more than 6.0 mmol per liter was reported in 6 patients (2.3%) with 1-mg baxdrostat, in 8 patients (3.0%) with 2-mg baxdrostat, and in 1 patient (0.4%) with placebo."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with uncontrolled or resistant hypertension, the addition of baxdrostat to background therapy resulted in a significantly lower seated systolic blood pressure at 12 weeks than placebo. (Funded by AstraZeneca and others; BaxHTN ClinicalTrials.gov number, NCT06034743.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888730/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1056/NEJMoa2507109",
      "dateReceived": "2025-09-24T23:23:12.478Z",
      "isNew": true,
      "summary": "Baxdrostat effectively lowered seated systolic blood pressure in patients with uncontrolled or resistant hypertension compared to placebo after 12 weeks."
    },
    {
      "id": "2d53b8f40906",
      "title": "Parent-focused behavioural interventions for the prevention of early childhood obesity (TOPCHILD): a systematic review and individual participant data meta-analysis.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48243185/117602",
      "abstract": "Childhood obesity is a global public health issue, which has prompted governments to invest in prevention programmes. We aimed to investigate the effectiveness of parent-focused early childhood obesity prevention interventions globally. We did a systematic review and individual participant data meta-analysis. We searched databases and trial registries (MEDLINE, Embase, CENTRAL, CINAHL, PsycInfo, ClinicalTrials.gov, and WHO International Clinical Trials Registry Platform) from inception until Sept 30, 2024, for randomised controlled trials commencing before 12 months of age examining parent-focused behavioural interventions to prevent obesity in children, compared with usual care, no intervention, or attention control. Individual participant data were checked, harmonised, and assessed for integrity and risk of bias. We excluded trials that were quasi-randomised, investigated pregnancy-only interventions, or did not collect any child weight-related outcomes. The primary outcome was BMI Z score at age 24 months (±6 months). We did an intention-to-treat, two-stage, random effects meta-analysis to examine effects overall and for prespecified subgroups. We assessed certainty of evidence using Grading of Recommendations Assessment, Development, and Evaluation. This study is registered with PROSPERO, CRD42020177408. Of 19 990 identified records, 47 (0·24%) trials were completed and eligible. Of these, 18 (38%) assessed our primary outcome, BMI Z score. We obtained individual participant data for 17 (94%; n=9128) of these 18 trials (n=9383), representing 97% of eligible participants. Of these 9128 participants, 4549 (50%) were boys, 4415 (48%) were girls, and 164 (2%) had unknown sex. We found no evidence of an effect of interventions on BMI Z score at age 24 months (±6 months; mean difference -0·01 [95% CI -0·08 to 0·05]; high certainty evidence, τ=0·01; n=6505; 2623 missing). Findings were robust to prespecified sensitivity analyses (eg, different analysis methods and missing data), and we found no evidence of differential intervention effects for prespecified subgroups including priority populations and trial-level factors. These findings indicate that examined parent-focused behavioural interventions are insufficient to prevent obesity at age 24 months (±6 months). This evidence highlights a need to re-think childhood obesity prevention approaches. Australian National Health and Medical Research Council.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Childhood obesity is a global public health issue, which has prompted governments to invest in prevention programmes. We aimed to investigate the effectiveness of parent-focused early childhood obesity prevention interventions globally."
        },
        {
          "label": "METHODS",
          "text": "We did a systematic review and individual participant data meta-analysis. We searched databases and trial registries (MEDLINE, Embase, CENTRAL, CINAHL, PsycInfo, ClinicalTrials.gov, and WHO International Clinical Trials Registry Platform) from inception until Sept 30, 2024, for randomised controlled trials commencing before 12 months of age examining parent-focused behavioural interventions to prevent obesity in children, compared with usual care, no intervention, or attention control. Individual participant data were checked, harmonised, and assessed for integrity and risk of bias. We excluded trials that were quasi-randomised, investigated pregnancy-only interventions, or did not collect any child weight-related outcomes. The primary outcome was BMI Z score at age 24 months (±6 months). We did an intention-to-treat, two-stage, random effects meta-analysis to examine effects overall and for prespecified subgroups. We assessed certainty of evidence using Grading of Recommendations Assessment, Development, and Evaluation. This study is registered with PROSPERO, CRD42020177408."
        },
        {
          "label": "FINDINGS",
          "text": "Of 19 990 identified records, 47 (0·24%) trials were completed and eligible. Of these, 18 (38%) assessed our primary outcome, BMI Z score. We obtained individual participant data for 17 (94%; n=9128) of these 18 trials (n=9383), representing 97% of eligible participants. Of these 9128 participants, 4549 (50%) were boys, 4415 (48%) were girls, and 164 (2%) had unknown sex. We found no evidence of an effect of interventions on BMI Z score at age 24 months (±6 months; mean difference -0·01 [95% CI -0·08 to 0·05]; high certainty evidence, τ=0·01; n=6505; 2623 missing). Findings were robust to prespecified sensitivity analyses (eg, different analysis methods and missing data), and we found no evidence of differential intervention effects for prespecified subgroups including priority populations and trial-level factors."
        },
        {
          "label": "INTERPRETATION",
          "text": "These findings indicate that examined parent-focused behavioural interventions are insufficient to prevent obesity at age 24 months (±6 months). This evidence highlights a need to re-think childhood obesity prevention approaches."
        },
        {
          "label": "FUNDING",
          "text": "Australian National Health and Medical Research Council."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40945528/",
      "pubDate": "2025 Sep 20",
      "doi": "10.1016/S0140-6736(25)01144-4",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Parent-focused behavioral interventions to prevent childhood obesity showed no significant impact on BMI Z score at 24 months."
    },
    {
      "id": "074741b0c3a3",
      "title": "Cost-Effectiveness of Regular Surveillance Versus Endoscopy at Need for Patients With Barrett`s Esophagus: Economic Evaluation Alongside the Barrett`s Oesophagus Surveillance Study (BOSS) Randomized Controlled Trial.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117589",
      "abstract": "The Barrett's Oesophagus Surveillance Study (BOSS) was the first randomized study of surveillance. This study reports the costs and quality of life outcomes from the BOSS trial and models the outcomes and cost-effectiveness of surveillance beyond the follow-up period of the BOSS study. This trial showed similar stages and rates of esophageal cancer in both arms, but the regular surveillance arm did identify more high-grade dysplasia after a median of 12.8 years follow-up. We used a decision tree model based on results from BOSS to conduct a cost-effectiveness analysis of costs and quality-adjusted life years (QALYs). A Markov model was used to extrapolate costs and outcomes over a further 10 years after the trial had ended, representing a 22.8-year time horizon. The proportion with high-grade dysplasia and QALYs was derived from the randomized trial. The total costs associated with 2-yearly surveillance was $5309 vs $3182 in the at-need arm. Total QALYs in the 2-yearly endoscopy arm were 8.647 compared with 8.629 in the at-need arm. Compared with at-need endoscopy, 2-yearly surveillance costs $115,563/QALY gained. In the sensitivity analyses around assumptions on the proportion of high-grade dysplasia that is undetected in the at-need endoscopy arm, surveillance had an incremental cost effectiveness ratio of $94,513/QALY for the best-case and $146,272/QALY for the worst-case scenario. Barrett's esophagus surveillance every 2 to 3 years is unlikely to be a cost-effective strategy. Guidelines should take this into account when deciding surveillance intervals.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "The Barrett's Oesophagus Surveillance Study (BOSS) was the first randomized study of surveillance. This study reports the costs and quality of life outcomes from the BOSS trial and models the outcomes and cost-effectiveness of surveillance beyond the follow-up period of the BOSS study. This trial showed similar stages and rates of esophageal cancer in both arms, but the regular surveillance arm did identify more high-grade dysplasia after a median of 12.8 years follow-up."
        },
        {
          "label": "METHODS",
          "text": "We used a decision tree model based on results from BOSS to conduct a cost-effectiveness analysis of costs and quality-adjusted life years (QALYs). A Markov model was used to extrapolate costs and outcomes over a further 10 years after the trial had ended, representing a 22.8-year time horizon. The proportion with high-grade dysplasia and QALYs was derived from the randomized trial."
        },
        {
          "label": "RESULTS",
          "text": "The total costs associated with 2-yearly surveillance was $5309 vs $3182 in the at-need arm. Total QALYs in the 2-yearly endoscopy arm were 8.647 compared with 8.629 in the at-need arm. Compared with at-need endoscopy, 2-yearly surveillance costs $115,563/QALY gained. In the sensitivity analyses around assumptions on the proportion of high-grade dysplasia that is undetected in the at-need endoscopy arm, surveillance had an incremental cost effectiveness ratio of $94,513/QALY for the best-case and $146,272/QALY for the worst-case scenario."
        },
        {
          "label": "CONCLUSION",
          "text": "Barrett's esophagus surveillance every 2 to 3 years is unlikely to be a cost-effective strategy. Guidelines should take this into account when deciding surveillance intervals."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40383306/",
      "pubDate": "2025 May 16",
      "doi": "10.1053/j.gastro.2025.04.026",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Surveillance for Barrett's esophagus every 2 to 3 years is likely not cost-effective, and guidelines should reflect this."
    },
    {
      "id": "addf100797d5",
      "title": "One Dose versus Three Doses of Benzathine Penicillin G in Early Syphilis.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117569",
      "abstract": "Controversy persists regarding the appropriate duration of therapy with benzathine penicillin G in persons with early (i.e., primary, secondary, or early latent) syphilis ( infection). In a multicenter, randomized, controlled, noninferiority trial, we assigned persons who had early syphilis, with or without human immunodeficiency virus (HIV) infection, to receive intramuscular injections of benzathine penicillin G in a one-time dose of 2.4 million units or in doses of 2.4 million units administered at three successive weekly intervals. The primary end point was seroreversion to nonreactive status or a decrease in the rapid plasma reagin titer by two or more dilutions at 6 months, referred to here as a serologic response (noninferiority margin, 10 percentage points). A key secondary end point was a serologic response within subgroups defined according to HIV status, also assessed in a noninferiority analysis. A total of 249 persons with early syphilis were enrolled. Most participants were men (97%), 62% were Black, and 153 (61%) were living with HIV infection. The distribution according to syphilis stage was 19% with primary syphilis, 47% with secondary syphilis, and 33% with early latent syphilis. The percentage of participants with a serologic response at 6 months was 76% (95% confidence interval [CI], 68 to 82) in the single-dose group and 70% (95% CI, 61 to 77) in the three-dose group (difference, -6 percentage points; 90% CI, -15 to 3, indicating noninferiority). No clinical relapse or treatment failure occurred in either group. In the one-dose group, a serologic response at 6 months was observed in 76% of participants who had HIV infection and 76% of those who did not, and in the three-dose group, a serologic response at 6 months was observed in 71% of participants who had HIV infection and 70% of those who did not. Most participants in each group had local injection-site pain and tenderness with treatment (76% with a single dose and 85% with three doses). Treatment with one dose of 2.4 million units of benzathine penicillin G was noninferior to treatment with three doses with regard to serologic response 6 months after treatment. (Funded by the National Institute of Allergy and Infectious Diseases; ClinicalTrials.gov number, NCT03637660.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Controversy persists regarding the appropriate duration of therapy with benzathine penicillin G in persons with early (i.e., primary, secondary, or early latent) syphilis ( infection)."
        },
        {
          "label": "METHODS",
          "text": "In a multicenter, randomized, controlled, noninferiority trial, we assigned persons who had early syphilis, with or without human immunodeficiency virus (HIV) infection, to receive intramuscular injections of benzathine penicillin G in a one-time dose of 2.4 million units or in doses of 2.4 million units administered at three successive weekly intervals. The primary end point was seroreversion to nonreactive status or a decrease in the rapid plasma reagin titer by two or more dilutions at 6 months, referred to here as a serologic response (noninferiority margin, 10 percentage points). A key secondary end point was a serologic response within subgroups defined according to HIV status, also assessed in a noninferiority analysis."
        },
        {
          "label": "RESULTS",
          "text": "A total of 249 persons with early syphilis were enrolled. Most participants were men (97%), 62% were Black, and 153 (61%) were living with HIV infection. The distribution according to syphilis stage was 19% with primary syphilis, 47% with secondary syphilis, and 33% with early latent syphilis. The percentage of participants with a serologic response at 6 months was 76% (95% confidence interval [CI], 68 to 82) in the single-dose group and 70% (95% CI, 61 to 77) in the three-dose group (difference, -6 percentage points; 90% CI, -15 to 3, indicating noninferiority). No clinical relapse or treatment failure occurred in either group. In the one-dose group, a serologic response at 6 months was observed in 76% of participants who had HIV infection and 76% of those who did not, and in the three-dose group, a serologic response at 6 months was observed in 71% of participants who had HIV infection and 70% of those who did not. Most participants in each group had local injection-site pain and tenderness with treatment (76% with a single dose and 85% with three doses)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Treatment with one dose of 2.4 million units of benzathine penicillin G was noninferior to treatment with three doses with regard to serologic response 6 months after treatment. (Funded by the National Institute of Allergy and Infectious Diseases; ClinicalTrials.gov number, NCT03637660.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40902161/",
      "pubDate": "2025 Sep 04",
      "doi": "10.1056/NEJMoa2401802",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "A single dose of benzathine penicillin G is as effective as three doses in treating syphilis, based on antibody response six months later."
    },
    {
      "id": "f39cb682da43",
      "title": "Early insulin degludec with continuous intravenous insulin infusion in the management of diabetic ketoacidosis: A randomized controlled trial.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117564",
      "abstract": "To determine the effectiveness and safety of early combination therapy with insulin degludec and intravenous insulin infusion (IVII) compared with IVII alone in diabetic ketoacidosis (DKA) management. This prospective, open-label, randomised controlled trial included 80 adults (≥18 years) with DKA. Participants were randomised to either the intervention group, which received early subcutaneous (SC) insulin degludec (0.3 units/kg SC within 3 h of diagnosis) plus standard IVII, or the control group, which received standard IVII alone. The primary outcome was time to DKA resolution. Secondary outcomes included rebound hyperglycaemia, rebound DKA, hypoglycaemia, hypokalaemia, length of hospital stay (LOS), and in-hospital mortality. Eighty patients were enrolled; 67.5% of participants had type 2 diabetes. Baseline characteristics were comparable between groups. DKA resolution was significantly faster in the early degludec group by 3.25 h (7.75 h, IQR 6.00-9.00 h vs. 11.00 h, IQR 6.25-15.00; p = 0.039). At 72 h after transition to SC insulin, mean capillary blood glucose (CBG) was significantly lower with early degludec (213.9 ± 25.8 mg/dL vs. 240.1 ± 42.0 mg/dL; p = 0.012). Rates of rebound hyperglycaemia at 12 h after bridging, mean CBG levels at 12, 24, and 48 h among those with rebound hyperglycaemia, as well as rates of rebound DKA, hypoglycaemia, hypokalaemia, LOS, and in-hospital mortality, were not significantly different between groups. Early administration of SC insulin degludec in combination with IVII accelerated DKA resolution and improved blood glucose levels at 72 h in patients with rebound hyperglycaemia after discontinuation of IVII, without increasing the risk of hypoglycaemia or hypokalaemia.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To determine the effectiveness and safety of early combination therapy with insulin degludec and intravenous insulin infusion (IVII) compared with IVII alone in diabetic ketoacidosis (DKA) management."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "This prospective, open-label, randomised controlled trial included 80 adults (≥18 years) with DKA. Participants were randomised to either the intervention group, which received early subcutaneous (SC) insulin degludec (0.3 units/kg SC within 3 h of diagnosis) plus standard IVII, or the control group, which received standard IVII alone. The primary outcome was time to DKA resolution. Secondary outcomes included rebound hyperglycaemia, rebound DKA, hypoglycaemia, hypokalaemia, length of hospital stay (LOS), and in-hospital mortality."
        },
        {
          "label": "RESULTS",
          "text": "Eighty patients were enrolled; 67.5% of participants had type 2 diabetes. Baseline characteristics were comparable between groups. DKA resolution was significantly faster in the early degludec group by 3.25 h (7.75 h, IQR 6.00-9.00 h vs. 11.00 h, IQR 6.25-15.00; p = 0.039). At 72 h after transition to SC insulin, mean capillary blood glucose (CBG) was significantly lower with early degludec (213.9 ± 25.8 mg/dL vs. 240.1 ± 42.0 mg/dL; p = 0.012). Rates of rebound hyperglycaemia at 12 h after bridging, mean CBG levels at 12, 24, and 48 h among those with rebound hyperglycaemia, as well as rates of rebound DKA, hypoglycaemia, hypokalaemia, LOS, and in-hospital mortality, were not significantly different between groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Early administration of SC insulin degludec in combination with IVII accelerated DKA resolution and improved blood glucose levels at 72 h in patients with rebound hyperglycaemia after discontinuation of IVII, without increasing the risk of hypoglycaemia or hypokalaemia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40903851/",
      "pubDate": "2025 Sep 03",
      "doi": "10.1111/dom.70101",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Subcutaneous insulin degludec, given early alongside intravenous insulin infusion, effectively resolves diabetic ketoacidosis rebound hyperglycemia without increasing the risk of low blood sugar or low potassium."
    },
    {
      "id": "dc8474ef0e3c",
      "title": "Efficacy and safety of once-weekly subcutaneous semaglutide 2.4 mg for the management of overweight or obesity in Asian populations: A systematic review, meta-analysis and meta-regression of randomised trials.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117560",
      "abstract": "The rising prevalence of overweight and obesity among Asian populations poses a critical public health concern. Semaglutide 2.4 mg, a glucagon-like peptide-1 receptor agonist, has demonstrated promising weight-reduction effects in global populations, but its efficacy and safety profile in Asians remain less comprehensively examined. This meta-analysis aimed to evaluate the effectiveness and tolerability of semaglutide 2.4 mg compared to placebo in Asian individuals with overweight or obesity. A systematic literature search was conducted in Medline, ScienceDirect, Europe pubMed central (PMC) and the Cochrane Library up to 15 June 2025. Eligible studies were randomised controlled trials (RCTs) comparing semaglutide 2.4 mg with placebo in overweight or obese Asian individuals. Risk of bias was evaluated using the Cochrane Risk of Bias v2 tool. Pooled outcomes were analysed using random-effects models to estimate mean differences (MDs) and odds ratios, and heterogeneity was assessed with the I statistic. Five RCTs involving 2614 participants met the inclusion criteria. All trials were deemed to have a low risk of bias. Our meta-analysis indicated that treatment with semaglutide 2.4 mg resulted in significantly greater reductions in body weight (MD: -8.20%; 95% confidence interval [CI]: -10.06 to -6.35; I = 84%), waist circumference (MD: -6.47 cm; 95% CI: -8.26 to -4.68; I = 84%), body mass index (MD: -3.22 kg/m; 95% CI: -4.01 to -2.44; I = 66%) and systolic blood pressure (MD: -3.46 mmHg; 95% CI: -5.29 to -1.62; I = 28%) compared to placebo. A higher proportion of participants in semaglutide 2.4 mg achieved weight loss exceeding 5%, 10% and 15%. Gastrointestinal symptoms were the most commonly reported adverse effects, generally mild to moderate and self-limiting. Semaglutide 2.4 mg significantly improves weight-related and cardiometabolic outcomes in Asian adults with overweight or obesity. Further studies are warranted to assess long-term effects, real-world applicability and variability across subpopulations.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "The rising prevalence of overweight and obesity among Asian populations poses a critical public health concern. Semaglutide 2.4 mg, a glucagon-like peptide-1 receptor agonist, has demonstrated promising weight-reduction effects in global populations, but its efficacy and safety profile in Asians remain less comprehensively examined. This meta-analysis aimed to evaluate the effectiveness and tolerability of semaglutide 2.4 mg compared to placebo in Asian individuals with overweight or obesity."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "A systematic literature search was conducted in Medline, ScienceDirect, Europe pubMed central (PMC) and the Cochrane Library up to 15 June 2025. Eligible studies were randomised controlled trials (RCTs) comparing semaglutide 2.4 mg with placebo in overweight or obese Asian individuals. Risk of bias was evaluated using the Cochrane Risk of Bias v2 tool. Pooled outcomes were analysed using random-effects models to estimate mean differences (MDs) and odds ratios, and heterogeneity was assessed with the I statistic."
        },
        {
          "label": "RESULTS",
          "text": "Five RCTs involving 2614 participants met the inclusion criteria. All trials were deemed to have a low risk of bias. Our meta-analysis indicated that treatment with semaglutide 2.4 mg resulted in significantly greater reductions in body weight (MD: -8.20%; 95% confidence interval [CI]: -10.06 to -6.35; I = 84%), waist circumference (MD: -6.47 cm; 95% CI: -8.26 to -4.68; I = 84%), body mass index (MD: -3.22 kg/m; 95% CI: -4.01 to -2.44; I = 66%) and systolic blood pressure (MD: -3.46 mmHg; 95% CI: -5.29 to -1.62; I = 28%) compared to placebo. A higher proportion of participants in semaglutide 2.4 mg achieved weight loss exceeding 5%, 10% and 15%. Gastrointestinal symptoms were the most commonly reported adverse effects, generally mild to moderate and self-limiting."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Semaglutide 2.4 mg significantly improves weight-related and cardiometabolic outcomes in Asian adults with overweight or obesity. Further studies are warranted to assess long-term effects, real-world applicability and variability across subpopulations."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40859897/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1111/dom.70073",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Semaglutide 2.4 mg effectively improves weight and heart health markers in overweight or obese Asian adults."
    },
    {
      "id": "9b3d5ef57378",
      "title": "Combined liraglutide and metformin therapy in overweight or obese women with polycystic ovary syndrome: A systematic review and meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117559",
      "abstract": "Overweight or obese women with polycystic ovary syndrome (PCOS) often experience significant metabolic and hormonal disturbances. This systematic review and meta-analysis evaluated whether liraglutide combined with metformin is more effective than metformin alone in improving glycaemic control, lipid metabolism, body mass index (BMI) and sex hormone profiles in this population. We systematically searched PubMed, EMBASE, the Cochrane Library, China National Knowledge Infrastructure, Weipu, SinoMed and Wanfang Data for randomised controlled trials (RCTs) comparing liraglutide plus metformin to metformin monotherapy in overweight or obese women with PCOS. Primary outcomes included fasting plasma glucose (FPG), 2-h postprandial glucose, HbA1c, fasting insulin, homeostasis model assessment of insulin resistance (HOMA-IR), BMI, sex hormones (luteinising hormone [LH], follicle-stimulating hormone [FSH], total testosterone [TT]) and lipid profiles (total cholesterol [TC], triglycerides [TG], low-density lipoprotein cholesterol [LDL-C] and high-density lipoprotein cholesterol [HDL-C]). Subgroup analyses were conducted by treatment duration, lifestyle intervention and baseline BMI. A total of 19 RCTs involving 1657 women with PCOS were included. Compared to metformin alone, the combination of liraglutide and metformin significantly improved glycaemic metabolism: FPG (standard mean difference = -1.92, 95% confidence interval [CI] [-2.43, -1.41]; I = 95%), 2-h postprandial glucose (-2.87, [-3.70, -2.05]; 97%), HbA1c (-2.91, [-3.84, -1.98]; 96%), HOMA-IR (-2.29, [-2.98, -1.60]; 97%) and fasting insulin (-0.75, [-1.41, -0.09]; 94%). BMI was also significantly reduced (-1.64, [-2.38, -0.89]; 97%). Hormonal indicators improved, including LH (-1.48, [-1.83, -1.14]; 85%), FSH (-1.17, [-1.62, -0.73]; 92%) and TT (-0.66, [-1.30, -0.03]; 95%). In terms of lipid metabolism, reductions were observed in TC (-2.34, [-3.67, -1.01]; 98%), TG (-0.58, [-0.96, -0.21]; 79%) and LDL-C (-0.79, [-1.36, -0.22]; 91%), while HDL-C increased (0.67, [0.21, 1.13]; 83%). Longer treatment duration (≥16 weeks) and lack of lifestyle intervention were associated with greater improvements in insulin resistance and hormone levels. Lipid outcomes were consistent across subgroups, while glycaemic improvements were more notable in overweight versus obese women. Sensitivity analyses supported the robustness of findings. However, the overall certainty of evidence was low due to risk of bias and heterogeneity. The combination of liraglutide and metformin resulted in greater improvements in body weight, blood sugar levels, insulin sensitivity, hormone balance (including LH, FSH and testosterone) and cholesterol profiles. These findings indicate that the combined therapy offers more comprehensive metabolic and hormonal benefits than metformin alone for women with PCOS.",
      "structuredAbstract": [
        {
          "label": "PURPOSE",
          "text": "Overweight or obese women with polycystic ovary syndrome (PCOS) often experience significant metabolic and hormonal disturbances. This systematic review and meta-analysis evaluated whether liraglutide combined with metformin is more effective than metformin alone in improving glycaemic control, lipid metabolism, body mass index (BMI) and sex hormone profiles in this population."
        },
        {
          "label": "METHODS",
          "text": "We systematically searched PubMed, EMBASE, the Cochrane Library, China National Knowledge Infrastructure, Weipu, SinoMed and Wanfang Data for randomised controlled trials (RCTs) comparing liraglutide plus metformin to metformin monotherapy in overweight or obese women with PCOS. Primary outcomes included fasting plasma glucose (FPG), 2-h postprandial glucose, HbA1c, fasting insulin, homeostasis model assessment of insulin resistance (HOMA-IR), BMI, sex hormones (luteinising hormone [LH], follicle-stimulating hormone [FSH], total testosterone [TT]) and lipid profiles (total cholesterol [TC], triglycerides [TG], low-density lipoprotein cholesterol [LDL-C] and high-density lipoprotein cholesterol [HDL-C]). Subgroup analyses were conducted by treatment duration, lifestyle intervention and baseline BMI."
        },
        {
          "label": "RESULTS",
          "text": "A total of 19 RCTs involving 1657 women with PCOS were included. Compared to metformin alone, the combination of liraglutide and metformin significantly improved glycaemic metabolism: FPG (standard mean difference = -1.92, 95% confidence interval [CI] [-2.43, -1.41]; I = 95%), 2-h postprandial glucose (-2.87, [-3.70, -2.05]; 97%), HbA1c (-2.91, [-3.84, -1.98]; 96%), HOMA-IR (-2.29, [-2.98, -1.60]; 97%) and fasting insulin (-0.75, [-1.41, -0.09]; 94%). BMI was also significantly reduced (-1.64, [-2.38, -0.89]; 97%). Hormonal indicators improved, including LH (-1.48, [-1.83, -1.14]; 85%), FSH (-1.17, [-1.62, -0.73]; 92%) and TT (-0.66, [-1.30, -0.03]; 95%). In terms of lipid metabolism, reductions were observed in TC (-2.34, [-3.67, -1.01]; 98%), TG (-0.58, [-0.96, -0.21]; 79%) and LDL-C (-0.79, [-1.36, -0.22]; 91%), while HDL-C increased (0.67, [0.21, 1.13]; 83%). Longer treatment duration (≥16 weeks) and lack of lifestyle intervention were associated with greater improvements in insulin resistance and hormone levels. Lipid outcomes were consistent across subgroups, while glycaemic improvements were more notable in overweight versus obese women. Sensitivity analyses supported the robustness of findings. However, the overall certainty of evidence was low due to risk of bias and heterogeneity."
        },
        {
          "label": "CONCLUSION",
          "text": "The combination of liraglutide and metformin resulted in greater improvements in body weight, blood sugar levels, insulin sensitivity, hormone balance (including LH, FSH and testosterone) and cholesterol profiles. These findings indicate that the combined therapy offers more comprehensive metabolic and hormonal benefits than metformin alone for women with PCOS."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40855964/",
      "pubDate": "2025 Aug 26",
      "doi": "10.1111/dom.70028",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Liraglutide and metformin together improved weight, blood sugar, insulin sensitivity, hormone levels, and cholesterol more effectively than metformin alone in women with PCOS."
    },
    {
      "id": "5bef5c1eafce",
      "title": "Time Course of Morbidity and Mortality Across Echocardiographic Phenotypes in Patients With Sepsis: A Systematic Review and Meta-Analysis.",
      "journal": "Crit Care Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117556",
      "abstract": "To determine the temporal evolution of morbidity and mortality across different echocardiographic phenotypes of new-onset myocardial dysfunction in patients with sepsis. PubMed, Embase, Web of Science, MEDLINE, the Cochrane Central Register of Controlled Trials, and Google Scholar were searched up to October 1, 2024. All original studies related to new-onset myocardial dysfunction diagnosed by echocardiography in adult patients with sepsis were included. Data were collected according to the predefined outcomes. This systematic review included 65 studies from 18 regions, involving 17,008 patients with sepsis. The meta-analysis encompassed three echocardiographic phenotypes, namely left ventricular systolic dysfunction (LVSD), left ventricular diastolic dysfunction (LVDD), and right ventricular dysfunction (RVD), as well as four subgroups based on different echocardiographic time points. No patients had cardiac dysfunction at baseline, and the occurrence rate of heart dysfunction declined to a minimal level during the recovery phase. The occurrence rate of LVSD peaked at 33% (95% CI, 27-40%) within 48 hours and declined to 22% (95% CI, 18-25%) within 72 hours. The occurrence rate of LVDD rose to 46% (95% CI, 34-57%) within 48 hours and dropped to 44% (95% CI, 32-56%) within 72 hours. The occurrence rate of RVD peaked at 47% (95% CI, 37-58%) within 48 hours and decreased to 33% (95% CI, 3-75%) within 72 hours. Patients with LVSD, LVDD, or RVD showed a higher risk of death (LVSD: relative risk [RR], 1.57 [95% CI, 1.29-1.91], p < 0.0001; LVDD: RR, 1.36 [95% CI, 1.05-1.75], p = 0.02; and RVD: RR, 1.62 [95% CI, 1.35-1.95], p < 0.0001). This meta-analysis shows a parabolic-like pattern of the occurrence rate of echocardiographic phenotypes (LVSD, LVDD, and RVD) over the time course of sepsis. LVSD, LVDD, and RVD are significant risk factors for mortality in sepsis.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To determine the temporal evolution of morbidity and mortality across different echocardiographic phenotypes of new-onset myocardial dysfunction in patients with sepsis."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, Embase, Web of Science, MEDLINE, the Cochrane Central Register of Controlled Trials, and Google Scholar were searched up to October 1, 2024."
        },
        {
          "label": "STUDY SELECTION",
          "text": "All original studies related to new-onset myocardial dysfunction diagnosed by echocardiography in adult patients with sepsis were included."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Data were collected according to the predefined outcomes."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "This systematic review included 65 studies from 18 regions, involving 17,008 patients with sepsis. The meta-analysis encompassed three echocardiographic phenotypes, namely left ventricular systolic dysfunction (LVSD), left ventricular diastolic dysfunction (LVDD), and right ventricular dysfunction (RVD), as well as four subgroups based on different echocardiographic time points. No patients had cardiac dysfunction at baseline, and the occurrence rate of heart dysfunction declined to a minimal level during the recovery phase. The occurrence rate of LVSD peaked at 33% (95% CI, 27-40%) within 48 hours and declined to 22% (95% CI, 18-25%) within 72 hours. The occurrence rate of LVDD rose to 46% (95% CI, 34-57%) within 48 hours and dropped to 44% (95% CI, 32-56%) within 72 hours. The occurrence rate of RVD peaked at 47% (95% CI, 37-58%) within 48 hours and decreased to 33% (95% CI, 3-75%) within 72 hours. Patients with LVSD, LVDD, or RVD showed a higher risk of death (LVSD: relative risk [RR], 1.57 [95% CI, 1.29-1.91], p < 0.0001; LVDD: RR, 1.36 [95% CI, 1.05-1.75], p = 0.02; and RVD: RR, 1.62 [95% CI, 1.35-1.95], p < 0.0001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This meta-analysis shows a parabolic-like pattern of the occurrence rate of echocardiographic phenotypes (LVSD, LVDD, and RVD) over the time course of sepsis. LVSD, LVDD, and RVD are significant risk factors for mortality in sepsis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40853197/",
      "pubDate": "2025 Aug 25",
      "doi": "10.1097/CCM.0000000000006844",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Left ventricular systolic dysfunction, left ventricular diastolic dysfunction, and right ventricular dysfunction are significant risk factors for mortality in sepsis."
    },
    {
      "id": "8123c25817f2",
      "title": "Immediate versus staged complete revascularisation during index admission in patients with ST-segment elevation myocardial infarction and multivessel disease (OPTION-STEMI): a multicentre, non-inferiority, open-label, randomised trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117548",
      "abstract": "The optimal timing of complete revascularisation for patients with ST-segment elevation myocardial infarction (STEMI) and multivessel coronary artery disease remains unclear. We aimed to assess whether immediate complete revascularisation was non-inferior to staged complete revascularisation during the index admission. We conducted an open-label, randomised, non-inferiority trial at 14 hospitals in South Korea. Patients aged 19 years or older with STEMI and multivessel disease who had undergone percutaneous coronary intervention (PCI) for a culprit lesion were randomly assigned 1:1 to immediate complete revascularisation (PCI for non-culprit lesions during the index procedure) or staged complete revascularisation (non-culprit PCI on another day during the index admission). Web-based, permuted-block randomisation (using mixed block sizes of two or four) was implemented at each participating centre to allocate patients. Non-culprit lesions with 50-69% stenosis were evaluated by fractional flow reserve. Study participants and study investigators were aware of treatment allocation, but members of the independent clinical committee reviewing primary and secondary endpoints were masked to treatment allocation. The primary endpoint was a composite of death from any cause, non-fatal myocardial infarction, or any unplanned revascularisation at 1 year in the intention-to-treat population, and the non-inferiority margin was set at a hazard ratio (HR) of 1·42; if the upper boundary of the one-sided 97·5% CI of the HR was less than 1·42, immediate complete revascularisation would be considered non-inferior to staged complete revascularisation. Reported adverse events consisted of procedural complications, other complications during admission, and in-hospital clinical events occurring during the index admission. This trial is registered with the Clinical Research Information Service (KCT0004457) and ClinicalTrials.gov (NCT04626882). Long-term follow-up is ongoing. Between Dec 30, 2019, and Jan 15, 2024, 994 patients were enrolled and randomly assigned to immediate revascularisation (n=498; immediate group) or staged revascularisation (n=496; staged group). The primary endpoint occurred at 1 year in 65 patients (13%) in the immediate group and 53 patients (11%) in the staged group (HR 1·24 [95% CI 0·86-1·79]; p=0·24). Rates of stroke, major bleeding, and contrast-induced nephropathy did not differ significantly between the two groups. Cardiogenic shock during the index hospitalisation occurred in 18 (4%) of 498 patients in the immediate group and nine (2%) of 496 patients in the staged complete revascularisation group. Among patients with STEMI and multivessel disease, immediate complete revascularisation was not shown to be non-inferior to staged complete revascularisation during the index admission in terms of incidence of a composite of death from any cause, non-fatal myocardial infarction, or any unplanned revascularisation at 1 year. This finding might inform future clinical guidelines on the role and optimal use of immediate complete revascularisation during the index admission. Boston Scientific.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The optimal timing of complete revascularisation for patients with ST-segment elevation myocardial infarction (STEMI) and multivessel coronary artery disease remains unclear. We aimed to assess whether immediate complete revascularisation was non-inferior to staged complete revascularisation during the index admission."
        },
        {
          "label": "METHODS",
          "text": "We conducted an open-label, randomised, non-inferiority trial at 14 hospitals in South Korea. Patients aged 19 years or older with STEMI and multivessel disease who had undergone percutaneous coronary intervention (PCI) for a culprit lesion were randomly assigned 1:1 to immediate complete revascularisation (PCI for non-culprit lesions during the index procedure) or staged complete revascularisation (non-culprit PCI on another day during the index admission). Web-based, permuted-block randomisation (using mixed block sizes of two or four) was implemented at each participating centre to allocate patients. Non-culprit lesions with 50-69% stenosis were evaluated by fractional flow reserve. Study participants and study investigators were aware of treatment allocation, but members of the independent clinical committee reviewing primary and secondary endpoints were masked to treatment allocation. The primary endpoint was a composite of death from any cause, non-fatal myocardial infarction, or any unplanned revascularisation at 1 year in the intention-to-treat population, and the non-inferiority margin was set at a hazard ratio (HR) of 1·42; if the upper boundary of the one-sided 97·5% CI of the HR was less than 1·42, immediate complete revascularisation would be considered non-inferior to staged complete revascularisation. Reported adverse events consisted of procedural complications, other complications during admission, and in-hospital clinical events occurring during the index admission. This trial is registered with the Clinical Research Information Service (KCT0004457) and ClinicalTrials.gov (NCT04626882). Long-term follow-up is ongoing."
        },
        {
          "label": "FINDINGS",
          "text": "Between Dec 30, 2019, and Jan 15, 2024, 994 patients were enrolled and randomly assigned to immediate revascularisation (n=498; immediate group) or staged revascularisation (n=496; staged group). The primary endpoint occurred at 1 year in 65 patients (13%) in the immediate group and 53 patients (11%) in the staged group (HR 1·24 [95% CI 0·86-1·79]; p=0·24). Rates of stroke, major bleeding, and contrast-induced nephropathy did not differ significantly between the two groups. Cardiogenic shock during the index hospitalisation occurred in 18 (4%) of 498 patients in the immediate group and nine (2%) of 496 patients in the staged complete revascularisation group."
        },
        {
          "label": "INTERPRETATION",
          "text": "Among patients with STEMI and multivessel disease, immediate complete revascularisation was not shown to be non-inferior to staged complete revascularisation during the index admission in terms of incidence of a composite of death from any cause, non-fatal myocardial infarction, or any unplanned revascularisation at 1 year. This finding might inform future clinical guidelines on the role and optimal use of immediate complete revascularisation during the index admission."
        },
        {
          "label": "FUNDING",
          "text": "Boston Scientific."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40902612/",
      "pubDate": "2025 Sep 06",
      "doi": "10.1016/S0140-6736(25)01529-6",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "Immediate complete revascularization for STEMI patients with multivessel disease was non-inferior to staged complete revascularization."
    },
    {
      "id": "cf2c2f7e2e62",
      "title": "beta blockers after myocardial infarction with mildly reduced ejection fraction: an individual patient data meta-analysis of randomised controlled trials.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117534",
      "abstract": "The effects of β-blocker therapy on clinical outcomes in patients with myocardial infarction and mildly reduced (40-49%) left ventricular ejection fraction (LVEF) are largely unknown. Four recently conducted randomised trials tested the efficacy of β blockers after a recent myocardial infarction in patients without reduced LVEF (LVEF ≥40%). However, none were individually powered to assess these effects in the subgroup of patients with mildly reduced LVEF. We aimed to assess the efficacy of β blockers in patients with myocardial infarction and mildly reduced LVEF during the index hospitalisation. We conducted an individual patient-level meta-analysis of patients with mildly reduced LVEF and no history or signs of heart failure from four recent clinical trials. These studies were included because they were randomised controlled trials testing long-term effects (median follow-up >1 year) of oral β-blocker therapy in patients who recently had a myocardial infarction (randomisation within 14 days) and had mildly reduced LVEF. No further studies were found in a systematic review (Jan 1, 2020 to June 26, 2025). A one-stage, fixed-effects, Cox proportional hazards regression model was used to assess the treatment effect of β blockers on the predefined primary composite endpoint of all-cause death, new myocardial infarction, or heart failure. All endpoints were independently adjudicated. This meta-analysis was registered with PROSPERO (CRD420251023480). 1885 patients with myocardial infarction and mildly reduced LVEF were included in the meta-analysis: 979 from the REBOOT trial, 422 from the BETAMI trial, 430 from the DANBLOCK trial, and 54 from the CAPITAL-RCT trial. Overall, 991 patients were assigned to β blockers and 894 to control (no β blockers). The primary composite endpoint occurred in 106 patients (32·6 events per 1000 patient-years) in the β-blocker group and 129 patients (43·0 per 1000 patient-years) in the no β-blocker group (hazard ratio 0·75 [95% CI 0·58-0·97]; p=0·031). No heterogeneity between the trials (trial-by-treatment p=0·95) or between countries of enrolment was observed (p=0·98). In patients with acute myocardial infarction with mildly reduced LVEF without history or clinical signs of heart failure, β-blocker therapy was associated with a reduction in the composite of all-cause death, new myocardial infarction, or heart failure. These results extend the known benefits of these agents in patients with myocardial infarction with reduced LVEF to the subgroup with mildly reduced LVEF. Centro Nacional de Investigaciones Cardiovasculares Carlos III (CNIC), Danish Heart Foundation, Novo Nordisk Foundation, South-Eastern Norway Regional Health Authority, and Research Council of Norway.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The effects of β-blocker therapy on clinical outcomes in patients with myocardial infarction and mildly reduced (40-49%) left ventricular ejection fraction (LVEF) are largely unknown. Four recently conducted randomised trials tested the efficacy of β blockers after a recent myocardial infarction in patients without reduced LVEF (LVEF ≥40%). However, none were individually powered to assess these effects in the subgroup of patients with mildly reduced LVEF. We aimed to assess the efficacy of β blockers in patients with myocardial infarction and mildly reduced LVEF during the index hospitalisation."
        },
        {
          "label": "METHODS",
          "text": "We conducted an individual patient-level meta-analysis of patients with mildly reduced LVEF and no history or signs of heart failure from four recent clinical trials. These studies were included because they were randomised controlled trials testing long-term effects (median follow-up >1 year) of oral β-blocker therapy in patients who recently had a myocardial infarction (randomisation within 14 days) and had mildly reduced LVEF. No further studies were found in a systematic review (Jan 1, 2020 to June 26, 2025). A one-stage, fixed-effects, Cox proportional hazards regression model was used to assess the treatment effect of β blockers on the predefined primary composite endpoint of all-cause death, new myocardial infarction, or heart failure. All endpoints were independently adjudicated. This meta-analysis was registered with PROSPERO (CRD420251023480)."
        },
        {
          "label": "FINDINGS",
          "text": "1885 patients with myocardial infarction and mildly reduced LVEF were included in the meta-analysis: 979 from the REBOOT trial, 422 from the BETAMI trial, 430 from the DANBLOCK trial, and 54 from the CAPITAL-RCT trial. Overall, 991 patients were assigned to β blockers and 894 to control (no β blockers). The primary composite endpoint occurred in 106 patients (32·6 events per 1000 patient-years) in the β-blocker group and 129 patients (43·0 per 1000 patient-years) in the no β-blocker group (hazard ratio 0·75 [95% CI 0·58-0·97]; p=0·031). No heterogeneity between the trials (trial-by-treatment p=0·95) or between countries of enrolment was observed (p=0·98)."
        },
        {
          "label": "INTERPRETATION",
          "text": "In patients with acute myocardial infarction with mildly reduced LVEF without history or clinical signs of heart failure, β-blocker therapy was associated with a reduction in the composite of all-cause death, new myocardial infarction, or heart failure. These results extend the known benefits of these agents in patients with myocardial infarction with reduced LVEF to the subgroup with mildly reduced LVEF."
        },
        {
          "label": "FUNDING",
          "text": "Centro Nacional de Investigaciones Cardiovasculares Carlos III (CNIC), Danish Heart Foundation, Novo Nordisk Foundation, South-Eastern Norway Regional Health Authority, and Research Council of Norway."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40897190/",
      "pubDate": "2025 Sep 13",
      "doi": "10.1016/S0140-6736(25)01592-2",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "In patients with a heart attack and mildly reduced heart pumping function, beta-blocker therapy reduced the risk of death, new heart attack, or heart failure compared to no beta-blocker therapy."
    },
    {
      "id": "de20ddb9a863",
      "title": "Linked color imaging versus conventional white-light colonoscopy for the detection of colorectal polyps.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117514",
      "abstract": "Early detection of colorectal polyps using colonoscopy is important for preventing post-colonoscopy colorectal cancer (PCCRC) because a 1% increase in adenoma detection rate (ADR) is associated with a 3% decrease in PCCRC incidence. Linked color imaging (LCI) enhances color contrast compared to white-light imaging (WLI), potentially improving ADR. Existing reviews provide promising yet inconclusive findings on LCI's benefits, highlighting the need for this systematic review. To assess the benefits and harms of LCI compared to WLI colonoscopy in detecting colorectal polyps in people requiring colonoscopy for screening, symptoms, or surveillance. We searched CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the World Health Organization International Clinical Trials Registry Platform from 2014 to 30 May 2025. We screened the reference lists of relevant review articles and current treatment guidelines to identify additional studies. We contacted the study authors in case of any missing data. We included randomized controlled trials (RCTs) comparing LCI and WLI. We excluded non-RCTs. We included adults 18 years of age and older who required colonoscopy for screening, symptom assessment, and surveillance in any healthcare setting. The critical outcomes were ADR during the study period, proportion of participants with PCCRC at next scheduled follow-up colonoscopy, and proportion of adverse events requiring medical treatment during the study period. Important outcomes were polyp detection rate and sessile serrated lesion detection rate during the study period, numbers of adenomas, polyps, and flat polyps per participant at the end of a single colonoscopy, and all adverse events during the study period. Two authors assessed study risk of bias using version two of the Cochrane tool for assessing risk of bias in randomized trials (RoB 2). We synthesized results for each outcome using random-effects meta-analysis, calculating risk ratios (RRs) for dichotomous outcomes and mean differences (MDs) for continuous outcomes, each with 95% confidence intervals (CIs), using Review Manager. Where meta-analysis was not possible due to data heterogeneity or insufficient reporting, we applied the Synthesis Without Meta-analysis (SWiM) approach. We used GRADE to assess the certainty of the evidence. We included 16 trials, with 12,836 participants. Nine trials focused on screening/surveillance and seven on screening and symptomatic patients. We judged six trials as being at low risk of bias overall. Critical outcomes LCI slightly increases ADR compared to WLI (RR 1.18, 95% CI 1.10 to 1.28; 15 RCTs, 12,877 participants; high-certainty evidence). No study reported the proportion of participants with PCCRC. There were no adverse events requiring medical treatment (6 RCTs, 5240 participants; moderate-certainty evidence). Important outcomes LCI slightly increases polyp detection rate (RR 1.14, 95% CI 1.09 to 1.19; 12 RCTs, 11,243 participants; high-certainty evidence), and likely increases sessile serrated lesion detection rate (RR 1.61, 95% CI 1.31 to 1.98; 7 RCTs, 8605 participants; moderate-certainty evidence), and the number of adenomas per participant (MD 0.18, 95% CI 0.03 to 0.32; 11 RCTs, 10,833 participants; moderate-certainty evidence). A key limitation of the evidence was imprecision for sessile serrated lesion detection and number of adenomas per participant due to small sample sizes. Similarly, zero events were reported for adverse events requiring medical treatment, limiting precision despite adequate sample sizes. Additionally, no study reported the proportion of participants with PCCRC, further restricting our conclusions. We found high-certainty evidence that LCI slightly increases ADR and moderate-certainty evidence that LCI likely results in little to no difference in the proportion of adverse events requiring medical treatment; data on the proportion of participants with PCCRC are unavailable. We also found high-certainty evidence that LCI slightly improves polyp detection rate and moderate-certainty evidence that LCI likely increases sessile serrated lesion detection rate and the number of adenomas and polyps per participant. Further studies should focus on measuring clinically significant outcomes, such as the proportion of participants with PCCRC. This study had no dedicated funding. Protocol available via DOI 10.1002/14651858.CD015476.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Early detection of colorectal polyps using colonoscopy is important for preventing post-colonoscopy colorectal cancer (PCCRC) because a 1% increase in adenoma detection rate (ADR) is associated with a 3% decrease in PCCRC incidence. Linked color imaging (LCI) enhances color contrast compared to white-light imaging (WLI), potentially improving ADR. Existing reviews provide promising yet inconclusive findings on LCI's benefits, highlighting the need for this systematic review."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of LCI compared to WLI colonoscopy in detecting colorectal polyps in people requiring colonoscopy for screening, symptoms, or surveillance."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the World Health Organization International Clinical Trials Registry Platform from 2014 to 30 May 2025. We screened the reference lists of relevant review articles and current treatment guidelines to identify additional studies. We contacted the study authors in case of any missing data."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) comparing LCI and WLI. We excluded non-RCTs. We included adults 18 years of age and older who required colonoscopy for screening, symptom assessment, and surveillance in any healthcare setting."
        },
        {
          "label": "OUTCOMES",
          "text": "The critical outcomes were ADR during the study period, proportion of participants with PCCRC at next scheduled follow-up colonoscopy, and proportion of adverse events requiring medical treatment during the study period. Important outcomes were polyp detection rate and sessile serrated lesion detection rate during the study period, numbers of adenomas, polyps, and flat polyps per participant at the end of a single colonoscopy, and all adverse events during the study period."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two authors assessed study risk of bias using version two of the Cochrane tool for assessing risk of bias in randomized trials (RoB 2)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesized results for each outcome using random-effects meta-analysis, calculating risk ratios (RRs) for dichotomous outcomes and mean differences (MDs) for continuous outcomes, each with 95% confidence intervals (CIs), using Review Manager. Where meta-analysis was not possible due to data heterogeneity or insufficient reporting, we applied the Synthesis Without Meta-analysis (SWiM) approach. We used GRADE to assess the certainty of the evidence."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 16 trials, with 12,836 participants. Nine trials focused on screening/surveillance and seven on screening and symptomatic patients. We judged six trials as being at low risk of bias overall."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Critical outcomes LCI slightly increases ADR compared to WLI (RR 1.18, 95% CI 1.10 to 1.28; 15 RCTs, 12,877 participants; high-certainty evidence). No study reported the proportion of participants with PCCRC. There were no adverse events requiring medical treatment (6 RCTs, 5240 participants; moderate-certainty evidence). Important outcomes LCI slightly increases polyp detection rate (RR 1.14, 95% CI 1.09 to 1.19; 12 RCTs, 11,243 participants; high-certainty evidence), and likely increases sessile serrated lesion detection rate (RR 1.61, 95% CI 1.31 to 1.98; 7 RCTs, 8605 participants; moderate-certainty evidence), and the number of adenomas per participant (MD 0.18, 95% CI 0.03 to 0.32; 11 RCTs, 10,833 participants; moderate-certainty evidence). A key limitation of the evidence was imprecision for sessile serrated lesion detection and number of adenomas per participant due to small sample sizes. Similarly, zero events were reported for adverse events requiring medical treatment, limiting precision despite adequate sample sizes. Additionally, no study reported the proportion of participants with PCCRC, further restricting our conclusions."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "We found high-certainty evidence that LCI slightly increases ADR and moderate-certainty evidence that LCI likely results in little to no difference in the proportion of adverse events requiring medical treatment; data on the proportion of participants with PCCRC are unavailable. We also found high-certainty evidence that LCI slightly improves polyp detection rate and moderate-certainty evidence that LCI likely increases sessile serrated lesion detection rate and the number of adenomas and polyps per participant. Further studies should focus on measuring clinically significant outcomes, such as the proportion of participants with PCCRC."
        },
        {
          "label": "FUNDING",
          "text": "This study had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via DOI 10.1002/14651858.CD015476."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40827602/",
      "pubDate": "2025 Aug 19",
      "doi": "10.1002/14651858.CD015476.pub2",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false,
      "summary": "LCI slightly increases adverse drug reactions and improves polyp detection, but its impact on adverse events requiring medical treatment and the proportion of participants with post-colonoscopy colorectal cancer (PCCRC) is uncertain."
    },
    {
      "id": "b8cf8f5c67eb",
      "title": "The clinical effectiveness of clarithromycin versus endoscopic sinus surgery for adults with chronic rhinosinusitis with and without nasal polyps (MACRO): a pragmatic, multicentre, three-arm, randomised, placebo-controlled phase 4 trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Surgery - Ear Nose Throat"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48173814/117504",
      "dateReceived": "2025-09-23T23:22:00.831Z",
      "isNew": false
    },
    {
      "id": "841fd1d73fbe",
      "title": "Home-Based Care for Hypertension in Rural South Africa.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48243185/117614",
      "abstract": "Poorly controlled hypertension is a common problem worldwide, particularly in low-resource settings. We conducted an open-label, randomized, controlled trial of a home-based model of hypertension care in South Africa. Adults with hypertension were assigned to receive home-based care, which consisted of patient monitoring of blood pressure, home visits from a community health worker (CHW) for data collection and medication delivery, and remote nurse-led decision making supported by a mobile application (CHW group); enhanced home-based care, which consisted of the same intervention but with blood-pressure machines transmitting readings automatically (enhanced CHW group); or standard care with clinic-based management (standard-care group). The primary outcome was the systolic blood pressure at 6 months. Secondary outcomes were the systolic blood pressure at 12 months and hypertension control at 6 and 12 months. Safety outcomes included adverse events, deaths, and retention in care. A total of 774 adults underwent randomization. The mean age was 62 years; 76.0% of the participants were women, 13.6% had diabetes mellitus, and 46.5% had human immunodeficiency virus infection. The mean systolic blood pressure at 6 months was lower in the CHW group than in the standard-care group (difference, -7.9 mm Hg; 95% confidence interval [CI], -10.5 to -5.3; P<0.001) and was also lower in the enhanced CHW group than in the standard-care group (difference, -9.1 mm Hg; 95% CI, -11.7 to -6.4; P<0.001). The percentage of participants with hypertension control at 6 months was 57.6% in the standard-care group, as compared with 76.9% in the CHW group (relative risk, 1.33; 95% CI, 1.18 to 1.51) and 82.8% in the enhanced CHW group (relative risk, 1.44; 95% CI, 1.28 to 1.62). The improvements in systolic blood pressure and hypertension control with home-based care appeared to persist at 12 months. Severe adverse events and deaths occurred in 2.7% and 1.0% of the participants, respectively, and occurred in a similar percentage of participants across trial groups. Retention in care was observed in more than 95% of the participants in the CHW and enhanced CHW groups. In South Africa, home-based hypertension care led to a significantly lower mean systolic blood pressure at 6 months than standard, clinic-based care. (Supported by the National Institutes of Health and others; IMPACT-BP ClinicalTrials.gov number, NCT05492955; South African National Clinical Trials Register number, DOH-27-112022-4895.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Poorly controlled hypertension is a common problem worldwide, particularly in low-resource settings."
        },
        {
          "label": "METHODS",
          "text": "We conducted an open-label, randomized, controlled trial of a home-based model of hypertension care in South Africa. Adults with hypertension were assigned to receive home-based care, which consisted of patient monitoring of blood pressure, home visits from a community health worker (CHW) for data collection and medication delivery, and remote nurse-led decision making supported by a mobile application (CHW group); enhanced home-based care, which consisted of the same intervention but with blood-pressure machines transmitting readings automatically (enhanced CHW group); or standard care with clinic-based management (standard-care group). The primary outcome was the systolic blood pressure at 6 months. Secondary outcomes were the systolic blood pressure at 12 months and hypertension control at 6 and 12 months. Safety outcomes included adverse events, deaths, and retention in care."
        },
        {
          "label": "RESULTS",
          "text": "A total of 774 adults underwent randomization. The mean age was 62 years; 76.0% of the participants were women, 13.6% had diabetes mellitus, and 46.5% had human immunodeficiency virus infection. The mean systolic blood pressure at 6 months was lower in the CHW group than in the standard-care group (difference, -7.9 mm Hg; 95% confidence interval [CI], -10.5 to -5.3; P<0.001) and was also lower in the enhanced CHW group than in the standard-care group (difference, -9.1 mm Hg; 95% CI, -11.7 to -6.4; P<0.001). The percentage of participants with hypertension control at 6 months was 57.6% in the standard-care group, as compared with 76.9% in the CHW group (relative risk, 1.33; 95% CI, 1.18 to 1.51) and 82.8% in the enhanced CHW group (relative risk, 1.44; 95% CI, 1.28 to 1.62). The improvements in systolic blood pressure and hypertension control with home-based care appeared to persist at 12 months. Severe adverse events and deaths occurred in 2.7% and 1.0% of the participants, respectively, and occurred in a similar percentage of participants across trial groups. Retention in care was observed in more than 95% of the participants in the CHW and enhanced CHW groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In South Africa, home-based hypertension care led to a significantly lower mean systolic blood pressure at 6 months than standard, clinic-based care. (Supported by the National Institutes of Health and others; IMPACT-BP ClinicalTrials.gov number, NCT05492955; South African National Clinical Trials Register number, DOH-27-112022-4895.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888742/",
      "pubDate": "2025 Sep 01",
      "doi": "10.1056/NEJMoa2509958",
      "dateReceived": "2025-09-23T23:22:00.830Z",
      "isNew": false,
      "summary": "Home-based hypertension care in South Africa resulted in a statistically significant reduction in systolic blood pressure compared to standard clinic-based care after six months."
    },
    {
      "id": "9a53221083d4",
      "title": "Effects of antibiotic prophylaxis during labour on maternal and neonatal outcomes in women planning vaginal birth.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48166249/117570",
      "abstract": "Maternal sepsis is the third leading cause of maternal mortality globally. However, the risk of maternal sepsis can be reduced by administering antibiotics prophylactically before infection occurs. Previous research has assessed the effects of azithromycin prophylaxis during pregnancy, but evidence is lacking on the effects of other types of antibiotics, and the potential for antimicrobial resistance. To assess the effects of antibiotic prophylaxis in women in labour after 28 weeks' gestation on the prevention of maternal and neonatal infections and mortality. We used CENTRAL, MEDLINE, Embase, one other database, and two trial registries, together with reference checking, citation searching, and contact with study authors to identify eligible studies. We did not restrict the search by publication type or language. The latest search date was 30 July 2024. We included randomised controlled trials involving pregnant women in labour after 28 gestational weeks, comparing any antibiotic prophylaxis with placebo or no treatment. We included trials of women anticipating a vaginal delivery, irrespective of baseline risk factors (unselected, lower-risk, or higher-risk), and without an indication for antibiotic prophylaxis in any care setting. We excluded trials that enroled only women with a planned caesarean section or a known bacterial infection (such as group B Streptococcus), and trials evaluating antibiotics for treatment rather than prevention. Our key outcomes of interest, as presented in the summary of findings table, were: incidence of maternal sepsis, maternal mortality, neonatal sepsis, neonatal mortality, wound infection (perineal), adverse effects of antibiotics, and neonatal intensive care unit (NICU) admission. We used the revised Cochrane risk of bias tool for randomised trials (RoB 2) to assess the risk of bias. We synthesised results for each outcome using random-effects meta-analysis in Review Manager. Meta-analyses were conducted using the inverse-variance method for dichotomous and continuous outcomes. We used a narrative synthesis following the SWiM (Synthesis Without Meta-analysis) reporting guideline for outcomes that could not be pooled statistically due to heterogeneity or limited data. We summarised key findings from individual studies descriptively and structured by outcome domain. We used GRADE to assess the certainty of evidence for each outcome. We included four trials with 42,846 participants (21,501 in the intervention groups versus 21,345 in the control groups). All were individually randomised trials conducted in low- and middle-income countries. Three trials used a single oral dose of azithromycin in the intervention group, while the fourth used a combination of azithromycin and amoxicillin. All four trials used a placebo control. We judged three trials to have an overall low risk of bias, and the remaining trial to be at 'some concerns', due to reporting bias. Below, we report on the key outcomes of interest, as presented in the summary of findings table. Compared to placebo, any antibiotic use: • probably reduces maternal sepsis (1.8% in the placebo group versus 1.2% in the antibiotic group; risk ratio (RR) 0.65, 95% confidence interval (CI) 0.56 to 0.77; I = 0%; 4 studies, 42,430 participants; moderate-certainty evidence). • likely results in little to no difference in maternal mortality (RR 1.21, 95% CI 0.63 to 2.33; I² = 0%; 4 studies, 42,371 participants; moderate-certainty evidence). • results in little to no difference in neonatal sepsis (RR 1.03, 95% CI 0.96 to 1.10; I² = 0%; 4 studies, 42,862 participants; high-certainty evidence). • results in little to no difference in neonatal mortality (RR 1.03, 95% CI 0.87 to 1.21; I² = 0%; 4 studies, 42,678 participants; high-certainty evidence). • results in little to no difference in perineal wound infection (1.5% in the placebo group versus 1.0% in the antibiotic group; RR 0.80, 95% CI 0.64 to 0.99; 1 study, 25,114 participants; high-certainty evidence). • results in little to no difference in NICU admission (RR 1.03, 95% CI 0.94 to 1.12; I² not applicable; 1 study, 29,084 participants; high-certainty evidence). The evidence is very uncertain about the effects of antibiotic use on antimicrobial resistance (AMR). One trial showed higher short-term detection of azithromycin-resistant bacteria in some maternal samples, but no persisting differences at 11 to 13 months, while in neonates, AMR was rare (very low-certainty evidence). Offering a single oral dose of prophylactic antibiotics to pregnant women in labour after 28 gestational weeks or more probably reduces maternal sepsis. It likely results in little to no difference in maternal mortality, and results in little to no difference in neonatal sepsis, neonatal mortality, perineal wound infection, and NICU admission. Evidence on antimicrobial resistance is very uncertain: short-term increases in resistant organisms were observed in some maternal samples, but no persisting between-group differences were found at 11 to 13 months' follow-up. Implementation should be cautious and accompanied by antimicrobial stewardship and AMR surveillance, and future research should better quantify AMR effects and identify optimal antibiotic strategies. This work was partially funded by UNDP/UNFPA/UNICEF/WHO/World Bank Special Programme of Research, Development and Research Training in Human Reproduction (HRP), a co-sponsored programme executed by the World Health Organization (WHO) and partially supported by JST Grant Number JPMJPF2108. Registration: PROSPERO (2024) CRD42024582129.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Maternal sepsis is the third leading cause of maternal mortality globally. However, the risk of maternal sepsis can be reduced by administering antibiotics prophylactically before infection occurs. Previous research has assessed the effects of azithromycin prophylaxis during pregnancy, but evidence is lacking on the effects of other types of antibiotics, and the potential for antimicrobial resistance."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of antibiotic prophylaxis in women in labour after 28 weeks' gestation on the prevention of maternal and neonatal infections and mortality."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used CENTRAL, MEDLINE, Embase, one other database, and two trial registries, together with reference checking, citation searching, and contact with study authors to identify eligible studies. We did not restrict the search by publication type or language. The latest search date was 30 July 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials involving pregnant women in labour after 28 gestational weeks, comparing any antibiotic prophylaxis with placebo or no treatment. We included trials of women anticipating a vaginal delivery, irrespective of baseline risk factors (unselected, lower-risk, or higher-risk), and without an indication for antibiotic prophylaxis in any care setting. We excluded trials that enroled only women with a planned caesarean section or a known bacterial infection (such as group B Streptococcus), and trials evaluating antibiotics for treatment rather than prevention."
        },
        {
          "label": "OUTCOMES",
          "text": "Our key outcomes of interest, as presented in the summary of findings table, were: incidence of maternal sepsis, maternal mortality, neonatal sepsis, neonatal mortality, wound infection (perineal), adverse effects of antibiotics, and neonatal intensive care unit (NICU) admission."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the revised Cochrane risk of bias tool for randomised trials (RoB 2) to assess the risk of bias."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using random-effects meta-analysis in Review Manager. Meta-analyses were conducted using the inverse-variance method for dichotomous and continuous outcomes. We used a narrative synthesis following the SWiM (Synthesis Without Meta-analysis) reporting guideline for outcomes that could not be pooled statistically due to heterogeneity or limited data. We summarised key findings from individual studies descriptively and structured by outcome domain. We used GRADE to assess the certainty of evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included four trials with 42,846 participants (21,501 in the intervention groups versus 21,345 in the control groups). All were individually randomised trials conducted in low- and middle-income countries. Three trials used a single oral dose of azithromycin in the intervention group, while the fourth used a combination of azithromycin and amoxicillin. All four trials used a placebo control."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We judged three trials to have an overall low risk of bias, and the remaining trial to be at 'some concerns', due to reporting bias. Below, we report on the key outcomes of interest, as presented in the summary of findings table. Compared to placebo, any antibiotic use: • probably reduces maternal sepsis (1.8% in the placebo group versus 1.2% in the antibiotic group; risk ratio (RR) 0.65, 95% confidence interval (CI) 0.56 to 0.77; I = 0%; 4 studies, 42,430 participants; moderate-certainty evidence). • likely results in little to no difference in maternal mortality (RR 1.21, 95% CI 0.63 to 2.33; I² = 0%; 4 studies, 42,371 participants; moderate-certainty evidence). • results in little to no difference in neonatal sepsis (RR 1.03, 95% CI 0.96 to 1.10; I² = 0%; 4 studies, 42,862 participants; high-certainty evidence). • results in little to no difference in neonatal mortality (RR 1.03, 95% CI 0.87 to 1.21; I² = 0%; 4 studies, 42,678 participants; high-certainty evidence). • results in little to no difference in perineal wound infection (1.5% in the placebo group versus 1.0% in the antibiotic group; RR 0.80, 95% CI 0.64 to 0.99; 1 study, 25,114 participants; high-certainty evidence). • results in little to no difference in NICU admission (RR 1.03, 95% CI 0.94 to 1.12; I² not applicable; 1 study, 29,084 participants; high-certainty evidence). The evidence is very uncertain about the effects of antibiotic use on antimicrobial resistance (AMR). One trial showed higher short-term detection of azithromycin-resistant bacteria in some maternal samples, but no persisting differences at 11 to 13 months, while in neonates, AMR was rare (very low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Offering a single oral dose of prophylactic antibiotics to pregnant women in labour after 28 gestational weeks or more probably reduces maternal sepsis. It likely results in little to no difference in maternal mortality, and results in little to no difference in neonatal sepsis, neonatal mortality, perineal wound infection, and NICU admission. Evidence on antimicrobial resistance is very uncertain: short-term increases in resistant organisms were observed in some maternal samples, but no persisting between-group differences were found at 11 to 13 months' follow-up. Implementation should be cautious and accompanied by antimicrobial stewardship and AMR surveillance, and future research should better quantify AMR effects and identify optimal antibiotic strategies."
        },
        {
          "label": "FUNDING",
          "text": "This work was partially funded by UNDP/UNFPA/UNICEF/WHO/World Bank Special Programme of Research, Development and Research Training in Human Reproduction (HRP), a co-sponsored programme executed by the World Health Organization (WHO) and partially supported by JST Grant Number JPMJPF2108."
        },
        {
          "label": "REGISTRATION",
          "text": "Registration: PROSPERO (2024) CRD42024582129."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40856178/",
      "pubDate": "2025 Aug 26",
      "doi": "10.1002/14651858.CD016211",
      "dateReceived": "2025-09-22T23:22:21.514Z",
      "isNew": false,
      "summary": "A single oral dose of prophylactic antibiotics for pregnant women in labor after 28 weeks likely reduces maternal sepsis, with little impact on other adverse outcomes, but warrants cautious implementation due to uncertain effects on antimicrobial resistance."
    },
    {
      "id": "e7336ebcfbe5",
      "title": "Semaglutide Treatment of Antipsychotic-Treated Patients With Schizophrenia, Prediabetes, and Obesity: The HISTORI Randomized Clinical Trial.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Psychiatry",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48156232/117578",
      "abstract": "Patients with schizophrenia have reduced life expectancy due to cardiovascular disease and obesity-related type 2 diabetes, exacerbated by second-generation antipsychotic (SGA) medication. Existing interventions have shown limited effect. To assess the effect of the once-weekly glucagon-like peptide-1 receptor agonist semaglutide in SGA-treated adults (aged 18-60 years) with schizophrenia, prediabetes (glycosylated hemoglobin A1c [HbA1c], 5.7%-6.4% of total hemoglobin) (to convert HbA1c from percentage of total hemoglobin to mmol/mol, use the following formula: (HbA1c % - 2.152)/0.09148), and overweight or obesity (body mass index [BMI], calculated as weight in kilograms divided by height in meters squared, ≥27). This placebo-controlled, double-blinded randomized clinical trial was conducted from January 2022 to May 2024, with 30 weeks of follow-up, among regional community-based mental health services in 2 regions of Denmark (Region of Southern Denmark and Region of Zealand). SGA-treated patients with schizophrenia, prediabetes, and overweight or obesity were randomized to semaglutide or placebo. Data analysis was completed from May 2024 to January 2025. Once-weekly subcutaneous semaglutide or placebo for 30 weeks; semaglutide was titrated up to 1.0 mg/week over 8 weeks. The primary outcome was change in HbA1c. Secondary end points included changes in body weight, schizophrenia symptoms based on Positive and Negative Syndrome Scale 6 (PANSS-6) score, and physical and mental quality of life (QoL) (assessed via the 36-item Short Form Survey, version 2 [SF-36v2]). A total of 154 patients were recruited and randomized 1:1 to semaglutide or placebo (87 female participants (56.5%); mean [SD] age, 38.3 [10.7] years). Of 154 randomized patients, 141 (91.5%) completed the trial-74 of 77 patients randomized to semaglutide (96%) and 67 of 77 randomized to placebo (87%). Semaglutide reduced HbA1c by 0.46% of total hemoglobin (95% CI, -0.56% to -0.36%) and body weight by 9.21 kg (95% CI, -11.68 to -6.75). An HbA1c less than 5.7% of total hemoglobin was achieved in 81% vs 19% of patients treated with semaglutide and placebo, respectively (P < .001); improvements in high-density cholesterol by 10.81 mg/dL (95% CI, 2.70-18.53; P = .007) and triglycerides by -29.20 mg/dL (95% CI, -55.75 to 2.65; P = .03) (to convert to millimoles per liter, multiply by 0.0113) were also observed. Finally, semaglutide improved physical QoL by 3.75 points on the SF-36v2 (95% CI, 1.52-5.98; P = .001) but had no significant effect on mental QoL scores or PANSS-6 score. Gastrointestinal symptoms were more frequent in semaglutide-treated patients. A few semaglutide-treated patients were hospitalized more frequently than observed in the placebo-treated group, but the number of serious adverse effects did not differ between groups. In this multicenter, double-blinded randomized clinical trial, 30 weeks of administration of semaglutide, up to 1.0 mg/week, was safe, lowered blood glucose (as measured by HbA1c) and weight, and improved physical QoL in SGA-treated patients with schizophrenia, prediabetes, and obesity without worsening mental health. ClinicalTrials.gov Identifier: NCT05193578.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Patients with schizophrenia have reduced life expectancy due to cardiovascular disease and obesity-related type 2 diabetes, exacerbated by second-generation antipsychotic (SGA) medication. Existing interventions have shown limited effect."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effect of the once-weekly glucagon-like peptide-1 receptor agonist semaglutide in SGA-treated adults (aged 18-60 years) with schizophrenia, prediabetes (glycosylated hemoglobin A1c [HbA1c], 5.7%-6.4% of total hemoglobin) (to convert HbA1c from percentage of total hemoglobin to mmol/mol, use the following formula: (HbA1c % - 2.152)/0.09148), and overweight or obesity (body mass index [BMI], calculated as weight in kilograms divided by height in meters squared, ≥27)."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This placebo-controlled, double-blinded randomized clinical trial was conducted from January 2022 to May 2024, with 30 weeks of follow-up, among regional community-based mental health services in 2 regions of Denmark (Region of Southern Denmark and Region of Zealand). SGA-treated patients with schizophrenia, prediabetes, and overweight or obesity were randomized to semaglutide or placebo. Data analysis was completed from May 2024 to January 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Once-weekly subcutaneous semaglutide or placebo for 30 weeks; semaglutide was titrated up to 1.0 mg/week over 8 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was change in HbA1c. Secondary end points included changes in body weight, schizophrenia symptoms based on Positive and Negative Syndrome Scale 6 (PANSS-6) score, and physical and mental quality of life (QoL) (assessed via the 36-item Short Form Survey, version 2 [SF-36v2])."
        },
        {
          "label": "RESULTS",
          "text": "A total of 154 patients were recruited and randomized 1:1 to semaglutide or placebo (87 female participants (56.5%); mean [SD] age, 38.3 [10.7] years). Of 154 randomized patients, 141 (91.5%) completed the trial-74 of 77 patients randomized to semaglutide (96%) and 67 of 77 randomized to placebo (87%). Semaglutide reduced HbA1c by 0.46% of total hemoglobin (95% CI, -0.56% to -0.36%) and body weight by 9.21 kg (95% CI, -11.68 to -6.75). An HbA1c less than 5.7% of total hemoglobin was achieved in 81% vs 19% of patients treated with semaglutide and placebo, respectively (P < .001); improvements in high-density cholesterol by 10.81 mg/dL (95% CI, 2.70-18.53; P = .007) and triglycerides by -29.20 mg/dL (95% CI, -55.75 to 2.65; P = .03) (to convert to millimoles per liter, multiply by 0.0113) were also observed. Finally, semaglutide improved physical QoL by 3.75 points on the SF-36v2 (95% CI, 1.52-5.98; P = .001) but had no significant effect on mental QoL scores or PANSS-6 score. Gastrointestinal symptoms were more frequent in semaglutide-treated patients. A few semaglutide-treated patients were hospitalized more frequently than observed in the placebo-treated group, but the number of serious adverse effects did not differ between groups."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this multicenter, double-blinded randomized clinical trial, 30 weeks of administration of semaglutide, up to 1.0 mg/week, was safe, lowered blood glucose (as measured by HbA1c) and weight, and improved physical QoL in SGA-treated patients with schizophrenia, prediabetes, and obesity without worsening mental health."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05193578."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40900607/",
      "pubDate": "2025 Sep 03",
      "doi": "10.1001/jamapsychiatry.2025.2332",
      "dateReceived": "2025-09-21T23:22:03.084Z",
      "isNew": false,
      "summary": "Semaglutide treatment for 30 weeks in schizophrenia patients with prediabetes and obesity safely reduced blood glucose and weight while improving physical quality of life without negatively impacting mental health."
    },
    {
      "id": "77b15407e2fa",
      "title": "Blood pressure-lowering efficacy of antihypertensive drugs and their combinations: a systematic review and meta-analysis of randomised, double-blind, placebo-controlled trials.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48156232/117563",
      "abstract": "We aimed to quantify the blood pressure-lowering efficacy of antihypertensive drugs and their combinations from the five major drug classes. We conducted a systematic review and meta-analysis of randomised, double-blind, placebo-controlled trials involving adult participants randomly assigned to receive angiotensin-converting enzyme inhibitors, angiotensin II receptor blockers, β blockers, calcium channel blockers, or diuretics. Eligibility criteria included follow-up duration between 4 weeks and 26 weeks, antihypertensive drug treatment fixed in all participants for at least 4 weeks before follow-up blood pressure assessment; and availability of clinic blood pressure for the calculation of mean difference in systolic blood pressure between treatment groups. Crossover trials with less than 2 weeks' washout between the crossover periods were excluded. Eligible studies published between database inception and Dec 31, 2022 were identified from searches of the Cochrane Central Register of Controlled Trials, MEDLINE, and Epistemonikos; searches were updated to include studies published between Jan 1, 2023, and Feb 28, 2025. The primary outcome was placebo-corrected reduction in systolic blood pressure. Blood pressure-lowering efficacy was estimated using fixed-effects meta-analyses standardised to mean baseline blood pressure across included trials. Drug regimens were categorised into low, moderate, and high intensity, corresponding to systolic blood pressure-lowering efficacy of <10 mm Hg, 10-19 mm Hg, and ≥20 mm Hg, respectively, from a baseline of 154 mm Hg. A model was developed to calculate efficacy for any combination of antihypertensives and validated on external trials of dual and triple combination antihypertensives. The study protocol was registered on the International Platform of Registered Systematic Review and Meta-analysis Protocols (INPLASY202410036). We analysed 484 trials including 104 176 participants (mean age 54 years [SD 8], 57 422 [55%] men, 46 754 [45%] women, and mean baseline systolic blood pressure 154/100 mm Hg). Mean follow-up duration was 8·6 weeks (SD 5·2). On average, monotherapy at standard dose reduced systolic blood pressure by 8·7 mm Hg (95% CI 8·2-9·2), and each doubling in dose conferred an additional 1·5 mm Hg (1·2-1·7) reduction. Dual combinations at one standard dose conferred a 14·9 mm Hg (95% CI 13·1-16·8) reduction in systolic blood pressure, with each doubling of doses of both drugs conferring an additional reduction of 2·5 mm Hg (1·4-3·7). Each 10 mm Hg decrease in baseline systolic blood pressure reduced pressure-lowering efficacy by 1·3 mm Hg (1·0-1·5) for monotherapies, although differences between drug classes were observed. Among 57 monotherapies at standard dose, 45 (79%) were classified as low intensity. Of 189 different drug-dose dual combinations, 110 (58%) were classified as moderate intensity, and 21 (11%) as high intensity. There were considerable differences in dose-response and baseline blood pressure-response relationships between and within drug classes. The efficacy model showed a high correlation between predicted and observed systolic blood pressures when validated on external trials (r=0·76, p<0·0001). These analyses provide robust estimates of the expected blood pressure-lowering effect for any combination of antihypertensive drugs, allowing their efficacy to be classified into low, moderate, and high intensity. National Health and Medical Research Council, Australia.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "We aimed to quantify the blood pressure-lowering efficacy of antihypertensive drugs and their combinations from the five major drug classes."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review and meta-analysis of randomised, double-blind, placebo-controlled trials involving adult participants randomly assigned to receive angiotensin-converting enzyme inhibitors, angiotensin II receptor blockers, β blockers, calcium channel blockers, or diuretics. Eligibility criteria included follow-up duration between 4 weeks and 26 weeks, antihypertensive drug treatment fixed in all participants for at least 4 weeks before follow-up blood pressure assessment; and availability of clinic blood pressure for the calculation of mean difference in systolic blood pressure between treatment groups. Crossover trials with less than 2 weeks' washout between the crossover periods were excluded. Eligible studies published between database inception and Dec 31, 2022 were identified from searches of the Cochrane Central Register of Controlled Trials, MEDLINE, and Epistemonikos; searches were updated to include studies published between Jan 1, 2023, and Feb 28, 2025. The primary outcome was placebo-corrected reduction in systolic blood pressure. Blood pressure-lowering efficacy was estimated using fixed-effects meta-analyses standardised to mean baseline blood pressure across included trials. Drug regimens were categorised into low, moderate, and high intensity, corresponding to systolic blood pressure-lowering efficacy of <10 mm Hg, 10-19 mm Hg, and ≥20 mm Hg, respectively, from a baseline of 154 mm Hg. A model was developed to calculate efficacy for any combination of antihypertensives and validated on external trials of dual and triple combination antihypertensives. The study protocol was registered on the International Platform of Registered Systematic Review and Meta-analysis Protocols (INPLASY202410036)."
        },
        {
          "label": "FINDINGS",
          "text": "We analysed 484 trials including 104 176 participants (mean age 54 years [SD 8], 57 422 [55%] men, 46 754 [45%] women, and mean baseline systolic blood pressure 154/100 mm Hg). Mean follow-up duration was 8·6 weeks (SD 5·2). On average, monotherapy at standard dose reduced systolic blood pressure by 8·7 mm Hg (95% CI 8·2-9·2), and each doubling in dose conferred an additional 1·5 mm Hg (1·2-1·7) reduction. Dual combinations at one standard dose conferred a 14·9 mm Hg (95% CI 13·1-16·8) reduction in systolic blood pressure, with each doubling of doses of both drugs conferring an additional reduction of 2·5 mm Hg (1·4-3·7). Each 10 mm Hg decrease in baseline systolic blood pressure reduced pressure-lowering efficacy by 1·3 mm Hg (1·0-1·5) for monotherapies, although differences between drug classes were observed. Among 57 monotherapies at standard dose, 45 (79%) were classified as low intensity. Of 189 different drug-dose dual combinations, 110 (58%) were classified as moderate intensity, and 21 (11%) as high intensity. There were considerable differences in dose-response and baseline blood pressure-response relationships between and within drug classes. The efficacy model showed a high correlation between predicted and observed systolic blood pressures when validated on external trials (r=0·76, p<0·0001)."
        },
        {
          "label": "INTERPRETATION",
          "text": "These analyses provide robust estimates of the expected blood pressure-lowering effect for any combination of antihypertensive drugs, allowing their efficacy to be classified into low, moderate, and high intensity."
        },
        {
          "label": "FUNDING",
          "text": "National Health and Medical Research Council, Australia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40885583/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1016/S0140-6736(25)00991-2",
      "dateReceived": "2025-09-21T23:22:03.084Z",
      "isNew": false,
      "summary": "Antihypertensive drugs and their combinations effectively lower blood pressure, with varying intensities of effect."
    },
    {
      "id": "8397649601c4",
      "title": "High-Dose Influenza Vaccine Effectiveness against Hospitalization in Older Adults.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48136230/117565",
      "abstract": "High-dose inactivated influenza vaccine has been shown to provide protection against influenza that is superior to that with the standard dose. However, data from individually randomized trials on the effectiveness of the high-dose vaccine against severe outcomes are limited. In this pragmatic, open-label, randomized, controlled trial conducted in Denmark during the 2022-2023, 2023-2024, and 2024-2025 influenza seasons, we assigned older adults (≥65 years of age) to receive the high dose of the inactivated influenza vaccine or the standard dose. Data collection relied on nationwide administrative health registries. The primary end point was hospitalization for influenza or pneumonia that occurred from 14 days after vaccination through May 31 of the following year. Of the 332,438 participants who underwent randomization, 166,218 were assigned to receive the high-dose vaccine and 166,220 to receive the standard-dose vaccine. The mean (±SD) age of the participants was 73.7±5.8 years, and 161,538 participants (48.6%) were women. A primary end-point event occurred in 1138 participants (0.68%) in the high-dose group and in 1210 (0.73%) in the standard-dose group (relative vaccine effectiveness, 5.9%; 95.2% confidence interval [CI], -2.1 to 13.4; P = 0.14). Hospitalization for influenza occurred in 0.06% of the participants in the high-dose group and in 0.11% of those in the standard-dose group (relative vaccine effectiveness, 43.6%; 95.2% CI, 27.5 to 56.3); hospitalization for pneumonia occurred in 0.63% and 0.63%, respectively (relative effectiveness, 0.5%; 95.2% CI, -8.6 to 8.8); hospitalization for cardiorespiratory disease in 2.25% and 2.38% (relative effectiveness, 5.7%; 95.2% CI, 1.4 to 9.9); hospitalization for any cause in 9.38% and 9.58% (relative effectiveness, 2.1%; 95.2% CI, -0.1 to 4.3), and death from any cause in 0.67% and 0.66% (relative effectiveness, -2.5%; 95.2% CI, -11.6 to 5.9). The incidence of serious adverse events was similar in the two groups. In this trial, a high-dose inactivated influenza vaccine did not result in a significantly lower incidence of hospitalization for influenza or pneumonia than a standard dose among older adults. (Funded by Sanofi; DANFLU-2 ClinicalTrials.gov number, NCT05517174; EU Clinical Trials Register number, 2022-500657-17-00.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "High-dose inactivated influenza vaccine has been shown to provide protection against influenza that is superior to that with the standard dose. However, data from individually randomized trials on the effectiveness of the high-dose vaccine against severe outcomes are limited."
        },
        {
          "label": "METHODS",
          "text": "In this pragmatic, open-label, randomized, controlled trial conducted in Denmark during the 2022-2023, 2023-2024, and 2024-2025 influenza seasons, we assigned older adults (≥65 years of age) to receive the high dose of the inactivated influenza vaccine or the standard dose. Data collection relied on nationwide administrative health registries. The primary end point was hospitalization for influenza or pneumonia that occurred from 14 days after vaccination through May 31 of the following year."
        },
        {
          "label": "RESULTS",
          "text": "Of the 332,438 participants who underwent randomization, 166,218 were assigned to receive the high-dose vaccine and 166,220 to receive the standard-dose vaccine. The mean (±SD) age of the participants was 73.7±5.8 years, and 161,538 participants (48.6%) were women. A primary end-point event occurred in 1138 participants (0.68%) in the high-dose group and in 1210 (0.73%) in the standard-dose group (relative vaccine effectiveness, 5.9%; 95.2% confidence interval [CI], -2.1 to 13.4; P = 0.14). Hospitalization for influenza occurred in 0.06% of the participants in the high-dose group and in 0.11% of those in the standard-dose group (relative vaccine effectiveness, 43.6%; 95.2% CI, 27.5 to 56.3); hospitalization for pneumonia occurred in 0.63% and 0.63%, respectively (relative effectiveness, 0.5%; 95.2% CI, -8.6 to 8.8); hospitalization for cardiorespiratory disease in 2.25% and 2.38% (relative effectiveness, 5.7%; 95.2% CI, 1.4 to 9.9); hospitalization for any cause in 9.38% and 9.58% (relative effectiveness, 2.1%; 95.2% CI, -0.1 to 4.3), and death from any cause in 0.67% and 0.66% (relative effectiveness, -2.5%; 95.2% CI, -11.6 to 5.9). The incidence of serious adverse events was similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this trial, a high-dose inactivated influenza vaccine did not result in a significantly lower incidence of hospitalization for influenza or pneumonia than a standard dose among older adults. (Funded by Sanofi; DANFLU-2 ClinicalTrials.gov number, NCT05517174; EU Clinical Trials Register number, 2022-500657-17-00.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888720/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1056/NEJMoa2509907",
      "dateReceived": "2025-09-20T23:21:23.729Z",
      "isNew": false,
      "summary": "A high-dose flu vaccine did not significantly reduce hospitalizations for influenza or pneumonia compared to a standard dose in older adults."
    },
    {
      "id": "452173df4e0b",
      "title": "Two-bag Versus One-bag Method for Adult and Pediatric Diabetic Ketoacidosis Management.",
      "journal": "Ann Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Endocrine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48136230/117571",
      "abstract": "We conducted a systematic review and meta-analysis to evaluate the safety and efficacy of the two-bag versus one-bag method in diabetic ketoacidosis (DKA) management in adult and pediatric populations. The study was registered with the Prospective Register of Systematic Reviews, in adherence to Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. A search was conducted across MEDLINE, EMBASE, and CENTRAL databases up to March 2025, with no restrictions on study design. Two reviewers independently assessed studies for bias using Cochrane Risk of Bias 2 (RoB2) tool and the Risk of Bias in Nonrandomized Studies of Interventions (ROBINS-I), extracted data, and synthesized findings using RevMan software. The Grading of Recommendations, Assessment, Development, and Evaluations tool was used to assess certainty of evidence. Main outcomes of interest were incidence of hypoglycemia and time to DKA resolution. Of 4,190 studies screened, 21 met inclusion criteria. These included 9 adult studies with 3,329 patient visits and 12 pediatric studies with 1,385 visits. Of these, one study was at critical risk of bias and was removed from meta-analysis. In both adult and pediatric populations, the two-bag method was associated with reduced incidence of hypoglycemia (risk ratio: 0.50, 95% confidence interval [CI] 0.41 to 0.59; I=51.8%) and time to DKA resolution (MD: -1.76 hours; 95% CI -2.80 to -0.71; I=61%). In adults only, the two-bag method was associated with a shortened duration of insulin infusion (MD: -3.74 hours, 95% CI -4.96 to -2.52; I=0%) and reduced incidence of hypokalemia (risk ratio: 0.84, 95% CI 0.76 to 0.93; I=47%). The two-bag method is associated with reduced incidence of hypoglycemia and time to DKA resolution in both adult and pediatric populations.",
      "structuredAbstract": [
        {
          "label": "STUDY OBJECTIVE",
          "text": "We conducted a systematic review and meta-analysis to evaluate the safety and efficacy of the two-bag versus one-bag method in diabetic ketoacidosis (DKA) management in adult and pediatric populations."
        },
        {
          "label": "METHODS",
          "text": "The study was registered with the Prospective Register of Systematic Reviews, in adherence to Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. A search was conducted across MEDLINE, EMBASE, and CENTRAL databases up to March 2025, with no restrictions on study design. Two reviewers independently assessed studies for bias using Cochrane Risk of Bias 2 (RoB2) tool and the Risk of Bias in Nonrandomized Studies of Interventions (ROBINS-I), extracted data, and synthesized findings using RevMan software. The Grading of Recommendations, Assessment, Development, and Evaluations tool was used to assess certainty of evidence. Main outcomes of interest were incidence of hypoglycemia and time to DKA resolution."
        },
        {
          "label": "RESULTS",
          "text": "Of 4,190 studies screened, 21 met inclusion criteria. These included 9 adult studies with 3,329 patient visits and 12 pediatric studies with 1,385 visits. Of these, one study was at critical risk of bias and was removed from meta-analysis. In both adult and pediatric populations, the two-bag method was associated with reduced incidence of hypoglycemia (risk ratio: 0.50, 95% confidence interval [CI] 0.41 to 0.59; I=51.8%) and time to DKA resolution (MD: -1.76 hours; 95% CI -2.80 to -0.71; I=61%). In adults only, the two-bag method was associated with a shortened duration of insulin infusion (MD: -3.74 hours, 95% CI -4.96 to -2.52; I=0%) and reduced incidence of hypokalemia (risk ratio: 0.84, 95% CI 0.76 to 0.93; I=47%)."
        },
        {
          "label": "CONCLUSION",
          "text": "The two-bag method is associated with reduced incidence of hypoglycemia and time to DKA resolution in both adult and pediatric populations."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40913602/",
      "pubDate": "2025 Sep 06",
      "doi": "10.1016/j.annemergmed.2025.07.032",
      "dateReceived": "2025-09-19T23:22:04.516Z",
      "isNew": false,
      "summary": "The two-bag method lowers the risk of low blood sugar and speeds up the recovery from diabetic ketoacidosis in both adults and children."
    },
    {
      "id": "16e3c1712411",
      "title": "High-Dose Influenza Vaccine to Reduce Hospitalizations.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48126272/117568",
      "abstract": "Superior protection against laboratory-confirmed influenza has been proved for high-dose inactivated influenza vaccine, as compared with the standard dose, among adults 65 years of age or older. However, data on the relative effectiveness of the high-dose vaccine against severe clinical outcomes, including hospitalizations, are limited. We conducted a pragmatic, registry-based, open-label, randomized, active-controlled trial to evaluate the relative effectiveness of high-dose inactivated influenza vaccine, as compared with the standard dose, against severe clinical outcomes among community-dwelling adults 65 to 79 years of age. The trial was performed during two influenza seasons (2023-2024 and 2024-2025) with regional health registry data in Galicia, Spain. In each influenza season, the participants were randomly assigned in a 1:1 ratio to receive high-dose inactivated influenza vaccine or the standard dose. The primary end point was a composite of hospitalization for influenza or pneumonia from 14 days after vaccination to May 31 of the following year. A total of 103,169 unique participants underwent randomization; 31,307 participants were enrolled in both seasons and were counted for each. During the 2023-2024 and 2024-2025 seasons, 59,490 and 74,986 participants, respectively, underwent randomization. Among the participants, the mean (±SD) age was 72.3±4.3 years, and 53.6% were men. A primary end-point event occurred in 174 of 67,093 participants (absolute risk, 0.26%) in the high-dose group and in 227 of 66,789 (absolute risk, 0.34%) in the standard-dose group (relative vaccine effectiveness, 23.7%; 95% confidence interval [CI], 6.6 to 37.7). Hospitalization for influenza occurred in 63 of 67,093 participants (absolute risk, 0.09%) in the high-dose group and in 92 of 66,789 (absolute risk, 0.14%) in the standard-dose group (relative vaccine effectiveness, 31.8%; 95% CI, 5.0 to 51.3). The incidence of serious adverse events appeared to be similar in the two trial groups. Among community-dwelling adults 65 to 79 years of age, there appeared to be fewer hospitalizations for influenza or pneumonia with high-dose inactivated influenza vaccine than with the standard dose. (Funded by Sanofi; GALFLU ClinicalTrials.gov number NCT06141655; EudraCT number, 2023-506977-36-00.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Superior protection against laboratory-confirmed influenza has been proved for high-dose inactivated influenza vaccine, as compared with the standard dose, among adults 65 years of age or older. However, data on the relative effectiveness of the high-dose vaccine against severe clinical outcomes, including hospitalizations, are limited."
        },
        {
          "label": "METHODS",
          "text": "We conducted a pragmatic, registry-based, open-label, randomized, active-controlled trial to evaluate the relative effectiveness of high-dose inactivated influenza vaccine, as compared with the standard dose, against severe clinical outcomes among community-dwelling adults 65 to 79 years of age. The trial was performed during two influenza seasons (2023-2024 and 2024-2025) with regional health registry data in Galicia, Spain. In each influenza season, the participants were randomly assigned in a 1:1 ratio to receive high-dose inactivated influenza vaccine or the standard dose. The primary end point was a composite of hospitalization for influenza or pneumonia from 14 days after vaccination to May 31 of the following year."
        },
        {
          "label": "RESULTS",
          "text": "A total of 103,169 unique participants underwent randomization; 31,307 participants were enrolled in both seasons and were counted for each. During the 2023-2024 and 2024-2025 seasons, 59,490 and 74,986 participants, respectively, underwent randomization. Among the participants, the mean (±SD) age was 72.3±4.3 years, and 53.6% were men. A primary end-point event occurred in 174 of 67,093 participants (absolute risk, 0.26%) in the high-dose group and in 227 of 66,789 (absolute risk, 0.34%) in the standard-dose group (relative vaccine effectiveness, 23.7%; 95% confidence interval [CI], 6.6 to 37.7). Hospitalization for influenza occurred in 63 of 67,093 participants (absolute risk, 0.09%) in the high-dose group and in 92 of 66,789 (absolute risk, 0.14%) in the standard-dose group (relative vaccine effectiveness, 31.8%; 95% CI, 5.0 to 51.3). The incidence of serious adverse events appeared to be similar in the two trial groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among community-dwelling adults 65 to 79 years of age, there appeared to be fewer hospitalizations for influenza or pneumonia with high-dose inactivated influenza vaccine than with the standard dose. (Funded by Sanofi; GALFLU ClinicalTrials.gov number NCT06141655; EudraCT number, 2023-506977-36-00.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888694/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1056/NEJMoa2509834",
      "dateReceived": "2025-09-19T23:22:04.516Z",
      "isNew": false,
      "summary": "High-dose inactivated influenza vaccine was associated with fewer hospitalizations for influenza or pneumonia compared to the standard dose in older adults."
    },
    {
      "id": "b615ca6098ea",
      "title": "Benefit-harm trade-offs of intensive blood pressure control versus standard blood pressure control on cardiovascular and renal outcomes: an individual participant data analysis of randomised controlled trials.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48126272/117546",
      "abstract": "Although intensive blood pressure control is recommended by major guidelines, its overall benefit-harm balance remains uncertain. In particular, it is unclear how net clinical benefit varies by blood pressure target and patient characteristics. We aimed to quantify the benefit-harm trade-offs of intensive blood pressure control versus standard blood pressure control. We conducted a post-hoc, pooled participant-level analysis of six randomised controlled trials (ACCORD BP, SPRINT, ESPRIT, BPROAD, STEP, and CRHCP). Trial selection was based on our collaborative framework, the Blood Pressure Reduction Union-Landmark Evidence, and a targeted literature search, guided by five predefined inclusion criteria: (1) comparison of intensive systolic blood pressure targets (<120 mm Hg or <130 mm Hg) versus standard treatment; (2) reporting of composite major cardiovascular outcomes; (3) enrolment of more than 2000 participants; (4) standardised reporting of treatment-related adverse events; and (5) availability of individual participant data. We also conducted a systematic review in which we searched PubMed for studies published from database inception up to June 15, 2025, with no language restrictions. We used search terms related to cardiovascular outcomes, hypertension, intensive blood pressure lowering, and randomised trials. Study screening and data extraction were independently conducted in pairs by ten reviewers, with discrepancies resolved by discussion or adjudication. Participants in the six trials were randomly assigned to intensive blood pressure treatment (systolic blood pressure target <120 mm Hg or <130 mm Hg) versus standard treatment (systolic blood pressure target <140 mm Hg, <150 mm Hg in older adults, or usual care), depending on the trial design. The primary benefit outcome was a composite of myocardial infarction, stroke, heart failure, and cardiovascular death. The primary harm outcomes were adverse events of interest (eg, hypotension and syncope) and renal-related events. Statistical analyses were performed on an intention-to-treat basis using Bayesian hierarchical models. The initial dataset included 80 676 participants, of whom 80 220 were included in our analyses (intensive blood pressure control group n=40 503; standard blood pressure control group n=39 717). The median age was 64·0 years (IQR 59·0-70·0), 39 043 (48·7%) participants were male, and 41 177 (51·3%) were female. Most participants were Asian (66 290 [82·6%]) or White (8097 [10·1%]). During a median follow-up of 3·2 years (IQR 3·0-3·5), the composite cardiovascular disease outcome occurred in 2158 (5·3%) participants in the intensive blood pressure control group and 2811 (7·1%) participants in the standard blood pressure control group (hazard ratio 0·76, 95% credible interval [CrI] 0·72-0·81; p<0·0001). Compared with standard blood pressure control, intensive blood pressure control was associated with a 1·73% absolute risk reduction (95% CrI 1·65-1·81) in cardiovascular disease (number needed to treat 58 [95% CrI 55-61]) and a 1·82% absolute risk increase (95% CrI 1·63-2·01) for adverse events of interest (number needed to harm 55 [95% CrI 49-61]). Overall, intensive blood pressure control showed a favourable benefit-harm profile, with a net benefit of 1·14 (95% CrI 1·03-1·25), using adjudicated weighting. The net benefit remained positive when considering kidney-related adverse events (1·13 [95% CrI 1·01-1·24]). Compared with standard blood pressure control, intensive blood pressure control provides a net benefit between the reduction in cardiovascular events and the increase in adverse events, including renal events. National Key Research and Development Program, the Ministry of Science and Technology of China; National Science and Technology Major Project; National Natural Science Foundation of China; China Academy of Chinese Medical Sciences Innovation Fund for Medical Science; and Science and Technology Program of Liaoning Province.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Although intensive blood pressure control is recommended by major guidelines, its overall benefit-harm balance remains uncertain. In particular, it is unclear how net clinical benefit varies by blood pressure target and patient characteristics. We aimed to quantify the benefit-harm trade-offs of intensive blood pressure control versus standard blood pressure control."
        },
        {
          "label": "METHODS",
          "text": "We conducted a post-hoc, pooled participant-level analysis of six randomised controlled trials (ACCORD BP, SPRINT, ESPRIT, BPROAD, STEP, and CRHCP). Trial selection was based on our collaborative framework, the Blood Pressure Reduction Union-Landmark Evidence, and a targeted literature search, guided by five predefined inclusion criteria: (1) comparison of intensive systolic blood pressure targets (<120 mm Hg or <130 mm Hg) versus standard treatment; (2) reporting of composite major cardiovascular outcomes; (3) enrolment of more than 2000 participants; (4) standardised reporting of treatment-related adverse events; and (5) availability of individual participant data. We also conducted a systematic review in which we searched PubMed for studies published from database inception up to June 15, 2025, with no language restrictions. We used search terms related to cardiovascular outcomes, hypertension, intensive blood pressure lowering, and randomised trials. Study screening and data extraction were independently conducted in pairs by ten reviewers, with discrepancies resolved by discussion or adjudication. Participants in the six trials were randomly assigned to intensive blood pressure treatment (systolic blood pressure target <120 mm Hg or <130 mm Hg) versus standard treatment (systolic blood pressure target <140 mm Hg, <150 mm Hg in older adults, or usual care), depending on the trial design. The primary benefit outcome was a composite of myocardial infarction, stroke, heart failure, and cardiovascular death. The primary harm outcomes were adverse events of interest (eg, hypotension and syncope) and renal-related events. Statistical analyses were performed on an intention-to-treat basis using Bayesian hierarchical models."
        },
        {
          "label": "FINDINGS",
          "text": "The initial dataset included 80 676 participants, of whom 80 220 were included in our analyses (intensive blood pressure control group n=40 503; standard blood pressure control group n=39 717). The median age was 64·0 years (IQR 59·0-70·0), 39 043 (48·7%) participants were male, and 41 177 (51·3%) were female. Most participants were Asian (66 290 [82·6%]) or White (8097 [10·1%]). During a median follow-up of 3·2 years (IQR 3·0-3·5), the composite cardiovascular disease outcome occurred in 2158 (5·3%) participants in the intensive blood pressure control group and 2811 (7·1%) participants in the standard blood pressure control group (hazard ratio 0·76, 95% credible interval [CrI] 0·72-0·81; p<0·0001). Compared with standard blood pressure control, intensive blood pressure control was associated with a 1·73% absolute risk reduction (95% CrI 1·65-1·81) in cardiovascular disease (number needed to treat 58 [95% CrI 55-61]) and a 1·82% absolute risk increase (95% CrI 1·63-2·01) for adverse events of interest (number needed to harm 55 [95% CrI 49-61]). Overall, intensive blood pressure control showed a favourable benefit-harm profile, with a net benefit of 1·14 (95% CrI 1·03-1·25), using adjudicated weighting. The net benefit remained positive when considering kidney-related adverse events (1·13 [95% CrI 1·01-1·24])."
        },
        {
          "label": "INTERPRETATION",
          "text": "Compared with standard blood pressure control, intensive blood pressure control provides a net benefit between the reduction in cardiovascular events and the increase in adverse events, including renal events."
        },
        {
          "label": "FUNDING",
          "text": "National Key Research and Development Program, the Ministry of Science and Technology of China; National Science and Technology Major Project; National Natural Science Foundation of China; China Academy of Chinese Medical Sciences Innovation Fund for Medical Science; and Science and Technology Program of Liaoning Province."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40902616/",
      "pubDate": "2025 Sep 06",
      "doi": "10.1016/S0140-6736(25)01391-1",
      "dateReceived": "2025-09-19T23:22:04.516Z",
      "isNew": false,
      "summary": "Intensive blood pressure control offers a net clinical benefit compared to standard treatment, but the balance of benefits and harms needs further investigation."
    },
    {
      "id": "ee00a6805e7c",
      "title": "Elinzanetant for the Treatment of Vasomotor Symptoms Associated With Menopause: A Phase 3 Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117610",
      "abstract": "There is an unmet need for long-term, safe, effective, and hormone-free treatments for menopausal symptoms, including vasomotor symptoms (VMS) and sleep disturbances. To evaluate the 52-week efficacy and safety of elinzanetant, a dual neurokinin-targeted therapy, for treating moderate to severe VMS associated with menopause. OASIS-3 was a double-blind, placebo-controlled, randomized phase 3 clinical trial that was conducted at 83 sites in North America and Europe from August 27, 2021, to February 12, 2024, and included postmenopausal women aged 40 to 65 years who were seeking treatment for moderate to severe VMS (no requirement for a minimum number of VMS events per week). The data were analyzed on March 11, 2024. Once-daily oral elinzanetant, 120 mg, or matching placebo for 52 weeks. The primary outcome was mean change from baseline to week 12 in the frequency of daily moderate to severe VMS, which was analyzed using a mixed model with repeated measures. Secondary end points included changes over 52 weeks in measures evaluating sleep disturbance and the effect on menopause-related quality of life. Exploratory end points included mean changes over 50 weeks in frequency and severity of daily moderate to severe VMS. Exploratory and secondary end points were analyzed using descriptive statistics. Safety was also assessed. Overall, 313 women (mean [SD] age, 54.6 [4.7] years; 51 [16.3%] were Black or African American, and 240 [76.7%] were White individuals; 34 [10.9%] were Hispanic or Latina) were randomized to receive elinzanetant and 315 (mean [SD] age, 54.9 [5.0] years; 44 [14.0%] Black or African American, 34 [10.8%] Hispanic or Latina, and 253 [80.3%] White individuals) to receive placebo. At week 12, the mean change from baseline in daily moderate to severe VMS frequency was -5.4 (95% CI, -6.3 to -4.5) for elinzanetant and -3.5 (95% CI, -4.1 to -2.9) for placebo; the least-squares mean difference for elinzanetant vs placebo was -1.6 (95% CI, -2.0 to -1.1; P < .001). Although no statistical hypotheses were defined, nor was the study powered to detect between-group differences for the secondary and exploratory end points, descriptive analyses showed numerical advantages for elinzanetant vs placebo for improving VMS frequency and severity over 50 weeks and sleep disturbances and menopause-related quality of life over 52 weeks. Regarding safety, elinzanetant was not associated with hepatotoxic effects, endometrial hyperplasia, or meaningful changes in bone density or bone turnover markers. Treatment-related adverse events were more common with elinzanetant than placebo (30.4% vs 14.6%); the most frequent were somnolence, fatigue, and headache. The OASIS-3 randomized clinical trial expanded on findings from the 26-week OASIS-1 and OASIS-2 trials, exploring the use of elinzanetant over a longer duration and in a broader population. Elinzanetant shows promise as a treatment for moderate to severe VMS. ClinicalTrials.gov Identifier: NCT05030584.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There is an unmet need for long-term, safe, effective, and hormone-free treatments for menopausal symptoms, including vasomotor symptoms (VMS) and sleep disturbances."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the 52-week efficacy and safety of elinzanetant, a dual neurokinin-targeted therapy, for treating moderate to severe VMS associated with menopause."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "OASIS-3 was a double-blind, placebo-controlled, randomized phase 3 clinical trial that was conducted at 83 sites in North America and Europe from August 27, 2021, to February 12, 2024, and included postmenopausal women aged 40 to 65 years who were seeking treatment for moderate to severe VMS (no requirement for a minimum number of VMS events per week). The data were analyzed on March 11, 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Once-daily oral elinzanetant, 120 mg, or matching placebo for 52 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was mean change from baseline to week 12 in the frequency of daily moderate to severe VMS, which was analyzed using a mixed model with repeated measures. Secondary end points included changes over 52 weeks in measures evaluating sleep disturbance and the effect on menopause-related quality of life. Exploratory end points included mean changes over 50 weeks in frequency and severity of daily moderate to severe VMS. Exploratory and secondary end points were analyzed using descriptive statistics. Safety was also assessed."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 313 women (mean [SD] age, 54.6 [4.7] years; 51 [16.3%] were Black or African American, and 240 [76.7%] were White individuals; 34 [10.9%] were Hispanic or Latina) were randomized to receive elinzanetant and 315 (mean [SD] age, 54.9 [5.0] years; 44 [14.0%] Black or African American, 34 [10.8%] Hispanic or Latina, and 253 [80.3%] White individuals) to receive placebo. At week 12, the mean change from baseline in daily moderate to severe VMS frequency was -5.4 (95% CI, -6.3 to -4.5) for elinzanetant and -3.5 (95% CI, -4.1 to -2.9) for placebo; the least-squares mean difference for elinzanetant vs placebo was -1.6 (95% CI, -2.0 to -1.1; P < .001). Although no statistical hypotheses were defined, nor was the study powered to detect between-group differences for the secondary and exploratory end points, descriptive analyses showed numerical advantages for elinzanetant vs placebo for improving VMS frequency and severity over 50 weeks and sleep disturbances and menopause-related quality of life over 52 weeks. Regarding safety, elinzanetant was not associated with hepatotoxic effects, endometrial hyperplasia, or meaningful changes in bone density or bone turnover markers. Treatment-related adverse events were more common with elinzanetant than placebo (30.4% vs 14.6%); the most frequent were somnolence, fatigue, and headache."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "The OASIS-3 randomized clinical trial expanded on findings from the 26-week OASIS-1 and OASIS-2 trials, exploring the use of elinzanetant over a longer duration and in a broader population. Elinzanetant shows promise as a treatment for moderate to severe VMS."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05030584."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40920404/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1001/jamainternmed.2025.4421",
      "dateReceived": "2025-09-18T23:22:23.407Z",
      "isNew": false,
      "summary": "Elinzanetant demonstrates potential as a treatment for moderate to severe vasomotor symptoms (VMS)."
    },
    {
      "id": "9f02bd42fc9f",
      "title": "Minimally Invasive Surgery vs Medical Management Alone for Intracerebral Hemorrhage: The MIND Randomized Clinical Trial.",
      "journal": "JAMA Neurol",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117608",
      "abstract": "It remains uncertain whether surgical evacuation improves functional outcomes in patients with supratentorial intracerebral hemorrhage (ICH). To compare the safety and efficacy of minimally invasive surgery with the Artemis Neuro Evacuation Device to guideline-based medical management alone for spontaneous supratentorial ICH. The MIND open-label, multicenter randomized clinical trial randomized patients with spontaneous supratentorial ICH in a 2:1 ratio to either minimally invasive surgery or medical management alone. Participants were enrolled at 32 participating global sites between February 6, 2018, and August 28, 2023. This article reports on the primary trial outcome. Of 4066 eligible adult patients (aged 18-80 years) with moderate- to large-volume supratentorial ICH (20-80 mL), baseline National Institutes of Health Stroke Scale score of 6 or higher, and Glasgow Coma Scale score between 5 and 15, 154 were randomized to minimally invasive surgery and 82 to medical management. Data were analyzed from February to September 2024. Minimally invasive surgery (within 72 hours of symptom onset) plus medical management or medical management alone. The primary efficacy outcome was 180-day combined death and disability via ordinal modified Rankin Scale score (range, 0 [no symptoms] to 6 [death]). The primary safety outcome was 30-day mortality. Following an independent feasibility analysis prompted by the publication of positive results of a contemporaneous ICH trial, enrollment was stopped early at 236 participants. Overall median (IQR) participant age was 60 (50-70) years, 87 participants (36.9%) were female, 164 (69.5%) had primarily deep bleeds, and 72 (30.5%) had primarily lobar bleeds. Efficacy results of the primary model analysis suggested lack of evidence for the superiority of minimally invasive surgery over medical management (odds ratio [OR], 1.03; 96% CI, 0.62-1.72; P = .45). The adjusted model's mean OR was also nonsignificantly greater than 1 (OR, 1.10; 96% CI, 0.66-1.85; P = .35). By 30 days, 11 participants (7.2%) in the surgery group and 8 (9.8%) in the medical management group died (difference, -2.5%; 95% CI, -11.7% to 4.8%). In the MIND randomized clinical trial, minimally invasive surgery within 72 hours did not significantly reduce 30-day mortality or improve 180-day disability in patients with supratentorial ICH compared to medical management alone. ClinicalTrials.gov Identifier: NCT03342664.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "It remains uncertain whether surgical evacuation improves functional outcomes in patients with supratentorial intracerebral hemorrhage (ICH)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the safety and efficacy of minimally invasive surgery with the Artemis Neuro Evacuation Device to guideline-based medical management alone for spontaneous supratentorial ICH."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The MIND open-label, multicenter randomized clinical trial randomized patients with spontaneous supratentorial ICH in a 2:1 ratio to either minimally invasive surgery or medical management alone. Participants were enrolled at 32 participating global sites between February 6, 2018, and August 28, 2023. This article reports on the primary trial outcome. Of 4066 eligible adult patients (aged 18-80 years) with moderate- to large-volume supratentorial ICH (20-80 mL), baseline National Institutes of Health Stroke Scale score of 6 or higher, and Glasgow Coma Scale score between 5 and 15, 154 were randomized to minimally invasive surgery and 82 to medical management. Data were analyzed from February to September 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Minimally invasive surgery (within 72 hours of symptom onset) plus medical management or medical management alone."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcome was 180-day combined death and disability via ordinal modified Rankin Scale score (range, 0 [no symptoms] to 6 [death]). The primary safety outcome was 30-day mortality."
        },
        {
          "label": "RESULTS",
          "text": "Following an independent feasibility analysis prompted by the publication of positive results of a contemporaneous ICH trial, enrollment was stopped early at 236 participants. Overall median (IQR) participant age was 60 (50-70) years, 87 participants (36.9%) were female, 164 (69.5%) had primarily deep bleeds, and 72 (30.5%) had primarily lobar bleeds. Efficacy results of the primary model analysis suggested lack of evidence for the superiority of minimally invasive surgery over medical management (odds ratio [OR], 1.03; 96% CI, 0.62-1.72; P = .45). The adjusted model's mean OR was also nonsignificantly greater than 1 (OR, 1.10; 96% CI, 0.66-1.85; P = .35). By 30 days, 11 participants (7.2%) in the surgery group and 8 (9.8%) in the medical management group died (difference, -2.5%; 95% CI, -11.7% to 4.8%)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In the MIND randomized clinical trial, minimally invasive surgery within 72 hours did not significantly reduce 30-day mortality or improve 180-day disability in patients with supratentorial ICH compared to medical management alone."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03342664."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892424/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamaneurol.2025.3151",
      "dateReceived": "2025-09-18T23:22:23.407Z",
      "isNew": false,
      "summary": "Minimally invasive surgery within 72 hours did not improve survival or functional outcomes compared to medical management for supratentorial intracerebral hemorrhage."
    },
    {
      "id": "142403726089",
      "title": "Glucagon-Like Peptide-1 Receptor Agonists and Gastrointestinal Adverse Events: A Systematic Review and Meta-Analysis.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117605",
      "abstract": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) are widely used for glycemic control or weight management in patients with type 2 diabetes mellitus or overweight/obesity. However, there are concerns regarding their association with serious gastrointestinal adverse events, although findings have been inconsistent. We systematically searched 5 databases for placebo-controlled randomized controlled trials assessing GLP-1RAs in patients with type 2 diabetes mellitus, overweight/obesity, or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease. We included trials that reported cholecystitis, cholelithiasis, cholangitis, cholestasis, pancreatitis, gastroesophageal reflux disease (GERD), gastritis, esophagitis, gastrointestinal ischemia, gastrointestinal hemorrhage, intestinal obstruction, paralytic ileus, gastrointestinal ulceration, gastrointestinal perforation, or gastroparesis. Meta-analyses were performed using a random-effects model, with subgroup analyses evaluating risks based on patient population, GLP-1RA vs dual-agonist formulation, weight-loss profile, dosing, and duration of action. We included 55 randomized controlled trials involving 106,395 participants. GLP-1RAs increased the risk of cholelithiasis (risk ratio [RR], 1.46; 95% CI, 1.09-1.97; 2 more cases per 1000) and probably increased the risk of GERD (RR, 2.19; 95% CI, 1.48-3.25; 4 more cases per 1000) compared with placebo. GLP-1RAs probably have little or no effect on the risk of other gastrointestinal or biliary events. Subgroup analyses showed that the increased risks of cholelithiasis and GERD were more pronounced in trials including individuals with overweight/obesity or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease, weight-loss-inducing GLP-1RAs, or high-dose formulations, although these subgroup effects were not statistically significant. GLP-1RAs are associated with an increased risk of cholelithiasis and GERD, but do not appear to increase the risk of other gastrointestinal or biliary adverse events.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) are widely used for glycemic control or weight management in patients with type 2 diabetes mellitus or overweight/obesity. However, there are concerns regarding their association with serious gastrointestinal adverse events, although findings have been inconsistent."
        },
        {
          "label": "METHODS",
          "text": "We systematically searched 5 databases for placebo-controlled randomized controlled trials assessing GLP-1RAs in patients with type 2 diabetes mellitus, overweight/obesity, or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease. We included trials that reported cholecystitis, cholelithiasis, cholangitis, cholestasis, pancreatitis, gastroesophageal reflux disease (GERD), gastritis, esophagitis, gastrointestinal ischemia, gastrointestinal hemorrhage, intestinal obstruction, paralytic ileus, gastrointestinal ulceration, gastrointestinal perforation, or gastroparesis. Meta-analyses were performed using a random-effects model, with subgroup analyses evaluating risks based on patient population, GLP-1RA vs dual-agonist formulation, weight-loss profile, dosing, and duration of action."
        },
        {
          "label": "RESULTS",
          "text": "We included 55 randomized controlled trials involving 106,395 participants. GLP-1RAs increased the risk of cholelithiasis (risk ratio [RR], 1.46; 95% CI, 1.09-1.97; 2 more cases per 1000) and probably increased the risk of GERD (RR, 2.19; 95% CI, 1.48-3.25; 4 more cases per 1000) compared with placebo. GLP-1RAs probably have little or no effect on the risk of other gastrointestinal or biliary events. Subgroup analyses showed that the increased risks of cholelithiasis and GERD were more pronounced in trials including individuals with overweight/obesity or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease, weight-loss-inducing GLP-1RAs, or high-dose formulations, although these subgroup effects were not statistically significant."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1RAs are associated with an increased risk of cholelithiasis and GERD, but do not appear to increase the risk of other gastrointestinal or biliary adverse events."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40499738/",
      "pubDate": "2025 Jun 09",
      "doi": "10.1053/j.gastro.2025.06.003",
      "dateReceived": "2025-09-18T23:22:23.407Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists are linked to a higher chance of gallstones and acid reflux, but not other digestive or biliary problems."
    },
    {
      "id": "2ff49a0d3e4f",
      "title": "Fractional Flow Reserve-Guided Complete vs Culprit-Only Revascularization in Non-ST-Elevation Myocardial Infarction and Multivessel Disease: The SLIM Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117572",
      "abstract": "The benefits of fractional flow reserve (FFR)-guided complete coronary revascularization in patients with non-ST-segment elevation myocardial infarction (NSTEMI) and multivessel disease remain unclear. To compare FFR-guided complete revascularization of nonculprit lesions vs culprit-only revascularization in patients with NSTEMI and multivessel disease. This prospective, investigator-initiated, multicenter, international randomized clinical trial was conducted at 9 hospitals in Europe. Patients with NSTEMI and multivessel disease who had successful revascularization of the culprit lesion were enrolled between June 2018 and July 2024, and final follow-up was completed on July 21, 2025. The analysis was conducted on July 28, 2025. Eligibility criteria included the presence of at least 1 stenosis of at least 50% in a nonculprit lesion amendable for revascularization. Patients were randomized to receive either FFR-guided complete or culprit-only revascularization during the index procedure. Staged revascularization within 6 weeks after the index procedure was allowed in the culprit-only group. The primary outcome was a composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. Key secondary outcomes included individual components of the primary outcome, net adverse clinical events, all-cause death or nonfatal myocardial infarction, cardiac rehospitalization, and bleeding events. Among 478 randomized patients (mean [SD] age, 65.9 [10.6] years; 347 [72.9%] males), 240 were randomized to receive FFR-guided complete revascularization and 238 were randomized to receive culprit-only revascularization, with crossover occurring in 7 patients in the culprit-only group. The primary outcome occurred in 13 patients (5.5%) in the FFR-guided complete revascularization group vs 32 patients (13.6%) in the culprit-only group (hazard ratio [HR], 0.38 [95% CI, 0.20-0.72]; P = .003). Rates of any revascularization (3.0% vs 11.5%; HR, 0.24 [95% CI, 0.11-0.56]; P < .001) and net adverse clinical events (6.3% vs 15.3%; HR, 0.39 [95% CI, 0.21-0.70]; P = .002) were also significantly lower in the complete revascularization group, while there were no significant differences in the remaining secondary outcomes. FFR-guided complete revascularization during the index procedure resulted in a significant reduction in the composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. This was mainly driven by reduced repeat revascularization. ClinicalTrials.gov Identifier: NCT03562572.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The benefits of fractional flow reserve (FFR)-guided complete coronary revascularization in patients with non-ST-segment elevation myocardial infarction (NSTEMI) and multivessel disease remain unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare FFR-guided complete revascularization of nonculprit lesions vs culprit-only revascularization in patients with NSTEMI and multivessel disease."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This prospective, investigator-initiated, multicenter, international randomized clinical trial was conducted at 9 hospitals in Europe. Patients with NSTEMI and multivessel disease who had successful revascularization of the culprit lesion were enrolled between June 2018 and July 2024, and final follow-up was completed on July 21, 2025. The analysis was conducted on July 28, 2025. Eligibility criteria included the presence of at least 1 stenosis of at least 50% in a nonculprit lesion amendable for revascularization."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomized to receive either FFR-guided complete or culprit-only revascularization during the index procedure. Staged revascularization within 6 weeks after the index procedure was allowed in the culprit-only group."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. Key secondary outcomes included individual components of the primary outcome, net adverse clinical events, all-cause death or nonfatal myocardial infarction, cardiac rehospitalization, and bleeding events."
        },
        {
          "label": "RESULTS",
          "text": "Among 478 randomized patients (mean [SD] age, 65.9 [10.6] years; 347 [72.9%] males), 240 were randomized to receive FFR-guided complete revascularization and 238 were randomized to receive culprit-only revascularization, with crossover occurring in 7 patients in the culprit-only group. The primary outcome occurred in 13 patients (5.5%) in the FFR-guided complete revascularization group vs 32 patients (13.6%) in the culprit-only group (hazard ratio [HR], 0.38 [95% CI, 0.20-0.72]; P = .003). Rates of any revascularization (3.0% vs 11.5%; HR, 0.24 [95% CI, 0.11-0.56]; P < .001) and net adverse clinical events (6.3% vs 15.3%; HR, 0.39 [95% CI, 0.21-0.70]; P = .002) were also significantly lower in the complete revascularization group, while there were no significant differences in the remaining secondary outcomes."
        },
        {
          "label": "CONCLUSION AND RELEVANCE",
          "text": "FFR-guided complete revascularization during the index procedure resulted in a significant reduction in the composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. This was mainly driven by reduced repeat revascularization."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03562572."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886310/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1001/jama.2025.16189",
      "dateReceived": "2025-09-18T23:22:23.407Z",
      "isNew": false,
      "summary": "FFR-guided complete revascularization during the initial procedure significantly lowered the combined risk of death, heart attack, repeat procedures, and stroke within a year, primarily due to fewer repeat revascularizations."
    },
    {
      "id": "f1b1692c8273",
      "title": "Reduction of Antihypertensive Treatment in Nursing Home Residents.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48114363/117558",
      "abstract": "Among older adults with frailty, evidence on the benefits and risks of discontinuing antihypertensive drugs is limited. In a multicenter, randomized, controlled trial conducted in France, we assigned, in a 1:1 ratio, nursing home residents 80 years of age or older who were receiving more than one antihypertensive drug and had a systolic blood pressure below 130 mm Hg to a protocol-driven strategy of progressive reduction of antihypertensive treatment (step-down group) or to receive usual care (usual-care group). Patients were to be followed for up to 4 years. The primary end point was death from any cause. Secondary end points included the changes in the number of antihypertensive drugs being used from baseline to the last trial visit and the change in systolic blood pressure during the follow-up period. A total of 1048 patients underwent randomization: 528 to the step-down group and 520 to the usual-care group. The estimated median potential follow-up was 38.4 months. Between baseline and the last trial visit, the mean (±SD) number of antihypertensive drugs being used decreased from 2.6±0.7 to 1.5±1.1 in the step-down group and from 2.5±0.7 to 2.0±1.1 in the usual-care group. The adjusted mean between-group difference (step-down group minus usual-care group) in the change in systolic blood pressure during the follow-up period was 4.1 mm Hg (95% confidence interval [CI], 1.9 to 5.7). Death from any cause occurred in 326 patients (61.7%) in the step-down group and in 313 (60.2%) in the usual-care group (adjusted hazard ratio, 1.02; 95% CI, 0.86 to 1.21; P = 0.78). There were no apparent differences in adverse events between the trial groups. Among older nursing home residents with frailty who were receiving treatment with antihypertensive agents and had a systolic blood pressure below 130 mm Hg, an antihypertensive treatment step-down strategy did not lead to lower all-cause mortality than usual care. (Funded by the French Ministry of Health and others; RETREAT-FRAIL ClinicalTrials.gov number, NCT03453268.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Among older adults with frailty, evidence on the benefits and risks of discontinuing antihypertensive drugs is limited."
        },
        {
          "label": "METHODS",
          "text": "In a multicenter, randomized, controlled trial conducted in France, we assigned, in a 1:1 ratio, nursing home residents 80 years of age or older who were receiving more than one antihypertensive drug and had a systolic blood pressure below 130 mm Hg to a protocol-driven strategy of progressive reduction of antihypertensive treatment (step-down group) or to receive usual care (usual-care group). Patients were to be followed for up to 4 years. The primary end point was death from any cause. Secondary end points included the changes in the number of antihypertensive drugs being used from baseline to the last trial visit and the change in systolic blood pressure during the follow-up period."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1048 patients underwent randomization: 528 to the step-down group and 520 to the usual-care group. The estimated median potential follow-up was 38.4 months. Between baseline and the last trial visit, the mean (±SD) number of antihypertensive drugs being used decreased from 2.6±0.7 to 1.5±1.1 in the step-down group and from 2.5±0.7 to 2.0±1.1 in the usual-care group. The adjusted mean between-group difference (step-down group minus usual-care group) in the change in systolic blood pressure during the follow-up period was 4.1 mm Hg (95% confidence interval [CI], 1.9 to 5.7). Death from any cause occurred in 326 patients (61.7%) in the step-down group and in 313 (60.2%) in the usual-care group (adjusted hazard ratio, 1.02; 95% CI, 0.86 to 1.21; P = 0.78). There were no apparent differences in adverse events between the trial groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among older nursing home residents with frailty who were receiving treatment with antihypertensive agents and had a systolic blood pressure below 130 mm Hg, an antihypertensive treatment step-down strategy did not lead to lower all-cause mortality than usual care. (Funded by the French Ministry of Health and others; RETREAT-FRAIL ClinicalTrials.gov number, NCT03453268.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40879421/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1056/NEJMoa2508157",
      "dateReceived": "2025-09-18T23:22:23.407Z",
      "isNew": false,
      "summary": "In frail elderly nursing home residents with systolic blood pressure below 130 mm Hg on antihypertensives, stepping down treatment did not reduce all-cause mortality compared to usual care."
    },
    {
      "id": "a29d7574ebdd",
      "title": "Local Postprocedural Cryoprevention Significantly Reduces the Incidence of Post-ERCP Pancreatitis: A Multicenter Randomized Controlled Trial.",
      "journal": "Am J Gastroenterol",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48114363/117439",
      "abstract": "Postendoscopic retrograde cholangiopancreatography (ERCP) pancreatitis (PEP) is a common, potentially serious adverse event of ERCP. Although rectal nonsteroidal anti-inflammatory drugs are recommended for prevention, their use in Japan is limited due to dosage concerns. This multicenter randomized controlled trial evaluated the efficacy and safety of ice water irrigation to the papilla in reducing PEP. This single-blind trial enrolled 880 adults with a native papilla undergoing ERCP at 8 hospitals in Japan (March 2022-February 2024). After 3 withdrawals, 877 were analyzed (cryoprevention: 434; control: 443). The primary outcome was PEP incidence, defined as abdominal pain within 24 hours and serum amylase or lipase ≥3 times the upper normal limit. Secondary outcomes included cholangitis, bleeding, perforation, and mortality. PEP incidence was significantly lower in the cryoprevention group (3.2%; 95% CI, 1.7%-5.4%) than the control group (6.8%; 95% CI, 4.6%-9.6%) ( P = 0.02), with absolute and relative risk reductions of 3.6% and 52.4%. No significant differences were observed in secondary outcomes, including cholangitis (0.9% vs 1.1%; P = 1.00), bleeding (1.4% vs 2.5%; P = 0.33), or perforation (0.9% vs 0.2%; P = 0.21). One control patient died from severe PEP. No adverse events related to cryoprevention were reported. Cryoprevention using ice water significantly reduced PEP incidence, demonstrating a safe, effective, and low-cost strategy. This approach offers a practical alternative, where nonsteroidal anti-inflammatory drugs use is limited.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Postendoscopic retrograde cholangiopancreatography (ERCP) pancreatitis (PEP) is a common, potentially serious adverse event of ERCP. Although rectal nonsteroidal anti-inflammatory drugs are recommended for prevention, their use in Japan is limited due to dosage concerns. This multicenter randomized controlled trial evaluated the efficacy and safety of ice water irrigation to the papilla in reducing PEP."
        },
        {
          "label": "METHODS",
          "text": "This single-blind trial enrolled 880 adults with a native papilla undergoing ERCP at 8 hospitals in Japan (March 2022-February 2024). After 3 withdrawals, 877 were analyzed (cryoprevention: 434; control: 443). The primary outcome was PEP incidence, defined as abdominal pain within 24 hours and serum amylase or lipase ≥3 times the upper normal limit. Secondary outcomes included cholangitis, bleeding, perforation, and mortality."
        },
        {
          "label": "RESULTS",
          "text": "PEP incidence was significantly lower in the cryoprevention group (3.2%; 95% CI, 1.7%-5.4%) than the control group (6.8%; 95% CI, 4.6%-9.6%) ( P = 0.02), with absolute and relative risk reductions of 3.6% and 52.4%. No significant differences were observed in secondary outcomes, including cholangitis (0.9% vs 1.1%; P = 1.00), bleeding (1.4% vs 2.5%; P = 0.33), or perforation (0.9% vs 0.2%; P = 0.21). One control patient died from severe PEP. No adverse events related to cryoprevention were reported."
        },
        {
          "label": "DISCUSSION",
          "text": "Cryoprevention using ice water significantly reduced PEP incidence, demonstrating a safe, effective, and low-cost strategy. This approach offers a practical alternative, where nonsteroidal anti-inflammatory drugs use is limited."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40638082/",
      "pubDate": "2025 Jul 10",
      "doi": "10.14309/ajg.0000000000003644",
      "dateReceived": "2025-09-18T23:22:23.407Z",
      "isNew": false,
      "summary": "Ice water irrigation to the papilla during ERCP significantly reduced the incidence of post-ERCP pancreatitis compared to standard care, with no increase in adverse events."
    }
  ]
}