{
  "updated_at": "2026-02-18T23:38:42.772Z",
  "articles": [
    {
      "id": "b25107f0b1d3",
      "title": "Digital tool for genetic cancer risk assessment in a historically underserved population: a randomized controlled trial.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50029586/118711",
      "dateReceived": "2026-02-18T23:38:22.911Z",
      "isNew": true
    },
    {
      "id": "eb2a563b32b0",
      "title": "Point-of-care ultrasound for hip effusion in children: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50139608/118819",
      "abstract": "Children with hip pain, limp and inability to bear weight often present a diagnostic clinical challenge. Sonography is an ideal first-line imaging modality to assess for effusion, and recent literature suggests that point-of-care ultrasound (POCUS) performed by emergency providers can be safely and accurately performed at the bedside. This systematic review and meta-analysis aims to summarize the diagnostic accuracy of POCUS for pediatric hip effusion. MEDLINE, Embase, Web of Science, CINAHL, and Cochrane Central databases were searched through July 2025, with no date limits, using pre-defined criteria for articles assessing the diagnostic accuracy of POCUS for pediatric hip effusion. Data were extracted and quality assessment was performed using the QUADAS-2 tool. Test characteristics were pooled using a bivariate mixed effects model for meta-analysis. Four studies, with a total of 526 hips scanned, met our inclusion criteria. The reference standard for all included studies was radiology-performed ultrasonography. POCUS demonstrated a pooled sensitivity of 88% (95% CI, 82%-92%), specificity of 97% (95% CI, 93%-99%), positive likelihood ratio of 35 (95% CI, 12.0-100.8), and negative likelihood ratio of 0.13 (0.08-0.19). POCUS has high specificity and moderate sensitivity for hip effusion in children and is a valuable first-line diagnostic tool for evaluating children with hip pain, limp and inability to bear weight in emergency and acute care settings.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Children with hip pain, limp and inability to bear weight often present a diagnostic clinical challenge. Sonography is an ideal first-line imaging modality to assess for effusion, and recent literature suggests that point-of-care ultrasound (POCUS) performed by emergency providers can be safely and accurately performed at the bedside. This systematic review and meta-analysis aims to summarize the diagnostic accuracy of POCUS for pediatric hip effusion."
        },
        {
          "label": "METHODS",
          "text": "MEDLINE, Embase, Web of Science, CINAHL, and Cochrane Central databases were searched through July 2025, with no date limits, using pre-defined criteria for articles assessing the diagnostic accuracy of POCUS for pediatric hip effusion. Data were extracted and quality assessment was performed using the QUADAS-2 tool. Test characteristics were pooled using a bivariate mixed effects model for meta-analysis."
        },
        {
          "label": "RESULTS",
          "text": "Four studies, with a total of 526 hips scanned, met our inclusion criteria. The reference standard for all included studies was radiology-performed ultrasonography. POCUS demonstrated a pooled sensitivity of 88% (95% CI, 82%-92%), specificity of 97% (95% CI, 93%-99%), positive likelihood ratio of 35 (95% CI, 12.0-100.8), and negative likelihood ratio of 0.13 (0.08-0.19)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "POCUS has high specificity and moderate sensitivity for hip effusion in children and is a valuable first-line diagnostic tool for evaluating children with hip pain, limp and inability to bear weight in emergency and acute care settings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41616394/",
      "pubDate": "2026 Jan 21",
      "doi": "10.1016/j.ajem.2026.01.034",
      "dateReceived": "2026-02-18T23:38:22.910Z",
      "isNew": true,
      "summary": "POCUS is."
    },
    {
      "id": "a73561bb1266",
      "title": "Methods of induction of labour: a network meta-analysis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50139608/118776",
      "abstract": "Induction of labour (IoL) aims to initiate labour when the risks of continuing pregnancy outweigh the benefits. Over 10 methods are currently available, yet the most effective and safest method remains unclear. To compare the benefits and harms of various cervical ripening and IoL methods at or beyond term labour and to rank the methods. We searched Cochrane Pregnancy and Childbirth's Trials Register, ClinicalTrials.gov, and the WHO ICTRP until 1 February 2023. We included randomised controlled trials (RCTs) evaluating IoL methods among women with a live fetus at or beyond term labour (gestational age ≥ 37 weeks). We focused on the methods currently recommended by international guidelines and those proposed by previous Cochrane reviews. Our critical outcomes included failure to achieve vaginal delivery within 24 hours, caesarean section due to any causes, caesarean section due to non-reassuring fetal status, uterine hyperstimulation with changes in the heartbeat of the baby before birth, perinatal death, and severe neonatal morbidity. We assessed bias and trustworthiness using the Cochrane RoB 1 tool and the Cochrane Pregnancy and Childbirth Trustworthiness Tool (CPS-TST), respectively. The final analyses only included trials that met the CPS-TST. We performed pair-wise meta-analyses using a random-effects model and network meta-analyses (NMA) with a frequentist approach. We reported analyses and results separately for two populations: 1) women without a previous caesarean section and a mix of women with or without a previous caesarean section (where more than 50% of participants had no previous caesarean section), and 2) women with a previous caesarean section. We used risk ratio (RR) and mean difference (MD) to present treatment effects with 95% confidence intervals (CIs). We assessed the certainty of evidence for critical outcomes using the GRADE approach for NMA. We used the surface under the cumulative ranking curve (SUCRA) to estimate treatment ranking. The analysis included 106 RCTs assessing 13 IoL methods among 30,348 women. Most trials (84.9%) were conducted in inpatient settings. Only two RCTs recruited women with previous caesarean section, and seven RCTs recruited a mix of women with or without a previous caesarean section. We evaluated the effects of the following IoL methods: vaginal misoprostol (≤ 50 μg), oral misoprostol (≤ 50 μg), sublingual or buccal misoprostol (≤ 50 μg), controlled-release misoprostol vaginal pessary, vaginal dinoprostone (tablet or gel), controlled-release dinoprostone vaginal pessary, oxytocin (alone), nitric oxide donors, balloon catheters, osmotic cervical dilators, oxytocin plus amniotomy (Oxytocin+Amniotomy), balloon catheters plus oxytocin (Balloon+Oxytocin), balloon catheters plus vaginal/oral misoprostol (≤ 50 μg) (Balloon+Misoprostol ≤ 50 μg), and inactive methods (placebo, no intervention, and expectant management). The following results show the relative effects of NMA for four of the six critical outcomes among women without previous caesarean section and a mix of women with or without previous caesarean section. The findings of women with previous caesarean section are not presented here due to limited evidence. We used vaginal misoprostol (≤ 50 μg) as the reference method for presenting results, where data for this method were available in the network. 1) Failure to achieve vaginal delivery within 24 hours There was no clear evidence that any of the methods were more effective than vaginal misoprostol (≤ 50 μg) in reducing the risk of this outcome. Oxytocin+Amniotomy (RR 0.41, 95% CI 0.14 to 1.24, 22.4% fewer, moderate-certainty evidence), Balloon+Misoprostol ≤ 50 μg (RR 0.85, 95% CI 0.60 to 1.19, 5.7% fewer, high-certainty evidence), and Balloon+Oxytocin (RR 0.94, 95% CI 0.71 to 1.26, 2.3% fewer, low-certainty evidence) likely resulted in little to no difference in this outcome compared with vaginal misoprostol (≤ 50 μg). Despite the comparable relative treatment effects between some methods and vaginal misoprostol (≤ 50 μg), these three methods ranked highest. 2) Caesarean section due to non-reassuring fetal status There was no clear evidence that any of the methods were more effective than vaginal misoprostol (≤ 50 μg) in reducing the risk of this outcome. Balloon+Oxytocin (RR 0.77, 95% CI 0.47 to 1.25, 2.0% fewer, moderate-certainty evidence), controlled-release dinoprostone vaginal pessary (RR 0.86, 0.62 to 1.18, 1.2% fewer, low-certainty evidence), and balloon catheters (RR 0.88, 95% CI 0.70 to 1.11, 1.0% fewer, low-certainty evidence) may result in little to no difference in this outcome when compared with vaginal misoprostol (≤ 50 μg). Despite the comparable relative treatment effects between all methods and vaginal misoprostol (≤ 50 μg), these three methods ranked highest. 3) Uterine hyperstimulation with changes in the heartbeat of the baby before birth Nitric oxide donors (RR 0.05, 95% CI 0.01 to 0.47, 3.9% fewer, moderate-certainty evidence), osmotic cervical dilators (RR 0.07, 95% CI 0.01 to 0.42, 3.8% fewer, moderate-certainty evidence), balloon catheters (RR 0.38, 95% CI 0.21 to 0.69, 2.5% fewer, moderate-certainty evidence), and oral misoprostol (≤ 50 μg) (RR 0.62, 95% CI 0.39 to 0.99, 1.6% fewer, moderate-certainty evidence) probably reduce this outcome compared with vaginal misoprostol (≤ 50 μg). When compared with inactive interventions (placebo, no intervention, or expectant management), vaginal misoprostol (≤ 50 μg) (RR 3.47, 95% CI 1.16 to 10.35) probably increases the risk of this outcome. The three highest-ranked methods were nitric oxide donors, osmotic cervical dilators, and inactive methods (placebo, no intervention, and expectant management). 4) Perinatal death There was no clear evidence for this outcome, as it was rare (10 cases reported across trials). For women without previous caesarean section and a mix of women with or without previous caesarean section, there was no clear evidence that any of the IoL methods were more effective than vaginal misoprostol (≤ 50 μg) for the outcomes of failure to achieve vaginal delivery within 24 hours, caesarean section due to non-reassuring fetal status, and perinatal death. Nitric oxide donors, osmotic cervical dilators, balloon catheters, and oral misoprostol (≤ 50 μg) probably reduce the risk of uterine hyperstimulation with changes in the heartbeat of the baby before birth. This review had no dedicated funding. Protocol (2023): https://doi.org/10.1002/14651858.CD015234.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Induction of labour (IoL) aims to initiate labour when the risks of continuing pregnancy outweigh the benefits. Over 10 methods are currently available, yet the most effective and safest method remains unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "To compare the benefits and harms of various cervical ripening and IoL methods at or beyond term labour and to rank the methods."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched Cochrane Pregnancy and Childbirth's Trials Register, ClinicalTrials.gov, and the WHO ICTRP until 1 February 2023."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) evaluating IoL methods among women with a live fetus at or beyond term labour (gestational age ≥ 37 weeks). We focused on the methods currently recommended by international guidelines and those proposed by previous Cochrane reviews."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes included failure to achieve vaginal delivery within 24 hours, caesarean section due to any causes, caesarean section due to non-reassuring fetal status, uterine hyperstimulation with changes in the heartbeat of the baby before birth, perinatal death, and severe neonatal morbidity."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed bias and trustworthiness using the Cochrane RoB 1 tool and the Cochrane Pregnancy and Childbirth Trustworthiness Tool (CPS-TST), respectively. The final analyses only included trials that met the CPS-TST."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We performed pair-wise meta-analyses using a random-effects model and network meta-analyses (NMA) with a frequentist approach. We reported analyses and results separately for two populations: 1) women without a previous caesarean section and a mix of women with or without a previous caesarean section (where more than 50% of participants had no previous caesarean section), and 2) women with a previous caesarean section. We used risk ratio (RR) and mean difference (MD) to present treatment effects with 95% confidence intervals (CIs). We assessed the certainty of evidence for critical outcomes using the GRADE approach for NMA. We used the surface under the cumulative ranking curve (SUCRA) to estimate treatment ranking."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "The analysis included 106 RCTs assessing 13 IoL methods among 30,348 women. Most trials (84.9%) were conducted in inpatient settings. Only two RCTs recruited women with previous caesarean section, and seven RCTs recruited a mix of women with or without a previous caesarean section."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We evaluated the effects of the following IoL methods: vaginal misoprostol (≤ 50 μg), oral misoprostol (≤ 50 μg), sublingual or buccal misoprostol (≤ 50 μg), controlled-release misoprostol vaginal pessary, vaginal dinoprostone (tablet or gel), controlled-release dinoprostone vaginal pessary, oxytocin (alone), nitric oxide donors, balloon catheters, osmotic cervical dilators, oxytocin plus amniotomy (Oxytocin+Amniotomy), balloon catheters plus oxytocin (Balloon+Oxytocin), balloon catheters plus vaginal/oral misoprostol (≤ 50 μg) (Balloon+Misoprostol ≤ 50 μg), and inactive methods (placebo, no intervention, and expectant management). The following results show the relative effects of NMA for four of the six critical outcomes among women without previous caesarean section and a mix of women with or without previous caesarean section. The findings of women with previous caesarean section are not presented here due to limited evidence. We used vaginal misoprostol (≤ 50 μg) as the reference method for presenting results, where data for this method were available in the network. 1) Failure to achieve vaginal delivery within 24 hours There was no clear evidence that any of the methods were more effective than vaginal misoprostol (≤ 50 μg) in reducing the risk of this outcome. Oxytocin+Amniotomy (RR 0.41, 95% CI 0.14 to 1.24, 22.4% fewer, moderate-certainty evidence), Balloon+Misoprostol ≤ 50 μg (RR 0.85, 95% CI 0.60 to 1.19, 5.7% fewer, high-certainty evidence), and Balloon+Oxytocin (RR 0.94, 95% CI 0.71 to 1.26, 2.3% fewer, low-certainty evidence) likely resulted in little to no difference in this outcome compared with vaginal misoprostol (≤ 50 μg). Despite the comparable relative treatment effects between some methods and vaginal misoprostol (≤ 50 μg), these three methods ranked highest. 2) Caesarean section due to non-reassuring fetal status There was no clear evidence that any of the methods were more effective than vaginal misoprostol (≤ 50 μg) in reducing the risk of this outcome. Balloon+Oxytocin (RR 0.77, 95% CI 0.47 to 1.25, 2.0% fewer, moderate-certainty evidence), controlled-release dinoprostone vaginal pessary (RR 0.86, 0.62 to 1.18, 1.2% fewer, low-certainty evidence), and balloon catheters (RR 0.88, 95% CI 0.70 to 1.11, 1.0% fewer, low-certainty evidence) may result in little to no difference in this outcome when compared with vaginal misoprostol (≤ 50 μg). Despite the comparable relative treatment effects between all methods and vaginal misoprostol (≤ 50 μg), these three methods ranked highest. 3) Uterine hyperstimulation with changes in the heartbeat of the baby before birth Nitric oxide donors (RR 0.05, 95% CI 0.01 to 0.47, 3.9% fewer, moderate-certainty evidence), osmotic cervical dilators (RR 0.07, 95% CI 0.01 to 0.42, 3.8% fewer, moderate-certainty evidence), balloon catheters (RR 0.38, 95% CI 0.21 to 0.69, 2.5% fewer, moderate-certainty evidence), and oral misoprostol (≤ 50 μg) (RR 0.62, 95% CI 0.39 to 0.99, 1.6% fewer, moderate-certainty evidence) probably reduce this outcome compared with vaginal misoprostol (≤ 50 μg). When compared with inactive interventions (placebo, no intervention, or expectant management), vaginal misoprostol (≤ 50 μg) (RR 3.47, 95% CI 1.16 to 10.35) probably increases the risk of this outcome. The three highest-ranked methods were nitric oxide donors, osmotic cervical dilators, and inactive methods (placebo, no intervention, and expectant management). 4) Perinatal death There was no clear evidence for this outcome, as it was rare (10 cases reported across trials)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "For women without previous caesarean section and a mix of women with or without previous caesarean section, there was no clear evidence that any of the IoL methods were more effective than vaginal misoprostol (≤ 50 μg) for the outcomes of failure to achieve vaginal delivery within 24 hours, caesarean section due to non-reassuring fetal status, and perinatal death. Nitric oxide donors, osmotic cervical dilators, balloon catheters, and oral misoprostol (≤ 50 μg) probably reduce the risk of uterine hyperstimulation with changes in the heartbeat of the baby before birth."
        },
        {
          "label": "FUNDING",
          "text": "This review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2023): https://doi.org/10.1002/14651858.CD015234."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41587762/",
      "pubDate": "2026 Jan 27",
      "doi": "10.1002/14651858.CD015234.pub2",
      "dateReceived": "2026-02-18T23:38:22.910Z",
      "isNew": true,
      "summary": "For women."
    },
    {
      "id": "8bc9dd490e30",
      "title": "Interval cancer, sensitivity, and specificity comparing AI-supported mammography screening with standard double reading without AI in the MASAI study: a randomised, controlled, non-inferiority, single-blinded, population-based, screening-accuracy trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50012509/118760",
      "abstract": "Evidence indicates that artificial intelligence (AI) can improve mammography screening by increasing cancer detection and reducing screen reading workload, but its effect on interval cancers (primary breast cancers diagnosed between two screening rounds or within 2 years after the last scheduled screening that were not detected at screening) is unknown. We aimed to compare the interval cancer rate in AI-supported mammography screening with standard double reading without AI. In this Swedish randomised, controlled, non-inferiority, single-blinded, population-based screening accuracy trial, participants were allocated in a 1:1 ratio to either AI-supported mammography screening (the intervention group) or standard double reading without AI (the control group). AI was used to triage examinations to single or double reading by radiologists and for detection support. This is a protocol-defined analysis of the primary outcome, interval cancer rate, with a 20% non-inferiority margin. Secondary outcomes reported in this analysis are interval cancer characteristics, sensitivity, specificity, and sensitivity by age, breast density, and cancer type (in-situ and invasive). Other secondary outcomes from the trial that have been previously reported are referenced in the Methods section of this Article. The trial is registered with ClinicalTrials.gov (NCT04838756) and is complete. Between April 12, 2021, and Dec 7, 2022, 105 934 women were randomly assigned to the intervention or control group, of whom 19 were excluded from the analysis. Median age was 53·8 years (IQR 46·5-63·3) in the intervention group and 53·7 years (46·5-63·2) in the control group. Interval cancer rates were 1·55 (95% CI 1·23-1·92) and 1·76 (1·42-2·15) per 1000 participants in the intervention and control group respectively, a non-inferior proportion ratio of 0·88 (95% CI 0·65-1·18; p=0·41). Descriptively, the intervention group had fewer interval cancers that were invasive (75 vs 89), T2+ (38 vs 48), or non-luminal A (43 vs 59) than the control group. Sensitivity was higher in the intervention group (80·5% [95% CI 76·4-84·2]) than the control group (73·8% [68·9-78·3]; p=0·031), an effect consistent across age and breast density, and for invasive cancer but not for in-situ cancer. Specificity was 98·5% (95% CI 98·4-98·6) for both groups (p=0·88). AI-supported mammography screening showed consistently favourable outcomes compared with standard double reading, with a non-inferior interval cancer rate, fewer interval cancers with unfavourable characteristics, higher sensitivity, and the same specificity, while also reducing screen reading workload. These findings imply that AI-supported mammography screening can efficiently improve screening performance compared with standard double reading and may be considered for implementation in clinical practice. Swedish Cancer Society, Confederation of Regional Cancer Centres, Swedish governmental funding for clinical research.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Evidence indicates that artificial intelligence (AI) can improve mammography screening by increasing cancer detection and reducing screen reading workload, but its effect on interval cancers (primary breast cancers diagnosed between two screening rounds or within 2 years after the last scheduled screening that were not detected at screening) is unknown. We aimed to compare the interval cancer rate in AI-supported mammography screening with standard double reading without AI."
        },
        {
          "label": "METHODS",
          "text": "In this Swedish randomised, controlled, non-inferiority, single-blinded, population-based screening accuracy trial, participants were allocated in a 1:1 ratio to either AI-supported mammography screening (the intervention group) or standard double reading without AI (the control group). AI was used to triage examinations to single or double reading by radiologists and for detection support. This is a protocol-defined analysis of the primary outcome, interval cancer rate, with a 20% non-inferiority margin. Secondary outcomes reported in this analysis are interval cancer characteristics, sensitivity, specificity, and sensitivity by age, breast density, and cancer type (in-situ and invasive). Other secondary outcomes from the trial that have been previously reported are referenced in the Methods section of this Article. The trial is registered with ClinicalTrials.gov (NCT04838756) and is complete."
        },
        {
          "label": "FINDINGS",
          "text": "Between April 12, 2021, and Dec 7, 2022, 105 934 women were randomly assigned to the intervention or control group, of whom 19 were excluded from the analysis. Median age was 53·8 years (IQR 46·5-63·3) in the intervention group and 53·7 years (46·5-63·2) in the control group. Interval cancer rates were 1·55 (95% CI 1·23-1·92) and 1·76 (1·42-2·15) per 1000 participants in the intervention and control group respectively, a non-inferior proportion ratio of 0·88 (95% CI 0·65-1·18; p=0·41). Descriptively, the intervention group had fewer interval cancers that were invasive (75 vs 89), T2+ (38 vs 48), or non-luminal A (43 vs 59) than the control group. Sensitivity was higher in the intervention group (80·5% [95% CI 76·4-84·2]) than the control group (73·8% [68·9-78·3]; p=0·031), an effect consistent across age and breast density, and for invasive cancer but not for in-situ cancer. Specificity was 98·5% (95% CI 98·4-98·6) for both groups (p=0·88)."
        },
        {
          "label": "INTERPRETATION",
          "text": "AI-supported mammography screening showed consistently favourable outcomes compared with standard double reading, with a non-inferior interval cancer rate, fewer interval cancers with unfavourable characteristics, higher sensitivity, and the same specificity, while also reducing screen reading workload. These findings imply that AI-supported mammography screening can efficiently improve screening performance compared with standard double reading and may be considered for implementation in clinical practice."
        },
        {
          "label": "FUNDING",
          "text": "Swedish Cancer Society, Confederation of Regional Cancer Centres, Swedish governmental funding for clinical research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41620232/",
      "pubDate": "2026 Jan 31",
      "doi": "10.1016/S0140-6736(25)02464-X",
      "dateReceived": "2026-02-17T23:37:46.316Z",
      "isNew": false
    },
    {
      "id": "341ae90a213e",
      "title": "Patent Foramen Ovale Closure in Stroke and the PASCAL Classification System.",
      "journal": "JAMA Neurol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50126244/118799",
      "abstract": "Patent foramen ovale (PFO) closure decreases recurrent stroke but increases atrial fibrillation (AF). Careful selection of patients in whom PFO is more likely to be the cause of stroke may improve outcomes by avoiding closure in patients unlikely to benefit. To determine whether the PFO-Associated Stroke Causal Likelihood (PASCAL) classification system identifies who will experience net benefit and net harm from PFO closure. This meta-analysis was a secondary analysis of individual participant-level data from the Systematic, Collaborative, PFO Closure Evaluation (SCOPE) consortium meta-analysis, including all 6 randomized trials of transcatheter PFO closure vs antithrombotic therapy alone. Participants were young and middle-aged adults (mean [SD] age, 45 [10] years) with a PFO and an otherwise cryptogenic stroke. The trials were conducted in hospitals in North America, Europe, Australia, Brazil, and South Korea from 2000 to 2017. The current analysis, involving all trial participants, was performed from January to August 2025. Transcatheter PFO closure plus antithrombotic therapy vs antithrombotic therapy alone. The primary efficacy end point was recurrent ischemic stroke. The primary safety end point was first-ever detection of AF beyond the periprocedural period (>45 days after randomization). The 6 trials enrolled 3740 patients (1889 who had PFO closure, 1851 who had medical therapy); 2058 patients (55.0%) were male, and 1682 (45.0%) were female. Among patients in all 6 trials, PASCAL classified PFO relatedness to the index stroke as probable in 1382 patients (37.0%), possible in 1811 (48.4%), and unlikely in 547 (14.6%); among the 2967 patients in the 4 trials with broad entry criteria, PASCAL classified PFO relatedness as probable in 860 patients (29.0%), possible in 1565 (52.7%), and unlikely in 543 (18.3%). The reduction in the absolute rate of recurrent ischemic strokes over 5 years was greater than the increase in first-ever detection of AF in the postperiprocedural period as follows: in the probable group, fewer strokes, -2.5% (95% CI, -4.2% to -1.3%) vs more late AF, 1.3% (95% CI, 0.0% to 2.5%), and in the possible group, fewer strokes -3.4% (95% CI, -5.4% to -1.3%) vs more late AF, 1.1% (95% CI, -0.5% to 2.6%). Reduction in recurrent ischemic strokes was not observed and increase in first-ever detected postperiprocedural AF was magnified in the unlikely group (more strokes, 0.4%; 95% CI, -4.0% to 4.8%, vs more late AF, 4.6%; 95% CI, 0.3% to 8.9%). Among young and middle-aged patients with PFO and otherwise cryptogenic stroke, the PASCAL classification algorithm distinguished the 4 of every 5 patients in the probable and possible groups with net benefit and the 1 of every 5 patients in the unlikely group with net harm from closure.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Patent foramen ovale (PFO) closure decreases recurrent stroke but increases atrial fibrillation (AF). Careful selection of patients in whom PFO is more likely to be the cause of stroke may improve outcomes by avoiding closure in patients unlikely to benefit."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether the PFO-Associated Stroke Causal Likelihood (PASCAL) classification system identifies who will experience net benefit and net harm from PFO closure."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This meta-analysis was a secondary analysis of individual participant-level data from the Systematic, Collaborative, PFO Closure Evaluation (SCOPE) consortium meta-analysis, including all 6 randomized trials of transcatheter PFO closure vs antithrombotic therapy alone. Participants were young and middle-aged adults (mean [SD] age, 45 [10] years) with a PFO and an otherwise cryptogenic stroke. The trials were conducted in hospitals in North America, Europe, Australia, Brazil, and South Korea from 2000 to 2017. The current analysis, involving all trial participants, was performed from January to August 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Transcatheter PFO closure plus antithrombotic therapy vs antithrombotic therapy alone."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy end point was recurrent ischemic stroke. The primary safety end point was first-ever detection of AF beyond the periprocedural period (>45 days after randomization)."
        },
        {
          "label": "RESULTS",
          "text": "The 6 trials enrolled 3740 patients (1889 who had PFO closure, 1851 who had medical therapy); 2058 patients (55.0%) were male, and 1682 (45.0%) were female. Among patients in all 6 trials, PASCAL classified PFO relatedness to the index stroke as probable in 1382 patients (37.0%), possible in 1811 (48.4%), and unlikely in 547 (14.6%); among the 2967 patients in the 4 trials with broad entry criteria, PASCAL classified PFO relatedness as probable in 860 patients (29.0%), possible in 1565 (52.7%), and unlikely in 543 (18.3%). The reduction in the absolute rate of recurrent ischemic strokes over 5 years was greater than the increase in first-ever detection of AF in the postperiprocedural period as follows: in the probable group, fewer strokes, -2.5% (95% CI, -4.2% to -1.3%) vs more late AF, 1.3% (95% CI, 0.0% to 2.5%), and in the possible group, fewer strokes -3.4% (95% CI, -5.4% to -1.3%) vs more late AF, 1.1% (95% CI, -0.5% to 2.6%). Reduction in recurrent ischemic strokes was not observed and increase in first-ever detected postperiprocedural AF was magnified in the unlikely group (more strokes, 0.4%; 95% CI, -4.0% to 4.8%, vs more late AF, 4.6%; 95% CI, 0.3% to 8.9%)."
        },
        {
          "label": "CONCLUSION AND RELEVANCE",
          "text": "Among young and middle-aged patients with PFO and otherwise cryptogenic stroke, the PASCAL classification algorithm distinguished the 4 of every 5 patients in the probable and possible groups with net benefit and the 1 of every 5 patients in the unlikely group with net harm from closure."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41587059/",
      "pubDate": "2026 Jan 26",
      "doi": "10.1001/jamaneurol.2025.5446",
      "dateReceived": "2026-02-17T23:37:46.315Z",
      "isNew": false,
      "summary": "The P."
    },
    {
      "id": "9b6ca6aaa897",
      "title": "Prasugrel or ticagrelor monotherapy vs dual antiplatelet treatment after percutaneous coronary intervention in acute coronary syndromes: a landmark analysis from the NEOMINDSET trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50108513/118822",
      "abstract": "The optimal duration of dual antiplatelet therapy (DAPT) after percutaneous coronary intervention in patients with acute coronary syndrome remains uncertain. This analysis examined the temporal patterns of ischaemic and bleeding risks of early aspirin withdrawal compared with DAPT. NEO-MINDSET randomized 3410 acute coronary syndrome patients undergoing successful percutaneous coronary intervention with drug-eluting stents within 4 days of hospital admission to either potent P2Y12 inhibitor monotherapy (prasugrel or ticagrelor) or standard DAPT (aspirin plus a potent P2Y12 inhibitor) for 12 months. This prespecified landmark analysis examined early (0-30 days) and late (31-365 days) follow-up events. Co-primary outcomes were (i) the composite of all cause death, myocardial infarction, stroke, or urgent target-vessel revascularization (ischaemic outcome) and (ii) Bleeding Academic Research Consortium type 2, 3, or 5 bleeding. At 30 days, the composite ischaemic outcome occurred in 3.3% of patients receiving monotherapy vs 1.8% with DAPT (risk difference 1.5%, 95% confidence interval .4%-2.6%; P = .006). Bleeding occurred in .6% vs 1.5% (risk difference -.8%, 95% confidence interval -1.5%-.1%; P = .018). In the landmark analysis between Days 31 and 365, ischaemic outcome rates were similar between study groups (3.8% each; P = .977), while bleeding remained less frequent with monotherapy (1.3% vs 3.5%; risk difference -2.2%, 95% confidence interval -3.2%-1.1%; P > .001). This prespecified 30-day landmark analysis suggests an excess of ischaemic risk with monotherapy vs DAPT in the first 30 days but not thereafter, whereas an aspirin-free strategy was consistently associated with fewer bleeding events within and after 30 days.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "The optimal duration of dual antiplatelet therapy (DAPT) after percutaneous coronary intervention in patients with acute coronary syndrome remains uncertain. This analysis examined the temporal patterns of ischaemic and bleeding risks of early aspirin withdrawal compared with DAPT."
        },
        {
          "label": "METHODS",
          "text": "NEO-MINDSET randomized 3410 acute coronary syndrome patients undergoing successful percutaneous coronary intervention with drug-eluting stents within 4 days of hospital admission to either potent P2Y12 inhibitor monotherapy (prasugrel or ticagrelor) or standard DAPT (aspirin plus a potent P2Y12 inhibitor) for 12 months. This prespecified landmark analysis examined early (0-30 days) and late (31-365 days) follow-up events. Co-primary outcomes were (i) the composite of all cause death, myocardial infarction, stroke, or urgent target-vessel revascularization (ischaemic outcome) and (ii) Bleeding Academic Research Consortium type 2, 3, or 5 bleeding."
        },
        {
          "label": "RESULTS",
          "text": "At 30 days, the composite ischaemic outcome occurred in 3.3% of patients receiving monotherapy vs 1.8% with DAPT (risk difference 1.5%, 95% confidence interval .4%-2.6%; P = .006). Bleeding occurred in .6% vs 1.5% (risk difference -.8%, 95% confidence interval -1.5%-.1%; P = .018). In the landmark analysis between Days 31 and 365, ischaemic outcome rates were similar between study groups (3.8% each; P = .977), while bleeding remained less frequent with monotherapy (1.3% vs 3.5%; risk difference -2.2%, 95% confidence interval -3.2%-1.1%; P > .001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This prespecified 30-day landmark analysis suggests an excess of ischaemic risk with monotherapy vs DAPT in the first 30 days but not thereafter, whereas an aspirin-free strategy was consistently associated with fewer bleeding events within and after 30 days."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41412791/",
      "pubDate": "2025 Dec 19",
      "doi": "10.1093/eurheartj/ehaf1050",
      "dateReceived": "2026-02-16T23:37:34.549Z",
      "isNew": false,
      "summary": "Monotherapy carries."
    },
    {
      "id": "d10c03eae2df",
      "title": "Care of Bereaved Persons : A Systematic Review.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49993979/118768",
      "dateReceived": "2026-02-15T23:35:29.655Z",
      "isNew": false
    },
    {
      "id": "0dce5a486709",
      "title": "Efficacy and safety of once-weekly insulins in type 2 diabetes: A systematic review and meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49993979/118764",
      "abstract": "Once-weekly (OW) insulins represent a promising strategy to reduce injection burden and improve adherence in type 2 diabetes management. This meta-analysis aimed to quantify pooled effect sizes for key biological and clinical outcomes, integrating new findings from the five large trials published in 2025. We systematically searched PubMed, WoS, ClinicalTrials.gov and EU Clinical Trials databases up to June 2025 for randomized controlled trials (RCTs) evaluating OW insulins in type 2 diabetes. Primary outcomes included efficacy (HbA1c, fasting plasma glucose (FPG), time-in-range (TIR), time-above-range) and safety outcomes (body weight, hypoglycaemia, time-below-range). Data were analysed using both frequentist and Bayesian approaches. Among 435 screened records, 16 RCTs were included. OW insulins achieved a greater reduction in HbA1c compared to once-daily insulin or semaglutide (pooled mean difference: -0.12%, 95% CI: -0.19 to -0.04, p = 0.007). TIR was significantly longer in the OW insulin group (+2.41% of total time, 95% CI: 1.13 to 3.69, p = 0.002), while FPG changes were comparable (-3.37 mg/dL, 95% CI: -7.95 to 1.21 mg/dL, p = 0.14). Body weight changes were generally similar, but excluding trials using IcoSema revealed a modest weight gain (+0.33 kg, 95% CI: 0.04 to 0.62, p = 0.030). The incidence of clinically significant or severe hypoglycaemia did not differ between groups (pooled incidence rate ratio: 1.04, 95% CI: 0.79 to 1.28, p = 0.75). Meta-regression confirmed consistent effect sizes across OW insulin types, treatment durations and prior insulin regimens. OW insulins modestly improve glycaemic control without increasing hypoglycaemia risk, though slight weight gain may occur.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Once-weekly (OW) insulins represent a promising strategy to reduce injection burden and improve adherence in type 2 diabetes management. This meta-analysis aimed to quantify pooled effect sizes for key biological and clinical outcomes, integrating new findings from the five large trials published in 2025."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We systematically searched PubMed, WoS, ClinicalTrials.gov and EU Clinical Trials databases up to June 2025 for randomized controlled trials (RCTs) evaluating OW insulins in type 2 diabetes. Primary outcomes included efficacy (HbA1c, fasting plasma glucose (FPG), time-in-range (TIR), time-above-range) and safety outcomes (body weight, hypoglycaemia, time-below-range). Data were analysed using both frequentist and Bayesian approaches."
        },
        {
          "label": "RESULTS",
          "text": "Among 435 screened records, 16 RCTs were included. OW insulins achieved a greater reduction in HbA1c compared to once-daily insulin or semaglutide (pooled mean difference: -0.12%, 95% CI: -0.19 to -0.04, p = 0.007). TIR was significantly longer in the OW insulin group (+2.41% of total time, 95% CI: 1.13 to 3.69, p = 0.002), while FPG changes were comparable (-3.37 mg/dL, 95% CI: -7.95 to 1.21 mg/dL, p = 0.14). Body weight changes were generally similar, but excluding trials using IcoSema revealed a modest weight gain (+0.33 kg, 95% CI: 0.04 to 0.62, p = 0.030). The incidence of clinically significant or severe hypoglycaemia did not differ between groups (pooled incidence rate ratio: 1.04, 95% CI: 0.79 to 1.28, p = 0.75). Meta-regression confirmed consistent effect sizes across OW insulin types, treatment durations and prior insulin regimens."
        },
        {
          "label": "CONCLUSIONS",
          "text": "OW insulins modestly improve glycaemic control without increasing hypoglycaemia risk, though slight weight gain may occur."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41574970/",
      "pubDate": "2026 Jan 23",
      "doi": "10.1111/dom.70497",
      "dateReceived": "2026-02-15T23:35:29.655Z",
      "isNew": false
    },
    {
      "id": "c4ecc574b407",
      "title": "Device-Assisted vs Standard Valsalva Maneuver for Terminating Supraventricular Tachycardia: A Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50092508/118832",
      "abstract": "Although Valsalva maneuver (VM) remains the guideline-directed emergent treatment for supraventricular tachycardia (SVT), its success rate remains suboptimal. To assess the efficacy of a novel handheld Valsalva assist device, which can assist in achieving and maintaining target intrathoracic pressures, in improving sinus rhythm restoration rates in patients with SVT. This single-center, open-label randomized clinical trial conducted at Beijing Anzhen Hospital randomized patients with SVT (aged 16-80 years, enrolled between April 2022 and April 2023) undergoing electrophysiological study at a tertiary hospital. Data analysis was completed from January 2024 to January 2025. Participants received either device-assisted VM (n = 106) or standard VM (n = 106) during induced SVT. The primary outcome was immediate cardioversion success (12-lead electrocardiogram-confirmed sinus rhythm within 1 minute) postintervention by intention-to-treat analysis. A total of 212 patients were randomized, among whom 210 completed the randomly assigned VM and were included in the primary analysis (106 in the standard VM group and 104 in the device-assisted VM group). Mean (SD) patient age was 48.4 (14.0) years, and 114 patients (54.8%) were female. After 2 VMs, 67 of 106 participants in the VM with device assist group (63.2%) vs 31 of 106 participants in the standard VM group (29.2%) converted to sinus rhythm within 1 minute (odds ratio, 4.16; 95% CI, 2.36-7.47; P < .001). Per the results of this randomized clinical trial, the handheld Valsalva assist device significantly enhances VM effectiveness, providing a potentially implementable solution for SVT management. ClinicalTrials.gov Identifier: NCT06622772.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Although Valsalva maneuver (VM) remains the guideline-directed emergent treatment for supraventricular tachycardia (SVT), its success rate remains suboptimal."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy of a novel handheld Valsalva assist device, which can assist in achieving and maintaining target intrathoracic pressures, in improving sinus rhythm restoration rates in patients with SVT."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This single-center, open-label randomized clinical trial conducted at Beijing Anzhen Hospital randomized patients with SVT (aged 16-80 years, enrolled between April 2022 and April 2023) undergoing electrophysiological study at a tertiary hospital. Data analysis was completed from January 2024 to January 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Participants received either device-assisted VM (n = 106) or standard VM (n = 106) during induced SVT."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was immediate cardioversion success (12-lead electrocardiogram-confirmed sinus rhythm within 1 minute) postintervention by intention-to-treat analysis."
        },
        {
          "label": "RESULTS",
          "text": "A total of 212 patients were randomized, among whom 210 completed the randomly assigned VM and were included in the primary analysis (106 in the standard VM group and 104 in the device-assisted VM group). Mean (SD) patient age was 48.4 (14.0) years, and 114 patients (54.8%) were female. After 2 VMs, 67 of 106 participants in the VM with device assist group (63.2%) vs 31 of 106 participants in the standard VM group (29.2%) converted to sinus rhythm within 1 minute (odds ratio, 4.16; 95% CI, 2.36-7.47; P < .001)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Per the results of this randomized clinical trial, the handheld Valsalva assist device significantly enhances VM effectiveness, providing a potentially implementable solution for SVT management."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT06622772."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41670992/",
      "pubDate": "2026 Feb 11",
      "doi": "10.1001/jamacardio.2025.5489",
      "dateReceived": "2026-02-14T23:33:19.018Z",
      "isNew": false,
      "summary": "The."
    },
    {
      "id": "6eeddb2ddd50",
      "title": "Emergency Department-Initiated Buprenorphine for Opioid Use Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50092508/118833",
      "abstract": "Extended-release injectable buprenorphine may expand the reach of initiating medications for opioid use disorder in high-risk and hard-to-reach individuals who visit the emergency department (ED) and can be administered in low levels of withdrawal. To compare the effect of ED-initiated 7-day extended-release injectable buprenorphine vs sublingual buprenorphine on treatment engagement at 7 days. Multicenter randomized clinical trial enrolling adult patients presenting to the ED with untreated opioid use disorder and a Clinical Opiate Withdrawal Scale (COWS) score of 4 or higher across 29 EDs in the US from July 12, 2020, to August 21, 2024. Final follow-up was completed on October 24, 2024. Patients were randomized to receive a 24-mg injection of extended-release buprenorphine (equivalent to 16 mg/d) or sublingual buprenorphine, which included either self-administration instructions if the COWS score was less than 8 or administration of 8 mg of sublingual buprenorphine in the ED if the COWS score was 8 or higher. All sublingual buprenorphine group patients received a 7-day prescription for 16 mg/d. Both groups were provided referral for ongoing medication with a scheduled appointment within 7 days. Engagement in opioid use disorder treatment on day 7 was the primary outcome. Secondary outcomes included engagement at 30 days, precipitated withdrawal and overdose events, craving scores, days of illicit opioid use, and patient satisfaction with treatment. Among 2000 patients randomized, 6 who were enrolled twice were excluded, resulting in 991 in the extended-release group and 1003 in the sublingual group. The median age was 37 (IQR, 30-47) years, 68% were male, 31% had an initial COWS score of 4 to 7, and 76% tested positive for fentanyl. The adjusted proportion of engagement in opioid use disorder treatment at 7 days was 40.5% with extended-release buprenorphine vs 38.5% with sublingual buprenorphine (adjusted difference, 1.6%; 95% CI, -2.8% to 6.0%). Engagement at 30 days was similar, with adjusted proportions of 43.8% with extended-release buprenorphine vs 44.9% with sublingual buprenorphine (adjusted difference, -1.5%; 95% CI, -6.2% to 3.2%). Precipitated withdrawal was rare: 6 (0.6%) with extended-release buprenorphine and 8 (0.8%) with sublingual buprenorphine. Overdose events within 30 days occurred in 18 participants (2.3%) in each group. Patients receiving extended-release buprenorphine reported lower mean craving scores at 7 days vs those receiving sublingual buprenorphine (scale, 0-100; mean score, 26.5 vs 30.2, respectively; adjusted mean difference, -3.85; 95% CI, -7.08 to -0.63), fewer days of illicit opioid use in the past 7 days (adjusted ratio of means, 0.77; 95% CI, 0.68-0.95), and better treatment satisfaction scores (scale, 1-5; adjusted mean difference, 0.13; 95% CI, 0.01-0.25). No difference was detected in opioid use disorder treatment engagement on day 7 between the 7-day extended-release and sublingual buprenorphine groups. Both buprenorphine formulations were well tolerated; precipitated withdrawal was rare despite a high prevalence of fentanyl. ClinicalTrials.gov Identifier: NCT04225598.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Extended-release injectable buprenorphine may expand the reach of initiating medications for opioid use disorder in high-risk and hard-to-reach individuals who visit the emergency department (ED) and can be administered in low levels of withdrawal."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the effect of ED-initiated 7-day extended-release injectable buprenorphine vs sublingual buprenorphine on treatment engagement at 7 days."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Multicenter randomized clinical trial enrolling adult patients presenting to the ED with untreated opioid use disorder and a Clinical Opiate Withdrawal Scale (COWS) score of 4 or higher across 29 EDs in the US from July 12, 2020, to August 21, 2024. Final follow-up was completed on October 24, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomized to receive a 24-mg injection of extended-release buprenorphine (equivalent to 16 mg/d) or sublingual buprenorphine, which included either self-administration instructions if the COWS score was less than 8 or administration of 8 mg of sublingual buprenorphine in the ED if the COWS score was 8 or higher. All sublingual buprenorphine group patients received a 7-day prescription for 16 mg/d. Both groups were provided referral for ongoing medication with a scheduled appointment within 7 days."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Engagement in opioid use disorder treatment on day 7 was the primary outcome. Secondary outcomes included engagement at 30 days, precipitated withdrawal and overdose events, craving scores, days of illicit opioid use, and patient satisfaction with treatment."
        },
        {
          "label": "RESULTS",
          "text": "Among 2000 patients randomized, 6 who were enrolled twice were excluded, resulting in 991 in the extended-release group and 1003 in the sublingual group. The median age was 37 (IQR, 30-47) years, 68% were male, 31% had an initial COWS score of 4 to 7, and 76% tested positive for fentanyl. The adjusted proportion of engagement in opioid use disorder treatment at 7 days was 40.5% with extended-release buprenorphine vs 38.5% with sublingual buprenorphine (adjusted difference, 1.6%; 95% CI, -2.8% to 6.0%). Engagement at 30 days was similar, with adjusted proportions of 43.8% with extended-release buprenorphine vs 44.9% with sublingual buprenorphine (adjusted difference, -1.5%; 95% CI, -6.2% to 3.2%). Precipitated withdrawal was rare: 6 (0.6%) with extended-release buprenorphine and 8 (0.8%) with sublingual buprenorphine. Overdose events within 30 days occurred in 18 participants (2.3%) in each group. Patients receiving extended-release buprenorphine reported lower mean craving scores at 7 days vs those receiving sublingual buprenorphine (scale, 0-100; mean score, 26.5 vs 30.2, respectively; adjusted mean difference, -3.85; 95% CI, -7.08 to -0.63), fewer days of illicit opioid use in the past 7 days (adjusted ratio of means, 0.77; 95% CI, 0.68-0.95), and better treatment satisfaction scores (scale, 1-5; adjusted mean difference, 0.13; 95% CI, 0.01-0.25)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "No difference was detected in opioid use disorder treatment engagement on day 7 between the 7-day extended-release and sublingual buprenorphine groups. Both buprenorphine formulations were well tolerated; precipitated withdrawal was rare despite a high prevalence of fentanyl."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04225598."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41670966/",
      "pubDate": "2026 Feb 11",
      "doi": "10.1001/jama.2025.27019",
      "dateReceived": "2026-02-14T23:33:19.017Z",
      "isNew": false,
      "summary": "Both extended-release."
    },
    {
      "id": "033c32aa3651",
      "title": "Assessment of adverse effects attributed to statin therapy in product labels: a meta-analysis of double-blind randomised controlled trials.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50079037/118811",
      "abstract": "Statin product labels (eg, Summaries of Product Characteristics [SmPCs]) list certain adverse outcomes as potential treatment-related effects based mainly on non-randomised and non-blinded studies, which might be subject to bias. We aimed to assess the evidence for such undesirable effects more reliably through a meta-analysis of individual participant data from large double-blind trials of statin therapy. In this meta-analysis of individual participant-level data from double-blind randomised controlled trials, we generated a list of all undesirable effect terms listed in statin SmPCs by searching an electronic medicines compendium for five statins (atorvastatin, fluvastatin, pravastatin, rosuvastatin, and simvastatin). Randomised trials were eligible for meta-analysis of these effects if they involved at least 1000 participants, had a scheduled treatment period of at least 2 years, and involved a double-blind comparison of statin versus placebo or of a more intensive versus a less intensive statin regimen. Event rate ratios (RRs) and 95% CIs were calculated with statistical significance assessed after controlling the false discovery rate (FDR) at 5%. 19 trials compared statin versus placebo (123 940 participants, median follow-up 4·5 years [IQR 3·1-5·4]). In addition to previously reported effects on muscle outcomes and diabetes, only four of 66 further undesirable outcomes that had been attributed to statins were FDR significant: abnormal liver transaminases (783 participants [0·30% per annum] allocated statin vs 556 [0·22% per annum] allocated placebo, RR 1·41 [95% CI 1·26-1·57]) and other liver function test abnormalities (651 participants [0·25% per annum] allocated statin vs 518 [0·20% per annum] allocated placebo, RR 1·26 [1·12-1·41]; absolute annual excess of 0·13% for combined liver function test abnormality), urinary composition alteration (556 [0·21% per annum] allocated statin vs 472 [0·18% per annum] allocated placebo, RR 1·18 [1·04-1·33]), and oedema (3495 [1·38% per annum] allocated statin vs 3299 [1·31% per annum] allocated placebo, RR 1·07 [1·02-1·12]). Analysis of the four trials of more intensive versus less intensive statin regimens also found significant excesses for abnormal liver transaminases and other liver function test abnormalities (supporting a dose-dependent effect), but no significant excess was found for urinary composition alteration or oedema. Adverse event data from blinded randomised trials do not support causal relationships between statin therapy and most of the conditions (including cognitive impairment, depression, sleep disturbance, and peripheral neuropathy) listed in product labels as potential undesirable effects. In light of these findings, such labelling and other official sources of health information should be revised so that patients and their doctors can make appropriately informed decisions regarding statin therapy. British Heart Foundation, UK Medical Research Council, and Australian National Health and Medical Research Council.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Statin product labels (eg, Summaries of Product Characteristics [SmPCs]) list certain adverse outcomes as potential treatment-related effects based mainly on non-randomised and non-blinded studies, which might be subject to bias. We aimed to assess the evidence for such undesirable effects more reliably through a meta-analysis of individual participant data from large double-blind trials of statin therapy."
        },
        {
          "label": "METHODS",
          "text": "In this meta-analysis of individual participant-level data from double-blind randomised controlled trials, we generated a list of all undesirable effect terms listed in statin SmPCs by searching an electronic medicines compendium for five statins (atorvastatin, fluvastatin, pravastatin, rosuvastatin, and simvastatin). Randomised trials were eligible for meta-analysis of these effects if they involved at least 1000 participants, had a scheduled treatment period of at least 2 years, and involved a double-blind comparison of statin versus placebo or of a more intensive versus a less intensive statin regimen. Event rate ratios (RRs) and 95% CIs were calculated with statistical significance assessed after controlling the false discovery rate (FDR) at 5%."
        },
        {
          "label": "FINDINGS",
          "text": "19 trials compared statin versus placebo (123 940 participants, median follow-up 4·5 years [IQR 3·1-5·4]). In addition to previously reported effects on muscle outcomes and diabetes, only four of 66 further undesirable outcomes that had been attributed to statins were FDR significant: abnormal liver transaminases (783 participants [0·30% per annum] allocated statin vs 556 [0·22% per annum] allocated placebo, RR 1·41 [95% CI 1·26-1·57]) and other liver function test abnormalities (651 participants [0·25% per annum] allocated statin vs 518 [0·20% per annum] allocated placebo, RR 1·26 [1·12-1·41]; absolute annual excess of 0·13% for combined liver function test abnormality), urinary composition alteration (556 [0·21% per annum] allocated statin vs 472 [0·18% per annum] allocated placebo, RR 1·18 [1·04-1·33]), and oedema (3495 [1·38% per annum] allocated statin vs 3299 [1·31% per annum] allocated placebo, RR 1·07 [1·02-1·12]). Analysis of the four trials of more intensive versus less intensive statin regimens also found significant excesses for abnormal liver transaminases and other liver function test abnormalities (supporting a dose-dependent effect), but no significant excess was found for urinary composition alteration or oedema."
        },
        {
          "label": "INTERPRETATION",
          "text": "Adverse event data from blinded randomised trials do not support causal relationships between statin therapy and most of the conditions (including cognitive impairment, depression, sleep disturbance, and peripheral neuropathy) listed in product labels as potential undesirable effects. In light of these findings, such labelling and other official sources of health information should be revised so that patients and their doctors can make appropriately informed decisions regarding statin therapy."
        },
        {
          "label": "FUNDING",
          "text": "British Heart Foundation, UK Medical Research Council, and Australian National Health and Medical Research Council."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41655587/",
      "pubDate": "2026 Feb 05",
      "doi": "10.1016/S0140-6736(25)01578-8",
      "dateReceived": "2026-02-13T23:38:47.962Z",
      "isNew": false,
      "summary": "A."
    },
    {
      "id": "006258db5ba9",
      "title": "Switch to fixed-dose doravirine (100 mg) and islatravir (0.25 mg) once daily in virologically suppressed adults with HIV-1 on bictegravir, emtricitabine, and tenofovir alafenamide: 48-week results of a phase 3, multicentre, randomised, controlled, double-blind, non-inferiority trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50079037/118809",
      "abstract": "The combination of doravirine and islatravir is under investigation as a fixed-dose, single-tablet regimen for the treatment of HIV-1. We aimed to assess the efficacy and safety of switching to doravirine (100 mg) and islatravir (0·25 mg) from bictegravir, emtricitabine, and tenofovir alafenamide in virologically suppressed adults with HIV-1. This phase 3, randomised, controlled, double-blind, non-inferiority trial was conducted at 49 research, community, and hospital-based clinics in six countries: Australia, Chile, Israel, Japan, the UK, and the USA. Adults aged 18 years or older with HIV-1, who were virologically suppressed (with a viral load of HIV-1 RNA <50 copies per mL) for at least 3 consecutive months on bictegravir, emtricitabine, and tenofovir alafenamide and had no history of treatment failure or known resistance to doravirine, were eligible for the study. Participants were randomly assigned, in a 2:1 ratio according to a computer-generated randomisation schedule with a block size of three, to switch to oral doravirine (100 mg) and islatravir (0·25 mg) or to continue bictegravir, emtricitabine, and tenofovir alafenamide, once daily. Participants, investigators, study staff, and sponsor personnel were masked to study treatment; sponsor personnel directly involved in this analysis were unmasked at week 48. The primary endpoint, which was assessed in all randomly assigned participants who received at least one dose of study treatment, was the percentage of participants with a viral load of 50 copies per mL or higher at week 48 according to the US Food and Drug Administration snapshot approach; non-inferiority would be concluded if the upper bound of the multiplicity-adjusted 95% CI for the treatment difference was less than 4%. The trial is registered at ClinicalTrials.gov, NCT05630755, and is ongoing but closed to enrolment. Between Feb 17 and Nov 17, 2023, 585 individuals were screened, of whom 514 were randomly assigned and 513 treated: 342 participants were switched to doravirine (100 mg) and islatravir (0·25 mg) and 171 continued bictegravir, emtricitabine, and tenofovir alafenamide. The median age of the 513 participants was 47 years (IQR 37-58), 403 (79%) were assigned male and 110 (21%) were assigned female at birth, 158 (31%) were Black or African American, and 117 (23%) were Hispanic, Latino, or Latina. At week 48, doravirine and islatravir showed non-inferiority to bictegravir, emtricitabine, and tenofovir alafenamide (viral load ≥50 copies per mL in five [1·5%] of 342 vs one [0·6%] of 171 participants) with a treatment difference of 0·9% (multiplicity-adjusted 95% CI -1·9 to 2·9). The rates of adverse events (74·6% [255 of 342 participants] vs 71·3% [122 of 171 participants]; difference 3·2 [95% CI -4·7 to 11·6]), treatment-related adverse events (10·2% [35] vs 9·4% [16]; 0·9 [-5·1 to 6·0]), serious adverse events (4·4% [15] vs 6·4% [11]; -2·0 [-7·1 to 1·9]), and discontinuations due to adverse events (2·9% [ten] vs 1·8% [three]; 1·2 [-2·3 to 3·9]) were similar in the doravirine and islatravir group and the bictegravir, emtricitabine, and tenofovir alafenamide group, and no deaths were reported. The combination of doravirine (100 mg) and islatravir (0·25 mg) has similar efficacy and safety profiles to bictegravir, emtricitabine, and tenofovir alafenamide, and could provide a two-drug, once daily, oral single-tablet option without an integrase strand-transfer inhibitor for adults who are virologically suppressed and want to switch to a different ART regimen. Merck Sharp & Dohme, a subsidiary of Merck & Co.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The combination of doravirine and islatravir is under investigation as a fixed-dose, single-tablet regimen for the treatment of HIV-1. We aimed to assess the efficacy and safety of switching to doravirine (100 mg) and islatravir (0·25 mg) from bictegravir, emtricitabine, and tenofovir alafenamide in virologically suppressed adults with HIV-1."
        },
        {
          "label": "METHODS",
          "text": "This phase 3, randomised, controlled, double-blind, non-inferiority trial was conducted at 49 research, community, and hospital-based clinics in six countries: Australia, Chile, Israel, Japan, the UK, and the USA. Adults aged 18 years or older with HIV-1, who were virologically suppressed (with a viral load of HIV-1 RNA <50 copies per mL) for at least 3 consecutive months on bictegravir, emtricitabine, and tenofovir alafenamide and had no history of treatment failure or known resistance to doravirine, were eligible for the study. Participants were randomly assigned, in a 2:1 ratio according to a computer-generated randomisation schedule with a block size of three, to switch to oral doravirine (100 mg) and islatravir (0·25 mg) or to continue bictegravir, emtricitabine, and tenofovir alafenamide, once daily. Participants, investigators, study staff, and sponsor personnel were masked to study treatment; sponsor personnel directly involved in this analysis were unmasked at week 48. The primary endpoint, which was assessed in all randomly assigned participants who received at least one dose of study treatment, was the percentage of participants with a viral load of 50 copies per mL or higher at week 48 according to the US Food and Drug Administration snapshot approach; non-inferiority would be concluded if the upper bound of the multiplicity-adjusted 95% CI for the treatment difference was less than 4%. The trial is registered at ClinicalTrials.gov, NCT05630755, and is ongoing but closed to enrolment."
        },
        {
          "label": "FINDINGS",
          "text": "Between Feb 17 and Nov 17, 2023, 585 individuals were screened, of whom 514 were randomly assigned and 513 treated: 342 participants were switched to doravirine (100 mg) and islatravir (0·25 mg) and 171 continued bictegravir, emtricitabine, and tenofovir alafenamide. The median age of the 513 participants was 47 years (IQR 37-58), 403 (79%) were assigned male and 110 (21%) were assigned female at birth, 158 (31%) were Black or African American, and 117 (23%) were Hispanic, Latino, or Latina. At week 48, doravirine and islatravir showed non-inferiority to bictegravir, emtricitabine, and tenofovir alafenamide (viral load ≥50 copies per mL in five [1·5%] of 342 vs one [0·6%] of 171 participants) with a treatment difference of 0·9% (multiplicity-adjusted 95% CI -1·9 to 2·9). The rates of adverse events (74·6% [255 of 342 participants] vs 71·3% [122 of 171 participants]; difference 3·2 [95% CI -4·7 to 11·6]), treatment-related adverse events (10·2% [35] vs 9·4% [16]; 0·9 [-5·1 to 6·0]), serious adverse events (4·4% [15] vs 6·4% [11]; -2·0 [-7·1 to 1·9]), and discontinuations due to adverse events (2·9% [ten] vs 1·8% [three]; 1·2 [-2·3 to 3·9]) were similar in the doravirine and islatravir group and the bictegravir, emtricitabine, and tenofovir alafenamide group, and no deaths were reported."
        },
        {
          "label": "INTERPRETATION",
          "text": "The combination of doravirine (100 mg) and islatravir (0·25 mg) has similar efficacy and safety profiles to bictegravir, emtricitabine, and tenofovir alafenamide, and could provide a two-drug, once daily, oral single-tablet option without an integrase strand-transfer inhibitor for adults who are virologically suppressed and want to switch to a different ART regimen."
        },
        {
          "label": "FUNDING",
          "text": "Merck Sharp & Dohme, a subsidiary of Merck & Co."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41654375/",
      "pubDate": "2026 Feb 07",
      "doi": "10.1016/S0140-6736(25)01948-8",
      "dateReceived": "2026-02-13T23:38:47.962Z",
      "isNew": false,
      "summary": "This text describes the."
    },
    {
      "id": "9aafcb2393bc",
      "title": "Triple cardiovascular disease detection with an artificial intelligence-enabled stethoscope (TRICORDER) in the UK: a cluster-randomised controlled implementation trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50079037/118781",
      "dateReceived": "2026-02-13T23:38:47.962Z",
      "isNew": false
    },
    {
      "id": "94db1851c34e",
      "title": "The `Atrial Fibrillation Better Care` Pathway for Integrated Care of Atrial Fibrillation: A Systematic Review and Meta-Analysis.",
      "journal": "Thromb Haemost",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50079037/118756",
      "abstract": "To conduct an updated systematic review of the current evidence on the implementation of the 'Atrial fibrillation Better Care' (ABC) pathway for the comprehensive and holistic management of patients with Atrial Fibrillation (AF).We performed a systematic review and meta-analysis, searching MEDLINE and EMBASE for studies reporting the prevalence of ABC-adherent management in patients with AF and its association with clinical outcomes (all-cause death, cardiovascular death, stroke, stroke/thromboembolism (TE), and major bleeding). Random-effects models were used to pool results from individual studies; subgroup analyses and meta-regressions were also conducted.Overall, 22 studies were included (including 2 randomised trials), with >380,000 AF patients. Adherence to the ABC pathway was 23.9% (95%CI: 17.5%-31.7%), with substantial between-study heterogeneity (I: 99.8%). Adherence was higher in European cohorts (37.9%, 95%CI: 27.8%-49.2%) and increased with advancing age. ABC pathway adherence was associated with a lower risk of all-cause death (Odds Ratio [OR]: 0.49, 95%CI: 0.41-0.58, I²: 97.1%), cardiovascular death (OR: 0.46, 95%CI: 0.36-0.59, I²: 96.4%), stroke (OR: 0.65, 95%CI: 0.51-0.82, I²: 93.5%), stroke/TE (OR: 0.53, 95%CI: 0.42-0.66, I²: 91.1%) and major bleeding (OR: 0.81, 95%CI: 0.69-0.94, I²: 89.2%). The effect of the ABC pathway was consistent in clinical trials versus real-world studies, but influenced by study-level characteristics, including geographical location, mean age, prevalence of comorbidities, and the inclusion of estimates adjusted for potential confounders.Adherence to the ABC pathway remains suboptimal in patients with AF, but is associated with substantial beneficial effects on prognosis. Our data support widespread implementation of the ABC pathway for managing patients with AF.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41544946/",
      "pubDate": "2026 Jan 30",
      "doi": "10.1055/a-2787-0186",
      "dateReceived": "2026-02-13T23:38:47.962Z",
      "isNew": false,
      "summary": "Adherence to."
    },
    {
      "id": "c28b40e8812e",
      "title": "Outpatient Treatment of Confirmed COVID-19: A Living, Rapid Review for the American College of Physicians (Version 3).",
      "journal": "Ann Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50062859/118820",
      "abstract": "The American College of Physicians (ACP) maintains living, rapid practice points on antiviral treatment in the outpatient setting for COVID-19. The Population Health and Medical Science Committee (PHMSC) developed this version 3 based on evidence from a focused update of a living, rapid review conducted by the ACP Center for Evidence Reviews at Cochrane Austria. This version addresses the SARS-CoV-2 Omicron variant and reaffirms previous practice points on the use of antiviral treatments of confirmed COVID-19 in unvaccinated or vaccinated and symptomatic patients in the outpatient setting. The PHMSC is retiring this topic from living status considering that this update and previous surveillance have not yielded important changes to the practice points.",
      "structuredAbstract": [
        {
          "label": "DESCRIPTION",
          "text": "The American College of Physicians (ACP) maintains living, rapid practice points on antiviral treatment in the outpatient setting for COVID-19."
        },
        {
          "label": "METHODS",
          "text": "The Population Health and Medical Science Committee (PHMSC) developed this version 3 based on evidence from a focused update of a living, rapid review conducted by the ACP Center for Evidence Reviews at Cochrane Austria. This version addresses the SARS-CoV-2 Omicron variant and reaffirms previous practice points on the use of antiviral treatments of confirmed COVID-19 in unvaccinated or vaccinated and symptomatic patients in the outpatient setting."
        },
        {
          "label": "RETIREMENT FROM LIVING STATUS",
          "text": "The PHMSC is retiring this topic from living status considering that this update and previous surveillance have not yielded important changes to the practice points."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41662713/",
      "pubDate": "2026 Feb 10",
      "doi": "10.7326/ANNALS-25-03766",
      "dateReceived": "2026-02-12T23:38:25.928Z",
      "isNew": false,
      "summary": "The American."
    },
    {
      "id": "93697d4269f2",
      "title": "Tenecteplase versus standard medical treatment for basilar artery occlusion within 24 h (TRACE-5): a multicentre, prospective, randomised, open-label, blinded-endpoint, superiority, phase 3 trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50062859/118813",
      "abstract": "The efficacy and safety of intravenous thrombolysis with tenecteplase within 24 h after stroke onset due to basilar artery occlusion are not well studied. We aimed to assess whether intravenous tenecteplase administered within 24 h after symptom onset improved functional outcome compared with standard medical treatment in patients with basilar artery occlusion. TRACE-5 was a prospective, randomised, open-label, blinded-endpoint, superiority, phase 3 trial conducted at 66 stroke centres in China. We included patients aged 18 years or older with stroke due to basilar artery occlusion who were eligible for intravenous thrombolytics within 24 h of stroke onset or the time they were last known to be well and had a pre-stroke modified Rankin scale (mRS) score of 3 or less (scores range from 0 to 6, with higher scores indicating greater disability). Patients were randomly assigned to receive a single intravenous bolus of tenecteplase (0·25 mg/kg; maximum 25 mg) within 24 h after symptom onset or standard medical treatment (which could include intravenous alteplase at 0·9 mg/kg, maximum 90 mg, within 4·5 h of symptom onset; anticoagulation; or antiplatelets), with or without endovascular thrombectomy. The primary outcome was a score of 0-1 on the mRS or return to the baseline mRS score (if the baseline pre-stroke mRS score was 2-3) at 90 days. Safety outcomes were symptomatic intracranial haemorrhage and death. The primary outcome and safety outcomes were assessed in all randomly assigned participants included in their originally assigned groups. This trial is registered with ClinicalTrials.gov, NCT06196320. Between Jan 24, 2024, and June 20, 2025, 452 patients were enrolled (mean age 66·4 years [SD 11·2], 321 [71%] males, and 131 [29%] females), of whom 222 (49%) subsequently underwent thrombectomy; 221 were randomly assigned to receive tenecteplase and 231 to receive standard medical treatment. Alteplase was used in 80 (35%) of the patients in the standard medical treatment group. An mRS score of 0-1 or return to the baseline mRS score occurred in 83 (38%) patients in the tenecteplase group and 66 (29%) patients in the standard medical treatment group (adjusted relative rate 1·50 [95% CI 1·09-2·08], p=0·014). Symptomatic intracranial haemorrhage within 36 h occurred in four (2%) patients in the tenecteplase group and seven (3%) patients in the standard medical treatment group (adjusted relative rate 0·58 [95% CI 0·17-1·99]). All-cause mortality at 90 days was similar between groups (65 [29%] patients in the tenecteplase group and 71 [31%] patients in the standard medical treatment group; adjusted relative rate 0·87 [95% CI 0·62-1·22]), as was the proportion of patients with an mRS score of 5-6 at 90 days (82 [37%] vs 89 [39%]; 0·87 [0·65-1·18]). In this trial involving Chinese patients with ischaemic stroke due to basilar artery occlusion, tenecteplase within 24 h after stroke onset improved functional outcome compared with standard medical treatment. The incidence of symptomatic intracranial haemorrhage and death was similar. Noncommunicable Chronic Diseases-National Science and Technology Major Project, Beijing Municipal Science Fund for Distinguished Young Scholars, National Natural Science Foundation of China, and China Shijiazhuang Pharmaceutical Company Recomgen Pharmaceutical (Guangzhou).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The efficacy and safety of intravenous thrombolysis with tenecteplase within 24 h after stroke onset due to basilar artery occlusion are not well studied. We aimed to assess whether intravenous tenecteplase administered within 24 h after symptom onset improved functional outcome compared with standard medical treatment in patients with basilar artery occlusion."
        },
        {
          "label": "METHODS",
          "text": "TRACE-5 was a prospective, randomised, open-label, blinded-endpoint, superiority, phase 3 trial conducted at 66 stroke centres in China. We included patients aged 18 years or older with stroke due to basilar artery occlusion who were eligible for intravenous thrombolytics within 24 h of stroke onset or the time they were last known to be well and had a pre-stroke modified Rankin scale (mRS) score of 3 or less (scores range from 0 to 6, with higher scores indicating greater disability). Patients were randomly assigned to receive a single intravenous bolus of tenecteplase (0·25 mg/kg; maximum 25 mg) within 24 h after symptom onset or standard medical treatment (which could include intravenous alteplase at 0·9 mg/kg, maximum 90 mg, within 4·5 h of symptom onset; anticoagulation; or antiplatelets), with or without endovascular thrombectomy. The primary outcome was a score of 0-1 on the mRS or return to the baseline mRS score (if the baseline pre-stroke mRS score was 2-3) at 90 days. Safety outcomes were symptomatic intracranial haemorrhage and death. The primary outcome and safety outcomes were assessed in all randomly assigned participants included in their originally assigned groups. This trial is registered with ClinicalTrials.gov, NCT06196320."
        },
        {
          "label": "FINDINGS",
          "text": "Between Jan 24, 2024, and June 20, 2025, 452 patients were enrolled (mean age 66·4 years [SD 11·2], 321 [71%] males, and 131 [29%] females), of whom 222 (49%) subsequently underwent thrombectomy; 221 were randomly assigned to receive tenecteplase and 231 to receive standard medical treatment. Alteplase was used in 80 (35%) of the patients in the standard medical treatment group. An mRS score of 0-1 or return to the baseline mRS score occurred in 83 (38%) patients in the tenecteplase group and 66 (29%) patients in the standard medical treatment group (adjusted relative rate 1·50 [95% CI 1·09-2·08], p=0·014). Symptomatic intracranial haemorrhage within 36 h occurred in four (2%) patients in the tenecteplase group and seven (3%) patients in the standard medical treatment group (adjusted relative rate 0·58 [95% CI 0·17-1·99]). All-cause mortality at 90 days was similar between groups (65 [29%] patients in the tenecteplase group and 71 [31%] patients in the standard medical treatment group; adjusted relative rate 0·87 [95% CI 0·62-1·22]), as was the proportion of patients with an mRS score of 5-6 at 90 days (82 [37%] vs 89 [39%]; 0·87 [0·65-1·18])."
        },
        {
          "label": "INTERPRETATION",
          "text": "In this trial involving Chinese patients with ischaemic stroke due to basilar artery occlusion, tenecteplase within 24 h after stroke onset improved functional outcome compared with standard medical treatment. The incidence of symptomatic intracranial haemorrhage and death was similar."
        },
        {
          "label": "FUNDING",
          "text": "Noncommunicable Chronic Diseases-National Science and Technology Major Project, Beijing Municipal Science Fund for Distinguished Young Scholars, National Natural Science Foundation of China, and China Shijiazhuang Pharmaceutical Company Recomgen Pharmaceutical (Guangzhou)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41655588/",
      "pubDate": "2026 Feb 05",
      "doi": "10.1016/S0140-6736(25)02633-9",
      "dateReceived": "2026-02-12T23:38:25.928Z",
      "isNew": false,
      "summary": "The TRACE."
    },
    {
      "id": "b7ea7a83c3fb",
      "title": "Impact of screening programmes for type 1 diabetes in youth: A systematic review and meta-analysis.",
      "journal": "Diabet Med",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50062859/118794",
      "abstract": "To evaluate the impact of anti-islet antibody (IAb) screening on the general population and first-degree relatives (FDRs)/high-risk individuals and evidence-based follow-up modalities. We performed this review through systematic searches of PubMed, EMBASE, Cochrane Library, Web of Science, ClinicalTrials.gov and International Clinical Trials Registry Platform between 15 March 2006, and 15 March 2025. We selected studies on children and adolescents screened for T1D IAbs, compared with people who were not screened or IAb+ individuals who were not followed up. PICOS framework was used in the selection process. Outcome data were extracted, and a meta-analysis of DKA risk at T1D onset was performed. Quality of evidence was assessed using the GRADE approach. This study was registered with PROSPERO, CRD42024523781. Sixty-six studies, 53 of moderate-to-high quality, were included. Screening was associated with lower DKA rates by 23% (95% CI 18-29%, I = 88.8%). The risk of stage 3 T1D progression was high in younger children with persistent and/or multiple IAb+. Screening was associated with higher indicators of parental anxiety, which decreased during follow-up. Children with IAb positivity were monitored according to age and T1D stage, using HbA1c, oral glucose tolerance testing and continuous glucose monitoring (CGM). Time above 140 mg/dL was a biomarker of progression. Population screening with IAbs and follow-up of IAb+ individuals helps decrease DKA and allows participation in intervention trials. This systematic review provides evidence for clinical practice on the screening timing, modalities and follow-up. Further studies on the use of CGM are expected.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "To evaluate the impact of anti-islet antibody (IAb) screening on the general population and first-degree relatives (FDRs)/high-risk individuals and evidence-based follow-up modalities."
        },
        {
          "label": "METHODS",
          "text": "We performed this review through systematic searches of PubMed, EMBASE, Cochrane Library, Web of Science, ClinicalTrials.gov and International Clinical Trials Registry Platform between 15 March 2006, and 15 March 2025. We selected studies on children and adolescents screened for T1D IAbs, compared with people who were not screened or IAb+ individuals who were not followed up. PICOS framework was used in the selection process. Outcome data were extracted, and a meta-analysis of DKA risk at T1D onset was performed. Quality of evidence was assessed using the GRADE approach. This study was registered with PROSPERO, CRD42024523781."
        },
        {
          "label": "RESULTS",
          "text": "Sixty-six studies, 53 of moderate-to-high quality, were included. Screening was associated with lower DKA rates by 23% (95% CI 18-29%, I = 88.8%). The risk of stage 3 T1D progression was high in younger children with persistent and/or multiple IAb+. Screening was associated with higher indicators of parental anxiety, which decreased during follow-up. Children with IAb positivity were monitored according to age and T1D stage, using HbA1c, oral glucose tolerance testing and continuous glucose monitoring (CGM). Time above 140 mg/dL was a biomarker of progression."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Population screening with IAbs and follow-up of IAb+ individuals helps decrease DKA and allows participation in intervention trials. This systematic review provides evidence for clinical practice on the screening timing, modalities and follow-up. Further studies on the use of CGM are expected."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41618706/",
      "pubDate": "2026 Jan 31",
      "doi": "10.1111/dme.70236",
      "dateReceived": "2026-02-12T23:38:25.928Z",
      "isNew": false,
      "summary": "Population screening for."
    },
    {
      "id": "6e21d3cf32ba",
      "title": "Treatment of uncomplicated vulvovaginal candidiasis: topical or oral drugs? Single-day or multiple-day therapy? A network meta-analysis of randomized trials.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49972289/118712",
      "abstract": "To assess early (7-10 days) and late (24-35 days) clinical and mycological cure rates associated with single or multiple-day topical or oral treatment of uncomplicated vulvovaginal candidiasis. Cochrane Central Register of Studies Online (inception to 31 March 2024), MEDLINE, Ovid platform (1946-31 March 2024), Embase, (inception to 31 March 2024), Google Scholar (inception to 31 March 2024), US National Institutes of Health Ongoing Trials Register ClinicalTrials.gov, World Health Organization International Clinical Trials Registry Platform, and European Clinical Trials Register. Fifty (N=7208 subjects) randomized studies comparing different topical or oral drugs with or without placebo were included in the analysis. Confidence in the results of network meta-analysis was evaluated by using an online tool that combines confidence assessments arising from direct comparisons with network meta-analysis estimates. The risk of bias of individual studies was assessed using the Revised Cochrane risk-of-bias tool for randomized trials. Bayesian network meta-analysis was performed using an interactive web-based tool with the R packages gemct and BUGSNET. Ranking success probabilities were computed on the basis of the surface under the cumulative ranking curve. Compared with placebo, all the treatments studied were highly efficacious (>75%) for the clinical and mycological cure of vulvovaginal candidiasis. Single-day use of 150 mg of fluconazole was slightly more effective than multiple-day topical therapy in early clinical cure both in pairwise (pooled odds ratio=1.9, 95% confidence interval=1.31-2.74, I2=0%) and network meta-analysis (odds ratio=1.52, 95% confidence interval=1.13-2.07) analyses. In the evaluation of late clinical cure, there were no significant differences in the odds ratios of success between oral and topical treatment, either as single or multiple-day therapy (3983 subjects in the network). Single dose fluconazole was marginally superior to multiple-day topical treatment in late mycological cure (odds ratio=1.42, 95% confidence interval=1-1.99). In the ranking analysis, single-day oral fluconazole treatment had the best chance of achieving early (surface under the cumulative ranking curve=74.1%) and late (surface under the cumulative ranking curve=84.2%) mycological cure. Multiple-day treatment with itraconazole scored best in early (surface under the cumulative ranking curve=99%) and late (surface under the cumulative ranking curve=75.7%) relief of symptoms. Given the high efficacy of both oral and topical drugs, a strict hierarchy of competing treatments for uncomplicated vulvovaginal candidiasis is probably inappropriate; however, current guidelines should acknowledge that oral azoles have a higher chance of clinical success and microbiological eradication of Candida than topical drugs.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess early (7-10 days) and late (24-35 days) clinical and mycological cure rates associated with single or multiple-day topical or oral treatment of uncomplicated vulvovaginal candidiasis."
        },
        {
          "label": "DATA SOURCES",
          "text": "Cochrane Central Register of Studies Online (inception to 31 March 2024), MEDLINE, Ovid platform (1946-31 March 2024), Embase, (inception to 31 March 2024), Google Scholar (inception to 31 March 2024), US National Institutes of Health Ongoing Trials Register ClinicalTrials.gov, World Health Organization International Clinical Trials Registry Platform, and European Clinical Trials Register."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Fifty (N=7208 subjects) randomized studies comparing different topical or oral drugs with or without placebo were included in the analysis. Confidence in the results of network meta-analysis was evaluated by using an online tool that combines confidence assessments arising from direct comparisons with network meta-analysis estimates. The risk of bias of individual studies was assessed using the Revised Cochrane risk-of-bias tool for randomized trials."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Bayesian network meta-analysis was performed using an interactive web-based tool with the R packages gemct and BUGSNET. Ranking success probabilities were computed on the basis of the surface under the cumulative ranking curve."
        },
        {
          "label": "RESULTS",
          "text": "Compared with placebo, all the treatments studied were highly efficacious (>75%) for the clinical and mycological cure of vulvovaginal candidiasis. Single-day use of 150 mg of fluconazole was slightly more effective than multiple-day topical therapy in early clinical cure both in pairwise (pooled odds ratio=1.9, 95% confidence interval=1.31-2.74, I2=0%) and network meta-analysis (odds ratio=1.52, 95% confidence interval=1.13-2.07) analyses. In the evaluation of late clinical cure, there were no significant differences in the odds ratios of success between oral and topical treatment, either as single or multiple-day therapy (3983 subjects in the network). Single dose fluconazole was marginally superior to multiple-day topical treatment in late mycological cure (odds ratio=1.42, 95% confidence interval=1-1.99). In the ranking analysis, single-day oral fluconazole treatment had the best chance of achieving early (surface under the cumulative ranking curve=74.1%) and late (surface under the cumulative ranking curve=84.2%) mycological cure. Multiple-day treatment with itraconazole scored best in early (surface under the cumulative ranking curve=99%) and late (surface under the cumulative ranking curve=75.7%) relief of symptoms."
        },
        {
          "label": "CONCLUSION",
          "text": "Given the high efficacy of both oral and topical drugs, a strict hierarchy of competing treatments for uncomplicated vulvovaginal candidiasis is probably inappropriate; however, current guidelines should acknowledge that oral azoles have a higher chance of clinical success and microbiological eradication of Candida than topical drugs."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40157526/",
      "pubDate": "2025 Sep",
      "doi": "10.1016/j.ajog.2025.03.031",
      "dateReceived": "2026-02-12T23:38:25.928Z",
      "isNew": false
    },
    {
      "id": "91cf23213ee0",
      "title": "Digital technologies and clinical decision support tools available for diabetes triage in the inpatient setting: A systematic literature review.",
      "journal": "Diabet Med",
      "score": "5/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49972289/118704",
      "abstract": "People with diabetes who are admitted to hospital are at risk of adverse in-hospital outcomes due to glycaemic dysregulation. Both the prevalence of diabetes and adverse outcomes are higher in rural and regional hospitals where infrastructure is more limited. Digital solutions may facilitate diabetes assessment on admission, so timely care coordination can be provided by inpatient diabetes teams. The aim of this systematic review was to identify and characterise the digital technologies and clinical decision support tools used to triage people with diabetes in the inpatient setting. Six electronic databases were searched for studies published between January 2014 and August 2024 on the use of digital technology or decision support tools to triage adult inpatients with diabetes during a hospital stay. Narrative synthesis was used to report results. The review followed PRISMA guidelines and was registered on PROSPERO (CRD 42021257655). Nine studies met the inclusion criteria. Three developed or improved systems for referrals to an in-hospital diabetes team. The remaining six reported on efforts to improve information to support referral and included risk prediction for iatrogenic hypoglycaemia, persistent adverse glycaemia and in-hospital mortality among Intensive Care Unit patients with diabetes, and perioperative glycaemic management. Digital technologies and clinical decision support tools can improve inpatient triage of people with diabetes. A two-tiered approach consisting of a simple admission risk screen tool followed by dynamic electronic health record surveillance focussed on immediate iatrogenic hypoglycaemia risk for ongoing prioritisation would balance sensitivity at admission with dynamic inpatient risk monitoring.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "People with diabetes who are admitted to hospital are at risk of adverse in-hospital outcomes due to glycaemic dysregulation. Both the prevalence of diabetes and adverse outcomes are higher in rural and regional hospitals where infrastructure is more limited. Digital solutions may facilitate diabetes assessment on admission, so timely care coordination can be provided by inpatient diabetes teams. The aim of this systematic review was to identify and characterise the digital technologies and clinical decision support tools used to triage people with diabetes in the inpatient setting."
        },
        {
          "label": "METHODS",
          "text": "Six electronic databases were searched for studies published between January 2014 and August 2024 on the use of digital technology or decision support tools to triage adult inpatients with diabetes during a hospital stay. Narrative synthesis was used to report results. The review followed PRISMA guidelines and was registered on PROSPERO (CRD 42021257655)."
        },
        {
          "label": "RESULTS",
          "text": "Nine studies met the inclusion criteria. Three developed or improved systems for referrals to an in-hospital diabetes team. The remaining six reported on efforts to improve information to support referral and included risk prediction for iatrogenic hypoglycaemia, persistent adverse glycaemia and in-hospital mortality among Intensive Care Unit patients with diabetes, and perioperative glycaemic management."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Digital technologies and clinical decision support tools can improve inpatient triage of people with diabetes. A two-tiered approach consisting of a simple admission risk screen tool followed by dynamic electronic health record surveillance focussed on immediate iatrogenic hypoglycaemia risk for ongoing prioritisation would balance sensitivity at admission with dynamic inpatient risk monitoring."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41568935/",
      "pubDate": "2026 Mar",
      "doi": "10.1111/dme.70233",
      "dateReceived": "2026-02-12T23:38:25.928Z",
      "isNew": false
    },
    {
      "id": "b0b21d185036",
      "title": "Oral Semaglutide and Heart Failure Outcomes in Persons With Type 2 Diabetes: A Secondary Analysis of the SOUL Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118800",
      "abstract": "Heart failure (HF) is a common complication of type 2 diabetes (T2D). Oral semaglutide reduced the risk of major adverse cardiovascular (CV) events (MACE; comprising CV death, nonfatal myocardial infarction, or nonfatal stroke) in people with T2D in the SOUL trial, but the impact on HF outcomes in these participants is unknown. To evaluate the effect of oral semaglutide on HF events, MACE, and safety among participants with or without HF at baseline. This is a secondary analysis of the double-blind, placebo-controlled, event-driven, phase 3b SOUL randomized clinical trial, which was conducted at 444 centers in 33 countries. Participants were enrolled from June 17, 2019, to March 24, 2021, and had T2D and atherosclerotic CV disease and/or chronic kidney disease, stratified according to the presence or absence of HF history at baseline. Data were analyzed from December 2024 to August 2025. Once-daily oral semaglutide or placebo in addition to standard of care. Prespecified composite HF outcome (time to first occurrence of HF hospitalization, urgent HF visit, or CV death). Overall, 9650 participants (median [IQR] age, 66.0 [61.0-72.0] years; 2790 [28.9%] female) were randomized, with a mean (SD) follow-up of 47.5 (10.9) months. Of these participants, 2229 (23.1%) had HF history (991 [10.3%] with preserved ejection fraction, 592 [6.1%] with reduced ejection fraction, and 646 [6.7%] with unknown subtype). For participants with HF at baseline, the hazard ratio (HR) for risk of the composite HF outcome with oral semaglutide vs placebo was 0.78 (95% CI, 0.63-0.96) and was 1.01 (95% CI, 0.84-1.20) in those without HF at baseline (P for interaction = .06). Among participants with HF, the HR was 0.59 (95% CI, 0.39-0.86) in those with preserved ejection fraction and 0.98 (95% CI, 0.70-1.38) in those with reduced ejection fraction. There was no heterogeneity in the risk reduction of MACE with oral semaglutide in participants with HF history (HR, 0.83; 95% CI, 0.68-1.01) or without HF history (HR, 0.86; 95% CI, 0.75-0.98) (P for interaction = .77). Serious adverse event occurrence among participants with HF was similar with oral semaglutide (594 [53.8%]) and placebo (642 [57.1%]). In this secondary analysis of the SOUL randomized clinical trial, among individuals with T2D, atherosclerotic CV disease, and/or chronic kidney disease, a reduction of HF events was observed with use of oral semaglutide compared with placebo in those with a history of HF, without increasing the risk of serious adverse events. These data support the potential benefit of oral semaglutide in reducing HF events in people with T2D and HF. ClinicalTrials.gov Identifier: NCT03914326.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Heart failure (HF) is a common complication of type 2 diabetes (T2D). Oral semaglutide reduced the risk of major adverse cardiovascular (CV) events (MACE; comprising CV death, nonfatal myocardial infarction, or nonfatal stroke) in people with T2D in the SOUL trial, but the impact on HF outcomes in these participants is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effect of oral semaglutide on HF events, MACE, and safety among participants with or without HF at baseline."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This is a secondary analysis of the double-blind, placebo-controlled, event-driven, phase 3b SOUL randomized clinical trial, which was conducted at 444 centers in 33 countries. Participants were enrolled from June 17, 2019, to March 24, 2021, and had T2D and atherosclerotic CV disease and/or chronic kidney disease, stratified according to the presence or absence of HF history at baseline. Data were analyzed from December 2024 to August 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Once-daily oral semaglutide or placebo in addition to standard of care."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Prespecified composite HF outcome (time to first occurrence of HF hospitalization, urgent HF visit, or CV death)."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 9650 participants (median [IQR] age, 66.0 [61.0-72.0] years; 2790 [28.9%] female) were randomized, with a mean (SD) follow-up of 47.5 (10.9) months. Of these participants, 2229 (23.1%) had HF history (991 [10.3%] with preserved ejection fraction, 592 [6.1%] with reduced ejection fraction, and 646 [6.7%] with unknown subtype). For participants with HF at baseline, the hazard ratio (HR) for risk of the composite HF outcome with oral semaglutide vs placebo was 0.78 (95% CI, 0.63-0.96) and was 1.01 (95% CI, 0.84-1.20) in those without HF at baseline (P for interaction = .06). Among participants with HF, the HR was 0.59 (95% CI, 0.39-0.86) in those with preserved ejection fraction and 0.98 (95% CI, 0.70-1.38) in those with reduced ejection fraction. There was no heterogeneity in the risk reduction of MACE with oral semaglutide in participants with HF history (HR, 0.83; 95% CI, 0.68-1.01) or without HF history (HR, 0.86; 95% CI, 0.75-0.98) (P for interaction = .77). Serious adverse event occurrence among participants with HF was similar with oral semaglutide (594 [53.8%]) and placebo (642 [57.1%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this secondary analysis of the SOUL randomized clinical trial, among individuals with T2D, atherosclerotic CV disease, and/or chronic kidney disease, a reduction of HF events was observed with use of oral semaglutide compared with placebo in those with a history of HF, without increasing the risk of serious adverse events. These data support the potential benefit of oral semaglutide in reducing HF events in people with T2D and HF."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03914326."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41627802/",
      "pubDate": "2026 Feb 02",
      "doi": "10.1001/jamainternmed.2025.7774",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false,
      "summary": "Oral."
    },
    {
      "id": "c3db693ca824",
      "title": "Immediate vs Delayed Coronary Angiography After Cardiac Arrest Without ST-Segment Elevation: 5-Year Outcomes From the COACT Randomized Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118796",
      "abstract": "Out-of-hospital cardiac arrest (OHCA) is a major global health issue. For patients without ST-segment elevation after return of spontaneous circulation, the COACT (Coronary Angiography After Cardiac Arrest) trial was the first randomized trial that investigated the benefit of immediate vs delayed coronary angiography with subsequent percutaneous coronary intervention if needed. No difference in 90-day survival was found. The long-term impact on survival of the 2 treatment strategies remains uncertain. The aim of this study was to investigate the 5-year impact on survival of immediate vs delayed coronary angiography in OHCA patients with an initial shockable rhythm and no ST-segment elevation on initial electrocardiography after return of spontaneous circulation. The COACT trial was a randomized, open-label, multicenter study comparing immediate vs delayed coronary angiography in patients resuscitated from OHCA without ST-segment elevation. Nineteen Dutch centers enrolled patients, and 5-year follow-up was obtained via structured telephone interviews. Secondary endpoints included myocardial infarction, repeat revascularization, heart failure-related hospitalizations, and implantable cardioverter-defibrillator shocks. At 5-year follow-up, data from 514 of 552 patients (93.1%) were available. Of these patients, 261 (50.8%) were assigned to immediate angiography and 253 (49.2%) to a delayed strategy. Baseline characteristics were similar across the 2 treatment groups. Five years after the index hospitalization, 143 patients (54.8%) were alive in the immediate angiography group, and 131 patients (51.8%) were alive in the delayed angiography group (HR: 0.95; 95% CI: 0.74-1.23; log-rank P = 072). In a nonprespecified and exploratory landmark analysis, HRs for death to 90 days and >90 days were 1.11 (95% CI: 0.84-1.49; log-rank P = 0.46) and 0.56 (95% CI: 0.32-0.97; log-rank P = 0.04). Rates of myocardial infarction, heart failure-related hospitalization, and revascularization were low and did not differ between groups. At 5 years, survival was comparable between immediate and delayed angiography, with no clear benefit or harm. A late survival benefit appeared after 90 days, though its clinical significance remains uncertain and most likely is due to chance. (Coronary Angiography After Cardiac Arrest [COACT]; NTR4973).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Out-of-hospital cardiac arrest (OHCA) is a major global health issue. For patients without ST-segment elevation after return of spontaneous circulation, the COACT (Coronary Angiography After Cardiac Arrest) trial was the first randomized trial that investigated the benefit of immediate vs delayed coronary angiography with subsequent percutaneous coronary intervention if needed. No difference in 90-day survival was found. The long-term impact on survival of the 2 treatment strategies remains uncertain."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this study was to investigate the 5-year impact on survival of immediate vs delayed coronary angiography in OHCA patients with an initial shockable rhythm and no ST-segment elevation on initial electrocardiography after return of spontaneous circulation."
        },
        {
          "label": "METHODS",
          "text": "The COACT trial was a randomized, open-label, multicenter study comparing immediate vs delayed coronary angiography in patients resuscitated from OHCA without ST-segment elevation. Nineteen Dutch centers enrolled patients, and 5-year follow-up was obtained via structured telephone interviews. Secondary endpoints included myocardial infarction, repeat revascularization, heart failure-related hospitalizations, and implantable cardioverter-defibrillator shocks."
        },
        {
          "label": "RESULTS",
          "text": "At 5-year follow-up, data from 514 of 552 patients (93.1%) were available. Of these patients, 261 (50.8%) were assigned to immediate angiography and 253 (49.2%) to a delayed strategy. Baseline characteristics were similar across the 2 treatment groups. Five years after the index hospitalization, 143 patients (54.8%) were alive in the immediate angiography group, and 131 patients (51.8%) were alive in the delayed angiography group (HR: 0.95; 95% CI: 0.74-1.23; log-rank P = 072). In a nonprespecified and exploratory landmark analysis, HRs for death to 90 days and >90 days were 1.11 (95% CI: 0.84-1.49; log-rank P = 0.46) and 0.56 (95% CI: 0.32-0.97; log-rank P = 0.04). Rates of myocardial infarction, heart failure-related hospitalization, and revascularization were low and did not differ between groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "At 5 years, survival was comparable between immediate and delayed angiography, with no clear benefit or harm. A late survival benefit appeared after 90 days, though its clinical significance remains uncertain and most likely is due to chance. (Coronary Angiography After Cardiac Arrest [COACT]; NTR4973)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41636663/",
      "pubDate": "2026 Jan 21",
      "doi": "10.1016/j.jacc.2025.12.018",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false,
      "summary": "Immediate versus delayed."
    },
    {
      "id": "47ea4ae55814",
      "title": "3 months vs 12 months of romosozumab for postmenopausal osteoporosis (LIDA): an open-label, non-inferiority, randomised controlled trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118795",
      "abstract": "Postmenopausal osteoporosis is a highly prevalent disease associated with substantial morbidity and mortality. The most recently introduced osteoporosis medication is romosozumab, a monoclonal antibody with a unique mechanism of action that increases bone mineral density (BMD) more than other agents by both stimulating new bone formation and inhibiting resorption. The drug's stimulation of bone formation, however, wanes after several months. The use of romosozumab is limited by cost, the inconvenience of monthly clinic-administered injections, and its cardiovascular risk profile. In this trial, we aimed to test the hypothesis that a shorter course of romosozumab might be equally effective as the standard regimen. We did a 12-month, prospective, open-label, randomised, controlled, non-inferiority trial of 50 postmenopausal women at high risk of fracture. The study was done at a single academic medical centre in the USA. Participants were randomly assigned to receive 3 months of romosozumab (210 mg by subcutaneous injection, monthly) followed by 9 months of denosumab (60 mg by subcutaneous injection, every 6 months; 3-month ROMO group) or 12 months of romosozumab (12-month ROMO group). The primary endpoint was the percentage change in total hip BMD. The non-inferiority threshold was set at 2%. The trial was registered at ClinicalTrials.gov, NCT05010590. Between March 2, 2022, and May 2, 2023, we screened 188 participants. Of those, 102 (54%) were ineligible and 36 (19%) declined to participate. We randomly assigned 50 participants to either the 3-month ROMO group (24 [48%] participants) or the 12-month ROMO group (26 [52%] participants). Study participants completing at least one post-baseline visit were included in the analysis (modified intention-to-treat analysis). The mean age of participants was 69·6 years (SD 4·5). The mean 12-month change in total hip BMD was 5·7% (SD 3·3) in the 3-month romosozumab group and 6·0% (3·2) in the 12-month romosozumab group, meeting the prespecified non-inferiority threshold. Adverse events (back pain, cough, fatigue, headache, joint pain, muscle cramps, muscle pain, palpitations, paraesthesia, reaction at injection site, rhinorrhoea, skin rash, and swelling) were balanced between groups. In postmenopausal women at high risk of fracture, 3 months of romosozumab followed by 9 months of denosumab was non-inferior to 12 months of romosozumab in increasing total hip BMD. Given the expense, injection burden, and potential adverse effects of romosozumab, this abbreviated approach could broaden access to this uniquely effective therapy. US National Institute of Arthritis and Musculoskeletal and Skin Diseases and US National Center for Advancing Translational Science.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Postmenopausal osteoporosis is a highly prevalent disease associated with substantial morbidity and mortality. The most recently introduced osteoporosis medication is romosozumab, a monoclonal antibody with a unique mechanism of action that increases bone mineral density (BMD) more than other agents by both stimulating new bone formation and inhibiting resorption. The drug's stimulation of bone formation, however, wanes after several months. The use of romosozumab is limited by cost, the inconvenience of monthly clinic-administered injections, and its cardiovascular risk profile. In this trial, we aimed to test the hypothesis that a shorter course of romosozumab might be equally effective as the standard regimen."
        },
        {
          "label": "METHODS",
          "text": "We did a 12-month, prospective, open-label, randomised, controlled, non-inferiority trial of 50 postmenopausal women at high risk of fracture. The study was done at a single academic medical centre in the USA. Participants were randomly assigned to receive 3 months of romosozumab (210 mg by subcutaneous injection, monthly) followed by 9 months of denosumab (60 mg by subcutaneous injection, every 6 months; 3-month ROMO group) or 12 months of romosozumab (12-month ROMO group). The primary endpoint was the percentage change in total hip BMD. The non-inferiority threshold was set at 2%. The trial was registered at ClinicalTrials.gov, NCT05010590."
        },
        {
          "label": "FINDINGS",
          "text": "Between March 2, 2022, and May 2, 2023, we screened 188 participants. Of those, 102 (54%) were ineligible and 36 (19%) declined to participate. We randomly assigned 50 participants to either the 3-month ROMO group (24 [48%] participants) or the 12-month ROMO group (26 [52%] participants). Study participants completing at least one post-baseline visit were included in the analysis (modified intention-to-treat analysis). The mean age of participants was 69·6 years (SD 4·5). The mean 12-month change in total hip BMD was 5·7% (SD 3·3) in the 3-month romosozumab group and 6·0% (3·2) in the 12-month romosozumab group, meeting the prespecified non-inferiority threshold. Adverse events (back pain, cough, fatigue, headache, joint pain, muscle cramps, muscle pain, palpitations, paraesthesia, reaction at injection site, rhinorrhoea, skin rash, and swelling) were balanced between groups."
        },
        {
          "label": "INTERPRETATION",
          "text": "In postmenopausal women at high risk of fracture, 3 months of romosozumab followed by 9 months of denosumab was non-inferior to 12 months of romosozumab in increasing total hip BMD. Given the expense, injection burden, and potential adverse effects of romosozumab, this abbreviated approach could broaden access to this uniquely effective therapy."
        },
        {
          "label": "FUNDING",
          "text": "US National Institute of Arthritis and Musculoskeletal and Skin Diseases and US National Center for Advancing Translational Science."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41621431/",
      "pubDate": "2026 Jan 29",
      "doi": "10.1016/S2213-8587(25)00319-5",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false,
      "summary": "A 3-."
    },
    {
      "id": "ba025466af50",
      "title": "Dual antiplatelet therapy after percutaneous coronary intervention according to bleeding risk (HOST-BR): an open-label, multicentre, randomised clinical trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118792",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "c3837d4314a6",
      "title": "Comparative Mid- to Long-Term Effects of Bariatric Surgery Versus Medical/Lifestyle Management in Type 2 Diabetes Mellitus: A Network Meta-Analysis of Randomized Controlled Trials.",
      "journal": "Obes Surg",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118767",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "c4d64f9395b6",
      "title": "Implementing Screening and Counseling for Adolescent Mental Health and Substance Use.",
      "journal": "Pediatrics",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118737",
      "abstract": "The proportion of US adolescents experiencing mental health or substance use disorders continues to rise. Pediatricians are expected to deliver evidence-based screening and counseling, but multiple barriers impede implementation. This systematic review assessed the effectiveness of implementation strategies-activities to enhance implementation, service, and health outcomes-to support integration of screening and counseling for mental health and substance use disorders (MHSUD) into primary care for children and adolescents. We searched multiple databases for literature published since 2010. Eligible studies compared any strategy to support implementation of a recommended intervention to prevent MHSUD among individuals aged 18 years or younger in primary care with another strategy or no strategy. We extracted data on study designs, populations, settings, clinical interventions, barriers and facilitators to implementation, implementation interventions and comparators, and results. Eleven studies focused on implementing screening and counseling for depression, eating disorders, substance use disorders, and general behavioral health risk factors. Implementation approaches were multifaceted and consisted of incorporating behavioral health providers into primary care, facilitating learning collaboratives, providing support to clinicians, and using technology. These approaches generally resulted in increased screening, taking steps to address a positive screen, and initiation of treatment compared with using only minimal or no strategy. Multifaceted and overlapping implementation approaches evaluated in few studies with limited evidence on patient outcomes constrained our ability to make inferences. The identified implementation approaches may improve some aspects of identifying and addressing MHSUD in primary care. The evidence, however, is limited.",
      "structuredAbstract": [
        {
          "label": "CONTEXT",
          "text": "The proportion of US adolescents experiencing mental health or substance use disorders continues to rise. Pediatricians are expected to deliver evidence-based screening and counseling, but multiple barriers impede implementation."
        },
        {
          "label": "OBJECTIVE",
          "text": "This systematic review assessed the effectiveness of implementation strategies-activities to enhance implementation, service, and health outcomes-to support integration of screening and counseling for mental health and substance use disorders (MHSUD) into primary care for children and adolescents."
        },
        {
          "label": "DATA SOURCES",
          "text": "We searched multiple databases for literature published since 2010."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Eligible studies compared any strategy to support implementation of a recommended intervention to prevent MHSUD among individuals aged 18 years or younger in primary care with another strategy or no strategy."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "We extracted data on study designs, populations, settings, clinical interventions, barriers and facilitators to implementation, implementation interventions and comparators, and results."
        },
        {
          "label": "RESULTS",
          "text": "Eleven studies focused on implementing screening and counseling for depression, eating disorders, substance use disorders, and general behavioral health risk factors. Implementation approaches were multifaceted and consisted of incorporating behavioral health providers into primary care, facilitating learning collaboratives, providing support to clinicians, and using technology. These approaches generally resulted in increased screening, taking steps to address a positive screen, and initiation of treatment compared with using only minimal or no strategy."
        },
        {
          "label": "LIMITATIONS",
          "text": "Multifaceted and overlapping implementation approaches evaluated in few studies with limited evidence on patient outcomes constrained our ability to make inferences."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The identified implementation approaches may improve some aspects of identifying and addressing MHSUD in primary care. The evidence, however, is limited."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40234240/",
      "pubDate": "2025 Jul 01",
      "doi": "10.1542/peds.2024-070314",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false,
      "summary": "Implementation approaches show potential."
    },
    {
      "id": "04042aeaf7c7",
      "title": "Comparison of easy-to-use clinical prognostic models to identify low-risk normotensive patients with pulmonary embolism.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118734",
      "abstract": "Lack of practicality is a common barrier to the use of clinical prognostic models for acute pulmonary embolism (PE). This study compared easy-to-use prognostic models with <10 readily available variables to identify low-risk patients with PE who are candidates for home care. Based on prospective cohort data from 677 patients with acute PE from 9 Swiss hospitals, we calculated 11 easy-to-use prognostic models (simplified version of Pulmonary Embolism Severity Index [sPESI], Geneva Prognostic Score, shock index [SI], BOVA, modified H-FABP, Syncope, Tachycardia [FAST], eStiMaTe, Platelets, Age, Troponin, Heart rate, Oxygenation, and Systolic blood pressure, Uresandi, Agterof, Huang, and European Society of Cardiology [ESC]-2019) and classified patients as low vs higher risk. The primary outcome was 30-day overall mortality. For each model, we examined test characteristics and the weighted clinical net benefit, ie, the percentage of avoided hospitalizations in low-risk patients minus the percentage of deceased low-risk patients, assuming that death is 100 times worse than a not avoided hospitalization. Overall, 21 of 677 patients (3.1%) died within 30 days. The proportion of patients classified as low risk varied widely from 18.9% (eStiMaTe) to 95.8% (SI). Mortality among low-risk patients ranged from 0% (sPESI, eStiMaTe, and ESC-2019) to 3.0% (modified FAST), with sensitivities varying from 100% (sPESI, eStiMaTe, and ESC-2019) to 9.5% (SI). Similarly, the negative likelihood ratios for mortality ranged from 0.06 (sPESI) to 0.95 (modified FAST). The weighted net benefit was highest for the sPESI (35.9%) and lowest for the SI (-187.6%). The sPESI, the eStimMaTe score, and the ESC-2019 model most accurately identified patients with PE who are at low risk of mortality. The sPESI showed the highest clinical net benefit.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Lack of practicality is a common barrier to the use of clinical prognostic models for acute pulmonary embolism (PE)."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study compared easy-to-use prognostic models with <10 readily available variables to identify low-risk patients with PE who are candidates for home care."
        },
        {
          "label": "METHODS",
          "text": "Based on prospective cohort data from 677 patients with acute PE from 9 Swiss hospitals, we calculated 11 easy-to-use prognostic models (simplified version of Pulmonary Embolism Severity Index [sPESI], Geneva Prognostic Score, shock index [SI], BOVA, modified H-FABP, Syncope, Tachycardia [FAST], eStiMaTe, Platelets, Age, Troponin, Heart rate, Oxygenation, and Systolic blood pressure, Uresandi, Agterof, Huang, and European Society of Cardiology [ESC]-2019) and classified patients as low vs higher risk. The primary outcome was 30-day overall mortality. For each model, we examined test characteristics and the weighted clinical net benefit, ie, the percentage of avoided hospitalizations in low-risk patients minus the percentage of deceased low-risk patients, assuming that death is 100 times worse than a not avoided hospitalization."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 21 of 677 patients (3.1%) died within 30 days. The proportion of patients classified as low risk varied widely from 18.9% (eStiMaTe) to 95.8% (SI). Mortality among low-risk patients ranged from 0% (sPESI, eStiMaTe, and ESC-2019) to 3.0% (modified FAST), with sensitivities varying from 100% (sPESI, eStiMaTe, and ESC-2019) to 9.5% (SI). Similarly, the negative likelihood ratios for mortality ranged from 0.06 (sPESI) to 0.95 (modified FAST). The weighted net benefit was highest for the sPESI (35.9%) and lowest for the SI (-187.6%)."
        },
        {
          "label": "CONCLUSION",
          "text": "The sPESI, the eStimMaTe score, and the ESC-2019 model most accurately identified patients with PE who are at low risk of mortality. The sPESI showed the highest clinical net benefit."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41422946/",
      "pubDate": "2025 Dec 19",
      "doi": "10.1016/j.jtha.2025.11.023",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false,
      "summary": "The sPESI."
    },
    {
      "id": "82604abf7917",
      "title": "Diagnostic tests for ovarian cancer in premenopausal women with non-specific symptoms (ROCkeTS): prospective, multicentre, cohort study.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118732",
      "abstract": "To investigate the accuracy of risk prediction models and scores for diagnosing ovarian cancer in premenopausal women presenting to secondary care with symptoms and abnormal test results. Prospective cohort study. Secondary care in 23 hospitals in the UK between June 2015 and March 2023. Premenopausal women presenting with non-specific symptoms, and raised serum levels of cancer antigen 125 or abnormal imaging results, were prospectively recruited, predominantly referred through the NHS urgent suspected cancer pathway from primary care. A head-to-head comparison of the accuracy of the six risk prediction models and scores was conducted using donated blood and ultrasound scans performed by NHS staff trained in the use of International Ovarian Tumour Analysis (IOTA) imaging terminology. The index tests used were Risk of Malignancy Index 1 (with pre-stated thresholds of 200, 250), Risk of Malignancy Algorithm (7.4%, 11.4%, 12.5%, 13.1%), IOTA Assessment of Different Neoplasias in the adnEXa (ADNEX) (3%, 10%), IOTA simple rules risk model (3%, 10%), IOTA simple rules, and cancer antigen 125 (CA 125, 87 IU/mL). Participants were classified as having primary invasive ovarian cancer versus having benign or normal pathology according to the reference standard determined from surgical specimens or biopsies by histology or cytology, if undertaken, or else at 12 month follow-up. After June 2018, because of covid restrictions and concerns about sample size, recruitment was restricted to only women undergoing surgery within three months of presentation to clinic (in whom ovarian cancer was more likely). Diagnostic accuracy at predicting primary invasive ovarian cancer versus benign or normal histology, assessed by analysing the sensitivity, specificity, C index, area under receiver operating characteristic curve, positive and negative predictive values, and calibration plots in participants with conclusive reference standard results and available index test data. 88 of 1211 premenopausal women received diagnoses of primary ovarian cancer: 49 of 857 women in the pre-June 2018 cohort (prevalence of 5.7%) and 39 of 354 women in the post-June 2018 cohort (11.0%). For the diagnosis of primary ovarian cancer (n=799 women, after exclusion of 58 other diagnoses), Risk of Malignancy Index 1 at the 250 threshold had a sensitivity of 42.6% (95% confidence interval (CI) 28.3 to 57.8; specificity 96.5%, 94.7 to 97.8). Compared with Risk of Malignancy Index 1 at the 250 threshold, CA 125 and all other tests had higher sensitivity (CA 125 at 87 IU/mL threshold: 55.1%, 40.2 to 69.3, P=0.06; Risk of Malignancy Algorithm at 11.4% threshold: 79.2%, 65.0 to 89.5, P<0.001; IOTA ADNEX at 10% threshold: 89.1%, 76.4 to 96.4, P<0.001; IOTA simple rules risk at 10% threshold: 83.0%, 69.2 to 92.4, P<0.001; IOTA simple rules: 75.0%, 56.6 to 88.5, P=0.01) and lower specificity (CA 125 at 87 IU/mL threshold: 89.0%, 86.5 to 91.2, P<0.001; Risk of Malignancy Algorithm at 11.4% threshold: 73.1%, 69.6 to 76.3, P<0.001; IOTA ADNEX at 10% threshold: 75.1%, 71.4 to 78.6, P<0.001; IOTA simple rules risk at 10% threshold: 76.0%, 72.4 to 79.3, P<0.001; IOTA simple rules: 95.2%, 93.0 to 96.9, P=0.06). Results for IOTA simple rules were inconclusive in 120 of 799 participants. Analysis of the complete cohort (n=1211), including the 354 premenopausal women with a higher likelihood of developing ovarian cancer, yielded similar results. Compared to Risk of Malignancy Index 1 at 250 threshold-the test currently used in NHS secondary care to triage women to tertiary care-most tests improve sensitivity but reduce specificity. Ultrasound triage with the IOTA ADNEX model at 10% in secondary care demonstrated the highest sensitivity gain, with a comparable decline in specificity to other comparator tests. Ultrasound with the IOTA ADNEX model at 10% should be considered the new standard of care test for triaging premenopausal women in secondary care. Implementation should incorporate staff training and quality assurance. ISRCTN17160843.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To investigate the accuracy of risk prediction models and scores for diagnosing ovarian cancer in premenopausal women presenting to secondary care with symptoms and abnormal test results."
        },
        {
          "label": "DESIGN",
          "text": "Prospective cohort study."
        },
        {
          "label": "SETTING",
          "text": "Secondary care in 23 hospitals in the UK between June 2015 and March 2023."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Premenopausal women presenting with non-specific symptoms, and raised serum levels of cancer antigen 125 or abnormal imaging results, were prospectively recruited, predominantly referred through the NHS urgent suspected cancer pathway from primary care. A head-to-head comparison of the accuracy of the six risk prediction models and scores was conducted using donated blood and ultrasound scans performed by NHS staff trained in the use of International Ovarian Tumour Analysis (IOTA) imaging terminology. The index tests used were Risk of Malignancy Index 1 (with pre-stated thresholds of 200, 250), Risk of Malignancy Algorithm (7.4%, 11.4%, 12.5%, 13.1%), IOTA Assessment of Different Neoplasias in the adnEXa (ADNEX) (3%, 10%), IOTA simple rules risk model (3%, 10%), IOTA simple rules, and cancer antigen 125 (CA 125, 87 IU/mL). Participants were classified as having primary invasive ovarian cancer versus having benign or normal pathology according to the reference standard determined from surgical specimens or biopsies by histology or cytology, if undertaken, or else at 12 month follow-up. After June 2018, because of covid restrictions and concerns about sample size, recruitment was restricted to only women undergoing surgery within three months of presentation to clinic (in whom ovarian cancer was more likely)."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Diagnostic accuracy at predicting primary invasive ovarian cancer versus benign or normal histology, assessed by analysing the sensitivity, specificity, C index, area under receiver operating characteristic curve, positive and negative predictive values, and calibration plots in participants with conclusive reference standard results and available index test data."
        },
        {
          "label": "RESULTS",
          "text": "88 of 1211 premenopausal women received diagnoses of primary ovarian cancer: 49 of 857 women in the pre-June 2018 cohort (prevalence of 5.7%) and 39 of 354 women in the post-June 2018 cohort (11.0%). For the diagnosis of primary ovarian cancer (n=799 women, after exclusion of 58 other diagnoses), Risk of Malignancy Index 1 at the 250 threshold had a sensitivity of 42.6% (95% confidence interval (CI) 28.3 to 57.8; specificity 96.5%, 94.7 to 97.8). Compared with Risk of Malignancy Index 1 at the 250 threshold, CA 125 and all other tests had higher sensitivity (CA 125 at 87 IU/mL threshold: 55.1%, 40.2 to 69.3, P=0.06; Risk of Malignancy Algorithm at 11.4% threshold: 79.2%, 65.0 to 89.5, P<0.001; IOTA ADNEX at 10% threshold: 89.1%, 76.4 to 96.4, P<0.001; IOTA simple rules risk at 10% threshold: 83.0%, 69.2 to 92.4, P<0.001; IOTA simple rules: 75.0%, 56.6 to 88.5, P=0.01) and lower specificity (CA 125 at 87 IU/mL threshold: 89.0%, 86.5 to 91.2, P<0.001; Risk of Malignancy Algorithm at 11.4% threshold: 73.1%, 69.6 to 76.3, P<0.001; IOTA ADNEX at 10% threshold: 75.1%, 71.4 to 78.6, P<0.001; IOTA simple rules risk at 10% threshold: 76.0%, 72.4 to 79.3, P<0.001; IOTA simple rules: 95.2%, 93.0 to 96.9, P=0.06). Results for IOTA simple rules were inconclusive in 120 of 799 participants. Analysis of the complete cohort (n=1211), including the 354 premenopausal women with a higher likelihood of developing ovarian cancer, yielded similar results."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Compared to Risk of Malignancy Index 1 at 250 threshold-the test currently used in NHS secondary care to triage women to tertiary care-most tests improve sensitivity but reduce specificity. Ultrasound triage with the IOTA ADNEX model at 10% in secondary care demonstrated the highest sensitivity gain, with a comparable decline in specificity to other comparator tests. Ultrasound with the IOTA ADNEX model at 10% should be considered the new standard of care test for triaging premenopausal women in secondary care. Implementation should incorporate staff training and quality assurance."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ISRCTN17160843."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41605528/",
      "pubDate": "2026 Jan 28",
      "doi": "10.1136/bmj-2024-083912",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "7a89f04b10cb",
      "title": "Single-dose intravenous iron vs oral iron for treatment of maternal iron deficiency anemia: a randomized clinical trial.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118674",
      "abstract": "Maternal iron deficiency anemia is a persistent global health challenge with increased risk of adverse perinatal outcomes. Obstetric guidelines advocate for first-line treatment of moderate iron deficiency anemia with twice-daily oral iron; however, rates of iron deficiency anemia in pregnancy remain above global targets and are rising. Determine whether single-dose intravenous iron for primary treatment of maternal iron deficiency anemia in the second trimester is superior to twice daily oral iron in reducing incidence of low birth weight infants and maternal anemia at delivery. This is a parallel, 3-arm, semiblind superiority randomized controlled multicenter trial across 4 sites in India from March 15, 2021-May 12, 2023. Participants were singleton pregnancies at 14 to 17 weeks with moderate iron deficiency anemia (hemoglobin 7.0-9.9 g/dL) who were randomized 1:1:1 to (1) 60 mg oral ferrous sulfate twice daily; or single-dose infusion of (2) intravenous ferric derisomaltose or (3) intravenous ferric carboxymaltose. Two intravenous arms were selected as these are the only 2 intravenous iron formulations publicly available in India. All participants received folic acid supplementation throughout pregnancy and antihelminthic therapy, as recommended by national guidelines. The dual primary outcomes were: (1) low birth weight (<2500 grams) and (2) attainment of a maternal nonanemic state (hemoglobin ≥11.0 g/dL at 30-34 weeks or delivery) for each intravenous iron arm vs oral iron; intravenous iron arms were not compared to each other. Secondary outcomes included safety measures, and other maternal and infant outcomes. Participants with hemoglobin <7 g/dL or <1 g/dL improvement on therapy received rescue treatment with intravenous iron or blood transfusion as determined by their provider. Sensitivity analyses included defining nonanemic state as achieving hemoglobin ≥11.0 without need for additional IV iron or transfusion. Comparison of each intravenous iron arm to oral iron was conducted with a 2-sided alpha set at 0.0005 for achieving nonanemic state and 0.0245 for low birth weight for each intravenous iron arm using a Cochran-Mantel-Haenszel chi-square test stratified by enrollment site. The oral iron, ferric derisomaltose, and ferric carboxymaltose arms included 1450, 1456, and 1462 participants respectively. There was a reduced rate of low birth weight with intravenous ferric carboxymaltose (25·2%, relative risk 0·87 [97·55% confidence interval 0.75, 0.99], P=.017), but not intravenous ferric derisomaltose (29.1%, relative risk 0.98 [97.55% confidence interval 0.86, 1.12], P=.71) vs oral iron (29.3%). Achievement of nonanemic state was not improved: intravenous ferric carboxymaltose (relative risk 1.05 [99.95% confidence interval 0.97-1.15]) and intravenous ferric derisomaltose (relative risk 1.06 [99.95% confidence interval 0.98, 1.16]) vs oral (69.7%). In sensitivity analysis, there was increased rate of achieving nonanemic state without use of additional IV iron or transfusion in both intravenous ferric derisomaltose (relative risk 1.25 (1.13-1.396), P<.0001) and intravenous ferric carboxymaltose (relative risk 1.24 (1.12-1.38), P<.0001) vs oral iron. First-line treatment of moderate maternal iron deficiency anemia with single-dose infusion of intravenous iron results in a reduced incidence of low birth weight infants (intravenous ferric carboxymaltose vs oral) and a higher incidence of attaining maternal nonanemic state without use of additional iron or blood transfusion (intravenous ferric carboxymaltose and ferric derisomaltose vs oral). Clinical guidelines should address the potential benefit of single-dose intravenous iron as the primary treatment of moderate iron deficiency anemia in pregnancy.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Maternal iron deficiency anemia is a persistent global health challenge with increased risk of adverse perinatal outcomes. Obstetric guidelines advocate for first-line treatment of moderate iron deficiency anemia with twice-daily oral iron; however, rates of iron deficiency anemia in pregnancy remain above global targets and are rising."
        },
        {
          "label": "OBJECTIVE",
          "text": "Determine whether single-dose intravenous iron for primary treatment of maternal iron deficiency anemia in the second trimester is superior to twice daily oral iron in reducing incidence of low birth weight infants and maternal anemia at delivery."
        },
        {
          "label": "STUDY DESIGN",
          "text": "This is a parallel, 3-arm, semiblind superiority randomized controlled multicenter trial across 4 sites in India from March 15, 2021-May 12, 2023. Participants were singleton pregnancies at 14 to 17 weeks with moderate iron deficiency anemia (hemoglobin 7.0-9.9 g/dL) who were randomized 1:1:1 to (1) 60 mg oral ferrous sulfate twice daily; or single-dose infusion of (2) intravenous ferric derisomaltose or (3) intravenous ferric carboxymaltose. Two intravenous arms were selected as these are the only 2 intravenous iron formulations publicly available in India. All participants received folic acid supplementation throughout pregnancy and antihelminthic therapy, as recommended by national guidelines. The dual primary outcomes were: (1) low birth weight (<2500 grams) and (2) attainment of a maternal nonanemic state (hemoglobin ≥11.0 g/dL at 30-34 weeks or delivery) for each intravenous iron arm vs oral iron; intravenous iron arms were not compared to each other. Secondary outcomes included safety measures, and other maternal and infant outcomes. Participants with hemoglobin <7 g/dL or <1 g/dL improvement on therapy received rescue treatment with intravenous iron or blood transfusion as determined by their provider. Sensitivity analyses included defining nonanemic state as achieving hemoglobin ≥11.0 without need for additional IV iron or transfusion. Comparison of each intravenous iron arm to oral iron was conducted with a 2-sided alpha set at 0.0005 for achieving nonanemic state and 0.0245 for low birth weight for each intravenous iron arm using a Cochran-Mantel-Haenszel chi-square test stratified by enrollment site."
        },
        {
          "label": "RESULTS",
          "text": "The oral iron, ferric derisomaltose, and ferric carboxymaltose arms included 1450, 1456, and 1462 participants respectively. There was a reduced rate of low birth weight with intravenous ferric carboxymaltose (25·2%, relative risk 0·87 [97·55% confidence interval 0.75, 0.99], P=.017), but not intravenous ferric derisomaltose (29.1%, relative risk 0.98 [97.55% confidence interval 0.86, 1.12], P=.71) vs oral iron (29.3%). Achievement of nonanemic state was not improved: intravenous ferric carboxymaltose (relative risk 1.05 [99.95% confidence interval 0.97-1.15]) and intravenous ferric derisomaltose (relative risk 1.06 [99.95% confidence interval 0.98, 1.16]) vs oral (69.7%). In sensitivity analysis, there was increased rate of achieving nonanemic state without use of additional IV iron or transfusion in both intravenous ferric derisomaltose (relative risk 1.25 (1.13-1.396), P<.0001) and intravenous ferric carboxymaltose (relative risk 1.24 (1.12-1.38), P<.0001) vs oral iron."
        },
        {
          "label": "CONCLUSION",
          "text": "First-line treatment of moderate maternal iron deficiency anemia with single-dose infusion of intravenous iron results in a reduced incidence of low birth weight infants (intravenous ferric carboxymaltose vs oral) and a higher incidence of attaining maternal nonanemic state without use of additional iron or blood transfusion (intravenous ferric carboxymaltose and ferric derisomaltose vs oral). Clinical guidelines should address the potential benefit of single-dose intravenous iron as the primary treatment of moderate iron deficiency anemia in pregnancy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/39909327/",
      "pubDate": "2025 Aug",
      "doi": "10.1016/j.ajog.2025.01.037",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false,
      "summary": "Single-dose."
    },
    {
      "id": "a7fe982cb26f",
      "title": "Cancer Incidence and Mortality With Aspirin in Older Adults: Follow-Up of the ASPREE Trial.",
      "journal": "JAMA Oncol",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49960221/118746",
      "abstract": "Prior studies, largely among middle-aged adults, reported aspirin reduces cancer risk after 10 years, particularly for colorectal cancer (CRC). In contrast, the Aspirin in Reducing Events in the Elderly (ASPREE) randomized clinical trial (RCT) reported that low-dose aspirin (LDA) treatment for a median of 4.7 years had no effect on overall cancer incidence but increased risk of incident late-stage cancer and cancer-related mortality. To assess whether LDA is associated with cancer incidence and mortality in 10 years of follow-up in older adults (aged ≥70 years) and to assess the association with cancer after prior LDA exposure (legacy effects). This community-based binational (Australian and US) cohort study included community-dwelling older adults (aged ≥70 years for Australian participants and ≥65 years for US minority group participants) free from overt cardiovascular disease, dementia, or independence-limiting physical disability. The cohort was derived from the ASPREE randomized clinical trial conducted from 2010 to 2017, with the observational extension study (ASPREE-XT) following up participants from 2018 to 2024. This study reports data from 2010 through 2022 (long-term outcomes) as well as reports analyses confined to the observation phase only (legacy analyses). Data were analyzed from May to November 2025. Daily 100-mg aspirin or placebo from randomization until cessation of study drug. Outcomes were physician-adjudicated incident cancer, type, stage at diagnosis, and cancer mortality. In 19 114 community-dwelling older adults (mean [SD] age, 75.1 [4.5] years; 56.4% female), a total of 3448 incident cancers and 1173 cancer-related deaths occurred over 10 years of follow-up (median, 8.6 [IQR, 7.4-10.0] years) during ASPREE and ASPREE-XT. LDA was not associated with overall cancer incidence over the long term (hazard ratio [HR] = 0.98; 95% CI, 0.92-1.05), by stage at diagnosis or cancer type, including colorectal cancer (HR = 1.01; 95% CI, 0.84-1.21). However, LDA was associated with increased cancer-related mortality (HR = 1.15; 95% CI, 1.03-1.29). Among 14 907 participants without cancer during the RCT and consented into ASPREE-XT (median age, 78.6 years [IQR, 76.2-82.1]; 57.5% female), 1451 incident cancers and 376 cancer deaths occurred in the post-RCT period, during which original aspirin assignment during the RCT was not associated with differences in cancer incidence (HR = 0.91; 95% CI, 0.82-1.01) or cancer-related mortality (HR = 1.02; 95% CI, 0.83-1.25) compared with original placebo assignment. In this study, over a median of 8.6 years, LDA was not associated with incident cancer among older adults, but cancer mortality risk was significantly elevated. However, the elevated cancer mortality risk seen with aspirin for participants in the RCT period did not persist into the post-RCT observation period, suggesting no legacy effect.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Prior studies, largely among middle-aged adults, reported aspirin reduces cancer risk after 10 years, particularly for colorectal cancer (CRC). In contrast, the Aspirin in Reducing Events in the Elderly (ASPREE) randomized clinical trial (RCT) reported that low-dose aspirin (LDA) treatment for a median of 4.7 years had no effect on overall cancer incidence but increased risk of incident late-stage cancer and cancer-related mortality."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess whether LDA is associated with cancer incidence and mortality in 10 years of follow-up in older adults (aged ≥70 years) and to assess the association with cancer after prior LDA exposure (legacy effects)."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This community-based binational (Australian and US) cohort study included community-dwelling older adults (aged ≥70 years for Australian participants and ≥65 years for US minority group participants) free from overt cardiovascular disease, dementia, or independence-limiting physical disability. The cohort was derived from the ASPREE randomized clinical trial conducted from 2010 to 2017, with the observational extension study (ASPREE-XT) following up participants from 2018 to 2024. This study reports data from 2010 through 2022 (long-term outcomes) as well as reports analyses confined to the observation phase only (legacy analyses). Data were analyzed from May to November 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Daily 100-mg aspirin or placebo from randomization until cessation of study drug."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Outcomes were physician-adjudicated incident cancer, type, stage at diagnosis, and cancer mortality."
        },
        {
          "label": "RESULTS",
          "text": "In 19 114 community-dwelling older adults (mean [SD] age, 75.1 [4.5] years; 56.4% female), a total of 3448 incident cancers and 1173 cancer-related deaths occurred over 10 years of follow-up (median, 8.6 [IQR, 7.4-10.0] years) during ASPREE and ASPREE-XT. LDA was not associated with overall cancer incidence over the long term (hazard ratio [HR] = 0.98; 95% CI, 0.92-1.05), by stage at diagnosis or cancer type, including colorectal cancer (HR = 1.01; 95% CI, 0.84-1.21). However, LDA was associated with increased cancer-related mortality (HR = 1.15; 95% CI, 1.03-1.29). Among 14 907 participants without cancer during the RCT and consented into ASPREE-XT (median age, 78.6 years [IQR, 76.2-82.1]; 57.5% female), 1451 incident cancers and 376 cancer deaths occurred in the post-RCT period, during which original aspirin assignment during the RCT was not associated with differences in cancer incidence (HR = 0.91; 95% CI, 0.82-1.01) or cancer-related mortality (HR = 1.02; 95% CI, 0.83-1.25) compared with original placebo assignment."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this study, over a median of 8.6 years, LDA was not associated with incident cancer among older adults, but cancer mortality risk was significantly elevated. However, the elevated cancer mortality risk seen with aspirin for participants in the RCT period did not persist into the post-RCT observation period, suggesting no legacy effect."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41609798/",
      "pubDate": "2026 Jan 29",
      "doi": "10.1001/jamaoncol.2025.6196",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "5b132230dbe0",
      "title": "Physiotherapy for endometriosis-associated pelvic pain: a systematic review and meta-analysis.",
      "journal": "Pain Med",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49960221/118742",
      "abstract": "Endometriosis is a disease often associated with chronic pelvic pain. It affects around 190 million females of reproductive age globally. To investigate the effect of physiotherapy techniques (PTs) in relieving endometriosis-associated pain. This systematic review and meta-analysis followed the PRISMA 2020 and Cochrane Handbook guidelines. The study protocol was followed and registered on PROSPERO (CRD42023474231). A systematic search was conducted in 3 databases: PubMed, Embase, and Cochrane. We used the following PICO strategy: population, women with endometriosis-associated pelvic pain; intervention, PTs; comparator, non-PTs; outcome, pelvic pain changes. The article selection was conducted by 2 independent reviewers. Two authors extracted data independently from the eligible articles. For continuous outcomes, the mean difference (MD) in change scores between intervention and control groups was used as an effect size with a 95% confidence interval (CI). Within-group correlation of before- and after-treatment was assumed to be equal across groups and studies. Out of 8 eligible studies identified in our selection, 7 were included in the quantitative analysis. PTs were effective in reducing pain compared to non-PTs (MD -1.97, CI -2.99 to -0.95), and physiotherapy modalities (electrotherapy and laser devices) had the greatest reduction in pain levels (MD -2.03, CI -3.9 to -0.14) among all studies. Additionally, locally applied techniques resulted in greater pain reduction than the generally applied techniques. Physiotherapy techniques are effective in reducing pain in women with endometriosis, especially when applied locally.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Endometriosis is a disease often associated with chronic pelvic pain. It affects around 190 million females of reproductive age globally."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate the effect of physiotherapy techniques (PTs) in relieving endometriosis-associated pain."
        },
        {
          "label": "DESIGN",
          "text": "This systematic review and meta-analysis followed the PRISMA 2020 and Cochrane Handbook guidelines. The study protocol was followed and registered on PROSPERO (CRD42023474231)."
        },
        {
          "label": "SETTING",
          "text": "A systematic search was conducted in 3 databases: PubMed, Embase, and Cochrane."
        },
        {
          "label": "PARTICIPANTS",
          "text": "We used the following PICO strategy: population, women with endometriosis-associated pelvic pain; intervention, PTs; comparator, non-PTs; outcome, pelvic pain changes. The article selection was conducted by 2 independent reviewers."
        },
        {
          "label": "MAIN OUTCOME(S) AND MEASURE(S)",
          "text": "Two authors extracted data independently from the eligible articles. For continuous outcomes, the mean difference (MD) in change scores between intervention and control groups was used as an effect size with a 95% confidence interval (CI). Within-group correlation of before- and after-treatment was assumed to be equal across groups and studies."
        },
        {
          "label": "RESULTS",
          "text": "Out of 8 eligible studies identified in our selection, 7 were included in the quantitative analysis. PTs were effective in reducing pain compared to non-PTs (MD -1.97, CI -2.99 to -0.95), and physiotherapy modalities (electrotherapy and laser devices) had the greatest reduction in pain levels (MD -2.03, CI -3.9 to -0.14) among all studies. Additionally, locally applied techniques resulted in greater pain reduction than the generally applied techniques."
        },
        {
          "label": "CONCLUSION AND RELEVANCE",
          "text": "Physiotherapy techniques are effective in reducing pain in women with endometriosis, especially when applied locally."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40705433/",
      "pubDate": "2026 Jan 01",
      "doi": "10.1093/pm/pnaf083",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "5dcb75449747",
      "title": "Pain relief by targeting nonrestorative sleep in fibromyalgia: a phase 3 randomized trial of bedtime sublingual cyclobenzaprine.",
      "journal": "Pain Med",
      "score": "6/7",
      "tags": [
        "Rheumatology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49960221/118741",
      "abstract": "Fibromyalgia is the prototypic nociplastic chronic pain syndrome, characterized by widespread pain, nonrestorative sleep, and fatigue. We evaluated efficacy and safety of bedtime TNX-102 SL (sublingual cyclobenzaprine) 5.6 mg for treatment of fibromyalgia. This phase 3, double-blind, multicenter, placebo-controlled trial randomized patients 1:1 to once-nightly TNX-102 SL 2.8 mg for 2 weeks, followed by 5.6 mg for 12 weeks, or to matching placebo (NCT05273749). The primary endpoint was change from baseline at week 14 in weekly average of daily diary pain intensity scores. Secondary endpoints included Patient Global Impression of Change, Fibromyalgia Impact Questionnaire (Revised) Symptoms and Function domains, Patient-Reported Outcomes Measurement Information System instruments for Sleep Disturbance and Fatigue, and daily diary sleep quality scores. Overall, 81.0% (n = 187/231) and 79.6% (n = 179/225) of patients receiving TNX-102 SL and placebo completed the trial, respectively. Treatment with TNX-102 SL vs placebo was associated with significantly greater reductions in the primary pain endpoint (P < .001; mean [SE], -1.8 [0.12] vs -1.2 [0.12]) and in each of the 6 secondary endpoints (P ≤ .001; all). The most common systemic treatment-emergent adverse events (TEAEs) with TNX-102 SL and placebo were COVID-19 (4.3% vs 3.1%, respectively), headache (3.0% vs 1.8%), and somnolence (3.0% vs 1.3%); the most common TEAEs overall were local administration-site reactions including oral hypoesthesia (23.4% vs 0.4%), product taste abnormal (11.3% vs 0.9%), and oral paresthesia (6.9% vs 0.9%), which were transient and self-limited. Bedtime TNX-102 SL treatment was associated with significant improvements in fibromyalgia symptoms and function and was well tolerated. ClinicalTrials.gov/study/NCT05273749, first patient screened March 21, 2022.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Fibromyalgia is the prototypic nociplastic chronic pain syndrome, characterized by widespread pain, nonrestorative sleep, and fatigue. We evaluated efficacy and safety of bedtime TNX-102 SL (sublingual cyclobenzaprine) 5.6 mg for treatment of fibromyalgia."
        },
        {
          "label": "METHODS",
          "text": "This phase 3, double-blind, multicenter, placebo-controlled trial randomized patients 1:1 to once-nightly TNX-102 SL 2.8 mg for 2 weeks, followed by 5.6 mg for 12 weeks, or to matching placebo (NCT05273749). The primary endpoint was change from baseline at week 14 in weekly average of daily diary pain intensity scores. Secondary endpoints included Patient Global Impression of Change, Fibromyalgia Impact Questionnaire (Revised) Symptoms and Function domains, Patient-Reported Outcomes Measurement Information System instruments for Sleep Disturbance and Fatigue, and daily diary sleep quality scores."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 81.0% (n = 187/231) and 79.6% (n = 179/225) of patients receiving TNX-102 SL and placebo completed the trial, respectively. Treatment with TNX-102 SL vs placebo was associated with significantly greater reductions in the primary pain endpoint (P < .001; mean [SE], -1.8 [0.12] vs -1.2 [0.12]) and in each of the 6 secondary endpoints (P ≤ .001; all). The most common systemic treatment-emergent adverse events (TEAEs) with TNX-102 SL and placebo were COVID-19 (4.3% vs 3.1%, respectively), headache (3.0% vs 1.8%), and somnolence (3.0% vs 1.3%); the most common TEAEs overall were local administration-site reactions including oral hypoesthesia (23.4% vs 0.4%), product taste abnormal (11.3% vs 0.9%), and oral paresthesia (6.9% vs 0.9%), which were transient and self-limited."
        },
        {
          "label": "CONCLUSION",
          "text": "Bedtime TNX-102 SL treatment was associated with significant improvements in fibromyalgia symptoms and function and was well tolerated."
        },
        {
          "label": "CLINICAL TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov/study/NCT05273749, first patient screened March 21, 2022."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40627411/",
      "pubDate": "2026 Jan 01",
      "doi": "10.1093/pm/pnaf089",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "3ab9ea844da7",
      "title": "Non-pharmacological insomnia interventions for improving sleep and mood in people with neurological disorders: A systematic review and meta-analysis.",
      "journal": "Sleep Med",
      "score": "5/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49960221/118720",
      "abstract": "Insomnia is prevalent among individuals with neurological disorders and results in impaired sleep and mood. While evidence for non-pharmacological insomnia interventions is positive, they are typically developed for the general population, and their effectiveness in neurological populations, who face additional sleep and circadian challenges, remains unclear. To synthesize evidence on the effectiveness of non-pharmacological insomnia interventions for improving sleep and mood in individuals with neurological disorders. Randomized controlled trials (RCTs) were searched and reviewed across databases (Embase, Ovid-Medline, APA PsycInfo, Scopus, and Cochrane Library) for inclusion and analysis. Standardized mean differences (SMD) were estimated for sleep and mood outcomes using random-effects models. Nine RCTs were identified from a total of 1645 studies. Non-pharmacological interventions were effective in improving sleep quality (SMD = 1.36, 95 % confidence interval (CI) [0.68, 2.04]) and reducing insomnia symptoms (SMD = -0.90, 95 % CI [-1.25, -0.56]). Mood outcomes also improved, with reductions in depression (SMD = -0.45, 95 % CI [-0.73, -0.18]) and anxiety symptoms (SMD = -0.46, 95 % CI [-0.66, -0.26]). Individual- and group-based interventions were comparable in improving sleep, whereas only individual-based interventions were effective in improving mood. In-person interventions yielded larger effects on sleep, whereas digital interventions yielded larger effects on mood. Non-pharmacological insomnia interventions are effective in improving sleep and mood in neurological populations, although their effects are attenuated compared to those in the general population. Intervention effects vary based on delivery mode and format, underscoring the need for further research into optimal approaches to enhance treatment effectiveness.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Insomnia is prevalent among individuals with neurological disorders and results in impaired sleep and mood. While evidence for non-pharmacological insomnia interventions is positive, they are typically developed for the general population, and their effectiveness in neurological populations, who face additional sleep and circadian challenges, remains unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To synthesize evidence on the effectiveness of non-pharmacological insomnia interventions for improving sleep and mood in individuals with neurological disorders."
        },
        {
          "label": "METHODS",
          "text": "Randomized controlled trials (RCTs) were searched and reviewed across databases (Embase, Ovid-Medline, APA PsycInfo, Scopus, and Cochrane Library) for inclusion and analysis. Standardized mean differences (SMD) were estimated for sleep and mood outcomes using random-effects models."
        },
        {
          "label": "RESULTS",
          "text": "Nine RCTs were identified from a total of 1645 studies. Non-pharmacological interventions were effective in improving sleep quality (SMD = 1.36, 95 % confidence interval (CI) [0.68, 2.04]) and reducing insomnia symptoms (SMD = -0.90, 95 % CI [-1.25, -0.56]). Mood outcomes also improved, with reductions in depression (SMD = -0.45, 95 % CI [-0.73, -0.18]) and anxiety symptoms (SMD = -0.46, 95 % CI [-0.66, -0.26]). Individual- and group-based interventions were comparable in improving sleep, whereas only individual-based interventions were effective in improving mood. In-person interventions yielded larger effects on sleep, whereas digital interventions yielded larger effects on mood."
        },
        {
          "label": "CONCLUSION",
          "text": "Non-pharmacological insomnia interventions are effective in improving sleep and mood in neurological populations, although their effects are attenuated compared to those in the general population. Intervention effects vary based on delivery mode and format, underscoring the need for further research into optimal approaches to enhance treatment effectiveness."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41176810/",
      "pubDate": "2026 Jan",
      "doi": "10.1016/j.sleep.2025.106887",
      "dateReceived": "2026-02-11T23:41:12.979Z",
      "isNew": false
    },
    {
      "id": "4647100ff4f4",
      "title": "Tenecteplase for Acute Non-Large Vessel Occlusion 4.5 to 24 Hours After Ischemic Stroke: The OPTION Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/50043832/118801",
      "abstract": "The efficacy and safety of intravenous tenecteplase in non-large vessel occlusion acute ischemic stroke beyond 4.5 hours after symptom onset remain uncertain. To assess the efficacy and safety of intravenous tenecteplase administered 4.5 to 24 hours after stroke onset in patients with non-large vessel occlusion and salvageable brain tissue. This randomized, open-label, blinded end-point clinical trial was conducted at 48 centers in China. A total of 566 patients with non-large vessel occlusion stroke and evidence of potentially salvageable tissue determined on perfusion imaging presenting within 4.5 to 24 hours of the time last seen well were recruited between June 2, 2023, and August 4, 2025 (final follow-up, October 28, 2025). Patients were randomly assigned 1:1 using a minimization algorithm to receive intravenous tenecteplase (0.25 mg/kg; maximum dose, 25 mg; n = 282) or standard medical treatment (n = 284). The primary efficacy outcome was an excellent functional outcome, defined as a score of 0 or 1 on the modified Rankin Scale at 90 days. Safety outcomes included symptomatic intracranial hemorrhage within 36 hours and mortality within 90 days. Among the 570 patients randomized, 566 were included in the primary analysis (median age, 68 [IQR, 59-75] years; 196 female [34.6%]). An excellent functional outcome was observed in 123 of 282 patients (43.6%) in the tenecteplase group and 97 of 284 (34.2%) in the control group (risk ratio, 1.28 [95% CI, 1.04-1.57]; P = .02). The incidence of symptomatic intracranial hemorrhage at 2.8% was higher with tenecteplase than with standard medical treatment at 0% (risk difference, 2.85% [95% CI, 1.16%-5.54%]; P = .004), and the mortality at 90 days was 5.0% and 3.2%, respectively (risk ratio, 1.57 [95% CI, 0.69-3.57]; P = .28). Among patients with non-large vessel occlusion acute ischemic stroke and salvageable brain tissue, intravenous tenecteplase administered 4.5 to 24 hours after onset resulted in a greater likelihood of an excellent functional outcome at 90 days than standard care but had an increased risk of symptomatic intracranial hemorrhage. ClinicalTrials.gov Identifier: NCT05752916.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The efficacy and safety of intravenous tenecteplase in non-large vessel occlusion acute ischemic stroke beyond 4.5 hours after symptom onset remain uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of intravenous tenecteplase administered 4.5 to 24 hours after stroke onset in patients with non-large vessel occlusion and salvageable brain tissue."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized, open-label, blinded end-point clinical trial was conducted at 48 centers in China. A total of 566 patients with non-large vessel occlusion stroke and evidence of potentially salvageable tissue determined on perfusion imaging presenting within 4.5 to 24 hours of the time last seen well were recruited between June 2, 2023, and August 4, 2025 (final follow-up, October 28, 2025)."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomly assigned 1:1 using a minimization algorithm to receive intravenous tenecteplase (0.25 mg/kg; maximum dose, 25 mg; n = 282) or standard medical treatment (n = 284)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcome was an excellent functional outcome, defined as a score of 0 or 1 on the modified Rankin Scale at 90 days. Safety outcomes included symptomatic intracranial hemorrhage within 36 hours and mortality within 90 days."
        },
        {
          "label": "RESULTS",
          "text": "Among the 570 patients randomized, 566 were included in the primary analysis (median age, 68 [IQR, 59-75] years; 196 female [34.6%]). An excellent functional outcome was observed in 123 of 282 patients (43.6%) in the tenecteplase group and 97 of 284 (34.2%) in the control group (risk ratio, 1.28 [95% CI, 1.04-1.57]; P = .02). The incidence of symptomatic intracranial hemorrhage at 2.8% was higher with tenecteplase than with standard medical treatment at 0% (risk difference, 2.85% [95% CI, 1.16%-5.54%]; P = .004), and the mortality at 90 days was 5.0% and 3.2%, respectively (risk ratio, 1.57 [95% CI, 0.69-3.57]; P = .28)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with non-large vessel occlusion acute ischemic stroke and salvageable brain tissue, intravenous tenecteplase administered 4.5 to 24 hours after onset resulted in a greater likelihood of an excellent functional outcome at 90 days than standard care but had an increased risk of symptomatic intracranial hemorrhage."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05752916."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41642827/",
      "pubDate": "2026 Feb 05",
      "doi": "10.1001/jama.2026.0210",
      "dateReceived": "2026-02-11T23:41:12.978Z",
      "isNew": false,
      "summary": "In patients with non."
    }
  ]
}