{
  "updated_at": "2025-10-18T23:22:41.772Z",
  "articles": [
    {
      "id": "ad3c9f37e8b7",
      "title": "Tenecteplase for Acute Ischemic Stroke at 4.5 to 24 Hours: A Meta-Analysis of Randomized Controlled Trials.",
      "journal": "Stroke",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48565878/117885",
      "dateReceived": "2025-10-18T23:22:07.093Z",
      "isNew": true
    },
    {
      "id": "f33892702daf",
      "title": "Sultiame once per day in obstructive sleep apnoea (FLOW): a multicentre, randomised, double-blind, placebo-controlled, dose-finding, phase 2 trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48565878/117884",
      "dateReceived": "2025-10-18T23:22:07.093Z",
      "isNew": true
    },
    {
      "id": "bf50a0c9e338",
      "title": "Pharmacotherapies for cannabis use disorder.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48565878/117874",
      "abstract": "Globally, cannabis use is prevalent and widespread. There are currently no pharmacotherapies approved for the treatment of cannabis use disorder (a problematic pattern of cannabis use that leads to clinically significant impairment or distress). This is the second update of a Cochrane Review first published in the Cochrane Library in Issue 12, 2014. To assess the effectiveness and safety of pharmacotherapies as compared with each other, placebo or no pharmacotherapy (supportive care) for reducing symptoms of cannabis withdrawal and promoting cessation or reduction of cannabis use. We updated our searches of the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase and PsycINFO in May 2024. Randomised controlled trials (RCTs) and quasi-RCTs of medications to treat cannabis withdrawal and/or to promote cessation or reduction of cannabis use, in comparison with other medications, placebo or no medication in people diagnosed as cannabis dependent or who are likely to be dependent. Critical outcomes were: 1) abstinence at the end of treatment; 2) intensity of withdrawal including craving; 3) nature, incidence and frequency of adverse events (AE) and 4) severe AE (SAE); 5) withdrawal from treatment due to adverse effects and whether the planned medication regimen was modified in response to adverse effects; 6) completion of scheduled treatment. Important outcomes were: 1) cannabis use at the end of treatment; 2) number of participants engaged in further treatment; 3) economic outcomes. We assessed the risk of bias in results included in meta-analyses using the risk of bias 2 (RoB 2) tool. We synthesised results for each outcome using random-effect meta-analysis where possible. Where this was not possible due to the nature of the data, we reported results narratively. We used GRADE to assess the certainty of evidence. We included 37 RCTs (3201 participants). Most were undertaken in the USA (29), Australia (4), Israel (2), Canada (1) and the United Kingdom (1), mainly recruiting adults (mean age 22-41 years), with four studies only including young people (mean age 17-21 years). In 32 studies, most of the participants were male (56-92%). Five studies targeted participants with comorbidities (depression (2), bipolar disorder (1), and attention deficit hyperactivity disorder (1)). Eleven studies received study medicines from the manufacturing company and none were funded by pharmaceutical companies. Thirty-six studies compared active medications and placebo; one study compared four active medications. Medications were diverse, as were the outcomes reported, which limited the potential for synthesis. Abstinence at end of treatment was no more likely with Δ-tetrahydrocannabinol (THC) preparations (risk ratio (RR) 1.04, 95% CI 0.71 to 1.52; 4 studies, 290 participants; moderate-certainty evidence) or N-acetylcysteine (RR 1.17, 95% CI 0.73 to 1.88; 2 studies, 270 participants; moderate-certainty evidence), and may be no more likely with cannabidiol (RR 2.23, 95% CI 0.54 to 9.32; 1 study, 68 participants; low-certainty evidence) or with anticonvulsant and mood stabilisers (RR 1.23, 95% CI 0.52 to 2.92; 1 study, 29 participants; very low-certainty evidence), when compared with placebo, but the evidence is uncertain. AE and SAE. There was probably little to no difference in the likelihood of AEs in participants treated with THC preparations (RR 1.05, 95% CI 0.88 to 1.26; 5 studies, 507 participants), cannabidiol (RR 1.01, 95% CI 0.81 to 1.25; 2 studies, 57 participants), N-acetylcysteine (RR 0.82, 95% CI 0.63 to 1.07; 2 studies, 418 participants), PF-04457845 (RR 0.98, 95% CI 0.87 to 1.11; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with anticonvulsants and mood stabilisers (RR 0.96, 95% CI 0.81 to 1.13; 4 studies, 331 participants) or oxytocin (RR 0.50, 95% CI 0.06 to 4.47; 1 study, 16 participants) (both low-certainty evidence), compared with placebo. SAE may be no more likely with THC preparations (RR 0.99, 95% CI 0.25 to 3.9; 7 studies, 584 participants), N-acetylcysteine (RR 0.16, 95% CI 0.02 to 1.33; 2 studies, 418 participants), PF-04457845 (RR 4.83, 95% CI 0.23 to 99.48; 2 studies, 298 participants), compared with placebo (all low-certainty evidence). Withdrawal from treatment due to adverse effects was more likely with anticonvulsants and mood stabilisers (RR 2.88, 95% CI 1.05 to 7.86; 5 studies, 257 participants; very low-certainty evidence), but the evidence is uncertain. There may be little to no difference in the likelihood of withdrawal from treatment due to adverse effects with THC preparations (RR 1.77, 95%CI 0.4 to 7.85; 5 studies, 507 participants), N-acetylcysteine (RR 0.61, 95% CI 0.03 to 12.53; 2 studies, 418 participants) compared with placebo (both low-certainty evidence). We found that completion of treatment was probably not more likely with cannabidiol (RR 1.02, 95% CI 0.89 to 1.17; 2 studies, 92 participants), anticonvulsant and mood stabilisers (RR 0.86, 95% CI 0.72 to 1.03; 6 studies, 407 participants), N-acetylcysteine (RR 1.08, 95% CI 0.95 to 1.23; 2 studies, 418 participants), or PF-04457845 (RR 0.96, 95% CI 0.85 to 1.07; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with THC (RR 1.11, 95% CI 0.93 to 1.32; 7 studies, 582 participants; low-certainty evidence). There is incomplete evidence for all the clinically-important pharmacotherapies investigated and, for half of their outcomes, the quality of the evidence was low (44%) or very low (11%). Given the limited evidence of efficacy, those pharmacotherapies should still be considered experimental for treating cannabis use disorder. The greater withdrawal from treatment due to adverse effects seen with anticonvulsants and mood stabilisers may limit their therapeutic value. FS, TP, JS: Received funding from the National Institute for Health and Care Research to directly support the conduct of this review. SN: National Health and Medical Research Council to directly support her time in the conduct of this review. Protocol [and previous versions] available via DOI: 10.1002/14651858.CD008940 [DOI: 10.1002/14651858.CD008940.pub2 and DOI: 10.1002/14651858.CD008940.pub3].",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Globally, cannabis use is prevalent and widespread. There are currently no pharmacotherapies approved for the treatment of cannabis use disorder (a problematic pattern of cannabis use that leads to clinically significant impairment or distress). This is the second update of a Cochrane Review first published in the Cochrane Library in Issue 12, 2014."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effectiveness and safety of pharmacotherapies as compared with each other, placebo or no pharmacotherapy (supportive care) for reducing symptoms of cannabis withdrawal and promoting cessation or reduction of cannabis use."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We updated our searches of the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase and PsycINFO in May 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials (RCTs) and quasi-RCTs of medications to treat cannabis withdrawal and/or to promote cessation or reduction of cannabis use, in comparison with other medications, placebo or no medication in people diagnosed as cannabis dependent or who are likely to be dependent."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were: 1) abstinence at the end of treatment; 2) intensity of withdrawal including craving; 3) nature, incidence and frequency of adverse events (AE) and 4) severe AE (SAE); 5) withdrawal from treatment due to adverse effects and whether the planned medication regimen was modified in response to adverse effects; 6) completion of scheduled treatment. Important outcomes were: 1) cannabis use at the end of treatment; 2) number of participants engaged in further treatment; 3) economic outcomes."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed the risk of bias in results included in meta-analyses using the risk of bias 2 (RoB 2) tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using random-effect meta-analysis where possible. Where this was not possible due to the nature of the data, we reported results narratively. We used GRADE to assess the certainty of evidence."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 37 RCTs (3201 participants). Most were undertaken in the USA (29), Australia (4), Israel (2), Canada (1) and the United Kingdom (1), mainly recruiting adults (mean age 22-41 years), with four studies only including young people (mean age 17-21 years). In 32 studies, most of the participants were male (56-92%). Five studies targeted participants with comorbidities (depression (2), bipolar disorder (1), and attention deficit hyperactivity disorder (1)). Eleven studies received study medicines from the manufacturing company and none were funded by pharmaceutical companies. Thirty-six studies compared active medications and placebo; one study compared four active medications. Medications were diverse, as were the outcomes reported, which limited the potential for synthesis."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Abstinence at end of treatment was no more likely with Δ-tetrahydrocannabinol (THC) preparations (risk ratio (RR) 1.04, 95% CI 0.71 to 1.52; 4 studies, 290 participants; moderate-certainty evidence) or N-acetylcysteine (RR 1.17, 95% CI 0.73 to 1.88; 2 studies, 270 participants; moderate-certainty evidence), and may be no more likely with cannabidiol (RR 2.23, 95% CI 0.54 to 9.32; 1 study, 68 participants; low-certainty evidence) or with anticonvulsant and mood stabilisers (RR 1.23, 95% CI 0.52 to 2.92; 1 study, 29 participants; very low-certainty evidence), when compared with placebo, but the evidence is uncertain. AE and SAE. There was probably little to no difference in the likelihood of AEs in participants treated with THC preparations (RR 1.05, 95% CI 0.88 to 1.26; 5 studies, 507 participants), cannabidiol (RR 1.01, 95% CI 0.81 to 1.25; 2 studies, 57 participants), N-acetylcysteine (RR 0.82, 95% CI 0.63 to 1.07; 2 studies, 418 participants), PF-04457845 (RR 0.98, 95% CI 0.87 to 1.11; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with anticonvulsants and mood stabilisers (RR 0.96, 95% CI 0.81 to 1.13; 4 studies, 331 participants) or oxytocin (RR 0.50, 95% CI 0.06 to 4.47; 1 study, 16 participants) (both low-certainty evidence), compared with placebo. SAE may be no more likely with THC preparations (RR 0.99, 95% CI 0.25 to 3.9; 7 studies, 584 participants), N-acetylcysteine (RR 0.16, 95% CI 0.02 to 1.33; 2 studies, 418 participants), PF-04457845 (RR 4.83, 95% CI 0.23 to 99.48; 2 studies, 298 participants), compared with placebo (all low-certainty evidence). Withdrawal from treatment due to adverse effects was more likely with anticonvulsants and mood stabilisers (RR 2.88, 95% CI 1.05 to 7.86; 5 studies, 257 participants; very low-certainty evidence), but the evidence is uncertain. There may be little to no difference in the likelihood of withdrawal from treatment due to adverse effects with THC preparations (RR 1.77, 95%CI 0.4 to 7.85; 5 studies, 507 participants), N-acetylcysteine (RR 0.61, 95% CI 0.03 to 12.53; 2 studies, 418 participants) compared with placebo (both low-certainty evidence). We found that completion of treatment was probably not more likely with cannabidiol (RR 1.02, 95% CI 0.89 to 1.17; 2 studies, 92 participants), anticonvulsant and mood stabilisers (RR 0.86, 95% CI 0.72 to 1.03; 6 studies, 407 participants), N-acetylcysteine (RR 1.08, 95% CI 0.95 to 1.23; 2 studies, 418 participants), or PF-04457845 (RR 0.96, 95% CI 0.85 to 1.07; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with THC (RR 1.11, 95% CI 0.93 to 1.32; 7 studies, 582 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is incomplete evidence for all the clinically-important pharmacotherapies investigated and, for half of their outcomes, the quality of the evidence was low (44%) or very low (11%). Given the limited evidence of efficacy, those pharmacotherapies should still be considered experimental for treating cannabis use disorder. The greater withdrawal from treatment due to adverse effects seen with anticonvulsants and mood stabilisers may limit their therapeutic value."
        },
        {
          "label": "FUNDING",
          "text": "FS, TP, JS: Received funding from the National Institute for Health and Care Research to directly support the conduct of this review. SN: National Health and Medical Research Council to directly support her time in the conduct of this review."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol [and previous versions] available via DOI: 10.1002/14651858.CD008940 [DOI: 10.1002/14651858.CD008940.pub2 and DOI: 10.1002/14651858.CD008940.pub3]."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41025421/",
      "pubDate": "2025 Sep 30",
      "doi": "10.1002/14651858.CD008940.pub4",
      "dateReceived": "2025-10-18T23:22:07.093Z",
      "isNew": true,
      "summary": "Current pharmacotherapies for cannabis use disorder lack sufficient evidence of efficacy and should be considered experimental, with some potentially causing adverse effects that limit their usefulness."
    },
    {
      "id": "1c6f7e6d7d71",
      "title": "Adverse Events Following Short-Course Systemic Corticosteroids Among Children and Adolescents: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48555079/117810",
      "abstract": "Short courses of systemic corticosteroids are used in the management of a number of acute clinical conditions, including Bell palsy, croup, and pneumonia, but research on associations of corticosteroid use with adverse events (AEs) in children is limited. To document AEs associated with short-term (≤14 days) use of systemic corticosteroids in children and adolescents (1 to younger than 18 years) across different clinical conditions. MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) databases were searched from inception to February 2025. Reference lists of eligible articles and related systematic reviews were also searched. Randomized clinical trials evaluating AEs (any unfavorable and unintended signs, symptoms, or syndromes that occurred during the period of using an investigational product) after use of short-course systemic corticosteroids in children and adolescents were included. Using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guideline, pairs of reviewers independently reviewed abstracts, extracted data, and assessed risk of bias of eligible trials. Pairwise, fixed-effects meta-analyses were performed using Mantel-Haenszel methods with risk difference (RD). The primary outcomes were serious AEs (events resulting in death, life-threatening conditions, hospitalization, or substantial disability), AEs leading to discontinuation, hyperglycemia, sleep disturbances, change in behavior, and gastrointestinal bleeding. RDs were reported as AEs per 1000 patients with 95% CIs. The Grading of Recommendations Assessment, Development and Evaluation approach was used to assess the certainty of evidence (high, moderate, low, or very low certainty). A total of 45 eligible trials that included 6470 children (mean [SD] age, 5.57 [3.62] years; 3753 male [58%]) were identified. In pooled analysis, there was moderate certainty evidence that compared with usual care, corticosteroids were not associated with serious AEs (RD, 1 fewer AE per 1000 patients [95% CI], 9 fewer to 7 more AEs per 1000 patients]), AEs leading to discontinuation (RD, 4 more AEs per 1000 patients [95% CI, 3 fewer to 11 more AEs per 1000 patients]), or change in behavior (RD, 8 more AEs per 1000 patients [95% CI, 5 fewer to 21 more AEs per 1000 patients]). With moderate certainty evidence, corticosteroids were associated with an increased risk of hyperglycemia (RD, 38 more AEs per 1000 patients [95% CI, 11 to 64 more AEs per 1000 patients]) and sleep problems (RD, 15 more AEs per 1000 patients [95% CI, 1 to 28 more AEs per 1000 patients]). Corticosteroid use was also associated with an increased risk of gastrointestinal bleeding (RD, 13 more per AEs per 1000 patients [95% CI, 3 to 23 more AEs per 1000 patients]), but the certainty of evidence was low. In this systematic review and meta-analysis of randomized trials, there was moderate certainty evidence that corticosteroids were associated with an increased risk of hyperglycemia and sleep problems and low certainty evidence that corticosteroids were associated with increased risk of gastrointestinal bleeding, but these AEs were very seldom serious. These findings suggest that an individualized approach to short-term corticosteroid use may be warranted and that further research is needed to obtain better quality of evidence.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Short courses of systemic corticosteroids are used in the management of a number of acute clinical conditions, including Bell palsy, croup, and pneumonia, but research on associations of corticosteroid use with adverse events (AEs) in children is limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To document AEs associated with short-term (≤14 days) use of systemic corticosteroids in children and adolescents (1 to younger than 18 years) across different clinical conditions."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) databases were searched from inception to February 2025. Reference lists of eligible articles and related systematic reviews were also searched."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Randomized clinical trials evaluating AEs (any unfavorable and unintended signs, symptoms, or syndromes that occurred during the period of using an investigational product) after use of short-course systemic corticosteroids in children and adolescents were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guideline, pairs of reviewers independently reviewed abstracts, extracted data, and assessed risk of bias of eligible trials. Pairwise, fixed-effects meta-analyses were performed using Mantel-Haenszel methods with risk difference (RD)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were serious AEs (events resulting in death, life-threatening conditions, hospitalization, or substantial disability), AEs leading to discontinuation, hyperglycemia, sleep disturbances, change in behavior, and gastrointestinal bleeding. RDs were reported as AEs per 1000 patients with 95% CIs. The Grading of Recommendations Assessment, Development and Evaluation approach was used to assess the certainty of evidence (high, moderate, low, or very low certainty)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 45 eligible trials that included 6470 children (mean [SD] age, 5.57 [3.62] years; 3753 male [58%]) were identified. In pooled analysis, there was moderate certainty evidence that compared with usual care, corticosteroids were not associated with serious AEs (RD, 1 fewer AE per 1000 patients [95% CI], 9 fewer to 7 more AEs per 1000 patients]), AEs leading to discontinuation (RD, 4 more AEs per 1000 patients [95% CI, 3 fewer to 11 more AEs per 1000 patients]), or change in behavior (RD, 8 more AEs per 1000 patients [95% CI, 5 fewer to 21 more AEs per 1000 patients]). With moderate certainty evidence, corticosteroids were associated with an increased risk of hyperglycemia (RD, 38 more AEs per 1000 patients [95% CI, 11 to 64 more AEs per 1000 patients]) and sleep problems (RD, 15 more AEs per 1000 patients [95% CI, 1 to 28 more AEs per 1000 patients]). Corticosteroid use was also associated with an increased risk of gastrointestinal bleeding (RD, 13 more per AEs per 1000 patients [95% CI, 3 to 23 more AEs per 1000 patients]), but the certainty of evidence was low."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis of randomized trials, there was moderate certainty evidence that corticosteroids were associated with an increased risk of hyperglycemia and sleep problems and low certainty evidence that corticosteroids were associated with increased risk of gastrointestinal bleeding, but these AEs were very seldom serious. These findings suggest that an individualized approach to short-term corticosteroid use may be warranted and that further research is needed to obtain better quality of evidence."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41026484/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamanetworkopen.2025.34953",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Corticosteroids are associated with increased risks of hyperglycemia, sleep problems, and possibly gastrointestinal bleeding, though serious adverse events are rare, suggesting a need for individualized use and further research."
    },
    {
      "id": "d5f368b6240f",
      "title": "Effectiveness and Safety of Postoperative Medical Treatments Following Fertility-Preserving Surgery for Endometriosis: A Network Meta-Analysis.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48555079/117804",
      "abstract": "Endometriosis (EMs) is a common gynaecological condition with high recurrence rates after fertility-preserving laparoscopic surgery, and optimal postoperative medical treatment remains unclear. To evaluate the efficacy and safety of various postoperative medical treatments in reducing recurrence, pain and adverse events in EMs patients after fertility-preserving surgery. PubMed, Web of Science, CENTRAL and Embase databases searched until August 1, 2024. Randomised controlled trials (RCTs) involving women aged 20-45 years post-fertility-preserving laparoscopic surgery, comparing single postoperative medications with a minimum follow-up of 2 months. Two reviewers independently extracted data and assessed quality using ROB 2.0 and CINeMA. Bayesian network meta-analysis calculated odds ratios (OR) and mean differences (MD) for recurrence rates, VAS pain reduction and adverse events. Sixteen RCTs (n = 1605 participants) evaluated 10 drugs: danazol, desogestrel, dienogest, gestrinone, goserelin, leuprolide, LNG-IUS, medroxyprogesterone, oral contraceptives and triptorelin. Only LNG-IUS significantly reduced recurrence rates (OR 0.12, 95% CI 0.02-0.63) and showed the greatest reduction in VAS pain scores (MD -24.96, 95% CI -41.76 to -8.75). Danazol significantly increased weight gain, and goserelin increased hot flashes. LNG-IUS combined with laparoscopic surgery appears most effective in reducing recurrence and pain in EMs patients. Danazol and goserelin should be used cautiously due to notable adverse effects.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Endometriosis (EMs) is a common gynaecological condition with high recurrence rates after fertility-preserving laparoscopic surgery, and optimal postoperative medical treatment remains unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the efficacy and safety of various postoperative medical treatments in reducing recurrence, pain and adverse events in EMs patients after fertility-preserving surgery."
        },
        {
          "label": "SEARCH STRATEGY",
          "text": "PubMed, Web of Science, CENTRAL and Embase databases searched until August 1, 2024."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "Randomised controlled trials (RCTs) involving women aged 20-45 years post-fertility-preserving laparoscopic surgery, comparing single postoperative medications with a minimum follow-up of 2 months."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Two reviewers independently extracted data and assessed quality using ROB 2.0 and CINeMA. Bayesian network meta-analysis calculated odds ratios (OR) and mean differences (MD) for recurrence rates, VAS pain reduction and adverse events."
        },
        {
          "label": "MAIN RESULTS",
          "text": "Sixteen RCTs (n = 1605 participants) evaluated 10 drugs: danazol, desogestrel, dienogest, gestrinone, goserelin, leuprolide, LNG-IUS, medroxyprogesterone, oral contraceptives and triptorelin. Only LNG-IUS significantly reduced recurrence rates (OR 0.12, 95% CI 0.02-0.63) and showed the greatest reduction in VAS pain scores (MD -24.96, 95% CI -41.76 to -8.75). Danazol significantly increased weight gain, and goserelin increased hot flashes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "LNG-IUS combined with laparoscopic surgery appears most effective in reducing recurrence and pain in EMs patients. Danazol and goserelin should be used cautiously due to notable adverse effects."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41017486/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1111/1471-0528.70016",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "For endometriosis patients, a levonorgestrel-releasing intrauterine system (LNG-IUS) combined with laparoscopic surgery is the most effective treatment for reducing recurrence and pain, while danazol and goserelin should be used with caution due to their side effects."
    },
    {
      "id": "a256ee5db3c9",
      "title": "Pre-conception weight loss interventions in women with polycystic ovary syndrome and the effect on perinatal outcomes: A quantitative synthesis of surrogate outcomes.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Gynecology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117836",
      "abstract": "Polycystic ovary syndrome (PCOS) guidelines recommend weight optimisation to improve anthropometric, metabolic and androgenic complications, but data is lacking for pregnancy outcomes. We aimed to assess which weight loss interventions improve pregnancy outcomes for women with PCOS and overweight or obesity. A systematic search of Embase, Medline (Ovid) and the Cochrane Clinical Trials Registry for English language articles from database inception until 22 July 2024 was conducted. We included weight loss intervention randomised controlled trials (RCTs) for women with PCOS and body mass index (BMI) ≥25 kg/m. Primary outcomes were pregnancy rates, live births and miscarriages. Secondary outcomes were anthropometric, androgenic, metabolic and other perinatal complications. Of 9010 articles, 7077 abstracts were screened and 37 RCTs included. One study reported increased pregnancy rates with a 12-month lifestyle intervention versus standard care (23.3%-26.7% vs. 16.7%) (low certainty) but no difference in live birth rate, time to conception or antenatal outcomes. Lifestyle interventions reduced BMI by -0.34 kg/m (-0.65 to -0.02) on quantitative meta-analysis. Limitations include outcome measure heterogeneity, intervention heterogeneity, inconsistent definitions and low use of core outcome sets. Limited data on antenatal outcomes highlight a knowledge gap amongst a group at high perinatal risk.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Polycystic ovary syndrome (PCOS) guidelines recommend weight optimisation to improve anthropometric, metabolic and androgenic complications, but data is lacking for pregnancy outcomes."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We aimed to assess which weight loss interventions improve pregnancy outcomes for women with PCOS and overweight or obesity. A systematic search of Embase, Medline (Ovid) and the Cochrane Clinical Trials Registry for English language articles from database inception until 22 July 2024 was conducted. We included weight loss intervention randomised controlled trials (RCTs) for women with PCOS and body mass index (BMI) ≥25 kg/m. Primary outcomes were pregnancy rates, live births and miscarriages. Secondary outcomes were anthropometric, androgenic, metabolic and other perinatal complications."
        },
        {
          "label": "RESULTS",
          "text": "Of 9010 articles, 7077 abstracts were screened and 37 RCTs included. One study reported increased pregnancy rates with a 12-month lifestyle intervention versus standard care (23.3%-26.7% vs. 16.7%) (low certainty) but no difference in live birth rate, time to conception or antenatal outcomes. Lifestyle interventions reduced BMI by -0.34 kg/m (-0.65 to -0.02) on quantitative meta-analysis. Limitations include outcome measure heterogeneity, intervention heterogeneity, inconsistent definitions and low use of core outcome sets."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Limited data on antenatal outcomes highlight a knowledge gap amongst a group at high perinatal risk."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41035114/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1111/dom.70116",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "There is a lack of information regarding pregnancy outcomes for a group with a high risk of complications during the perinatal period."
    },
    {
      "id": "c0af5bb8576d",
      "title": "Ampicillin and gentamicin prophylaxis is superior to ampicillin alone in patients with prelabor rupture of membranes at term: the results of a randomized clinical trial.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117781",
      "abstract": "Prelabor rupture of membranes is a risk factor for maternal and neonatal infectious morbidity. Ampicillin is indicated for patients with unknown group B Streptococcus status and prelabor rupture of membranes ≥18 hours. Although ampicillin-resistant Enterobacteriaceae contribute to maternal and neonatal infectious morbidity, current guidelines on intrapartum antibiotic prophylaxis primarily target group B Streptococcus and do not adequately cover Enterobacteriaceae. To compare maternal and neonatal infectious morbidity between 2 antibiotic regimens: ampicillin and gentamicin vs ampicillin alone. This randomized controlled trial was conducted between November 2022 and March 2024 in a tertiary university-affiliated hospital. Inclusion criteria were a term singleton pregnancy ≥37 0/7, vertex presentation, unknown group B Streptococcus status, and prelabor rupture of membranes without active labor. Exclusion criteria included penicillin/gentamicin allergy, contraindications for vaginal delivery, and current antibiotic treatment. The participants were randomized at 12 to 18 hours post prelabor rupture of membranes to receive ampicillin and gentamicin (n=102) or ampicillin alone (n=102). They were blinded from the allocation until antibiotics initiation at 18 hours post prelabor rupture of membranes. The antibiotics were administered until delivery. The primary outcome was clinical chorioamnionitis. Secondary maternal outcomes were puerperal endometritis, peripartum infections, intrapartum fever, and a composite of postpartum maternal morbidity, defined as the presence of puerperal endometritis, postpartum antibiotic treatment exceeding 24 hours, wound infection, or infection-related hospitalization >5 days. A neonatal composite adverse outcome included culture-proven neonatal sepsis, admission to the neonatal intensive care unit, empiric antibiotic treatment in the neonatal intensive care unit, performance of a sepsis workup, and infection-related hospitalization >5 days. Microbiologic findings were assessed from chorioamniotic swab cultures. An intention-to-treat analysis was performed. The number needed to treat was calculated for the primary outcome. Multivariate logistic regression was conducted to predict clinical chorioamnionitis, after controlling for antibiotic regimen, prelabor rupture of membranes duration, delivery number, body mass index, delivery week, maternal age, meconium staining, and diabetes mellitus. Ampicillin and gentamicin treatment was associated with lower rates of clinical chorioamnionitis (1/102 [1.0%] vs 8/102 [7.8%], P=.035), intrapartum fever (8/102 [8.0%] vs 18/102 [18.0%], P=.036), and overall peripartum infections (1/102 [1.0%] vs 10/102 [9.8%], P=.005). The number needed to treat to prevent 1 case of clinical chorioamnionitis was 14.7 (95% confidence interval, 10.2-27.0). The rate of the composite postpartum maternal complications was also lower in the ampicillin and gentamicin group (0/102 [0%] vs 6/102 [5.9%], P=.029). Ampicillin and gentamicin treatment was associated with lower rates of the composite neonatal adverse outcome (11/102 [10.8%] vs 22/102 [21.6%], P=.036) and sepsis workups (8/102 [7.8%] vs 18/102 [17.6%], P=.036) and a shorter median neonatal intensive care unit stay (3.0 vs 3.5 days, P=.047). The frequency of positive Enterobacteriaceae cultures in chorioamniotic swab samples was lower following ampicillin and gentamicin (17/85 [20%] vs ampicillin alone 45/89 [51%], P<.001). In term prelabor rupture of membranes, ampicillin and gentamicin prophylaxis, compared to ampicillin alone, resulted in lower rates of clinical chorioamnionitis, maternal postpartum complications, and neonatal adverse outcomes. It is time to reconsider the antimicrobial prophylactic regimen in term prelabor rupture of membranes.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Prelabor rupture of membranes is a risk factor for maternal and neonatal infectious morbidity. Ampicillin is indicated for patients with unknown group B Streptococcus status and prelabor rupture of membranes ≥18 hours. Although ampicillin-resistant Enterobacteriaceae contribute to maternal and neonatal infectious morbidity, current guidelines on intrapartum antibiotic prophylaxis primarily target group B Streptococcus and do not adequately cover Enterobacteriaceae."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare maternal and neonatal infectious morbidity between 2 antibiotic regimens: ampicillin and gentamicin vs ampicillin alone."
        },
        {
          "label": "STUDY DESIGN",
          "text": "This randomized controlled trial was conducted between November 2022 and March 2024 in a tertiary university-affiliated hospital. Inclusion criteria were a term singleton pregnancy ≥37 0/7, vertex presentation, unknown group B Streptococcus status, and prelabor rupture of membranes without active labor. Exclusion criteria included penicillin/gentamicin allergy, contraindications for vaginal delivery, and current antibiotic treatment. The participants were randomized at 12 to 18 hours post prelabor rupture of membranes to receive ampicillin and gentamicin (n=102) or ampicillin alone (n=102). They were blinded from the allocation until antibiotics initiation at 18 hours post prelabor rupture of membranes. The antibiotics were administered until delivery. The primary outcome was clinical chorioamnionitis. Secondary maternal outcomes were puerperal endometritis, peripartum infections, intrapartum fever, and a composite of postpartum maternal morbidity, defined as the presence of puerperal endometritis, postpartum antibiotic treatment exceeding 24 hours, wound infection, or infection-related hospitalization >5 days. A neonatal composite adverse outcome included culture-proven neonatal sepsis, admission to the neonatal intensive care unit, empiric antibiotic treatment in the neonatal intensive care unit, performance of a sepsis workup, and infection-related hospitalization >5 days. Microbiologic findings were assessed from chorioamniotic swab cultures. An intention-to-treat analysis was performed. The number needed to treat was calculated for the primary outcome. Multivariate logistic regression was conducted to predict clinical chorioamnionitis, after controlling for antibiotic regimen, prelabor rupture of membranes duration, delivery number, body mass index, delivery week, maternal age, meconium staining, and diabetes mellitus."
        },
        {
          "label": "RESULTS",
          "text": "Ampicillin and gentamicin treatment was associated with lower rates of clinical chorioamnionitis (1/102 [1.0%] vs 8/102 [7.8%], P=.035), intrapartum fever (8/102 [8.0%] vs 18/102 [18.0%], P=.036), and overall peripartum infections (1/102 [1.0%] vs 10/102 [9.8%], P=.005). The number needed to treat to prevent 1 case of clinical chorioamnionitis was 14.7 (95% confidence interval, 10.2-27.0). The rate of the composite postpartum maternal complications was also lower in the ampicillin and gentamicin group (0/102 [0%] vs 6/102 [5.9%], P=.029). Ampicillin and gentamicin treatment was associated with lower rates of the composite neonatal adverse outcome (11/102 [10.8%] vs 22/102 [21.6%], P=.036) and sepsis workups (8/102 [7.8%] vs 18/102 [17.6%], P=.036) and a shorter median neonatal intensive care unit stay (3.0 vs 3.5 days, P=.047). The frequency of positive Enterobacteriaceae cultures in chorioamniotic swab samples was lower following ampicillin and gentamicin (17/85 [20%] vs ampicillin alone 45/89 [51%], P<.001)."
        },
        {
          "label": "CONCLUSION",
          "text": "In term prelabor rupture of membranes, ampicillin and gentamicin prophylaxis, compared to ampicillin alone, resulted in lower rates of clinical chorioamnionitis, maternal postpartum complications, and neonatal adverse outcomes. It is time to reconsider the antimicrobial prophylactic regimen in term prelabor rupture of membranes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40086563/",
      "pubDate": "2025 Oct",
      "doi": "10.1016/j.ajog.2025.03.011",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Ampicillin and gentamicin prophylaxis is superior to ampicillin alone in managing term prelabor rupture of membranes, leading to fewer complications for both mother and baby."
    },
    {
      "id": "6e134864581e",
      "title": "A Multicenter Randomized Controlled Trial of Antimicrobial Prophylaxis to Prevent Urinary Tract Infections after Shockwave Lithotripsy for Urolithiasis: The APPEAL Trial.",
      "journal": "Eur Urol",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117774",
      "abstract": "Shockwave lithotripsy (SWL) carries a risk of postprocedural infection. Use of antibiotic prophylaxis by clinicians is variable and international guidelines provide conflicting recommendations, reflecting low-certainty evidence. We investigated whether antibiotic prophylaxis reduces bacteriuria and post-SWL urinary tract infections (UTIs). APPEAL, an international multicenter, blinded trial, randomized adults undergoing SWL for urolithiasis to a single dose of ciprofloxacin or placebo. The primary outcome was the incidence of a composite of bacteriuria or symptomatic UTI after SWL. Other outcomes included the incidence of pyelonephritis or urosepsis. Of the 1722 randomized patients, 28 underwent postrandomization exclusions (mainly nonvisualizable stones). Among the analysis population (n = 1694; median age 50 yr; 30% female), 74% had kidney stones and 26% had ureteral stones. Bacteriuria (without symptoms) or symptomatic UTI occurred in 20 patients (2.7%) in the ciprofloxacin arm and 30 (3.9%) in the placebo arm (risk ratio [RR] 0.68, 95% confidence interval [CI] 0.41-1.15). Symptomatic UTI occurred in ten patients (1.3%) in the ciprofloxacin arm and 21 (2.7%) in the placebo arm (RR 0.49, 95% CI 0.19-1.23). No patients in the ciprofloxacin arm and nine (1.2%) in the placebo arm developed pyelonephritis (RR 0.05, 95% CI 0.003-0.93). No patients developed urosepsis and no serious adverse events occurred. A single dose of ciprofloxacin reduced the risk of post-SWL pyelonephritis, with a modest absolute benefit. The patient importance of this reduction depends on individual preferences in weighing a small absolute reduction in risk against the potential harms and resistance-related implications of antibiotic use. Results from the APPEAL trial will inform global practice and support evidence-based decision-making for patients undergoing SWL.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND OBJECTIVE",
          "text": "Shockwave lithotripsy (SWL) carries a risk of postprocedural infection. Use of antibiotic prophylaxis by clinicians is variable and international guidelines provide conflicting recommendations, reflecting low-certainty evidence. We investigated whether antibiotic prophylaxis reduces bacteriuria and post-SWL urinary tract infections (UTIs)."
        },
        {
          "label": "METHODS",
          "text": "APPEAL, an international multicenter, blinded trial, randomized adults undergoing SWL for urolithiasis to a single dose of ciprofloxacin or placebo. The primary outcome was the incidence of a composite of bacteriuria or symptomatic UTI after SWL. Other outcomes included the incidence of pyelonephritis or urosepsis."
        },
        {
          "label": "KEY FINDINGS AND LIMITATIONS",
          "text": "Of the 1722 randomized patients, 28 underwent postrandomization exclusions (mainly nonvisualizable stones). Among the analysis population (n = 1694; median age 50 yr; 30% female), 74% had kidney stones and 26% had ureteral stones. Bacteriuria (without symptoms) or symptomatic UTI occurred in 20 patients (2.7%) in the ciprofloxacin arm and 30 (3.9%) in the placebo arm (risk ratio [RR] 0.68, 95% confidence interval [CI] 0.41-1.15). Symptomatic UTI occurred in ten patients (1.3%) in the ciprofloxacin arm and 21 (2.7%) in the placebo arm (RR 0.49, 95% CI 0.19-1.23). No patients in the ciprofloxacin arm and nine (1.2%) in the placebo arm developed pyelonephritis (RR 0.05, 95% CI 0.003-0.93). No patients developed urosepsis and no serious adverse events occurred."
        },
        {
          "label": "CONCLUSIONS AND CLINICAL IMPLICATIONS",
          "text": "A single dose of ciprofloxacin reduced the risk of post-SWL pyelonephritis, with a modest absolute benefit. The patient importance of this reduction depends on individual preferences in weighing a small absolute reduction in risk against the potential harms and resistance-related implications of antibiotic use. Results from the APPEAL trial will inform global practice and support evidence-based decision-making for patients undergoing SWL."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40998628/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1016/j.eururo.2025.08.019",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Ciprofloxacin effectively lowers the chance of kidney infection after shock wave lithotripsy, but the value of this benefit is a personal decision considering the risks of antibiotics."
    },
    {
      "id": "9e8efb679df3",
      "title": "Once-daily oral icotrokinra versus placebo and once-daily oral deucravacitinib in participants with moderate-to-severe plaque psoriasis (ICONIC-ADVANCE 1 & 2): two phase 3, randomised, placebo-controlled and active-comparator-controlled trials.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117681",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false
    },
    {
      "id": "9fa2e2b7ab63",
      "title": "Effect of repurposed simvastatin on disability progression in secondary progressive multiple sclerosis (MS-STAT2): a phase 3, randomised, double-blind, placebo-controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48459634/117813",
      "abstract": "Despite the success of immune modulation in the treatment of relapsing multiple sclerosis, disability progression is a major problem driven by multiple mechanisms. Comorbidities (eg, vascular risk) and ageing are thought to augment these neurodegenerative pathologies. In the phase 2b MS-STAT trial of simvastatin (80 mg) versus placebo in secondary progressive multiple sclerosis (SPMS), the adjusted difference in brain atrophy rate between groups was -0·254% per year: a 43% reduction. In this phase 3 MS-STAT2 trial, we aimed to assess the efficacy of simvastatin versus placebo in slowing the progression of disability in SPMS. This phase 3, randomised, double-blind, parallel group, placebo-controlled clinical trial was conducted at 31 neuroscience centres and district general hospitals in the UK. Participants aged 18-65 years with a diagnosis of SPMS and an Expanded Disability Status Scale (EDSS) of between 4·0 and 6·5 were eligible and randomly assigned (1:1) to oral simvastatin (80 mg) or matched placebo for up to 4·5 years, based on a minimisation algorithm within an independent and secure online randomisation service. All participants, site investigators, and the trial coordinating team were masked to treatment allocation. The primary outcome was time to 6-month EDSS confirmed disability progression (an increase of at least 1 point if EDSS score at baseline visit was less than 6·0 or an increase of 0·5 point if EDSS score at baseline visit was 6·0 or more) assessed in all randomly assigned participants (intention-to-treat analysis) without imputation. This study is registered with ClinicalTrials.gov (NCT03387670) and is on the ISRCTN registry (ISRCTN82598726). The study is completed. Between May 10, 2018, and July 26, 2024, 1079 patients were screened for eligibility and 964 participants were randomly assigned, with 482 (50%) in the placebo group and 482 (50%) in the simvastatin group. Of all 964 participants, 704 (73%) were female and 260 (27%) were male, with a mean age of 54 years (SD 7). 173 (36%) of 482 participants in the placebo group and 192 (40%) of 482 participants in the simvastatin group had 6-month confirmed disability progression (adjusted hazard ratio 1·13 [95% CI 0·91 to 1·39], p=0·26). Although no emergent safety issues were seen, there was one serious adverse reaction (rhabdomyolysis) in the simvastatin group. 12 (2%) of 482 participants in the placebo group and five (1%) of 482 participants in the simvastatin group had a cardiovascular serious adverse event. The MS-STAT2 trial did not show a treatment effect of simvastatin in slowing disability progression in SPMS. Simvastatin use in multiple sclerosis should be confined to existing vascular indications. National Institute for Health and Care Research Health Technology Assessment Programme, UK Multiple Sclerosis Society, and the US National Multiple Sclerosis Society.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Despite the success of immune modulation in the treatment of relapsing multiple sclerosis, disability progression is a major problem driven by multiple mechanisms. Comorbidities (eg, vascular risk) and ageing are thought to augment these neurodegenerative pathologies. In the phase 2b MS-STAT trial of simvastatin (80 mg) versus placebo in secondary progressive multiple sclerosis (SPMS), the adjusted difference in brain atrophy rate between groups was -0·254% per year: a 43% reduction. In this phase 3 MS-STAT2 trial, we aimed to assess the efficacy of simvastatin versus placebo in slowing the progression of disability in SPMS."
        },
        {
          "label": "METHODS",
          "text": "This phase 3, randomised, double-blind, parallel group, placebo-controlled clinical trial was conducted at 31 neuroscience centres and district general hospitals in the UK. Participants aged 18-65 years with a diagnosis of SPMS and an Expanded Disability Status Scale (EDSS) of between 4·0 and 6·5 were eligible and randomly assigned (1:1) to oral simvastatin (80 mg) or matched placebo for up to 4·5 years, based on a minimisation algorithm within an independent and secure online randomisation service. All participants, site investigators, and the trial coordinating team were masked to treatment allocation. The primary outcome was time to 6-month EDSS confirmed disability progression (an increase of at least 1 point if EDSS score at baseline visit was less than 6·0 or an increase of 0·5 point if EDSS score at baseline visit was 6·0 or more) assessed in all randomly assigned participants (intention-to-treat analysis) without imputation. This study is registered with ClinicalTrials.gov (NCT03387670) and is on the ISRCTN registry (ISRCTN82598726). The study is completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between May 10, 2018, and July 26, 2024, 1079 patients were screened for eligibility and 964 participants were randomly assigned, with 482 (50%) in the placebo group and 482 (50%) in the simvastatin group. Of all 964 participants, 704 (73%) were female and 260 (27%) were male, with a mean age of 54 years (SD 7). 173 (36%) of 482 participants in the placebo group and 192 (40%) of 482 participants in the simvastatin group had 6-month confirmed disability progression (adjusted hazard ratio 1·13 [95% CI 0·91 to 1·39], p=0·26). Although no emergent safety issues were seen, there was one serious adverse reaction (rhabdomyolysis) in the simvastatin group. 12 (2%) of 482 participants in the placebo group and five (1%) of 482 participants in the simvastatin group had a cardiovascular serious adverse event."
        },
        {
          "label": "INTERPRETATION",
          "text": "The MS-STAT2 trial did not show a treatment effect of simvastatin in slowing disability progression in SPMS. Simvastatin use in multiple sclerosis should be confined to existing vascular indications."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health and Care Research Health Technology Assessment Programme, UK Multiple Sclerosis Society, and the US National Multiple Sclerosis Society."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41045938/",
      "pubDate": "2025 Oct 11",
      "doi": "10.1016/S0140-6736(25)01039-6",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Simvastatin did not significantly slow disability progression in secondary progressive multiple sclerosis compared to placebo."
    },
    {
      "id": "947093ec8651",
      "title": "Inclisiran-based treatment strategy in hypercholesterolaemia: the VICTORION-Difference trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117817",
      "abstract": "Low-density lipoprotein cholesterol (LDL-C) is a causal risk factor for atherosclerotic cardiovascular (CV) disease development and progression. The European Society of Cardiology guidelines recommend combination treatment to achieve CV risk-based LDL-C treatment goals. Inclisiran, a small interfering ribonucleic acid (siRNA) that targets hepatic proprotein convertase subtilisin/kexin type 9 (PCSK9) messenger RNA, can provide sustained and effective LDL-C reduction. VICTORION-Difference, a phase 4 double-blind, placebo-controlled randomised clinical trial included adults with hypercholesterolaemia at high- or very high CV risk. Participants were randomised 1:1 to receive inclisiran sodium (300 mg subcutaneous injections; equivalent to 284 mg inclisiran) or placebo together with individually optimised lipid-lowering therapy (ioLLT), including up-titration with rosuvastatin (open-label) until either their individual LDL-C goal or maximally tolerated statin dose (open-label rosuvastatin) was achieved. The primary objective was assessment of LDL-C goal achievement at Day 90. Key secondary objectives were muscle-related adverse events (MRAEs) and mean LDL-C reduction. Overall, 1770 individuals (mean age, 63.7 years) were randomised to receive inclisiran (n=898) or ioLLT (n=872). At Day 90, a significantly higher proportion of participants receiving inclisiran vs. ioLLT achieved their individual LDL-C goals (84.9% vs. 31.0%; odds ratio [OR] 12.09, p<0.001). The mean percentage reduction in LDL-C from baseline to Day 360 was -59.5% and -24.3% in the inclisiran and ioLLT arms, respectively (least squares mean treatment difference [LSMTD]=-35.14%, p<0.001). Fewer participants receiving inclisiran vs. ioLLT reported a MRAE (11.9% vs. 19.2%; OR 0.57, p<0.001). The mean reduction in Short Form-Brief Pain Inventory pain severity and interference scores favoured inclisiran over ioLLT (LSMTD=-0.11, p=0.039; LSMTD=-0.11, p=0.029, respectively). No new safety concerns were identified. An inclisiran-based treatment strategy was superior to ioLLT in LDL-C goal achievement, delivering early and sustained LDL-C reduction, with fewer MRAEs in individuals with hypercholesterolaemia. cholesterol, muscle-related adverse events, quality of life, statins.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Low-density lipoprotein cholesterol (LDL-C) is a causal risk factor for atherosclerotic cardiovascular (CV) disease development and progression. The European Society of Cardiology guidelines recommend combination treatment to achieve CV risk-based LDL-C treatment goals. Inclisiran, a small interfering ribonucleic acid (siRNA) that targets hepatic proprotein convertase subtilisin/kexin type 9 (PCSK9) messenger RNA, can provide sustained and effective LDL-C reduction."
        },
        {
          "label": "METHODS",
          "text": "VICTORION-Difference, a phase 4 double-blind, placebo-controlled randomised clinical trial included adults with hypercholesterolaemia at high- or very high CV risk. Participants were randomised 1:1 to receive inclisiran sodium (300 mg subcutaneous injections; equivalent to 284 mg inclisiran) or placebo together with individually optimised lipid-lowering therapy (ioLLT), including up-titration with rosuvastatin (open-label) until either their individual LDL-C goal or maximally tolerated statin dose (open-label rosuvastatin) was achieved. The primary objective was assessment of LDL-C goal achievement at Day 90. Key secondary objectives were muscle-related adverse events (MRAEs) and mean LDL-C reduction."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 1770 individuals (mean age, 63.7 years) were randomised to receive inclisiran (n=898) or ioLLT (n=872). At Day 90, a significantly higher proportion of participants receiving inclisiran vs. ioLLT achieved their individual LDL-C goals (84.9% vs. 31.0%; odds ratio [OR] 12.09, p<0.001). The mean percentage reduction in LDL-C from baseline to Day 360 was -59.5% and -24.3% in the inclisiran and ioLLT arms, respectively (least squares mean treatment difference [LSMTD]=-35.14%, p<0.001). Fewer participants receiving inclisiran vs. ioLLT reported a MRAE (11.9% vs. 19.2%; OR 0.57, p<0.001). The mean reduction in Short Form-Brief Pain Inventory pain severity and interference scores favoured inclisiran over ioLLT (LSMTD=-0.11, p=0.039; LSMTD=-0.11, p=0.029, respectively). No new safety concerns were identified."
        },
        {
          "label": "CONCLUSIONS",
          "text": "An inclisiran-based treatment strategy was superior to ioLLT in LDL-C goal achievement, delivering early and sustained LDL-C reduction, with fewer MRAEs in individuals with hypercholesterolaemia. cholesterol, muscle-related adverse events, quality of life, statins."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884558/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1093/eurheartj/ehaf685",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Inclisiran treatment achieved better LDL-C control and fewer major adverse events compared to ioLLT in hypercholesterolemic patients."
    },
    {
      "id": "30f2dcbcffb3",
      "title": "Improving outcomes of atrial fibrillation ablation by integrated personalized lifestyle interventions: a randomized controlled trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117816",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false
    },
    {
      "id": "b66de1836a58",
      "title": "Suicide Interventions for Youths: A Systematic Review.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117807",
      "abstract": "Suicide is a leading cause of death among young people and an escalating public health crisis. To assess the effectiveness and harms of available treatments for suicidal thoughts and behaviors among youths at heightened risk for suicide. A systematic review was conducted searching databases including MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Cochrane Database of Systematic Reviews, Scopus, and various gray literature sources from January 1, 2000, to September 26, 2024. We included randomized clinical trials, comparative observational studies, and before-after studies of psychosocial interventions, pharmacologic interventions, neurotherapeutics, emerging therapies, and combination therapies. Eligible patients were youths (aged 5-24 years) with heightened risk for suicide, adolescents from racial and ethnic minority groups known to be at increased risk of suicide, or those exposed to crime or violence. Pairs of independent reviewers selected and appraised studies. This review included 65 studies (33 randomized clinical trials, 13 comparative observational studies, and 19 before-after studies) reporting on 14 534 patients (median age, 15.1 years; 75.1% female patients). Psychosocial interventions comprised psychotherapy interventions (33 studies; cognitive behavioral therapy, dialectical behavioral therapy, collaborative assessment and management of suicidality, dynamic deconstructive psychotherapy, attachment-based family therapy, and family-focused therapy), acute (ie, 1-4 sessions or contacts) psychosocial interventions (19 studies; safety planning, family-based crisis management, motivational interviewing crisis interventions, continuity of care after crisis, and brief adjunctive treatments), and school- or community-based psychosocial interventions (13 studies; social network interventions, school-based skills interventions, suicide awareness or gatekeeper programs, and community-based, culturally tailored adjunct programs). Dialectical behavior therapy showed moderate strength of evidence for reducing suicidal ideation. Other categories of psychosocial treatments showed insufficient to low strength of evidence for reducing suicidal outcomes. None of the studies evaluated adverse events. The evidence base on pharmacologic treatment for youths at risk of suicide was largely nonexistent. This systematic review found that the current evidence on available interventions targeting youths at heightened risk of suicide is uncertain. Medication, neurotherapeutics, and emerging therapies remain unstudied among this population. The limited evidence base calls for the development of novel, developmentally and trauma-informed treatments, as well as multilevel interventions to target the increasing suicide risk among youths.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Suicide is a leading cause of death among young people and an escalating public health crisis."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the effectiveness and harms of available treatments for suicidal thoughts and behaviors among youths at heightened risk for suicide."
        },
        {
          "label": "EVIDENCE REVIEW",
          "text": "A systematic review was conducted searching databases including MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Cochrane Database of Systematic Reviews, Scopus, and various gray literature sources from January 1, 2000, to September 26, 2024. We included randomized clinical trials, comparative observational studies, and before-after studies of psychosocial interventions, pharmacologic interventions, neurotherapeutics, emerging therapies, and combination therapies. Eligible patients were youths (aged 5-24 years) with heightened risk for suicide, adolescents from racial and ethnic minority groups known to be at increased risk of suicide, or those exposed to crime or violence. Pairs of independent reviewers selected and appraised studies."
        },
        {
          "label": "FINDINGS",
          "text": "This review included 65 studies (33 randomized clinical trials, 13 comparative observational studies, and 19 before-after studies) reporting on 14 534 patients (median age, 15.1 years; 75.1% female patients). Psychosocial interventions comprised psychotherapy interventions (33 studies; cognitive behavioral therapy, dialectical behavioral therapy, collaborative assessment and management of suicidality, dynamic deconstructive psychotherapy, attachment-based family therapy, and family-focused therapy), acute (ie, 1-4 sessions or contacts) psychosocial interventions (19 studies; safety planning, family-based crisis management, motivational interviewing crisis interventions, continuity of care after crisis, and brief adjunctive treatments), and school- or community-based psychosocial interventions (13 studies; social network interventions, school-based skills interventions, suicide awareness or gatekeeper programs, and community-based, culturally tailored adjunct programs). Dialectical behavior therapy showed moderate strength of evidence for reducing suicidal ideation. Other categories of psychosocial treatments showed insufficient to low strength of evidence for reducing suicidal outcomes. None of the studies evaluated adverse events. The evidence base on pharmacologic treatment for youths at risk of suicide was largely nonexistent."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review found that the current evidence on available interventions targeting youths at heightened risk of suicide is uncertain. Medication, neurotherapeutics, and emerging therapies remain unstudied among this population. The limited evidence base calls for the development of novel, developmentally and trauma-informed treatments, as well as multilevel interventions to target the increasing suicide risk among youths."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41021221/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1001/jamapediatrics.2025.3485",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "The effectiveness of current interventions for youth at heightened suicide risk is uncertain, highlighting the need for novel, trauma-informed, and multilevel treatments."
    },
    {
      "id": "a6e71ba621f6",
      "title": "Budesonide-formoterol versus salbutamol as reliever therapy in children with mild asthma (CARE): a 52-week, open-label, multicentre, superiority, randomised controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117796",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false
    },
    {
      "id": "3e12a9eef337",
      "title": "Clinical and Prognostic Utility of the Essential Frailty Toolset in Older Patients With Heart Failure.",
      "journal": "J Am Geriatr Soc",
      "score": "4/7",
      "tags": [
        "Cardiology",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117753",
      "abstract": "Heart failure (HF) is associated with frailty, and most frailty assessment methods are subjective and complex. The Essential Frailty Toolset (EFT) is a simple, objective, and comprehensive frailty assessment tool. This study aimed to investigate the clinical and prognostic values of the EFT in patients with HF. Data from a multicenter, observational study on older (≥ 65 years old) patients hospitalized with HF, the FRAGILE-HF cohort, was used. The EFT includes a five-time chair stand test, cognitive function assessment, and hemoglobin and albumin measurements. Patients were divided into three groups based on their EFT points: robust (0 points), pre-frail (1-2 points), and frail (3-5 points). The primary endpoint was 2-year all-cause mortality. Of the total 1237 patients (80.1 ± 7.1 years; 43% females), the robust, pre-frail, and frail groups included 114 (11.6%), 606 (49.0%), and 487 (39.4%) patients, respectively. The prevalence of frailty, evaluated using the Fried phenotype model, increased with increased EFT points (p < 0.001). Within the 2-year follow-up period, 256 deaths occurred. The frail group was significantly associated with a higher risk of the primary endpoint than the robust group (adjusted hazard ratio [aHR], 2.01; 95% confidence interval [CI], 1.12-3.61; p = 0.019). The EFT point, as a continuous variable, was significantly associated with the primary endpoint (aHR, 1.19; 95% CI, 1.08-1.31; p < 0.001). A significant continuous net reclassification improvement was observed when the EFT groups were added to the conventional risk model. The EFT demonstrated valuable clinical and prognostic value in older patients with HF.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Heart failure (HF) is associated with frailty, and most frailty assessment methods are subjective and complex. The Essential Frailty Toolset (EFT) is a simple, objective, and comprehensive frailty assessment tool. This study aimed to investigate the clinical and prognostic values of the EFT in patients with HF."
        },
        {
          "label": "METHODS",
          "text": "Data from a multicenter, observational study on older (≥ 65 years old) patients hospitalized with HF, the FRAGILE-HF cohort, was used. The EFT includes a five-time chair stand test, cognitive function assessment, and hemoglobin and albumin measurements. Patients were divided into three groups based on their EFT points: robust (0 points), pre-frail (1-2 points), and frail (3-5 points). The primary endpoint was 2-year all-cause mortality."
        },
        {
          "label": "RESULTS",
          "text": "Of the total 1237 patients (80.1 ± 7.1 years; 43% females), the robust, pre-frail, and frail groups included 114 (11.6%), 606 (49.0%), and 487 (39.4%) patients, respectively. The prevalence of frailty, evaluated using the Fried phenotype model, increased with increased EFT points (p < 0.001). Within the 2-year follow-up period, 256 deaths occurred. The frail group was significantly associated with a higher risk of the primary endpoint than the robust group (adjusted hazard ratio [aHR], 2.01; 95% confidence interval [CI], 1.12-3.61; p = 0.019). The EFT point, as a continuous variable, was significantly associated with the primary endpoint (aHR, 1.19; 95% CI, 1.08-1.31; p < 0.001). A significant continuous net reclassification improvement was observed when the EFT groups were added to the conventional risk model."
        },
        {
          "label": "CONCLUSION",
          "text": "The EFT demonstrated valuable clinical and prognostic value in older patients with HF."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40981616/",
      "pubDate": "2025 Sep 22",
      "doi": "10.1111/jgs.70103",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Echocardiography with functional testing (EFT) is clinically useful for older patients with heart failure and can help predict their outcomes."
    },
    {
      "id": "6d15e1082690",
      "title": "Prevention of Adverse Cardiovascular Events Using the 23-Valent Pneumococcal Polysaccharide Vaccine: A Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117700",
      "abstract": "Animal studies and meta-analysis of human observational data suggest that pneumococcal polysaccharide vaccination (PPV) could be protective against atherosclerosis; however, to the authors' knowledge, no randomized clinical trial has been conducted. To determine whether pneumococcal vaccination (Pneumovax [Merck Sharp & Dohme Corp]) decreases the composite primary outcome of fatal and nonfatal acute coronary syndrome and ischemic stroke in people at increased risk, with an average follow-up of 7 years after immunization. This was a double-blind, placebo-controlled, parallel-arm randomized clinical trial conducted at 6 centers across Australia. Participants were community-dwelling adults 55 to 60 years of age at baseline in 2016 to 2017, with at least 2 risk factors (obesity, hypertension, or hypercholesterolemia) for cardiovascular disease (CVD) but no prior CVD event or indication for early pneumococcal vaccination. Data were analyzed from February 2023 to December 2024 using competing risk proportional hazards regression models, stratified by sex and center. Participants received either 23-valent PPV (PPV23) or placebo (saline). The primary outcome was a composite of fatal and nonfatal myocardial infarction or ischemic stroke, ascertained via electronic medical records from emergency department, admitted patient, and mortality data collections using International Statistical Classification of Diseases, Tenth Revision, Australian Modification (ICD-10-AM) codes. A total of 4725 participants (mean [SD] age, 58.0 [1.7] years; 2433 male [52%]) were included in this study. There was no significant difference in the primary outcome (58 of 2366 events in the active PPV23 group compared with 64 of 2357 events in the control group, hazard ratio, 0.90; 95% CI, 0.63-1.28; P = .57). Similarly, no significant differences occurred in the exploratory outcomes of all-cause mortality, all-cause hospital presentations, and CVD-related hospital procedures. These results are tempered by the lower than expected event rate leading to low power. Results of this randomized clinical trial found that PPV23 did not reduce the rates of fatal and nonfatal acute coronary syndrome and ischemic stroke, although the study was underpowered. ANZCTR Identifier: ACTRN12615000536561.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Animal studies and meta-analysis of human observational data suggest that pneumococcal polysaccharide vaccination (PPV) could be protective against atherosclerosis; however, to the authors' knowledge, no randomized clinical trial has been conducted."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether pneumococcal vaccination (Pneumovax [Merck Sharp & Dohme Corp]) decreases the composite primary outcome of fatal and nonfatal acute coronary syndrome and ischemic stroke in people at increased risk, with an average follow-up of 7 years after immunization."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a double-blind, placebo-controlled, parallel-arm randomized clinical trial conducted at 6 centers across Australia. Participants were community-dwelling adults 55 to 60 years of age at baseline in 2016 to 2017, with at least 2 risk factors (obesity, hypertension, or hypercholesterolemia) for cardiovascular disease (CVD) but no prior CVD event or indication for early pneumococcal vaccination. Data were analyzed from February 2023 to December 2024 using competing risk proportional hazards regression models, stratified by sex and center."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants received either 23-valent PPV (PPV23) or placebo (saline)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite of fatal and nonfatal myocardial infarction or ischemic stroke, ascertained via electronic medical records from emergency department, admitted patient, and mortality data collections using International Statistical Classification of Diseases, Tenth Revision, Australian Modification (ICD-10-AM) codes."
        },
        {
          "label": "RESULTS",
          "text": "A total of 4725 participants (mean [SD] age, 58.0 [1.7] years; 2433 male [52%]) were included in this study. There was no significant difference in the primary outcome (58 of 2366 events in the active PPV23 group compared with 64 of 2357 events in the control group, hazard ratio, 0.90; 95% CI, 0.63-1.28; P = .57). Similarly, no significant differences occurred in the exploratory outcomes of all-cause mortality, all-cause hospital presentations, and CVD-related hospital procedures. These results are tempered by the lower than expected event rate leading to low power."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Results of this randomized clinical trial found that PPV23 did not reduce the rates of fatal and nonfatal acute coronary syndrome and ischemic stroke, although the study was underpowered."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ANZCTR Identifier: ACTRN12615000536561."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40960793/",
      "pubDate": "2025 Sep 17",
      "doi": "10.1001/jamacardio.2025.3043",
      "dateReceived": "2025-10-17T23:22:22.816Z",
      "isNew": false,
      "summary": "Pneumococcal polysaccharide vaccine (PPV23) did not decrease the incidence of fatal and nonfatal acute coronary syndrome or ischemic stroke."
    },
    {
      "id": "d4754eb7f29d",
      "title": "SGLT2 Inhibitors in Older Adults With Cardiovascular Disease: A Systematic Review and Meta-Analysis.",
      "journal": "J Am Geriatr Soc",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48555079/117854",
      "abstract": "Sodium-glucose cotransporter-2 (SGLT2) inhibitors, developed for type 2 diabetes mellitus (T2DM), have demonstrated cardiorenal benefits in conditions including cardiovascular (CV) disease. However, few meta-analyses have synthesized outcomes in older adults with CV disease. A systematic review and meta-analysis of randomized controlled trials published from January 2015 to January 2025 was conducted using MEDLINE (PubMed), Embase (Ovid), and CENTRAL. We included studies that reported the risk of CV outcomes for subgroups of older adults (≥ 65 years) with CV disease. The primary outcome was a composite of hospitalization for heart failure (HHF), urgent heart failure (HF) visits, and cardiovascular death (CVD). Secondary outcomes included all-cause mortality, CVD, and HHF individually. Subgroup analyses were conducted in patients with HF, T2DM, age strata (65-74 vs. ≥ 75), SGLT2 inhibitor agent, and adverse events. Analyzing nine studies, SGLT2 inhibitors were associated with reducing the risk of composite outcome (HR: 0.75, 95% CI: 0.67-0.83, I = 51%), all-cause mortality (HR: 0.80, 95% CI: 0.66-0.97, I = 68%), CVD (HR: 0.78, 95% CI: 0.65-0.94, I = 61%), and HHF (HR: 0.73, 95% CI: 0.65-0.83, I = 0%). Benefits were consistent in subgroups of HF only, T2DM only, and those aged ≥ 75 years. No significant differences were observed by SGLT2 inhibitor type (p = 0.090). SGLT2 inhibitors increased the risk of genital infections (RR: 3.18, 95% CI: 2.35-4.30, I = 0%) but decreased that of other serious adverse events (RR: 0.92, 95% CI: 0.86-0.97, I = 64%). In adults aged ≥ 65 years with CV disease, SGLT2 inhibitors significantly reduce the composite risk of HHF, urgent HF visits, and CVD and secondary outcomes of all-cause mortality, CVD, and HHF, supporting their use in this population with careful monitoring of age-related risks.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Sodium-glucose cotransporter-2 (SGLT2) inhibitors, developed for type 2 diabetes mellitus (T2DM), have demonstrated cardiorenal benefits in conditions including cardiovascular (CV) disease. However, few meta-analyses have synthesized outcomes in older adults with CV disease."
        },
        {
          "label": "METHODS",
          "text": "A systematic review and meta-analysis of randomized controlled trials published from January 2015 to January 2025 was conducted using MEDLINE (PubMed), Embase (Ovid), and CENTRAL. We included studies that reported the risk of CV outcomes for subgroups of older adults (≥ 65 years) with CV disease. The primary outcome was a composite of hospitalization for heart failure (HHF), urgent heart failure (HF) visits, and cardiovascular death (CVD). Secondary outcomes included all-cause mortality, CVD, and HHF individually. Subgroup analyses were conducted in patients with HF, T2DM, age strata (65-74 vs. ≥ 75), SGLT2 inhibitor agent, and adverse events."
        },
        {
          "label": "RESULTS",
          "text": "Analyzing nine studies, SGLT2 inhibitors were associated with reducing the risk of composite outcome (HR: 0.75, 95% CI: 0.67-0.83, I = 51%), all-cause mortality (HR: 0.80, 95% CI: 0.66-0.97, I = 68%), CVD (HR: 0.78, 95% CI: 0.65-0.94, I = 61%), and HHF (HR: 0.73, 95% CI: 0.65-0.83, I = 0%). Benefits were consistent in subgroups of HF only, T2DM only, and those aged ≥ 75 years. No significant differences were observed by SGLT2 inhibitor type (p = 0.090). SGLT2 inhibitors increased the risk of genital infections (RR: 3.18, 95% CI: 2.35-4.30, I = 0%) but decreased that of other serious adverse events (RR: 0.92, 95% CI: 0.86-0.97, I = 64%)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In adults aged ≥ 65 years with CV disease, SGLT2 inhibitors significantly reduce the composite risk of HHF, urgent HF visits, and CVD and secondary outcomes of all-cause mortality, CVD, and HHF, supporting their use in this population with careful monitoring of age-related risks."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41054314/",
      "pubDate": "2025 Oct 07",
      "doi": "10.1111/jgs.70143",
      "dateReceived": "2025-10-17T23:22:22.815Z",
      "isNew": false,
      "summary": "SGLT2 inhibitors effectively reduce heart failure and cardiovascular risks and improve outcomes in older adults (≥65 years) with cardiovascular disease."
    },
    {
      "id": "bf354bd4d129",
      "title": "Non-Injectable Ketamine for Pediatric Sedation in the Emergency Department: A Systematic Review.",
      "journal": "Acad Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117863",
      "abstract": "Ketamine is the most common medication for procedural sedation and analgesia (PSA) of pediatric patients in the emergency department (ED). Since ketamine injection is painful, some studies have assessed the routes other than intravenous and intramuscular. Therefore, this systematic review aims to evaluate the details of noninjectable ketamine (NIK) administration. The review followed the Preferred Reporting Items for Systematic Review and Meta-Analysis for Systematic Review (PRISMA) guidelines. MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Web of Science Core Collection (SCIE and ESCI), and Scopus were searched for relevant studies from inception to 3 July 2025. All English original clinical research on PSA with NIK administration in pediatric populations in the ED was included. Risk of bias and certainty of evidence (COE) were also assessed. From 5617 identified records, 12 studies (7 interventional and 5 observational) with a total number of 1484 patients were included. Most of the studies evaluated laceration repair among children 2-12 years of age. Seven single-center double-blinded randomized controlled trials showed that oral ketamine (5-10 mg/kg) alone or in combination with other medications (mainly midazolam) provided the desirable level of sedation (COE: very low) relative to the oral comparators. It also resulted in faster onset of action (OA) (15-35 min) and shorter duration of action (DA) (60-265 min) (COE: low). Oral and nasal ketamine studies did not report any serious adverse event (SAE) associated with invasive interventions (COE: moderate to low). Sedation with oral ketamine might have a desirable depth, faster OA, and shorter DA relative to the oral comparators. Furthermore, NIK probably showed no SAE during PSA. Nevertheless, the limited number of heterogeneous studies leaves uncertainty, highlighting the need for further research.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Ketamine is the most common medication for procedural sedation and analgesia (PSA) of pediatric patients in the emergency department (ED). Since ketamine injection is painful, some studies have assessed the routes other than intravenous and intramuscular. Therefore, this systematic review aims to evaluate the details of noninjectable ketamine (NIK) administration."
        },
        {
          "label": "METHODS",
          "text": "The review followed the Preferred Reporting Items for Systematic Review and Meta-Analysis for Systematic Review (PRISMA) guidelines. MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Web of Science Core Collection (SCIE and ESCI), and Scopus were searched for relevant studies from inception to 3 July 2025. All English original clinical research on PSA with NIK administration in pediatric populations in the ED was included. Risk of bias and certainty of evidence (COE) were also assessed."
        },
        {
          "label": "RESULTS",
          "text": "From 5617 identified records, 12 studies (7 interventional and 5 observational) with a total number of 1484 patients were included. Most of the studies evaluated laceration repair among children 2-12 years of age. Seven single-center double-blinded randomized controlled trials showed that oral ketamine (5-10 mg/kg) alone or in combination with other medications (mainly midazolam) provided the desirable level of sedation (COE: very low) relative to the oral comparators. It also resulted in faster onset of action (OA) (15-35 min) and shorter duration of action (DA) (60-265 min) (COE: low). Oral and nasal ketamine studies did not report any serious adverse event (SAE) associated with invasive interventions (COE: moderate to low)."
        },
        {
          "label": "CONCLUSION",
          "text": "Sedation with oral ketamine might have a desirable depth, faster OA, and shorter DA relative to the oral comparators. Furthermore, NIK probably showed no SAE during PSA. Nevertheless, the limited number of heterogeneous studies leaves uncertainty, highlighting the need for further research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41069251/",
      "pubDate": "2025 Oct 10",
      "doi": "10.1111/acem.70163",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "Oral ketamine sedation may achieve a desirable level of sedation with quicker onset and shorter duration compared to other oral sedatives, and it appears to have a low rate of serious adverse events."
    },
    {
      "id": "5c1f07ad5053",
      "title": "Cefiderocol versus standard therapy for hospital-acquired and health-care-associated Gram-negative bacterial bloodstream infection (the GAME CHANGER trial): an open-label, parallel-group, randomised trial.",
      "journal": "Lancet Infect Dis",
      "score": "5/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117860",
      "abstract": "Bloodstream infections caused by bacteria with carbapenem resistance are associated with high mortality. Cefiderocol has broad in vitro activity against carbapenem-resistant Gram-negative bacilli. We aimed to assess whether cefiderocol was non-inferior or superior to standard-of-care antibiotics in preventing mortality in patients with bloodstream infection caused by Gram-negative bacilli. The GAME CHANGER trial was an open-label, parallel-group, randomised clinical trial in which patients with health-care-associated or hospital-acquired Gram-negative bloodstream infection were recruited from 17 tertiary hospitals with more than 500 beds in Australia, Malaysia, Singapore, Taiwan, Thailand, and Türkiye. Adult patients (aged ≥21 years in Singapore or ≥18 years elsewhere) with positive blood cultures and Gram-negative bacilli seen on Gram stain were eligible. Participants were randomly assigned in a 1:1 ratio to cefiderocol (2 g intravenously every 8 h) or standard of care (chosen by the patient's clinical team) using an online randomisation tool with strata defined by severity of comorbidities and region, with random permuted blocks of unequal size. Patients, treating clinicians, and site investigators were not masked to treatment. The primary outcome was all-cause mortality at 14 days after randomisation. All outcomes were analysed in participants who received at least one dose of assigned antibiotic, grew an aerobic Gram-negative bacillus from the index blood culture, and did not withdraw consent before day 14. The non-inferiority margin was 10%; superiority was to be assessed if non-inferiority was shown, and was evaluated in both the main analysis population and in patients with at least one carbapenem-resistant organism causing bloodstream infection. Missing data were handled by imputing data. The trial was registered on ClinicalTrials.gov (NCT03869437) and is closed to new participants. 513 participants were enrolled between Nov 12, 2019, and Oct 31, 2023 (210 [42%] female and 294 [58%] male). 256 patients were randomly assigned to cefiderocol and 257 were assigned to standard of care. Nine patients (six in the cefiderocol group and three in the standard-of-care group) were excluded from further analysis because they withdrew consent or their blood cultures did not grow an aerobic Gram-negative bacillus. Thus, 504 participants were included in the main analysis population. 20 (8%) of 250 patients in the cefiderocol group had died at 14 days compared with 17 (7%) of 254 patients in the standard-of-care group (absolute risk difference 1%, 95% CI -3 to 6). 127 (25%) of 504 patients had an infection with a carbapenem-resistant organism; at 14 days, nine (14%) of 64 patients in the cefiderocol group had died compared with six (10%) of 63 patients in the standard-of-care group (5%, -7 to 16). There were five treatment-emergent serious adverse events that were either probably or possibly related to the study drug (all in the cefiderocol group): delirium, stupor, rigors, abnormal liver chemistry, and rash, all of which resolved without treatment (except for the rash, which required hydrocortisone and anti-histamines). Among patients with a hospital-acquired or health-care-associated Gram-negative bloodstream infection, cefiderocol resulted in non-inferior 14-day mortality compared with standard of care. Adverse events were similar between groups, although those thought to be related to the study drug only occurred in the cefiderocol group. In both the main analysis population and the carbapenem-resistant subset, cefiderocol was not superior to standard of care. This evidence suggests that cefiderocol is efficacious in patients with health-care-associated Gram-negative bloodstream infection who are at high risk of antibiotic resistance, but more evidence is required to define its efficacy when carbapenem-resistant organisms are the cause. The University of Queensland, Shionogi, The Henderson Foundation, and the National Medical Research Council (Singapore).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Bloodstream infections caused by bacteria with carbapenem resistance are associated with high mortality. Cefiderocol has broad in vitro activity against carbapenem-resistant Gram-negative bacilli. We aimed to assess whether cefiderocol was non-inferior or superior to standard-of-care antibiotics in preventing mortality in patients with bloodstream infection caused by Gram-negative bacilli."
        },
        {
          "label": "METHODS",
          "text": "The GAME CHANGER trial was an open-label, parallel-group, randomised clinical trial in which patients with health-care-associated or hospital-acquired Gram-negative bloodstream infection were recruited from 17 tertiary hospitals with more than 500 beds in Australia, Malaysia, Singapore, Taiwan, Thailand, and Türkiye. Adult patients (aged ≥21 years in Singapore or ≥18 years elsewhere) with positive blood cultures and Gram-negative bacilli seen on Gram stain were eligible. Participants were randomly assigned in a 1:1 ratio to cefiderocol (2 g intravenously every 8 h) or standard of care (chosen by the patient's clinical team) using an online randomisation tool with strata defined by severity of comorbidities and region, with random permuted blocks of unequal size. Patients, treating clinicians, and site investigators were not masked to treatment. The primary outcome was all-cause mortality at 14 days after randomisation. All outcomes were analysed in participants who received at least one dose of assigned antibiotic, grew an aerobic Gram-negative bacillus from the index blood culture, and did not withdraw consent before day 14. The non-inferiority margin was 10%; superiority was to be assessed if non-inferiority was shown, and was evaluated in both the main analysis population and in patients with at least one carbapenem-resistant organism causing bloodstream infection. Missing data were handled by imputing data. The trial was registered on ClinicalTrials.gov (NCT03869437) and is closed to new participants."
        },
        {
          "label": "FINDINGS",
          "text": "513 participants were enrolled between Nov 12, 2019, and Oct 31, 2023 (210 [42%] female and 294 [58%] male). 256 patients were randomly assigned to cefiderocol and 257 were assigned to standard of care. Nine patients (six in the cefiderocol group and three in the standard-of-care group) were excluded from further analysis because they withdrew consent or their blood cultures did not grow an aerobic Gram-negative bacillus. Thus, 504 participants were included in the main analysis population. 20 (8%) of 250 patients in the cefiderocol group had died at 14 days compared with 17 (7%) of 254 patients in the standard-of-care group (absolute risk difference 1%, 95% CI -3 to 6). 127 (25%) of 504 patients had an infection with a carbapenem-resistant organism; at 14 days, nine (14%) of 64 patients in the cefiderocol group had died compared with six (10%) of 63 patients in the standard-of-care group (5%, -7 to 16). There were five treatment-emergent serious adverse events that were either probably or possibly related to the study drug (all in the cefiderocol group): delirium, stupor, rigors, abnormal liver chemistry, and rash, all of which resolved without treatment (except for the rash, which required hydrocortisone and anti-histamines)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Among patients with a hospital-acquired or health-care-associated Gram-negative bloodstream infection, cefiderocol resulted in non-inferior 14-day mortality compared with standard of care. Adverse events were similar between groups, although those thought to be related to the study drug only occurred in the cefiderocol group. In both the main analysis population and the carbapenem-resistant subset, cefiderocol was not superior to standard of care. This evidence suggests that cefiderocol is efficacious in patients with health-care-associated Gram-negative bloodstream infection who are at high risk of antibiotic resistance, but more evidence is required to define its efficacy when carbapenem-resistant organisms are the cause."
        },
        {
          "label": "FUNDING",
          "text": "The University of Queensland, Shionogi, The Henderson Foundation, and the National Medical Research Council (Singapore)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41067237/",
      "pubDate": "2025 Oct 06",
      "doi": "10.1016/S1473-3099(25)00469-4",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "Cefiderocol was not inferior to standard-of-care antibiotics in treating bloodstream infections caused by Gram-negative bacilli."
    },
    {
      "id": "e158a4cb7b6e",
      "title": "Efficacy and safety of respiratory syncytial virus vaccines.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117857",
      "abstract": "Respiratory syncytial virus (RSV) is a highly transmissible pathogen that causes varying degrees of respiratory illness across all age groups. The safety and efficacy profiles of available RSV vaccines, a critical consideration for their integration into public health strategies and clinical practice, remain uncertain. To assess the benefits and harms of RSV vaccines compared to placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or monoclonal antibodies (mAbs) across all human populations. We conducted a comprehensive literature search of CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the WHO ICTRP following standard systematic review methodology from 2000 to April 2024. We included both randomised controlled trials (RCTs) and non-randomised studies of interventions (NRSIs) involving all human populations comparing RSV vaccines with placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or mAbs. We excluded studies focused on dose-finding schedules and immunogenicity assessment. Benefits included frequency of RSV illness (both lower and upper respiratory illness) confirmed by laboratory tests (RSV-associated lower respiratory tract illness and RSV-associated acute respiratory illness); hospitalisation due to RSV disease (both lower and upper respiratory illness) confirmed by laboratory tests; mortality from illness caused by RSV (confirmed by laboratory test); all-cause mortality; and admission to an intensive care unit. Harms included serious adverse events (SAEs) related to vaccination, including neurological disorders such as Guillain-Barré syndrome. We assessed risk of bias in RCTs using Cochrane's RoB 2 tool. We used standard Cochrane methods. We identified 14 RCTs: five trials (101,825 participants) on older adults; three trials (12,010 participants) on maternal vaccination and effects on infants; one trial (300 participants) on women of childbearing age; and five trials (192 participants) on infants and children. We identified no NRSIs. RSV prefusion vaccine versus placebo in older adults These vaccines reduced RSV-associated lower respiratory tract illness with vaccine efficacy (VE) of 77% (95% confidence interval (CI) 0.70 to 0.83; risk ratio (RR) 0.23, 95% CI 0.17 to 0.30; 4 RCTs, 99,931 participants; high-certainty evidence) and RSV-associated acute respiratory illness with VE of 67% (95% CI 0.60 to 0.73; RR 0.33, 95% CI 0.27 to 0.40; 3 RCTs, 94,339 participants; high-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). RSV postfusion F protein-based vaccine versus placebo in older adults There is probably little to no difference in RSV-associated lower respiratory tract illness with VE of -0.37% (95% CI -1.96 to 0.37; RR 1.37, 95% CI 0.63 to 2.96; 1 RCT, 1894 participants; moderate-certainty evidence) and RSV-associated acute respiratory illness with VE of -0.07% (95% CI -1.15 to 0.47; RR 1.07, 95% CI 0.53 to 2.15; 1 RCT, 1894 participants; moderate-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Maternal RSV F protein-based vaccine versus placebo in infants These vaccines reduced medically attended RSV-associated lower respiratory tract illness with VE of 54% (95% CI 0.28 to 0.71; RR 0.46, 95% CI 0.29 to 0.72; 3 RCTs, 12,010 participants; high-certainty evidence), medically attended RSV-associated severe lower respiratory tract illness with VE of 74% (95% CI 0.44 to 0.88; RR 0.26, 95% CI 0.12 to 0.56; 3 RCTs, 12,010 participants; high-certainty evidence), and hospitalisation due to RSV disease with VE of 54% (95% CI 0.27 to 0.71; RR 0.46, 95% CI 0.29 to 0.73; 2 RCTs, 11,502 participants; high-certainty evidence) in infants. There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination in mothers and infants (low-certainty evidence). Live-attenuated RSV vaccines versus placebo in infants and children The evidence is very uncertain regarding all-cause medically attended acute respiratory illness (MAARI) with VE of 26% (95% CI -0.01 to 0.46; RR 0.74, 95% CI 0.54 to 1.01; 5 RCTs, 171 participants; very low-certainty evidence) and RSV-associated MAARI with VE of 38% (95% CI -0.24 to 0.69; RR 0.62, 95% CI 0.31 to 1.24; 5 RCTs, 192 participants; very low-certainty evidence). There may be little to no difference in SAEs related to vaccination (low-certainty evidence). RSV recombinant F nanoparticle vaccine versus placebo in women of childbearing age The evidence is very uncertain regarding new RSV infections with VE of 50% (95% CI 0.08 to 0.73; RR 0.50, 95% CI 0.27 to 0.92; 1 RCT, 300 participants; very low-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Phase III trials consistently demonstrated low risk of bias. Whilst phase I and II trials occasionally raised concerns about selection bias in the randomisation process, the overall evidence was deemed robust. RSV prefusion vaccines reduced RSV-associated lower respiratory tract illness and acute respiratory illness in older adults. There may be little to no difference in SAEs related to vaccination in older adults. Maternal vaccination with RSV F protein-based vaccines reduced medically attended RSV-associated lower respiratory tract illness and severe cases in infants. There may be little to no difference in SAEs related to vaccination in mothers and infants. The evidence is very uncertain regarding the effects of RSV vaccine on women of childbearing age, and the effects of live-attenuated RSV vaccines on infants and children; there may be little to no difference in SAEs related to vaccination. This review was funded by the EU4Health Programme under a service contract with the European Health and Digital Executive Agency (HaDEA). The review was registered in the International Prospective Register of Systematic Reviews (PROSPERO) (CRD42023439128).",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Respiratory syncytial virus (RSV) is a highly transmissible pathogen that causes varying degrees of respiratory illness across all age groups. The safety and efficacy profiles of available RSV vaccines, a critical consideration for their integration into public health strategies and clinical practice, remain uncertain."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of RSV vaccines compared to placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or monoclonal antibodies (mAbs) across all human populations."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We conducted a comprehensive literature search of CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the WHO ICTRP following standard systematic review methodology from 2000 to April 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included both randomised controlled trials (RCTs) and non-randomised studies of interventions (NRSIs) involving all human populations comparing RSV vaccines with placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or mAbs. We excluded studies focused on dose-finding schedules and immunogenicity assessment."
        },
        {
          "label": "OUTCOMES",
          "text": "Benefits included frequency of RSV illness (both lower and upper respiratory illness) confirmed by laboratory tests (RSV-associated lower respiratory tract illness and RSV-associated acute respiratory illness); hospitalisation due to RSV disease (both lower and upper respiratory illness) confirmed by laboratory tests; mortality from illness caused by RSV (confirmed by laboratory test); all-cause mortality; and admission to an intensive care unit. Harms included serious adverse events (SAEs) related to vaccination, including neurological disorders such as Guillain-Barré syndrome."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed risk of bias in RCTs using Cochrane's RoB 2 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We used standard Cochrane methods."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We identified 14 RCTs: five trials (101,825 participants) on older adults; three trials (12,010 participants) on maternal vaccination and effects on infants; one trial (300 participants) on women of childbearing age; and five trials (192 participants) on infants and children. We identified no NRSIs."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "RSV prefusion vaccine versus placebo in older adults These vaccines reduced RSV-associated lower respiratory tract illness with vaccine efficacy (VE) of 77% (95% confidence interval (CI) 0.70 to 0.83; risk ratio (RR) 0.23, 95% CI 0.17 to 0.30; 4 RCTs, 99,931 participants; high-certainty evidence) and RSV-associated acute respiratory illness with VE of 67% (95% CI 0.60 to 0.73; RR 0.33, 95% CI 0.27 to 0.40; 3 RCTs, 94,339 participants; high-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). RSV postfusion F protein-based vaccine versus placebo in older adults There is probably little to no difference in RSV-associated lower respiratory tract illness with VE of -0.37% (95% CI -1.96 to 0.37; RR 1.37, 95% CI 0.63 to 2.96; 1 RCT, 1894 participants; moderate-certainty evidence) and RSV-associated acute respiratory illness with VE of -0.07% (95% CI -1.15 to 0.47; RR 1.07, 95% CI 0.53 to 2.15; 1 RCT, 1894 participants; moderate-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Maternal RSV F protein-based vaccine versus placebo in infants These vaccines reduced medically attended RSV-associated lower respiratory tract illness with VE of 54% (95% CI 0.28 to 0.71; RR 0.46, 95% CI 0.29 to 0.72; 3 RCTs, 12,010 participants; high-certainty evidence), medically attended RSV-associated severe lower respiratory tract illness with VE of 74% (95% CI 0.44 to 0.88; RR 0.26, 95% CI 0.12 to 0.56; 3 RCTs, 12,010 participants; high-certainty evidence), and hospitalisation due to RSV disease with VE of 54% (95% CI 0.27 to 0.71; RR 0.46, 95% CI 0.29 to 0.73; 2 RCTs, 11,502 participants; high-certainty evidence) in infants. There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination in mothers and infants (low-certainty evidence). Live-attenuated RSV vaccines versus placebo in infants and children The evidence is very uncertain regarding all-cause medically attended acute respiratory illness (MAARI) with VE of 26% (95% CI -0.01 to 0.46; RR 0.74, 95% CI 0.54 to 1.01; 5 RCTs, 171 participants; very low-certainty evidence) and RSV-associated MAARI with VE of 38% (95% CI -0.24 to 0.69; RR 0.62, 95% CI 0.31 to 1.24; 5 RCTs, 192 participants; very low-certainty evidence). There may be little to no difference in SAEs related to vaccination (low-certainty evidence). RSV recombinant F nanoparticle vaccine versus placebo in women of childbearing age The evidence is very uncertain regarding new RSV infections with VE of 50% (95% CI 0.08 to 0.73; RR 0.50, 95% CI 0.27 to 0.92; 1 RCT, 300 participants; very low-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Phase III trials consistently demonstrated low risk of bias. Whilst phase I and II trials occasionally raised concerns about selection bias in the randomisation process, the overall evidence was deemed robust."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "RSV prefusion vaccines reduced RSV-associated lower respiratory tract illness and acute respiratory illness in older adults. There may be little to no difference in SAEs related to vaccination in older adults. Maternal vaccination with RSV F protein-based vaccines reduced medically attended RSV-associated lower respiratory tract illness and severe cases in infants. There may be little to no difference in SAEs related to vaccination in mothers and infants. The evidence is very uncertain regarding the effects of RSV vaccine on women of childbearing age, and the effects of live-attenuated RSV vaccines on infants and children; there may be little to no difference in SAEs related to vaccination."
        },
        {
          "label": "FUNDING",
          "text": "This review was funded by the EU4Health Programme under a service contract with the European Health and Digital Executive Agency (HaDEA)."
        },
        {
          "label": "REGISTRATION",
          "text": "The review was registered in the International Prospective Register of Systematic Reviews (PROSPERO) (CRD42023439128)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41016728/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1002/14651858.CD016131",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "RSV prefusion vaccines protect older adults and infants from RSV-related illness, with no significant increase in serious adverse events, while the effects on women of childbearing age and live-attenuated vaccines in children are uncertain."
    },
    {
      "id": "2187d7959ea6",
      "title": "Electromechanically Optimized Right Ventricular Pacing for Obstructive Hypertrophic Cardiomyopathy (EMORI-HCM).",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117846",
      "abstract": "Many patients with symptomatic obstructive hypertrophic cardiomyopathy (oHCM) have devices capable of right ventricular pacing (RVP). Although pacing can reduce left ventricular outflow tract gradient (LVOTg), it can also reduce cardiac output, so its net effect is variable. We tested whether electromechanical optimization of the programmed atrio-ventricular delay (AVD) allows RVP to achieve a net benefit on symptoms. EMORI-HCM (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy) is a multicenter, blinded, randomized, crossover trial of AVD-optimized RVP in patients with symptomatic oHCM with resting or provoked gradient of at least 30 mm Hg. Patients with existing dual-chamber devices were randomized to either 3 months of continuous AVD-optimized RVP (intervention) followed by 3 months of backup-only RVP (control), or vice versa. AVD was optimized using a high-precision multiple-alternation protocol assessing acute change in beat-by-beat blood pressure while varying AVD. The primary outcome was symptoms measured by the Kansas City Cardiomyopathy Questionnaire Clinical Summary Score. Secondary outcomes include patient-reported daily symptom data collected using a dedicated smartphone application (ORBITA-app), dichotomous patient preference, EQ-5D, exercise capacity, and LVOTg. Patients were blinded to treatment allocation. Symptom assessments were self-administered. Outcome measures were recorded at baseline, crossover, and completion. Analysis was by Bayesian ordinal mixed modeling. Between October 2021 and October 2024, 117 screened patients met the inclusion criteria, of whom 60 were randomized. AVD-optimized RVP improved Kansas City Cardiomyopathy Questionnaire Clinical Summary Score (+4.5; 95% credible interval [CrI]: 1.3-8.1; probability of benefit [Pr] = 0.997) and daily symptom scores (OR: 1.29; 95% CrI: 0.98-1.68; Pr: 0.969) compared with backup-only pacing. AVD-optimized RVP improved exercise capacity (+1.0 mL/kg/min; 95% CrI: 0.1-2.0; Pr: 0.984) and LVOTg (-7.3 mm Hg; 95% CrI: -13.5 to -1.1; Pr: 0.010). It had no effect on B-type natriuretic peptide (Pr: 0.893) and ejection fraction was preserved (Pr: 0.409). In patients with oHCM, RVP delivered at electromechanically optimized AVD improves symptoms and exercise capacity. (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy [EMORI-HCM], NCT05257772).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Many patients with symptomatic obstructive hypertrophic cardiomyopathy (oHCM) have devices capable of right ventricular pacing (RVP). Although pacing can reduce left ventricular outflow tract gradient (LVOTg), it can also reduce cardiac output, so its net effect is variable."
        },
        {
          "label": "OBJECTIVE",
          "text": "We tested whether electromechanical optimization of the programmed atrio-ventricular delay (AVD) allows RVP to achieve a net benefit on symptoms."
        },
        {
          "label": "METHODS",
          "text": "EMORI-HCM (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy) is a multicenter, blinded, randomized, crossover trial of AVD-optimized RVP in patients with symptomatic oHCM with resting or provoked gradient of at least 30 mm Hg. Patients with existing dual-chamber devices were randomized to either 3 months of continuous AVD-optimized RVP (intervention) followed by 3 months of backup-only RVP (control), or vice versa. AVD was optimized using a high-precision multiple-alternation protocol assessing acute change in beat-by-beat blood pressure while varying AVD. The primary outcome was symptoms measured by the Kansas City Cardiomyopathy Questionnaire Clinical Summary Score. Secondary outcomes include patient-reported daily symptom data collected using a dedicated smartphone application (ORBITA-app), dichotomous patient preference, EQ-5D, exercise capacity, and LVOTg. Patients were blinded to treatment allocation. Symptom assessments were self-administered. Outcome measures were recorded at baseline, crossover, and completion. Analysis was by Bayesian ordinal mixed modeling."
        },
        {
          "label": "RESULTS",
          "text": "Between October 2021 and October 2024, 117 screened patients met the inclusion criteria, of whom 60 were randomized. AVD-optimized RVP improved Kansas City Cardiomyopathy Questionnaire Clinical Summary Score (+4.5; 95% credible interval [CrI]: 1.3-8.1; probability of benefit [Pr] = 0.997) and daily symptom scores (OR: 1.29; 95% CrI: 0.98-1.68; Pr: 0.969) compared with backup-only pacing. AVD-optimized RVP improved exercise capacity (+1.0 mL/kg/min; 95% CrI: 0.1-2.0; Pr: 0.984) and LVOTg (-7.3 mm Hg; 95% CrI: -13.5 to -1.1; Pr: 0.010). It had no effect on B-type natriuretic peptide (Pr: 0.893) and ejection fraction was preserved (Pr: 0.409)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with oHCM, RVP delivered at electromechanically optimized AVD improves symptoms and exercise capacity. (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy [EMORI-HCM], NCT05257772)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892619/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1016/j.jacc.2025.08.050",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "Electromechanically optimized right ventricular pacing improves symptoms and exercise capacity in patients with obstructive hypertrophic cardiomyopathy."
    },
    {
      "id": "59a3d4be2c89",
      "title": "Prognostic accuracy of clinical markers of postpartum bleeding in predicting maternal mortality or severe morbidity: a WHO individual participant data meta-analysis.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117840",
      "abstract": "Postpartum haemorrhage (excessive bleeding after birth) is a leading cause of maternal mortality and morbidity worldwide. However, there is no global consensus on which clinical markers best define excessive bleeding or reliably predict adverse maternal outcomes. The aim of this study was to assess the prognostic accuracy of clinical markers of postpartum bleeding in predicting maternal mortality or severe morbidity. In this individual participant data meta-analysis, eligible datasets were identified through a global call for data issued by WHO and systematic searches of PubMed, MEDLINE, Embase, the Cochrane Library, and WHO trial registries (from database inception to Nov 6, 2024). Studies were eligible if they included at least 200 participants with objectively measured blood loss or other clinical markers of haemodynamic instability, and reported at least one clinical outcome of interest. Individual participant data were requested for all eligible studies. For each dataset, we computed the prognostic accuracy of each clinical marker to predict a composite outcome of maternal mortality or severe morbidity (blood transfusion, surgical interventions, or admission to intensive care unit). Five clinical markers were assessed: measured blood loss, pulse rate, systolic blood pressure, diastolic blood pressure, and shock index. Results were meta-analysed through two-level mixed-effects logistic regression models, with a bivariate normal model used to generate summary accuracy estimates. Clinical marker and threshold selections were informed by a WHO expert consensus process, which placed emphasis on maximising prognostic sensitivity (preferably >80%) over prognostic specificity (preferably ≥50%). This meta-analysis was registered on PROSPERO (CRD420251034918). We identified 33 potentially eligible datasets and successfully obtained and analysed full data for 12 datasets, comprising 312 151 women. At the conventional threshold of 500 mL, measured blood loss had a summary prognostic sensitivity of 75·7% (95% CI 60·3-86·4) and specificity of 81·4% (95% CI 70·7-88·8) for predicting the composite outcome. The preferred sensitivity threshold was reached at 300 mL (83·9% [95% CI 72·8-91·1]), although at the expense of reduced specificity (54·8% [95% CI 38·0-70·5]). Prognostic performance improved with a decision rule that combined the use of either blood loss thresholds less than 500 mL (≥300 mL to ≥450 mL) and any abnormal haemodynamic sign (pulse rate >100 beats per min, systolic blood pressure <100 mm Hg, diastolic blood pressure <60 mm Hg, or shock index >1·0) or 500 mL or more of blood loss, with sensitivities ranging from 86·9% to 87·9% and specificities from 66·6% to 76·1%. Measured blood loss below the conventional threshold, combined with abnormal haemodynamic signs, accurately predicts women at risk of death or life-threatening complications from postpartum bleeding and could support earlier postpartum haemorrhage diagnosis and treatment. The Gates Foundation and UNDP/UNFPA/UNICEF/WHO/World Bank Special Programme of Research, Development and Research Training in Human Reproduction.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Postpartum haemorrhage (excessive bleeding after birth) is a leading cause of maternal mortality and morbidity worldwide. However, there is no global consensus on which clinical markers best define excessive bleeding or reliably predict adverse maternal outcomes. The aim of this study was to assess the prognostic accuracy of clinical markers of postpartum bleeding in predicting maternal mortality or severe morbidity."
        },
        {
          "label": "METHODS",
          "text": "In this individual participant data meta-analysis, eligible datasets were identified through a global call for data issued by WHO and systematic searches of PubMed, MEDLINE, Embase, the Cochrane Library, and WHO trial registries (from database inception to Nov 6, 2024). Studies were eligible if they included at least 200 participants with objectively measured blood loss or other clinical markers of haemodynamic instability, and reported at least one clinical outcome of interest. Individual participant data were requested for all eligible studies. For each dataset, we computed the prognostic accuracy of each clinical marker to predict a composite outcome of maternal mortality or severe morbidity (blood transfusion, surgical interventions, or admission to intensive care unit). Five clinical markers were assessed: measured blood loss, pulse rate, systolic blood pressure, diastolic blood pressure, and shock index. Results were meta-analysed through two-level mixed-effects logistic regression models, with a bivariate normal model used to generate summary accuracy estimates. Clinical marker and threshold selections were informed by a WHO expert consensus process, which placed emphasis on maximising prognostic sensitivity (preferably >80%) over prognostic specificity (preferably ≥50%). This meta-analysis was registered on PROSPERO (CRD420251034918)."
        },
        {
          "label": "FINDINGS",
          "text": "We identified 33 potentially eligible datasets and successfully obtained and analysed full data for 12 datasets, comprising 312 151 women. At the conventional threshold of 500 mL, measured blood loss had a summary prognostic sensitivity of 75·7% (95% CI 60·3-86·4) and specificity of 81·4% (95% CI 70·7-88·8) for predicting the composite outcome. The preferred sensitivity threshold was reached at 300 mL (83·9% [95% CI 72·8-91·1]), although at the expense of reduced specificity (54·8% [95% CI 38·0-70·5]). Prognostic performance improved with a decision rule that combined the use of either blood loss thresholds less than 500 mL (≥300 mL to ≥450 mL) and any abnormal haemodynamic sign (pulse rate >100 beats per min, systolic blood pressure <100 mm Hg, diastolic blood pressure <60 mm Hg, or shock index >1·0) or 500 mL or more of blood loss, with sensitivities ranging from 86·9% to 87·9% and specificities from 66·6% to 76·1%."
        },
        {
          "label": "INTERPRETATION",
          "text": "Measured blood loss below the conventional threshold, combined with abnormal haemodynamic signs, accurately predicts women at risk of death or life-threatening complications from postpartum bleeding and could support earlier postpartum haemorrhage diagnosis and treatment."
        },
        {
          "label": "FUNDING",
          "text": "The Gates Foundation and UNDP/UNFPA/UNICEF/WHO/World Bank Special Programme of Research, Development and Research Training in Human Reproduction."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41056961/",
      "pubDate": "2025 Oct 04",
      "doi": "10.1016/S0140-6736(25)01639-3",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "Measured blood loss at a threshold of 500 mL effectively predicts maternal mortality or severe morbidity following childbirth."
    },
    {
      "id": "b35a915aea5b",
      "title": "CAPABLE for People After Hospitalization: A Randomized Trial.",
      "journal": "J Am Geriatr Soc",
      "score": "6/7",
      "tags": [
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117786",
      "abstract": "Following hospitalization, nearly 30% of older adults lose some independence. This can lead to rehospitalization, nursing home admission, and increased dependence. CAPABLE, an evidence-based program, increases independence among older adults with functional limitations but has not been tested in recently hospitalized people. This randomized clinical trial enrolled 268 low-income community-dwelling adults who had been discharged to home from the hospital 60 days prior, had a home health episode, yet had remaining difficulties in at least one activity of daily living. Participants were randomized to no further care or to CAPABLE, which involved up to 10 home visits over 5 months with an occupational therapist, a registered nurse, and a handyworker to address an older adult's self-identified functional goals. Main outcomes were (1) improvement in difficulty with and assistance needed for 10 activities of daily living (range 10-50); (2) five instrumental activities of daily living and mobility: walking up a set of stairs and walking a block. The CAPABLE group decreased their ADL difficulty by -1.76 (CI -2.98, -0.54) and the control group decreased (-0.63: CI -1.86, 0.60) over 5 months, which was not statistically or clinically significant. However, the CAPABLE treatment group demonstrated greater improvement in a composite mobility measure than control participants (-0.52 and -0.02, respectively, p = 0.028). Additionally, among participants with four or more co-morbidities at baseline, the CAPABLE group showed significantly improved ADL independence compared to control participants. Among recently hospitalized persons receiving skilled home health care, CAPABLE did not improve ADLs. However, it improved functional mobility and benefited those with ≥ 4 comorbidities. This study provides novel information on targeting CAPABLE in the post-hospitalization period.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Following hospitalization, nearly 30% of older adults lose some independence. This can lead to rehospitalization, nursing home admission, and increased dependence. CAPABLE, an evidence-based program, increases independence among older adults with functional limitations but has not been tested in recently hospitalized people."
        },
        {
          "label": "METHODS",
          "text": "This randomized clinical trial enrolled 268 low-income community-dwelling adults who had been discharged to home from the hospital 60 days prior, had a home health episode, yet had remaining difficulties in at least one activity of daily living. Participants were randomized to no further care or to CAPABLE, which involved up to 10 home visits over 5 months with an occupational therapist, a registered nurse, and a handyworker to address an older adult's self-identified functional goals. Main outcomes were (1) improvement in difficulty with and assistance needed for 10 activities of daily living (range 10-50); (2) five instrumental activities of daily living and mobility: walking up a set of stairs and walking a block."
        },
        {
          "label": "RESULTS",
          "text": "The CAPABLE group decreased their ADL difficulty by -1.76 (CI -2.98, -0.54) and the control group decreased (-0.63: CI -1.86, 0.60) over 5 months, which was not statistically or clinically significant. However, the CAPABLE treatment group demonstrated greater improvement in a composite mobility measure than control participants (-0.52 and -0.02, respectively, p = 0.028). Additionally, among participants with four or more co-morbidities at baseline, the CAPABLE group showed significantly improved ADL independence compared to control participants."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among recently hospitalized persons receiving skilled home health care, CAPABLE did not improve ADLs. However, it improved functional mobility and benefited those with ≥ 4 comorbidities. This study provides novel information on targeting CAPABLE in the post-hospitalization period."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40990312/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1111/jgs.70116",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "CAPABLE improved functional mobility and benefited those with multiple comorbidities in recently hospitalized individuals receiving skilled home health care."
    },
    {
      "id": "126bdbefacc7",
      "title": "Antenatal Corticosteroid in Twin-Pregnant Women at Risk of Late Preterm Delivery: A Randomized Clinical Trial.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117763",
      "abstract": "Recent guidelines have recommended corticosteroid injection in women with singleton pregnancies at risk of late preterm delivery. However, the effectiveness of antenatal corticosteroid administration in women with twin pregnancies at risk of late preterm delivery has not been evaluated, and studies on this population are lacking. To evaluate whether antenatal betamethasone administration reduces the risk of neonatal respiratory morbidity in late preterm twin neonates. In this multicenter randomized trial, twin-pregnant women at 34 weeks 0 days to 36 weeks 5 days of gestation at risk of late preterm delivery were enrolled across 8 university-based clinical centers in Korea. Data were collected between May 2018 and July 2024. Intention-to-treat analysis was performed. The participants received 2 injections of betamethasone or placebo after randomization (1:1). The primary outcome was perinatal death within 72 hours after birth or severe neonatal respiratory morbidity. The exploratory outcomes were mild neonatal respiratory morbidities, other neonatal respiratory morbidities, other neonatal complications, or maternal complications. A total of 812 participants were randomized and analyzed, with 410 in the intervention group (median [IQR] age, 35 [33-37] years) and 402 in the placebo group (median [IQR] age, 35 [32-38] years). Among 1620 neonates (818 in the intervention group and 802 in the placebo group), there were no perinatal deaths in either group, and severe neonatal respiratory morbidity occurred in 99 neonates (6.1%), with lower risk in the betamethasone group than in the placebo group (39 [4.8%] vs 60 [7.5%]; relative risk [RR], 0.64 [95% CI, 0.42-0.98]). For the exploratory outcomes, continuous positive airway pressure use for 2 hours or more (RR, 0.58 [95% CI, 0.35-0.95]) and transient tachypnea of the newborn (RR, 0.47 [95% CI, 0.25-0.89]) were lower in the betamethasone group. The risk of primary outcome and mild respiratory morbidities was reduced only in neonates delivered between 12 hours or more and less than 7 days after the first betamethasone administration. The risk of neonatal hypoglycemia was increased in the betamethasone group (128 [15.6%] vs 94 [11.7%]; RR, 1.33 [95% CI, 1.01-1.75]), but the risk of neonatal sepsis or maternal chorioamnionitis did not differ between the 2 groups. In this randomized clinical trial, antenatal betamethasone administration in women with twin pregnancies at risk of late preterm delivery significantly reduced the risk of neonatal respiratory morbidity. The outcomes from this study could serve as a valuable reference in clinical management of twin pregnancies at risk of late preterm delivery. ClinicalTrials.gov Identifier: NCT03547791.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Recent guidelines have recommended corticosteroid injection in women with singleton pregnancies at risk of late preterm delivery. However, the effectiveness of antenatal corticosteroid administration in women with twin pregnancies at risk of late preterm delivery has not been evaluated, and studies on this population are lacking."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether antenatal betamethasone administration reduces the risk of neonatal respiratory morbidity in late preterm twin neonates."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "In this multicenter randomized trial, twin-pregnant women at 34 weeks 0 days to 36 weeks 5 days of gestation at risk of late preterm delivery were enrolled across 8 university-based clinical centers in Korea. Data were collected between May 2018 and July 2024. Intention-to-treat analysis was performed."
        },
        {
          "label": "INTERVENTION",
          "text": "The participants received 2 injections of betamethasone or placebo after randomization (1:1)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was perinatal death within 72 hours after birth or severe neonatal respiratory morbidity. The exploratory outcomes were mild neonatal respiratory morbidities, other neonatal respiratory morbidities, other neonatal complications, or maternal complications."
        },
        {
          "label": "RESULTS",
          "text": "A total of 812 participants were randomized and analyzed, with 410 in the intervention group (median [IQR] age, 35 [33-37] years) and 402 in the placebo group (median [IQR] age, 35 [32-38] years). Among 1620 neonates (818 in the intervention group and 802 in the placebo group), there were no perinatal deaths in either group, and severe neonatal respiratory morbidity occurred in 99 neonates (6.1%), with lower risk in the betamethasone group than in the placebo group (39 [4.8%] vs 60 [7.5%]; relative risk [RR], 0.64 [95% CI, 0.42-0.98]). For the exploratory outcomes, continuous positive airway pressure use for 2 hours or more (RR, 0.58 [95% CI, 0.35-0.95]) and transient tachypnea of the newborn (RR, 0.47 [95% CI, 0.25-0.89]) were lower in the betamethasone group. The risk of primary outcome and mild respiratory morbidities was reduced only in neonates delivered between 12 hours or more and less than 7 days after the first betamethasone administration. The risk of neonatal hypoglycemia was increased in the betamethasone group (128 [15.6%] vs 94 [11.7%]; RR, 1.33 [95% CI, 1.01-1.75]), but the risk of neonatal sepsis or maternal chorioamnionitis did not differ between the 2 groups."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, antenatal betamethasone administration in women with twin pregnancies at risk of late preterm delivery significantly reduced the risk of neonatal respiratory morbidity. The outcomes from this study could serve as a valuable reference in clinical management of twin pregnancies at risk of late preterm delivery."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03547791."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982289/",
      "pubDate": "2025 Sep 22",
      "doi": "10.1001/jamapediatrics.2025.3284",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "Antenatal betamethasone in twin pregnancies at risk of late preterm delivery decreased the likelihood of breathing problems in newborns."
    },
    {
      "id": "1530a2adaab0",
      "title": "Conservative management of placenta accreta spectrum is associated with improved surgical outcomes compared to cesarean hysterectomy: a systematic review and meta-analysis.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117716",
      "abstract": "To compare maternal and surgical outcomes between patients with placenta accreta spectrum who underwent conservative management and those who underwent cesarean hysterectomy. We performed a systematic search in PubMed, Embase, and Web of Science from inception up to June 2, 2024. Studies comparing clinical outcomes among patients with placenta accreta spectrum undergoing conservative management vs cesarean hysterectomy were included. Conservative management was defined as leaving the placenta in situ and local myometrial resection. A random-effects model was used to pool the mean differences or odds ratios and the corresponding 95% confidence intervals. Heterogeneity was assessed using the I statistic. The meta-analysis included 16 studies, with a total of 2300 women diagnosed with placenta accreta spectrum. Of this pooled sample, 1072 patients underwent cesarean hysterectomy and 1228 were managed conservatively. In pregnancies affected by placenta accreta spectrum, cesarean hysterectomy was associated with significantly higher estimated blood loss compared to placenta in situ (mean difference 973.5 mL, 95% confidence interval 615.4-1331.7, 95% prediction interval [PI] -50.2 to 1997.2, P<.001) and local resection (mean difference 739.7 mL, 95% confidence interval 287.7-1191.7, 95% PI -911.5 to 2390.9, P<.001). Additionally, cesarean hysterectomy resulted in more intraoperative transfused red blood cell units than the local resection (mean difference 1.54 units, 95% confidence interval 1.06-2.01, 95% PI 0.27-2.81, P=.001) but had similar rates as compared to placenta in situ group (mean difference 0.72 units, 95% confidence interval -0.21 to 1.64, 95% PI -2.21 to 3.64, P=.065). The risk of genitourinary injury was significantly higher for cesarean hysterectomy compared to both placenta left in situ (odds ratio 3.79, 95% confidence interval 1.88-7.61, 95% PI 1.52-9.46, P<.001) and local resection (odds ratio 4.11, 95% confidence interval 2.57-6.56, 95% PI 2.34-7.22, P<.001). Patients undergoing cesarean hysterectomy, as compared to placenta in situ group, were more likely to be admitted to intensive care unit (odds ratio 7.98, 95% confidence interval 2.23-28.51, 95% PI 0.34-188.50, P<0.001); however, there was no significant difference between cesarean hysterectomy and local resection group in terms of intensive care unit admission. There were no significant differences between cesarean hysterectomy and conservative approaches regarding the risk of gastrointestinal injury and thromboembolic events. This meta-analysis strengthens the evidence supporting conservative management for pregnancies with placenta accreta spectrum, demonstrating that it is associated with reduced surgical morbidity and may offer an effective alternative to cesarean hysterectomy, particularly for patients seeking fertility preservation. However, further research, including randomized controlled trials and longitudinal studies, is necessary to more definitively evaluate conservative management approaches for pregnancies with placenta accreta spectrum and assess long-term clinical outcomes after conservative management.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To compare maternal and surgical outcomes between patients with placenta accreta spectrum who underwent conservative management and those who underwent cesarean hysterectomy."
        },
        {
          "label": "DATA SOURCES",
          "text": "We performed a systematic search in PubMed, Embase, and Web of Science from inception up to June 2, 2024."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Studies comparing clinical outcomes among patients with placenta accreta spectrum undergoing conservative management vs cesarean hysterectomy were included. Conservative management was defined as leaving the placenta in situ and local myometrial resection."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "A random-effects model was used to pool the mean differences or odds ratios and the corresponding 95% confidence intervals. Heterogeneity was assessed using the I statistic."
        },
        {
          "label": "RESULTS",
          "text": "The meta-analysis included 16 studies, with a total of 2300 women diagnosed with placenta accreta spectrum. Of this pooled sample, 1072 patients underwent cesarean hysterectomy and 1228 were managed conservatively. In pregnancies affected by placenta accreta spectrum, cesarean hysterectomy was associated with significantly higher estimated blood loss compared to placenta in situ (mean difference 973.5 mL, 95% confidence interval 615.4-1331.7, 95% prediction interval [PI] -50.2 to 1997.2, P<.001) and local resection (mean difference 739.7 mL, 95% confidence interval 287.7-1191.7, 95% PI -911.5 to 2390.9, P<.001). Additionally, cesarean hysterectomy resulted in more intraoperative transfused red blood cell units than the local resection (mean difference 1.54 units, 95% confidence interval 1.06-2.01, 95% PI 0.27-2.81, P=.001) but had similar rates as compared to placenta in situ group (mean difference 0.72 units, 95% confidence interval -0.21 to 1.64, 95% PI -2.21 to 3.64, P=.065). The risk of genitourinary injury was significantly higher for cesarean hysterectomy compared to both placenta left in situ (odds ratio 3.79, 95% confidence interval 1.88-7.61, 95% PI 1.52-9.46, P<.001) and local resection (odds ratio 4.11, 95% confidence interval 2.57-6.56, 95% PI 2.34-7.22, P<.001). Patients undergoing cesarean hysterectomy, as compared to placenta in situ group, were more likely to be admitted to intensive care unit (odds ratio 7.98, 95% confidence interval 2.23-28.51, 95% PI 0.34-188.50, P<0.001); however, there was no significant difference between cesarean hysterectomy and local resection group in terms of intensive care unit admission. There were no significant differences between cesarean hysterectomy and conservative approaches regarding the risk of gastrointestinal injury and thromboembolic events."
        },
        {
          "label": "CONCLUSION",
          "text": "This meta-analysis strengthens the evidence supporting conservative management for pregnancies with placenta accreta spectrum, demonstrating that it is associated with reduced surgical morbidity and may offer an effective alternative to cesarean hysterectomy, particularly for patients seeking fertility preservation. However, further research, including randomized controlled trials and longitudinal studies, is necessary to more definitively evaluate conservative management approaches for pregnancies with placenta accreta spectrum and assess long-term clinical outcomes after conservative management."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/39884567/",
      "pubDate": "2025 May",
      "doi": "10.1016/j.ajog.2025.01.030",
      "dateReceived": "2025-10-16T23:20:44.403Z",
      "isNew": false,
      "summary": "Conservative management of pregnancies with placenta accreta spectrum appears to reduce surgical complications and may be a good option, especially for those wanting to preserve fertility."
    },
    {
      "id": "13c470ec4583",
      "title": "Timing and Safety of Anticoagulation Reinitiation After Intracranial Hemorrhage in Patients With Mechanical Valves: A Meta-Analysis.",
      "journal": "Neurology",
      "score": "6/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117866",
      "dateReceived": "2025-10-16T23:20:44.402Z",
      "isNew": false
    },
    {
      "id": "9736b8d2f7c6",
      "title": "Dupilumab versus omalizumab in patients with chronic rhinosinusitis with nasal polyps and coexisting asthma (EVEREST): a multicentre, randomised, double-blind, head-to-head phase 4 trial.",
      "journal": "Lancet Respir Med",
      "score": "5/7",
      "tags": [
        "Allergy and Immunology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48530164/117797",
      "dateReceived": "2025-10-15T23:22:41.428Z",
      "isNew": false
    },
    {
      "id": "6c395a7cc0bf",
      "title": "Type 2 Diabetes Remission: A Systematic Review and Meta-analysis of Nonsurgical Randomized Controlled Trials.",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117801",
      "abstract": "Evidence that type 2 diabetes can be reversed has been limited by the understanding and implementation of these interventions. We assessed the effect of nonsurgical randomized controlled trials (RCTs) on type 2 diabetes remission and characterized core components. We reviewed articles from MEDLINE and Embase (inception to April 2025). RCTs of multimodal pharmacological or nonpharmacological type 2 diabetes remission interventions for adults with type 2 diabetes were included. Study characteristics and outcomes for clinical/population health, patient-reported, and adverse event were extracted. We performed a random-effects multilevel meta-analysis of studies, grouped based on type of intervention and by length of follow-up. A total of 18 studies were included in this review from 11 different countries. There was a higher likelihood of achieving type 2 diabetes remission through multimodal interventions (risk ratio [RR] 1.75 [95% CI 1.49-2.04]) and for nonpharmacological interventions (RR 5.80 [95% CI 4.28-7.87]), compared with the control group. Other significant outcomes for intervention groups compared with control groups included change in A1C, weight loss, and quality of life and improvements in adverse events of hypoglycemia. There was heterogeneity in our small pool of included studies (diversity of nonpharmacological components), stringent intervention protocols, narrow participant selection criteria, and lack of consistent diabetes remission definitions. With specific protocols, a variety of tailored approaches can induce type 2 diabetes remission for patients with newly diagnosed type 2 diabetes who are able to subscribe to strict protocols. Consideration of long-term sustainability and effectiveness is needed in future research, along with patient preferences.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Evidence that type 2 diabetes can be reversed has been limited by the understanding and implementation of these interventions."
        },
        {
          "label": "PURPOSE",
          "text": "We assessed the effect of nonsurgical randomized controlled trials (RCTs) on type 2 diabetes remission and characterized core components."
        },
        {
          "label": "DATA SOURCES",
          "text": "We reviewed articles from MEDLINE and Embase (inception to April 2025)."
        },
        {
          "label": "STUDY SELECTION",
          "text": "RCTs of multimodal pharmacological or nonpharmacological type 2 diabetes remission interventions for adults with type 2 diabetes were included."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Study characteristics and outcomes for clinical/population health, patient-reported, and adverse event were extracted."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "We performed a random-effects multilevel meta-analysis of studies, grouped based on type of intervention and by length of follow-up. A total of 18 studies were included in this review from 11 different countries. There was a higher likelihood of achieving type 2 diabetes remission through multimodal interventions (risk ratio [RR] 1.75 [95% CI 1.49-2.04]) and for nonpharmacological interventions (RR 5.80 [95% CI 4.28-7.87]), compared with the control group. Other significant outcomes for intervention groups compared with control groups included change in A1C, weight loss, and quality of life and improvements in adverse events of hypoglycemia."
        },
        {
          "label": "LIMITATIONS",
          "text": "There was heterogeneity in our small pool of included studies (diversity of nonpharmacological components), stringent intervention protocols, narrow participant selection criteria, and lack of consistent diabetes remission definitions."
        },
        {
          "label": "CONCLUSIONS",
          "text": "With specific protocols, a variety of tailored approaches can induce type 2 diabetes remission for patients with newly diagnosed type 2 diabetes who are able to subscribe to strict protocols. Consideration of long-term sustainability and effectiveness is needed in future research, along with patient preferences."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982327/",
      "pubDate": "2025 Sep 22",
      "doi": "10.2337/dc25-0562",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "Type 2 diabetes remission is achievable in newly diagnosed patients through strict, tailored protocols, but long-term sustainability and patient preferences require further investigation."
    },
    {
      "id": "a070501d41bd",
      "title": "Pharmacotherapy for mild hypertension.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117782",
      "abstract": "This is an update of a Cochrane review published in 2012 of initiation of antihypertensive monotherapy or step-up therapy in people with untreated mild hypertension (systolic blood pressure 140 to 159 mmHg or diastolic blood pressure 90 to 99 mmHg, or both) and no pre-existing cardiovascular disease. The original review demonstrated no difference in the incidence of all-cause mortality, total cardiovascular events (stroke, myocardial infarction, and congestive heart failure), stroke incidence, coronary heart disease, or withdrawal due to adverse effects (WDAEs). Evidence for antihypertensive pharmacotherapy in people with mild hypertension for primary prevention remains uncertain in the literature with conflicting studies. We therefore performed an update of the original Cochrane review to reassess whether initiation of antihypertensive pharmacotherapy compared to placebo or no treatment in people with untreated mild hypertension and no pre-existing cardiovascular disease reduces the risk of all-cause mortality, total cardiovascular events, stroke, coronary heart disease, or WDAEs. To reassess the efficacy and risks of initiating antihypertensive pharmacotherapy in adults with untreated mild hypertension and no pre-existing cardiovascular disease. The primary objective was to reassess the risk of all-cause mortality and total cardiovascular events (defined as fatal and non-fatal strokes, myocardial infarction, and congestive heart failure). The secondary objectives were to reassess the risk of stroke (fatal and non-fatal), coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs. We searched the Cochrane Hypertension Specialised Register, CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the World Health Organization International Clinical Trials Registry Platform from inception to June 2024. We included randomized controlled trials (RCTs) of at least one-year duration comparing initiation on antihypertensive monotherapy or step-up therapy, or both, versus placebo or no treatment in participants with mild hypertension and no pre-existing cardiovascular disease. Our critical outcomes were all-cause mortality and total cardiovascular events. Important outcomes were stroke, coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs. Two review authors assessed risk of bias independently and in duplicate using Cochrane's RoB 1 tool. Two review authors performed title and abstract screening, full-text review, and data extraction independently and in duplicate. We calculated risk ratio (RR) along with 95% confidence interval (CI) for all-cause mortality, total cardiovascular events, stroke events, coronary heart disease events, and WDAEs with the Mantel-Haenszel test and a fixed-effect model. We assessed the certainty of the evidence using the GRADE approach. We included five trials involving a total of 9124 participants, of whom 4593 received antihypertensives and 4531 received placebo or no treatment. All five trials reported all-cause mortality; four trials reported total cardiovascular events and strokes; three trials reported coronary heart disease; and one trial reported WDAEs. There may be little to no reduction in all-cause mortality (RR 0.85, 95% CI 0.64 to 1.14; 5 trials, 9124 participants; low-certainty evidence), total cardiovascular events (RR 0.93, 95% CI 0.69 to 1.24; 4 trials, 7292 participants; low-certainty evidence), or coronary heart disease (RR 1.12, 95% CI 0.80 to 1.57; 3 trials, 7080 participants; low-certainty evidence). There may be a decreased risk of stroke (RR 0.41, 95% CI 0.20 to 0.84; 4 trials, 7292 participants; low-certainty evidence) and an increase in WDAEs (RR 4.80, 95% CI 4.14 to 5.57; 1 trial, 17,354 participants; low-certainty evidence) with antihypertensives. We downgraded the certainty of evidence for all outcomes due to imprecision, indirectness, and risk of bias. In people with untreated mild hypertension and no pre-existing cardiovascular disease, initiation of antihypertensive monotherapy or step-up therapy may not reduce all-cause mortality, total cardiovascular events, or coronary heart disease compared to those who received placebo or no treatment. There may be a reduction in stroke, but possibly also an increase in WDAEs. CIHR Grant to the Hypertension Review Group and British Columbia Ministry of Health Grant to the Therapeutics Initiative. Protocol (2007): doi.org/10.1002/14651858.CD006742. Original review (2012): doi.org/10.1002/14651858.CD006742.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "This is an update of a Cochrane review published in 2012 of initiation of antihypertensive monotherapy or step-up therapy in people with untreated mild hypertension (systolic blood pressure 140 to 159 mmHg or diastolic blood pressure 90 to 99 mmHg, or both) and no pre-existing cardiovascular disease. The original review demonstrated no difference in the incidence of all-cause mortality, total cardiovascular events (stroke, myocardial infarction, and congestive heart failure), stroke incidence, coronary heart disease, or withdrawal due to adverse effects (WDAEs). Evidence for antihypertensive pharmacotherapy in people with mild hypertension for primary prevention remains uncertain in the literature with conflicting studies. We therefore performed an update of the original Cochrane review to reassess whether initiation of antihypertensive pharmacotherapy compared to placebo or no treatment in people with untreated mild hypertension and no pre-existing cardiovascular disease reduces the risk of all-cause mortality, total cardiovascular events, stroke, coronary heart disease, or WDAEs."
        },
        {
          "label": "OBJECTIVES",
          "text": "To reassess the efficacy and risks of initiating antihypertensive pharmacotherapy in adults with untreated mild hypertension and no pre-existing cardiovascular disease. The primary objective was to reassess the risk of all-cause mortality and total cardiovascular events (defined as fatal and non-fatal strokes, myocardial infarction, and congestive heart failure). The secondary objectives were to reassess the risk of stroke (fatal and non-fatal), coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Hypertension Specialised Register, CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the World Health Organization International Clinical Trials Registry Platform from inception to June 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) of at least one-year duration comparing initiation on antihypertensive monotherapy or step-up therapy, or both, versus placebo or no treatment in participants with mild hypertension and no pre-existing cardiovascular disease."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality and total cardiovascular events. Important outcomes were stroke, coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors assessed risk of bias independently and in duplicate using Cochrane's RoB 1 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors performed title and abstract screening, full-text review, and data extraction independently and in duplicate. We calculated risk ratio (RR) along with 95% confidence interval (CI) for all-cause mortality, total cardiovascular events, stroke events, coronary heart disease events, and WDAEs with the Mantel-Haenszel test and a fixed-effect model. We assessed the certainty of the evidence using the GRADE approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included five trials involving a total of 9124 participants, of whom 4593 received antihypertensives and 4531 received placebo or no treatment. All five trials reported all-cause mortality; four trials reported total cardiovascular events and strokes; three trials reported coronary heart disease; and one trial reported WDAEs."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "There may be little to no reduction in all-cause mortality (RR 0.85, 95% CI 0.64 to 1.14; 5 trials, 9124 participants; low-certainty evidence), total cardiovascular events (RR 0.93, 95% CI 0.69 to 1.24; 4 trials, 7292 participants; low-certainty evidence), or coronary heart disease (RR 1.12, 95% CI 0.80 to 1.57; 3 trials, 7080 participants; low-certainty evidence). There may be a decreased risk of stroke (RR 0.41, 95% CI 0.20 to 0.84; 4 trials, 7292 participants; low-certainty evidence) and an increase in WDAEs (RR 4.80, 95% CI 4.14 to 5.57; 1 trial, 17,354 participants; low-certainty evidence) with antihypertensives. We downgraded the certainty of evidence for all outcomes due to imprecision, indirectness, and risk of bias."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In people with untreated mild hypertension and no pre-existing cardiovascular disease, initiation of antihypertensive monotherapy or step-up therapy may not reduce all-cause mortality, total cardiovascular events, or coronary heart disease compared to those who received placebo or no treatment. There may be a reduction in stroke, but possibly also an increase in WDAEs."
        },
        {
          "label": "FUNDING",
          "text": "CIHR Grant to the Hypertension Review Group and British Columbia Ministry of Health Grant to the Therapeutics Initiative."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2007): doi.org/10.1002/14651858.CD006742. Original review (2012): doi.org/10.1002/14651858.CD006742.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40990196/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1002/14651858.CD006742.pub3",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "In individuals with untreated mild hypertension and no prior cardiovascular disease, starting antihypertensive medication may not improve overall survival or reduce cardiovascular events, though it might decrease stroke risk while potentially increasing adverse events."
    },
    {
      "id": "eeeeb9563f3a",
      "title": "Once-weekly semaglutide 7.2 mg in adults with obesity and type 2 diabetes (STEP UP T2D): a randomised, controlled, phase 3b trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117711",
      "abstract": "Semaglutide 2·4 mg is approved for weight management in adults with obesity or overweight in the presence of at least one obesity-related complication; however, many people with obesity and type 2 diabetes do not reach their bodyweight reduction goals with this dose. We aimed to investigate the efficacy and safety of a new 7·2 mg maintenance dose of once-weekly subcutaneous semaglutide in people with obesity and type 2 diabetes. STEP UP T2D was a randomised, phase 3b, double-blind controlled, three-arm, parallel-group trial conducted at 68 hospitals, specialist clinics, and medical centres in Bulgaria, Canada, Hungary, Poland, Portugal, Slovakia, South Africa, and the USA. Adults aged 18 years or older (BMI ≥30·0 kg/m, HbA 7·0-10·0% [53-86 mmol/mol]) were randomly assigned (3:1:1) to receive once-weekly subcutaneous semaglutide 7·2 mg, 2·4 mg, or placebo, alongside a lifestyle intervention, for 72 weeks. Coprimary endpoints were the percentage change in bodyweight and the proportion of participants reaching a bodyweight reduction of 5% or greater with semaglutide 7·2 mg versus placebo. Confirmatory secondary endpoints were the proportion of participants reaching a bodyweight reduction of 10% or greater, 15% or greater, and 20% or greater, and changes in waist circumference (cm) and HbA (%) with semaglutide 7·2 mg versus placebo. Efficacy was assessed in all randomly assigned participants, and safety was assessed in all randomly assigned participants who received at least one dose of the trial product. This trial is registered with ClinicalTrials.gov (NCT05649137) and is now closed and completed. Between Jan 4 and May 4, 2023, 512 participants were randomly assigned to receive semaglutide 7·2 mg (n=307), semaglutide 2·4 mg (n=103), or placebo (n=102). 265 (51·8%) of 512 participants were female, the mean age was 56 (SD 10) years, mean bodyweight was 110·1 (22·9) kg, mean BMI was 38·6 (7·1) kg/m, and mean HbA was 8·1% (0·9). Compared with placebo, semaglutide 7·2 mg led to greater reductions in mean bodyweight (-13·2% vs -3·9%; estimated treatment difference [ETD] -9·3% [95% CI -11·0 to -7·7]; p<0·0001); more participants reaching bodyweight reductions of 5% or greater (odds ratio 10·0 [95% CI 6·0 to 16·9]; p<0·0001), 10% or greater (11·3 [5·9 to 21·4]; p<0·0001), 15% or greater (8·1 [3·7 to 17·7]; p<0·0001), and 20% or greater (12·3 [3·0 to 51·0]; p=0·0006); and reduced waist circumference (ETD -6·5 cm [95% CI -9·0 to -4·1]; p<0·0001) and HbA (ETD -1·5% [95% CI -1·8 to -1·2]; p<0·0001). Level 2-3 hypoglycaemia risk was low and comparable between semaglutide doses and placebo. Gastrointestinal events were reported by 163 (53·1%) of 307 participants with semaglutide 7·2 mg, 53 (51·5%) of 103 participants with semaglutide 2·4 mg, 26 (25·5%) of 102 participants with placebo; and serious adverse events were reported by 28 (9·1%) participants with semaglutide 7·2 mg, nine (8·7%) participants with semaglutide 2·4 mg, and nine (8·8%) participants with placebo. Dysaesthesia was more common with semaglutide 7·2 mg (58 [18·9%] of 307) versus 2·4 mg (five [4·9%] of 103) and placebo (none). Among people with obesity and type 2 diabetes, semaglutide 7·2 mg was superior to placebo in reducing bodyweight, waist circumference, and HbA. Safety and tolerability were comparable between semaglutide 7·2 mg and 2·4 mg, except for the imbalance in dysaesthesia. Novo Nordisk. For the Bulgarian, Hungarian and Polish translations of the abstract see Supplementary Materials section.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Semaglutide 2·4 mg is approved for weight management in adults with obesity or overweight in the presence of at least one obesity-related complication; however, many people with obesity and type 2 diabetes do not reach their bodyweight reduction goals with this dose. We aimed to investigate the efficacy and safety of a new 7·2 mg maintenance dose of once-weekly subcutaneous semaglutide in people with obesity and type 2 diabetes."
        },
        {
          "label": "METHODS",
          "text": "STEP UP T2D was a randomised, phase 3b, double-blind controlled, three-arm, parallel-group trial conducted at 68 hospitals, specialist clinics, and medical centres in Bulgaria, Canada, Hungary, Poland, Portugal, Slovakia, South Africa, and the USA. Adults aged 18 years or older (BMI ≥30·0 kg/m, HbA 7·0-10·0% [53-86 mmol/mol]) were randomly assigned (3:1:1) to receive once-weekly subcutaneous semaglutide 7·2 mg, 2·4 mg, or placebo, alongside a lifestyle intervention, for 72 weeks. Coprimary endpoints were the percentage change in bodyweight and the proportion of participants reaching a bodyweight reduction of 5% or greater with semaglutide 7·2 mg versus placebo. Confirmatory secondary endpoints were the proportion of participants reaching a bodyweight reduction of 10% or greater, 15% or greater, and 20% or greater, and changes in waist circumference (cm) and HbA (%) with semaglutide 7·2 mg versus placebo. Efficacy was assessed in all randomly assigned participants, and safety was assessed in all randomly assigned participants who received at least one dose of the trial product. This trial is registered with ClinicalTrials.gov (NCT05649137) and is now closed and completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between Jan 4 and May 4, 2023, 512 participants were randomly assigned to receive semaglutide 7·2 mg (n=307), semaglutide 2·4 mg (n=103), or placebo (n=102). 265 (51·8%) of 512 participants were female, the mean age was 56 (SD 10) years, mean bodyweight was 110·1 (22·9) kg, mean BMI was 38·6 (7·1) kg/m, and mean HbA was 8·1% (0·9). Compared with placebo, semaglutide 7·2 mg led to greater reductions in mean bodyweight (-13·2% vs -3·9%; estimated treatment difference [ETD] -9·3% [95% CI -11·0 to -7·7]; p<0·0001); more participants reaching bodyweight reductions of 5% or greater (odds ratio 10·0 [95% CI 6·0 to 16·9]; p<0·0001), 10% or greater (11·3 [5·9 to 21·4]; p<0·0001), 15% or greater (8·1 [3·7 to 17·7]; p<0·0001), and 20% or greater (12·3 [3·0 to 51·0]; p=0·0006); and reduced waist circumference (ETD -6·5 cm [95% CI -9·0 to -4·1]; p<0·0001) and HbA (ETD -1·5% [95% CI -1·8 to -1·2]; p<0·0001). Level 2-3 hypoglycaemia risk was low and comparable between semaglutide doses and placebo. Gastrointestinal events were reported by 163 (53·1%) of 307 participants with semaglutide 7·2 mg, 53 (51·5%) of 103 participants with semaglutide 2·4 mg, 26 (25·5%) of 102 participants with placebo; and serious adverse events were reported by 28 (9·1%) participants with semaglutide 7·2 mg, nine (8·7%) participants with semaglutide 2·4 mg, and nine (8·8%) participants with placebo. Dysaesthesia was more common with semaglutide 7·2 mg (58 [18·9%] of 307) versus 2·4 mg (five [4·9%] of 103) and placebo (none)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Among people with obesity and type 2 diabetes, semaglutide 7·2 mg was superior to placebo in reducing bodyweight, waist circumference, and HbA. Safety and tolerability were comparable between semaglutide 7·2 mg and 2·4 mg, except for the imbalance in dysaesthesia."
        },
        {
          "label": "FUNDING",
          "text": "Novo Nordisk."
        },
        {
          "label": "TRANSLATIONS",
          "text": "For the Bulgarian, Hungarian and Polish translations of the abstract see Supplementary Materials section."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40961953/",
      "pubDate": "2025 Sep 14",
      "doi": "10.1016/S2213-8587(25)00225-6",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "Semaglutide 7.2 mg demonstrated superior efficacy in weight reduction compared to placebo in adults with obesity and type 2 diabetes."
    },
    {
      "id": "fa62b78ea636",
      "title": "Cardiovascular Effects and Tolerability of GLP-1 Receptor Agonists: A Systematic Review and Meta-Analysis of 99,599 Patients.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117706",
      "abstract": "Glucagon-like peptide-1 receptor agonists (GLP-1 RAs) have demonstrated significant cardiovascular (CV) benefits, particularly in patients with diabetes mellitus, but the safety and efficacy of different GLP-1 RAs across diverse populations remain insufficiently defined. Previous meta-analyses of GLP-1 RAs have been limited by restricted populations, omission of recent trials, or incomplete safety synthesis; this study integrates the latest evidence across 21 randomized controlled trials and diverse populations using advanced meta-analytic methods. Randomized controlled trials comparing GLP-1 RAs vs controls or placebo were included. Analyses were conducted in prespecified subgroups based on the GLP-1 RA used. Prespecified subgroups according to diabetes mellitus, kidney function, obesity, or heart failure were also performed. Main outcomes comprised mortality (all-cause and CV), trial-defined major adverse cardiovascular events (MACE) and serious adverse events. GRADE (Grading of Recommendations Assessment, Development and Evaluation) and trial sequential analyses were performed to evaluate certainty and conclusiveness of findings, respectively. A total of 21 trials encompassing 99,599 patients were included. Eight different GLP-1 RAs were used (lixisenatide, liraglutide, exenatide, semaglutide, efpeglenatide, dulaglutide, albiglutide, and tirzepatide), each administered at therapeutic doses and compared vs placebo or controls. Mean follow-up duration was 2.4 years. We found conclusive, high-certainty evidence that GLP-1 RAs reduced all-cause death (incidence rate ratio [IRR]: 0.88; 95% CI: 0.84-0.92; needed to treat [NNT] = 121), CV death (IRR: 0.87; 95% CI: 0.81-0.92; NNT = 170), and MACE (IRR: 0.87; 95% CI: 0.83-0.91; NNT = 66), compared with controls. GLP-1 RAs reduced serious adverse events (-9%), myocardial infarction (-15%), acute kidney failure (-9%), heart failure (-15%), and infections (-10%), but increased gastrointestinal (+63%) and gallbladder (+26%) disorders. There were no differences in stroke, pancreatitis, or neoplasm between groups. Results were mostly consistent across subgroups. Analysis by GLP-1 RA type revealed potential differences in efficacy and safety profiles. GLP-1 RAs reduce mortality and MACE in high-risk populations, highlighting benefits beyond glycemic control. These come at increased gastrointestinal and gallbladder risks. Variation in efficacy and tolerability supports tailoring GLP-1 RA therapy to individual patient characteristics and treatment goals. (PROSPERO [GLP-1 RAs Reduce Mortality and Cardiovascular Events Across the Spectrum of Treated Patients: A Systematic Review and Meta-Analysis; CRD420251032222]).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Glucagon-like peptide-1 receptor agonists (GLP-1 RAs) have demonstrated significant cardiovascular (CV) benefits, particularly in patients with diabetes mellitus, but the safety and efficacy of different GLP-1 RAs across diverse populations remain insufficiently defined."
        },
        {
          "label": "OBJECTIVES",
          "text": "Previous meta-analyses of GLP-1 RAs have been limited by restricted populations, omission of recent trials, or incomplete safety synthesis; this study integrates the latest evidence across 21 randomized controlled trials and diverse populations using advanced meta-analytic methods."
        },
        {
          "label": "METHODS",
          "text": "Randomized controlled trials comparing GLP-1 RAs vs controls or placebo were included. Analyses were conducted in prespecified subgroups based on the GLP-1 RA used. Prespecified subgroups according to diabetes mellitus, kidney function, obesity, or heart failure were also performed. Main outcomes comprised mortality (all-cause and CV), trial-defined major adverse cardiovascular events (MACE) and serious adverse events. GRADE (Grading of Recommendations Assessment, Development and Evaluation) and trial sequential analyses were performed to evaluate certainty and conclusiveness of findings, respectively."
        },
        {
          "label": "RESULTS",
          "text": "A total of 21 trials encompassing 99,599 patients were included. Eight different GLP-1 RAs were used (lixisenatide, liraglutide, exenatide, semaglutide, efpeglenatide, dulaglutide, albiglutide, and tirzepatide), each administered at therapeutic doses and compared vs placebo or controls. Mean follow-up duration was 2.4 years. We found conclusive, high-certainty evidence that GLP-1 RAs reduced all-cause death (incidence rate ratio [IRR]: 0.88; 95% CI: 0.84-0.92; needed to treat [NNT] = 121), CV death (IRR: 0.87; 95% CI: 0.81-0.92; NNT = 170), and MACE (IRR: 0.87; 95% CI: 0.83-0.91; NNT = 66), compared with controls. GLP-1 RAs reduced serious adverse events (-9%), myocardial infarction (-15%), acute kidney failure (-9%), heart failure (-15%), and infections (-10%), but increased gastrointestinal (+63%) and gallbladder (+26%) disorders. There were no differences in stroke, pancreatitis, or neoplasm between groups. Results were mostly consistent across subgroups. Analysis by GLP-1 RA type revealed potential differences in efficacy and safety profiles."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1 RAs reduce mortality and MACE in high-risk populations, highlighting benefits beyond glycemic control. These come at increased gastrointestinal and gallbladder risks. Variation in efficacy and tolerability supports tailoring GLP-1 RA therapy to individual patient characteristics and treatment goals. (PROSPERO [GLP-1 RAs Reduce Mortality and Cardiovascular Events Across the Spectrum of Treated Patients: A Systematic Review and Meta-Analysis; CRD420251032222])."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892610/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.027",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists (RAs) decrease mortality and major adverse cardiovascular events (MACE) in high-risk patients, but are associated with increased gastrointestinal and gallbladder risks, necessitating individualized treatment approaches."
    },
    {
      "id": "8a69227157df",
      "title": "Efficacy and safety of tirzepatide in children and adolescents with type 2 diabetes (SURPASS-PEDS): a randomised, double-blind, placebo-controlled, phase 3 trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117668",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false
    },
    {
      "id": "1b042009b0a9",
      "title": "Transcatheter or Surgical Treatment of Patients With Aortic Stenosis at Low to Intermediate Risk: An Individual Participant Data Meta-Analysis.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117652",
      "abstract": "Transcatheter aortic valve replacement (TAVR) reintervention is performed by either redo TAVR or TAVR explant. There is insufficient data on contemporary TAVR reintervention procedural incidence and volume. To evaluate contemporary procedural volumes of redo TAVR and TAVR explant. This retrospective analysis of redo TAVR and TAVR explant annual incidence and procedural volume was performed from January 2012 to June 2024. For comprehensive assessment of aortic valve replacement, analysis of SAVR reintervention annual incidence and procedural volume was also performed. Data were obtained through the US Centers for Medicare & Medicaid Services Virtual Research Data Center. Patients with prior TAVR or SAVR who underwent subsequent TAVR or SAVR were included. Patients who underwent a TAVR after TAVR defined the redo TAVR group, while patients who underwent SAVR after TAVR defined the TAVR explant group. Patients who underwent a TAVR after SAVR defined the valve-in-valve (ViV) TAVR group, while patients who underwent SAVR after SAVR defined the redo SAVR group. Analysis of annual incidences and procedural volumes of all groups at different time intervals was conducted. The primary outcome was annual incidence and procedural volume of both redo TAVR and TAVR explant. The secondary outcome was annual incidence and procedural volume of both ViV TAVR and redo SAVR. Of 410 720 total TAVRs from 2012 to 2024, 2374 redo TAVRs and 1346 TAVR explants were identified. Of 299 780 total SAVRs from 2012 to 2024, 5044 ViV-TAVRs and 4202 redo SAVRs were identified. Since 2020, there have been 1518 redo TAVRs and 1007 TAVR explants. The annual incidence of TAVR reintervention has changed from 0.17% in 2019 to 0.28% in 2023. Although the most common time interval for redo TAVR after index TAVR was within 3 months (410 of 2374 [17.3%]) and for TAVR explant after index TAVR was 1 to 2 years (259 of 1346 [19.2%]), redo TAVR was the predominant procedure beyond 5 years from the index TAVR (725 of 819 [88.5%]). In this study, annual volumes of both redo TAVR and TAVR explant continued to increase, particularly in recent years. Redo TAVR is frequently performed over 5 years from the index TAVR. Future analysis to determine the appropriate TAVR reintervention strategy for individual patients is needed.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Transcatheter aortic valve replacement (TAVR) reintervention is performed by either redo TAVR or TAVR explant. There is insufficient data on contemporary TAVR reintervention procedural incidence and volume."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate contemporary procedural volumes of redo TAVR and TAVR explant."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This retrospective analysis of redo TAVR and TAVR explant annual incidence and procedural volume was performed from January 2012 to June 2024. For comprehensive assessment of aortic valve replacement, analysis of SAVR reintervention annual incidence and procedural volume was also performed. Data were obtained through the US Centers for Medicare & Medicaid Services Virtual Research Data Center. Patients with prior TAVR or SAVR who underwent subsequent TAVR or SAVR were included."
        },
        {
          "label": "EXPOSURES",
          "text": "Patients who underwent a TAVR after TAVR defined the redo TAVR group, while patients who underwent SAVR after TAVR defined the TAVR explant group. Patients who underwent a TAVR after SAVR defined the valve-in-valve (ViV) TAVR group, while patients who underwent SAVR after SAVR defined the redo SAVR group. Analysis of annual incidences and procedural volumes of all groups at different time intervals was conducted."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was annual incidence and procedural volume of both redo TAVR and TAVR explant. The secondary outcome was annual incidence and procedural volume of both ViV TAVR and redo SAVR."
        },
        {
          "label": "RESULTS",
          "text": "Of 410 720 total TAVRs from 2012 to 2024, 2374 redo TAVRs and 1346 TAVR explants were identified. Of 299 780 total SAVRs from 2012 to 2024, 5044 ViV-TAVRs and 4202 redo SAVRs were identified. Since 2020, there have been 1518 redo TAVRs and 1007 TAVR explants. The annual incidence of TAVR reintervention has changed from 0.17% in 2019 to 0.28% in 2023. Although the most common time interval for redo TAVR after index TAVR was within 3 months (410 of 2374 [17.3%]) and for TAVR explant after index TAVR was 1 to 2 years (259 of 1346 [19.2%]), redo TAVR was the predominant procedure beyond 5 years from the index TAVR (725 of 819 [88.5%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this study, annual volumes of both redo TAVR and TAVR explant continued to increase, particularly in recent years. Redo TAVR is frequently performed over 5 years from the index TAVR. Future analysis to determine the appropriate TAVR reintervention strategy for individual patients is needed."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40991268/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1001/jamacardio.2025.3224",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "Both redo TAVR and TAVR explant procedures are increasing, with redo TAVR often occurring more than five years after the initial procedure, necessitating further research into personalized reintervention strategies."
    },
    {
      "id": "f9d2d78e4e39",
      "title": "Rifasutenizol-based triple therapy versus bismuth plus clarithromycin-based triple therapy for first-line treatment of Helicobacter pylori infection in China (EVEREST-HP): a phase 3, multicentre, randomised, triple-dummy, double-blind, controlled, non-inferiority trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Gastroenterology",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48419814/117759",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false
    },
    {
      "id": "50226d1651d7",
      "title": "Once-weekly semaglutide 7.2 mg in adults with obesity (STEP UP): a randomised, controlled, phase 3b trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48419814/117710",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false
    },
    {
      "id": "213c5e7d7455",
      "title": "Safety of Factor XI Inhibition With Abelacimab in Atrial Fibrillation by Kidney Function: A Prespecified Analysis of the AZALEA-TIMI 71 Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48419814/117656",
      "abstract": "Chronic kidney disease is common in patients with atrial fibrillation (AF) and is associated with higher rates of bleeding with anticoagulation. In the AZALEA-TIMI 71 randomized clinical trial, abelacimab, a novel factor XI inhibitor, reduced rates of major or clinically relevant nonmajor (CRNM) bleeding compared with rivaroxaban in patients with AF. To examine the safety of abelacimab vs rivaroxaban across a range of kidney function. The AZALEA-TIMI 71 study randomized patients with AF to 1 of 2 abelacimab doses (150 mg or 90 mg monthly) or to rivaroxaban, with stratification by creatinine clearance (CrCl). Patients with CrCl less than 15 mL/min or receiving dialysis were excluded. This secondary analysis of AZALEA-TIMI 71 examines outcomes by randomized treatment and CrCl at randomization. Patients randomized to rivaroxaban with a CrCl greater than 50 mL/min received rivaroxaban, 20 mg, daily, and those with a CrCl of 50 mL/min or less received rivaroxaban, 15 mg, daily. Patients randomized to abelacimab received the assigned dose irrespective of CrCl. The primary outcome was major bleeding or CRNM bleeding. Among 1284 patients, median (IQR) age was 74 (69-78) years and 572 patients (44.5%) were female. Median (IQR) CrCl was 71 (54-90) mL/min, with 264 patients (20.6%) having a CrCl of 50 mL/min or less. In the rivaroxaban group, patients with CrCl of 50 mL/min or less experienced higher rates of major or CRNM bleeding compared with those with CrCl greater than 50 mL/min despite dose reduction (incidence rates, 13.6 vs 7.0 per 100 person-years). Abelacimab reduced major or CRNM bleeding vs rivaroxaban irrespective of CrCl (CrCl ≤50 mL/min: hazard ratio [HR], 0.26; 95% CI, 0.12-0.54; >50 mL/min: HR, 0.40; 95% CI, 0.26-0.62; P value for interaction = .33), with absolute risk reductions of 10.1 vs 4.2 per 100 person-years in those with CrCl of 50 mL/min or less vs greater than 50 mL/min, respectively (P value for interaction = .09). This risk reduction was consistent for major bleeding alone and for a broader composite inclusive of major, CRNM, and minor bleeding. Results were similar when comparing the individual abelacimab doses to rivaroxaban. In this secondary analysis of the AZALEA-TIMI 71 randomized clinical trial, abelacimab consistently reduced the risk of bleeding relative to rivaroxaban irrespective of kidney function. These findings suggest that abelacimab may offer a particularly favorable safety profile among those with chronic kidney disease; however, larger studies are necessary to characterize the efficacy of abelacimab for stroke prevention in AF.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Chronic kidney disease is common in patients with atrial fibrillation (AF) and is associated with higher rates of bleeding with anticoagulation. In the AZALEA-TIMI 71 randomized clinical trial, abelacimab, a novel factor XI inhibitor, reduced rates of major or clinically relevant nonmajor (CRNM) bleeding compared with rivaroxaban in patients with AF."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine the safety of abelacimab vs rivaroxaban across a range of kidney function."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The AZALEA-TIMI 71 study randomized patients with AF to 1 of 2 abelacimab doses (150 mg or 90 mg monthly) or to rivaroxaban, with stratification by creatinine clearance (CrCl). Patients with CrCl less than 15 mL/min or receiving dialysis were excluded. This secondary analysis of AZALEA-TIMI 71 examines outcomes by randomized treatment and CrCl at randomization."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients randomized to rivaroxaban with a CrCl greater than 50 mL/min received rivaroxaban, 20 mg, daily, and those with a CrCl of 50 mL/min or less received rivaroxaban, 15 mg, daily. Patients randomized to abelacimab received the assigned dose irrespective of CrCl."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURE",
          "text": "The primary outcome was major bleeding or CRNM bleeding."
        },
        {
          "label": "RESULTS",
          "text": "Among 1284 patients, median (IQR) age was 74 (69-78) years and 572 patients (44.5%) were female. Median (IQR) CrCl was 71 (54-90) mL/min, with 264 patients (20.6%) having a CrCl of 50 mL/min or less. In the rivaroxaban group, patients with CrCl of 50 mL/min or less experienced higher rates of major or CRNM bleeding compared with those with CrCl greater than 50 mL/min despite dose reduction (incidence rates, 13.6 vs 7.0 per 100 person-years). Abelacimab reduced major or CRNM bleeding vs rivaroxaban irrespective of CrCl (CrCl ≤50 mL/min: hazard ratio [HR], 0.26; 95% CI, 0.12-0.54; >50 mL/min: HR, 0.40; 95% CI, 0.26-0.62; P value for interaction = .33), with absolute risk reductions of 10.1 vs 4.2 per 100 person-years in those with CrCl of 50 mL/min or less vs greater than 50 mL/min, respectively (P value for interaction = .09). This risk reduction was consistent for major bleeding alone and for a broader composite inclusive of major, CRNM, and minor bleeding. Results were similar when comparing the individual abelacimab doses to rivaroxaban."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this secondary analysis of the AZALEA-TIMI 71 randomized clinical trial, abelacimab consistently reduced the risk of bleeding relative to rivaroxaban irrespective of kidney function. These findings suggest that abelacimab may offer a particularly favorable safety profile among those with chronic kidney disease; however, larger studies are necessary to characterize the efficacy of abelacimab for stroke prevention in AF."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888686/",
      "pubDate": "2025 Sep 01",
      "doi": "10.1001/jamacardio.2025.3393",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "Abelacimab demonstrated a reduced bleeding risk compared to rivaroxaban across varying levels of kidney function."
    },
    {
      "id": "45ad6293436f",
      "title": "Misoprostol for intrauterine device placement.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Gynecology",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48408725/117776",
      "abstract": "Identifying effective approaches to reduce pain and improve providers' ease of intrauterine device (IUD) placement may reduce barriers to IUD access and use. The cervical softening and dilation effects of misoprostol might make IUD placement less painful for women and technically easier for providers. However, evidence suggests that misoprostol does not improve many outcomes and may only be helpful for some patients (e.g. those with a recent failed IUD placement). To examine the effect of misoprostol for routine IUD placement on patient and provider outcomes compared to placebo or no treatment. In November 2021 we searched CENTRAL, MEDLINE, Embase, Cumulative Index to Nursing and Allied Health Literature (CINAHL), and ClinicalTrials.gov. We conducted update searches in July 2022 and September 2024. We searched the World Health Organization International Clinical Trials Registry Platform (WHO ICTRP) in July 2025. We included randomized controlled trials (RCTs) of women undergoing interval IUD placement (i.e. placement outside the postabortion or postpartum period) that compared misoprostol to placebo or no treatment. We included trials that examined the placement of currently available levonorgestrel (LNG)-releasing IUDs, or any copper T IUD, for women of any age, of any parity, and for any indication. Our core critical and important outcomes were pain (during tenaculum placement, during IUD placement, and after IUD placement before clinic discharge); providers' ease of placement; need for cervical dilation; placement success; patient satisfaction; misoprostol side effects (preplacement abdominal pain or cramping, and diarrhea); and adverse events (vasovagal reaction). We used the Risk of Bias 2 tool (RoB 2) to assess the risk of bias for outcomes. We synthesized results for each outcome using meta-analysis. We calculated mean differences (MD) for continuous outcomes using inverse variance estimation and random-effects models. We calculated risk ratios (RR) for dichotomous outcomes using Mantel-Haenszel estimation and random-effects models. We used GRADE to assess the certainty of evidence for each outcome. We included 14 RCTs with a total of 1972 women. The trials were conducted in North America, South America, Europe and Africa, and were published between 2007 and 2022. The results below summarize the effect of misoprostol on outcomes compared to placebo or no treatment. Pain: misoprostol results in little to no difference in pain during tenaculum placement (MD -0.73, 95% confidence interval [CI] -1.19 to -0.28; 3 RCTs, 261 women; high-certainty evidence) and after IUD placement before clinic discharge (MD -0.01, 95% CI -0.45 to 0.43; 5 RCTs, 448 women; high-certainty evidence). Misoprostol may result in little to no difference in pain during IUD placement (MD -0.47, 95% CI -1.23 to 0.29; 7 RCTs, 766 women; low-certainty evidence). Providers' ease of placement: misoprostol may result in little to no difference in a clinically meaningful effect on ease of IUD placement for providers (MD -0.89, 95% CI -1.55 to -0.22; 8 RCTs, 848 women; low-certainty evidence). Need for cervical dilation: misoprostol may result in little to no difference in need for cervical dilation for women without a recent failed placement attempt (RR 0.84, 95% CI 0.38 to 1.85; 6 RCTs, 562 women; low-certainty evidence). Misoprostol probably results in little to no difference in need for cervical dilation for women with a recent failed placement attempt (RR 0.88, 95% CI 0.56 to 1.36; 1 RCT, 90 women; moderate-certainty evidence). Placement success: misoprostol probably results in little to no difference in placement success for women without a recent failed placement attempt (RR 1.01, 95% CI 0.98 to 1.04; 12 RCTs, 1579 women; moderate-certainty evidence) but probably results in a slight increase in placement success for women with a recent failed placement attempt (RR 1.41, 95% CI 1.09 to 1.83; 1 RCT, 90 women; moderate-certainty evidence). Patient satisfaction: misoprostol may increase women's satisfaction with the IUD placement procedure, but the evidence is very uncertain (MD 2.00, 95% CI -0.05 to 4.06; 2 RCTs, 226 women; very low-certainty evidence) Misoprostol side effects before clinic discharge: misoprostol probably results in an increase in preplacement abdominal pain or cramping (RR 2.14, 95% CI 1.42 to 3.23; 7 RCTs, 781 women; moderate-certainty evidence)and probably results in a slight increase in diarrhea (RR 1.76, 95% CI 1.01 to 3.06; 9 RCTs, 940 women; moderate-certainty evidence). Adverse events before clinic discharge: misoprostol may result in little to no difference in vasovagal reaction (RR 0.94, 95% CI 0.37 to 2.37; 6 RCTs [3 RCTs had 0 events], 780 women; low-certainty evidence). We downgraded the evidence due to serious concerns about inconsistency and serious or very serious concerns about imprecision. Evidence from RCTs of women seeking routine IUD placement suggests that receiving misoprostol compared to placebo or no treatment makes little to no difference to pain during tenaculum placement or after IUD placement; and may make little to no difference to pain during IUD placement. Misoprostol may make little to no difference to reduced vasovagal reaction, improved providers' ease of placement, or reduced need for cervical dilation; and probably makes little to no difference to placement success, except for women with a recent failed IUD placement attempt, where misoprostol probably leads to a clinically meaningful increase in placement success. Misoprostol use probably leads to clinically important increases in harms, specifically preplacement abdominal pain or cramping and diarrhea. Misoprostol may increase patient satisfaction with the IUD placement procedure, but the evidence is very uncertain. The number of available RCTs did not support examining effect modifiers such as prior vaginal delivery status, misoprostol dose, or IUD type. This review was supported in part by an appointment to the Research Participation Program at the Centers for Disease Control and Prevention (CDC) administered by the Oak Ridge Institute for Science and Education. Protocol (2022): doi.org/10.1002/14651858.CD015584.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Identifying effective approaches to reduce pain and improve providers' ease of intrauterine device (IUD) placement may reduce barriers to IUD access and use. The cervical softening and dilation effects of misoprostol might make IUD placement less painful for women and technically easier for providers. However, evidence suggests that misoprostol does not improve many outcomes and may only be helpful for some patients (e.g. those with a recent failed IUD placement)."
        },
        {
          "label": "OBJECTIVES",
          "text": "To examine the effect of misoprostol for routine IUD placement on patient and provider outcomes compared to placebo or no treatment."
        },
        {
          "label": "SEARCH METHODS",
          "text": "In November 2021 we searched CENTRAL, MEDLINE, Embase, Cumulative Index to Nursing and Allied Health Literature (CINAHL), and ClinicalTrials.gov. We conducted update searches in July 2022 and September 2024. We searched the World Health Organization International Clinical Trials Registry Platform (WHO ICTRP) in July 2025."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) of women undergoing interval IUD placement (i.e. placement outside the postabortion or postpartum period) that compared misoprostol to placebo or no treatment. We included trials that examined the placement of currently available levonorgestrel (LNG)-releasing IUDs, or any copper T IUD, for women of any age, of any parity, and for any indication."
        },
        {
          "label": "OUTCOMES",
          "text": "Our core critical and important outcomes were pain (during tenaculum placement, during IUD placement, and after IUD placement before clinic discharge); providers' ease of placement; need for cervical dilation; placement success; patient satisfaction; misoprostol side effects (preplacement abdominal pain or cramping, and diarrhea); and adverse events (vasovagal reaction)."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Risk of Bias 2 tool (RoB 2) to assess the risk of bias for outcomes."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesized results for each outcome using meta-analysis. We calculated mean differences (MD) for continuous outcomes using inverse variance estimation and random-effects models. We calculated risk ratios (RR) for dichotomous outcomes using Mantel-Haenszel estimation and random-effects models. We used GRADE to assess the certainty of evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 14 RCTs with a total of 1972 women. The trials were conducted in North America, South America, Europe and Africa, and were published between 2007 and 2022."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "The results below summarize the effect of misoprostol on outcomes compared to placebo or no treatment. Pain: misoprostol results in little to no difference in pain during tenaculum placement (MD -0.73, 95% confidence interval [CI] -1.19 to -0.28; 3 RCTs, 261 women; high-certainty evidence) and after IUD placement before clinic discharge (MD -0.01, 95% CI -0.45 to 0.43; 5 RCTs, 448 women; high-certainty evidence). Misoprostol may result in little to no difference in pain during IUD placement (MD -0.47, 95% CI -1.23 to 0.29; 7 RCTs, 766 women; low-certainty evidence). Providers' ease of placement: misoprostol may result in little to no difference in a clinically meaningful effect on ease of IUD placement for providers (MD -0.89, 95% CI -1.55 to -0.22; 8 RCTs, 848 women; low-certainty evidence). Need for cervical dilation: misoprostol may result in little to no difference in need for cervical dilation for women without a recent failed placement attempt (RR 0.84, 95% CI 0.38 to 1.85; 6 RCTs, 562 women; low-certainty evidence). Misoprostol probably results in little to no difference in need for cervical dilation for women with a recent failed placement attempt (RR 0.88, 95% CI 0.56 to 1.36; 1 RCT, 90 women; moderate-certainty evidence). Placement success: misoprostol probably results in little to no difference in placement success for women without a recent failed placement attempt (RR 1.01, 95% CI 0.98 to 1.04; 12 RCTs, 1579 women; moderate-certainty evidence) but probably results in a slight increase in placement success for women with a recent failed placement attempt (RR 1.41, 95% CI 1.09 to 1.83; 1 RCT, 90 women; moderate-certainty evidence). Patient satisfaction: misoprostol may increase women's satisfaction with the IUD placement procedure, but the evidence is very uncertain (MD 2.00, 95% CI -0.05 to 4.06; 2 RCTs, 226 women; very low-certainty evidence) Misoprostol side effects before clinic discharge: misoprostol probably results in an increase in preplacement abdominal pain or cramping (RR 2.14, 95% CI 1.42 to 3.23; 7 RCTs, 781 women; moderate-certainty evidence)and probably results in a slight increase in diarrhea (RR 1.76, 95% CI 1.01 to 3.06; 9 RCTs, 940 women; moderate-certainty evidence). Adverse events before clinic discharge: misoprostol may result in little to no difference in vasovagal reaction (RR 0.94, 95% CI 0.37 to 2.37; 6 RCTs [3 RCTs had 0 events], 780 women; low-certainty evidence). We downgraded the evidence due to serious concerns about inconsistency and serious or very serious concerns about imprecision."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Evidence from RCTs of women seeking routine IUD placement suggests that receiving misoprostol compared to placebo or no treatment makes little to no difference to pain during tenaculum placement or after IUD placement; and may make little to no difference to pain during IUD placement. Misoprostol may make little to no difference to reduced vasovagal reaction, improved providers' ease of placement, or reduced need for cervical dilation; and probably makes little to no difference to placement success, except for women with a recent failed IUD placement attempt, where misoprostol probably leads to a clinically meaningful increase in placement success. Misoprostol use probably leads to clinically important increases in harms, specifically preplacement abdominal pain or cramping and diarrhea. Misoprostol may increase patient satisfaction with the IUD placement procedure, but the evidence is very uncertain. The number of available RCTs did not support examining effect modifiers such as prior vaginal delivery status, misoprostol dose, or IUD type."
        },
        {
          "label": "FUNDING",
          "text": "This review was supported in part by an appointment to the Research Participation Program at the Centers for Disease Control and Prevention (CDC) administered by the Oak Ridge Institute for Science and Education."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2022): doi.org/10.1002/14651858.CD015584."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40985300/",
      "pubDate": "2025 Sep 23",
      "doi": "10.1002/14651858.CD015584.pub2",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false,
      "summary": "Misoprostol offers little to no benefit for pain or placement success during routine IUD insertion, except for women with a recent failed attempt, but likely increases harms like abdominal pain and diarrhea."
    },
    {
      "id": "377c6801c0cf",
      "title": "A clinical decision tool including a decision tree, point-of-care testing of CRP, and safety-netting advice to guide antibiotic prescribing in acutely ill children in primary care in Belgium (ARON): a pragmatic, cluster-randomised, controlled trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48408725/117734",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": false
    },
    {
      "id": "edc6dfd54fd0",
      "title": "Using ``HINTS family`` to diagnose stroke in the acute vestibular syndrome: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48520543/117852",
      "abstract": "Acute vestibular syndrome (AVS) often arises from benign peripheral causes, yet the critical need to distinguish dangerous causes, notably stroke, persists. The Head Impulse test, Nystagmus, Test of Skew (HINTS) examination has emerged as a bedside test to identify stroke. HINTS plus hearing loss and video-oculography-HINTS (v-HINTS) have gained traction for stroke diagnosis. This systematic review and meta-analysis aims to assess the accuracy of the \"HINTS family\" of tests (HINTS, HINTS plus, v-HINTS) in diagnosing stroke in AVS. We searched PubMed, Embase, Web of Science, and Cochrane library for prospective studies involving AVS patients diagnosed using MRI and/or CT as the gold standard. Two authors independently screened articles, extracted data, and assessed study quality using QUADAS-2. A meta-analysis was performed using STATA (12.0) and RevMan 5.3. We included 11 studies in the analysis: 11 for HINTS (n = 1286), 2 for HINTS plus (n = 265), and 1 for v-HINTS (n = 50). Their sensitivities for stroke were 0.97 (95 %CI: 0.94-0.99), 0.99 (0.95-1.00) and 1.00, with specificities of 0.81 (0.72-0.88), 0.82 (0.74-0.88), and 0.90, respectively. LR+ for stroke were 5.2 (95 %CI: 3.3-8.2), 5.5 (3.8-8.2) and 9.75. Youden index were 0.78, 0.81 and 0.90. The AUC for HINTS and HINTS plus in diagnosing stroke were 0.98 and 0.99. \"HINTS Family\" examinations are generally effective in detecting stroke in AVS patients, especially those with stroke risk factors. HINTS plus outperforms the HINTS examination. Furthermore, v-HINTS exhibits the highest accuracy, highlighting the importance of using VOG devices for acute stroke diagnosis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Acute vestibular syndrome (AVS) often arises from benign peripheral causes, yet the critical need to distinguish dangerous causes, notably stroke, persists. The Head Impulse test, Nystagmus, Test of Skew (HINTS) examination has emerged as a bedside test to identify stroke. HINTS plus hearing loss and video-oculography-HINTS (v-HINTS) have gained traction for stroke diagnosis. This systematic review and meta-analysis aims to assess the accuracy of the \"HINTS family\" of tests (HINTS, HINTS plus, v-HINTS) in diagnosing stroke in AVS."
        },
        {
          "label": "METHOD",
          "text": "We searched PubMed, Embase, Web of Science, and Cochrane library for prospective studies involving AVS patients diagnosed using MRI and/or CT as the gold standard. Two authors independently screened articles, extracted data, and assessed study quality using QUADAS-2. A meta-analysis was performed using STATA (12.0) and RevMan 5.3."
        },
        {
          "label": "RESULTS",
          "text": "We included 11 studies in the analysis: 11 for HINTS (n = 1286), 2 for HINTS plus (n = 265), and 1 for v-HINTS (n = 50). Their sensitivities for stroke were 0.97 (95 %CI: 0.94-0.99), 0.99 (0.95-1.00) and 1.00, with specificities of 0.81 (0.72-0.88), 0.82 (0.74-0.88), and 0.90, respectively. LR+ for stroke were 5.2 (95 %CI: 3.3-8.2), 5.5 (3.8-8.2) and 9.75. Youden index were 0.78, 0.81 and 0.90. The AUC for HINTS and HINTS plus in diagnosing stroke were 0.98 and 0.99."
        },
        {
          "label": "CONCLUSION",
          "text": "\"HINTS Family\" examinations are generally effective in detecting stroke in AVS patients, especially those with stroke risk factors. HINTS plus outperforms the HINTS examination. Furthermore, v-HINTS exhibits the highest accuracy, highlighting the importance of using VOG devices for acute stroke diagnosis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41045791/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1016/j.ajem.2025.08.066",
      "dateReceived": "2025-10-14T23:23:18.336Z",
      "isNew": false,
      "summary": "In patients with acute vestibular syndrome (AVS), the HINTS family of examinations effectively detects stroke, with v-HINTS using video-oculography (VOG) being the most accurate."
    },
    {
      "id": "db35cc31563f",
      "title": "Synchronised approach for intrauterine insemination in subfertile couples.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Gynecology",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48520543/117777",
      "abstract": "Intrauterine insemination (IUI) is widely used as a first-line treatment for subfertile couples with favourable prognostic factors, yet pregnancy rates vary considerably. The optimal method for timing IUI - whether through different monitoring strategies or ovulation triggering techniques in natural or stimulated cycles - remains uncertain. This review explores which timing approaches and methods of ovulation monitoring and triggering lead to the best outcomes, including live birth and clinical pregnancy. It updates a Cochrane review last published in 2014. To evaluate the effectiveness of different methods of synchronisation of insemination with ovulation on live birth or ongoing pregnancy, in natural and stimulated cycles for IUI in subfertile couples. We used the Cochrane Gynaecology and Fertility Group specialised register, CENTRAL, MEDLINE, and two other databases, along with reference checking, citation searching, handsearching of conference abstracts, and contact with study authors to identify the studies included in the review. The latest search date was October 2023. We included randomised controlled trials (RCTs) comparing timing methods in natural or stimulated cycles, and different ovulation triggering methods. These included: varying the time interval between ovulation triggering and insemination, luteinising hormone (LH) detection in urine, LH detection in blood, basal body temperature charts, ultrasound detection of ovulation, human chorionic gonadotropin (hCG) administration, a combination of LH detection and hCG administration, gonadotropin-releasing hormone (GnRH) agonist administration, and other trigger administrations. Critical outcome: live birth or ongoing pregnancy rate per couple. Important outcomes (all are rate per couple): clinical pregnancy; multiple pregnancy; miscarriage; ovarian hyperstimulation syndrome; tubal pregnancy. We used the Cochrane Collaboration's original tool to assess the risk of bias in the included RCTs. After the search, we screened the trials, extracted the data, and assessed the risk of bias and trustworthiness of the included studies. We synthesised results for each outcome using meta-analysis where possible. We expressed results for each included study as Mantel-Haenszel odds ratios (OR) with 95% confidence intervals (CI). We used GRADE to assess the certainty of the evidence for each outcome. This review update includes 42 studies: 18 from the 2014 version, plus 24 studies newly identified in the updated search. Of the 42 included studies (a total of 6603 couples), we included seven in the primary meta-analyses (1917 couples) and 12 in the sensitivity meta-analyses (2143 couples). The certainty of the evidence was low for most comparisons. The main limitation of the evidence was serious imprecision. Of the seven studies included in the primary analyses, two compared the optimum time interval from hCG injection to IUI for live birth or ongoing pregnancy rate, comparing different time frames ranging from 0 to 48 hours. We categorised the time frames into three groups: (i) 0 to 33 hours; (ii) 34 to 40 hours; and (iii) more than 40 hours. We compared 0 to 33 hours versus 34 to 40 hours, and 34 to 40 hours versus more than 40 hours. Results were too imprecise to be informative in both comparisons (0 to 33 hours versus 34 to 40 hours: OR 1.42, 95% CI 0.90 to 2.23; 1 study, 374 couples; 34 to 40 hours versus more than 40 hours: OR 0.45, 95% CI 0.15 to 1.33; 1 study, 107 couples). We included one study in the primary analysis for each of the following comparisons: hCG versus LH surge; recombinant hCG versus urinary hCG; and hCG alone versus hCG plus follicle-stimulating hormone (FSH). It is unclear whether there might be a difference in live birth or ongoing pregnancy rates in the first two comparisons: hCG versus LH surge: OR 1.08, 95% CI 0.50 to 2.37; 1 study, 392 couples; low-certainty evidence; recombinant hCG versus urinary hCG: OR 1.13, 95% CI 0.49 to 2.63; 1 study, 125 couples; low-certainty evidence. However, live birth or ongoing pregnancy rates may be lower with hCG alone compared to hCG plus FSH (OR 0.35, 95% CI 0.13 to 0.95; 1 study, 108 couples; low-certainty evidence). We found no clear evidence of a difference between any of the groups in clinical pregnancy rate or adverse events (multiple pregnancy rate, miscarriage rate, tubal pregnancy rate). However, all results were of low-certainty evidence. None of the studies included in the primary analyses reported on ovarian hyperstimulation syndrome. There is insufficient evidence to determine whether there is any difference in effectiveness between different methods of synchronisation of ovulation and insemination. This Cochrane review had no dedicated funding. First review update (2014): doi.org/10.1002/14651858.CD006942.pub3 Review (2010): doi.org/10.1002/14651858.CD006942.pub2 Protocol (2008): doi.org/10.1002/14651858.CD006942.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Intrauterine insemination (IUI) is widely used as a first-line treatment for subfertile couples with favourable prognostic factors, yet pregnancy rates vary considerably. The optimal method for timing IUI - whether through different monitoring strategies or ovulation triggering techniques in natural or stimulated cycles - remains uncertain. This review explores which timing approaches and methods of ovulation monitoring and triggering lead to the best outcomes, including live birth and clinical pregnancy. It updates a Cochrane review last published in 2014."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the effectiveness of different methods of synchronisation of insemination with ovulation on live birth or ongoing pregnancy, in natural and stimulated cycles for IUI in subfertile couples."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used the Cochrane Gynaecology and Fertility Group specialised register, CENTRAL, MEDLINE, and two other databases, along with reference checking, citation searching, handsearching of conference abstracts, and contact with study authors to identify the studies included in the review. The latest search date was October 2023."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) comparing timing methods in natural or stimulated cycles, and different ovulation triggering methods. These included: varying the time interval between ovulation triggering and insemination, luteinising hormone (LH) detection in urine, LH detection in blood, basal body temperature charts, ultrasound detection of ovulation, human chorionic gonadotropin (hCG) administration, a combination of LH detection and hCG administration, gonadotropin-releasing hormone (GnRH) agonist administration, and other trigger administrations."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcome: live birth or ongoing pregnancy rate per couple. Important outcomes (all are rate per couple): clinical pregnancy; multiple pregnancy; miscarriage; ovarian hyperstimulation syndrome; tubal pregnancy."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane Collaboration's original tool to assess the risk of bias in the included RCTs."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "After the search, we screened the trials, extracted the data, and assessed the risk of bias and trustworthiness of the included studies. We synthesised results for each outcome using meta-analysis where possible. We expressed results for each included study as Mantel-Haenszel odds ratios (OR) with 95% confidence intervals (CI). We used GRADE to assess the certainty of the evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This review update includes 42 studies: 18 from the 2014 version, plus 24 studies newly identified in the updated search."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Of the 42 included studies (a total of 6603 couples), we included seven in the primary meta-analyses (1917 couples) and 12 in the sensitivity meta-analyses (2143 couples). The certainty of the evidence was low for most comparisons. The main limitation of the evidence was serious imprecision. Of the seven studies included in the primary analyses, two compared the optimum time interval from hCG injection to IUI for live birth or ongoing pregnancy rate, comparing different time frames ranging from 0 to 48 hours. We categorised the time frames into three groups: (i) 0 to 33 hours; (ii) 34 to 40 hours; and (iii) more than 40 hours. We compared 0 to 33 hours versus 34 to 40 hours, and 34 to 40 hours versus more than 40 hours. Results were too imprecise to be informative in both comparisons (0 to 33 hours versus 34 to 40 hours: OR 1.42, 95% CI 0.90 to 2.23; 1 study, 374 couples; 34 to 40 hours versus more than 40 hours: OR 0.45, 95% CI 0.15 to 1.33; 1 study, 107 couples). We included one study in the primary analysis for each of the following comparisons: hCG versus LH surge; recombinant hCG versus urinary hCG; and hCG alone versus hCG plus follicle-stimulating hormone (FSH). It is unclear whether there might be a difference in live birth or ongoing pregnancy rates in the first two comparisons: hCG versus LH surge: OR 1.08, 95% CI 0.50 to 2.37; 1 study, 392 couples; low-certainty evidence; recombinant hCG versus urinary hCG: OR 1.13, 95% CI 0.49 to 2.63; 1 study, 125 couples; low-certainty evidence. However, live birth or ongoing pregnancy rates may be lower with hCG alone compared to hCG plus FSH (OR 0.35, 95% CI 0.13 to 0.95; 1 study, 108 couples; low-certainty evidence). We found no clear evidence of a difference between any of the groups in clinical pregnancy rate or adverse events (multiple pregnancy rate, miscarriage rate, tubal pregnancy rate). However, all results were of low-certainty evidence. None of the studies included in the primary analyses reported on ovarian hyperstimulation syndrome."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is insufficient evidence to determine whether there is any difference in effectiveness between different methods of synchronisation of ovulation and insemination."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "First review update (2014): doi.org/10.1002/14651858.CD006942.pub3 Review (2010): doi.org/10.1002/14651858.CD006942.pub2 Protocol (2008): doi.org/10.1002/14651858.CD006942."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40985294/",
      "pubDate": "2025 Sep 23",
      "doi": "10.1002/14651858.CD006942.pub4",
      "dateReceived": "2025-10-14T23:23:18.336Z",
      "isNew": false,
      "summary": "The effectiveness of different methods for synchronizing ovulation and insemination remains uncertain due to a lack of sufficient evidence."
    },
    {
      "id": "46f7744e59ac",
      "title": "Fractional flow reserve-guided renal artery stenting in atherosclerotic renovascular hypertension: the FAIR randomized trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48513868/117847",
      "abstract": "The optimal therapy for patients with atherosclerotic renal artery stenosis (ARAS) remains unresolved. This study compared the efficacy of renal fractional flow reserve (FFR)-guided revascularization and traditional angiography-guided revascularization. In total, 101 patients with ARAS and hypertension were randomly assigned to either the FFR-guided or angiography-guided group (ClinicalTrials.gov identifier: NCT05732077). Stenting was performed in the angiography-guided group regardless of FFR, whereas stenting was only performed in the FFR-guided group for patients with FFR < 0.80. The primary endpoints were the percentage changes in ambulatory daytime mean systolic blood pressure (DMSBP) and composite index of antihypertensive medicines (CIAHM) after 3 months. The percentage changes in DMSBP (4% [-2%, 11%] vs 4% [-3%, 10%]; P = .97) and CIAHM (0% [0%, 3%] vs 1% [0%, 4%]; P = .33) did not differ between groups. However, the rate of stenting was significantly lower in the FFR-guided group (46.0% vs 100.0%, P < .01). Moreover, compared with the findings in patients with FFR ≥ 0.80 who did not receive stenting, stenting was beneficial in patients with FFR < 0.80 (adjusted mean DMSBP reduction, 6.2 [95% confidence interval {CI}, 0.6-11.9] mmHg; mean CIAHM reduction, 3.1 [95% CI, 1.5-4.7]), but not in those with FFR ≥ 0.80 (1.4 [95% CI, -4.5-7.2] mmHg, and 0.7 [95% CI, -1.1-2.5], respectively). FFR-guided revascularization significantly reduced unnecessary stenting compared with angiography-guided revascularization. Both blood pressure and antihypertensive medication usage decreased significantly after stenting in patients with FFR < 0.80.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "The optimal therapy for patients with atherosclerotic renal artery stenosis (ARAS) remains unresolved. This study compared the efficacy of renal fractional flow reserve (FFR)-guided revascularization and traditional angiography-guided revascularization."
        },
        {
          "label": "METHODS",
          "text": "In total, 101 patients with ARAS and hypertension were randomly assigned to either the FFR-guided or angiography-guided group (ClinicalTrials.gov identifier: NCT05732077). Stenting was performed in the angiography-guided group regardless of FFR, whereas stenting was only performed in the FFR-guided group for patients with FFR < 0.80. The primary endpoints were the percentage changes in ambulatory daytime mean systolic blood pressure (DMSBP) and composite index of antihypertensive medicines (CIAHM) after 3 months."
        },
        {
          "label": "RESULTS",
          "text": "The percentage changes in DMSBP (4% [-2%, 11%] vs 4% [-3%, 10%]; P = .97) and CIAHM (0% [0%, 3%] vs 1% [0%, 4%]; P = .33) did not differ between groups. However, the rate of stenting was significantly lower in the FFR-guided group (46.0% vs 100.0%, P < .01). Moreover, compared with the findings in patients with FFR ≥ 0.80 who did not receive stenting, stenting was beneficial in patients with FFR < 0.80 (adjusted mean DMSBP reduction, 6.2 [95% confidence interval {CI}, 0.6-11.9] mmHg; mean CIAHM reduction, 3.1 [95% CI, 1.5-4.7]), but not in those with FFR ≥ 0.80 (1.4 [95% CI, -4.5-7.2] mmHg, and 0.7 [95% CI, -1.1-2.5], respectively)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "FFR-guided revascularization significantly reduced unnecessary stenting compared with angiography-guided revascularization. Both blood pressure and antihypertensive medication usage decreased significantly after stenting in patients with FFR < 0.80."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41056188/",
      "pubDate": "2025 Oct 07",
      "doi": "10.1093/eurheartj/ehaf746",
      "dateReceived": "2025-10-13T23:21:57.925Z",
      "isNew": false,
      "summary": "FFR-guided revascularization reduced unnecessary stenting and led to improved blood pressure control in patients with functionally significant stenosis."
    },
    {
      "id": "b2ce1033dac6",
      "title": "AGA Clinical Practice Guideline on Management of Gastroparesis.",
      "journal": "Gastroenterology",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48505184/117682",
      "abstract": "Gastroparesis is a complex gastric motility disorder characterized by nausea, vomiting, and other symptoms associated with a delay in gastric emptying in the absence of mechanical obstruction. Variations in diagnostic testing and limited effective treatments make caring for this patient population challenging. The American Gastroenterological Association developed this guideline to provide recommendations for ensuring an accurate diagnosis and identifying evidence-based, effective treatments among the available pharmacologic and procedural interventions for patients with idiopathic gastroparesis or gastroparesis related to diabetes. The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and develop this guideline. The Guideline Panel prioritized clinical questions and outcomes, conducted an evidence review, and used the Evidence to Decision Framework to develop recommendations. The Guideline Panel agreed on 12 recommendations. A conditional recommendation was issued against using 2-hour gastric emptying testing and in favor of 4-hour testing in patients with suspected gastroparesis. There are conditional recommendations for the use of metoclopramide and erythromycin in patients with gastroparesis. Conditional recommendations were issued against the use of domperidone, prucalopride, aprepitant, nortriptyline, buspirone, and cannabidiol as first-line therapies. In addition, conditional recommendations were issued against the routine initial use of gastric per-oral endoscopic pyloromyotomy or gastric electrical stimulation in patients with gastroparesis, reserving these treatments for select patients with symptoms refractory to medical therapies. No recommendation was given regarding the use of surgical pyloromyotomy and surgical pyloroplasty, which were identified as procedures with knowledge gaps in their use for treatment for gastroparesis. The diagnosis of gastroparesis requires the use of 4-hour gastric emptying tests. Metoclopramide or erythromycin is appropriate for initial pharmacologic treatment. Other treatment recommendations require shared patient-physician decision making. There are still considerable unmet needs in the treatment of gastroparesis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Gastroparesis is a complex gastric motility disorder characterized by nausea, vomiting, and other symptoms associated with a delay in gastric emptying in the absence of mechanical obstruction. Variations in diagnostic testing and limited effective treatments make caring for this patient population challenging. The American Gastroenterological Association developed this guideline to provide recommendations for ensuring an accurate diagnosis and identifying evidence-based, effective treatments among the available pharmacologic and procedural interventions for patients with idiopathic gastroparesis or gastroparesis related to diabetes."
        },
        {
          "label": "METHODS",
          "text": "The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and develop this guideline. The Guideline Panel prioritized clinical questions and outcomes, conducted an evidence review, and used the Evidence to Decision Framework to develop recommendations."
        },
        {
          "label": "RESULTS",
          "text": "The Guideline Panel agreed on 12 recommendations. A conditional recommendation was issued against using 2-hour gastric emptying testing and in favor of 4-hour testing in patients with suspected gastroparesis. There are conditional recommendations for the use of metoclopramide and erythromycin in patients with gastroparesis. Conditional recommendations were issued against the use of domperidone, prucalopride, aprepitant, nortriptyline, buspirone, and cannabidiol as first-line therapies. In addition, conditional recommendations were issued against the routine initial use of gastric per-oral endoscopic pyloromyotomy or gastric electrical stimulation in patients with gastroparesis, reserving these treatments for select patients with symptoms refractory to medical therapies. No recommendation was given regarding the use of surgical pyloromyotomy and surgical pyloroplasty, which were identified as procedures with knowledge gaps in their use for treatment for gastroparesis."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The diagnosis of gastroparesis requires the use of 4-hour gastric emptying tests. Metoclopramide or erythromycin is appropriate for initial pharmacologic treatment. Other treatment recommendations require shared patient-physician decision making. There are still considerable unmet needs in the treatment of gastroparesis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40976635/",
      "pubDate": "2025 Oct",
      "doi": "10.1053/j.gastro.2025.08.004",
      "dateReceived": "2025-10-12T23:21:43.657Z",
      "isNew": false,
      "summary": "Gastroparesis diagnosis relies on 4-hour gastric emptying tests, with metoclopramide or erythromycin as initial drug options, and further treatment decisions should be made collaboratively."
    }
  ]
}