{
  "updated_at": "2025-12-12T23:26:36.263Z",
  "articles": [
    {
      "id": "b82605debfe5",
      "title": "Decongestants and antihistamines for acute otitis media in children.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118330",
      "abstract": "Acute otitis media (AOM) is one of the most common bacterial infections in children worldwide, and the most common reason for prescribing antibiotics. Although serious complications (e.g. mastoiditis or meningitis) are rare, the infection causes acute pain and can lead to hearing impairment. Since AOM often resolves spontaneously, current treatment guidelines recommend an approach of watchful waiting (no initial antibiotics). However, decongestants and antihistamines, administered orally or nasally, might reduce inflammation and mucosal oedema in the middle ear and help resolve AOM in children. To assess the benefits and harms of decongestants and antihistamines in treating acute otitis media in children. We searched CENTRAL, MEDLINE, Embase, CINAHL, the World Health Organization (WHO) trials portal, and ClinicalTrials.gov in February 2025. We checked reference lists of relevant articles for additional studies. We included randomised controlled trials (RCTs) with children (from any setting) with AOM. Eligible comparisons were decongestants versus no intervention or placebo, antihistamines versus no intervention or placebo, decongestants plus antihistamines versus no intervention or placebo, decongestants versus antihistamines, one decongestant versus another, and one antihistamine versus another. The route of administration could be oral or nasal. Our critical outcomes were presence of AOM within seven days from starting treatment, severe complications (e.g. mastoiditis, meningitis, sinus thrombosis, facial paralysis, labyrinthitis), any adverse events (e.g. drowsiness), otalgia (yes/no) within seven days from starting treatment, and otalgia (score) within seven days from starting treatment. Our important outcomes included the presence of otitis media with effusion (OME) within 10 to 14 days from starting treatment. Two review authors used the Cochrane risk of bias tool (RoB 2) to independently assess risk of bias. We used standard Cochrane methods. We evaluated the benefits and harms using a random-effects model, calculating risk ratios (RRs) and risk differences (RDs) with 95% confidence intervals (CIs) for dichotomous outcomes, and mean differences (MDs) or standardised mean differences (SMDs) for continuous outcomes. Where the results could not be pooled due to the nature of the data, we described them narratively. We assessed the certainty of evidence using the GRADE approach. We identified 15 studies (3066 participants) conducted in the USA (11 studies), Denmark (2 studies), Canada (1 study), and the UK (1 study), and published between 1965 and 2003. In 12 studies, the children's ages ranged from three months to 15 years. One study also included a few adults aged up to 40 years, and one study may have also included adults aged 18 years. Participants received concomitant antibiotics in 12 studies. Four studies evaluated decongestants versus placebo or no intervention. Four studies evaluated antihistamines versus placebo or no intervention. Two studies contained three parallel treatment arms (decongestants versus antihistamines versus placebo). Three studies compared combinations of decongestants and antihistamines to placebo or no intervention. Two studies contained four parallel treatment arms (combinations of decongestants and antihistamines versus decongestants versus antihistamines versus placebo). Decongestants versus placebo or no intervention 1. No studies reported the presence of AOM within seven days. 2. Evidence from one study suggests that decongestants may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of decongestants on any adverse events compared to placebo (RR 3.60, 95% CI 0.16 to 83.28; I² = 71%; 3 studies, 296 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of decongestants on otalgia within seven days compared to placebo (RR 3.24, 95% CI 0.14 to 75.91; 1 study, 50 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. The evidence is very uncertain about the effect of decongestants on the presence of OME within 10 to 14 days compared to placebo (RR 0.83, 95% CI 0.53 to 1.29; I² = 0%; 2 studies, 239 participants; very low-certainty evidence). Another study, excluded from the meta-analysis, reported OME at 14 days after starting treatment, with 46/101 events in the decongestant group and 34/94 events in the placebo group. The certainty of evidence was low to very low mainly due to study limitations (risk of bias), inconsistency, and imprecision. Antihistamines versus placebo or no intervention 1. The evidence is very uncertain about the effect of antihistamines on the presence of AOM within seven days compared to placebo (RR 1.05, 95% CI 0.32 to 3.36; 1 study, 90 participants; very low-certainty evidence). 2. Evidence from one study suggests that antihistamines may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of antihistamines on any adverse events compared to placebo (RR 7.00, 95% CI 0.37 to 133.12; I² = not applicable; 2 studies, 192 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of antihistamines on otalgia within seven days compared to placebo (RR 3.52, 95% CI 0.15 to 82.34; 1 study, 48 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. Antihistamines may result in little to no difference in the presence of OME within 10 to 14 days compared to placebo (RR 1.13, 95% CI 0.89 to 1.45, I² = 0%; 3 studies, 439 participants; low-certainty evidence). The certainty of evidence was low to very low, mainly due to study limitations (risk of bias) and imprecision. The evidence is very uncertain about the benefits and harms of oral or nasal decongestants or antihistamines for children with AOM. No relevant trials have been published since 2003. No studies are ongoing. This Cochrane review received no dedicated funding. Protocol (2023): doi.org/10.1002/14651858.CD015839.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Acute otitis media (AOM) is one of the most common bacterial infections in children worldwide, and the most common reason for prescribing antibiotics. Although serious complications (e.g. mastoiditis or meningitis) are rare, the infection causes acute pain and can lead to hearing impairment. Since AOM often resolves spontaneously, current treatment guidelines recommend an approach of watchful waiting (no initial antibiotics). However, decongestants and antihistamines, administered orally or nasally, might reduce inflammation and mucosal oedema in the middle ear and help resolve AOM in children."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of decongestants and antihistamines in treating acute otitis media in children."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, CINAHL, the World Health Organization (WHO) trials portal, and ClinicalTrials.gov in February 2025. We checked reference lists of relevant articles for additional studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) with children (from any setting) with AOM. Eligible comparisons were decongestants versus no intervention or placebo, antihistamines versus no intervention or placebo, decongestants plus antihistamines versus no intervention or placebo, decongestants versus antihistamines, one decongestant versus another, and one antihistamine versus another. The route of administration could be oral or nasal."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were presence of AOM within seven days from starting treatment, severe complications (e.g. mastoiditis, meningitis, sinus thrombosis, facial paralysis, labyrinthitis), any adverse events (e.g. drowsiness), otalgia (yes/no) within seven days from starting treatment, and otalgia (score) within seven days from starting treatment. Our important outcomes included the presence of otitis media with effusion (OME) within 10 to 14 days from starting treatment."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors used the Cochrane risk of bias tool (RoB 2) to independently assess risk of bias."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We used standard Cochrane methods. We evaluated the benefits and harms using a random-effects model, calculating risk ratios (RRs) and risk differences (RDs) with 95% confidence intervals (CIs) for dichotomous outcomes, and mean differences (MDs) or standardised mean differences (SMDs) for continuous outcomes. Where the results could not be pooled due to the nature of the data, we described them narratively. We assessed the certainty of evidence using the GRADE approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We identified 15 studies (3066 participants) conducted in the USA (11 studies), Denmark (2 studies), Canada (1 study), and the UK (1 study), and published between 1965 and 2003. In 12 studies, the children's ages ranged from three months to 15 years. One study also included a few adults aged up to 40 years, and one study may have also included adults aged 18 years. Participants received concomitant antibiotics in 12 studies. Four studies evaluated decongestants versus placebo or no intervention. Four studies evaluated antihistamines versus placebo or no intervention. Two studies contained three parallel treatment arms (decongestants versus antihistamines versus placebo). Three studies compared combinations of decongestants and antihistamines to placebo or no intervention. Two studies contained four parallel treatment arms (combinations of decongestants and antihistamines versus decongestants versus antihistamines versus placebo)."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Decongestants versus placebo or no intervention 1. No studies reported the presence of AOM within seven days. 2. Evidence from one study suggests that decongestants may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of decongestants on any adverse events compared to placebo (RR 3.60, 95% CI 0.16 to 83.28; I² = 71%; 3 studies, 296 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of decongestants on otalgia within seven days compared to placebo (RR 3.24, 95% CI 0.14 to 75.91; 1 study, 50 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. The evidence is very uncertain about the effect of decongestants on the presence of OME within 10 to 14 days compared to placebo (RR 0.83, 95% CI 0.53 to 1.29; I² = 0%; 2 studies, 239 participants; very low-certainty evidence). Another study, excluded from the meta-analysis, reported OME at 14 days after starting treatment, with 46/101 events in the decongestant group and 34/94 events in the placebo group. The certainty of evidence was low to very low mainly due to study limitations (risk of bias), inconsistency, and imprecision. Antihistamines versus placebo or no intervention 1. The evidence is very uncertain about the effect of antihistamines on the presence of AOM within seven days compared to placebo (RR 1.05, 95% CI 0.32 to 3.36; 1 study, 90 participants; very low-certainty evidence). 2. Evidence from one study suggests that antihistamines may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of antihistamines on any adverse events compared to placebo (RR 7.00, 95% CI 0.37 to 133.12; I² = not applicable; 2 studies, 192 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of antihistamines on otalgia within seven days compared to placebo (RR 3.52, 95% CI 0.15 to 82.34; 1 study, 48 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. Antihistamines may result in little to no difference in the presence of OME within 10 to 14 days compared to placebo (RR 1.13, 95% CI 0.89 to 1.45, I² = 0%; 3 studies, 439 participants; low-certainty evidence). The certainty of evidence was low to very low, mainly due to study limitations (risk of bias) and imprecision."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "The evidence is very uncertain about the benefits and harms of oral or nasal decongestants or antihistamines for children with AOM. No relevant trials have been published since 2003. No studies are ongoing."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review received no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2023): doi.org/10.1002/14651858.CD015839."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41307300/",
      "pubDate": "2025 Nov 27",
      "doi": "10.1002/14651858.CD015839.pub2",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "61982d7f4281",
      "title": "Management of Chronic Post-Herniorrhaphy Pain: A Systematic Review.",
      "journal": "Pain Physician",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118326",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "3732aea626ae",
      "title": "Comparison of the Efficacy of Conventional Radiofrequency to Intraarticular Steroid Injections for Advanced Hip Osteoarthritis: A Randomized Trial.",
      "journal": "Pain Physician",
      "score": "5/7",
      "tags": [
        "Rheumatology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118320",
      "abstract": "Osteoarthritis (OA) is characterized by the destruction of the articular cartilage and narrowing of the joint space and bone formations around the joint due to mechanical, genetic, and inflammatory causes. The hip joints are some of the most commonly affected in OA. Hip OA is also known as coxarthrosis. This study aimed to compare the effects of conventional radiofrequency (RF) to those of intraarticular steroid treatment methods on pain, limitations, and quality of life in patients who had advanced OA of the hip and could not undergo surgery for any reason. The study was designed as a randomized, prospective single-center study. A total of 40 patients with advanced primary hip OA who met the inclusion criteria were included in the study. Patients were randomized into 2 groups, each of which included 20 individuals. One group received conventional (thermal) radiofrequency ablation (RFA) to the femoral and obturator sensory branches of the hip, while the other group received intraarticular steroid injections in their hips. Scores on the Visual Analog Scale (VAS) and the physical-function component of the Medical Outcomes Study Short Form Health Survey (SF-36) were completed before, one month after, and 3 months after the procedure. The VAS was recorded both at rest and during activity. Each patient's gender, body mass index (BMI), affected hip side, duration of pain, and previous treatments for the hip were recorded, as were the procedure-related complications each patient experienced. Forty patients were followed up on for 3 months. The analysis revealed that at both one month and 3 months after treatment, the 2 groups of patients showed a significant improvement in their scores on the resting VAS, activity VAS, and physical-function component of the SF-36 from the pre-procedure values (P < 0.05). As for resting VAS scores in the hip intraarticular steroid injection (HIASI) group and activity VAS scores in the thermal radiofrequency ablation (TRFA) group, there was a statistically significant difference between the groups at one month and 3 months after the procedure, respectively (P < 0.05). This study found a statistically significant correlation between hip stage and age, but no significant correlation was found for gender and weight. No difference between the groups appeared in the complications related to the procedure at the 3-month follow-up. The follow-up period was relatively short. The sample size was small, and to avoid neuritis, a half dose of triamcinolone acetonide was given to the patients in the TRFA group. Conventional RF is more effective at treating the symptoms of advanced coxarthrosis than are intraarticular steroids, based on observations of the activity in the 3-month follow-up of patients with the condition.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Osteoarthritis (OA) is characterized by the destruction of the articular cartilage and narrowing of the joint space and bone formations around the joint due to mechanical, genetic, and inflammatory causes. The hip joints are some of the most commonly affected in OA. Hip OA is also known as coxarthrosis."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study aimed to compare the effects of conventional radiofrequency (RF) to those of intraarticular steroid treatment methods on pain, limitations, and quality of life in patients who had advanced OA of the hip and could not undergo surgery for any reason."
        },
        {
          "label": "STUDY DESIGN",
          "text": "The study was designed as a randomized, prospective single-center study."
        },
        {
          "label": "SETTING",
          "text": "A total of 40 patients with advanced primary hip OA who met the inclusion criteria were included in the study."
        },
        {
          "label": "METHODS",
          "text": "Patients were randomized into 2 groups, each of which included 20 individuals. One group received conventional (thermal) radiofrequency ablation (RFA) to the femoral and obturator sensory branches of the hip, while the other group received intraarticular steroid injections in their hips. Scores on the Visual Analog Scale (VAS) and the physical-function component of the Medical Outcomes Study Short Form Health Survey (SF-36) were completed before, one month after, and 3 months after the procedure. The VAS was recorded both at rest and during activity. Each patient's gender, body mass index (BMI), affected hip side, duration of pain, and previous treatments for the hip were recorded, as were the procedure-related complications each patient experienced."
        },
        {
          "label": "RESULTS",
          "text": "Forty patients were followed up on for 3 months. The analysis revealed that at both one month and 3 months after treatment, the 2 groups of patients showed a significant improvement in their scores on the resting VAS, activity VAS, and physical-function component of the SF-36 from the pre-procedure values (P < 0.05). As for resting VAS scores in the hip intraarticular steroid injection (HIASI) group and activity VAS scores in the thermal radiofrequency ablation (TRFA) group, there was a statistically significant difference between the groups at one month and 3 months after the procedure, respectively (P < 0.05). This study found a statistically significant correlation between hip stage and age, but no significant correlation was found for gender and weight. No difference between the groups appeared in the complications related to the procedure at the 3-month follow-up."
        },
        {
          "label": "LIMITATIONS",
          "text": "The follow-up period was relatively short. The sample size was small, and to avoid neuritis, a half dose of triamcinolone acetonide was given to the patients in the TRFA group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Conventional RF is more effective at treating the symptoms of advanced coxarthrosis than are intraarticular steroids, based on observations of the activity in the 3-month follow-up of patients with the condition."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41337764/",
      "pubDate": "2025 Nov",
      "doi": "",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "b3a138abd0e7",
      "title": "Exercise training in hypertrophic cardiomyopathy: a meta-analysis of randomised trials with trial sequential analysis.",
      "journal": "Heart",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118284",
      "abstract": "Hypertrophic cardiomyopathy (HCM) is a leading cause of sudden cardiac death (SCD) among young individuals and athletes. Despite increasing evidence supporting exercise, uncertainty remains about its safety and efficacy in this population. We systematically reviewed randomised controlled trials (RCTs) comparing structured exercise interventions with usual care in patients with HCM. The primary outcome was peak oxygen consumption (pVO₂). Random-effects meta-analysis and trial sequential analysis (TSA) were applied to assess efficacy and robustness of evidence. Four RCTs (n=290) were included, enrolling predominantly low-risk, non-obstructive HCM patients with mild functional limitation (mean left ventricular ejection fraction (LVEF) 66%). Exercise improved pVO₂ (mean difference (MD) 1.81 mL/kg/min; 95% CI 1.01 to 2.61; p<0.01), confirmed by TSA. Exercise also reduced left ventricular wall thickness (MD -0.56 mm; 95% CI -0.97 to -0.16) and body mass index (MD -0.65 kg/m²; 95% CI -1.05 to -0.25) without significant changes in LVEF or left ventricular outflow gradients. No increase was observed in arrhythmias, syncope, SCD or other adverse events. However, the total number of RCTs and participants was small, and all studies primarily involved mild, non-obstructive phenotypes, limiting generalisability. In patients with mild, non-obstructive HCM, structured exercise appears safe and improves functional capacity and cardiometabolic parameters without adverse ventricular effects. Larger multicentre RCTs including higher-risk phenotypes are warranted to confirm safety and define optimal training strategies. CRD420251012232.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Hypertrophic cardiomyopathy (HCM) is a leading cause of sudden cardiac death (SCD) among young individuals and athletes. Despite increasing evidence supporting exercise, uncertainty remains about its safety and efficacy in this population."
        },
        {
          "label": "METHODS",
          "text": "We systematically reviewed randomised controlled trials (RCTs) comparing structured exercise interventions with usual care in patients with HCM. The primary outcome was peak oxygen consumption (pVO₂). Random-effects meta-analysis and trial sequential analysis (TSA) were applied to assess efficacy and robustness of evidence."
        },
        {
          "label": "RESULTS",
          "text": "Four RCTs (n=290) were included, enrolling predominantly low-risk, non-obstructive HCM patients with mild functional limitation (mean left ventricular ejection fraction (LVEF) 66%). Exercise improved pVO₂ (mean difference (MD) 1.81 mL/kg/min; 95% CI 1.01 to 2.61; p<0.01), confirmed by TSA. Exercise also reduced left ventricular wall thickness (MD -0.56 mm; 95% CI -0.97 to -0.16) and body mass index (MD -0.65 kg/m²; 95% CI -1.05 to -0.25) without significant changes in LVEF or left ventricular outflow gradients. No increase was observed in arrhythmias, syncope, SCD or other adverse events. However, the total number of RCTs and participants was small, and all studies primarily involved mild, non-obstructive phenotypes, limiting generalisability."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with mild, non-obstructive HCM, structured exercise appears safe and improves functional capacity and cardiometabolic parameters without adverse ventricular effects. Larger multicentre RCTs including higher-risk phenotypes are warranted to confirm safety and define optimal training strategies."
        },
        {
          "label": "PROSPERO REGISTRATION NUMBER",
          "text": "CRD420251012232."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41320293/",
      "pubDate": "2025 Nov 30",
      "doi": "10.1136/heartjnl-2025-326377",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "84ecb6604170",
      "title": "High-Dose vs Standard-Dose Influenza Vaccine in Chronic Kidney Disease: The DANFLU-2 Trial Subgroup Analysis.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49201115/118283",
      "abstract": "Influenza-related complications occur frequently in persons with chronic kidney disease (CKD). Limited data exist on the effectiveness of high-dose inactivated influenza vaccine (HD-IIV) in persons with CKD. The purpose of this study was to assess the relative effectiveness (rVE) of HD-IIV vs standard-dose inactivated influenza vaccine (SD-IIV) against severe clinical outcomes in persons with CKD from the elderly general population. DANFLU-2 (A Pragmatic Randomized Trial to Evaluate the Effectiveness of High-Dose Influenza Vaccine vs. Standard-Dose Influenza Vaccine in Older Adults) was a pragmatic, open-label, individually randomized trial conducted in Denmark during the 2022-2023, 2023-2024, and 2024-2025 influenza seasons with the aim of assessing the rVE of HD-IIV vs SD-IIV in an older adult general population. In this prespecified secondary analysis, we assessed the rVE against severe clinical outcomes according to the presence of CKD. CKD was defined using data from laboratory registries and International Classification of Diseases-10th Revision diagnosis codes 10 years before vaccination. Among 332,438 DANFLU-2 participants (mean age 73.7 ± 5.8 years; 48.6% women), 46,788 (14.1%) had CKD at baseline. The effect of HD-IIV vs SD-IIV on hospitalization for influenza or pneumonia differed by CKD status: rVE was 16.9% (95% CI: 3.4%-28.5%) in participants with CKD vs 0.6% (95% CI: -9.6% to 9.9%) in those without CKD (P interaction = 0.046). Absolute risks for hospitalization for influenza or pneumonia were 1.7% with SD-IIV vs 1.3% with HD-IIV in CKD, corresponding to an absolute risk reduction of -0.29% (95% CI: -0.50% to 0.058%; number needed to treat [NNT] = 359). For influenza hospitalizations specifically, the benefit of HD-IIV was also substantially greater in CKD: rVE 68.6% (95% CI: 46.7%-82.3%; NNT = 561) vs 30.6% (95% CI: 7.2%-48.2%; NNT =3,953) in non-CKD (P interaction = 0.0079). Reductions in hospitalizations for cardiorespiratory disease, cardiovascular disease, heart failure, and laboratory-confirmed influenza were consistent regardless of CKD (all P interaction > 0.05). In this prespecified analysis of DANFLU-2, including the largest CKD population ever in an individually randomized vaccine trial, we observed a benefit of HD-IIV vs SD-IIV against hospitalization for influenza or pneumonia, as well as hospitalization for influenza, with suggestion of a greater relative benefit among those with CKD. Furthermore, the beneficial effect of HD-IIV vs SD-IIV on multiple cardiorespiratory outcomes was consistent across participants irrespective of CKD status.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Influenza-related complications occur frequently in persons with chronic kidney disease (CKD). Limited data exist on the effectiveness of high-dose inactivated influenza vaccine (HD-IIV) in persons with CKD."
        },
        {
          "label": "OBJECTIVES",
          "text": "The purpose of this study was to assess the relative effectiveness (rVE) of HD-IIV vs standard-dose inactivated influenza vaccine (SD-IIV) against severe clinical outcomes in persons with CKD from the elderly general population."
        },
        {
          "label": "METHODS",
          "text": "DANFLU-2 (A Pragmatic Randomized Trial to Evaluate the Effectiveness of High-Dose Influenza Vaccine vs. Standard-Dose Influenza Vaccine in Older Adults) was a pragmatic, open-label, individually randomized trial conducted in Denmark during the 2022-2023, 2023-2024, and 2024-2025 influenza seasons with the aim of assessing the rVE of HD-IIV vs SD-IIV in an older adult general population. In this prespecified secondary analysis, we assessed the rVE against severe clinical outcomes according to the presence of CKD. CKD was defined using data from laboratory registries and International Classification of Diseases-10th Revision diagnosis codes 10 years before vaccination."
        },
        {
          "label": "RESULTS",
          "text": "Among 332,438 DANFLU-2 participants (mean age 73.7 ± 5.8 years; 48.6% women), 46,788 (14.1%) had CKD at baseline. The effect of HD-IIV vs SD-IIV on hospitalization for influenza or pneumonia differed by CKD status: rVE was 16.9% (95% CI: 3.4%-28.5%) in participants with CKD vs 0.6% (95% CI: -9.6% to 9.9%) in those without CKD (P interaction = 0.046). Absolute risks for hospitalization for influenza or pneumonia were 1.7% with SD-IIV vs 1.3% with HD-IIV in CKD, corresponding to an absolute risk reduction of -0.29% (95% CI: -0.50% to 0.058%; number needed to treat [NNT] = 359). For influenza hospitalizations specifically, the benefit of HD-IIV was also substantially greater in CKD: rVE 68.6% (95% CI: 46.7%-82.3%; NNT = 561) vs 30.6% (95% CI: 7.2%-48.2%; NNT =3,953) in non-CKD (P interaction = 0.0079). Reductions in hospitalizations for cardiorespiratory disease, cardiovascular disease, heart failure, and laboratory-confirmed influenza were consistent regardless of CKD (all P interaction > 0.05)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this prespecified analysis of DANFLU-2, including the largest CKD population ever in an individually randomized vaccine trial, we observed a benefit of HD-IIV vs SD-IIV against hospitalization for influenza or pneumonia, as well as hospitalization for influenza, with suggestion of a greater relative benefit among those with CKD. Furthermore, the beneficial effect of HD-IIV vs SD-IIV on multiple cardiorespiratory outcomes was consistent across participants irrespective of CKD status."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41295932/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.005",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "c45b835f96b2",
      "title": "Human papillomavirus (HPV) vaccination for the prevention of cervical cancer and other HPV-related diseases: a network meta-analysis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49201115/118282",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "c9a8593e6211",
      "title": "Effect of Semaglutide on Insulin Sensitivity and Cardiometabolic Risk Factors in Adolescents With Obesity: The STEP TEENS Study.",
      "journal": "Diabetes Care",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49201115/118258",
      "abstract": "This secondary analysis of the Semaglutide Treatment Effect in People with obesity (STEP) TEENS (NCT04102189) study investigated the effect of semaglutide 2.4 mg versus placebo on insulin sensitivity and cardiometabolic risk factors. The STEP TEENS phase 3a randomized study in adolescents (aged 12 to <18 years) with obesity demonstrated that once-weekly subcutaneous semaglutide 2.4 mg provided a significantly greater percentage reduction in BMI than placebo at week 68 (estimated difference -16.7 percentage points; P = 0.0001). This analysis investigated changes in insulin sensitivity and cardiometabolic risk factors from baseline to week 68. Overall, 193 participants without type 2 diabetes were included in the analysis. Participants receiving semaglutide 2.4 mg (n = 129) compared with those receiving placebo (n = 64) had greater reductions from baseline in fasting serum insulin (-33.6% vs. -10.1%; P = 0.0012), homeostatic model assessment for insulin resistance (HOMA-IR) score (-35.0% vs. -5.3%; P = 0.0002), glycemic measures (glycated hemoglobin: P < 0.0001; fasting plasma glucose: P = 0.0181), alanine aminotransferase (ALT; -17.9% vs. -3.3%; P = 0.0232), waist-to-height ratio (P < 0.0001), triglycerides (P < 0.0001), LDL cholesterol (P = 0.0105), and total cholesterol (P < 0.0001). Moreover, greater improvements in insulin sensitivity, glycemic measures, and cardiometabolic risk factors were seen in semaglutide 2.4 mg recipients with BMI reductions of ≥20% versus <20%. These novel data support semaglutide 2.4 mg as an efficacious obesity treatment in adolescents with obesity and advance its application by showing associated improvements in insulin sensitivity, glycemic measures, ALT, and other cardiometabolic risk factors.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This secondary analysis of the Semaglutide Treatment Effect in People with obesity (STEP) TEENS (NCT04102189) study investigated the effect of semaglutide 2.4 mg versus placebo on insulin sensitivity and cardiometabolic risk factors."
        },
        {
          "label": "RESEARCH DESIGN AND METHODS",
          "text": "The STEP TEENS phase 3a randomized study in adolescents (aged 12 to <18 years) with obesity demonstrated that once-weekly subcutaneous semaglutide 2.4 mg provided a significantly greater percentage reduction in BMI than placebo at week 68 (estimated difference -16.7 percentage points; P = 0.0001). This analysis investigated changes in insulin sensitivity and cardiometabolic risk factors from baseline to week 68."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 193 participants without type 2 diabetes were included in the analysis. Participants receiving semaglutide 2.4 mg (n = 129) compared with those receiving placebo (n = 64) had greater reductions from baseline in fasting serum insulin (-33.6% vs. -10.1%; P = 0.0012), homeostatic model assessment for insulin resistance (HOMA-IR) score (-35.0% vs. -5.3%; P = 0.0002), glycemic measures (glycated hemoglobin: P < 0.0001; fasting plasma glucose: P = 0.0181), alanine aminotransferase (ALT; -17.9% vs. -3.3%; P = 0.0232), waist-to-height ratio (P < 0.0001), triglycerides (P < 0.0001), LDL cholesterol (P = 0.0105), and total cholesterol (P < 0.0001). Moreover, greater improvements in insulin sensitivity, glycemic measures, and cardiometabolic risk factors were seen in semaglutide 2.4 mg recipients with BMI reductions of ≥20% versus <20%."
        },
        {
          "label": "CONCLUSIONS",
          "text": "These novel data support semaglutide 2.4 mg as an efficacious obesity treatment in adolescents with obesity and advance its application by showing associated improvements in insulin sensitivity, glycemic measures, ALT, and other cardiometabolic risk factors."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41296499/",
      "pubDate": "2025 Nov 26",
      "doi": "10.2337/dc25-0824",
      "dateReceived": "2025-12-12T23:26:34.437Z",
      "isNew": true
    },
    {
      "id": "223911a6a05d",
      "title": "Precision Immunotherapy to Improve Sepsis Outcomes: The ImmunoSep Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118342",
      "abstract": "Sepsis is heterogeneous, and the optimal strategy for tailoring immunotherapy is uncertain. To investigate whether precision immunotherapy guided by the presence of macrophage activation-like syndrome or sepsis-induced immunoparalysis improves organ dysfunction by day 9. A randomized, double-blind, double-dummy, placebo-controlled clinical trial conducted in 6 countries. Patients with sepsis, defined by Sepsis-3, were included if they had community-acquired or hospital-acquired pneumonia or ventilator-associated pneumonia or bacteremia and sepsis and had displayed either macrophage activation-like syndrome (blood ferritin >4420 ng/mL) or sepsis-induced immunoparalysis (blood ferritin ≤4420 ng/mL and <5000 human leukocyte antigen DR receptors on CD45/CD14 monocytes). The first patient was enrolled August 5, 2021, and the last follow-up, April 29, 2024. Eligible patients were randomized to receive standard care and precision immunotherapy or standard care and placebo. Those in the precision immunotherapy group with macrophage activation-like syndrome received anakinra intravenously (IV) and placebo subcutaneously, and those with sepsis-induced immunoparalysis received subcutaneous recombinant human interferon gamma and IV placebo. Those in the placebo group received both IV and subcutaneous placebo. Treatment was administered for up to 15 days. The primary end point was a decrease of at least 1.4 points in the mean Sequential Organ Failure Assessment (SOFA) score from baseline by day 9. The SOFA score evaluates 6 organ systems, ranging from 0, no dysfunction, to 4, failure, and the total score ranges from 0, normal, to 24, most severe form of multiorgan failure. Key secondary outcomes included 28-day mortality. Of 672 patients assessed for eligibility, 281 were randomized and 276 were included in the primary analysis population (mean [SD] age, 70 [13] years; 93 females [33.7%]; median baseline SOFA score, 9 [IQR, 7-11]). The SOFA decrease end point was attained by 46 of 131 patients (35.1%) in the precision immunotherapy group and by 26 of 145 patients (17.9%) in the placebo group (difference, 17.2% [95% CI, 6.8% to 27.2%]; P = .002). Mortality at 28 days was not statistically significantly different between groups. A total of 1069 serious treatment-emergent adverse events (88.8%) were reported; increased incidence of anemia was noted in the anakinra group; and hemorrhage in the recombinant human interferon gamma group. Among patients with sepsis, precision immunotherapy targeting macrophage activation-like syndrome and sepsis-induced immunoparalysis improved organ dysfunction by day 9 compared with placebo. ClinicalTrials.gov Identifier: NCT04990232.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Sepsis is heterogeneous, and the optimal strategy for tailoring immunotherapy is uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate whether precision immunotherapy guided by the presence of macrophage activation-like syndrome or sepsis-induced immunoparalysis improves organ dysfunction by day 9."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "A randomized, double-blind, double-dummy, placebo-controlled clinical trial conducted in 6 countries. Patients with sepsis, defined by Sepsis-3, were included if they had community-acquired or hospital-acquired pneumonia or ventilator-associated pneumonia or bacteremia and sepsis and had displayed either macrophage activation-like syndrome (blood ferritin >4420 ng/mL) or sepsis-induced immunoparalysis (blood ferritin ≤4420 ng/mL and <5000 human leukocyte antigen DR receptors on CD45/CD14 monocytes). The first patient was enrolled August 5, 2021, and the last follow-up, April 29, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Eligible patients were randomized to receive standard care and precision immunotherapy or standard care and placebo. Those in the precision immunotherapy group with macrophage activation-like syndrome received anakinra intravenously (IV) and placebo subcutaneously, and those with sepsis-induced immunoparalysis received subcutaneous recombinant human interferon gamma and IV placebo. Those in the placebo group received both IV and subcutaneous placebo. Treatment was administered for up to 15 days."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary end point was a decrease of at least 1.4 points in the mean Sequential Organ Failure Assessment (SOFA) score from baseline by day 9. The SOFA score evaluates 6 organ systems, ranging from 0, no dysfunction, to 4, failure, and the total score ranges from 0, normal, to 24, most severe form of multiorgan failure. Key secondary outcomes included 28-day mortality."
        },
        {
          "label": "RESULTS",
          "text": "Of 672 patients assessed for eligibility, 281 were randomized and 276 were included in the primary analysis population (mean [SD] age, 70 [13] years; 93 females [33.7%]; median baseline SOFA score, 9 [IQR, 7-11]). The SOFA decrease end point was attained by 46 of 131 patients (35.1%) in the precision immunotherapy group and by 26 of 145 patients (17.9%) in the placebo group (difference, 17.2% [95% CI, 6.8% to 27.2%]; P = .002). Mortality at 28 days was not statistically significantly different between groups. A total of 1069 serious treatment-emergent adverse events (88.8%) were reported; increased incidence of anemia was noted in the anakinra group; and hemorrhage in the recombinant human interferon gamma group."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with sepsis, precision immunotherapy targeting macrophage activation-like syndrome and sepsis-induced immunoparalysis improved organ dysfunction by day 9 compared with placebo."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04990232."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41359996/",
      "pubDate": "2025 Dec 08",
      "doi": "10.1001/jama.2025.24175",
      "dateReceived": "2025-12-12T23:26:34.436Z",
      "isNew": true
    },
    {
      "id": "a5aebe2c4eab",
      "title": "Aficamten in Obstructive Hypertrophic Cardiomyopathy: A Multidomain, Patient-Level Analysis of the MAPLE-HCM Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118328",
      "abstract": "For >60 years, beta-blockers have been first-line therapy for symptomatic obstructive hypertrophic cardiomyopathy (oHCM), although limited data support this recommendation. The MAPLE-HCM trial showed greater improvement in exercise capacity and secondary endpoints for aficamten monotherapy vs metoprolol monotherapy. The purpose of this study was to evaluate the effects of aficamten vs metoprolol across multiple clinically relevant and patient-centric measures of disease burden in oHCM. Patients with oHCM and left ventricular outflow tract gradient (LVOT-G) ≥30 mm Hg at rest and/or ≥50 mm Hg with Valsalva were randomly assigned to aficamten (n = 88) or metoprolol (n = 87). Dose titration was based on vital signs and echocardiograms. Assessment of clinical response by treatment arm was based on improvement in multiple parameters reflecting oHCM disease burden: LVOT-G <30 mm Hg at rest and <50 mm Hg with Valsalva; ≥1 class improvement in NYHA functional class and/or ≥10-point improvement in Kansas City Cardiomyopathy Questionnaire-Clinical Summary Score (KCCQ-CSS); ≥50% reduction in N-terminal pro-B-type natriuretic peptide; ≥1.0 mL/kg/min increase in peak oxygen consumption (pVO); and ≥10% reduction in left atrial volume index. Clinical response was classified by number of efficacy outcomes achieved: nonresponder (none), limited (1 or 2), positive (3 or 4), or complete (all 5). Baseline characteristics were similar for both treatment groups. For the overall cohort, mean age was 58 ± 13.2 years; 73 (42%) were women, 103 (70%) were in NYHA functional class II and 52 (30%) in class III, mean pVO was 19.9 ± 5.1 mL/kg/min, and mean KCCQ-CSS score was 66 ± 16. At 24 weeks, aficamten treatment was associated with greater benefits in all efficacy outcome measures, with numbers needed to treat ranging from 1.5 to 5.0 relative to metoprolol treatment. Patients treated with aficamten were more likely to be either positive or complete responders compared with patients treated with metoprolol (78% vs 3%, respectively; P < 0.001). In patients with symptomatic oHCM, aficamten monotherapy led to superior and rapid treatment benefits across several clinically relevant outcome measures of disease burden compared with metoprolol. These observations support the emerging role of aficamten as monotherapy for oHCM. (Phase 3 Trial to Evaluate the Efficacy and Safety of Aficamten Compared to Metoprolol Succinate in Adults With Symptomatic oHCM [MAPLE-HCM]; NCT05767346).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "For >60 years, beta-blockers have been first-line therapy for symptomatic obstructive hypertrophic cardiomyopathy (oHCM), although limited data support this recommendation. The MAPLE-HCM trial showed greater improvement in exercise capacity and secondary endpoints for aficamten monotherapy vs metoprolol monotherapy."
        },
        {
          "label": "OBJECTIVES",
          "text": "The purpose of this study was to evaluate the effects of aficamten vs metoprolol across multiple clinically relevant and patient-centric measures of disease burden in oHCM."
        },
        {
          "label": "METHODS",
          "text": "Patients with oHCM and left ventricular outflow tract gradient (LVOT-G) ≥30 mm Hg at rest and/or ≥50 mm Hg with Valsalva were randomly assigned to aficamten (n = 88) or metoprolol (n = 87). Dose titration was based on vital signs and echocardiograms. Assessment of clinical response by treatment arm was based on improvement in multiple parameters reflecting oHCM disease burden: LVOT-G <30 mm Hg at rest and <50 mm Hg with Valsalva; ≥1 class improvement in NYHA functional class and/or ≥10-point improvement in Kansas City Cardiomyopathy Questionnaire-Clinical Summary Score (KCCQ-CSS); ≥50% reduction in N-terminal pro-B-type natriuretic peptide; ≥1.0 mL/kg/min increase in peak oxygen consumption (pVO); and ≥10% reduction in left atrial volume index. Clinical response was classified by number of efficacy outcomes achieved: nonresponder (none), limited (1 or 2), positive (3 or 4), or complete (all 5)."
        },
        {
          "label": "RESULTS",
          "text": "Baseline characteristics were similar for both treatment groups. For the overall cohort, mean age was 58 ± 13.2 years; 73 (42%) were women, 103 (70%) were in NYHA functional class II and 52 (30%) in class III, mean pVO was 19.9 ± 5.1 mL/kg/min, and mean KCCQ-CSS score was 66 ± 16. At 24 weeks, aficamten treatment was associated with greater benefits in all efficacy outcome measures, with numbers needed to treat ranging from 1.5 to 5.0 relative to metoprolol treatment. Patients treated with aficamten were more likely to be either positive or complete responders compared with patients treated with metoprolol (78% vs 3%, respectively; P < 0.001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with symptomatic oHCM, aficamten monotherapy led to superior and rapid treatment benefits across several clinically relevant outcome measures of disease burden compared with metoprolol. These observations support the emerging role of aficamten as monotherapy for oHCM. (Phase 3 Trial to Evaluate the Efficacy and Safety of Aficamten Compared to Metoprolol Succinate in Adults With Symptomatic oHCM [MAPLE-HCM]; NCT05767346)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41348072/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.057",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "80a8f0143f95",
      "title": "Umbrella Review and Meta-Analysis: Screening Tools for the Identification of Developmental Delay in Early Childhood.",
      "journal": "J Am Acad Child Adolesc Psychiatry",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118318",
      "abstract": "This systematic review and meta-analysis aimed to identify the range of developmental screening tools used globally, and to assess their pooled accuracy in identifying developmental delay among children aged 0 to 6 years. PubMed, MEDLINE, PsycINFO, and Google Scholar were searched up to March 2025, with no language restrictions. Systematic or scoping reviews published within the last 10 years were included if they reported any information on the accuracy of a screening tool designed to identify delay in ≥2 domains. Meta-analyses were conducted to pool estimates of sensitivity, specificity, and area under the curve (AUC). Certainty of evidence for each tool was assessed using the Grading of Recommendations, Assessment, Development, and Evaluation (GRADE) approach. Quality was assessed using A MeaSurement Tool to Assess systematic Reviews (AMSTAR 2) tool. Thirteen reviews reporting on 38 distinct tools were identified. Nine tools had sufficient data for meta-analysis, of which only the Ages and Stages Questionnaire (ASQ), Parents' Evaluations of Developmental Status (PEDS), and Denver Developmental Screening Test (DDST) were informed by more than 2 independent samples. Although most tools demonstrated good discriminative ability (AUC 0.66-0.89), the majority failed to meet minimal accepted thresholds for both sensitivity (0.8) and specificity (0.8). Wide confidence intervals and high heterogeneity were observed for most tools across both estimates. None of the currently available screening tools demonstrate sufficient accuracy for clinical use or population screening, underscoring the need for more nuanced implementation strategies that account for the known limitations of accuracy. Screening tools for the identification of developmental delay in early childhood: an umbrella review; https://www.crd.york.ac.uk/PROSPERO/view/CRD42024577375.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This systematic review and meta-analysis aimed to identify the range of developmental screening tools used globally, and to assess their pooled accuracy in identifying developmental delay among children aged 0 to 6 years."
        },
        {
          "label": "METHOD",
          "text": "PubMed, MEDLINE, PsycINFO, and Google Scholar were searched up to March 2025, with no language restrictions. Systematic or scoping reviews published within the last 10 years were included if they reported any information on the accuracy of a screening tool designed to identify delay in ≥2 domains. Meta-analyses were conducted to pool estimates of sensitivity, specificity, and area under the curve (AUC). Certainty of evidence for each tool was assessed using the Grading of Recommendations, Assessment, Development, and Evaluation (GRADE) approach. Quality was assessed using A MeaSurement Tool to Assess systematic Reviews (AMSTAR 2) tool."
        },
        {
          "label": "RESULTS",
          "text": "Thirteen reviews reporting on 38 distinct tools were identified. Nine tools had sufficient data for meta-analysis, of which only the Ages and Stages Questionnaire (ASQ), Parents' Evaluations of Developmental Status (PEDS), and Denver Developmental Screening Test (DDST) were informed by more than 2 independent samples. Although most tools demonstrated good discriminative ability (AUC 0.66-0.89), the majority failed to meet minimal accepted thresholds for both sensitivity (0.8) and specificity (0.8). Wide confidence intervals and high heterogeneity were observed for most tools across both estimates."
        },
        {
          "label": "CONCLUSION",
          "text": "None of the currently available screening tools demonstrate sufficient accuracy for clinical use or population screening, underscoring the need for more nuanced implementation strategies that account for the known limitations of accuracy."
        },
        {
          "label": "STUDY REGISTRATION INFORMATION",
          "text": "Screening tools for the identification of developmental delay in early childhood: an umbrella review; https://www.crd.york.ac.uk/PROSPERO/view/CRD42024577375."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40975434/",
      "pubDate": "2025 Sep 18",
      "doi": "10.1016/j.jaac.2025.09.011",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "26cfb2978adb",
      "title": "Trial of Pegcetacoplan in C3 Glomerulopathy and Immune-Complex MPGN.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118303",
      "abstract": "C3 glomerulopathy and primary immune-complex membranoproliferative glomerulonephritis (MPGN) generally result in glomerular C3 deposition and irreversible kidney damage. The efficacy and safety of pegcetacoplan, a C3 and C3b inhibitor, in persons with C3 glomerulopathy or primary immune-complex MPGN are unclear. We conducted a phase 3, double-blind, placebo-controlled trial involving adolescents and adults with C3 glomerulopathy or primary immune-complex MPGN, including those with native kidney disease and those with disease recurrence after transplantation. Patients were randomly assigned in a 1:1 ratio to receive pegcetacoplan or placebo. The primary end point was the log-transformed ratio of the urinary protein-to-creatinine ratio at week 26 as compared with baseline. A total of 124 patients underwent randomization. The change in proteinuria (as measured by the log-transformed ratio to baseline in the urinary protein-to-creatinine ratio) was significantly greater with pegcetacoplan than with placebo (geometric mean of the urinary protein-to-creatinine ratio, -67.2% [95% confidence interval {CI}, -74.9 to -57.2] vs. 2.9% [95% CI, -8.6 to 15.9]). The difference represents a relative reduction of 68.1% (95% CI, 57.3 to 76.2) as compared with placebo. In hierarchical testing of five secondary end points, significantly higher percentages of patients in the pegcetacoplan group than in the placebo group met the composite renal end-point criteria (stabilization of estimated glomerular filtration rate [eGFR] and ≥50% reduction in urinary protein-to-creatinine ratio) (49% vs. 3%) and had at least a 50% reduction in the protein-to-creatinine ratio (60% vs. 5%). Among 69 patients with evaluable kidney-biopsy samples, the change in the activity score of the C3 glomerulopathy histologic index did not differ significantly between the two groups; subsequent end points (decrease in C3 staining and change in eGFR) were not formally tested. Pegcetacoplan was not associated with more adverse events than placebo. No serious infections from encapsulated bacteria occurred; 1 patient receiving pegcetacoplan died from coronavirus disease 2019 pneumonia. No allograft rejection or loss occurred. Pegcetacoplan resulted in a significantly greater reduction in proteinuria than placebo among patients with C3 glomerulopathy or primary immune-complex MPGN. (Funded by Apellis Pharmaceuticals and Sobi [Swedish Orphan Biovitrum]; VALIANT ClinicalTrials.gov number, NCT05067127.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "C3 glomerulopathy and primary immune-complex membranoproliferative glomerulonephritis (MPGN) generally result in glomerular C3 deposition and irreversible kidney damage. The efficacy and safety of pegcetacoplan, a C3 and C3b inhibitor, in persons with C3 glomerulopathy or primary immune-complex MPGN are unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted a phase 3, double-blind, placebo-controlled trial involving adolescents and adults with C3 glomerulopathy or primary immune-complex MPGN, including those with native kidney disease and those with disease recurrence after transplantation. Patients were randomly assigned in a 1:1 ratio to receive pegcetacoplan or placebo. The primary end point was the log-transformed ratio of the urinary protein-to-creatinine ratio at week 26 as compared with baseline."
        },
        {
          "label": "RESULTS",
          "text": "A total of 124 patients underwent randomization. The change in proteinuria (as measured by the log-transformed ratio to baseline in the urinary protein-to-creatinine ratio) was significantly greater with pegcetacoplan than with placebo (geometric mean of the urinary protein-to-creatinine ratio, -67.2% [95% confidence interval {CI}, -74.9 to -57.2] vs. 2.9% [95% CI, -8.6 to 15.9]). The difference represents a relative reduction of 68.1% (95% CI, 57.3 to 76.2) as compared with placebo. In hierarchical testing of five secondary end points, significantly higher percentages of patients in the pegcetacoplan group than in the placebo group met the composite renal end-point criteria (stabilization of estimated glomerular filtration rate [eGFR] and ≥50% reduction in urinary protein-to-creatinine ratio) (49% vs. 3%) and had at least a 50% reduction in the protein-to-creatinine ratio (60% vs. 5%). Among 69 patients with evaluable kidney-biopsy samples, the change in the activity score of the C3 glomerulopathy histologic index did not differ significantly between the two groups; subsequent end points (decrease in C3 staining and change in eGFR) were not formally tested. Pegcetacoplan was not associated with more adverse events than placebo. No serious infections from encapsulated bacteria occurred; 1 patient receiving pegcetacoplan died from coronavirus disease 2019 pneumonia. No allograft rejection or loss occurred."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Pegcetacoplan resulted in a significantly greater reduction in proteinuria than placebo among patients with C3 glomerulopathy or primary immune-complex MPGN. (Funded by Apellis Pharmaceuticals and Sobi [Swedish Orphan Biovitrum]; VALIANT ClinicalTrials.gov number, NCT05067127.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41337715/",
      "pubDate": "2025 Dec 04",
      "doi": "10.1056/NEJMoa2501510",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "c2701efcf0cd",
      "title": "Oral Corticosteroid Use During Pregnancy and the Risk of Gestational Diabetes.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118285",
      "abstract": "Oral corticosteroids (OCSs) are increasingly used during pregnancy for various conditions due to their immunosuppressive and anti-inflammatory properties. However, OCSs may induce insulin resistance, potentially contributing to gestational diabetes, and limited studies have examined this association. To assess the risk of gestational diabetes associated with OCS use during pregnancy. This nationwide, population-based cohort study included pregnancies resulting in live births in Korea from 2010 through 2021. A sequential landmark analysis was conducted, with OCS exposure assessed in 3-week intervals between 1 and 27 weeks' gestation. Data were analyzed from June 26, 2024, to September 19, 2025. Pregnancies among women who were exposed to OCSs were compared with pregnancies among women who were not exposed to OCSs within each 3-week interval and in pooled analyses. Gestational diabetes was assessed from 20 weeks plus 1 day of gestation until delivery using a previously validated algorithm. Propensity score-based overlap weighting was applied to adjust for comorbidities, medication use, and health care utilization. Risk ratios (RRs) and 95% CIs were estimated using bootstrapping with 200 replications. Subgroup analyses by age, indication, duration of action, dose, timing, and duration of exposures were performed. Among 3 848 270 pregnancies, 1 325 940 were eligible for analysis, of which 79 710 (6.0%) were exposed to OCSs between 1 and 27 weeks' gestation. OCS exposure was not associated with an increased risk of gestational diabetes in most intervals, except between 4 and 6 weeks' gestation (weighted RR, 1.10; 95% CI, 1.03-1.17). In the pooled analysis, gestational diabetes occurred in 9.50% (95% CI, 9.26%-9.74%) of pregnancies among women in the exposed group vs 7.36% (95% CI, 7.31%-7.43%) of pregnancies among those in the unexposed group (weighted RR, 1.01; 95% CI, 0.99-1.03). Subgroup analyses showed no significant effect modification by maternal age, indication, duration of action, dosage, timing, or duration of exposure. In this cohort study, OCS exposure during pregnancy was not associated with an increased risk of gestational diabetes, except for a modest increase in risk among women exposed to OCSs between 4 and 6 weeks' gestation, supporting the use of OCSs when clinically indicated.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Oral corticosteroids (OCSs) are increasingly used during pregnancy for various conditions due to their immunosuppressive and anti-inflammatory properties. However, OCSs may induce insulin resistance, potentially contributing to gestational diabetes, and limited studies have examined this association."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the risk of gestational diabetes associated with OCS use during pregnancy."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This nationwide, population-based cohort study included pregnancies resulting in live births in Korea from 2010 through 2021. A sequential landmark analysis was conducted, with OCS exposure assessed in 3-week intervals between 1 and 27 weeks' gestation. Data were analyzed from June 26, 2024, to September 19, 2025."
        },
        {
          "label": "EXPOSURE",
          "text": "Pregnancies among women who were exposed to OCSs were compared with pregnancies among women who were not exposed to OCSs within each 3-week interval and in pooled analyses."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Gestational diabetes was assessed from 20 weeks plus 1 day of gestation until delivery using a previously validated algorithm. Propensity score-based overlap weighting was applied to adjust for comorbidities, medication use, and health care utilization. Risk ratios (RRs) and 95% CIs were estimated using bootstrapping with 200 replications. Subgroup analyses by age, indication, duration of action, dose, timing, and duration of exposures were performed."
        },
        {
          "label": "RESULTS",
          "text": "Among 3 848 270 pregnancies, 1 325 940 were eligible for analysis, of which 79 710 (6.0%) were exposed to OCSs between 1 and 27 weeks' gestation. OCS exposure was not associated with an increased risk of gestational diabetes in most intervals, except between 4 and 6 weeks' gestation (weighted RR, 1.10; 95% CI, 1.03-1.17). In the pooled analysis, gestational diabetes occurred in 9.50% (95% CI, 9.26%-9.74%) of pregnancies among women in the exposed group vs 7.36% (95% CI, 7.31%-7.43%) of pregnancies among those in the unexposed group (weighted RR, 1.01; 95% CI, 0.99-1.03). Subgroup analyses showed no significant effect modification by maternal age, indication, duration of action, dosage, timing, or duration of exposure."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this cohort study, OCS exposure during pregnancy was not associated with an increased risk of gestational diabetes, except for a modest increase in risk among women exposed to OCSs between 4 and 6 weeks' gestation, supporting the use of OCSs when clinically indicated."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324930/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamainternmed.2025.6367",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "8edf1174d12a",
      "title": "Dipeptidyl peptidase 4 (DPP-4) inhibitors for people with chronic kidney disease and diabetes.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118267",
      "abstract": "Diabetes is a critical risk factor for cardiovascular disease and chronic kidney disease (CKD). Type 2 diabetes increases all-cause and cardiovascular death and impairs health-related quality of life. More than a third of people with type 2 diabetes develop kidney failure, requiring treatment with dialysis or kidney transplantation. People with CKD and type 2 diabetes have a substantially higher risk of premature cardiovascular complications. Dipeptidyl peptidase 4 (DPP-4) inhibitors are glucose-lowering agents that achieve glucose control in people with type 2 diabetes and may prevent poor kidney and cardiovascular outcomes for people with CKD and type 2 diabetes. However, new trials are emerging rapidly, and continuous evidence synthesis is essential to summarising cumulative evidence. This review aims to assess the benefits and harms of DPP-4 inhibitors in people with CKD and type 2 diabetes. We searched the Cochrane Kidney and Transplant Register of Studies up to 25 March 2025 using a search strategy designed by an Information Specialist. Studies in the Register are continually identified through regular searches of CENTRAL, MEDLINE, Embase, conference proceedings, the International Clinical Trials Register (ICTRP) Search Portal and ClinicalTrials.gov. Randomised controlled studies (RCTs) were eligible if they compared treatment with a DPP-4 inhibitor against placebo, standard medical care (including usual other glucose-lowering agents or no treatment), or another glucose-lowering agent in people with CKD and type 2 diabetes. We included all CKD categories (from 1 to 5), including people treated with dialysis. People with type 1 diabetes and kidney transplant recipients were excluded. The critical review outcomes were cardiovascular death and hypoglycaemia requiring third-party assistance. The key important outcomes included 3- and 4-point major cardiovascular events (MACE), nonfatal myocardial infarction, nonfatal stroke, and kidney failure. The risk of bias version 2 tool was used to assess the studies. Three review authors independently extracted data and assessed the study risk of bias. Treatment estimates were summarised using random effects meta-analysis and expressed as relative risk (RR) or mean difference (MD), with corresponding 95% confidence interval (CI). Evidence certainty was assessed using the Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach. Fifty-nine studies involving 27,893 participants were included. DPP-4 inhibitors with or without other background treatments were compared to placebo, standard medical care, sodium-glucose cotransport 2 inhibitors, glucagon-like peptide-1 receptor agonists, sulfonylurea, other DPP-4 inhibitors, insulin, or alpha-glucosidase inhibitors. There were no studies evaluating treatment in children. We contacted 10 authors from primary studies to retrieve additional information, but no further data were added to this review. Compared to placebo or standard medical care, DPP-4 inhibitors may have little or no effect on the risk of cardiovascular death (RR 0.96, 95% CI 0.82 to 1.14; 6 studies, 7568 participants; low-certainty evidence) and hypoglycaemia requiring third-party assistance in people with all CKD categories (RR 0.97, 95% CI 0.76 to 1.25; I² = 0%; 10 studies, 8994 participants; low-certainty evidence). DPP-4 inhibitors probably have little or no effect on 3-point MACE compared with placebo (RR 1.03, 95% CI 0.91 to 1.17; 1 study, 6979 participants; moderate-certainty evidence). DPP-4 inhibitors had uncertain effects on the risk of 4-point MACE compared with placebo (RR 0.74, 95% CI 0.29 to 1.88; 1 study, 133 participants; very low-certainty evidence), nonfatal myocardial infarction compared with placebo in people with CKD categories 3-5, including those on dialysis (RR 1.91, 95% CI 0.36 to 10.08; 1 study, 133 participants; very-low-certainty evidence), or nonfatal stroke compared with placebo (RR 0.96, 95% CI 0.06 to 14.97; 1 study, 133 participants; very-low-certainty evidence). Compared to placebo or standard medical care, DPP-4 inhibitors probably have little or no effect on kidney failure in people with all CKD categories (RR 1.09, 95% CI 0.78 to 1.53; I² = 0%; 3 studies, 7472 participants; moderate-certainty evidence). The effects of DPP-4 inhibitors compared to other glucose-lowering agents were uncertain. No studies evaluated treatment on the clinical outcomes of life participation, lactic acidosis, blindness, diabetic ketoacidosis, peritoneal dialysis infection, or peritoneal dialysis failure. The overall risk of bias was assessed as low or very low for most included studies. DPP-4 inhibitors had an uncertain effect on the risks of cardiovascular death and hypoglycaemia requiring third-party assistance in people with CKD and type 2 diabetes when compared with placebo or standard medical care, whilst the effects on other glucose-lowering agents were uncertain. Despite the large number of studies, there is little evidence that DPP-4 inhibitors prevent key adverse clinical outcomes for people who have CKD and type 2 diabetes. Future well-designed and adequately powered RCTs can provide better information about the effects of DPP-4 inhibitors on key patient-reported outcomes and cost to better inform decision-making and clinical practice in this setting. This Cochrane Review had no dedicated funding. Protocol available via DOI: 10.1002/14651858.CD015906.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Diabetes is a critical risk factor for cardiovascular disease and chronic kidney disease (CKD). Type 2 diabetes increases all-cause and cardiovascular death and impairs health-related quality of life. More than a third of people with type 2 diabetes develop kidney failure, requiring treatment with dialysis or kidney transplantation. People with CKD and type 2 diabetes have a substantially higher risk of premature cardiovascular complications. Dipeptidyl peptidase 4 (DPP-4) inhibitors are glucose-lowering agents that achieve glucose control in people with type 2 diabetes and may prevent poor kidney and cardiovascular outcomes for people with CKD and type 2 diabetes. However, new trials are emerging rapidly, and continuous evidence synthesis is essential to summarising cumulative evidence."
        },
        {
          "label": "OBJECTIVES",
          "text": "This review aims to assess the benefits and harms of DPP-4 inhibitors in people with CKD and type 2 diabetes."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Kidney and Transplant Register of Studies up to 25 March 2025 using a search strategy designed by an Information Specialist. Studies in the Register are continually identified through regular searches of CENTRAL, MEDLINE, Embase, conference proceedings, the International Clinical Trials Register (ICTRP) Search Portal and ClinicalTrials.gov."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled studies (RCTs) were eligible if they compared treatment with a DPP-4 inhibitor against placebo, standard medical care (including usual other glucose-lowering agents or no treatment), or another glucose-lowering agent in people with CKD and type 2 diabetes. We included all CKD categories (from 1 to 5), including people treated with dialysis. People with type 1 diabetes and kidney transplant recipients were excluded."
        },
        {
          "label": "OUTCOMES",
          "text": "The critical review outcomes were cardiovascular death and hypoglycaemia requiring third-party assistance. The key important outcomes included 3- and 4-point major cardiovascular events (MACE), nonfatal myocardial infarction, nonfatal stroke, and kidney failure."
        },
        {
          "label": "RISK OF BIAS",
          "text": "The risk of bias version 2 tool was used to assess the studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Three review authors independently extracted data and assessed the study risk of bias. Treatment estimates were summarised using random effects meta-analysis and expressed as relative risk (RR) or mean difference (MD), with corresponding 95% confidence interval (CI). Evidence certainty was assessed using the Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Fifty-nine studies involving 27,893 participants were included. DPP-4 inhibitors with or without other background treatments were compared to placebo, standard medical care, sodium-glucose cotransport 2 inhibitors, glucagon-like peptide-1 receptor agonists, sulfonylurea, other DPP-4 inhibitors, insulin, or alpha-glucosidase inhibitors. There were no studies evaluating treatment in children. We contacted 10 authors from primary studies to retrieve additional information, but no further data were added to this review."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Compared to placebo or standard medical care, DPP-4 inhibitors may have little or no effect on the risk of cardiovascular death (RR 0.96, 95% CI 0.82 to 1.14; 6 studies, 7568 participants; low-certainty evidence) and hypoglycaemia requiring third-party assistance in people with all CKD categories (RR 0.97, 95% CI 0.76 to 1.25; I² = 0%; 10 studies, 8994 participants; low-certainty evidence). DPP-4 inhibitors probably have little or no effect on 3-point MACE compared with placebo (RR 1.03, 95% CI 0.91 to 1.17; 1 study, 6979 participants; moderate-certainty evidence). DPP-4 inhibitors had uncertain effects on the risk of 4-point MACE compared with placebo (RR 0.74, 95% CI 0.29 to 1.88; 1 study, 133 participants; very low-certainty evidence), nonfatal myocardial infarction compared with placebo in people with CKD categories 3-5, including those on dialysis (RR 1.91, 95% CI 0.36 to 10.08; 1 study, 133 participants; very-low-certainty evidence), or nonfatal stroke compared with placebo (RR 0.96, 95% CI 0.06 to 14.97; 1 study, 133 participants; very-low-certainty evidence). Compared to placebo or standard medical care, DPP-4 inhibitors probably have little or no effect on kidney failure in people with all CKD categories (RR 1.09, 95% CI 0.78 to 1.53; I² = 0%; 3 studies, 7472 participants; moderate-certainty evidence). The effects of DPP-4 inhibitors compared to other glucose-lowering agents were uncertain. No studies evaluated treatment on the clinical outcomes of life participation, lactic acidosis, blindness, diabetic ketoacidosis, peritoneal dialysis infection, or peritoneal dialysis failure. The overall risk of bias was assessed as low or very low for most included studies."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "DPP-4 inhibitors had an uncertain effect on the risks of cardiovascular death and hypoglycaemia requiring third-party assistance in people with CKD and type 2 diabetes when compared with placebo or standard medical care, whilst the effects on other glucose-lowering agents were uncertain. Despite the large number of studies, there is little evidence that DPP-4 inhibitors prevent key adverse clinical outcomes for people who have CKD and type 2 diabetes. Future well-designed and adequately powered RCTs can provide better information about the effects of DPP-4 inhibitors on key patient-reported outcomes and cost to better inform decision-making and clinical practice in this setting."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane Review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via DOI: 10.1002/14651858.CD015906."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41263251/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1002/14651858.CD015906.pub2",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "e24a970bffc4",
      "title": "Neurological Events Associated With Acute Dengue Infection.",
      "journal": "JAMA Neurol",
      "score": "5/7",
      "tags": [
        "Neurology",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118264",
      "abstract": "With increasing global incidence of acute dengue virus (DENV) infection, more accurate estimates of the burden of neurological events following infection are required; however, population-based estimates are lacking. To evaluate the risk and excess burden of neurological events in a cohort of DENV-infected adults in the acute postinfectious period vs population-based comparators without DENV infection. This was a retrospective, population-based cohort study in Singapore. National registries were used to construct a cohort of all adults (aged ≥18 years) infected with DENV from January 1, 2017, through December 31, 2023, for whom the index date (time 0 [T0]) was taken as the date of notification, and a cohort of uninfected population-based comparators, for whom T0 was randomly assigned to match T0 distribution in DENV-infected cases. As the period overlapped with the COVID-19 pandemic, individuals infected with SARS-CoV-2 within 30 days of T0 were additionally excluded, as were individuals who died before T0 and uninfected comparators with no prior health care contact. Data analysis was performed from January 1, 2017, through March 30, 2024. DENV infection recorded in the national registry. New-incident neurological events, including any neurological event, memory loss, movement disorders, and other neurological disorders (eg, fatigue or malaise, encephalitis or encephalopathy), following DENV infection were identified using national health care claims records, and risk was assessed over the acute follow-up period. Odds of new-incident neurological events in DENV-infected cases vs uninfected comparators were estimated using overlap-weighted logistic regression at 30 to 90 days after T0. A total of 65 207 confirmed DENV-infected cases (mean [SD] age, 48.4 [17.8] years; 34 876 [53.5%] male) were compared against 1 616 865 uninfected comparators (mean [SD] age, 54.8 [18.3] years; 730 702 [45.2%] male). At 30 days following DENV infection, individuals with DENV infection, compared with uninfected individuals, had elevated odds of any new-incident neurological event (adjusted odds ratio [aOR], 9.69; 95% CI, 6.59-14.90), memory loss (aOR, 3.19; 95% CI, 1.36-8.69), movement disorders (aOR, 7.10; 95% CI, 2.49-29.18), and other neurological events (aOR, 14.32; 95% CI, 8.61-26.04); risk trajectories diverged up to 90 days after infection. However, the overall excess burden was modest, with less than 1 excess event per 100 cases. The DENV-infected cases, compared with uninfected individuals, had increased odds of memory loss (aOR, 2.99; 95% CI, 1.30-7.87) and movement disorders (aOR, 6.38; 95% CI, 2.23-25.96) only among those aged 60 years or older and in cases infected during DENV serotype 3 transmission. DENV infection was associated with significantly higher odds of acute new-incident neurological events following infection, although the excess burden was modest. Older adults should be monitored for a wider spectrum of potential neurological complications following DENV infection.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "With increasing global incidence of acute dengue virus (DENV) infection, more accurate estimates of the burden of neurological events following infection are required; however, population-based estimates are lacking."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the risk and excess burden of neurological events in a cohort of DENV-infected adults in the acute postinfectious period vs population-based comparators without DENV infection."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a retrospective, population-based cohort study in Singapore. National registries were used to construct a cohort of all adults (aged ≥18 years) infected with DENV from January 1, 2017, through December 31, 2023, for whom the index date (time 0 [T0]) was taken as the date of notification, and a cohort of uninfected population-based comparators, for whom T0 was randomly assigned to match T0 distribution in DENV-infected cases. As the period overlapped with the COVID-19 pandemic, individuals infected with SARS-CoV-2 within 30 days of T0 were additionally excluded, as were individuals who died before T0 and uninfected comparators with no prior health care contact. Data analysis was performed from January 1, 2017, through March 30, 2024."
        },
        {
          "label": "EXPOSURE",
          "text": "DENV infection recorded in the national registry."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "New-incident neurological events, including any neurological event, memory loss, movement disorders, and other neurological disorders (eg, fatigue or malaise, encephalitis or encephalopathy), following DENV infection were identified using national health care claims records, and risk was assessed over the acute follow-up period. Odds of new-incident neurological events in DENV-infected cases vs uninfected comparators were estimated using overlap-weighted logistic regression at 30 to 90 days after T0."
        },
        {
          "label": "RESULTS",
          "text": "A total of 65 207 confirmed DENV-infected cases (mean [SD] age, 48.4 [17.8] years; 34 876 [53.5%] male) were compared against 1 616 865 uninfected comparators (mean [SD] age, 54.8 [18.3] years; 730 702 [45.2%] male). At 30 days following DENV infection, individuals with DENV infection, compared with uninfected individuals, had elevated odds of any new-incident neurological event (adjusted odds ratio [aOR], 9.69; 95% CI, 6.59-14.90), memory loss (aOR, 3.19; 95% CI, 1.36-8.69), movement disorders (aOR, 7.10; 95% CI, 2.49-29.18), and other neurological events (aOR, 14.32; 95% CI, 8.61-26.04); risk trajectories diverged up to 90 days after infection. However, the overall excess burden was modest, with less than 1 excess event per 100 cases. The DENV-infected cases, compared with uninfected individuals, had increased odds of memory loss (aOR, 2.99; 95% CI, 1.30-7.87) and movement disorders (aOR, 6.38; 95% CI, 2.23-25.96) only among those aged 60 years or older and in cases infected during DENV serotype 3 transmission."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "DENV infection was associated with significantly higher odds of acute new-incident neurological events following infection, although the excess burden was modest. Older adults should be monitored for a wider spectrum of potential neurological complications following DENV infection."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41284268/",
      "pubDate": "2025 Nov 24",
      "doi": "10.1001/jamaneurol.2025.4608",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "7f9db8ce7138",
      "title": "Clinical Efficacy and Safety of Auricular Acupuncture for Migraine: A Systematic Review and Meta-Analysis of Randomized Controlled Trials.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118242",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "4ee74fa721ee",
      "title": "Topical immunosuppressants for blepharitis in adults.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118236",
      "abstract": "Blepharitis is a common ocular condition characterized by inflammation of the eyelid margins, which can cause irritating symptoms and ocular surface damage. Conventional treatment of blepharitis consists of eyelid hygiene and artificial tears. To suppress inflammation, topical corticosteroids, with or without antibiotics, are frequently prescribed. However, long-term use is limited by side effects such as increased intraocular pressure, glaucoma and/or cataract formation. Newer steroid-sparing topical immunosuppressants have emerged as alternative treatments. To assess the benefits and harms of topical immunosuppressants for blepharitis in adults. We searched CENTRAL, MEDLINE, Embase, and three trial registries from inception to 6 April 2025. We searched the reference lists of included studies for any additional studies not identified by the electronic searches. There were no date or language restrictions on the selection of eligible studies. We included randomized controlled trials (RCTs) comparing topical immunosuppressants (corticosteroids, cyclosporine, or tacrolimus) of different doses or carrier, with placebo, no treatment, conventional treatment (lid hygiene, artificial tears) or other topical immunosuppressants in adults with blepharitis. We excluded paired-eye studies and highly specific blepharitis subtypes. Our outcomes were: (1) change from baseline in composite (or total) symptom score; (2) change from baseline in tear film breakup time; (3) change from baseline in corneal staining scores; (4) proportion of individuals experiencing symptomatic improvement; (5) reduction in number of or eradication of colonies of positive cultures of bacteria; (6) quality of life measures; (7) economic costs of different topical immunosuppressants; and (8) adverse effects. We used Cochrane's risk of bias (RoB) 2 tool for all outcomes reported in the summary of findings tables. Two review authors independently selected trials, extracted data, and assessed risk of bias. We used fixed-effect meta-analysis to combine data and forest plots to assess heterogeneity, effect size, and direction. We used GRADE to assess the certainty of evidence for each outcome. When meta-analysis was not possible, we used narrative synthesis. We included 12 RCTs with 2752 participants (2802 eyes) in total. Six of the trials were conducted in the USA. Topical corticosteroid was the most frequently studied immunosuppressant, followed by cyclosporine and tacrolimus. The point of assessment and duration of treatment ranged from two to 12 weeks. No study measured the proportion of individuals experiencing symptomatic improvement. We report outcomes of interest for three key comparisons below at four to 12 weeks. No study assessed reduction or eradication of colonies of positive cultures of bacteria, quality of life or economic costs. Topical corticosteroids (with or without antibiotics) versus placebo The evidence is very uncertain about the effects of topical corticosteroids on composite symptom scores (corticosteroids with antibiotics: standard mean difference [SMD] 0.87, 95% confidence interval [CI] 0.31 to 1.44; 2 studies, 57 participants; corticosteroids alone: SMD -0.05, 95% CI -0.31 to 0.20; 2 studies, 232 participants; very low-certainty evidence). No study reported tear breakup time. The evidence is very uncertain about the effects of topical corticosteroids on corneal staining scores (corticosteroids with antibiotics: MD 0.70, 95% CI -1.05 to 2.45; 1 study, 27 participants; corticosteroids alone: MD 0.50, 95% CI -1.22 to 2.22; 1 study, 27 participants); both, very low-certainty evidence. The adverse event of irritation of the ocular surface was reported narratively and was similar between the two groups. The adverse event of ocular hypertension was reported narratively and not detected in either group in one study where it was reported. Topical corticosteroids (with or without antibiotics) versus antibiotics The evidence for topical corticosteroids was inconclusive. One study found that topical corticosteroid with antibiotic treatment may reduce symptom scores more than antibiotics alone (MD -11.34, 95% CI -13.13 to -9.55; 1 study, 148 participants), whereas the other found that it may have little to no effect (MD 0.40, 95% CI -0.11 to 0.91; 1 study, 201 participants); both, low-certainty evidence. Topical corticosteroids plus antibiotics probably result in greater reduction in corneal staining scores compared with antibiotics alone (MD -1.26, 95% CI -1.56 to -0.96; 1 study, 148 participants; moderate-certainty evidence). However, this effect was not observed for tear breakup time when antibiotics alone are likely to perform better (MD -1.10, 95% CI -1.39 to -0.81; 1 study, 148 participants; moderate-certainty evidence). The adverse event of irritation of the ocular surface was reported narratively, and was similar between the two groups. The adverse event of ocular hypertension was reported narratively, and was higher in the corticosteroid (with or without antibiotics) group. Topical cyclosporine versus placebo Topical cyclosporine may have little to no effect on the composite symptom score compared with placebo, but the evidence is very uncertain (SMD 0.15, 95% CI -0.27 to 0.57; 2 studies, 90 participants; very low-certainty evidence). The evidence is very uncertain about the effect of topical cyclosporine on tear breakup time compared with placebo (invasive time: MD 4.70, 95% CI -0.24 to 9.64; 1 study, 26 participants, although for non-invasive time, it may provide a potential benefit: MD 1.59, 95% CI 1.48 to 1.70; 1 study, 64 participants; both very low-certainty evidence). Topical cyclosporine may improve corneal staining compared with placebo, but the evidence is very uncertain (MD 2.60, 95% CI 0.68 to 4.52; 1 study, 26 participants; very low-certainty evidence). No study reported adverse events. Topical corticosteroids, with or without antibiotics, including cyclosporine may make little to no difference in reducing signs and symptoms of blepharitis at four to 12 weeks, compared with placebo or antibiotics alone. Topical corticosteroids are generally well tolerated and associated with minimal risk of ocular surface irritation. Topical corticosteroids plus antibiotics probably improve corneal staining compared to antibiotics alone. When managing patients with blepharitis, clinicians should consider the limited quantity and very low certainty of evidence for topical corticosteroids. Conventional lid hygiene and warm compress remain valid therapeutic options. This Cochrane Review was funded (in part) by the National Eye Institute, National Institutes of Health, USA, the National Institute for Health Research, UK, and the Public Health Agency, UK. Protocol available via doi.org/10.1002/14651858.CD013550.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Blepharitis is a common ocular condition characterized by inflammation of the eyelid margins, which can cause irritating symptoms and ocular surface damage. Conventional treatment of blepharitis consists of eyelid hygiene and artificial tears. To suppress inflammation, topical corticosteroids, with or without antibiotics, are frequently prescribed. However, long-term use is limited by side effects such as increased intraocular pressure, glaucoma and/or cataract formation. Newer steroid-sparing topical immunosuppressants have emerged as alternative treatments."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of topical immunosuppressants for blepharitis in adults."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, and three trial registries from inception to 6 April 2025. We searched the reference lists of included studies for any additional studies not identified by the electronic searches. There were no date or language restrictions on the selection of eligible studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) comparing topical immunosuppressants (corticosteroids, cyclosporine, or tacrolimus) of different doses or carrier, with placebo, no treatment, conventional treatment (lid hygiene, artificial tears) or other topical immunosuppressants in adults with blepharitis. We excluded paired-eye studies and highly specific blepharitis subtypes."
        },
        {
          "label": "OUTCOMES",
          "text": "Our outcomes were: (1) change from baseline in composite (or total) symptom score; (2) change from baseline in tear film breakup time; (3) change from baseline in corneal staining scores; (4) proportion of individuals experiencing symptomatic improvement; (5) reduction in number of or eradication of colonies of positive cultures of bacteria; (6) quality of life measures; (7) economic costs of different topical immunosuppressants; and (8) adverse effects."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used Cochrane's risk of bias (RoB) 2 tool for all outcomes reported in the summary of findings tables."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently selected trials, extracted data, and assessed risk of bias. We used fixed-effect meta-analysis to combine data and forest plots to assess heterogeneity, effect size, and direction. We used GRADE to assess the certainty of evidence for each outcome. When meta-analysis was not possible, we used narrative synthesis."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 12 RCTs with 2752 participants (2802 eyes) in total. Six of the trials were conducted in the USA. Topical corticosteroid was the most frequently studied immunosuppressant, followed by cyclosporine and tacrolimus. The point of assessment and duration of treatment ranged from two to 12 weeks. No study measured the proportion of individuals experiencing symptomatic improvement."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We report outcomes of interest for three key comparisons below at four to 12 weeks. No study assessed reduction or eradication of colonies of positive cultures of bacteria, quality of life or economic costs. Topical corticosteroids (with or without antibiotics) versus placebo The evidence is very uncertain about the effects of topical corticosteroids on composite symptom scores (corticosteroids with antibiotics: standard mean difference [SMD] 0.87, 95% confidence interval [CI] 0.31 to 1.44; 2 studies, 57 participants; corticosteroids alone: SMD -0.05, 95% CI -0.31 to 0.20; 2 studies, 232 participants; very low-certainty evidence). No study reported tear breakup time. The evidence is very uncertain about the effects of topical corticosteroids on corneal staining scores (corticosteroids with antibiotics: MD 0.70, 95% CI -1.05 to 2.45; 1 study, 27 participants; corticosteroids alone: MD 0.50, 95% CI -1.22 to 2.22; 1 study, 27 participants); both, very low-certainty evidence. The adverse event of irritation of the ocular surface was reported narratively and was similar between the two groups. The adverse event of ocular hypertension was reported narratively and not detected in either group in one study where it was reported. Topical corticosteroids (with or without antibiotics) versus antibiotics The evidence for topical corticosteroids was inconclusive. One study found that topical corticosteroid with antibiotic treatment may reduce symptom scores more than antibiotics alone (MD -11.34, 95% CI -13.13 to -9.55; 1 study, 148 participants), whereas the other found that it may have little to no effect (MD 0.40, 95% CI -0.11 to 0.91; 1 study, 201 participants); both, low-certainty evidence. Topical corticosteroids plus antibiotics probably result in greater reduction in corneal staining scores compared with antibiotics alone (MD -1.26, 95% CI -1.56 to -0.96; 1 study, 148 participants; moderate-certainty evidence). However, this effect was not observed for tear breakup time when antibiotics alone are likely to perform better (MD -1.10, 95% CI -1.39 to -0.81; 1 study, 148 participants; moderate-certainty evidence). The adverse event of irritation of the ocular surface was reported narratively, and was similar between the two groups. The adverse event of ocular hypertension was reported narratively, and was higher in the corticosteroid (with or without antibiotics) group. Topical cyclosporine versus placebo Topical cyclosporine may have little to no effect on the composite symptom score compared with placebo, but the evidence is very uncertain (SMD 0.15, 95% CI -0.27 to 0.57; 2 studies, 90 participants; very low-certainty evidence). The evidence is very uncertain about the effect of topical cyclosporine on tear breakup time compared with placebo (invasive time: MD 4.70, 95% CI -0.24 to 9.64; 1 study, 26 participants, although for non-invasive time, it may provide a potential benefit: MD 1.59, 95% CI 1.48 to 1.70; 1 study, 64 participants; both very low-certainty evidence). Topical cyclosporine may improve corneal staining compared with placebo, but the evidence is very uncertain (MD 2.60, 95% CI 0.68 to 4.52; 1 study, 26 participants; very low-certainty evidence). No study reported adverse events."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Topical corticosteroids, with or without antibiotics, including cyclosporine may make little to no difference in reducing signs and symptoms of blepharitis at four to 12 weeks, compared with placebo or antibiotics alone. Topical corticosteroids are generally well tolerated and associated with minimal risk of ocular surface irritation. Topical corticosteroids plus antibiotics probably improve corneal staining compared to antibiotics alone. When managing patients with blepharitis, clinicians should consider the limited quantity and very low certainty of evidence for topical corticosteroids. Conventional lid hygiene and warm compress remain valid therapeutic options."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane Review was funded (in part) by the National Eye Institute, National Institutes of Health, USA, the National Institute for Health Research, UK, and the Public Health Agency, UK."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via doi.org/10.1002/14651858.CD013550."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41263273/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1002/14651858.CD013550.pub2",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "4fe2fb229453",
      "title": "Sex Differences in Mortality and Receipt of Kidney Replacement Therapy Among Adults With Stage 5 Chronic Kidney Disease.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118262",
      "abstract": "Female individuals typically outlive male individuals in the general population. Whether this survival advantage persists among adults with stage 5 chronic kidney disease (CKD) is unknown. To examine sex differences in mortality and treatment with kidney replacement therapy (KRT; including dialysis and transplant) among adults with incident stage 5 CKD. This population-based cohort study used linked administrative and kidney care program data from Alberta, Canada. Adults 18 years and older with incident non-KRT-dependent stage 5 CKD were identified between April 2005 and March 2019 and observed from study entry until death, out-migration, or March 2021. Data were analyzed from January to August 2025. Sex-specific, age-stratified standardized mortality ratios were calculated using general population mortality data. Five-year probabilities of all-cause death, receipt of maintenance dialysis, and kidney transplant were estimated in incident stage 5 CKD cases using multistate models, stratified by age and presence of diabetes or cardiovascular disease. Among 7506 cohort members, 4121 (54.9%) were male (median [IQR] age, 70 [58-80] years), and 3385 (45.1%) were female (median [IQR] age, 74 [61-83] years). The median (IQR) follow-up was 7.9 (4.7-11.5) years. Compared with the general population, female individuals experienced greater excess mortality than male individuals, particularly at younger ages (eg, among adults younger than 55 years: standardized mortality ratio, 40.9 [95% CI, 34.6-47.3] in female individuals vs 15.9 [95% CI, 13.5-18.2] in male individuals); this difference narrowed with increasing age. Within the stage 5 CKD cohort, 5-year all-cause mortality risks were higher in younger female individuals than male individuals (younger than 55 years: 20.7% vs 14.6%) and similar between sexes at older ages. Irrespective of comorbidity, female individuals younger than 65 years were substantially less likely to receive a kidney transplant, and female individuals 65 years and older were less likely to receive dialysis or a transplant. In this cohort study using data from a universal health care system, across all ages, the female survival advantage observed in the general population was absent or even reversed after developing stage 5 CKD. Fewer female individuals transitioned to KRT treatment, independent of their comorbidities. Younger female individuals experienced the greatest survival disadvantage and were less likely to receive a transplant. These findings suggest that differences in treatment decision-making or inequities in access to KRT may contribute to poorer outcomes in female individuals, especially at younger ages. Further investigations are warranted to understand the potential underlying structural, social, and biological mechanisms.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Female individuals typically outlive male individuals in the general population. Whether this survival advantage persists among adults with stage 5 chronic kidney disease (CKD) is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine sex differences in mortality and treatment with kidney replacement therapy (KRT; including dialysis and transplant) among adults with incident stage 5 CKD."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This population-based cohort study used linked administrative and kidney care program data from Alberta, Canada. Adults 18 years and older with incident non-KRT-dependent stage 5 CKD were identified between April 2005 and March 2019 and observed from study entry until death, out-migration, or March 2021. Data were analyzed from January to August 2025."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Sex-specific, age-stratified standardized mortality ratios were calculated using general population mortality data. Five-year probabilities of all-cause death, receipt of maintenance dialysis, and kidney transplant were estimated in incident stage 5 CKD cases using multistate models, stratified by age and presence of diabetes or cardiovascular disease."
        },
        {
          "label": "RESULTS",
          "text": "Among 7506 cohort members, 4121 (54.9%) were male (median [IQR] age, 70 [58-80] years), and 3385 (45.1%) were female (median [IQR] age, 74 [61-83] years). The median (IQR) follow-up was 7.9 (4.7-11.5) years. Compared with the general population, female individuals experienced greater excess mortality than male individuals, particularly at younger ages (eg, among adults younger than 55 years: standardized mortality ratio, 40.9 [95% CI, 34.6-47.3] in female individuals vs 15.9 [95% CI, 13.5-18.2] in male individuals); this difference narrowed with increasing age. Within the stage 5 CKD cohort, 5-year all-cause mortality risks were higher in younger female individuals than male individuals (younger than 55 years: 20.7% vs 14.6%) and similar between sexes at older ages. Irrespective of comorbidity, female individuals younger than 65 years were substantially less likely to receive a kidney transplant, and female individuals 65 years and older were less likely to receive dialysis or a transplant."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this cohort study using data from a universal health care system, across all ages, the female survival advantage observed in the general population was absent or even reversed after developing stage 5 CKD. Fewer female individuals transitioned to KRT treatment, independent of their comorbidities. Younger female individuals experienced the greatest survival disadvantage and were less likely to receive a transplant. These findings suggest that differences in treatment decision-making or inequities in access to KRT may contribute to poorer outcomes in female individuals, especially at younger ages. Further investigations are warranted to understand the potential underlying structural, social, and biological mechanisms."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41247715/",
      "pubDate": "2025 Nov 17",
      "doi": "10.1001/jamainternmed.2025.5979",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "44ecc6ae0817",
      "title": "Real-World Prospective Validation and Economic Evaluation of Deep Learning-Based Diabetic Retinopathy Detection From Fundus Photographs: A Systematic Review and Meta-analysis.",
      "journal": "Diabetes Care",
      "score": "5/7",
      "tags": [
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118257",
      "abstract": "Deep learning (DL) has shown promise in delivering diagnostic and economic benefits for detecting diabetic retinopathy (DR) from fundus photographs (FPs). However, evidence synthesis of model validation in prospective, real-world settings remains limited. To assess the feasibility of implementing DL-DR systems using FPs across different countries by synthesizing prospective validation and economic evidence. Five databases were searched until 13 August 2025. Studies prospectively assessing diagnostic performance and/or studies conducting economic analyses of DL-DR systems using FPs were selected. Characteristics of all studies, performance parameters of prospective validation studies, and economic outcomes of economic analysis studies were extracted. Forty-seven studies were included in the meta-analysis. The pooled performance was the highest in detecting vision-threatening DR (area under the receiver operating characteristic curve [AUROC] 0.974), followed by any DR (AUROC 0.965), then referable DR (RDR) (AUROC 0.959). Study region, clinical pathway, mydriasis, image quality control, sample size, grading criteria, reference standard, and model architecture significantly affected model performance in RDR detection. Fifteen studies were included in the economic commentary, showing that DL-based DR screening was cost-effective in high-income countries, whereas results in middle-income countries were mixed, depending on compliance rates, glycemic control, and initial costs. A paucity of studies assessing multiple severities of DR or diabetic macular edema restricted our ability to perform subgroup analyses. Insights into low-income countries were limited by a lack of studies in these regions. DL-DR systems using FPs had high discriminative performance in prospective real-world settings and hold promise to improve cost-effectiveness, especially in high-income countries.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Deep learning (DL) has shown promise in delivering diagnostic and economic benefits for detecting diabetic retinopathy (DR) from fundus photographs (FPs). However, evidence synthesis of model validation in prospective, real-world settings remains limited."
        },
        {
          "label": "PURPOSE",
          "text": "To assess the feasibility of implementing DL-DR systems using FPs across different countries by synthesizing prospective validation and economic evidence."
        },
        {
          "label": "DATA SOURCES",
          "text": "Five databases were searched until 13 August 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Studies prospectively assessing diagnostic performance and/or studies conducting economic analyses of DL-DR systems using FPs were selected."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Characteristics of all studies, performance parameters of prospective validation studies, and economic outcomes of economic analysis studies were extracted."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Forty-seven studies were included in the meta-analysis. The pooled performance was the highest in detecting vision-threatening DR (area under the receiver operating characteristic curve [AUROC] 0.974), followed by any DR (AUROC 0.965), then referable DR (RDR) (AUROC 0.959). Study region, clinical pathway, mydriasis, image quality control, sample size, grading criteria, reference standard, and model architecture significantly affected model performance in RDR detection. Fifteen studies were included in the economic commentary, showing that DL-based DR screening was cost-effective in high-income countries, whereas results in middle-income countries were mixed, depending on compliance rates, glycemic control, and initial costs."
        },
        {
          "label": "LIMITATIONS",
          "text": "A paucity of studies assessing multiple severities of DR or diabetic macular edema restricted our ability to perform subgroup analyses. Insights into low-income countries were limited by a lack of studies in these regions."
        },
        {
          "label": "CONCLUSIONS",
          "text": "DL-DR systems using FPs had high discriminative performance in prospective real-world settings and hold promise to improve cost-effectiveness, especially in high-income countries."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41259706/",
      "pubDate": "2025 Nov 19",
      "doi": "10.2337/dc25-1493",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "76f988cdf1ee",
      "title": "Efficacy and safety of glucagon-like peptide 1 receptor agonists across all health outcomes in type 2 diabetes: An umbrella review and evidence map of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118247",
      "abstract": "Glucagon-like peptide 1 receptor agonists (GLP-1RAs) have been established as effective treatments for type 2 diabetes, offering benefits beyond glycaemic control; however, their associations across multiple health outcomes remain insufficiently assessed. Thus, we conducted an umbrella review of meta-analyses of randomised controlled trials (RCTs) to comprehensively evaluate the broad spectrum of their effects. We conducted a systematic search of PubMed/MEDLINE, Embase, CINAHL, and Google Scholar through June 13, 2025, to identify meta-analyses of RCTs assessing the effects of GLP-1RAs on various health outcomes, including cardiovascular, renal, metabolic, oncologic, gastrointestinal and other domains. Effect sizes were recalculated using random-effects models and converted to equivalent odds ratios (eORs) with 95% confidence intervals (CIs) for consistency. The methodological quality of each review was assessed using the AMSTAR 2, and the certainty of evidence for each association was evaluated according to the Grading of Recommendations, Assessment, Development and Evaluation framework (high, moderate, low or very low certainty). We preregistered our study protocol with PROSPERO (CRD420251112823). After applying predefined inclusion and exclusion criteria, 17 studies comprising 432 RCTs were included, covering 65 unique outcomes across 6 clinical domains. GLP-1RAs use was associated with reduced risks of heart failure (eOR, 0.71 [95% CI, 0.64-0.79]; low certainty) and peripheral artery disease (0.75 [0.67-0.84]; low certainty). Drug-specific analyses exhibited protective effects of liraglutide (eOR, 0.86 [95% CI, 0.80-0.91]), albiglutide (0.65 [0.47-0.89]), and dulaglutide (0.78 [0.68-0.90]) for major cardiovascular events, myocardial infarction and stroke, respectively. Renal outcomes indicated that GLP-1RAs use was associated with reducing the risk of kidney-specific composite outcomes (eOR, 0.76 [95% CI, 0.66-0.87]; low certainty), including nephropathy (0.74 [0.61-0.92]; low certainty) and albuminuria (0.73 [0.55-0.97]; very low certainty). GLP-1RAs were also associated with reductions in body weight (eOR, 0.46 [95% CI, 0.36-0.60]; moderate certainty) and glycated haemoglobin A1c (0.83 [0.71-0.97]; high certainty), but no substantial association with cancer risk was found. Gastrointestinal adverse events, including nausea (9.62 [4.60-20.10]; high certainty), dyspepsia (4.85 [1.52-15.45]; moderate certainty), and constipation (3.39 [1.54-7.47]; high certainty), were consistently reported. GLP-1RAs use was associated with higher lumbar spine (eOR, 1.99 [95% CI, 1.38-2.85]; low certainty) and hip-neck bone mineral density (1.79 [1.08-2.98]; low certainty). In this study, GLP-1RAs were associated with cardiovascular, renal, and metabolic benefits in type 2 diabetes without increasing cancer risk, though gastrointestinal adverse events were common. Our findings support the clinical use of GLP-1RAs, with attention to individual risk profiles and treatment tolerability.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "Glucagon-like peptide 1 receptor agonists (GLP-1RAs) have been established as effective treatments for type 2 diabetes, offering benefits beyond glycaemic control; however, their associations across multiple health outcomes remain insufficiently assessed. Thus, we conducted an umbrella review of meta-analyses of randomised controlled trials (RCTs) to comprehensively evaluate the broad spectrum of their effects."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We conducted a systematic search of PubMed/MEDLINE, Embase, CINAHL, and Google Scholar through June 13, 2025, to identify meta-analyses of RCTs assessing the effects of GLP-1RAs on various health outcomes, including cardiovascular, renal, metabolic, oncologic, gastrointestinal and other domains. Effect sizes were recalculated using random-effects models and converted to equivalent odds ratios (eORs) with 95% confidence intervals (CIs) for consistency. The methodological quality of each review was assessed using the AMSTAR 2, and the certainty of evidence for each association was evaluated according to the Grading of Recommendations, Assessment, Development and Evaluation framework (high, moderate, low or very low certainty). We preregistered our study protocol with PROSPERO (CRD420251112823)."
        },
        {
          "label": "RESULTS",
          "text": "After applying predefined inclusion and exclusion criteria, 17 studies comprising 432 RCTs were included, covering 65 unique outcomes across 6 clinical domains. GLP-1RAs use was associated with reduced risks of heart failure (eOR, 0.71 [95% CI, 0.64-0.79]; low certainty) and peripheral artery disease (0.75 [0.67-0.84]; low certainty). Drug-specific analyses exhibited protective effects of liraglutide (eOR, 0.86 [95% CI, 0.80-0.91]), albiglutide (0.65 [0.47-0.89]), and dulaglutide (0.78 [0.68-0.90]) for major cardiovascular events, myocardial infarction and stroke, respectively. Renal outcomes indicated that GLP-1RAs use was associated with reducing the risk of kidney-specific composite outcomes (eOR, 0.76 [95% CI, 0.66-0.87]; low certainty), including nephropathy (0.74 [0.61-0.92]; low certainty) and albuminuria (0.73 [0.55-0.97]; very low certainty). GLP-1RAs were also associated with reductions in body weight (eOR, 0.46 [95% CI, 0.36-0.60]; moderate certainty) and glycated haemoglobin A1c (0.83 [0.71-0.97]; high certainty), but no substantial association with cancer risk was found. Gastrointestinal adverse events, including nausea (9.62 [4.60-20.10]; high certainty), dyspepsia (4.85 [1.52-15.45]; moderate certainty), and constipation (3.39 [1.54-7.47]; high certainty), were consistently reported. GLP-1RAs use was associated with higher lumbar spine (eOR, 1.99 [95% CI, 1.38-2.85]; low certainty) and hip-neck bone mineral density (1.79 [1.08-2.98]; low certainty)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this study, GLP-1RAs were associated with cardiovascular, renal, and metabolic benefits in type 2 diabetes without increasing cancer risk, though gastrointestinal adverse events were common. Our findings support the clinical use of GLP-1RAs, with attention to individual risk profiles and treatment tolerability."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41255131/",
      "pubDate": "2025 Nov 19",
      "doi": "10.1111/dom.70298",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "920e6c8a9d8b",
      "title": "Melatonin for sleep and cognitive outcomes in older adults with cognitive impairment: a meta-analysis of randomised controlled trials.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118239",
      "abstract": "To quantify the effects of melatonin on total sleep time and global cognition, and to examine secondary outcomes (sleep efficiency, circadian markers, neuropsychiatric symptoms, depression, activities of daily living) in older adults with cognitive impairment. Systematic review and meta-analysis of randomised controlled trials (PROSPERO CRD42024539227). PubMed, PsycINFO (via EBSCOhost), CINAHL Plus, Cochrane Library, Web of Science, to October 2024. Randomised controlled trials (RCTs) comparing melatonin versus placebo in adults ≥65 years with mild cognitive impairment or dementia. Two reviewers extracted data; risk of bias was assessed by RoB 2. Random-effects models estimated Hedges' g and mean differences (MD), with Benjamini-Hochberg false discovery rate (FDR) correction for multiple outcomes. Heterogeneity assessed via I2; publication bias via Egger's test. Ten RCTs (n = 516) were included. Melatonin increased total sleep time by MD +12.4 min (95% CI 8.1-16.7; P < .001; I2 = 72%; g = 0.42) and improved Mini-Mental State Examination scores by MD +1.8 points (95% CI 0.9-2.7; P = .002; I2 = 65%; g = 0.47). Neuropsychiatric symptoms decreased (g = -0.23; 95% CI -0.44 to -0.03; P = .02). Effects on sleep efficiency, circadian markers, depression and activities of daily living were small and nonsignificant. Melatonin yields modest improvements in sleep duration and cognition that approach clinically important thresholds but fall short of definitive efficacy. Larger, rigorously designed RCTs with harmonised outcomes and pre-specified primary endpoints are needed to confirm these findings.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To quantify the effects of melatonin on total sleep time and global cognition, and to examine secondary outcomes (sleep efficiency, circadian markers, neuropsychiatric symptoms, depression, activities of daily living) in older adults with cognitive impairment."
        },
        {
          "label": "DESIGN",
          "text": "Systematic review and meta-analysis of randomised controlled trials (PROSPERO CRD42024539227)."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, PsycINFO (via EBSCOhost), CINAHL Plus, Cochrane Library, Web of Science, to October 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials (RCTs) comparing melatonin versus placebo in adults ≥65 years with mild cognitive impairment or dementia."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers extracted data; risk of bias was assessed by RoB 2. Random-effects models estimated Hedges' g and mean differences (MD), with Benjamini-Hochberg false discovery rate (FDR) correction for multiple outcomes. Heterogeneity assessed via I2; publication bias via Egger's test."
        },
        {
          "label": "RESULTS",
          "text": "Ten RCTs (n = 516) were included. Melatonin increased total sleep time by MD +12.4 min (95% CI 8.1-16.7; P < .001; I2 = 72%; g = 0.42) and improved Mini-Mental State Examination scores by MD +1.8 points (95% CI 0.9-2.7; P = .002; I2 = 65%; g = 0.47). Neuropsychiatric symptoms decreased (g = -0.23; 95% CI -0.44 to -0.03; P = .02). Effects on sleep efficiency, circadian markers, depression and activities of daily living were small and nonsignificant."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Melatonin yields modest improvements in sleep duration and cognition that approach clinically important thresholds but fall short of definitive efficacy. Larger, rigorously designed RCTs with harmonised outcomes and pre-specified primary endpoints are needed to confirm these findings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41240058/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1093/ageing/afaf333",
      "dateReceived": "2025-12-11T23:26:58.760Z",
      "isNew": true
    },
    {
      "id": "3bb408f8ba0a",
      "title": "Cyproterone acetate for hirsutism.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Endocrine",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49261930/118295",
      "abstract": "Hirsutism (excessive and unwanted hair growth) is a distressing and relatively common endocrine problem in women that may prove difficult to manage. Cyproterone acetate (CPA), an antiandrogen, is frequently used to treat hirsutism, usually in combination with ethinylestradiol. This is an update of a Cochrane review first published in 2003. To assess the benefits and harms of cyproterone acetate (CPA) alone, or in combination with ethinylestradiol, and other medication in reducing hair growth and improving the endocrine profile in women with hirsutism secondary to ovarian hyperandrogenism as well as idiopathic hirsutism. We searched the Cochrane Gynaecology and Fertility specialised register, CENTRAL, MEDLINE, Embase, PsycINFO and CINAHL to 20 December 2022. We also searched the reference lists of relevant papers and clinical trial registries. We included randomised controlled trials (RCT) examining women of reproductive age with either idiopathic hirsutism or hirsutism secondary to ovarian hyperandrogenism. Hirsutism was defined as a Ferriman Gallwey (FG) score greater than 7. We included 23 studies. Only one study had more than 100 women included in the analysis. The primary outcomes were the objective and subjective assessment of clinical parameters (FG scores, linear hair growth and hair shaft diameter, women's feedback and frequency of hair removal). Secondary outcomes included endocrine parameters, side effects and withdrawals during therapy. Cyproterone acetate greater than 2 mg plus ethinylestradiol compared to cyproterone acetate 2 mg or less plus ethinylestradiol (dose comparison) After six months of treatment, we are uncertain of any difference in effect on FG scores (mean difference (MD) 0.63, 95% confidence interval (CI) -1.02 to 2.28; I = 0%; 2 RCTs, 145 women; very low-certainty evidence). There was likely little to no difference in free testosterone (MD 0.35 pmol/L, 95% CI -0.61 to 1.31; 1 RCT, 113 women; moderate-certainty evidence). Cyproterone acetate alone (no ethinylestradiol) compared to other interventions alone (no ethinylestradiol) There was little or no difference for CPA compared with gonadotropin-releasing hormone (GnRH) analogues on total testosterone at three months (MD 0.17 nmol/L, 95% CI -0.15 to 0.49). There was little or no evidence of an effect for CPA compared with GnRH agonist on androstenedione at three months (MD 0.66 nmol/L, 95% CI -0.44 to 1.76). Both results from one RCT (20 women; very low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions alone (no ethinylestradiol) There was little to no difference in effect for CPA plus ethinylestradiol on FG scores at six months compared with finasteride (MD 4.70, 95% CI -1.86 to 11.26; 1 RCT, 27 women; low-certainty evidence), spironolactone (MD 0.90, 95% CI -2.86 to 4.66; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD 0.70, 95% CI -0.84 to 2.24; 1 RCT, 81 women; moderate-certainty evidence), or pioglitazone plus flutamide plus metformin (Pio-Flu-Met) (MD 0.90, 95% CI -0.79 to 2.59; 1 RCT, 34 women; low-certainty evidence). CPA plus ethinylestradiol may improve hirsutism slightly compared with flutamide (MD 4.00, 95% CI 0.10 to 7.90; 1 RCT, 28 women). CPA plus ethinylestradiol likely results in little to no difference in total testosterone at six months compared with spironolactone (MD -0.06 nmol/L, 95% CI -1.25 to 1.13; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD -0.02 nmol/L, 95% CI -0.37 to 0.33; 1 RCT, 81 women; moderate-certainty evidence), or Pio-Flu-Met (MD -0.39 nmol/L, 95% CI -0.82 to 0.04; 1 RCT, 81 women; low-certainty evidence). CPA plus ethinylestradiol may be more effective than finasteride at six months (MD -1.60 nmol/L, 95% CI -2.39 to -0.81; 1 RCT, 27 women; low-certainty evidence). CPA plus ethinylestradiol may lower free testosterone slightly at six months compared to finasteride (MD -9.02 nmol/L, 95% CI -12.44 to -5.60; 1 RCT, 27 women; low-certainty evidence) or flutamide (MD -4.16 nmol/L, 95% CI -6.62 to -1.70; 1 RCT, 28 women; low-certainty evidence). There was little to no difference between CPA plus ethinylestradiol and spironolactone (MD 0.35 nmol/L, 95% CI -0.62 to 1.32; 1 RCT, 77 women; low-certainty evidence). CPA plus ethinylestradiol may be less effective than ketoconazole (MD 1.39 nmol/L, 95% CI 0.43 to 2.35; 1 RCT, 81 women; low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions plus ethinylestradiol CPA plus ethinylestradiol likely results in little to no difference in effect on FG scores at six months compared with finasteride plus ethinylestradiol (MD -0.91, 95% CI -1.82 to 0; 1 RCT, 26 women; moderate-certainty evidence) or spironolactone plus drospirenone plus ethinylestradiol (MD 0.69, 95% CI -0.80 to 2.18; 1 RCT, 89 women; high-certainty evidence). However, CPA plus ethinylestradiol may lower FG scores compared to spironolactone plus ethinylestradiol, but the evidence is very uncertain (MD -0.93, 95% CI -1.68 to -0.19; 3 RCTs, 103 women; very low-certainty evidence). There was probably little to no difference in effect for CPA plus ethinylestradiol on total testosterone at six months compared with spironolactone plus ethinylestradiol (MD -0.20 nmol/L, 95% CI -0.64 to 0.24; 1 RCT, 45 women; moderate-certainty evidence), and likely results in little to no difference compared with drospirenone plus ethinylestradiol (MD 0.15 nmol/L, 95% CI 0.08 to 0.22; 1 RCT, 91 women; moderate-certainty evidence). Six months of CPA plus ethinylestradiol treatment likely lowered free testosterone levels compared to drospirenone plus ethinylestradiol (MD -0.31 pmol/L, 95% CI -0.53 to -0.09; 1 RCT, 91 women; moderate-certainty evidence). Data were lacking for all other outcomes in our main review comparisons. There were some differences in clinical outcome between CPA and spironolactone, CPA and flutamide, and CPA and finasteride. There were no clinical differences between CPA and the other medical therapies, possibly because of small study size, lack of standardised assessment and objective determinants of improvement in many studies. There are insufficient data presented to compare the adverse effects of all the treatment options. Larger, carefully designed studies are needed to compare efficacy and safety profiles between the therapeutic options available.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Hirsutism (excessive and unwanted hair growth) is a distressing and relatively common endocrine problem in women that may prove difficult to manage. Cyproterone acetate (CPA), an antiandrogen, is frequently used to treat hirsutism, usually in combination with ethinylestradiol. This is an update of a Cochrane review first published in 2003."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of cyproterone acetate (CPA) alone, or in combination with ethinylestradiol, and other medication in reducing hair growth and improving the endocrine profile in women with hirsutism secondary to ovarian hyperandrogenism as well as idiopathic hirsutism."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Gynaecology and Fertility specialised register, CENTRAL, MEDLINE, Embase, PsycINFO and CINAHL to 20 December 2022. We also searched the reference lists of relevant papers and clinical trial registries."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCT) examining women of reproductive age with either idiopathic hirsutism or hirsutism secondary to ovarian hyperandrogenism. Hirsutism was defined as a Ferriman Gallwey (FG) score greater than 7."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We included 23 studies. Only one study had more than 100 women included in the analysis. The primary outcomes were the objective and subjective assessment of clinical parameters (FG scores, linear hair growth and hair shaft diameter, women's feedback and frequency of hair removal). Secondary outcomes included endocrine parameters, side effects and withdrawals during therapy."
        },
        {
          "label": "MAIN RESULTS",
          "text": "Cyproterone acetate greater than 2 mg plus ethinylestradiol compared to cyproterone acetate 2 mg or less plus ethinylestradiol (dose comparison) After six months of treatment, we are uncertain of any difference in effect on FG scores (mean difference (MD) 0.63, 95% confidence interval (CI) -1.02 to 2.28; I = 0%; 2 RCTs, 145 women; very low-certainty evidence). There was likely little to no difference in free testosterone (MD 0.35 pmol/L, 95% CI -0.61 to 1.31; 1 RCT, 113 women; moderate-certainty evidence). Cyproterone acetate alone (no ethinylestradiol) compared to other interventions alone (no ethinylestradiol) There was little or no difference for CPA compared with gonadotropin-releasing hormone (GnRH) analogues on total testosterone at three months (MD 0.17 nmol/L, 95% CI -0.15 to 0.49). There was little or no evidence of an effect for CPA compared with GnRH agonist on androstenedione at three months (MD 0.66 nmol/L, 95% CI -0.44 to 1.76). Both results from one RCT (20 women; very low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions alone (no ethinylestradiol) There was little to no difference in effect for CPA plus ethinylestradiol on FG scores at six months compared with finasteride (MD 4.70, 95% CI -1.86 to 11.26; 1 RCT, 27 women; low-certainty evidence), spironolactone (MD 0.90, 95% CI -2.86 to 4.66; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD 0.70, 95% CI -0.84 to 2.24; 1 RCT, 81 women; moderate-certainty evidence), or pioglitazone plus flutamide plus metformin (Pio-Flu-Met) (MD 0.90, 95% CI -0.79 to 2.59; 1 RCT, 34 women; low-certainty evidence). CPA plus ethinylestradiol may improve hirsutism slightly compared with flutamide (MD 4.00, 95% CI 0.10 to 7.90; 1 RCT, 28 women). CPA plus ethinylestradiol likely results in little to no difference in total testosterone at six months compared with spironolactone (MD -0.06 nmol/L, 95% CI -1.25 to 1.13; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD -0.02 nmol/L, 95% CI -0.37 to 0.33; 1 RCT, 81 women; moderate-certainty evidence), or Pio-Flu-Met (MD -0.39 nmol/L, 95% CI -0.82 to 0.04; 1 RCT, 81 women; low-certainty evidence). CPA plus ethinylestradiol may be more effective than finasteride at six months (MD -1.60 nmol/L, 95% CI -2.39 to -0.81; 1 RCT, 27 women; low-certainty evidence). CPA plus ethinylestradiol may lower free testosterone slightly at six months compared to finasteride (MD -9.02 nmol/L, 95% CI -12.44 to -5.60; 1 RCT, 27 women; low-certainty evidence) or flutamide (MD -4.16 nmol/L, 95% CI -6.62 to -1.70; 1 RCT, 28 women; low-certainty evidence). There was little to no difference between CPA plus ethinylestradiol and spironolactone (MD 0.35 nmol/L, 95% CI -0.62 to 1.32; 1 RCT, 77 women; low-certainty evidence). CPA plus ethinylestradiol may be less effective than ketoconazole (MD 1.39 nmol/L, 95% CI 0.43 to 2.35; 1 RCT, 81 women; low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions plus ethinylestradiol CPA plus ethinylestradiol likely results in little to no difference in effect on FG scores at six months compared with finasteride plus ethinylestradiol (MD -0.91, 95% CI -1.82 to 0; 1 RCT, 26 women; moderate-certainty evidence) or spironolactone plus drospirenone plus ethinylestradiol (MD 0.69, 95% CI -0.80 to 2.18; 1 RCT, 89 women; high-certainty evidence). However, CPA plus ethinylestradiol may lower FG scores compared to spironolactone plus ethinylestradiol, but the evidence is very uncertain (MD -0.93, 95% CI -1.68 to -0.19; 3 RCTs, 103 women; very low-certainty evidence). There was probably little to no difference in effect for CPA plus ethinylestradiol on total testosterone at six months compared with spironolactone plus ethinylestradiol (MD -0.20 nmol/L, 95% CI -0.64 to 0.24; 1 RCT, 45 women; moderate-certainty evidence), and likely results in little to no difference compared with drospirenone plus ethinylestradiol (MD 0.15 nmol/L, 95% CI 0.08 to 0.22; 1 RCT, 91 women; moderate-certainty evidence). Six months of CPA plus ethinylestradiol treatment likely lowered free testosterone levels compared to drospirenone plus ethinylestradiol (MD -0.31 pmol/L, 95% CI -0.53 to -0.09; 1 RCT, 91 women; moderate-certainty evidence). Data were lacking for all other outcomes in our main review comparisons."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There were some differences in clinical outcome between CPA and spironolactone, CPA and flutamide, and CPA and finasteride. There were no clinical differences between CPA and the other medical therapies, possibly because of small study size, lack of standardised assessment and objective determinants of improvement in many studies. There are insufficient data presented to compare the adverse effects of all the treatment options. Larger, carefully designed studies are needed to compare efficacy and safety profiles between the therapeutic options available."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41288141/",
      "pubDate": "2025 Nov 25",
      "doi": "10.1002/14651858.CD001125.pub2",
      "dateReceived": "2025-12-10T23:25:14.872Z",
      "isNew": false
    },
    {
      "id": "a3c3602b9b1e",
      "title": "Comparison of 162 mg and 81 mg Aspirin for Prevention of Preeclampsia: A Randomized Controlled Trial.",
      "journal": "Obstet Gynecol",
      "score": "7/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49261930/118255",
      "abstract": "To compare the efficacy of 162 mg vs 81 mg aspirin daily for the prevention of preterm preeclampsia (less than 37 weeks of gestation) or preeclampsia with severe features among pregnant people at high risk. We conducted a pragmatic, randomized, open-label, blinded endpoint clinical trial. Pregnant people at high risk for preeclampsia were randomized to treatment with either 162 mg or 81 mg aspirin daily beginning before 16 weeks of gestation until term and followed up until 6 weeks postpartum. The primary composite outcome of either preterm preeclampsia or preeclampsia with severe features was adjudicated by independent researchers blinded to treatment group. Secondary outcomes were the components of the composite, adherence to therapy, and maternal and neonatal complications. The anticipated incidence of the primary composite outcome in the 81-mg group was 8.6%. We calculated that enrollment of 394 participants (197 for each group) would have 80% power to detect a 7.1% reduction in the primary outcome with 162 mg aspirin compared with 81 mg, assuming a two-sided α of 0.05. Of 400 participants randomized, 365 had delivery data available and were included in the intention-to-treat analysis, with 184 participants in the 162-mg group and 181 in the 81-mg group. The incidence of preterm preeclampsia or preeclampsia with severe features was 26 of 184 (14.1%) in the 162-mg group compared with 31 of 181 (17.1%) in the 81-mg group (relative risk 0.83, 95% CI, 0.51-1.33, P=.4). Individual outcomes of preterm preeclampsia and term preeclampsia with severe features were similar between aspirin groups. Adherence rates ranged from 88% to 91% and 89% to 92% for the 162-mg group compared with the 81-mg group, respectively, across study visits. Singleton birth weight was slightly lower in the 162-mg group (2.9 kg vs 3.2 kg, P=.005). There were eight cases of placental abruption in participants randomized to 162 mg compared with 0 in those randomized to 81 mg (P=.013). Among people at increased risk for preeclampsia, the rates of preterm preeclampsia or preeclampsia with severe features were similar to rates in those randomized to treatment with either 81 mg or 162 mg aspirin at less than 16 weeks of gestation. ClinicalTrials.gov, NCT04070573.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To compare the efficacy of 162 mg vs 81 mg aspirin daily for the prevention of preterm preeclampsia (less than 37 weeks of gestation) or preeclampsia with severe features among pregnant people at high risk."
        },
        {
          "label": "METHODS",
          "text": "We conducted a pragmatic, randomized, open-label, blinded endpoint clinical trial. Pregnant people at high risk for preeclampsia were randomized to treatment with either 162 mg or 81 mg aspirin daily beginning before 16 weeks of gestation until term and followed up until 6 weeks postpartum. The primary composite outcome of either preterm preeclampsia or preeclampsia with severe features was adjudicated by independent researchers blinded to treatment group. Secondary outcomes were the components of the composite, adherence to therapy, and maternal and neonatal complications. The anticipated incidence of the primary composite outcome in the 81-mg group was 8.6%. We calculated that enrollment of 394 participants (197 for each group) would have 80% power to detect a 7.1% reduction in the primary outcome with 162 mg aspirin compared with 81 mg, assuming a two-sided α of 0.05."
        },
        {
          "label": "RESULTS",
          "text": "Of 400 participants randomized, 365 had delivery data available and were included in the intention-to-treat analysis, with 184 participants in the 162-mg group and 181 in the 81-mg group. The incidence of preterm preeclampsia or preeclampsia with severe features was 26 of 184 (14.1%) in the 162-mg group compared with 31 of 181 (17.1%) in the 81-mg group (relative risk 0.83, 95% CI, 0.51-1.33, P=.4). Individual outcomes of preterm preeclampsia and term preeclampsia with severe features were similar between aspirin groups. Adherence rates ranged from 88% to 91% and 89% to 92% for the 162-mg group compared with the 81-mg group, respectively, across study visits. Singleton birth weight was slightly lower in the 162-mg group (2.9 kg vs 3.2 kg, P=.005). There were eight cases of placental abruption in participants randomized to 162 mg compared with 0 in those randomized to 81 mg (P=.013)."
        },
        {
          "label": "CONCLUSION",
          "text": "Among people at increased risk for preeclampsia, the rates of preterm preeclampsia or preeclampsia with severe features were similar to rates in those randomized to treatment with either 81 mg or 162 mg aspirin at less than 16 weeks of gestation."
        },
        {
          "label": "CLINICAL TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov, NCT04070573."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41296512/",
      "pubDate": "2025 Oct 24",
      "doi": "10.1097/AOG.0000000000006100",
      "dateReceived": "2025-12-10T23:25:14.872Z",
      "isNew": false
    },
    {
      "id": "8115cc2e64dc",
      "title": "Benefits and harms of ADHD interventions: umbrella review and platform for shared decision making.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49177163/118256",
      "abstract": "To assess the effects of and related evidence certainty of interventions for attention deficit/hyperactivity disorder (ADHD) across an individual's lifespan, and to develop a continuously updated web platform for people with lived experience of ADHD as a method to disseminate living evidence synthesis for shared decision making. Umbrella review and platform for shared decision making. Six databases from inception to 19 January 2025. Study authors were contacted for additional information when necessary. Systematic reviews that used meta-analyses of randomised controlled trials were eligible if they compared a drug or non-drug intervention with a passive control in individuals with a diagnosis of ADHD. Primary outcomes were severity of ADHD symptoms, analysed by rater type (clinician-rated, parent-rated, teacher-rated, or self-rated) and time point (short term (12 weeks, or study endpoint), medium term (26 weeks), and long term (52 weeks)),acceptability (participants dropping out for any reason), and tolerability (participants dropping out owing to any side effects). Secondary outcomes included daily functioning, quality of life, comorbid symptoms, and key side effects (decreased sleep and appetite). Eligible meta-analyses were re-estimated with a standardised statistical approach. Methodological quality was assessed using AMSTAR-2. Evidence certainty was evaluated using an algorithmic version of the GRADE framework, adapted for drug and non-drug interventions. 115 of 414 full text articles were deemed eligible and 299 were excluded; the eligible articles comprised 221 unique combinations of participants, interventions, comparators, and outcomes. For each combination, the most recent and methodologically robust meta-analysis was selected for re-estimation, which gave 221 re-estimated meta-analyses in total, derived from 47 meta-analytic reports. In the short term, alpha-2 agonists, amphetamines, atomoxetine, methylphenidate, and viloxazine showed medium to large effect sizes in reducing the severity of ADHD symptoms in children and adolescents, with moderate to high certainty evidence. Methylphenidate showed consistent benefits across raters (standardised mean difference >0.75, 95% confidence interval (CI) 0.56 to 1.03; moderate or high certainty evidence). These interventions showed lower tolerability than the placebo, but this effect was not significant for methylphenidate and atomoxetine. In adults, atomoxetine, cognitive behavioural therapy, methylphenidate (and, when restricting analyses to high quality trials, amphetamines) showed at least moderate certainty evidence of efficacy on ADHD symptoms, with medium effect sizes. Methylphenidate, amphetamines, and atomoxetine had worse tolerability than placebo (methylphenidate, risk ratio 0.50, 95% CI 0.36 to 0.69; amphetamines, 0.40, 0.22 to 0.72; atomoxetine, 0.45, 0.35 to 0.58). Some non-drug interventions (acupuncture and cognitive behavioural therapy in children and adolescents, and mindfulness in adults) showed large effect sizes for ADHD symptoms, but with low certainty evidence. No high certainty, long term evidence was found for any intervention. An online platform showing effects and evidence certainty of each intervention across age groups, time points, and outcomes (https://ebiadhd-database.org/) was developed. This review provides updated evidence to inform patients, practitioners, and guideline developers how best to manage ADHD symptoms. The online platform should facilitate the implementation of shared decision making in daily practice. Open Science Framework https://osf.io/ugqy6/.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of and related evidence certainty of interventions for attention deficit/hyperactivity disorder (ADHD) across an individual's lifespan, and to develop a continuously updated web platform for people with lived experience of ADHD as a method to disseminate living evidence synthesis for shared decision making."
        },
        {
          "label": "DESIGN",
          "text": "Umbrella review and platform for shared decision making."
        },
        {
          "label": "DATA SOURCES",
          "text": "Six databases from inception to 19 January 2025. Study authors were contacted for additional information when necessary."
        },
        {
          "label": "ELIGIBILITY CRITERIA FOR SELECTING STUDIES",
          "text": "Systematic reviews that used meta-analyses of randomised controlled trials were eligible if they compared a drug or non-drug intervention with a passive control in individuals with a diagnosis of ADHD. Primary outcomes were severity of ADHD symptoms, analysed by rater type (clinician-rated, parent-rated, teacher-rated, or self-rated) and time point (short term (12 weeks, or study endpoint), medium term (26 weeks), and long term (52 weeks)),acceptability (participants dropping out for any reason), and tolerability (participants dropping out owing to any side effects). Secondary outcomes included daily functioning, quality of life, comorbid symptoms, and key side effects (decreased sleep and appetite)."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Eligible meta-analyses were re-estimated with a standardised statistical approach. Methodological quality was assessed using AMSTAR-2. Evidence certainty was evaluated using an algorithmic version of the GRADE framework, adapted for drug and non-drug interventions."
        },
        {
          "label": "RESULTS",
          "text": "115 of 414 full text articles were deemed eligible and 299 were excluded; the eligible articles comprised 221 unique combinations of participants, interventions, comparators, and outcomes. For each combination, the most recent and methodologically robust meta-analysis was selected for re-estimation, which gave 221 re-estimated meta-analyses in total, derived from 47 meta-analytic reports. In the short term, alpha-2 agonists, amphetamines, atomoxetine, methylphenidate, and viloxazine showed medium to large effect sizes in reducing the severity of ADHD symptoms in children and adolescents, with moderate to high certainty evidence. Methylphenidate showed consistent benefits across raters (standardised mean difference >0.75, 95% confidence interval (CI) 0.56 to 1.03; moderate or high certainty evidence). These interventions showed lower tolerability than the placebo, but this effect was not significant for methylphenidate and atomoxetine. In adults, atomoxetine, cognitive behavioural therapy, methylphenidate (and, when restricting analyses to high quality trials, amphetamines) showed at least moderate certainty evidence of efficacy on ADHD symptoms, with medium effect sizes. Methylphenidate, amphetamines, and atomoxetine had worse tolerability than placebo (methylphenidate, risk ratio 0.50, 95% CI 0.36 to 0.69; amphetamines, 0.40, 0.22 to 0.72; atomoxetine, 0.45, 0.35 to 0.58). Some non-drug interventions (acupuncture and cognitive behavioural therapy in children and adolescents, and mindfulness in adults) showed large effect sizes for ADHD symptoms, but with low certainty evidence. No high certainty, long term evidence was found for any intervention. An online platform showing effects and evidence certainty of each intervention across age groups, time points, and outcomes (https://ebiadhd-database.org/) was developed."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This review provides updated evidence to inform patients, practitioners, and guideline developers how best to manage ADHD symptoms. The online platform should facilitate the implementation of shared decision making in daily practice."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Open Science Framework https://osf.io/ugqy6/."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41297970/",
      "pubDate": "2025 Nov 26",
      "doi": "10.1136/bmj-2025-085875",
      "dateReceived": "2025-12-10T23:25:14.872Z",
      "isNew": false
    },
    {
      "id": "3a9990f67afa",
      "title": "Comparative Effectiveness and Harm of Seasonal Influenza Vaccines in Adults Who Are Not Pregnant or Immunocompromised: A Rapid Review for the American College of Physicians.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49177163/118191",
      "abstract": "The American College of Physicians (ACP) developed these rapid practice points addressing the comparative effectiveness and harms of trivalent (3 different influenza viruses or viral proteins) and quadrivalent (4 different influenza viruses or viral proteins) influenza vaccines in adults aged 18 years or older who are not pregnant or immunocompromised. These practice points do not address adults aged 18 years or older who are pregnant or immunocompromised. The ACP Population Health and Medical Science Committee (PHMSC) developed the rapid practice points on the basis of a rapid review by the ACP Center for Evidence Reviews at Cochrane Austria. The rapid review was a focused update of the 2024 comprehensive, high-quality systematic review and meta-analysis conducted by the European Centre for Disease Prevention and Control. The ACP PHMSC focused on the comparative effectiveness of influenza vaccines compared with each other because of the established efficacy and safety of the standard influenza vaccines.",
      "structuredAbstract": [
        {
          "label": "DESCRIPTION",
          "text": "The American College of Physicians (ACP) developed these rapid practice points addressing the comparative effectiveness and harms of trivalent (3 different influenza viruses or viral proteins) and quadrivalent (4 different influenza viruses or viral proteins) influenza vaccines in adults aged 18 years or older who are not pregnant or immunocompromised. These practice points do not address adults aged 18 years or older who are pregnant or immunocompromised."
        },
        {
          "label": "METHODS",
          "text": "The ACP Population Health and Medical Science Committee (PHMSC) developed the rapid practice points on the basis of a rapid review by the ACP Center for Evidence Reviews at Cochrane Austria. The rapid review was a focused update of the 2024 comprehensive, high-quality systematic review and meta-analysis conducted by the European Centre for Disease Prevention and Control. The ACP PHMSC focused on the comparative effectiveness of influenza vaccines compared with each other because of the established efficacy and safety of the standard influenza vaccines."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41248504/",
      "pubDate": "2025 Nov 18",
      "doi": "10.7326/ANNALS-25-04056",
      "dateReceived": "2025-12-10T23:25:14.872Z",
      "isNew": false
    },
    {
      "id": "12e950a3003e",
      "title": "Incremental Value of Cardiac Myosin-Binding Protein C for the Early Diagnosis of Acute Myocardial Infarction.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49138101/118154",
      "abstract": "Cardiac myosin-binding protein C (cMyC) is a cardiac-specific sarcomeric protein with faster release kinetics compared with those of high-sensitivity cardiac troponin (hs-cTn). The aim of this study was to compare the diagnostic performance of cMyC, measured with a novel prototype automated immunoassay, with high-sensitivity cardiac troponin T (hs-cTnT) and high-sensitivity cardiac troponin I (hs-cTnI) for the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI). Furthermore, we derived a single blood draw dual-biomarker strategy combining hs-cTn and cMyC and compared it with the hs-cTnT/I-only strategy endorsed by the European Society of Cardiology. This was a secondary analysis from an international prospective study recruiting adult patients presenting to the emergency department (ED) with suspected NSTEMI. cMyC, hs-cTnT, and hs-cTnI concentrations were measured upon ED presentation. Final diagnoses were centrally adjudicated by 2 independent cardiologists blinded to cMyC values. To compare the single- and dual-biomarker strategy, safety (defined as the sensitivity and negative predictive value for ruling out index NSTEMI) and triage efficacy (defined as the proportion of patients triaged to either rule-out or rule-in) were assessed. The diagnostic endpoint was index NSTEMI. The prognostic endpoint was 30-day, 1-year, and 5-year cardiovascular death or MI. Findings were externally validated in an independent international cohort. Among 4,735 eligible patients, 854 (18%) were diagnosed with NSTEMI. The discrimination for NSTEMI at presentation was higher for cMyC (area under the curve [AUC]: 0.943; 95% CI: 0.936-0.95) than for hs-cTnT (AUC: 0.936; 95% CI: 0.929-0.944; P = 0.008). Differences were mainly driven by patients with chest pain onset ≤3 hours (AUC of 0.939 [95% CI: 0.928-0.951] vs 0.921 [95% CI: 0.907-0.936], respectively; P < 0.001). The dual-biomarker strategy increased overall triage efficacy from 26.8% (hs-cTnT only) to 60.0% (hs-cTnT and cMyC), without compromising safety during the index visit. Despite identifying up to 3 times more patients for rule-out, the dual-biomarker strategy showed comparable cumulative incidences of cardiovascular death or myocardial infarction at 30 days, 1 year, and 5 years. Similar results were observed with hs-cTnI and in the external validation cohort. CMyC adds significant incremental value to hs-cTn values in the early diagnosis of NSTEMI, improving diagnostic discrimination and enabling more patients to be safely and immediately ruled out for NSTEMI. The single blood draw dual-biomarker strategy is particularly attractive in busy ED settings due to its simplicity and quick time-to-decision. (Advantageous Predictors of Acute Coronary Syndromes Evaluation [APACE]; NCT00470587).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cardiac myosin-binding protein C (cMyC) is a cardiac-specific sarcomeric protein with faster release kinetics compared with those of high-sensitivity cardiac troponin (hs-cTn)."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this study was to compare the diagnostic performance of cMyC, measured with a novel prototype automated immunoassay, with high-sensitivity cardiac troponin T (hs-cTnT) and high-sensitivity cardiac troponin I (hs-cTnI) for the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI). Furthermore, we derived a single blood draw dual-biomarker strategy combining hs-cTn and cMyC and compared it with the hs-cTnT/I-only strategy endorsed by the European Society of Cardiology."
        },
        {
          "label": "METHODS",
          "text": "This was a secondary analysis from an international prospective study recruiting adult patients presenting to the emergency department (ED) with suspected NSTEMI. cMyC, hs-cTnT, and hs-cTnI concentrations were measured upon ED presentation. Final diagnoses were centrally adjudicated by 2 independent cardiologists blinded to cMyC values. To compare the single- and dual-biomarker strategy, safety (defined as the sensitivity and negative predictive value for ruling out index NSTEMI) and triage efficacy (defined as the proportion of patients triaged to either rule-out or rule-in) were assessed. The diagnostic endpoint was index NSTEMI. The prognostic endpoint was 30-day, 1-year, and 5-year cardiovascular death or MI. Findings were externally validated in an independent international cohort."
        },
        {
          "label": "RESULTS",
          "text": "Among 4,735 eligible patients, 854 (18%) were diagnosed with NSTEMI. The discrimination for NSTEMI at presentation was higher for cMyC (area under the curve [AUC]: 0.943; 95% CI: 0.936-0.95) than for hs-cTnT (AUC: 0.936; 95% CI: 0.929-0.944; P = 0.008). Differences were mainly driven by patients with chest pain onset ≤3 hours (AUC of 0.939 [95% CI: 0.928-0.951] vs 0.921 [95% CI: 0.907-0.936], respectively; P < 0.001). The dual-biomarker strategy increased overall triage efficacy from 26.8% (hs-cTnT only) to 60.0% (hs-cTnT and cMyC), without compromising safety during the index visit. Despite identifying up to 3 times more patients for rule-out, the dual-biomarker strategy showed comparable cumulative incidences of cardiovascular death or myocardial infarction at 30 days, 1 year, and 5 years. Similar results were observed with hs-cTnI and in the external validation cohort."
        },
        {
          "label": "CONCLUSIONS",
          "text": "CMyC adds significant incremental value to hs-cTn values in the early diagnosis of NSTEMI, improving diagnostic discrimination and enabling more patients to be safely and immediately ruled out for NSTEMI. The single blood draw dual-biomarker strategy is particularly attractive in busy ED settings due to its simplicity and quick time-to-decision. (Advantageous Predictors of Acute Coronary Syndromes Evaluation [APACE]; NCT00470587)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41222525/",
      "pubDate": "2025 Oct 13",
      "doi": "10.1016/j.jacc.2025.09.008",
      "dateReceived": "2025-12-09T23:27:24.457Z",
      "isNew": false
    },
    {
      "id": "880c3a104390",
      "title": "Three-Year Follow-Up of the NOTION-2 Trial: TAVR Versus SAVR to Treat Younger Low-Risk Patients With Tricuspid or Bicuspid Aortic Stenosis.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49247839/118266",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40920842/",
      "pubDate": "2025 Sep 09",
      "doi": "10.1161/CIRCULATIONAHA.125.075818",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "0bbca486d594",
      "title": "Efficacy and safety of bi-weekly cofrogliptin treatment replacing daily dipeptidyl peptidase-4 inhibitors in Chinese patients with type 2 diabetes mellitus: A multicenter, open-label, randomized controlled phase 2 trial.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49247839/118249",
      "abstract": "This study aimed to investigate the efficacy and safety of bi-weekly cofrogliptin treatment as a replacement for daily dipeptidyl peptidase-4 inhibitors (DPP-4is) in Chinese patients with type 2 diabetes mellitus (T2DM). This multicenter, open-label, randomized controlled study assigned participants in a 1:1 ratio to either the daily DPP-4i group or the 10 mg cofrogliptin group. The DPP-4i group continued their original daily DPP-4i regimen for 24 weeks, whereas the cofrogliptin group discontinued the daily DPP-4i and received the investigational drug orally once every 2 weeks. All participants underwent 14-day continuous glucose monitoring at weeks 10-12 and 22-24 during the treatment period. The main endpoint was the change in glucose time in range (TIR; 3.9-10.0 mmol/L) from baseline to week 24. Additionally, the Diabetes Treatment Satisfaction Questionnaire scores, adverse events, and hypoglycaemic events were compared between groups. The enrolment period was from 31 January 2024 to 20 November 2024. A total of 64 participants were randomized to receive either cofrogliptin (n = 31) or a daily DPP-4i (n = 33). The least squares (LS) mean (standard error) change in TIR from baseline after 24 weeks was 0.037% ± 2.506% in the cofrogliptin group compared to -9.891% ± 2.435% in the daily DPP-4i group. The LS mean difference was 9.929% (95% confidence interval: 3.064%-16.793%), which was statistically significant (p = 0.0046). The incidence, classification, and severity of adverse events were similar between the two groups. Bi-weekly cofrogliptin treatment, instead of daily DPP-4i, could effectively control blood glucose levels in a 24-week treatment period and their fluctuations and was well tolerated in Chinese patients with T2DM.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "This study aimed to investigate the efficacy and safety of bi-weekly cofrogliptin treatment as a replacement for daily dipeptidyl peptidase-4 inhibitors (DPP-4is) in Chinese patients with type 2 diabetes mellitus (T2DM)."
        },
        {
          "label": "METHODS",
          "text": "This multicenter, open-label, randomized controlled study assigned participants in a 1:1 ratio to either the daily DPP-4i group or the 10 mg cofrogliptin group. The DPP-4i group continued their original daily DPP-4i regimen for 24 weeks, whereas the cofrogliptin group discontinued the daily DPP-4i and received the investigational drug orally once every 2 weeks. All participants underwent 14-day continuous glucose monitoring at weeks 10-12 and 22-24 during the treatment period. The main endpoint was the change in glucose time in range (TIR; 3.9-10.0 mmol/L) from baseline to week 24. Additionally, the Diabetes Treatment Satisfaction Questionnaire scores, adverse events, and hypoglycaemic events were compared between groups."
        },
        {
          "label": "RESULTS",
          "text": "The enrolment period was from 31 January 2024 to 20 November 2024. A total of 64 participants were randomized to receive either cofrogliptin (n = 31) or a daily DPP-4i (n = 33). The least squares (LS) mean (standard error) change in TIR from baseline after 24 weeks was 0.037% ± 2.506% in the cofrogliptin group compared to -9.891% ± 2.435% in the daily DPP-4i group. The LS mean difference was 9.929% (95% confidence interval: 3.064%-16.793%), which was statistically significant (p = 0.0046). The incidence, classification, and severity of adverse events were similar between the two groups."
        },
        {
          "label": "CONCLUSION",
          "text": "Bi-weekly cofrogliptin treatment, instead of daily DPP-4i, could effectively control blood glucose levels in a 24-week treatment period and their fluctuations and was well tolerated in Chinese patients with T2DM."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41267147/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1111/dom.70305",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "39bdfd92d5ff",
      "title": "AGA Living Clinical Practice Guideline on the Pharmacologic Management of Moderate-to-Severe Crohn's Disease.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49247839/118233",
      "abstract": "This American Gastroenterological Association (AGA) living guideline is intended to support practitioners in the pharmacologic management of moderate-to-severely active Crohn's disease (CD). A multidisciplinary panel of clinical experts and methodologists used the Grading of Recommendations Assessment, Development and Evaluation (GRADE) framework to prioritize clinical questions, identify patient-centered outcomes, conduct an evidence synthesis, and develop recommendations. The guideline panel agreed on 16 recommendations, of which 1 is a strong recommendation, 9 are conditional recommendations, and 6 were identified as knowledge gaps. In adult patients with moderate-to-severely active CD, the AGA recommends the use of infliximab, adalimumab, ustekinumab, risankizumab, mirikizumab, guselkumab, or upadacitinib over no treatment, and suggests the use of certolizumab pegol or vedolizumab over no treatment. In individuals who are naïve to advanced therapies, the AGA suggests using a higher efficacy medication (infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, or guselkumab) rather than a lower-efficacy medication (certolizumab pegol or upadacitinib). In individuals who have previously been exposed to 1 or more advanced therapies, the AGA suggests using a higher efficacy medication (adalimumab, risankizumab, guselkumab, or upadacitinib) or intermediate efficacy medication (ustekinumab or mirikizumab) rather than a lower efficacy medication (vedolizumab or certolizumab pegol). In adult outpatients with moderate-to-severely active CD, the AGA suggests against using thiopurine monotherapy for induction of remission, but suggests using thiopurine monotherapy over no treatment for maintenance of (typically corticosteroid-induced) remission. The AGA suggests using subcutaneous methotrexate for induction and maintenance of remission, but suggests against using oral methotrexate. The AGA suggests using combination therapy with infliximab and thiopurines over infliximab monotherapy, particularly in those naïve to thiopurines. The AGA also suggests using initial advanced therapy over step therapy involving corticosteroids and/or immunomodulators in patients with moderate-to-severely active CD. The panel also proposed key implementation considerations for optimal use of these medications, identified several knowledge gaps, and areas for future research. This guideline provides a comprehensive, patient-centered, evidence-based approach to the pharmacologic management of patients with moderate-to-severely active CD.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "This American Gastroenterological Association (AGA) living guideline is intended to support practitioners in the pharmacologic management of moderate-to-severely active Crohn's disease (CD)."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary panel of clinical experts and methodologists used the Grading of Recommendations Assessment, Development and Evaluation (GRADE) framework to prioritize clinical questions, identify patient-centered outcomes, conduct an evidence synthesis, and develop recommendations."
        },
        {
          "label": "RESULTS",
          "text": "The guideline panel agreed on 16 recommendations, of which 1 is a strong recommendation, 9 are conditional recommendations, and 6 were identified as knowledge gaps. In adult patients with moderate-to-severely active CD, the AGA recommends the use of infliximab, adalimumab, ustekinumab, risankizumab, mirikizumab, guselkumab, or upadacitinib over no treatment, and suggests the use of certolizumab pegol or vedolizumab over no treatment. In individuals who are naïve to advanced therapies, the AGA suggests using a higher efficacy medication (infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, or guselkumab) rather than a lower-efficacy medication (certolizumab pegol or upadacitinib). In individuals who have previously been exposed to 1 or more advanced therapies, the AGA suggests using a higher efficacy medication (adalimumab, risankizumab, guselkumab, or upadacitinib) or intermediate efficacy medication (ustekinumab or mirikizumab) rather than a lower efficacy medication (vedolizumab or certolizumab pegol). In adult outpatients with moderate-to-severely active CD, the AGA suggests against using thiopurine monotherapy for induction of remission, but suggests using thiopurine monotherapy over no treatment for maintenance of (typically corticosteroid-induced) remission. The AGA suggests using subcutaneous methotrexate for induction and maintenance of remission, but suggests against using oral methotrexate. The AGA suggests using combination therapy with infliximab and thiopurines over infliximab monotherapy, particularly in those naïve to thiopurines. The AGA also suggests using initial advanced therapy over step therapy involving corticosteroids and/or immunomodulators in patients with moderate-to-severely active CD. The panel also proposed key implementation considerations for optimal use of these medications, identified several knowledge gaps, and areas for future research."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This guideline provides a comprehensive, patient-centered, evidence-based approach to the pharmacologic management of patients with moderate-to-severely active CD."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41274746/",
      "pubDate": "2025 Dec",
      "doi": "10.1053/j.gastro.2025.09.038",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "6720003fd7ca",
      "title": "Validation of the European Society of Cardiology 0/1-hour algorithm for chest pain triage in Asian emergency departments: a multinational stepped-wedge cluster-randomised trial.",
      "journal": "Heart",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118228",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "9cf51224f975",
      "title": "Medical Management and Revascularization for Asymptomatic Carotid Stenosis.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118225",
      "abstract": "Improvements in medical therapy, carotid-artery stenting, and carotid endarterectomy call into question the preferred management of asymptomatic carotid stenosis. Whether adding revascularization to intensive medical management would provide greater benefit than intensive medical management alone is unclear. We conducted two parallel, observer-blinded clinical trials that enrolled patients with high-grade (≥70%) asymptomatic carotid stenosis across 155 centers in five countries. The stenting trial compared intensive medical management alone (medical-therapy group) with carotid-artery stenting plus intensive medical management (stenting group); the endarterectomy trial compared intensive medical management alone (medical-therapy group) with carotid endarterectomy plus intensive medical management (endarterectomy group). The primary outcome was a composite of any stroke or death, assessed from randomization to 44 days, or ipsilateral ischemic stroke, assessed during the remaining follow-up period up to 4 years. A total of 1245 patients underwent randomization in the stenting trial and 1240 in the endarterectomy trial. In the stenting trial, the 4-year incidence of primary-outcome events was 6.0% (95% confidence interval [CI], 3.8 to 8.3) in the medical-therapy group and 2.8% (95% CI, 1.5 to 4.3) in the stenting group (P = 0.02 for the absolute difference). In the endarterectomy trial, the 4-year incidence of primary-outcome events was 5.3% (95% CI, 3.3 to 7.4) in the medical-therapy group and 3.7% (95% CI, 2.1 to 5.5) in the endarterectomy group (P = 0.24 for the absolute difference). From day 0 to 44, in the stenting trial, no strokes or deaths occurred in the medical-therapy group and seven strokes and one death occurred in the stenting group; in the endarterectomy trial, three strokes occurred in the medical-therapy group and nine strokes occurred in the endarterectomy group. Among patients with high-grade stenosis without recent symptoms, the addition of stenting led to a lower risk of a composite of perioperative stroke or death or ipsilateral stroke within 4 years than intensive medical management alone. Carotid endarterectomy did not lead to a significant benefit. (Funded by the National Institute of Neurological Disorders and Stroke and others; CREST-2 ClinicalTrials.gov number, NCT02089217.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Improvements in medical therapy, carotid-artery stenting, and carotid endarterectomy call into question the preferred management of asymptomatic carotid stenosis. Whether adding revascularization to intensive medical management would provide greater benefit than intensive medical management alone is unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted two parallel, observer-blinded clinical trials that enrolled patients with high-grade (≥70%) asymptomatic carotid stenosis across 155 centers in five countries. The stenting trial compared intensive medical management alone (medical-therapy group) with carotid-artery stenting plus intensive medical management (stenting group); the endarterectomy trial compared intensive medical management alone (medical-therapy group) with carotid endarterectomy plus intensive medical management (endarterectomy group). The primary outcome was a composite of any stroke or death, assessed from randomization to 44 days, or ipsilateral ischemic stroke, assessed during the remaining follow-up period up to 4 years."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1245 patients underwent randomization in the stenting trial and 1240 in the endarterectomy trial. In the stenting trial, the 4-year incidence of primary-outcome events was 6.0% (95% confidence interval [CI], 3.8 to 8.3) in the medical-therapy group and 2.8% (95% CI, 1.5 to 4.3) in the stenting group (P = 0.02 for the absolute difference). In the endarterectomy trial, the 4-year incidence of primary-outcome events was 5.3% (95% CI, 3.3 to 7.4) in the medical-therapy group and 3.7% (95% CI, 2.1 to 5.5) in the endarterectomy group (P = 0.24 for the absolute difference). From day 0 to 44, in the stenting trial, no strokes or deaths occurred in the medical-therapy group and seven strokes and one death occurred in the stenting group; in the endarterectomy trial, three strokes occurred in the medical-therapy group and nine strokes occurred in the endarterectomy group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with high-grade stenosis without recent symptoms, the addition of stenting led to a lower risk of a composite of perioperative stroke or death or ipsilateral stroke within 4 years than intensive medical management alone. Carotid endarterectomy did not lead to a significant benefit. (Funded by the National Institute of Neurological Disorders and Stroke and others; CREST-2 ClinicalTrials.gov number, NCT02089217.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41269206/",
      "pubDate": "2025 Nov 21",
      "doi": "10.1056/NEJMoa2508800",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "7ae75e26f1e6",
      "title": "Biweekly dosing of efsubaglutide alfa maintains glycaemic and continuous glucose monitoring control in type 2 diabetes: A randomised multicentre trial.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118213",
      "abstract": "To compare the glycaemic efficacy, continuous glucose monitoring (CGM) metrics, and safety of biweekly efsubaglutide alfa 3 mg (Q2W) versus weekly 1 mg (QW) in adults with type 2 diabetes inadequately controlled with lifestyle intervention. In this multicentre, randomised, open-label trial, 59 adults were allocated 1:1 to efsubaglutide alfa 3 mg Q2W or 1 mg QW for 12 weeks after a 1-week 1 mg run-in. The primary endpoint was change in HbA1c from baseline to week 13 (end of 12-week treatment). Secondary endpoints included fasting plasma glucose (FPG), CGM time in range (TIR, 3.9-10.0 mmol/L) and tight TIR (3.9-7.8 mmol/L), 24-h mean glucose, weight, lipids, and adverse events. Continuous outcomes were analysed using a mixed model for repeated measures (MMRM); categorical outcomes used stratified Mantel-Haenszel tests; p values/CI were descriptive. HbA1c decreased by -1.45% (SE 0.14) with Q2W and -1.53% (0.14) with QW; LS mean difference (Q2W-QW) 0.09% (95% CI -0.32, 0.50). FPG fell similarly (-2.07 vs. -2.22 mmol/L). TIR increased from 45.0% to 77.2% with Q2W and 75.1% with QW; tight TIR reached 53.8% and 48.8%, respectively. End-of-treatment 24-h mean CGM glucose was 8.12 versus 8.66 mmol/L (Q2W vs. QW). At week 13, HbA1c <7.0% was achieved by 55.2% (Q2W) and 65.5% (QW); ≤6.5% by 37.9% and 24.1%. Gastrointestinal adverse events predominated and were mostly mild to moderate; no hypoglycaemia or cardiovascular events occurred. Over 12 weeks, efsubaglutide alfa 3 mg Q2W provided glycaemic and CGM benefits comparable to 1 mg QW with favourable tolerability. These findings support the feasibility of a biweekly regimen as an alternative to weekly dosing; larger, longer-duration confirmatory trials in more diverse populations are warranted.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To compare the glycaemic efficacy, continuous glucose monitoring (CGM) metrics, and safety of biweekly efsubaglutide alfa 3 mg (Q2W) versus weekly 1 mg (QW) in adults with type 2 diabetes inadequately controlled with lifestyle intervention."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "In this multicentre, randomised, open-label trial, 59 adults were allocated 1:1 to efsubaglutide alfa 3 mg Q2W or 1 mg QW for 12 weeks after a 1-week 1 mg run-in. The primary endpoint was change in HbA1c from baseline to week 13 (end of 12-week treatment). Secondary endpoints included fasting plasma glucose (FPG), CGM time in range (TIR, 3.9-10.0 mmol/L) and tight TIR (3.9-7.8 mmol/L), 24-h mean glucose, weight, lipids, and adverse events. Continuous outcomes were analysed using a mixed model for repeated measures (MMRM); categorical outcomes used stratified Mantel-Haenszel tests; p values/CI were descriptive."
        },
        {
          "label": "RESULTS",
          "text": "HbA1c decreased by -1.45% (SE 0.14) with Q2W and -1.53% (0.14) with QW; LS mean difference (Q2W-QW) 0.09% (95% CI -0.32, 0.50). FPG fell similarly (-2.07 vs. -2.22 mmol/L). TIR increased from 45.0% to 77.2% with Q2W and 75.1% with QW; tight TIR reached 53.8% and 48.8%, respectively. End-of-treatment 24-h mean CGM glucose was 8.12 versus 8.66 mmol/L (Q2W vs. QW). At week 13, HbA1c <7.0% was achieved by 55.2% (Q2W) and 65.5% (QW); ≤6.5% by 37.9% and 24.1%. Gastrointestinal adverse events predominated and were mostly mild to moderate; no hypoglycaemia or cardiovascular events occurred."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Over 12 weeks, efsubaglutide alfa 3 mg Q2W provided glycaemic and CGM benefits comparable to 1 mg QW with favourable tolerability. These findings support the feasibility of a biweekly regimen as an alternative to weekly dosing; larger, longer-duration confirmatory trials in more diverse populations are warranted."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208635/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70262",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "d296d565de08",
      "title": "Oral itraconazole versus oral voriconazole for treatment-naive patients with chronic pulmonary aspergillosis in India (VICTOR-CPA trial): a single-centre, open-label, randomised, controlled, superiority trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118203",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "932524d02b9a",
      "title": "Transepidermal Water Loss in Oral Food Challenges in Children With Peanut Allergy: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118199",
      "abstract": "Food allergy is a prevalent chronic medical condition in children, with limited diagnostic options. Transepidermal water loss (TEWL) is a measure of skin barrier function with emerging utility in atopy and food allergy. To determine whether use of TEWL as a stopping criterion can prevent anaphylaxis during a peanut oral food challenge (OFC). This was a single-center randomized clinical trial of children aged 6 months to 5 years with a history of a clinical peanut allergic reaction and positive peanut skin prick and/or serum immunoglobulin E testing. All participants underwent peanut OFC at an allergy referral clinic. The study began May 1, 2023, and ended August 31, 2024. The intervention was stopping OFC based on a 1 g/m2/h rise in TEWL plus 1 objective allergic symptom observed by the physician during OFC. Standard OFC stopping criteria or the intervention criteria, whichever came first, were used in the intervention group. OFC stopping criteria from standard research were used in the control group. This was a single-intervention study. Rate of anaphylaxis, defined as a Consortium for Food Allergy Research (CoFAR) score of 2 or higher, compared between the intervention and control groups using 4 anaphylaxis criteria approaches: CoFAR, Brighton Collaboration, Food Allergy and Anaphylaxis Network (FAAN), and World Allergy Organization (WAO). A total of 40 participants were included in the final analysis. The mean (SD) age of participants was 31.8 (16.18) months, with a median of 32.5 (range, 9-62) months; 23 (58%) were male. Using CoFAR criteria, among reactors, the anaphylaxis rate was 10 of 16 (63%; 95% CI, 39%-86%) in the intervention group compared with 14 of 14 (100%; 95% CI, 100%-100%) in the control group (P = .02). Using WAO criteria, 2 of 16 participants were reactors in the intervention group (anaphylaxis rate, 13%; 95% CI, 0%-29%) compared with 8 of 14 (57%; 95% CI, 31%-83%) in the control group (P = .02). There was no significant difference when comparing anaphylaxis rates using Brighton or FAAN criteria (eg, rate of 56% [95% CI, 32%-81%] vs 71% [95% CI, 48%-95%] in intervention vs control participants using Brighton criteria [P = .47]). The median CoFAR score in reactors in the intervention vs control groups was 1.8 (IQR, 1.0-2.0) vs 2.6 (IQR, 2.0-3.0) (P = .006). Eight of 16 participants (50%) in the intervention vs 12 of 14 (86%) in the control group required epinephrine (P = .06). In this randomized clinical trial, prospective use of TEWL as a stopping criterion reduced anaphylaxis rates during OFC in children with peanut allergy, suggesting use of TEWL could make OFC safer and more accessible. Replicating this study in a larger, multicenter population is a reasonable next step. ClinicalTrials.gov Identifier: NCT05696236.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Food allergy is a prevalent chronic medical condition in children, with limited diagnostic options. Transepidermal water loss (TEWL) is a measure of skin barrier function with emerging utility in atopy and food allergy."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether use of TEWL as a stopping criterion can prevent anaphylaxis during a peanut oral food challenge (OFC)."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a single-center randomized clinical trial of children aged 6 months to 5 years with a history of a clinical peanut allergic reaction and positive peanut skin prick and/or serum immunoglobulin E testing. All participants underwent peanut OFC at an allergy referral clinic. The study began May 1, 2023, and ended August 31, 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "The intervention was stopping OFC based on a 1 g/m2/h rise in TEWL plus 1 objective allergic symptom observed by the physician during OFC. Standard OFC stopping criteria or the intervention criteria, whichever came first, were used in the intervention group. OFC stopping criteria from standard research were used in the control group. This was a single-intervention study."
        },
        {
          "label": "MAIN OUTCOME AND MEASURES",
          "text": "Rate of anaphylaxis, defined as a Consortium for Food Allergy Research (CoFAR) score of 2 or higher, compared between the intervention and control groups using 4 anaphylaxis criteria approaches: CoFAR, Brighton Collaboration, Food Allergy and Anaphylaxis Network (FAAN), and World Allergy Organization (WAO)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 40 participants were included in the final analysis. The mean (SD) age of participants was 31.8 (16.18) months, with a median of 32.5 (range, 9-62) months; 23 (58%) were male. Using CoFAR criteria, among reactors, the anaphylaxis rate was 10 of 16 (63%; 95% CI, 39%-86%) in the intervention group compared with 14 of 14 (100%; 95% CI, 100%-100%) in the control group (P = .02). Using WAO criteria, 2 of 16 participants were reactors in the intervention group (anaphylaxis rate, 13%; 95% CI, 0%-29%) compared with 8 of 14 (57%; 95% CI, 31%-83%) in the control group (P = .02). There was no significant difference when comparing anaphylaxis rates using Brighton or FAAN criteria (eg, rate of 56% [95% CI, 32%-81%] vs 71% [95% CI, 48%-95%] in intervention vs control participants using Brighton criteria [P = .47]). The median CoFAR score in reactors in the intervention vs control groups was 1.8 (IQR, 1.0-2.0) vs 2.6 (IQR, 2.0-3.0) (P = .006). Eight of 16 participants (50%) in the intervention vs 12 of 14 (86%) in the control group required epinephrine (P = .06)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, prospective use of TEWL as a stopping criterion reduced anaphylaxis rates during OFC in children with peanut allergy, suggesting use of TEWL could make OFC safer and more accessible. Replicating this study in a larger, multicenter population is a reasonable next step."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05696236."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41236740/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.43371",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "6a23b11c9b26",
      "title": "Fu's Subcutaneous Needling for Pain: A Systematic Review and Meta-Analysis of Randomized Controlled Trials.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118105",
      "dateReceived": "2025-12-09T23:27:24.456Z",
      "isNew": false
    },
    {
      "id": "9a98d8207e12",
      "title": "Early subcutaneous basal insulin with intravenous insulin infusion for diabetic ketoacidosis management: A systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Endocrine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49138101/118215",
      "abstract": "To evaluate the effectiveness and safety of early initiation of subcutaneous (SC) basal insulin in combination with intravenous insulin infusion (IVII), compared with IVII alone, for the management of diabetic ketoacidosis (DKA). A systematic search of PubMed, Embase, Scopus, and the Cochrane Library was conducted to identify randomised controlled trials (RCTs) comparing early initiation of long- or ultra-long-acting basal insulin plus IVII versus IVII alone in DKA management. Studies published up to 6 September 2025, were included. Meta-analysis was performed using mean difference (MD) for continuous outcomes and risk ratio for dichotomous outcomes, both with a 95% confidence interval (CI). The primary outcome was time to DKA resolution. Secondary outcomes included total intravenous insulin use, rebound hyperglycemia, hypoglycemia, hypokalemia, length of hospital stay (LOS), and mortality. A one-stage individual participant data meta-analysis was also conducted when individual-level data were available. Eight RCTs including 468 participants (256 receiving early SC basal insulin plus IVII; 212 receiving IVII alone) were included. Baseline characteristics were comparable across studies. Early SC basal insulin significantly reduced time to DKA resolution (MD -4.02 h, 95%CI -5.52 to -2.52, p <0.001) and total intravenous insulin dose until DKA resolution (MD -19.2 units, 95%CI -28.99 to -9.26, p <0.001). No significant differences were observed between groups for rebound hyperglycemia, safety outcomes, LOS, or in-hospital mortality. Early SC basal insulin in combination with IVII significantly accelerates DKA resolution and reduces total IVII requirements, without increasing the risk of adverse events, including hypoglycemia or hypokalemia.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To evaluate the effectiveness and safety of early initiation of subcutaneous (SC) basal insulin in combination with intravenous insulin infusion (IVII), compared with IVII alone, for the management of diabetic ketoacidosis (DKA)."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "A systematic search of PubMed, Embase, Scopus, and the Cochrane Library was conducted to identify randomised controlled trials (RCTs) comparing early initiation of long- or ultra-long-acting basal insulin plus IVII versus IVII alone in DKA management. Studies published up to 6 September 2025, were included. Meta-analysis was performed using mean difference (MD) for continuous outcomes and risk ratio for dichotomous outcomes, both with a 95% confidence interval (CI). The primary outcome was time to DKA resolution. Secondary outcomes included total intravenous insulin use, rebound hyperglycemia, hypoglycemia, hypokalemia, length of hospital stay (LOS), and mortality. A one-stage individual participant data meta-analysis was also conducted when individual-level data were available."
        },
        {
          "label": "RESULTS",
          "text": "Eight RCTs including 468 participants (256 receiving early SC basal insulin plus IVII; 212 receiving IVII alone) were included. Baseline characteristics were comparable across studies. Early SC basal insulin significantly reduced time to DKA resolution (MD -4.02 h, 95%CI -5.52 to -2.52, p <0.001) and total intravenous insulin dose until DKA resolution (MD -19.2 units, 95%CI -28.99 to -9.26, p <0.001). No significant differences were observed between groups for rebound hyperglycemia, safety outcomes, LOS, or in-hospital mortality."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Early SC basal insulin in combination with IVII significantly accelerates DKA resolution and reduces total IVII requirements, without increasing the risk of adverse events, including hypoglycemia or hypokalemia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208563/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70276",
      "dateReceived": "2025-12-08T23:26:30.882Z",
      "isNew": false
    },
    {
      "id": "32cb959a4fec",
      "title": "Levosimendan to Facilitate Weaning From ECMO in Patients With Severe Cardiogenic Shock: The LEVOECMO Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49222050/118279",
      "abstract": "Levosimendan may facilitate weaning from venoarterial extracorporeal membrane oxygenation (VA-ECMO) and improve survival, but supporting evidence remains limited. To assess whether early administration of levosimendan reduces the time to successful VA-ECMO weaning in patients with severe but potentially reversible cardiogenic shock. Randomized, double-blind, placebo-controlled trial conducted across 11 intensive care units (ICUs) in France. Between August 27, 2021, and September 10, 2024, 205 adult patients with acute cardiogenic shock who had started VA-ECMO in the preceding 48 hours were enrolled. Final follow-up was completed on November 10, 2024. Patients were randomized in a 1:1 ratio to receive levosimendan, 0.15 μg/kg per minute, to be increased to 0.20 μg/kg per minute after 2 hours (n = 101), or placebo (n = 104). The primary outcome was time to successful ECMO weaning within 30 days following randomization. Secondary outcomes included ECMO-, mechanical ventilation-, and organ failure-free days, ICU and hospital lengths of stay, serious adverse events, and all-cause 30- and 60-day mortality. Among the 205 randomized patients (median age, 58 [IQR, 50-67] years; 149 [72.7%] male), main cardiogenic shock etiologies were postcardiotomy (79 [38.5%]), acute myocardial infarction (56 [27.3%]), and myocarditis (28 [13.7%]). Treatment dose was increased to 0.20 ± 0.01 μg/kg per minute in 93% of patients receiving levosimendan and in 96% of those receiving placebo. Within 30 days, 69 of 101 patients (68.3%) had a successful ECMO weaning in the levosimendan group compared with 71 of 104 (68.3%) in the placebo group (risk difference, 0.0% [95% CI, -12.8% to 12.7%]; subdistribution hazard ratio, 1.02 [95% CI, 0.74-1.39]; P = .92). In the levosimendan and placebo groups, respectively, median ECMO duration (5 [IQR, 4-7] days vs 6 [IQR, 4-11] days; P = .53), mean ICU length of stay (18 [SD, 15] days vs 19 [SD, 15] days; P = .42), and 60-day mortality (27.7% vs 25.0%; risk difference, 2.7% [95% CI, -9.0% to 15.3%]; P = .78) did not differ significantly. Ventricular arrhythmias occurred more frequently with levosimendan (18 [17.8%] vs 9 [8.7%]; absolute risk difference, 9.2% [95% CI, 0.4%-18.1%]). Among patients with severe but potentially reversible cardiogenic shock supported by VA-ECMO, early levosimendan administration did not significantly reduce the time to successful weaning of ECMO compared with placebo. ClinicalTrials.gov Identifier: NCT04728932.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Levosimendan may facilitate weaning from venoarterial extracorporeal membrane oxygenation (VA-ECMO) and improve survival, but supporting evidence remains limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess whether early administration of levosimendan reduces the time to successful VA-ECMO weaning in patients with severe but potentially reversible cardiogenic shock."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Randomized, double-blind, placebo-controlled trial conducted across 11 intensive care units (ICUs) in France. Between August 27, 2021, and September 10, 2024, 205 adult patients with acute cardiogenic shock who had started VA-ECMO in the preceding 48 hours were enrolled. Final follow-up was completed on November 10, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomized in a 1:1 ratio to receive levosimendan, 0.15 μg/kg per minute, to be increased to 0.20 μg/kg per minute after 2 hours (n = 101), or placebo (n = 104)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was time to successful ECMO weaning within 30 days following randomization. Secondary outcomes included ECMO-, mechanical ventilation-, and organ failure-free days, ICU and hospital lengths of stay, serious adverse events, and all-cause 30- and 60-day mortality."
        },
        {
          "label": "RESULTS",
          "text": "Among the 205 randomized patients (median age, 58 [IQR, 50-67] years; 149 [72.7%] male), main cardiogenic shock etiologies were postcardiotomy (79 [38.5%]), acute myocardial infarction (56 [27.3%]), and myocarditis (28 [13.7%]). Treatment dose was increased to 0.20 ± 0.01 μg/kg per minute in 93% of patients receiving levosimendan and in 96% of those receiving placebo. Within 30 days, 69 of 101 patients (68.3%) had a successful ECMO weaning in the levosimendan group compared with 71 of 104 (68.3%) in the placebo group (risk difference, 0.0% [95% CI, -12.8% to 12.7%]; subdistribution hazard ratio, 1.02 [95% CI, 0.74-1.39]; P = .92). In the levosimendan and placebo groups, respectively, median ECMO duration (5 [IQR, 4-7] days vs 6 [IQR, 4-11] days; P = .53), mean ICU length of stay (18 [SD, 15] days vs 19 [SD, 15] days; P = .42), and 60-day mortality (27.7% vs 25.0%; risk difference, 2.7% [95% CI, -9.0% to 15.3%]; P = .78) did not differ significantly. Ventricular arrhythmias occurred more frequently with levosimendan (18 [17.8%] vs 9 [8.7%]; absolute risk difference, 9.2% [95% CI, 0.4%-18.1%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with severe but potentially reversible cardiogenic shock supported by VA-ECMO, early levosimendan administration did not significantly reduce the time to successful weaning of ECMO compared with placebo."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04728932."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324946/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jama.2025.19843",
      "dateReceived": "2025-12-07T23:24:39.089Z",
      "isNew": false
    },
    {
      "id": "7cca4ad3ea98",
      "title": "Efficacy of Individual-Level Interventions to Mitigate the Risk for Burnout Among Health Care Professionals : A Systematic Review and Meta-analysis of Randomized Controlled Trials.",
      "journal": "Ann Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49128253/118192",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41248503/",
      "pubDate": "2025 Nov 18",
      "doi": "10.7326/ANNALS-25-04275-VS",
      "dateReceived": "2025-12-06T23:25:14.007Z",
      "isNew": false
    },
    {
      "id": "80653a430b29",
      "title": "Percutaneous Mechanical Aspiration Versus Surgical Management of Tricuspid Valve Endocarditis: A Systematic Review and Updated Meta-Analysis.",
      "journal": "Am J Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49210964/118290",
      "abstract": "Tricuspid valve infective endocarditis (TVIE) is increasingly prevalent, especially among intravenous drug users. Surgical intervention is the standard treatment for severe cases, but percutaneous mechanical aspiration (PMA) has emerged as a less invasive alternative in high-risk patients. Comparative data on both strategies remain limited. To evaluate the safety and efficacy of PMA versus surgical management in patients with TVIE through a systematic review and meta-analysis. A comprehensive search of 5 databases (PubMed, Embase, Cochrane, Web of Science, Scopus) through July 2025 identified studies comparing PMA and surgery for TVIE. Outcomes included all-cause mortality (30-day and 1-year), hospital length of stay, in-hospital mortality, and readmission for endocarditis. Risk ratios (RR) and mean differences (MD) were pooled using a random-effects model. Risk of bias was assessed using ROBINS-I. Ten retrospective studies involving 6,035 patients were included (974 treated with PMA and 5,061 treated with surgery). The risk of in-hospital mortality was similar between PMA and surgery (RR = 1.07; p = 0.91). PMA was associated with a higher risk for 30-day mortality (RR = 2.71; 95% CI 1.53 to 4.82; p <0.001) but not for 1-year mortality (RR = 1.13; 95% CI 0.72 to 1.77; p = 0.60) or readmission for endocarditis (RR = 0.82; p = 0.63) compared with surgery. PMA was also associated with a shorter hospital stay (MD = -7.0 days; 95% CI -13.0 to -1.1; p = 0.03). The risk of bias was moderate to serious in all studies. In conclusion, the present systematic review of ten retrospective studies, surgical management of TVIE was associated with better short-term survival compared with PMA although the risks of 1-year mortality and readmission were similar. Randomized trials are required to better define the risk benefit profile of these approaches to TVIE.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41106651/",
      "pubDate": "2025 Dec 15",
      "doi": "10.1016/j.amjcard.2025.09.055",
      "dateReceived": "2025-12-06T23:25:14.006Z",
      "isNew": false
    },
    {
      "id": "9b5249ccbb97",
      "title": "Systemic Corticosteroids, Mortality, and Infections in Pneumonia and Acute Respiratory Distress Syndrome : A Systematic Review and Meta-analysis.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49210964/118281",
      "abstract": "The benefit-risk profile of systemic corticosteroids in non-COVID-19 pneumonia and acute respiratory distress syndrome (ARDS) remains debated. To assess corticosteroid effects on mortality and infection-related complications in adults with severe pneumonia or ARDS. MEDLINE, EMBASE, Cochrane Central Register of Controlled Trials, Web of Science, ClinicalTrials.gov, and World Health Organization International Clinical Trials Registry Platform through September 2025. Randomized controlled trials comparing systemic corticosteroids with placebo and usual care. Primary analysis: severe pneumonia or ARDS with corticosteroids 3 mg/kg of body weight per day or less (prednisone-equivalent) for 15 days or less, initiated within 7 days. Paired reviewers; consensus for disagreements. From 16 831 screened records, 20 studies (15 severe pneumonia, 5 ARDS) including 3459 participants met criteria. Low-dose, short-course corticosteroids probably reduce short-term mortality in severe pneumonia (15 studies, 2445 participants; risk ratio [RR], 0.73 [95% CI, 0.57 to 0.93];  = 14%; moderate certainty) and ARDS (5 studies, 1014 participants; RR, 0.77 [CI, 0.61 to 0.99];  = 23%; moderate certainty). Corticosteroids may reduce secondary shock in severe pneumonia (9 studies, 1690 participants; RR, 0.49 [CI, 0.26 to 0.92];  = 55%; low certainty). They probably result in little to no difference in hospital-acquired infections (severe pneumonia: 7 studies, 1665 participants; RR, 0.99 [CI, 0.82 to 1.20];  = 0%; moderate certainty; ARDS: 4 studies, 677 participants; RR, 0.97 [CI, 0.59 to 1.59];  = 0%; low certainty) or secondary pneumonia (severe pneumonia: 4 studies, 1011 participants; RR, 0.96 [CI, 0.66 to 1.39];  = 0%; ARDS: 4 studies, 677 participants; RR, 0.88 [CI, 0.43 to 1.79];  = 0%; both low certainty). Evidence is very uncertain for catheter-related and bloodstream infections. Long-term mortality evidence is very uncertain for severe pneumonia. Heterogeneous pneumonia severity classification limiting subgroup precision. In severe pneumonia and ARDS, adjunct corticosteroids probably reduce short-term mortality. In severe pneumonia, they may reduce secondary shock. In both conditions, corticosteroids may have little or no effect on hospital-acquired infections. None. (PROSPERO: CRD42024536301).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The benefit-risk profile of systemic corticosteroids in non-COVID-19 pneumonia and acute respiratory distress syndrome (ARDS) remains debated."
        },
        {
          "label": "PURPOSE",
          "text": "To assess corticosteroid effects on mortality and infection-related complications in adults with severe pneumonia or ARDS."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, EMBASE, Cochrane Central Register of Controlled Trials, Web of Science, ClinicalTrials.gov, and World Health Organization International Clinical Trials Registry Platform through September 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Randomized controlled trials comparing systemic corticosteroids with placebo and usual care. Primary analysis: severe pneumonia or ARDS with corticosteroids 3 mg/kg of body weight per day or less (prednisone-equivalent) for 15 days or less, initiated within 7 days."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Paired reviewers; consensus for disagreements."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "From 16 831 screened records, 20 studies (15 severe pneumonia, 5 ARDS) including 3459 participants met criteria. Low-dose, short-course corticosteroids probably reduce short-term mortality in severe pneumonia (15 studies, 2445 participants; risk ratio [RR], 0.73 [95% CI, 0.57 to 0.93];  = 14%; moderate certainty) and ARDS (5 studies, 1014 participants; RR, 0.77 [CI, 0.61 to 0.99];  = 23%; moderate certainty). Corticosteroids may reduce secondary shock in severe pneumonia (9 studies, 1690 participants; RR, 0.49 [CI, 0.26 to 0.92];  = 55%; low certainty). They probably result in little to no difference in hospital-acquired infections (severe pneumonia: 7 studies, 1665 participants; RR, 0.99 [CI, 0.82 to 1.20];  = 0%; moderate certainty; ARDS: 4 studies, 677 participants; RR, 0.97 [CI, 0.59 to 1.59];  = 0%; low certainty) or secondary pneumonia (severe pneumonia: 4 studies, 1011 participants; RR, 0.96 [CI, 0.66 to 1.39];  = 0%; ARDS: 4 studies, 677 participants; RR, 0.88 [CI, 0.43 to 1.79];  = 0%; both low certainty). Evidence is very uncertain for catheter-related and bloodstream infections. Long-term mortality evidence is very uncertain for severe pneumonia."
        },
        {
          "label": "LIMITATION",
          "text": "Heterogeneous pneumonia severity classification limiting subgroup precision."
        },
        {
          "label": "CONCLUSION",
          "text": "In severe pneumonia and ARDS, adjunct corticosteroids probably reduce short-term mortality. In severe pneumonia, they may reduce secondary shock. In both conditions, corticosteroids may have little or no effect on hospital-acquired infections."
        },
        {
          "label": "PRIMARY FUNDING SOURCE",
          "text": "None. (PROSPERO: CRD42024536301)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41325621/",
      "pubDate": "2025 Dec 02",
      "doi": "10.7326/ANNALS-25-03055",
      "dateReceived": "2025-12-06T23:25:14.006Z",
      "isNew": false
    },
    {
      "id": "4ebf1c863a9f",
      "title": "Economic Outcomes and Quality of Life After CABG or PCI for Multivessel Disease: The FAME 3 Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49210964/118241",
      "abstract": "Previous studies have found coronary artery bypass grafting (CABG) to be cost-effective compared with percutaneous coronary intervention (PCI) among patients with multivessel coronary artery disease (CAD), but their comparative effectiveness and economic outcomes may have changed. This study sought to compare the economic and quality of life outcomes of CABG vs PCI and determine their cost-effectiveness in the FAME (Fractional Flow Reserve vs Angiography for Multivessel Evaluation) 3 randomized trial. FAME 3 randomly assigned 1,500 patients with 3-vessel CAD to either CABG or fractional flow reserve-guided PCI using zotarolimus drug-eluting stents. We documented resource use and quality of life over 5 years of follow-up. We calculated costs by applying Medicare reimbursement rates to resources used, assessed quality of life using the EuroQOL EQ-5D, calculated quality-adjusted life-years (QALYs) from EQ-5D utility values, and used multivariable regression to compare outcomes by treatment assignment. We calculated the incremental cost-effectiveness ratio based on 5-year outcomes and also on projected life expectancies, and assessed its variability in 10,000 bootstrap replications. Cumulative costs over 5 years were 30% higher in patients assigned to CABG (95% CI: 16%-46%; P < 0.001). QALYs over 5 years did not differ significantly between the PCI (4.05 ± 0.84) and CABG groups (4.03 ± 0.82), although EQ-5D scores improved more rapidly after PCI. Patients <65 years of age at enrollment assigned to PCI were more likely to be employed at 5 years (56% vs 47%; P = 0.025). PCI had greater economic value than CABG over 5 years, with lower costs and higher QALYs in 66% of replications, and incremental cost-effectiveness ratios for CABG above the $150,000/QALY benchmark in 98% of bootstrap replications. These findings were essentially unchanged in several lifetime projections based on the outcomes documented within the trial follow-up period. Fractional flow reserve-guided PCI using zotarolimus drug-eluting stents provides significantly better long-term value than CABG for treatment of patients with multivessel CAD, with equivalent clinical outcomes at substantially lower cost.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Previous studies have found coronary artery bypass grafting (CABG) to be cost-effective compared with percutaneous coronary intervention (PCI) among patients with multivessel coronary artery disease (CAD), but their comparative effectiveness and economic outcomes may have changed."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study sought to compare the economic and quality of life outcomes of CABG vs PCI and determine their cost-effectiveness in the FAME (Fractional Flow Reserve vs Angiography for Multivessel Evaluation) 3 randomized trial."
        },
        {
          "label": "METHODS",
          "text": "FAME 3 randomly assigned 1,500 patients with 3-vessel CAD to either CABG or fractional flow reserve-guided PCI using zotarolimus drug-eluting stents. We documented resource use and quality of life over 5 years of follow-up. We calculated costs by applying Medicare reimbursement rates to resources used, assessed quality of life using the EuroQOL EQ-5D, calculated quality-adjusted life-years (QALYs) from EQ-5D utility values, and used multivariable regression to compare outcomes by treatment assignment. We calculated the incremental cost-effectiveness ratio based on 5-year outcomes and also on projected life expectancies, and assessed its variability in 10,000 bootstrap replications."
        },
        {
          "label": "RESULTS",
          "text": "Cumulative costs over 5 years were 30% higher in patients assigned to CABG (95% CI: 16%-46%; P < 0.001). QALYs over 5 years did not differ significantly between the PCI (4.05 ± 0.84) and CABG groups (4.03 ± 0.82), although EQ-5D scores improved more rapidly after PCI. Patients <65 years of age at enrollment assigned to PCI were more likely to be employed at 5 years (56% vs 47%; P = 0.025). PCI had greater economic value than CABG over 5 years, with lower costs and higher QALYs in 66% of replications, and incremental cost-effectiveness ratios for CABG above the $150,000/QALY benchmark in 98% of bootstrap replications. These findings were essentially unchanged in several lifetime projections based on the outcomes documented within the trial follow-up period."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Fractional flow reserve-guided PCI using zotarolimus drug-eluting stents provides significantly better long-term value than CABG for treatment of patients with multivessel CAD, with equivalent clinical outcomes at substantially lower cost."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41194756/",
      "pubDate": "2025 Oct 25",
      "doi": "10.1016/j.jacc.2025.10.017",
      "dateReceived": "2025-12-06T23:25:14.006Z",
      "isNew": false
    }
  ]
}