{
  "updated_at": "2026-01-17T23:26:50.391Z",
  "articles": [
    {
      "id": "7ab40dceeba0",
      "title": "Prenatal Exposure to Acid-Suppressive Medications and Risk of Neuropsychiatric Disorders in Children.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49715948/118557",
      "abstract": "Although acid-suppressive medications are commonly prescribed during pregnancy, comprehensive studies on their association with neuropsychiatric disorders in children are limited. To investigate potential associations between prenatal exposure to acid-suppressive medication (histamine 2 [H2] receptor antagonists and proton pump inhibitors [PPIs]) and neuropsychiatric disorders in children. Retrospective cohort study of mother-child pairs in the South Korean National Health Insurance Service database with births from January 2010 through December 2017, with follow-up of offspring through December 2023. Analyses were conducted using a propensity score-based overlap-weighted cohort and a sibling-matched cohort. Prenatal exposure to at least 1 prescription for a PPI or H2 receptor antagonist. Offspring neuropsychiatric disorders identified via International Statistical Classification of Diseases and Related Health Problems, Tenth Revision codes, including attention-deficit/hyperactivity disorder (ADHD), autism spectrum disorders (ASD), intellectual disability, severe neuropsychiatric disorder, and obsessive-compulsive disorder. Of 3 012 992 mother-child pairs initially identified, 2 777 119 were included, with 507 845 pairs exposed to prenatal acid-suppressive medication and were followed up a mean of 10.3 (SD, 2.3) years. In the overlap-weighted cohort (403 658 mother-child pairs exposed and 403 659 pairs unexposed to an acid-suppressive medication), respective risks among offspring exposed vs not exposed were 4.85% vs 4.25% for ADHD, 1.45% vs 1.33% for ASD, 1.25% vs 1.09% for intellectual disability, 0.94% vs 0.81% for severe neuropsychiatric disorder, and 0.30% vs 0.27% for obsessive-compulsive disorder. In the overlap-weighted cohort, the adjusted hazard ratio (HR) following prenatal acid-suppressive medication exposure was 1.14 (95% CI, 1.12-1.17) for ADHD, 1.07 (95% CI, 1.03-1.11) for ASD, 1.13 (95% CI, 1.09-1.18) for intellectual disability, 1.16 (95% CI, 1.10-1.21) for severe neuropsychiatric disorder, and 1.12 (95% CI, 1.03-1.21) for obsessive-compulsive disorder. Sibling-control analyses that included 157 069 exposed and 164 669 unexposed offspring revealed no significant associations between prenatal exposure and offspring outcomes. The adjusted HR for ADHD was 0.98 (95% CI, 0.95-1.02); for ASD, 0.98 (95% CI, 0.92-1.04); intellectual disability, 1.02 (95% CI, 0.95-1.09); severe neuropsychiatric disorder, 1.00 (95% CI, 0.93-1.08); or obsessive-compulsive disorders, 0.95 (95% CI, 0.82-1.10). Exposure to acid-suppressive medication during pregnancy was not associated with children's risk of ADHD, severe neuropsychiatric disorder, obsessive-compulsive disorder, intellectual disability, or ASD in sibling-control analyses. Small associations were observed in overlap-weighted models; these may reflect confounding by shared familial factors.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Although acid-suppressive medications are commonly prescribed during pregnancy, comprehensive studies on their association with neuropsychiatric disorders in children are limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate potential associations between prenatal exposure to acid-suppressive medication (histamine 2 [H2] receptor antagonists and proton pump inhibitors [PPIs]) and neuropsychiatric disorders in children."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Retrospective cohort study of mother-child pairs in the South Korean National Health Insurance Service database with births from January 2010 through December 2017, with follow-up of offspring through December 2023. Analyses were conducted using a propensity score-based overlap-weighted cohort and a sibling-matched cohort."
        },
        {
          "label": "EXPOSURE",
          "text": "Prenatal exposure to at least 1 prescription for a PPI or H2 receptor antagonist."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Offspring neuropsychiatric disorders identified via International Statistical Classification of Diseases and Related Health Problems, Tenth Revision codes, including attention-deficit/hyperactivity disorder (ADHD), autism spectrum disorders (ASD), intellectual disability, severe neuropsychiatric disorder, and obsessive-compulsive disorder."
        },
        {
          "label": "RESULTS",
          "text": "Of 3 012 992 mother-child pairs initially identified, 2 777 119 were included, with 507 845 pairs exposed to prenatal acid-suppressive medication and were followed up a mean of 10.3 (SD, 2.3) years. In the overlap-weighted cohort (403 658 mother-child pairs exposed and 403 659 pairs unexposed to an acid-suppressive medication), respective risks among offspring exposed vs not exposed were 4.85% vs 4.25% for ADHD, 1.45% vs 1.33% for ASD, 1.25% vs 1.09% for intellectual disability, 0.94% vs 0.81% for severe neuropsychiatric disorder, and 0.30% vs 0.27% for obsessive-compulsive disorder. In the overlap-weighted cohort, the adjusted hazard ratio (HR) following prenatal acid-suppressive medication exposure was 1.14 (95% CI, 1.12-1.17) for ADHD, 1.07 (95% CI, 1.03-1.11) for ASD, 1.13 (95% CI, 1.09-1.18) for intellectual disability, 1.16 (95% CI, 1.10-1.21) for severe neuropsychiatric disorder, and 1.12 (95% CI, 1.03-1.21) for obsessive-compulsive disorder. Sibling-control analyses that included 157 069 exposed and 164 669 unexposed offspring revealed no significant associations between prenatal exposure and offspring outcomes. The adjusted HR for ADHD was 0.98 (95% CI, 0.95-1.02); for ASD, 0.98 (95% CI, 0.92-1.04); intellectual disability, 1.02 (95% CI, 0.95-1.09); severe neuropsychiatric disorder, 1.00 (95% CI, 0.93-1.08); or obsessive-compulsive disorders, 0.95 (95% CI, 0.82-1.10)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Exposure to acid-suppressive medication during pregnancy was not associated with children's risk of ADHD, severe neuropsychiatric disorder, obsessive-compulsive disorder, intellectual disability, or ASD in sibling-control analyses. Small associations were observed in overlap-weighted models; these may reflect confounding by shared familial factors."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41499135/",
      "pubDate": "2026 Jan 07",
      "doi": "10.1001/jama.2025.23956",
      "dateReceived": "2026-01-17T23:26:48.967Z",
      "isNew": true
    },
    {
      "id": "e5f21899cafd",
      "title": "Multimodal health behaviour-changing interventions for adolescents living with obesity.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49621556/118501",
      "abstract": "Adolescent obesity is a global public health problem with multiple causes. The mainstay approach for managing obesity includes interventions targeting changes in health-related behaviours (diet, physical activity, and behaviour). However, previous research highlighted uncertainty about the sustainability and long-term results of these approaches. To assess the effects of multimodal health behaviour-changing interventions for adolescents aged 10 to 19 living with obesity. We used CENTRAL, MEDLINE, three other databases, and two trial registers, together with reference checking and contact with study authors, to identify studies included in the review. The latest search date was 28 February 2024. We included randomised controlled trials (RCTs) in adolescents aged 10 to 19 living with obesity that compared interventions involving a minimum of two health-related behaviour components (modifications in diet, physical activity, or behavioural change) to control (including no treatment, usual care, or waiting-list control) with a minimum of one year of follow-up. Critical outcomes included physical well-being, mental well-being, physical activity, health-related quality of life (HRQoL), obesity-associated disability, adverse events, and anthropometry (body mass index (BMI) z-score). We used the original version of the Cochrane Collaboration's tool for assessing risk of bias (RoB 1). We synthesised results for each outcome using meta-analysis, where possible, with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for critical outcomes included in two key summary of findings tables. For continuous outcomes, we calculated mean differences (MDs) or standardised mean differences (SMD). We included 33 RCTs with 5949 participants aged 10 to 19, primarily from high-income countries. We included 13 community-based interventions in schools, churches, and community centres, and 20 healthcare-based interventions implemented in primary care and hospitals. Intervention components included sessions on dietary modification, physical activity, and behavioural change. Of the 33 included studies, one targeted parents only, one involved only adolescents, and the remainder used family-based approaches, primarily through individual or group sessions. Healthcare-based multimodal interventions versus control Healthcare-based multimodal interventions may result in little to no difference in physical well-being at 12 months of follow-up (multiple scales: SMD 0.13, 95% CI -0.13 to 0.39; I² = 67%; 4 studies, 1006 participants; low-certainty evidence). They may result in little to no difference in mental well-being at 12 to 18 months of follow-up (multiple scales: SMD 0.09, 95% CI -0.07 to 0.24; I² = 0%; 4 studies, 693 participants; low-certainty evidence). The evidence is very uncertain about the effect of these interventions on self-reported physical activity (final score) at 12 months (multiple scales: SMD 0.51, 95% CI -0.07 to 1.10; I² = 93%; 4 studies, 964 participants; very low-certainty evidence), and when measured as a change-from-baseline score, these interventions may result in little to no difference in self-reported physical activity (multiple scales: SMD 0.02, 95% CI -0.29 to 0.34; I² = 0%; 2 studies, 156 participants; low-certainty evidence). These interventions may slightly improve HRQoL at 12 months (multiple scales: SMD 0.13, 95% CI 0.02 to 0.24; I² = 4%; 7 studies, 1454 participants; low-certainty evidence). The evidence is very uncertain about the effect of healthcare-based multimodal interventions on adverse events (0 events; 1 study, 46 participants; very low-certainty evidence). These interventions may result in little to no difference in BMI z-score at 12 to 18 months (MD -0.11, 95% CI -0.19 to -0.02; I² = 78%; 17 studies, 2666 participants; low-certainty evidence) and 24 months (MD 0.50, 95% CI -0.35 to 1.35; I² not applicable; 1 study, 33 participants; low-certainty evidence). None of the included studies reported obesity-associated disability. Community-based multimodal interventions versus control Community-based multimodal interventions may improve physical well-being at 12 months of follow-up (Youth Quality of Life instrument - Weight module: MD 13.50, 95% CI 4.99 to 22.01; I² not applicable; 1 study, 136 participants; low-certainty evidence). These interventions may result in little to no difference in mental well-being at 12 months (Strengths and Difficulties Questionnaire: MD 1.20, 95% CI -0.46 to 2.86; I² not applicable; 1 study, 208 participants; low-certainty evidence). These interventions may result in little to no difference in self-reported physical activity at 24 months (Global Physical Activity Questionnaire: ß coefficient = -0.04, 95% CI -0.3 to 0.2; P = 0.76; low-certainty evidence). Community-based multimodal interventions likely result in little to no difference in HRQoL at 12 months (multiple scales: SMD 0.06, 95% CI -0.11 to 0.24; I² = 19%; 4 studies, 666 participants; moderate-certainty evidence) and may result in little to no difference in HRQoL at 24 months (Pediatric Quality of Life Inventory: SMD -0.03, 95% CI -0.33 to 0.27; I² not applicable; 1 study, 188 participants; low-certainty evidence). These interventions may result in little to no difference in BMI z-score at 12 months (MD -0.07, 95% CI -0.21 to 0.08; I² = 85%; 5 studies, 585 participants; low-certainty evidence), and may reduce BMI z-score slightly at 24 months of follow-up (MD -0.47, 95% CI -0.96 to 0.02; I² = 98%; 3 studies, 430 participants; low-certainty evidence). None of the included studies reported data on obesity-associated disability or adverse events. Multimodal health behaviour-changing interventions may result in a small improvement in physical well-being at 12 months and BMI z-score at 12 months when delivered in the community, and in HRQoL at 12 months when delivered in healthcare settings. They may have little to no effect on other pre-defined critical outcomes, including mental well-being and physical activity. Future research should consider innovative approaches to the care of adolescents living with obesity and involve diverse populations, as we found limited research conducted in disadvantaged and culturally/ethnically diverse populations and other low-resource settings. World Health Organization (WHO) REGISTRATION: Protocol (2024): PROSPERO CRD42023468867.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Adolescent obesity is a global public health problem with multiple causes. The mainstay approach for managing obesity includes interventions targeting changes in health-related behaviours (diet, physical activity, and behaviour). However, previous research highlighted uncertainty about the sustainability and long-term results of these approaches."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of multimodal health behaviour-changing interventions for adolescents aged 10 to 19 living with obesity."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used CENTRAL, MEDLINE, three other databases, and two trial registers, together with reference checking and contact with study authors, to identify studies included in the review. The latest search date was 28 February 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) in adolescents aged 10 to 19 living with obesity that compared interventions involving a minimum of two health-related behaviour components (modifications in diet, physical activity, or behavioural change) to control (including no treatment, usual care, or waiting-list control) with a minimum of one year of follow-up."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes included physical well-being, mental well-being, physical activity, health-related quality of life (HRQoL), obesity-associated disability, adverse events, and anthropometry (body mass index (BMI) z-score)."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the original version of the Cochrane Collaboration's tool for assessing risk of bias (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using meta-analysis, where possible, with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for critical outcomes included in two key summary of findings tables. For continuous outcomes, we calculated mean differences (MDs) or standardised mean differences (SMD)."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 33 RCTs with 5949 participants aged 10 to 19, primarily from high-income countries. We included 13 community-based interventions in schools, churches, and community centres, and 20 healthcare-based interventions implemented in primary care and hospitals. Intervention components included sessions on dietary modification, physical activity, and behavioural change. Of the 33 included studies, one targeted parents only, one involved only adolescents, and the remainder used family-based approaches, primarily through individual or group sessions."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Healthcare-based multimodal interventions versus control Healthcare-based multimodal interventions may result in little to no difference in physical well-being at 12 months of follow-up (multiple scales: SMD 0.13, 95% CI -0.13 to 0.39; I² = 67%; 4 studies, 1006 participants; low-certainty evidence). They may result in little to no difference in mental well-being at 12 to 18 months of follow-up (multiple scales: SMD 0.09, 95% CI -0.07 to 0.24; I² = 0%; 4 studies, 693 participants; low-certainty evidence). The evidence is very uncertain about the effect of these interventions on self-reported physical activity (final score) at 12 months (multiple scales: SMD 0.51, 95% CI -0.07 to 1.10; I² = 93%; 4 studies, 964 participants; very low-certainty evidence), and when measured as a change-from-baseline score, these interventions may result in little to no difference in self-reported physical activity (multiple scales: SMD 0.02, 95% CI -0.29 to 0.34; I² = 0%; 2 studies, 156 participants; low-certainty evidence). These interventions may slightly improve HRQoL at 12 months (multiple scales: SMD 0.13, 95% CI 0.02 to 0.24; I² = 4%; 7 studies, 1454 participants; low-certainty evidence). The evidence is very uncertain about the effect of healthcare-based multimodal interventions on adverse events (0 events; 1 study, 46 participants; very low-certainty evidence). These interventions may result in little to no difference in BMI z-score at 12 to 18 months (MD -0.11, 95% CI -0.19 to -0.02; I² = 78%; 17 studies, 2666 participants; low-certainty evidence) and 24 months (MD 0.50, 95% CI -0.35 to 1.35; I² not applicable; 1 study, 33 participants; low-certainty evidence). None of the included studies reported obesity-associated disability. Community-based multimodal interventions versus control Community-based multimodal interventions may improve physical well-being at 12 months of follow-up (Youth Quality of Life instrument - Weight module: MD 13.50, 95% CI 4.99 to 22.01; I² not applicable; 1 study, 136 participants; low-certainty evidence). These interventions may result in little to no difference in mental well-being at 12 months (Strengths and Difficulties Questionnaire: MD 1.20, 95% CI -0.46 to 2.86; I² not applicable; 1 study, 208 participants; low-certainty evidence). These interventions may result in little to no difference in self-reported physical activity at 24 months (Global Physical Activity Questionnaire: ß coefficient = -0.04, 95% CI -0.3 to 0.2; P = 0.76; low-certainty evidence). Community-based multimodal interventions likely result in little to no difference in HRQoL at 12 months (multiple scales: SMD 0.06, 95% CI -0.11 to 0.24; I² = 19%; 4 studies, 666 participants; moderate-certainty evidence) and may result in little to no difference in HRQoL at 24 months (Pediatric Quality of Life Inventory: SMD -0.03, 95% CI -0.33 to 0.27; I² not applicable; 1 study, 188 participants; low-certainty evidence). These interventions may result in little to no difference in BMI z-score at 12 months (MD -0.07, 95% CI -0.21 to 0.08; I² = 85%; 5 studies, 585 participants; low-certainty evidence), and may reduce BMI z-score slightly at 24 months of follow-up (MD -0.47, 95% CI -0.96 to 0.02; I² = 98%; 3 studies, 430 participants; low-certainty evidence). None of the included studies reported data on obesity-associated disability or adverse events."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Multimodal health behaviour-changing interventions may result in a small improvement in physical well-being at 12 months and BMI z-score at 12 months when delivered in the community, and in HRQoL at 12 months when delivered in healthcare settings. They may have little to no effect on other pre-defined critical outcomes, including mental well-being and physical activity. Future research should consider innovative approaches to the care of adolescents living with obesity and involve diverse populations, as we found limited research conducted in disadvantaged and culturally/ethnically diverse populations and other low-resource settings."
        },
        {
          "label": "FUNDING",
          "text": "World Health Organization (WHO) REGISTRATION: Protocol (2024): PROSPERO CRD42023468867."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41410207/",
      "pubDate": "2025 Dec 18",
      "doi": "10.1002/14651858.CD016062",
      "dateReceived": "2026-01-16T23:28:12.943Z",
      "isNew": true
    },
    {
      "id": "7580e1f74099",
      "title": "Spinal Manipulation and Clinician-Supported Biopsychosocial Self-Management for Acute Back Pain: The PACBACK Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49614165/118506",
      "abstract": "Low back pain (LBP) is influenced by interrelated physical, psychological, and social factors. However, most treatments focus on symptom reduction without addressing the underlying biopsychosocial needs of patients. To determine the effectiveness of spinal manipulation and clinician-supported biopsychosocial self-management vs medical care for adults with increased risk of chronic disabling LBP. This 2 × 2 factorial randomized clinical trial enrolled participants in 3 research clinics at the Universities of Minnesota and Pittsburgh from November 2018 to May 2023; final follow-up was in June 2024. Adults with acute or subacute LBP at moderate to high risk of chronicity based on the STarT Back tool were randomized to 1 of 4 groups, with interventions lasting up to 8 weeks. Statistical analysis was conducted from November 2024 to June 2025. Spinal manipulation therapy (n = 201), supported self-management (n = 305), or combined supported self-management with spinal manipulation (n = 193) compared with guideline-based medical care (n = 301). Physical therapists and chiropractors provided spinal manipulation and supported self-management. The 2 primary outcomes averaged over a follow-up of 1 year were monthly low back disability (Roland-Morris Disability Questionnaire) and weekly pain intensity (numerical rating scale). Secondary analysis examined the proportion of participants achieving a 50% or higher reduction in the primary outcome measures. Among the 1000 participants randomized (mean [SD] age, 47 [16] years; 58% female), 93% completed the trial. The omnibus test for differences across the 4 treatment groups was statistically significant for disability (P = .001; supported self-management, 4.7; spinal manipulation, 5.5; combined supported self-management with spinal manipulation, 4.8; medical care, 5.9) but not pain intensity (P = .16; supported self-management, 2.8; spinal manipulation, 3.0; combined supported self-management with spinal manipulation, 2.8; medical care, 3.0). Averaged over 12 months, LBP disability was significantly lower compared with medical care for supported self-management (mean difference, -1.2 [95% CI, -1.9 to -0.5]) and supported self-management with spinal manipulation (mean difference, -1.1 [95% CI, -1.9 to -0.3]) but not spinal manipulation alone (mean difference, -0.4 [95% CI, -1.2 to 0.4]). Group differences in pain intensity were not statistically significant; point estimates ranged from -0.2 to 0. Both supported self-management groups had higher proportions of patients achieving a 50% or greater reduction in disability (supported self-management, 67%; spinal manipulation, 54%; combined supported self-management with spinal manipulation, 65%; medical care, 54%). For patients with acute or subacute LBP at increased risk of chronic disabling LBP, clinician-supported biopsychosocial self-management showed statistically significant but small reductions in disability, but not pain, vs medical care over 1-year follow-up, and spinal manipulation alone showed no significant difference for either outcome. ClinicalTrials.gov Identifier: NCT03581123.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Low back pain (LBP) is influenced by interrelated physical, psychological, and social factors. However, most treatments focus on symptom reduction without addressing the underlying biopsychosocial needs of patients."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the effectiveness of spinal manipulation and clinician-supported biopsychosocial self-management vs medical care for adults with increased risk of chronic disabling LBP."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This 2 × 2 factorial randomized clinical trial enrolled participants in 3 research clinics at the Universities of Minnesota and Pittsburgh from November 2018 to May 2023; final follow-up was in June 2024. Adults with acute or subacute LBP at moderate to high risk of chronicity based on the STarT Back tool were randomized to 1 of 4 groups, with interventions lasting up to 8 weeks. Statistical analysis was conducted from November 2024 to June 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Spinal manipulation therapy (n = 201), supported self-management (n = 305), or combined supported self-management with spinal manipulation (n = 193) compared with guideline-based medical care (n = 301). Physical therapists and chiropractors provided spinal manipulation and supported self-management."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The 2 primary outcomes averaged over a follow-up of 1 year were monthly low back disability (Roland-Morris Disability Questionnaire) and weekly pain intensity (numerical rating scale). Secondary analysis examined the proportion of participants achieving a 50% or higher reduction in the primary outcome measures."
        },
        {
          "label": "RESULTS",
          "text": "Among the 1000 participants randomized (mean [SD] age, 47 [16] years; 58% female), 93% completed the trial. The omnibus test for differences across the 4 treatment groups was statistically significant for disability (P = .001; supported self-management, 4.7; spinal manipulation, 5.5; combined supported self-management with spinal manipulation, 4.8; medical care, 5.9) but not pain intensity (P = .16; supported self-management, 2.8; spinal manipulation, 3.0; combined supported self-management with spinal manipulation, 2.8; medical care, 3.0). Averaged over 12 months, LBP disability was significantly lower compared with medical care for supported self-management (mean difference, -1.2 [95% CI, -1.9 to -0.5]) and supported self-management with spinal manipulation (mean difference, -1.1 [95% CI, -1.9 to -0.3]) but not spinal manipulation alone (mean difference, -0.4 [95% CI, -1.2 to 0.4]). Group differences in pain intensity were not statistically significant; point estimates ranged from -0.2 to 0. Both supported self-management groups had higher proportions of patients achieving a 50% or greater reduction in disability (supported self-management, 67%; spinal manipulation, 54%; combined supported self-management with spinal manipulation, 65%; medical care, 54%)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "For patients with acute or subacute LBP at increased risk of chronic disabling LBP, clinician-supported biopsychosocial self-management showed statistically significant but small reductions in disability, but not pain, vs medical care over 1-year follow-up, and spinal manipulation alone showed no significant difference for either outcome."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03581123."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41460638/",
      "pubDate": "2025 Dec 29",
      "doi": "10.1001/jama.2025.21990",
      "dateReceived": "2026-01-15T23:29:27.014Z",
      "isNew": false
    },
    {
      "id": "ade0dad8c70b",
      "title": "Life`s Simple 7 score and cardiovascular health in cancer survivors: the Moli-sani study.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49606649/118410",
      "abstract": "Cardiovascular disease (CVD) and cancer share modifiable risk factors and potential molecular mechanisms. This study examines whether the American Heart Association's Life's Simple 7 (LS7) metric developed for cardiovascular health is also linked to mortality outcomes in cancer survivors and explores potential biological mechanisms underlying this relationship. Longitudinal analyses were conducted on 779 cancer survivors from the Moli-sani study (n = 24 325), followed for 14.6 years (median). The LS7 metric includes smoking, physical activity, diet, body mass index, blood pressure, total blood cholesterol, and glucose. Each ideal metric was assigned 2 points, with scores ranging from 0 to 14. The LS7 score was categorized as poor (0-6), intermediate (7-9), and ideal (10-14) cardiovascular health. Shared biological risk factors (e.g. inflammatory and renal markers) were analysed as potential mediators. Cancer survivors in the ideal cardiovascular health category had a 38% lower risk of all-cause mortality compared to those with poor cardiovascular health [hazard ratio (HR) .62; 95% confidence interval (CI) .41-.94]. Similar findings were observed in cancer-free participants (HR .68; 95% CI .59-.78). Each 1-unit increase in LS7 metric was linked to lower cancer mortality (HR .90; 95% CI .82-.98). Replacing the original dietary component of the LS7 with the Mediterranean diet score resulted in reduced hazards of CVD (HR .84; 95% CI .71-1.00), cancer (HR .90; 95% CI .83-.98), and non-CVD/non-cancer mortality (e.g. deaths from neurodegenerative, cerebrovascular and respiratory diseases) (HR .83; 95% CI .70-.98). Altogether, inflammation, heart rate, and serum vitamin D accounted for over 50% of the associations between LS7 metric and mortality. The LS7 metric, originally developed for cardiovascular health, is associated with lower all-cause and cancer mortality in cancer survivors, potentially through shared biological mechanisms. These findings support the inclusion of LS7 risk factors in public health efforts targeting both CVD and cancer outcomes.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Cardiovascular disease (CVD) and cancer share modifiable risk factors and potential molecular mechanisms. This study examines whether the American Heart Association's Life's Simple 7 (LS7) metric developed for cardiovascular health is also linked to mortality outcomes in cancer survivors and explores potential biological mechanisms underlying this relationship."
        },
        {
          "label": "METHODS",
          "text": "Longitudinal analyses were conducted on 779 cancer survivors from the Moli-sani study (n = 24 325), followed for 14.6 years (median). The LS7 metric includes smoking, physical activity, diet, body mass index, blood pressure, total blood cholesterol, and glucose. Each ideal metric was assigned 2 points, with scores ranging from 0 to 14. The LS7 score was categorized as poor (0-6), intermediate (7-9), and ideal (10-14) cardiovascular health. Shared biological risk factors (e.g. inflammatory and renal markers) were analysed as potential mediators."
        },
        {
          "label": "RESULTS",
          "text": "Cancer survivors in the ideal cardiovascular health category had a 38% lower risk of all-cause mortality compared to those with poor cardiovascular health [hazard ratio (HR) .62; 95% confidence interval (CI) .41-.94]. Similar findings were observed in cancer-free participants (HR .68; 95% CI .59-.78). Each 1-unit increase in LS7 metric was linked to lower cancer mortality (HR .90; 95% CI .82-.98). Replacing the original dietary component of the LS7 with the Mediterranean diet score resulted in reduced hazards of CVD (HR .84; 95% CI .71-1.00), cancer (HR .90; 95% CI .83-.98), and non-CVD/non-cancer mortality (e.g. deaths from neurodegenerative, cerebrovascular and respiratory diseases) (HR .83; 95% CI .70-.98). Altogether, inflammation, heart rate, and serum vitamin D accounted for over 50% of the associations between LS7 metric and mortality."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The LS7 metric, originally developed for cardiovascular health, is associated with lower all-cause and cancer mortality in cancer survivors, potentially through shared biological mechanisms. These findings support the inclusion of LS7 risk factors in public health efforts targeting both CVD and cancer outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41399255/",
      "pubDate": "2025 Dec 16",
      "doi": "10.1093/eurheartj/ehaf838",
      "dateReceived": "2026-01-15T23:29:27.014Z",
      "isNew": false
    },
    {
      "id": "b0dbcabccf5f",
      "title": "Infrapatellar Fat Pad Glucocorticoid Injection in Knee Osteoarthritis: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Rheumatology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49692634/118562",
      "abstract": "Intra-articular glucocorticoid injections are widely used to alleviate knee osteoarthritis (OA) pain, but evidence suggests these injections may cause cartilage loss. The infrapatellar fat pad (IPFP) and synovium are important sources of inflammation in knee OA; injecting glucocorticoid into the IPFP may not only provide anti-inflammatory effects but also reduce cartilage deterioration in patients with inflammatory knee OA. To evaluate the effect and safety of glucocorticoid injections into the IPFP in individuals with inflammatory knee OA. This randomized, double-blind, placebo-controlled trial included patients aged 45 years and older with inflammatory knee OA at 4 centers in China. Patients were enrolled from April 2022 to June 2023. Patients were randomly assigned to the treatment group (n = 30) or placebo group (n = 30). Each group received either glucocorticoid or saline injections into the IPFP with hyaluronic acid as background treatment under ultrasonographic guidance. The primary outcomes were changes in knee pain on a visual analog scale (VAS) and effusion synovitis volume measured by magnetic resonance imaging (MRI). Secondary outcomes included changes in the total score of the Western Ontario and McMaster Universities Osteoarthritis Index (WOMAC), MRI-detected Hoffa synovitis score, quality of life assessed using the 4-dimensional Assessment of Quality of Life, pain medication use, IPFP volume, and the incidence of adverse reactions. Outcomes were assessed over 12 weeks. All 60 participants (mean [SD] age, 65 [11] years; 38 [63%] women) completed the study. The treatment group compared with the placebo group did not have a statistically significant reduction in VAS pain (-39.3 mm vs -31.4 mm; between-group difference, -7.9 mm; 95% CI, -19.7 to 4.0 mm). There was no significant between-group difference in effusion volume reduction (-4.9 mL vs -5.4 mL; between-group difference, 0.5 mL; 95% CI, -1.9 to 2.9 mL). In post hoc analyses, the treatment group had significantly greater reduction in the WOMAC pain score (-113.0 points vs -66.8 points; between group difference, -46.2 points; 95% CI, -90.0 to -2.4 points; P = .04) and cartilage defect (-0.1 vs 0.4; between-group difference, -0.5; 95% CI, -1.0 to -0.1; P = .03). Both groups had 1 participant who experienced 1 adverse reaction. In this randomized clinical trial, glucocorticoid injections into the IPFP did not effectively alleviate knee pain or reduce effusion synovitis volume in inflammatory knee OA. Further investigation is needed to determine the efficacy of this treatment approach. ClinicalTrials.gov Identifier: NCT05291650.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Intra-articular glucocorticoid injections are widely used to alleviate knee osteoarthritis (OA) pain, but evidence suggests these injections may cause cartilage loss. The infrapatellar fat pad (IPFP) and synovium are important sources of inflammation in knee OA; injecting glucocorticoid into the IPFP may not only provide anti-inflammatory effects but also reduce cartilage deterioration in patients with inflammatory knee OA."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effect and safety of glucocorticoid injections into the IPFP in individuals with inflammatory knee OA."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized, double-blind, placebo-controlled trial included patients aged 45 years and older with inflammatory knee OA at 4 centers in China. Patients were enrolled from April 2022 to June 2023."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomly assigned to the treatment group (n = 30) or placebo group (n = 30). Each group received either glucocorticoid or saline injections into the IPFP with hyaluronic acid as background treatment under ultrasonographic guidance."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were changes in knee pain on a visual analog scale (VAS) and effusion synovitis volume measured by magnetic resonance imaging (MRI). Secondary outcomes included changes in the total score of the Western Ontario and McMaster Universities Osteoarthritis Index (WOMAC), MRI-detected Hoffa synovitis score, quality of life assessed using the 4-dimensional Assessment of Quality of Life, pain medication use, IPFP volume, and the incidence of adverse reactions. Outcomes were assessed over 12 weeks."
        },
        {
          "label": "RESULTS",
          "text": "All 60 participants (mean [SD] age, 65 [11] years; 38 [63%] women) completed the study. The treatment group compared with the placebo group did not have a statistically significant reduction in VAS pain (-39.3 mm vs -31.4 mm; between-group difference, -7.9 mm; 95% CI, -19.7 to 4.0 mm). There was no significant between-group difference in effusion volume reduction (-4.9 mL vs -5.4 mL; between-group difference, 0.5 mL; 95% CI, -1.9 to 2.9 mL). In post hoc analyses, the treatment group had significantly greater reduction in the WOMAC pain score (-113.0 points vs -66.8 points; between group difference, -46.2 points; 95% CI, -90.0 to -2.4 points; P = .04) and cartilage defect (-0.1 vs 0.4; between-group difference, -0.5; 95% CI, -1.0 to -0.1; P = .03). Both groups had 1 participant who experienced 1 adverse reaction."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, glucocorticoid injections into the IPFP did not effectively alleviate knee pain or reduce effusion synovitis volume in inflammatory knee OA. Further investigation is needed to determine the efficacy of this treatment approach."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05291650."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41481293/",
      "pubDate": "2026 Jan 02",
      "doi": "10.1001/jamanetworkopen.2025.49938",
      "dateReceived": "2026-01-15T23:29:27.013Z",
      "isNew": false
    },
    {
      "id": "09483d89d112",
      "title": "Association Between GLP-1 Receptor Agonists and Ischemic Optic Neuropathy: A Meta-analysis.",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician",
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49692634/118550",
      "abstract": "To investigate the association between glucagon-like peptide-1 receptor agonists (GLP-1 RAs) and nonarteritic ischemic optic neuropathy (NAION). The PubMed, Embase, and Cochrane Library databases were searched during August 2025. Odds ratios (ORs) and absolute risk for NAION values were pooled using random-effects Peto and inverse-variance models. Any ocular event was a secondary outcome. Fifteen longitudinal studies (n = 8 trials; n > 1.5 million patients) were included. GLP-1 RA use was associated with higher NAION risk (OR 1.70; 95% CI 1.23-2.36), consistent across randomized (2.36; 0.85-6.53) and nonrandomized studies (1.64; 1.15-2.35) (P = 0.51, for heterogeneity). Absolute NAION risk in the GLP-1 RA group was 0.09%, corresponding to a 0.037% risk difference (number needed to harm ∼ 2,700). There was no association with overall ocular events (OR 0.95; 95% CI 0.86-1.05). GLP-1 RA use was associated with a modest increase in NAION risk but not overall ocular adverse events. Findings underscore the need for long-term postmarketing safety studies and should be interpreted against their well-established mortality and cardio-kidney-metabolic benefits.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To investigate the association between glucagon-like peptide-1 receptor agonists (GLP-1 RAs) and nonarteritic ischemic optic neuropathy (NAION)."
        },
        {
          "label": "RESEARCH DESIGN AND METHODS",
          "text": "The PubMed, Embase, and Cochrane Library databases were searched during August 2025. Odds ratios (ORs) and absolute risk for NAION values were pooled using random-effects Peto and inverse-variance models. Any ocular event was a secondary outcome."
        },
        {
          "label": "RESULTS",
          "text": "Fifteen longitudinal studies (n = 8 trials; n > 1.5 million patients) were included. GLP-1 RA use was associated with higher NAION risk (OR 1.70; 95% CI 1.23-2.36), consistent across randomized (2.36; 0.85-6.53) and nonrandomized studies (1.64; 1.15-2.35) (P = 0.51, for heterogeneity). Absolute NAION risk in the GLP-1 RA group was 0.09%, corresponding to a 0.037% risk difference (number needed to harm ∼ 2,700). There was no association with overall ocular events (OR 0.95; 95% CI 0.86-1.05)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1 RA use was associated with a modest increase in NAION risk but not overall ocular adverse events. Findings underscore the need for long-term postmarketing safety studies and should be interpreted against their well-established mortality and cardio-kidney-metabolic benefits."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41498755/",
      "pubDate": "2026 Jan 07",
      "doi": "10.2337/dc25-1238",
      "dateReceived": "2026-01-15T23:29:27.013Z",
      "isNew": false
    },
    {
      "id": "b0b69c80d1c3",
      "title": "Weight regain after cessation of medication for weight management: systematic review and meta-analysis.",
      "journal": "BMJ",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49692634/118549",
      "abstract": "To quantify and compare the rate of weight regain after cessation of weight management medications (WMMs) in adults with overweight or obesity. Systematic review and meta-analysis. Trial registries and databases (Medline, Embase, PsycINFO, CINAHL, Cochrane, Web of Science, and trial registries) were searched from inception until February 2025 for randomised controlled trials (RCTs), non-randomised trials, and observational studies that included WMM (≥8 weeks) with follow-up for ≥4 weeks after cessation of treatment in adults with overweight or obesity. Comparators were any non-drug weight loss intervention or placebo. The review followed the Preferred Reporting Items for Systematic Reviews and Meta-analyses guidelines. Two independent reviewers screened titles, extracted data, and assessed the risk of bias using the Cochrane Risk of Bias 2 tool for RCTs and the ROBINS-I tool for non-randomised trials. Data were analysed using mixed effect, meta-regression, and time-to-event models. Weight regain after cessation of WMM was compared with that reported after cessation of behavioural weight management programmes (BWMPs). The primary outcome was rate of weight regain from end of treatment, with associated changes in cardiometabolic markers as a secondary outcome. Of the 9288 titles screened, 37 studies (63 intervention arms, 9341 participants) were included. Average treatment duration was 39 (range 11-176) weeks, with average follow-up of 32 (4-104) weeks. The average monthly rate of weight regain was 0.4 kg (95% confidence interval (CI) 0.3 to 0.5) (mixed model 0.3 kg (0.2 to 0.4) monthly  control in RCTs). All cardiometabolic markers were projected to return to baseline within 1.4 years after the cessation of WMM. Weight regain was faster after WMM than after BWMP (by 0.3 kg (0.22 to 0.34) monthly), independent of initial weight loss. Estimates and precision were robust in sensitivity analyses. This review found that cessation of WMM is followed by rapid weight regain and reversal of beneficial effects on cardiometabolic markers. Regain after WMM was faster than after BWMP. These findings suggest caution in short term use of these drugs without a more comprehensive approach to weight management. PROSPERO CRD42024532069.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To quantify and compare the rate of weight regain after cessation of weight management medications (WMMs) in adults with overweight or obesity."
        },
        {
          "label": "DESIGN",
          "text": "Systematic review and meta-analysis."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Trial registries and databases (Medline, Embase, PsycINFO, CINAHL, Cochrane, Web of Science, and trial registries) were searched from inception until February 2025 for randomised controlled trials (RCTs), non-randomised trials, and observational studies that included WMM (≥8 weeks) with follow-up for ≥4 weeks after cessation of treatment in adults with overweight or obesity. Comparators were any non-drug weight loss intervention or placebo."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "The review followed the Preferred Reporting Items for Systematic Reviews and Meta-analyses guidelines. Two independent reviewers screened titles, extracted data, and assessed the risk of bias using the Cochrane Risk of Bias 2 tool for RCTs and the ROBINS-I tool for non-randomised trials. Data were analysed using mixed effect, meta-regression, and time-to-event models. Weight regain after cessation of WMM was compared with that reported after cessation of behavioural weight management programmes (BWMPs)."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary outcome was rate of weight regain from end of treatment, with associated changes in cardiometabolic markers as a secondary outcome."
        },
        {
          "label": "RESULTS",
          "text": "Of the 9288 titles screened, 37 studies (63 intervention arms, 9341 participants) were included. Average treatment duration was 39 (range 11-176) weeks, with average follow-up of 32 (4-104) weeks. The average monthly rate of weight regain was 0.4 kg (95% confidence interval (CI) 0.3 to 0.5) (mixed model 0.3 kg (0.2 to 0.4) monthly  control in RCTs). All cardiometabolic markers were projected to return to baseline within 1.4 years after the cessation of WMM. Weight regain was faster after WMM than after BWMP (by 0.3 kg (0.22 to 0.34) monthly), independent of initial weight loss. Estimates and precision were robust in sensitivity analyses."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This review found that cessation of WMM is followed by rapid weight regain and reversal of beneficial effects on cardiometabolic markers. Regain after WMM was faster than after BWMP. These findings suggest caution in short term use of these drugs without a more comprehensive approach to weight management."
        },
        {
          "label": "SYSTEMATIC REVIEW REGISTRATION",
          "text": "PROSPERO CRD42024532069."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41500720/",
      "pubDate": "2026 Jan 07",
      "doi": "10.1136/bmj-2025-085304",
      "dateReceived": "2026-01-15T23:29:27.013Z",
      "isNew": false
    },
    {
      "id": "e1e06ba3eead",
      "title": "Cardiac Allograft Vasculopathy Inhibition With Alirocumab: The CAVIAR Trial.",
      "journal": "Circulation",
      "score": "7/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49680258/118517",
      "abstract": "Cardiac allograft vasculopathy is an important cause of mortality after heart transplantation (HT). Dyslipidemia is a major contributor to the development of cardiac allograft vasculopathy. The safety and effectiveness of proprotein convertase subtilisin/kexin 9 inhibition to lower cholesterol and to prevent cardiac allograft vasculopathy early after HT are not well established. In this investigator-initiated, prospective, multicenter, double-blind randomized trial, participants were randomized early after HT to receive either alirocumab or placebo in addition to rosuvastatin. Before randomization and at 1 year, all participants underwent invasive coronary assessment, including angiography, fractional flow reserve, coronary flow reserve, the index of microcirculatory resistance, and intravascular ultrasound with near-infrared spectroscopy. Lipid values were assessed at baseline and at prespecified intervals. The primary end point was the change in coronary artery plaque volume from baseline to 1 year after HT based on serial intravascular ultrasound. A total of 114 HT recipients were included (57 assigned to alirocumab and 57 assigned to placebo). Baseline characteristics were well matched between the 2 groups. The low-density lipoprotein cholesterol levels decreased significantly from baseline to 1 year in the alirocumab arm (72.7±31.7 to 31.5±20.7 mg/dL; <0.001) and did not change with placebo (69.0±22.4 to 69.2±28.1 mg/dL; =0.92). Plaque volume increased numerically in both groups from baseline to 12 months (alirocumab, 176.3±95.2 to 184.5±105.4 mm³; =0.23; placebo 173.7±96.7 to 183.1±109.8 mm; =0.15). The change in plaque volume (mean difference in differences) did not differ between groups (1.01 [0.89-1.14]; =0.86). Fractional flow reserve, coronary flow reserve, and the index of microcirculatory resistance did not change significantly with the addition of alirocumab. There were no significant adverse events related to alirocumab. Proprotein convertase subtilisin/kexin 9 inhibition with alirocumab in addition to statin therapy early after HT safely lowers low-density lipoprotein cholesterol but did not reduce coronary artery plaque progression after 1 year compared with rosuvastatin alone in patients with a low baseline low-density lipoprotein cholesterol. URL: https://www.clinicaltrials.gov; Unique identifier: NCT03537742.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cardiac allograft vasculopathy is an important cause of mortality after heart transplantation (HT). Dyslipidemia is a major contributor to the development of cardiac allograft vasculopathy. The safety and effectiveness of proprotein convertase subtilisin/kexin 9 inhibition to lower cholesterol and to prevent cardiac allograft vasculopathy early after HT are not well established."
        },
        {
          "label": "METHODS",
          "text": "In this investigator-initiated, prospective, multicenter, double-blind randomized trial, participants were randomized early after HT to receive either alirocumab or placebo in addition to rosuvastatin. Before randomization and at 1 year, all participants underwent invasive coronary assessment, including angiography, fractional flow reserve, coronary flow reserve, the index of microcirculatory resistance, and intravascular ultrasound with near-infrared spectroscopy. Lipid values were assessed at baseline and at prespecified intervals. The primary end point was the change in coronary artery plaque volume from baseline to 1 year after HT based on serial intravascular ultrasound."
        },
        {
          "label": "RESULTS",
          "text": "A total of 114 HT recipients were included (57 assigned to alirocumab and 57 assigned to placebo). Baseline characteristics were well matched between the 2 groups. The low-density lipoprotein cholesterol levels decreased significantly from baseline to 1 year in the alirocumab arm (72.7±31.7 to 31.5±20.7 mg/dL; <0.001) and did not change with placebo (69.0±22.4 to 69.2±28.1 mg/dL; =0.92). Plaque volume increased numerically in both groups from baseline to 12 months (alirocumab, 176.3±95.2 to 184.5±105.4 mm³; =0.23; placebo 173.7±96.7 to 183.1±109.8 mm; =0.15). The change in plaque volume (mean difference in differences) did not differ between groups (1.01 [0.89-1.14]; =0.86). Fractional flow reserve, coronary flow reserve, and the index of microcirculatory resistance did not change significantly with the addition of alirocumab. There were no significant adverse events related to alirocumab."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Proprotein convertase subtilisin/kexin 9 inhibition with alirocumab in addition to statin therapy early after HT safely lowers low-density lipoprotein cholesterol but did not reduce coronary artery plaque progression after 1 year compared with rosuvastatin alone in patients with a low baseline low-density lipoprotein cholesterol."
        },
        {
          "label": "REGISTRATION",
          "text": "URL: https://www.clinicaltrials.gov; Unique identifier: NCT03537742."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212178/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1161/CIRCULATIONAHA.125.077603",
      "dateReceived": "2026-01-14T23:25:04.992Z",
      "isNew": false
    },
    {
      "id": "06464f55b054",
      "title": "Acetaminophen (Paracetamol) or Opioid Analgesia Added to Ibuprofen for Children`s Musculoskeletal Injury: Two Randomized Clinical Trials.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49680258/118556",
      "abstract": "Ibuprofen is first-line therapy for musculoskeletal pain. However, two-thirds of children experience inadequate pain relief with ibuprofen monotherapy, and the efficacy of additive medications for moderate to severe musculoskeletal pain is unclear. To determine whether treatment with an opioid (hydromorphone) plus ibuprofen or nonopioid (acetaminophen [paracetamol]) plus ibuprofen decreased pain scores compared with ibuprofen alone. Two randomized, double-masked, placebo-controlled trials were conducted from April 2019 to March 2023 in 6 university-affiliated, tertiary care Canadian pediatric emergency departments. Children aged 6 to 17 years presenting with a nonoperative acute limb injury (<24 hours) and a verbal numerical rating scale (vNRS) pain score of 5 or more out of 10 were enrolled. Date of final follow-up was March 22, 2023. The opioid trial randomized participants to a single oral dose of ibuprofen plus hydromorphone, ibuprofen plus acetaminophen, or ibuprofen alone. The nonopioid trial randomized participants to a single oral dose of ibuprofen plus acetaminophen or ibuprofen alone. In all groups, ibuprofen was dosed at 10 mg/kg (maximum, 600 mg). The acetaminophen dose was 15 mg/kg (maximum, 1000 mg), and the hydromorphone dose was 0.05 mg/kg (maximum, 5 mg). The primary efficacy outcome was self-reported vNRS pain score at 60 minutes post medication administration (score range, 0 [no pain] to 10 [worst pain]; minimal clinically important difference, 1.5). The primary safety end point was the proportion of children with any adverse event related to study drug administration. A total of 8098 children were screened for eligibility; 699 were randomized and 653 were included in the efficacy analyses. The opioid trial included 249 children: 110 randomized to ibuprofen plus hydromorphone, 70 to ibuprofen plus acetaminophen, and 69 to ibuprofen alone. The nonopioid trial included 450 children: 225 randomized to a single oral dose of ibuprofen plus acetaminophen and 225 randomized to ibuprofen alone. The mean (SD) age of children in the 2 trials was 11.5 (3.5) years and 47.4% were female. The mean (SD) vNRS score at recruitment was 6.4 (1.8). In pooled analyses, mean (SD) vNRS scores 60 minutes after drug administration were 4.8 (2.6) in the ibuprofen plus hydromorphone group, 4.6 (2.4) in the ibuprofen plus acetaminophen group, and 4.6 (2.3) in the ibuprofen alone group (P = .78). Any adverse event occurred at higher rates in the ibuprofen plus hydromorphone group (28.2%) compared with the ibuprofen plus acetaminophen (6.1%) or ibuprofen alone groups (5.8%). No serious adverse events occurred. For children with acute nonoperative musculoskeletal injury, pain scores at 60 minutes after drug administration did not improve with ibuprofen plus acetaminophen or ibuprofen plus hydromorphone compared with ibuprofen alone. Adverse events were 4-fold more frequent with hydromorphone. Clinicaltrials.gov Identifier: NCT03767933.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Ibuprofen is first-line therapy for musculoskeletal pain. However, two-thirds of children experience inadequate pain relief with ibuprofen monotherapy, and the efficacy of additive medications for moderate to severe musculoskeletal pain is unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether treatment with an opioid (hydromorphone) plus ibuprofen or nonopioid (acetaminophen [paracetamol]) plus ibuprofen decreased pain scores compared with ibuprofen alone."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Two randomized, double-masked, placebo-controlled trials were conducted from April 2019 to March 2023 in 6 university-affiliated, tertiary care Canadian pediatric emergency departments. Children aged 6 to 17 years presenting with a nonoperative acute limb injury (<24 hours) and a verbal numerical rating scale (vNRS) pain score of 5 or more out of 10 were enrolled. Date of final follow-up was March 22, 2023."
        },
        {
          "label": "INTERVENTIONS",
          "text": "The opioid trial randomized participants to a single oral dose of ibuprofen plus hydromorphone, ibuprofen plus acetaminophen, or ibuprofen alone. The nonopioid trial randomized participants to a single oral dose of ibuprofen plus acetaminophen or ibuprofen alone. In all groups, ibuprofen was dosed at 10 mg/kg (maximum, 600 mg). The acetaminophen dose was 15 mg/kg (maximum, 1000 mg), and the hydromorphone dose was 0.05 mg/kg (maximum, 5 mg)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcome was self-reported vNRS pain score at 60 minutes post medication administration (score range, 0 [no pain] to 10 [worst pain]; minimal clinically important difference, 1.5). The primary safety end point was the proportion of children with any adverse event related to study drug administration."
        },
        {
          "label": "RESULTS",
          "text": "A total of 8098 children were screened for eligibility; 699 were randomized and 653 were included in the efficacy analyses. The opioid trial included 249 children: 110 randomized to ibuprofen plus hydromorphone, 70 to ibuprofen plus acetaminophen, and 69 to ibuprofen alone. The nonopioid trial included 450 children: 225 randomized to a single oral dose of ibuprofen plus acetaminophen and 225 randomized to ibuprofen alone. The mean (SD) age of children in the 2 trials was 11.5 (3.5) years and 47.4% were female. The mean (SD) vNRS score at recruitment was 6.4 (1.8). In pooled analyses, mean (SD) vNRS scores 60 minutes after drug administration were 4.8 (2.6) in the ibuprofen plus hydromorphone group, 4.6 (2.4) in the ibuprofen plus acetaminophen group, and 4.6 (2.3) in the ibuprofen alone group (P = .78). Any adverse event occurred at higher rates in the ibuprofen plus hydromorphone group (28.2%) compared with the ibuprofen plus acetaminophen (6.1%) or ibuprofen alone groups (5.8%). No serious adverse events occurred."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "For children with acute nonoperative musculoskeletal injury, pain scores at 60 minutes after drug administration did not improve with ibuprofen plus acetaminophen or ibuprofen plus hydromorphone compared with ibuprofen alone. Adverse events were 4-fold more frequent with hydromorphone."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Clinicaltrials.gov Identifier: NCT03767933."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41505155/",
      "pubDate": "2026 Jan 08",
      "doi": "10.1001/jama.2025.25033",
      "dateReceived": "2026-01-14T23:25:04.991Z",
      "isNew": false
    },
    {
      "id": "8618459b96dd",
      "title": "Effect of Aficamten vs Metoprolol on Patient-Reported Health Status in Obstructive Hypertrophic Cardiomyopathy.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49663980/118536",
      "abstract": "The cardiac myosin inhibitor aficamten was significantly more effective than metoprolol at improving exercise tolerance in MAPLE-HCM (Metoprolol vs Aficamten in Patients with LVOT Obstruction on Exercise Capacity in HCM), a head-to-head, international, double-blind, randomized trial in patients with obstructive hypertrophic cardiomyopathy (oHCM). Given the primary treatment goal to improve patients' health status, defining the incremental benefits of aficamten over metoprolol on patients' symptoms, function, and quality of life is needed. In this study, the authors sought to compare patient-reported health status benefits of aficamten with metoprolol. Adults with symptomatic oHCM (Kansas City Cardiomyopathy Questionnaire [KCCQ] Clinical Summary Score [CSS] ≤90; left ventricular outflow tract obstruction ≥30 mm Hg at rest or ≥50 mm Hg with Valsalva) were randomly assigned to 24 weeks of aficamten or metoprolol as monotherapy. Changes in KCCQ Overall Summary Score (OSS) and Seattle Angina Questionnaire Summary Score (SAQ-SS), collected serially throughout the trial, were compared between treatment groups at 24 weeks using linear regression, adjusted for randomization strata and baseline scores. Individual participant experiences were described by comparing categories of clinically meaningful within-participant change: ≤-5 (worse), >-5 to <+5 (no change), +5 to <+10 (small improvement), +10 to <+15 (moderate improvement), +15 to <+20 (large improvement), and ≥+20 points (very large improvement). Among 175 randomized patients, baseline health status scores were similar between treatment groups (n = 88 aficamten; n = 87 metoprolol). Aficamten, compared with metoprolol, resulted in a greater 24-week KCCQ-OSS improvement (adjusted between-group difference: +7.8 points; 95% CI: 3.3-12.3; P < 0.001), primarily driven by a greater proportion of aficamten-treated (38.6%) vs metoprolol-treated (18.4%) patients experiencing a very large (≥20 points) KCCQ-OSS improvement (number needed to treat = 4.9; 95% CI: 3.0-13.9), and a smaller proportion experiencing worsening health status (≤-5-point change: 6.8% vs 18.4%; number needed to harm = 8.6; 95% CI: 4.7-53.3). Nonsignificant SAQ-SS improvements with aficamten vs metoprolol (+4.6 points; 95% CI -0.3 to 9.5 points; P = 0.063) were driven by significantly larger improvements in the SAQ Physical Limitation scale (+10.1 points; 95% CI: 3.9-16.2 points; P = 0.001). Aficamten improved the health status of patients with symptomatic oHCM significantly more than did metoprolol, highlighting its potential as an effective initial therapeutic option. (Phase 3 Trial to Evaluate the Efficacy and Safety of Aficamten Compared to Metoprolol Succinate in Adults With Symptomatic oHCM (MAPLE-HCM; NCT05767346).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The cardiac myosin inhibitor aficamten was significantly more effective than metoprolol at improving exercise tolerance in MAPLE-HCM (Metoprolol vs Aficamten in Patients with LVOT Obstruction on Exercise Capacity in HCM), a head-to-head, international, double-blind, randomized trial in patients with obstructive hypertrophic cardiomyopathy (oHCM). Given the primary treatment goal to improve patients' health status, defining the incremental benefits of aficamten over metoprolol on patients' symptoms, function, and quality of life is needed."
        },
        {
          "label": "OBJECTIVES",
          "text": "In this study, the authors sought to compare patient-reported health status benefits of aficamten with metoprolol."
        },
        {
          "label": "METHODS",
          "text": "Adults with symptomatic oHCM (Kansas City Cardiomyopathy Questionnaire [KCCQ] Clinical Summary Score [CSS] ≤90; left ventricular outflow tract obstruction ≥30 mm Hg at rest or ≥50 mm Hg with Valsalva) were randomly assigned to 24 weeks of aficamten or metoprolol as monotherapy. Changes in KCCQ Overall Summary Score (OSS) and Seattle Angina Questionnaire Summary Score (SAQ-SS), collected serially throughout the trial, were compared between treatment groups at 24 weeks using linear regression, adjusted for randomization strata and baseline scores. Individual participant experiences were described by comparing categories of clinically meaningful within-participant change: ≤-5 (worse), >-5 to <+5 (no change), +5 to <+10 (small improvement), +10 to <+15 (moderate improvement), +15 to <+20 (large improvement), and ≥+20 points (very large improvement)."
        },
        {
          "label": "RESULTS",
          "text": "Among 175 randomized patients, baseline health status scores were similar between treatment groups (n = 88 aficamten; n = 87 metoprolol). Aficamten, compared with metoprolol, resulted in a greater 24-week KCCQ-OSS improvement (adjusted between-group difference: +7.8 points; 95% CI: 3.3-12.3; P < 0.001), primarily driven by a greater proportion of aficamten-treated (38.6%) vs metoprolol-treated (18.4%) patients experiencing a very large (≥20 points) KCCQ-OSS improvement (number needed to treat = 4.9; 95% CI: 3.0-13.9), and a smaller proportion experiencing worsening health status (≤-5-point change: 6.8% vs 18.4%; number needed to harm = 8.6; 95% CI: 4.7-53.3). Nonsignificant SAQ-SS improvements with aficamten vs metoprolol (+4.6 points; 95% CI -0.3 to 9.5 points; P = 0.063) were driven by significantly larger improvements in the SAQ Physical Limitation scale (+10.1 points; 95% CI: 3.9-16.2 points; P = 0.001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Aficamten improved the health status of patients with symptomatic oHCM significantly more than did metoprolol, highlighting its potential as an effective initial therapeutic option. (Phase 3 Trial to Evaluate the Efficacy and Safety of Aficamten Compared to Metoprolol Succinate in Adults With Symptomatic oHCM (MAPLE-HCM; NCT05767346)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41493295/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.059",
      "dateReceived": "2026-01-13T23:26:46.521Z",
      "isNew": false
    },
    {
      "id": "a5e6c8490113",
      "title": "Oral ivermectin versus 5% permethrin cream to treat children and adults with classic scabies: multicentre, assessor blinded, cluster randomised clinical trial.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Dermatology",
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease",
        "Pediatrics (General)",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49663980/118533",
      "abstract": "To investigate whether oral ivermectin or topical 5% permethrin can clinically cure scabies in index cases and in members of their households. Multicentre, assessor blinded, cluster randomised clinical trial. 28 French hospitals, 19 January 2016 to 16 December 2021. Index cases; adults and children weighing >15 kg with scabies, confirmed by dermoscopy. Index cases were randomly assigned to the ivermectin group or permethrin group (1:1 ratio). Each member of the cluster, defined as the household of each index case, received the same treatment as the index case, except for children weighing <15 kg who were prescribed topical 5% permethrin. All participants received oral ivermectin 200 µg/kg or 5% permethrin cream on day 0 and day 10. Permethrin cream was applied to the whole body, from head to toe. The primary outcome was clinical cure of the cluster on day 28 (ie, disappearance of clinical signs and symptoms of scabies for all cluster members). Secondary outcomes were index case and individual level analyses and safety. Dermatologists were used as assessors and were masked to the treatment. 507 participants in 142 households (clusters) were treated with ivermectin and 568 participants in 147 households received permethrin. Cluster level cure rates were 71.8% versus 88.5% (-16.7 percentage point difference, 95% confidence interval (CI) -26.3 to -7.1) for ivermectin versus permethrin. Secondary outcome percentage point differences also showed the inferiority of ivermectin compared with 5% permethrin for index cases (76.6%  91.5%; percentage point difference -14.9, 95% CI -23.6 to -6.2) and participants (85.3%  94.2%; -9.2 percentage point difference, -14.9 to -3.5). Intraclass correlation coefficients were higher for permethrin than ivermectin for all clusters (0.68, 95% CI 0.61 to 0.75  0.46, 0.37 to 0.56) and for cluster size >1 (0.67, 0.60 to 0.74  0.47, 0.37 to 0.56). Cutaneous adverse events were found in 11.9% and 15.6% of participants treated with ivermectin and permethrin, respectively. The results of this cluster randomised trial of classic scabies, confirmed by dermoscopy, did not show the non-inferiority of oral ivermectin compared with 5% permethrin cream, given on days 0 and 10, in achieving clinical cure of scabies on day 28 in index cases and their household members. Conversely, the trial showed the statistical superiority of 5% permethrin cream. NCT02407782.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To investigate whether oral ivermectin or topical 5% permethrin can clinically cure scabies in index cases and in members of their households."
        },
        {
          "label": "DESIGN",
          "text": "Multicentre, assessor blinded, cluster randomised clinical trial."
        },
        {
          "label": "SETTING",
          "text": "28 French hospitals, 19 January 2016 to 16 December 2021."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Index cases; adults and children weighing >15 kg with scabies, confirmed by dermoscopy."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Index cases were randomly assigned to the ivermectin group or permethrin group (1:1 ratio). Each member of the cluster, defined as the household of each index case, received the same treatment as the index case, except for children weighing <15 kg who were prescribed topical 5% permethrin. All participants received oral ivermectin 200 µg/kg or 5% permethrin cream on day 0 and day 10. Permethrin cream was applied to the whole body, from head to toe."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary outcome was clinical cure of the cluster on day 28 (ie, disappearance of clinical signs and symptoms of scabies for all cluster members). Secondary outcomes were index case and individual level analyses and safety. Dermatologists were used as assessors and were masked to the treatment."
        },
        {
          "label": "RESULTS",
          "text": "507 participants in 142 households (clusters) were treated with ivermectin and 568 participants in 147 households received permethrin. Cluster level cure rates were 71.8% versus 88.5% (-16.7 percentage point difference, 95% confidence interval (CI) -26.3 to -7.1) for ivermectin versus permethrin. Secondary outcome percentage point differences also showed the inferiority of ivermectin compared with 5% permethrin for index cases (76.6%  91.5%; percentage point difference -14.9, 95% CI -23.6 to -6.2) and participants (85.3%  94.2%; -9.2 percentage point difference, -14.9 to -3.5). Intraclass correlation coefficients were higher for permethrin than ivermectin for all clusters (0.68, 95% CI 0.61 to 0.75  0.46, 0.37 to 0.56) and for cluster size >1 (0.67, 0.60 to 0.74  0.47, 0.37 to 0.56). Cutaneous adverse events were found in 11.9% and 15.6% of participants treated with ivermectin and permethrin, respectively."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The results of this cluster randomised trial of classic scabies, confirmed by dermoscopy, did not show the non-inferiority of oral ivermectin compared with 5% permethrin cream, given on days 0 and 10, in achieving clinical cure of scabies on day 28 in index cases and their household members. Conversely, the trial showed the statistical superiority of 5% permethrin cream."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "NCT02407782."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41494769/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1136/bmj-2025-086277",
      "dateReceived": "2026-01-13T23:26:46.521Z",
      "isNew": false
    },
    {
      "id": "c080b753d721",
      "title": "Randomized Controlled Trial of Mechanical Thrombectomy With Anticoagulation Versus Anticoagulation Alone for Acute Intermediate-High Risk Pulmonary Embolism: Primary Outcomes From the STORM-PE Trial.",
      "journal": "Circulation",
      "score": "5/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49663980/118510",
      "abstract": "Patients with intermediate-high risk pulmonary embolism (PE) have an elevated right ventricular (RV) to left ventricular (LV) diameter ratio and are at risk of early clinical decompensation and mortality. Reperfusion therapy aims to rapidly relieve acute RV pressure overload and to normalize hemodynamics. STORM-PE (A Prospective, Multicenter, Randomized Controlled Trial Evaluating Anticoagulation Alone Versus Anticoagulation Plus Mechanical Aspiration With the Indigo Aspiration System for the Treatment of Intermediate-High Risk Acute Pulmonary Embolism) is the first reported randomized controlled trial to test the efficacy and to evaluate the safety of mechanical thrombectomy, specifically computer-assisted vacuum thrombectomy (CAVT) with anticoagulation compared to anticoagulation alone. STORM-PE is an international randomized controlled trial with 1:1 randomization to CAVT with anticoagulation or anticoagulation alone. Eligible adults had acute-onset (symptoms ≤14 days), intermediate-high risk PE and were normotensive, with an RV/LV ratio ≥1.0 on computed tomographic pulmonary angiography and elevated cardiac biomarkers. The primary end-point analysis tested for a difference between groups for the change in RV/LV ratio at 48 hours, assessed by a blinded independent imaging core laboratory. Secondary end points included major adverse events within 7 days (a composite of clinical deterioration necessitating rescue therapy, PE-related mortality, symptomatic recurrent PE, and major bleeding), adjudicated by an external clinical events committee. Additional outcomes included change in vital signs and core laboratory-assessed pulmonary artery obstruction at 48 hours. A total of 100 patients enrolled across 22 sites were randomized to CAVT (n=47) or anticoagulation alone (n=53). Baseline characteristics were comparable between arms. At 48 hours, mean reduction in RV/LV ratio was greater for CAVT (0.52±0.37) than anticoagulation (0.24±0.40), a difference of 0.27 (95% CI, 0.12-0.43; <0.001). Refined modified and modified Miller scores exhibited greater changes for CAVT than anticoagulation alone at 48 hours (<0.001). Early normalization of vital signs within 48 hours was more frequent after CAVT. The major adverse event rate within 7 days was not different between groups (CAVT, 4.3% versus anticoagulation, 7.5%; =0.681). Two PE-related deaths occurred in the CAVT arm. CAVT was superior to anticoagulation alone in reducing RV/LV ratio within 48 hours in patients with intermediate-high risk PE, accompanied by earlier normalization of vital signs and major adverse event rates comparable to those for anticoagulation. URL: https://www.clinicaltrials.gov; Unique identifier: NCT05684796.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients with intermediate-high risk pulmonary embolism (PE) have an elevated right ventricular (RV) to left ventricular (LV) diameter ratio and are at risk of early clinical decompensation and mortality. Reperfusion therapy aims to rapidly relieve acute RV pressure overload and to normalize hemodynamics. STORM-PE (A Prospective, Multicenter, Randomized Controlled Trial Evaluating Anticoagulation Alone Versus Anticoagulation Plus Mechanical Aspiration With the Indigo Aspiration System for the Treatment of Intermediate-High Risk Acute Pulmonary Embolism) is the first reported randomized controlled trial to test the efficacy and to evaluate the safety of mechanical thrombectomy, specifically computer-assisted vacuum thrombectomy (CAVT) with anticoagulation compared to anticoagulation alone."
        },
        {
          "label": "METHODS",
          "text": "STORM-PE is an international randomized controlled trial with 1:1 randomization to CAVT with anticoagulation or anticoagulation alone. Eligible adults had acute-onset (symptoms ≤14 days), intermediate-high risk PE and were normotensive, with an RV/LV ratio ≥1.0 on computed tomographic pulmonary angiography and elevated cardiac biomarkers. The primary end-point analysis tested for a difference between groups for the change in RV/LV ratio at 48 hours, assessed by a blinded independent imaging core laboratory. Secondary end points included major adverse events within 7 days (a composite of clinical deterioration necessitating rescue therapy, PE-related mortality, symptomatic recurrent PE, and major bleeding), adjudicated by an external clinical events committee. Additional outcomes included change in vital signs and core laboratory-assessed pulmonary artery obstruction at 48 hours."
        },
        {
          "label": "RESULTS",
          "text": "A total of 100 patients enrolled across 22 sites were randomized to CAVT (n=47) or anticoagulation alone (n=53). Baseline characteristics were comparable between arms. At 48 hours, mean reduction in RV/LV ratio was greater for CAVT (0.52±0.37) than anticoagulation (0.24±0.40), a difference of 0.27 (95% CI, 0.12-0.43; <0.001). Refined modified and modified Miller scores exhibited greater changes for CAVT than anticoagulation alone at 48 hours (<0.001). Early normalization of vital signs within 48 hours was more frequent after CAVT. The major adverse event rate within 7 days was not different between groups (CAVT, 4.3% versus anticoagulation, 7.5%; =0.681). Two PE-related deaths occurred in the CAVT arm."
        },
        {
          "label": "CONCLUSIONS",
          "text": "CAVT was superior to anticoagulation alone in reducing RV/LV ratio within 48 hours in patients with intermediate-high risk PE, accompanied by earlier normalization of vital signs and major adverse event rates comparable to those for anticoagulation."
        },
        {
          "label": "REGISTRATION",
          "text": "URL: https://www.clinicaltrials.gov; Unique identifier: NCT05684796."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41183181/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1161/CIRCULATIONAHA.125.077232",
      "dateReceived": "2026-01-13T23:26:46.521Z",
      "isNew": false
    },
    {
      "id": "9cea728e0f4c",
      "title": "One versus five days of octreotide infusion for acute esophageal variceal bleeding: a randomized controlled trial.",
      "journal": "Am J Gastroenterol",
      "score": "7/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49655350/118546",
      "abstract": "The optimal duration of octreotide infusion for esophageal variceal bleeding remains unclear. We aimed to compare the efficacy of 1-day versus 5-day octreotide infusion combined with endoscopic therapy, with the primary outcome of early (5-day) re-bleeding under a non-inferiority framework and secondary outcomes of 6-week re-bleeding and all-cause mortality. This nationwide, multicenter, non-inferiority, open-label, randomized, controlled trial included 220 patients with cirrhosis and acute esophageal variceal bleeding who underwent endoscopic band ligation in five tertiary-care and three university-based hospitals across Thailand. They received a 1-day (n=109) or 5-day (n=111) regimen of continuous octreotide infusion after successful endoscopy. Re-bleeding, transfusion requirements, and mortality were assessed. The majority of participants were men (180/220), and the average age was 56 years. The 5-day re-bleeding (1.83% vs. 1.80%, p≥0.99), 6-week re-bleeding (8.26% vs. 10.81%, p=0.52), and 6-week all-cause mortality (5.50% vs. 6.31%, p=0.80) rates were similar between the 1- and 5-day groups. The event-rate difference in early re-bleeding was 0.03%, indicating non-inferiority (95% CI, 3.50-3.56%). Patients in the 1-day group required significantly fewer blood transfusions and had a shorter time to oral diet and shorter hospital stay. Following successful endoscopic band ligation, the 1-day regimen of octreotide had a non-inferior effect compared to the standard 5-day regimen in the prevention of 5-day re-bleeding and exhibited no significant differences in the prevention of 6-week re-bleeding and all-cause mortality.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "The optimal duration of octreotide infusion for esophageal variceal bleeding remains unclear. We aimed to compare the efficacy of 1-day versus 5-day octreotide infusion combined with endoscopic therapy, with the primary outcome of early (5-day) re-bleeding under a non-inferiority framework and secondary outcomes of 6-week re-bleeding and all-cause mortality."
        },
        {
          "label": "METHODS",
          "text": "This nationwide, multicenter, non-inferiority, open-label, randomized, controlled trial included 220 patients with cirrhosis and acute esophageal variceal bleeding who underwent endoscopic band ligation in five tertiary-care and three university-based hospitals across Thailand. They received a 1-day (n=109) or 5-day (n=111) regimen of continuous octreotide infusion after successful endoscopy. Re-bleeding, transfusion requirements, and mortality were assessed."
        },
        {
          "label": "RESULTS",
          "text": "The majority of participants were men (180/220), and the average age was 56 years. The 5-day re-bleeding (1.83% vs. 1.80%, p≥0.99), 6-week re-bleeding (8.26% vs. 10.81%, p=0.52), and 6-week all-cause mortality (5.50% vs. 6.31%, p=0.80) rates were similar between the 1- and 5-day groups. The event-rate difference in early re-bleeding was 0.03%, indicating non-inferiority (95% CI, 3.50-3.56%). Patients in the 1-day group required significantly fewer blood transfusions and had a shorter time to oral diet and shorter hospital stay."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Following successful endoscopic band ligation, the 1-day regimen of octreotide had a non-inferior effect compared to the standard 5-day regimen in the prevention of 5-day re-bleeding and exhibited no significant differences in the prevention of 6-week re-bleeding and all-cause mortality."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41090987/",
      "pubDate": "2025 Oct 15",
      "doi": "10.14309/ajg.0000000000003791",
      "dateReceived": "2026-01-12T23:23:40.713Z",
      "isNew": false
    },
    {
      "id": "fbcfd9e1a6ba",
      "title": "Diagnosis and Management of Community-acquired Pneumonia. An Official American Thoracic Society Clinical Practice Guideline.",
      "journal": "Am J Respir Crit Care Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49570862/118443",
      "abstract": "Understanding of the diagnosis and treatment of adults with community-acquired pneumonia (CAP) has evolved thanks to new evidence, experience, and emerging technologies. This document updates evidence-based clinical practice guidelines on four key questions for the diagnosis and management of adult patients with CAP. A multidisciplinary panel integrated systematic reviews of comparative evidence with other relevant research and clinical experience, then applied Grading of Recommendations, Assessment, Development and Evaluation (GRADE) methodology to produce recommendations using the Evidence to Decision Framework. The panel formulated clinical recommendations that address questions related to CAP, including lung ultrasound for diagnosis, empiric antibacterial therapy if a test for a respiratory virus is positive, antibiotic duration, and the use of systemic corticosteroids. The panel formulated and provided the rationale for recommendations on selected diagnostic and treatment strategies for adult patients with CAP.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Understanding of the diagnosis and treatment of adults with community-acquired pneumonia (CAP) has evolved thanks to new evidence, experience, and emerging technologies. This document updates evidence-based clinical practice guidelines on four key questions for the diagnosis and management of adult patients with CAP."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary panel integrated systematic reviews of comparative evidence with other relevant research and clinical experience, then applied Grading of Recommendations, Assessment, Development and Evaluation (GRADE) methodology to produce recommendations using the Evidence to Decision Framework."
        },
        {
          "label": "RESULTS",
          "text": "The panel formulated clinical recommendations that address questions related to CAP, including lung ultrasound for diagnosis, empiric antibacterial therapy if a test for a respiratory virus is positive, antibiotic duration, and the use of systemic corticosteroids."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The panel formulated and provided the rationale for recommendations on selected diagnostic and treatment strategies for adult patients with CAP."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40679934/",
      "pubDate": "2025 Jul 18",
      "doi": "10.1164/rccm.202507-1692ST",
      "dateReceived": "2026-01-12T23:23:40.713Z",
      "isNew": false
    },
    {
      "id": "dde74f1c8dd3",
      "title": "Cardiovascular Outcomes with Tirzepatide versus Dulaglutide in Type 2 Diabetes.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49505016/118436",
      "abstract": "Tirzepatide, a dual incretin agonist of the glucagon-like peptide-1 and glucose-dependent insulinotropic polypeptide receptors, has favorable effects on glycemic control and body weight. The effects on cardiovascular outcomes are uncertain. We conducted an active-comparator-controlled, double-blind, noninferiority trial in which patients with type 2 diabetes and atherosclerotic cardiovascular disease were randomly assigned in a 1:1 ratio to receive a weekly subcutaneous injection of tirzepatide (up to 15 mg) or dulaglutide (1.5 mg), an agent that has been shown to reduce the incidence of cardiovascular events. The primary end point was a composite of death from cardiovascular causes, myocardial infarction, or stroke and was tested for noninferiority of tirzepatide to dulaglutide with a margin of 1.05 for the upper limit of the 95.3% confidence interval for the hazard ratio. An upper limit of less than 1.00 was considered to indicate superiority of tirzepatide to dulaglutide. A total of 13,299 patients underwent randomization; 134 were subsequently excluded because they did not meet inclusion criteria. The modified intention-to-treat population thus included 6586 patients in the tirzepatide group and 6579 in the dulaglutide group. The mean (±SD) age of the patients was 64.1±8.8 years, 29.0% were women, the mean body-mass index (the weight in kilograms divided by the square of the height in meters) was 32.6±5.5, the mean glycated hemoglobin level was 8.4±0.9%, and the mean duration of diabetes was 14.7±8.8 years. A primary end-point event occurred in 801 patients (12.2%) in the tirzepatide group and 862 (13.1%) in the dulaglutide group (hazard ratio, 0.92; 95.3% confidence interval, 0.83 to 1.01; P = 0.003 for noninferiority; P = 0.09 for superiority). The incidence of adverse events appeared to be similar in the two groups, although more gastrointestinal adverse events were observed in the tirzepatide group. Among patients with type 2 diabetes and atherosclerotic cardiovascular disease, tirzepatide was noninferior to dulaglutide with respect to a composite of death from cardiovascular causes, myocardial infarction, or stroke. (Funded by Eli Lilly; SURPASS-CVOT ClinicalTrials.gov number, NCT04255433.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Tirzepatide, a dual incretin agonist of the glucagon-like peptide-1 and glucose-dependent insulinotropic polypeptide receptors, has favorable effects on glycemic control and body weight. The effects on cardiovascular outcomes are uncertain."
        },
        {
          "label": "METHODS",
          "text": "We conducted an active-comparator-controlled, double-blind, noninferiority trial in which patients with type 2 diabetes and atherosclerotic cardiovascular disease were randomly assigned in a 1:1 ratio to receive a weekly subcutaneous injection of tirzepatide (up to 15 mg) or dulaglutide (1.5 mg), an agent that has been shown to reduce the incidence of cardiovascular events. The primary end point was a composite of death from cardiovascular causes, myocardial infarction, or stroke and was tested for noninferiority of tirzepatide to dulaglutide with a margin of 1.05 for the upper limit of the 95.3% confidence interval for the hazard ratio. An upper limit of less than 1.00 was considered to indicate superiority of tirzepatide to dulaglutide."
        },
        {
          "label": "RESULTS",
          "text": "A total of 13,299 patients underwent randomization; 134 were subsequently excluded because they did not meet inclusion criteria. The modified intention-to-treat population thus included 6586 patients in the tirzepatide group and 6579 in the dulaglutide group. The mean (±SD) age of the patients was 64.1±8.8 years, 29.0% were women, the mean body-mass index (the weight in kilograms divided by the square of the height in meters) was 32.6±5.5, the mean glycated hemoglobin level was 8.4±0.9%, and the mean duration of diabetes was 14.7±8.8 years. A primary end-point event occurred in 801 patients (12.2%) in the tirzepatide group and 862 (13.1%) in the dulaglutide group (hazard ratio, 0.92; 95.3% confidence interval, 0.83 to 1.01; P = 0.003 for noninferiority; P = 0.09 for superiority). The incidence of adverse events appeared to be similar in the two groups, although more gastrointestinal adverse events were observed in the tirzepatide group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with type 2 diabetes and atherosclerotic cardiovascular disease, tirzepatide was noninferior to dulaglutide with respect to a composite of death from cardiovascular causes, myocardial infarction, or stroke. (Funded by Eli Lilly; SURPASS-CVOT ClinicalTrials.gov number, NCT04255433.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41406444/",
      "pubDate": "2025 Dec 18",
      "doi": "10.1056/NEJMoa2505928",
      "dateReceived": "2026-01-12T23:23:40.713Z",
      "isNew": false
    },
    {
      "id": "de5e161b237f",
      "title": "Complete revascularization timing in ST-segment elevation myocardial infarction and multivessel disease with heart failure: the OPTION-STEMI trial.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49638240/118530",
      "dateReceived": "2026-01-11T23:26:51.645Z",
      "isNew": false
    },
    {
      "id": "4ba49b55f9d2",
      "title": "Effect of Semaglutide on Insulin Dose Reduction in Adults With Type 1 Diabetes and Obesity Using Automated Insulin Delivery Systems: ADJUST-T1D Post Hoc Analysis.",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49638240/118469",
      "abstract": "In this post hoc analysis, we used the data from the Adjunct Semaglutide Treatment in Type 1 Diabetes (ADJUST-T1D) trial, a double-blind, multicenter, randomized, placebo-controlled trial of semaglutide 1 mg/week in adults with type 1 diabetes [[T1D]and obesity), to evaluate the relationship between insulin dose reduction and weight loss. Changes between semaglutide and placebo groups over 26 weeks in total daily insulin dose (TDD), basal and bolus insulin doses, carbohydrate intake, and user-initiated bolus counts were analyzed using linear mixed models. Mediation analysis was used to attribute direct effects of semaglutide versus weight loss on insulin dose reduction. From baseline to week 26, there was a significant 22.6% reduction in TDD (95% CI -28.3 to -17.0), which was driven by greater reductions in bolus insulin (-30.5%; 95% CI -39.5 to -21.5) than basal insulin (-15.6%; 95% CI -21.5 to -9.7). The basal/TDD ratio increased from 0.56 to 0.62 (P < 0.001) and insulin dose (in units/kg/day) decreased from 0.72 to 0.60 (P < 0.001) in the semaglutide group. At week 4, an 83% (-11.1 U/day) reduction in TDD was due to a direct drug effect, and 17% (-2.3 U/day) was attributed to weight loss, whereas at week 26, the difference was split evenly between direct effect (-11.4 U/day; 52%) and weight loss (-10.5 U/day; 48%). Daily carbohydrate intake decreased from 137 g (95% CI 107-167) at baseline to 107 g (95% CI 76-137) at 26 weeks. Semaglutide produced rapid, sustained, and primarily bolus-driven insulin dose reductions, with early effects being largely independent of weight loss in adults with T1D and obesity.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "In this post hoc analysis, we used the data from the Adjunct Semaglutide Treatment in Type 1 Diabetes (ADJUST-T1D) trial, a double-blind, multicenter, randomized, placebo-controlled trial of semaglutide 1 mg/week in adults with type 1 diabetes [[T1D]and obesity), to evaluate the relationship between insulin dose reduction and weight loss."
        },
        {
          "label": "RESEARCH DESIGN AND METHODS",
          "text": "Changes between semaglutide and placebo groups over 26 weeks in total daily insulin dose (TDD), basal and bolus insulin doses, carbohydrate intake, and user-initiated bolus counts were analyzed using linear mixed models. Mediation analysis was used to attribute direct effects of semaglutide versus weight loss on insulin dose reduction."
        },
        {
          "label": "RESULTS",
          "text": "From baseline to week 26, there was a significant 22.6% reduction in TDD (95% CI -28.3 to -17.0), which was driven by greater reductions in bolus insulin (-30.5%; 95% CI -39.5 to -21.5) than basal insulin (-15.6%; 95% CI -21.5 to -9.7). The basal/TDD ratio increased from 0.56 to 0.62 (P < 0.001) and insulin dose (in units/kg/day) decreased from 0.72 to 0.60 (P < 0.001) in the semaglutide group. At week 4, an 83% (-11.1 U/day) reduction in TDD was due to a direct drug effect, and 17% (-2.3 U/day) was attributed to weight loss, whereas at week 26, the difference was split evenly between direct effect (-11.4 U/day; 52%) and weight loss (-10.5 U/day; 48%). Daily carbohydrate intake decreased from 137 g (95% CI 107-167) at baseline to 107 g (95% CI 76-137) at 26 weeks."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Semaglutide produced rapid, sustained, and primarily bolus-driven insulin dose reductions, with early effects being largely independent of weight loss in adults with T1D and obesity."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41429002/",
      "pubDate": "2025 Dec 22",
      "doi": "10.2337/dc25-2249",
      "dateReceived": "2026-01-11T23:26:51.645Z",
      "isNew": false
    },
    {
      "id": "b2455b1f02cf",
      "title": "Stratafix vs Vicryl suture for hysterotomy closure in scheduled cesarean deliveries: a randomized clinical trial.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49638240/118543",
      "abstract": "Reducing blood loss at the time of scheduled cesarean improves maternal outcomes. Type of suture material and closure technique may contribute to reduction in blood loss specifically related to the incision site as well as more expeditiously achieve uterine contractility. Prior publications have noted reduced closure times when using knotless barbed suture, but available evidence remains limited. To examine whether patients whose hysterotomies were closed with Stratafix barbed suture at the time of scheduled cesarean delivery had lower quantified blood loss compared to patients who received Vicryl (Polyglactin 910) suture. This was a prospective randomized clinical trial at a single tertiary care center in New York City. Patients with a scheduled primary or repeat cesarean delivery ≥37.0 weeks' gestation provided informed consent and were randomized to either Stratafix barbed suture or Vicryl (Polyglactin 910) suture for hysterotomy closure. The primary outcome was quantified blood loss, measured in milliliters using the mobile Stryker Triton artificial intelligence scanner. Secondary outcomes included (1) single-layer hysterotomy closure time, (2) use of additional hemostatic sutures, (3) intraoperative use of hemostatic agents, (4) rate of surgical site infection (including endometritis), and (5) differences in average postoperative pain. The Mann-Whitney U test compared observed medians of continuous outcomes between groups. Chi-squared tests compared proportional differences in categorical outcomes between groups. An a posteriori multivariable quantile regression model examined whether continuous outcomes differed when controlling for suspected confounders. Between July 20, 2021 and November 30, 2023, 226 patients were randomized to either Stratafix barbed suture (n=113) or Vicryl (Polyglactin 910) suture (n=113) at the time of scheduled cesarean delivery. We observed no significant difference between the median quantified blood loss observed in the Stratafix barbed suture group (544.5 [250.7-838.8] mL) and the Vicryl (Polyglactin 910) suture group (600 [348-852] mL; P=.22). Median time to hysterotomy closure was 1.3 minutes shorter in the Stratafix barbed suture group (4.1[2.6-5.6] minutes) and the Vicryl (Polyglactin 910) suture group (5.4 [3.5-7.2] minutes; P<.001). In an a posteriori multivariable quantile regression adjusting for confounders, the median total quantified blood loss was not statistically significantly different between groups (P=.37). Median time to hysterotomy closure was 1.8 minutes shorter for the Stratafix barbed suture group (P<.01). The use of Stratafix barbed sutures was not associated with a reduction in blood loss compared with the Vicryl (Polyglactin 910) suture. However, the results of this randomized clinical trial suggest that Stratafix barbed suture may be associated with faster single-layer hysterotomy closure time. This suggests that Stratafix barbed suture could have benefits over Vicryl (Polyglactin 910) suture for the single-layer closure of hysterotomy during cesarean delivery. Any possible benefits of using Stratafix barbed suture at the time of hysterotomy closure during scheduled cesarean require further exploration.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Reducing blood loss at the time of scheduled cesarean improves maternal outcomes. Type of suture material and closure technique may contribute to reduction in blood loss specifically related to the incision site as well as more expeditiously achieve uterine contractility. Prior publications have noted reduced closure times when using knotless barbed suture, but available evidence remains limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine whether patients whose hysterotomies were closed with Stratafix barbed suture at the time of scheduled cesarean delivery had lower quantified blood loss compared to patients who received Vicryl (Polyglactin 910) suture."
        },
        {
          "label": "STUDY DESIGN",
          "text": "This was a prospective randomized clinical trial at a single tertiary care center in New York City. Patients with a scheduled primary or repeat cesarean delivery ≥37.0 weeks' gestation provided informed consent and were randomized to either Stratafix barbed suture or Vicryl (Polyglactin 910) suture for hysterotomy closure. The primary outcome was quantified blood loss, measured in milliliters using the mobile Stryker Triton artificial intelligence scanner. Secondary outcomes included (1) single-layer hysterotomy closure time, (2) use of additional hemostatic sutures, (3) intraoperative use of hemostatic agents, (4) rate of surgical site infection (including endometritis), and (5) differences in average postoperative pain. The Mann-Whitney U test compared observed medians of continuous outcomes between groups. Chi-squared tests compared proportional differences in categorical outcomes between groups. An a posteriori multivariable quantile regression model examined whether continuous outcomes differed when controlling for suspected confounders."
        },
        {
          "label": "RESULTS",
          "text": "Between July 20, 2021 and November 30, 2023, 226 patients were randomized to either Stratafix barbed suture (n=113) or Vicryl (Polyglactin 910) suture (n=113) at the time of scheduled cesarean delivery. We observed no significant difference between the median quantified blood loss observed in the Stratafix barbed suture group (544.5 [250.7-838.8] mL) and the Vicryl (Polyglactin 910) suture group (600 [348-852] mL; P=.22). Median time to hysterotomy closure was 1.3 minutes shorter in the Stratafix barbed suture group (4.1[2.6-5.6] minutes) and the Vicryl (Polyglactin 910) suture group (5.4 [3.5-7.2] minutes; P<.001). In an a posteriori multivariable quantile regression adjusting for confounders, the median total quantified blood loss was not statistically significantly different between groups (P=.37). Median time to hysterotomy closure was 1.8 minutes shorter for the Stratafix barbed suture group (P<.01)."
        },
        {
          "label": "CONCLUSION",
          "text": "The use of Stratafix barbed sutures was not associated with a reduction in blood loss compared with the Vicryl (Polyglactin 910) suture. However, the results of this randomized clinical trial suggest that Stratafix barbed suture may be associated with faster single-layer hysterotomy closure time. This suggests that Stratafix barbed suture could have benefits over Vicryl (Polyglactin 910) suture for the single-layer closure of hysterotomy during cesarean delivery. Any possible benefits of using Stratafix barbed suture at the time of hysterotomy closure during scheduled cesarean require further exploration."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41485827/",
      "pubDate": "2026 Jan",
      "doi": "10.1016/j.ajog.2025.04.053",
      "dateReceived": "2026-01-11T23:26:51.644Z",
      "isNew": false
    },
    {
      "id": "086d54e3d331",
      "title": "Semaglutide and Hospitalizations in Patients With Obesity and Established Cardiovascular Disease: An Exploratory Analysis of the SELECT Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118489",
      "abstract": "The primary analysis of the SELECT randomized clinical trial suggests that semaglutide reduced the rates of cardiovascular (CV) death, myocardial infarction, and stroke in patients with established CV disease (CVD) and overweight or obesity without diabetes. However, the effect of semaglutide on hospitalizations in this population remains unknown. To determine the impact of semaglutide on total hospital admissions and duration of hospital stay. The SELECT trial included patients aged 45 years or older with established CVD and a body mass index (BMI, calculated as weight in kilograms divided by height in meters squared) of 27 or higher without diabetes at 804 clinical settings across North America, South America, Europe, Asia, Africa, and Australia. Patients were randomized from October 2018 to March 2021. This prespecified exploratory analysis was conducted from February 2024 to September 2025. Once-weekly subcutaneous semaglutide, 2.4 mg, or placebo. The total number of hospital admissions and days in hospital between the semaglutide and placebo groups. A total of 17 604 patients (median [IQR] age, 61.0 [55.0-68.0] years; 4872 female patients [27.7%]; median [IQR] BMI, 32.1 [29.7-35.7]) were followed up for a median (IQR) period of 41.8 (33.0-47.0) months. There were 11 287 hospital admissions. The number of total hospitalizations was lower in the semaglutide group vs placebo for any indication (18.3 vs 20.4 admissions per 100 patient-years; mean ratio [MR], 0.90; 95% CI, 0.85-0.95; P < .001) and for serious adverse events (15.2 vs 17.1 admissions per 100 patient-years; MR, 0.89; 95% CI, 0.84-0.94; P < .001). The number of days hospitalized for any indication per 100 patient-years was lower in the semaglutide group vs placebo (157.2 vs 176.2 days; rate ratio [RR], 0.89; 95% CI, 0.82-0.98; P = .01), as well as hospitalizations for serious adverse events (137.6 vs 153.9 days; RR, 0.89; 95% CI, 0.81-0.98; P = .02). No heterogeneity was observed for the reduction of hospital admissions with semaglutide in selected subgroups, including BMI, age, and sex. In this prespecified exploratory analysis of the SELECT randomized clinical trial, the trial cohort had a high rate of hospital admissions. Treatment with once-weekly semaglutide was associated with significant reductions in hospital admissions and overall time spent in hospital, extending its benefits beyond CV risk reduction. ClinicalTrials.gov Identifier: NCT03574597.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The primary analysis of the SELECT randomized clinical trial suggests that semaglutide reduced the rates of cardiovascular (CV) death, myocardial infarction, and stroke in patients with established CV disease (CVD) and overweight or obesity without diabetes. However, the effect of semaglutide on hospitalizations in this population remains unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the impact of semaglutide on total hospital admissions and duration of hospital stay."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The SELECT trial included patients aged 45 years or older with established CVD and a body mass index (BMI, calculated as weight in kilograms divided by height in meters squared) of 27 or higher without diabetes at 804 clinical settings across North America, South America, Europe, Asia, Africa, and Australia. Patients were randomized from October 2018 to March 2021. This prespecified exploratory analysis was conducted from February 2024 to September 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Once-weekly subcutaneous semaglutide, 2.4 mg, or placebo."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The total number of hospital admissions and days in hospital between the semaglutide and placebo groups."
        },
        {
          "label": "RESULTS",
          "text": "A total of 17 604 patients (median [IQR] age, 61.0 [55.0-68.0] years; 4872 female patients [27.7%]; median [IQR] BMI, 32.1 [29.7-35.7]) were followed up for a median (IQR) period of 41.8 (33.0-47.0) months. There were 11 287 hospital admissions. The number of total hospitalizations was lower in the semaglutide group vs placebo for any indication (18.3 vs 20.4 admissions per 100 patient-years; mean ratio [MR], 0.90; 95% CI, 0.85-0.95; P < .001) and for serious adverse events (15.2 vs 17.1 admissions per 100 patient-years; MR, 0.89; 95% CI, 0.84-0.94; P < .001). The number of days hospitalized for any indication per 100 patient-years was lower in the semaglutide group vs placebo (157.2 vs 176.2 days; rate ratio [RR], 0.89; 95% CI, 0.82-0.98; P = .01), as well as hospitalizations for serious adverse events (137.6 vs 153.9 days; RR, 0.89; 95% CI, 0.81-0.98; P = .02). No heterogeneity was observed for the reduction of hospital admissions with semaglutide in selected subgroups, including BMI, age, and sex."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this prespecified exploratory analysis of the SELECT randomized clinical trial, the trial cohort had a high rate of hospital admissions. Treatment with once-weekly semaglutide was associated with significant reductions in hospital admissions and overall time spent in hospital, extending its benefits beyond CV risk reduction."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03574597."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41433034/",
      "pubDate": "2025 Dec 23",
      "doi": "10.1001/jamacardio.2025.4824",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    },
    {
      "id": "b1d0b99907b8",
      "title": "Once-Weekly Oral Islatravir Plus Lenacapavir Versus Daily Oral Bictegravir, Emtricitabine, and Tenofovir Alafenamide in Persons With HIV-1: A Phase 2 Randomized Study.",
      "journal": "Ann Intern Med",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118472",
      "abstract": "Once-weekly oral islatravir plus lenacapavir (ISL+LEN) has the potential to address adherence challenges with daily HIV-1 treatment. To evaluate efficacy and safety of once-weekly ISL+LEN. Phase 2, randomized, open-label, active-controlled study. (ClinialTrials.gov: NCT05052996). 44 U.S. sites. Adults with HIV-1 RNA viral load of less than 50 copies/mL receiving daily bictegravir, emtricitabine, and tenofovir alafenamide combination (B/F/TAF) for 24 weeks or more. Once-weekly oral ISL, 2 mg, plus LEN, 300 mg, or daily oral B/F/TAF. Proportion with HIV-1 RNA viral load of 50 copies/mL or more at week 24 (primary end point; U.S. Food and Drug Administration Snapshot Algorithm). Secondary end points: proportion of participants with HIV-1 RNA viral load of 50 copies/mL or more (weeks 12 and 48) and HIV-1 RNA viral load of less than 50 copies/mL (weeks 12, 24. and 48), safety, and CD4 T-cell and lymphocyte count changes (weeks 12, 24, and 48). A total of 104 participants were randomly assigned and treated (= 52 per group). At week 24, one ISL+LEN participant and no B/F/TAF participants had HIV-1 RNA viral load of 50 copies/mL or more (difference, 1.9% [95% CI, -5.2% to 10.5%]); 94.2% of participants in both groups had HIV-1 RNA viral load of less than 50 copies/mL (difference, 0% [CI, -10.9% to 10.9%]). At week 48, 94.2% and 92.3% of ISL+LEN and B/F/TAF participants, respectively, had HIV-1 RNA viral load of less than 50 copies/mL (difference, 1.9% [CI, -9.3% to 13.6%]); no participant had HIV-1 RNA viral load of 50 copies/mL or more. Two ISL+LEN participants discontinued treatment (before week 24) due to adverse events (AEs) unrelated to the study drug. No AEs that were grade 3 or greater or serious were related to treatment in either group. Changes in CD4 T-cell and lymphocyte counts from baseline to week 48 were similar between groups, with no discontinuations of study drug treatment due to decreased CD4 T cells or lymphocytes. Open-label, modest sample size, and only U.S.-based participants. Once-weekly oral ISL+LEN maintained high rates of virologic suppression through week 48 and was not associated with any treatment-related grade 3 or greater or serious AEs. Gilead Sciences, Inc.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Once-weekly oral islatravir plus lenacapavir (ISL+LEN) has the potential to address adherence challenges with daily HIV-1 treatment."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate efficacy and safety of once-weekly ISL+LEN."
        },
        {
          "label": "DESIGN",
          "text": "Phase 2, randomized, open-label, active-controlled study. (ClinialTrials.gov: NCT05052996)."
        },
        {
          "label": "SETTING",
          "text": "44 U.S. sites."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Adults with HIV-1 RNA viral load of less than 50 copies/mL receiving daily bictegravir, emtricitabine, and tenofovir alafenamide combination (B/F/TAF) for 24 weeks or more."
        },
        {
          "label": "INTERVENTION",
          "text": "Once-weekly oral ISL, 2 mg, plus LEN, 300 mg, or daily oral B/F/TAF."
        },
        {
          "label": "MEASUREMENTS",
          "text": "Proportion with HIV-1 RNA viral load of 50 copies/mL or more at week 24 (primary end point; U.S. Food and Drug Administration Snapshot Algorithm). Secondary end points: proportion of participants with HIV-1 RNA viral load of 50 copies/mL or more (weeks 12 and 48) and HIV-1 RNA viral load of less than 50 copies/mL (weeks 12, 24. and 48), safety, and CD4 T-cell and lymphocyte count changes (weeks 12, 24, and 48)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 104 participants were randomly assigned and treated (= 52 per group). At week 24, one ISL+LEN participant and no B/F/TAF participants had HIV-1 RNA viral load of 50 copies/mL or more (difference, 1.9% [95% CI, -5.2% to 10.5%]); 94.2% of participants in both groups had HIV-1 RNA viral load of less than 50 copies/mL (difference, 0% [CI, -10.9% to 10.9%]). At week 48, 94.2% and 92.3% of ISL+LEN and B/F/TAF participants, respectively, had HIV-1 RNA viral load of less than 50 copies/mL (difference, 1.9% [CI, -9.3% to 13.6%]); no participant had HIV-1 RNA viral load of 50 copies/mL or more. Two ISL+LEN participants discontinued treatment (before week 24) due to adverse events (AEs) unrelated to the study drug. No AEs that were grade 3 or greater or serious were related to treatment in either group. Changes in CD4 T-cell and lymphocyte counts from baseline to week 48 were similar between groups, with no discontinuations of study drug treatment due to decreased CD4 T cells or lymphocytes."
        },
        {
          "label": "LIMITATION",
          "text": "Open-label, modest sample size, and only U.S.-based participants."
        },
        {
          "label": "CONCLUSION",
          "text": "Once-weekly oral ISL+LEN maintained high rates of virologic suppression through week 48 and was not associated with any treatment-related grade 3 or greater or serious AEs."
        },
        {
          "label": "PRIMARY FUNDING SOURCE",
          "text": "Gilead Sciences, Inc."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41429026/",
      "pubDate": "2025 Dec 23",
      "doi": "10.7326/ANNALS-25-01939",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    },
    {
      "id": "2043b3237fff",
      "title": "The Limit of Detection in the Emergency Department Trial (LEGEND): A Stepped-Wedge Cluster Randomized Trial to Rule Out Acute Myocardial Infarction and Reduce Hospital Length of Stay for Patients Presenting to the Emergency Department.",
      "journal": "Ann Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118439",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    },
    {
      "id": "1096e3143cb5",
      "title": "Repetitive Transcranial Magnetic Stimulation and Motor Control Exercise for Chronic Low Back Pain: The ExTraStim Randomized Placebo-Controlled Trial.",
      "journal": "J Orthop Sports Phys Ther",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118428",
      "abstract": " To (1) assess the efficacy of combining repetitive transcranial magnetic stimulation (rTMS) and motor control exercise on pain intensity compared to each intervention alone or a placebo in patients with nonspecific chronic low back pain (CLBP), and (2) evaluate the effects of motor control exercise versus no-motor control exercise, and active rTMS versus sham rTMS.  Factorial randomized controlled trial.  Adults aged 18 to 65 years with nonspecific CLBP were randomly assigned in a 1:1:1:1 ratio to 1 of 4 groups: active rTMS, sham rTMS, active rTMS + motor control exercise, and sham rTMS + motor control exercise. Participants received 10 sessions of their allocated intervention over 8 weeks. Active and sham rTMS were performed over the primary motor cortex (10 Hz, 2000 pulses/session). The primary outcome was the average pain intensity at 8 weeks.  One hundred forty participants (80 females; mean age, 38.4 years) were recruited. Pain intensity significantly reduced over time, with no difference between groups. At 8 weeks, active rTMS + motor control exercise was not better than active rTMS (mean difference [MD], 0.1; 95% confidence interval [CI]: -1.0, 1.1;  = .89), sham rTMS (MD, 0.1; 95% CI:-0.9, 1.1;  = .83), or sham rTMS + motor control exercise (MD, 0.8; 95% CI: -0.3, 1.8;  = .15) to reduce pain. No significant differences in pain intensity were found between active and sham rTMS groups, with or without motor control exercise at 8 weeks.  Combining rTMS and motor control exercise did not significantly reduce pain intensity compared to each intervention used alone or placebo in participants with CLBP. .",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41385357/",
      "pubDate": "2026 Jan",
      "doi": "10.2519/jospt.2025.13681",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    },
    {
      "id": "2baee90bbab8",
      "title": "Metformin safety during pregnancy in women with gestational diabetes mellitus: A systematic review and meta-analysis of maternal, neonatal and long-term outcomes.",
      "journal": "Diabet Med",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49497926/118425",
      "abstract": "This systematic review and meta-analysis assessed the safety and efficacy of metformin in managing gestational diabetes mellitus (GDM), focusing on maternal, neonatal and long-term outcomes. While lifestyle changes are first-line treatment, pharmacological therapy is often required. Insulin, the standard, has drawbacks including weight gain, neonatal hypoglycaemia and maternal anxiety. Metformin is a promising alternative due to its insulin-sensitizing effects, but concerns remain about placental transfer and long-term effects on offspring. A systematic search was conducted in PubMed and Embase up to 29 August 2024, including randomized controlled trials (RCTs) and follow-up studies. Primary outcomes were neonatal hypoglycaemia, birthweight and long-term metabolic outcomes. Study quality was assessed using RoB 2.0 and ROBINS-I. Data were synthesized using the IVhet model. Ten RCTs were included. Metformin was associated with a statistically significant reduction in neonatal hypoglycaemia (OR: 0.65, 95% CI: 0.46-0.92) and lower birthweight (MD: -68.96 g, 95% CI: -108.34 to -29.57). A non-significant trend towards reduced LGA risk was observed. No significant differences in prediabetes, diabetes or insulin resistance were found. Long-term outcomes in children remain uncertain due to limited and heterogeneous follow-up data. Metformin appears safe and effective in GDM management, but more data are needed on long-term outcomes.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "This systematic review and meta-analysis assessed the safety and efficacy of metformin in managing gestational diabetes mellitus (GDM), focusing on maternal, neonatal and long-term outcomes. While lifestyle changes are first-line treatment, pharmacological therapy is often required. Insulin, the standard, has drawbacks including weight gain, neonatal hypoglycaemia and maternal anxiety. Metformin is a promising alternative due to its insulin-sensitizing effects, but concerns remain about placental transfer and long-term effects on offspring."
        },
        {
          "label": "METHODS",
          "text": "A systematic search was conducted in PubMed and Embase up to 29 August 2024, including randomized controlled trials (RCTs) and follow-up studies. Primary outcomes were neonatal hypoglycaemia, birthweight and long-term metabolic outcomes. Study quality was assessed using RoB 2.0 and ROBINS-I. Data were synthesized using the IVhet model."
        },
        {
          "label": "RESULTS",
          "text": "Ten RCTs were included. Metformin was associated with a statistically significant reduction in neonatal hypoglycaemia (OR: 0.65, 95% CI: 0.46-0.92) and lower birthweight (MD: -68.96 g, 95% CI: -108.34 to -29.57). A non-significant trend towards reduced LGA risk was observed. No significant differences in prediabetes, diabetes or insulin resistance were found. Long-term outcomes in children remain uncertain due to limited and heterogeneous follow-up data."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Metformin appears safe and effective in GDM management, but more data are needed on long-term outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41354637/",
      "pubDate": "2025 Dec 07",
      "doi": "10.1111/dme.70173",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    },
    {
      "id": "bd1aad27005c",
      "title": "Results of a 1-year randomised double-blind placebo-controlled trial with methotrexate 25 mg/week in recently diagnosed polymyalgia rheumatica.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49485495/118473",
      "abstract": "Methotrexate is recommended in current guidelines as a first-choice glucocorticoid (GC)-sparing agent for patients with polymyalgia rheumatica (PMR) prone to relapses or prolonged GC use. Previous randomised controlled trials (RCTs) have reported conflicting results but used low doses of methotrexate (7.5-10 mg/wk). More evidence on higher doses (25 mg/wk) is needed. In this 52-week blinded, placebo-controlled RCT, patients with recently diagnosed PMR (per 2012 European League Against Rheumatism/American College of Rheumatology criteria) and <8 weeks of GC use were randomised 1:1 to methotrexate 25 mg/wk or placebo, alongside a 24-week GC-tapering protocol. The primary outcome was GC-free remission (Polymyalgia Rheumatica-Activity Score <10 and no GC use) at week 52, tested with a 1-sided Cochran-Mantel-Haenszel test stratified by sex and inflammatory markers. Sixty-four patients were recruited, of whom 58 were included in the final analysis. GC-free remission at 52 weeks was achieved in 80% of patients in the methotrexate group vs 46% in the placebo group (risk difference 34%, 1-sided 95% CI: 14%, 1-sided P = .0042). This small but high-quality RCT demonstrated that methotrexate 25 mg/wk significantly increases the likelihood of achieving GC-free remission at 52 weeks in newly diagnosed PMR. These findings show a benefit of early introduction of methotrexate in PMR. Further research is needed to determine the optimal timing of methotrexate initiation.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "Methotrexate is recommended in current guidelines as a first-choice glucocorticoid (GC)-sparing agent for patients with polymyalgia rheumatica (PMR) prone to relapses or prolonged GC use. Previous randomised controlled trials (RCTs) have reported conflicting results but used low doses of methotrexate (7.5-10 mg/wk). More evidence on higher doses (25 mg/wk) is needed."
        },
        {
          "label": "METHODS",
          "text": "In this 52-week blinded, placebo-controlled RCT, patients with recently diagnosed PMR (per 2012 European League Against Rheumatism/American College of Rheumatology criteria) and <8 weeks of GC use were randomised 1:1 to methotrexate 25 mg/wk or placebo, alongside a 24-week GC-tapering protocol. The primary outcome was GC-free remission (Polymyalgia Rheumatica-Activity Score <10 and no GC use) at week 52, tested with a 1-sided Cochran-Mantel-Haenszel test stratified by sex and inflammatory markers."
        },
        {
          "label": "RESULTS",
          "text": "Sixty-four patients were recruited, of whom 58 were included in the final analysis. GC-free remission at 52 weeks was achieved in 80% of patients in the methotrexate group vs 46% in the placebo group (risk difference 34%, 1-sided 95% CI: 14%, 1-sided P = .0042)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This small but high-quality RCT demonstrated that methotrexate 25 mg/wk significantly increases the likelihood of achieving GC-free remission at 52 weeks in newly diagnosed PMR. These findings show a benefit of early introduction of methotrexate in PMR. Further research is needed to determine the optimal timing of methotrexate initiation."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41423373/",
      "pubDate": "2025 Dec 20",
      "doi": "10.1016/j.ard.2025.11.025",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    },
    {
      "id": "becefd6aa693",
      "title": "Diagnosis and management of paediatric magnet ingestion: a systematic review of clinical practice guidelines.",
      "journal": "Emerg Med J",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49485495/118458",
      "abstract": "The widespread use of small and powerful neodymium magnets in consumer products has led to a significant rise in paediatric magnet ingestion. The ingestion of multiple magnets poses serious risks, including bowel obstruction and perforation. Evidence-based Clinical Practice Guidelines (CPGs) are necessary to inform clinicians of the safest and most effective management strategies across a range of healthcare settings. This systematic review aims to summarise existing CPGs for diagnosing and managing paediatric magnet ingestion, evaluate the supporting evidence, highlight variation and consensus, and identify areas requiring further research. MEDLINE, Scopus, the Cochrane Library, Web of Science and Embase were searched to identify CPGs. Study characteristics, investigation and management recommendations, and indications for conservative management, endoscopy, surgery and discharge with and without follow-up were extracted. Two reviewers independently assessed CPG quality using the Appraisal of Guidelines for Research and Evaluation (AGREE) II instrument. 25 CPGs were included. Recommendations varied for diagnostic imaging, management of single and multiple magnet ingestion and the use of conservative, endoscopic or surgical interventions. However, there was consensus that: abdominal X-ray is the preferred first-line imaging modality, conservative management is recommended for asymptomatic single magnets, endoscopic removal is recommended for prepyloric asymptomatic multiple magnets and surgery for symptomatic multiple magnets. AGREE II appraisal revealed poor scores in CPG Applicability, Stakeholder Involvement and Rigour of Development, but strong scores for Editorial Independence. Existing CPGs for paediatric magnet ingestion are based on low-quality evidence or expert consensus. This review highlights inconsistencies and areas of consensus in current CPGs for paediatric magnet ingestion. Variations underscore the need for standardised, evidence-based guidelines to optimise care for affected children. Future research should focus on addressing gaps in evidence and consensus to ensure consistent management across healthcare settings.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The widespread use of small and powerful neodymium magnets in consumer products has led to a significant rise in paediatric magnet ingestion. The ingestion of multiple magnets poses serious risks, including bowel obstruction and perforation. Evidence-based Clinical Practice Guidelines (CPGs) are necessary to inform clinicians of the safest and most effective management strategies across a range of healthcare settings."
        },
        {
          "label": "AIM",
          "text": "This systematic review aims to summarise existing CPGs for diagnosing and managing paediatric magnet ingestion, evaluate the supporting evidence, highlight variation and consensus, and identify areas requiring further research."
        },
        {
          "label": "METHODS",
          "text": "MEDLINE, Scopus, the Cochrane Library, Web of Science and Embase were searched to identify CPGs. Study characteristics, investigation and management recommendations, and indications for conservative management, endoscopy, surgery and discharge with and without follow-up were extracted. Two reviewers independently assessed CPG quality using the Appraisal of Guidelines for Research and Evaluation (AGREE) II instrument."
        },
        {
          "label": "RESULTS",
          "text": "25 CPGs were included. Recommendations varied for diagnostic imaging, management of single and multiple magnet ingestion and the use of conservative, endoscopic or surgical interventions. However, there was consensus that: abdominal X-ray is the preferred first-line imaging modality, conservative management is recommended for asymptomatic single magnets, endoscopic removal is recommended for prepyloric asymptomatic multiple magnets and surgery for symptomatic multiple magnets. AGREE II appraisal revealed poor scores in CPG Applicability, Stakeholder Involvement and Rigour of Development, but strong scores for Editorial Independence. Existing CPGs for paediatric magnet ingestion are based on low-quality evidence or expert consensus."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This review highlights inconsistencies and areas of consensus in current CPGs for paediatric magnet ingestion. Variations underscore the need for standardised, evidence-based guidelines to optimise care for affected children. Future research should focus on addressing gaps in evidence and consensus to ensure consistent management across healthcare settings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41381185/",
      "pubDate": "2025 Dec 11",
      "doi": "10.1136/emermed-2024-214794",
      "dateReceived": "2026-01-10T23:26:52.788Z",
      "isNew": false
    }
  ]
}