{
  "updated_at": "2025-08-27T23:23:19.341Z",
  "articles": [
    {
      "id": "ad6da80592c7",
      "title": "Risk of cancer in the short- and long-term after incident venous thromboembolism - the HUNT and Tromso studies.",
      "journal": "Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117455",
      "dateReceived": "2025-08-27T23:22:52.762Z",
      "isNew": true
    },
    {
      "id": "929f706795a5",
      "title": "Improving stroke risk prediction in atrial fibrillation with circulating biomarkers: the CHA(2)DS(2)-VASc-Biomarkers model.",
      "journal": "J Thromb Haemost",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117403",
      "dateReceived": "2025-08-27T23:22:52.762Z",
      "isNew": true
    },
    {
      "id": "823898ee419e",
      "title": "Vonoprazan High-Dose Dual, Vonoprazan Triple, and Rabeprazole Reverse Hybrid Therapies for First-Line Treatment of Helicobacter pylori Infection: A Multicenter Randomized Trial.",
      "journal": "Am J Gastroenterol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117363",
      "abstract": "The aim of this study was to compare the efficacy of 14-day vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid therapies for the first-line treatment of Helicobacter pylori infection. In the multicenter, randomized, open-label trial, we consecutively recruited adult H. pylori -infected patients from 6 centers in Taiwan. Subjects were randomly assigned (1:1:1) to 14-day vonoprazan high-dose dual, vonoprazan triple, or rabeprazole reverse hybrid therapy. Eradication status was determined by 13 C-urea breath test. The primary outcome was the eradication rate of H. pylori assessed in the intention-to-treat population. Between December 2021 and April 2024, 906 patients were recruited. The eradication rates were 83.8% (253/302) for vonoprazan high-dose dual therapy, 90.1% (272/302) for vonoprazan triple therapy, and 89.1% (271/302) for rabeprazole reverse hybrid therapy in intention-to-treat analysis. Vonoprazan high-dose dual therapy was inferior to both vonoprazan triple (95% confidence interval -11.5% to -1.1%; P = 0.022) and rabeprazole reverse hybrid therapies (95% confidence interval -10.7% to 0.1%; P = 0.031). There were no significant differences in the overall proportions of patients experiencing adverse events among vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid groups (10.3%, 15.2%, and 15.6%, respectively). Body weight ≥60 kg, clarithromycin resistance, and poor drug adherence were independent risk factors predicting eradication failure for the 3 corresponding therapies, with odds ratios of 3.2 (1.3-7.5), 4.8 (1.2-18.9), and 14.8 (2.8-78.8), respectively. Vonoprazan triple therapy and rabeprazole reverse hybrid therapy are preferable to vonoprazan dual therapy for the first-line treatment of H. pylori infection.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "The aim of this study was to compare the efficacy of 14-day vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid therapies for the first-line treatment of Helicobacter pylori infection."
        },
        {
          "label": "METHODS",
          "text": "In the multicenter, randomized, open-label trial, we consecutively recruited adult H. pylori -infected patients from 6 centers in Taiwan. Subjects were randomly assigned (1:1:1) to 14-day vonoprazan high-dose dual, vonoprazan triple, or rabeprazole reverse hybrid therapy. Eradication status was determined by 13 C-urea breath test. The primary outcome was the eradication rate of H. pylori assessed in the intention-to-treat population."
        },
        {
          "label": "RESULTS",
          "text": "Between December 2021 and April 2024, 906 patients were recruited. The eradication rates were 83.8% (253/302) for vonoprazan high-dose dual therapy, 90.1% (272/302) for vonoprazan triple therapy, and 89.1% (271/302) for rabeprazole reverse hybrid therapy in intention-to-treat analysis. Vonoprazan high-dose dual therapy was inferior to both vonoprazan triple (95% confidence interval -11.5% to -1.1%; P = 0.022) and rabeprazole reverse hybrid therapies (95% confidence interval -10.7% to 0.1%; P = 0.031). There were no significant differences in the overall proportions of patients experiencing adverse events among vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid groups (10.3%, 15.2%, and 15.6%, respectively). Body weight ≥60 kg, clarithromycin resistance, and poor drug adherence were independent risk factors predicting eradication failure for the 3 corresponding therapies, with odds ratios of 3.2 (1.3-7.5), 4.8 (1.2-18.9), and 14.8 (2.8-78.8), respectively."
        },
        {
          "label": "DISCUSSION",
          "text": "Vonoprazan triple therapy and rabeprazole reverse hybrid therapy are preferable to vonoprazan dual therapy for the first-line treatment of H. pylori infection."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40560185/",
      "pubDate": "2025 Jun 16",
      "doi": "10.14309/ajg.0000000000003607",
      "dateReceived": "2025-08-27T23:22:52.762Z",
      "isNew": true,
      "summary": "Vonoprazan triple therapy and rabeprazole reverse hybrid therapy demonstrated superior eradication rates compared to vonoprazan high-dose dual therapy for first-line treatment of *H. pylori* infection."
    },
    {
      "id": "9cbe80b61900",
      "title": "Paclitaxel-Coated Balloon for the Treatment of Multilayer In-Stent Restenosis: AGENT IDE Subgroup Analysis.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117356",
      "abstract": "Patients with coronary in-stent restenosis (ISR) within multiple layers of stent pose a specific clinical challenge because of higher rates of recurrent restenosis as well as a desire to avoid an additional layer of stent. Drug-coated balloons (DCBs) provide an alternative antiproliferative therapeutic option for multilayer ISR. We evaluated the efficacy and safety of a low-dose paclitaxel-coated vs uncoated balloon among patients with multilayer or single-layer ISR in the AGENT IDE (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis) trial. AGENT IDE is a prospective, multicenter trial that randomized patients with ISR (reference vessel diameter >2.0 mm to ≤4.0 mm and lesion length <26 mm) in a 2:1 allocation to paclitaxel-coated or an uncoated balloon following successful lesion preparation. Randomization was stratified by multi- vs single-layer ISR as well as by center. The primary study endpoint was 1-year target lesion failure (TLF): composite occurrence of ischemia-driven target lesion revascularization (TLR), target vessel-related myocardial infarction (MI), or cardiac death. Of the 600 patients randomized in the trial, multilayer ISR was present in 258 (44%) patients. Patients with multilayer ISR had higher rates of TLF at 1 year compared with those with single-layer ISR (29.0% vs 15.7%, P < 0.0001). The overall study results were consistent irrespective of multilayer vs single-layer ISR (P = 0.66). Among patients with multilayer ISR, TLF was lower with paclitaxel-coated balloon compared with an uncoated balloon (23.8% vs 40.0%; HR: 0.55; 95% CI: 0.34-0.87; P = 0.01), driven by reductions in both TLR and target vessel-related MI. Similar findings were observed among patients with single layer ISR (1-year TLF: 13.5% with paclitaxel-coated vs 20.2% with uncoated balloon; HR: 0.64; 95% CI: 0.37-1.11; P = 0.11), although absolute event rates were lower. Patients with ISR of multiple stent layers had higher rates of adverse stent-related events compared with patients with single-layer ISR. Treatment with a paclitaxel-coated balloon led to greater absolute risk reduction in 1-year TLF among patients with multilayer ISR compared with an uncoated balloon. (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis [ISR] [AGENT IDE]; NCT04647253).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients with coronary in-stent restenosis (ISR) within multiple layers of stent pose a specific clinical challenge because of higher rates of recurrent restenosis as well as a desire to avoid an additional layer of stent. Drug-coated balloons (DCBs) provide an alternative antiproliferative therapeutic option for multilayer ISR."
        },
        {
          "label": "OBJECTIVES",
          "text": "We evaluated the efficacy and safety of a low-dose paclitaxel-coated vs uncoated balloon among patients with multilayer or single-layer ISR in the AGENT IDE (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis) trial."
        },
        {
          "label": "METHODS",
          "text": "AGENT IDE is a prospective, multicenter trial that randomized patients with ISR (reference vessel diameter >2.0 mm to ≤4.0 mm and lesion length <26 mm) in a 2:1 allocation to paclitaxel-coated or an uncoated balloon following successful lesion preparation. Randomization was stratified by multi- vs single-layer ISR as well as by center. The primary study endpoint was 1-year target lesion failure (TLF): composite occurrence of ischemia-driven target lesion revascularization (TLR), target vessel-related myocardial infarction (MI), or cardiac death."
        },
        {
          "label": "RESULTS",
          "text": "Of the 600 patients randomized in the trial, multilayer ISR was present in 258 (44%) patients. Patients with multilayer ISR had higher rates of TLF at 1 year compared with those with single-layer ISR (29.0% vs 15.7%, P < 0.0001). The overall study results were consistent irrespective of multilayer vs single-layer ISR (P = 0.66). Among patients with multilayer ISR, TLF was lower with paclitaxel-coated balloon compared with an uncoated balloon (23.8% vs 40.0%; HR: 0.55; 95% CI: 0.34-0.87; P = 0.01), driven by reductions in both TLR and target vessel-related MI. Similar findings were observed among patients with single layer ISR (1-year TLF: 13.5% with paclitaxel-coated vs 20.2% with uncoated balloon; HR: 0.64; 95% CI: 0.37-1.11; P = 0.11), although absolute event rates were lower."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Patients with ISR of multiple stent layers had higher rates of adverse stent-related events compared with patients with single-layer ISR. Treatment with a paclitaxel-coated balloon led to greater absolute risk reduction in 1-year TLF among patients with multilayer ISR compared with an uncoated balloon. (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis [ISR] [AGENT IDE]; NCT04647253)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40803784/",
      "pubDate": "2025 Aug 19",
      "doi": "10.1016/j.jacc.2025.05.062",
      "dateReceived": "2025-08-27T23:22:52.762Z",
      "isNew": true,
      "summary": "Patients with in-stent restenosis (ISR) involving multiple stent layers experienced more adverse events, but treatment with a paclitaxel-coated balloon reduced target lesion failure in these patients compared to an uncoated balloon."
    },
    {
      "id": "e213ea767f96",
      "title": "Pharmacotherapy for obesity management in adults: 2025 clinical practice guideline update.",
      "journal": "CMAJ",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47909824/117406",
      "abstract": "Pharmacotherapy is a key component of comprehensive obesity management, alongside behavioural therapy and metabolic and bariatric surgery. In this guideline, we update the pharmacotherapy recommendations in the 2020 Canadian clinical practice guideline on obesity in adults and in the 2022 pharmacotherapy for obesity management revision to provide current recommendations for clinicians on the efficacy, safety, and appropriate use of pharmacotherapy in the management of obesity in adults. This guideline update follows the same methodology as the 2020 Canadian guideline on obesity in adults, adhering to the Appraisal of Guidelines for Research and Evaluation instrument and using the Shekelle framework to assess and grade evidence and to formulate recommendations. Building on the search conducted for the 2022 pharmacotherapy revision, we conducted a systematic literature review (search dates January 2022 to July 2024), supplemented by relevant trials published through May 2025, to identify studies assessing the efficacy of pharmacotherapy for weight management. We also conducted 13 targeted searches on the management of weight-related complications in 13 subpopulations with important adiposity-related health issues. We engaged primary care physicians, obesity medicine specialists, and people with lived experience of obesity to provide feedback on the recommendations. This update includes 6 new and 7 revised recommendations since the 2022 pharmacotherapy guideline revision (all 2020 pharmacotherapy recommendations are updated). Measures of central adiposity, in addition to ethnicity-specific body mass index and adiposity-related complications, should be used to guide the decision to initiate pharmacotherapy. Obesity pharmacotherapy should be used in conjunction with health behaviour changes and individualized based on a person's specific health needs and in keeping with their values and preferences. Recommendations support long-term use of obesity pharmacotherapy for sustained weight loss and maintenance of weight loss. We provide recommendations for use of specific obesity pharmacotherapies with proven benefit in specific subpopulations - atherosclerotic cardiovascular disease, heart failure with preserved ejection fraction, metabolic dysfunction-associated steatohepatitis, prediabetes, type 2 diabetes, obstructive sleep apnea, osteoarthritis - and for those with certain specific monogenic causes of obesity. We recommend against the use of compounded medications or medications other than those approved for weight loss in people with excess adiposity. Pharmacotherapy in obesity facilitates clinically meaningful weight loss and important improvements in obesity-related health complications. Clinicians who treat people with obesity with or without obesity-related health complications should appropriately use pharmacotherapy as an integral part of their treatment paradigm.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Pharmacotherapy is a key component of comprehensive obesity management, alongside behavioural therapy and metabolic and bariatric surgery. In this guideline, we update the pharmacotherapy recommendations in the 2020 Canadian clinical practice guideline on obesity in adults and in the 2022 pharmacotherapy for obesity management revision to provide current recommendations for clinicians on the efficacy, safety, and appropriate use of pharmacotherapy in the management of obesity in adults."
        },
        {
          "label": "METHODS",
          "text": "This guideline update follows the same methodology as the 2020 Canadian guideline on obesity in adults, adhering to the Appraisal of Guidelines for Research and Evaluation instrument and using the Shekelle framework to assess and grade evidence and to formulate recommendations. Building on the search conducted for the 2022 pharmacotherapy revision, we conducted a systematic literature review (search dates January 2022 to July 2024), supplemented by relevant trials published through May 2025, to identify studies assessing the efficacy of pharmacotherapy for weight management. We also conducted 13 targeted searches on the management of weight-related complications in 13 subpopulations with important adiposity-related health issues. We engaged primary care physicians, obesity medicine specialists, and people with lived experience of obesity to provide feedback on the recommendations."
        },
        {
          "label": "RECOMMENDATIONS",
          "text": "This update includes 6 new and 7 revised recommendations since the 2022 pharmacotherapy guideline revision (all 2020 pharmacotherapy recommendations are updated). Measures of central adiposity, in addition to ethnicity-specific body mass index and adiposity-related complications, should be used to guide the decision to initiate pharmacotherapy. Obesity pharmacotherapy should be used in conjunction with health behaviour changes and individualized based on a person's specific health needs and in keeping with their values and preferences. Recommendations support long-term use of obesity pharmacotherapy for sustained weight loss and maintenance of weight loss. We provide recommendations for use of specific obesity pharmacotherapies with proven benefit in specific subpopulations - atherosclerotic cardiovascular disease, heart failure with preserved ejection fraction, metabolic dysfunction-associated steatohepatitis, prediabetes, type 2 diabetes, obstructive sleep apnea, osteoarthritis - and for those with certain specific monogenic causes of obesity. We recommend against the use of compounded medications or medications other than those approved for weight loss in people with excess adiposity."
        },
        {
          "label": "INTERPRETATION",
          "text": "Pharmacotherapy in obesity facilitates clinically meaningful weight loss and important improvements in obesity-related health complications. Clinicians who treat people with obesity with or without obesity-related health complications should appropriately use pharmacotherapy as an integral part of their treatment paradigm."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40789597/",
      "pubDate": "2025 Aug 10",
      "doi": "10.1503/cmaj.250502",
      "dateReceived": "2025-08-26T23:22:54.608Z",
      "isNew": false,
      "summary": "Pharmacotherapy for obesity should be used alongside lifestyle changes, tailored to individual needs, and guided by measures of central adiposity and related complications."
    },
    {
      "id": "a84859329464",
      "title": "Continuous glucose monitoring in noninsulin-treated type 2 diabetes: A critical review of reported trials with an updated systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47909824/117338",
      "abstract": "We aimed to review the observational and randomised clinical trial evidence and provide pragmatic recommendations for using continuous glucose monitoring (CGM) in individuals living with noninsulin-treated type 2 diabetes (T2DM). We first undertook a narrative review of observational studies that enrolled noninsulin-users or mixed populations of noninsulin and insulin-users with T2DM as well as randomised controlled trials (RCTs) that enrolled mixed populations with T2DM. We then performed a systematic review of the RCTs that specifically enrolled noninsulin-treated populations with T2DM and compared CGM to BGM/usual care. A meta-analysis of glycaemic outcomes was conducted with predefined subgroups based on CGM type. RCTs in mixed populations and observational studies demonstrated a largely consistent benefit of CGM on glycaemic and nonglycaemic outcomes with cost effectiveness and reduced healthcare resource utilisation. The meta-analysis of RCTs in noninsulin users included 8 studies encompassing 541 participants, among whom 297 (55%) were assigned to the CGM group. CGM was associated with significantly reduced HbA1c (weighted mean difference [WMD] -0.37%; 95% CI -0.49, -0.24; p < 0.00001; I = 0%), increased % time in range (WMD 8.84; 95% CI 4.62, 13.06; p < 0.0001; I = 0%) and lower % time above range (WMD -8.14; 95% CI -12.66, -3.63; p = 0.0004; I = 0%). There were no significant subgroup differences. CGM use in noninsulin-treated individuals living with T2DM was associated with improved glycaemic outcomes and patient experience, reduced health care resource utilisation, and acceptable cost-effectiveness. These findings provide additional evidence to support CGM use among people living with T2DM who are not using insulin therapy.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "We aimed to review the observational and randomised clinical trial evidence and provide pragmatic recommendations for using continuous glucose monitoring (CGM) in individuals living with noninsulin-treated type 2 diabetes (T2DM)."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We first undertook a narrative review of observational studies that enrolled noninsulin-users or mixed populations of noninsulin and insulin-users with T2DM as well as randomised controlled trials (RCTs) that enrolled mixed populations with T2DM. We then performed a systematic review of the RCTs that specifically enrolled noninsulin-treated populations with T2DM and compared CGM to BGM/usual care. A meta-analysis of glycaemic outcomes was conducted with predefined subgroups based on CGM type."
        },
        {
          "label": "RESULTS",
          "text": "RCTs in mixed populations and observational studies demonstrated a largely consistent benefit of CGM on glycaemic and nonglycaemic outcomes with cost effectiveness and reduced healthcare resource utilisation. The meta-analysis of RCTs in noninsulin users included 8 studies encompassing 541 participants, among whom 297 (55%) were assigned to the CGM group. CGM was associated with significantly reduced HbA1c (weighted mean difference [WMD] -0.37%; 95% CI -0.49, -0.24; p < 0.00001; I = 0%), increased % time in range (WMD 8.84; 95% CI 4.62, 13.06; p < 0.0001; I = 0%) and lower % time above range (WMD -8.14; 95% CI -12.66, -3.63; p = 0.0004; I = 0%). There were no significant subgroup differences."
        },
        {
          "label": "CONCLUSIONS",
          "text": "CGM use in noninsulin-treated individuals living with T2DM was associated with improved glycaemic outcomes and patient experience, reduced health care resource utilisation, and acceptable cost-effectiveness. These findings provide additional evidence to support CGM use among people living with T2DM who are not using insulin therapy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40757453/",
      "pubDate": "2025 Aug 04",
      "doi": "10.1111/dom.70008",
      "dateReceived": "2025-08-26T23:22:54.608Z",
      "isNew": false,
      "summary": "Continuous glucose monitoring (CGM) in non-insulin-treated type 2 diabetes patients improved blood sugar control, patient experience, reduced healthcare costs, and was cost-effective."
    },
    {
      "id": "969f9b94f8f0",
      "title": "Canadian Association of Gastroenterology Clinical Practice Guideline for the Endoscopic Management of Nonvariceal Nonpeptic Ulcer Upper Gastrointestinal Bleeding.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47909824/117328",
      "dateReceived": "2025-08-26T23:22:54.608Z",
      "isNew": false
    },
    {
      "id": "40266ed85f11",
      "title": "Red Cell Transfusion in Acute Myocardial Infarction: AABB International Clinical Practice Guidelines.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine",
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117430",
      "abstract": "Optimal transfusion strategies for patients with acute myocardial infarction (AMI) are uncertain. The aim of this guideline is to provide recommendations for red blood cell transfusion in patients with AMI. These guidelines are based on evidence from randomized controlled trials of patients presenting with AMI and assigned to 2 different transfusion strategies (restrictive or liberal) based on hemoglobin concentrations or hematocrit levels before receipt of a transfusion. A meta-analysis of eligible trials was performed using Cochrane methods. The international panel followed GRADE (Grading of Recommendations Assessment, Development and Evaluation) methods to summarize evidence and formulate recommendations. This guideline's primary perspective is that of the patient, including medical, financial, and psychological effects, with secondary consideration of health care system issues, particularly conservation of the limited and costly blood supply. For hospitalized patients with AMI, the panel suggests a liberal red cell transfusion strategy when the hemoglobin concentration is less than 10 g/dL (conditional recommendation, low-certainty evidence). A restrictive strategy of 7 to 8 g/dL may result in increased mortality in patients with AMI. The direction of the recommendation for the liberal strategy was based on the great importance of mortality for patients. The conditional recommendation was based on the low certainty of evidence and the competing consideration of blood supply conservation. Clinicians should adopt mitigation strategies to reduce potential adverse events associated with a liberal transfusion strategy, and all transfusion decisions should incorporate the clinical context rather than solely the hemoglobin concentration.",
      "structuredAbstract": [
        {
          "label": "DESCRIPTION",
          "text": "Optimal transfusion strategies for patients with acute myocardial infarction (AMI) are uncertain. The aim of this guideline is to provide recommendations for red blood cell transfusion in patients with AMI."
        },
        {
          "label": "METHODS",
          "text": "These guidelines are based on evidence from randomized controlled trials of patients presenting with AMI and assigned to 2 different transfusion strategies (restrictive or liberal) based on hemoglobin concentrations or hematocrit levels before receipt of a transfusion. A meta-analysis of eligible trials was performed using Cochrane methods. The international panel followed GRADE (Grading of Recommendations Assessment, Development and Evaluation) methods to summarize evidence and formulate recommendations. This guideline's primary perspective is that of the patient, including medical, financial, and psychological effects, with secondary consideration of health care system issues, particularly conservation of the limited and costly blood supply."
        },
        {
          "label": "RECOMMENDATION",
          "text": "For hospitalized patients with AMI, the panel suggests a liberal red cell transfusion strategy when the hemoglobin concentration is less than 10 g/dL (conditional recommendation, low-certainty evidence). A restrictive strategy of 7 to 8 g/dL may result in increased mortality in patients with AMI. The direction of the recommendation for the liberal strategy was based on the great importance of mortality for patients. The conditional recommendation was based on the low certainty of evidence and the competing consideration of blood supply conservation. Clinicians should adopt mitigation strategies to reduce potential adverse events associated with a liberal transfusion strategy, and all transfusion decisions should incorporate the clinical context rather than solely the hemoglobin concentration."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40825204/",
      "pubDate": "2025 Aug 19",
      "doi": "10.7326/ANNALS-25-00706",
      "dateReceived": "2025-08-25T23:24:45.990Z",
      "isNew": false,
      "summary": "For patients hospitalized with acute myocardial infarction, a liberal red blood cell transfusion strategy (hemoglobin less than 10 g/dL) is suggested, as a restrictive strategy may increase mortality, though this recommendation is based on low-certainty evidence."
    },
    {
      "id": "78dc49ace746",
      "title": "Withdrawal of heart failure therapy after atrial fibrillation rhythm control with ejection fraction normalization: the WITHDRAW-AF trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117426",
      "dateReceived": "2025-08-25T23:24:45.990Z",
      "isNew": false
    },
    {
      "id": "a400ae1a60bc",
      "title": "Sex Differences in Safety and Efficacy of Dual Antiplatelet Therapy Strategies for Patients With Acute Coronary Syndromes: A Systematic Review and Meta-analysis of Randomized Controlled Trials.",
      "journal": "Am J Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117388",
      "abstract": "Sex-specific evidence on de-escalation strategies of dual antiplatelet therapy (DAPT) after percutaneous coronary intervention in patients with acute coronary syndromes (ACS) remains limited. Females are often under-represented in randomized controlled trials (RCTs) and sex-based subgroup analysis in RCTs yield conflicting results. We searched PubMed and EMBASE in September 2024 for RCTs that investigated DAPT strategies for patients with ACS. We examined whether there are differences in the efficacy and safety of de-escalation strategies (i.e., short-term DAPT (≤6 months), unguided de-escalation, and guided de-escalation with genotype or platelet function tests) compared to standard DAPT (12 months) between sexes. A systematic review and meta-analysis were performed to compare the efficacy and safety between sexes with p-value for test of moderators. The primary efficacy outcome was major adverse cardiovascular events (MACEs), defined as a composite of cardiovascular death, myocardial infarction, and stroke. The primary safety outcome was major or minor bleeding. Fourteen RCTs involving 35,901 patients with ACS (7,652 female patients, 28,249 male patients) were included. The effect of de-escalation strategies on the primary efficacy outcome was significantly different between female (HR, 0.74; 95% CI, 0.57-0.95; I = 0%) and male patients (HR, 1.04; 95% CI, 0.90-1.19; I = 15%), with p-value for test of moderators 0.019. The primary safety outcome showed no significant sex differences (p-value for test of moderators = 0.67). In conclusions, in patients with ACS, compared to standard DAPT, de-escalation strategies were more effective in reducing MACE in female than in their male counterparts. Meanwhile, de-escalation strategies were similarly safer for both sexes.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40691919/",
      "pubDate": "2025 Jul 20",
      "doi": "10.1016/j.amjcard.2025.07.020",
      "dateReceived": "2025-08-25T23:24:45.990Z",
      "isNew": false,
      "summary": "In acute coronary syndrome patients, de-escalation strategies of dual antiplatelet therapy were more effective in reducing major adverse cardiovascular events in females compared to males, with similar safety profiles for both sexes."
    },
    {
      "id": "44569e9c87c9",
      "title": "The Effect of Animated Educational Video to Reduce Anxiety Levels Before Outpatient Medical Abortion: A Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117318",
      "abstract": "To determine the efficacy of an animated educational video combined with traditional counselling to reduce anxiety levels among pregnant women seeking outpatient medical abortion. Randomised controlled trial with two parallel groups. Single centre in Bangkok, Thailand. 60 pregnant women seeking outpatient medical abortion. Participants received either an animated educational video combined with traditional counselling (n = 30) or traditional counselling alone (n = 30). Postintervention anxiety levels were assessed by the Spielberger State-Trait Anxiety Inventory (STAI), and satisfaction levels were measured by a 5-point Likert-type scale. There were no significant differences in demographic characteristics between groups. The postintervention STAI scores were significantly lower in the video group compared to the non-video group (32.70 ± 4.96 vs. 41.47 ± 8.57, p < 0.01). The odds of moderate to severe anxiety were significantly lower in the video group (OR 10.29, 95% CI 2.56-41.37). Patient satisfaction levels were similarly high in both groups (4.92 ± 0.27 vs. 4.85 ± 0.36, p = 0.42). Incorporating an animated educational video into traditional counselling effectively reduced anxiety in pregnant women seeking outpatient medical abortion while maintaining high levels of satisfaction with the medical service provided.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To determine the efficacy of an animated educational video combined with traditional counselling to reduce anxiety levels among pregnant women seeking outpatient medical abortion."
        },
        {
          "label": "DESIGN",
          "text": "Randomised controlled trial with two parallel groups."
        },
        {
          "label": "SETTING",
          "text": "Single centre in Bangkok, Thailand."
        },
        {
          "label": "POPULATION OR SAMPLE",
          "text": "60 pregnant women seeking outpatient medical abortion."
        },
        {
          "label": "METHODS",
          "text": "Participants received either an animated educational video combined with traditional counselling (n = 30) or traditional counselling alone (n = 30)."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Postintervention anxiety levels were assessed by the Spielberger State-Trait Anxiety Inventory (STAI), and satisfaction levels were measured by a 5-point Likert-type scale."
        },
        {
          "label": "RESULTS",
          "text": "There were no significant differences in demographic characteristics between groups. The postintervention STAI scores were significantly lower in the video group compared to the non-video group (32.70 ± 4.96 vs. 41.47 ± 8.57, p < 0.01). The odds of moderate to severe anxiety were significantly lower in the video group (OR 10.29, 95% CI 2.56-41.37). Patient satisfaction levels were similarly high in both groups (4.92 ± 0.27 vs. 4.85 ± 0.36, p = 0.42)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Incorporating an animated educational video into traditional counselling effectively reduced anxiety in pregnant women seeking outpatient medical abortion while maintaining high levels of satisfaction with the medical service provided."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40755262/",
      "pubDate": "2025 Aug 04",
      "doi": "10.1111/1471-0528.18321",
      "dateReceived": "2025-08-25T23:24:45.990Z",
      "isNew": false,
      "summary": "An animated educational video integrated into counseling for outpatient medical abortion successfully lowered anxiety in pregnant women without diminishing their satisfaction with the care."
    },
    {
      "id": "7ecd79218828",
      "title": "Ciprofloxacin versus Aminoglycoside-Ciprofloxacin for Bubonic Plague.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117291",
      "abstract": "Plague is a high-consequence infectious disease with epidemic potential. Current treatment guidelines are based on weak evidence. We enrolled persons (excluding pregnant persons) in Madagascar who had clinically suspected bubonic plague during 2020-2024. Using an open-label noninferiority design, we compared two treatments included in the national plague guidelines: oral ciprofloxacin for 10 days (ciprofloxacin monotherapy) or injectable aminoglycoside for 3 days followed by oral ciprofloxacin for 7 days (aminoglycoside-ciprofloxacin). The primary end point was treatment failure on day 11, with treatment failure defined as death, fever, secondary pneumonic plague, or alternative or prolonged plague treatment. To show noninferiority of ciprofloxacin monotherapy among patients with laboratory-confirmed or probable infections, the upper boundary of the 95% confidence interval around the risk difference had to be less than 15 percentage points. A total of 933 patients underwent screening; 450 patients with suspected bubonic plague were enrolled and underwent randomization. A total of 220 patients (110 per group) had confirmed infection, and 2 (1 per group) had probable infection. Of the patients who underwent randomization, 53.2% were male, and the median age was 14 years (range, 2 to 72). Ciprofloxacin monotherapy was noninferior to aminoglycoside-ciprofloxacin therapy: among the patients with confirmed or probable infection, treatment failure occurred in 9.0% (10 of 111 patients) in the ciprofloxacin monotherapy group and 8.1% (9 of 111 patients) in the aminoglycoside-ciprofloxacin group (difference, 0.9 percentage points; 95% confidence interval, -6.0 to 7.8). Noninferiority was consistent in other prespecified analysis populations. A total of 5 patients in the ciprofloxacin monotherapy group and 4 patients in the aminoglycoside-ciprofloxacin group died, and secondary pneumonic plague developed in 3 patients in each group. The incidence of adverse events among patients with confirmed or probable infections was similar in the two groups - 18.0% in the ciprofloxacin monotherapy group and 18.9% in the aminoglycoside-ciprofloxacin group had adverse events, and 7.2% and 5.4%, respectively, had serious adverse events. Oral ciprofloxacin monotherapy for 10 days was noninferior to an aminoglycoside-ciprofloxacin sequential combination for the treatment of patients with bubonic plague. (Funded by the U.K. Foreign, Commonwealth, and Development Office and Wellcome; IMASOY ClinicalTrials.gov number, NCT04110340.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Plague is a high-consequence infectious disease with epidemic potential. Current treatment guidelines are based on weak evidence."
        },
        {
          "label": "METHODS",
          "text": "We enrolled persons (excluding pregnant persons) in Madagascar who had clinically suspected bubonic plague during 2020-2024. Using an open-label noninferiority design, we compared two treatments included in the national plague guidelines: oral ciprofloxacin for 10 days (ciprofloxacin monotherapy) or injectable aminoglycoside for 3 days followed by oral ciprofloxacin for 7 days (aminoglycoside-ciprofloxacin). The primary end point was treatment failure on day 11, with treatment failure defined as death, fever, secondary pneumonic plague, or alternative or prolonged plague treatment. To show noninferiority of ciprofloxacin monotherapy among patients with laboratory-confirmed or probable infections, the upper boundary of the 95% confidence interval around the risk difference had to be less than 15 percentage points."
        },
        {
          "label": "RESULTS",
          "text": "A total of 933 patients underwent screening; 450 patients with suspected bubonic plague were enrolled and underwent randomization. A total of 220 patients (110 per group) had confirmed infection, and 2 (1 per group) had probable infection. Of the patients who underwent randomization, 53.2% were male, and the median age was 14 years (range, 2 to 72). Ciprofloxacin monotherapy was noninferior to aminoglycoside-ciprofloxacin therapy: among the patients with confirmed or probable infection, treatment failure occurred in 9.0% (10 of 111 patients) in the ciprofloxacin monotherapy group and 8.1% (9 of 111 patients) in the aminoglycoside-ciprofloxacin group (difference, 0.9 percentage points; 95% confidence interval, -6.0 to 7.8). Noninferiority was consistent in other prespecified analysis populations. A total of 5 patients in the ciprofloxacin monotherapy group and 4 patients in the aminoglycoside-ciprofloxacin group died, and secondary pneumonic plague developed in 3 patients in each group. The incidence of adverse events among patients with confirmed or probable infections was similar in the two groups - 18.0% in the ciprofloxacin monotherapy group and 18.9% in the aminoglycoside-ciprofloxacin group had adverse events, and 7.2% and 5.4%, respectively, had serious adverse events."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Oral ciprofloxacin monotherapy for 10 days was noninferior to an aminoglycoside-ciprofloxacin sequential combination for the treatment of patients with bubonic plague. (Funded by the U.K. Foreign, Commonwealth, and Development Office and Wellcome; IMASOY ClinicalTrials.gov number, NCT04110340.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40768716/",
      "pubDate": "2025 Aug 07",
      "doi": "10.1056/NEJMoa2413772",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "Oral ciprofloxacin alone is as effective as a combination of aminoglycoside and ciprofloxacin for treating bubonic plague."
    },
    {
      "id": "fbc48a39864d",
      "title": "Alteplase for Acute Ischemic Stroke at 4.5 to 24 Hours: The HOPE Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117310",
      "abstract": "The safety and efficacy of intravenous thrombolytics beyond 4.5 hours after ischemic stroke onset remain inadequately studied. To evaluate the safety and efficacy of intravenous alteplase administered 4.5 to 24 hours after stroke onset in patients with salvageable brain tissue, regardless of the presence of large vessel occlusion. This randomized, open-label, blinded end-point trial was conducted at 26 stroke centers across China. A total of 372 patients with acute ischemic stroke and salvageable brain tissue identified by perfusion imaging were enrolled between June 21, 2021, and June 30, 2024 (final follow-up October 2, 2024). Eligibility criteria included stroke onset (or the midpoint between last known well and symptom recognition if onset was unknown) of 4.5 to 24 hours prior to presentation, and no initial plan for endovascular thrombectomy. Data were analyzed from December 2024 to February 2025. Patients were randomly assigned (1:1) using a minimization algorithm to receive intravenous alteplase (0.9 mg/kg; maximum dose, 90 mg; n = 186) or standard medical treatment (n = 186). The primary efficacy outcome was functional independence, defined as a modified Rankin Scale score of 0 to 1 at 90 days. Safety outcomes included symptomatic intracranial hemorrhage within 36 hours and all-cause mortality within 90 days. Among 372 patients who were enrolled (median [IQR] age, 72 [64-80] years; 160 [43%] women), all completed the trial. The primary outcome occurred in 75 of 186 patients (40%) in the alteplase group and 49 of 186 (26%) in the control group (adjusted risk ratio, 1.52 [95% CI, 1.14-2.02]; P = .004; unadjusted risk difference, 13.98% [95% CI, 4.50%-23.45%]). The incidence of symptomatic intracranial hemorrhage was higher with alteplase at 3.8% compared with 0.51% with standard treatment (adjusted risk ratio, 7.34 [95% CI, 1.54-34.84]; P = .01; unadjusted risk difference, 3.23% [0.28%-6.19%]), and mortality was 11% in both groups (adjusted risk ratio, 0.91 [95% CI, 0.52-1.62]; P = .76; unadjusted risk difference, 0% [95% CI, -6.30% to 6.30%]). In patients with acute ischemic stroke with salvageable brain tissue identified by perfusion imaging who did not initially receive thrombectomy, intravenous alteplase administered 4.5 to 24 hours after onset provided functional benefit, despite an increase in symptomatic intracranial hemorrhage. ClinicalTrials.gov Identifier: NCT04879615.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The safety and efficacy of intravenous thrombolytics beyond 4.5 hours after ischemic stroke onset remain inadequately studied."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the safety and efficacy of intravenous alteplase administered 4.5 to 24 hours after stroke onset in patients with salvageable brain tissue, regardless of the presence of large vessel occlusion."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized, open-label, blinded end-point trial was conducted at 26 stroke centers across China. A total of 372 patients with acute ischemic stroke and salvageable brain tissue identified by perfusion imaging were enrolled between June 21, 2021, and June 30, 2024 (final follow-up October 2, 2024). Eligibility criteria included stroke onset (or the midpoint between last known well and symptom recognition if onset was unknown) of 4.5 to 24 hours prior to presentation, and no initial plan for endovascular thrombectomy. Data were analyzed from December 2024 to February 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomly assigned (1:1) using a minimization algorithm to receive intravenous alteplase (0.9 mg/kg; maximum dose, 90 mg; n = 186) or standard medical treatment (n = 186)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcome was functional independence, defined as a modified Rankin Scale score of 0 to 1 at 90 days. Safety outcomes included symptomatic intracranial hemorrhage within 36 hours and all-cause mortality within 90 days."
        },
        {
          "label": "RESULTS",
          "text": "Among 372 patients who were enrolled (median [IQR] age, 72 [64-80] years; 160 [43%] women), all completed the trial. The primary outcome occurred in 75 of 186 patients (40%) in the alteplase group and 49 of 186 (26%) in the control group (adjusted risk ratio, 1.52 [95% CI, 1.14-2.02]; P = .004; unadjusted risk difference, 13.98% [95% CI, 4.50%-23.45%]). The incidence of symptomatic intracranial hemorrhage was higher with alteplase at 3.8% compared with 0.51% with standard treatment (adjusted risk ratio, 7.34 [95% CI, 1.54-34.84]; P = .01; unadjusted risk difference, 3.23% [0.28%-6.19%]), and mortality was 11% in both groups (adjusted risk ratio, 0.91 [95% CI, 0.52-1.62]; P = .76; unadjusted risk difference, 0% [95% CI, -6.30% to 6.30%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In patients with acute ischemic stroke with salvageable brain tissue identified by perfusion imaging who did not initially receive thrombectomy, intravenous alteplase administered 4.5 to 24 hours after onset provided functional benefit, despite an increase in symptomatic intracranial hemorrhage."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04879615."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40773205/",
      "pubDate": "2025 Aug 07",
      "doi": "10.1001/jama.2025.12063",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "In acute ischemic stroke patients with salvageable brain tissue, alteplase administered 4.5 to 24 hours after onset improved function, but increased the risk of bleeding in the brain."
    },
    {
      "id": "e2690345c954",
      "title": "Efficacy and Safety of Pharmacologic Therapies for Nausea and Emesis in the Emergency Department: A Systematic Review and Bayesian Network Meta-analysis.",
      "journal": "Ann Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117300",
      "abstract": "We conducted a systematic review and Bayesian network meta-analysis to identify the most effective and safest therapies for nausea/emesis in adult patients presenting to the emergency department (ED). We searched PubMed, Embase, Cumulated Index to Nursing and Allied Health Literature, and Web of Science from inception to November 22, 2023. Eligible studies were randomized controlled trials in adult participants presenting to ED with nausea or emesis and compared one pharmacologic therapy with another or placebo. Outcomes were as follows: (1) change in nausea intensity at 30 minutes, (2) need for rescue drug, and (3) significant adverse reaction. We extracted data according to Preferred Reporting Items for Systematic Reviews and Network Meta-Analysis and appraised studies using Cochrane RoB 2. We performed Bayesian network meta-analysis to calculate odds ratios with 95% credible intervals and frequentist network meta-analysis to calculate mean differences with 95% confidence intervals. We assessed confidence using Confidence in Network Meta-analysis. We ranked agents using surface under the cumulative ranking curve (SUCRA). Intravenous tropisetron (SUCRA=93.9%) is most likely superior for \"need for rescue drug\" (not needing rescue drug) (11 trials; n=1,465). Intravenous ondansetron (SUCRA=78.6%) is most likely superior for \"significant adverse reaction\" (not causing adverse reaction) (9 trials; n=1,267). The network for change in nausea intensity demonstrated statistically significant incoherence at the overall level. Within a minimally contextualized framework, as single agents, intravenous tropisetron and intravenous prochlorperazine are definitely among the most effective, intravenous metoclopramide and intravenous droperidol are possibly among the most effective, and oral ondansetron is definitely among the least effective; considering certain adverse reactions, intravenous metoclopramide, intravenous droperidol, and intravenous promethazine are definitely among the most harmful.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "We conducted a systematic review and Bayesian network meta-analysis to identify the most effective and safest therapies for nausea/emesis in adult patients presenting to the emergency department (ED)."
        },
        {
          "label": "METHODS",
          "text": "We searched PubMed, Embase, Cumulated Index to Nursing and Allied Health Literature, and Web of Science from inception to November 22, 2023. Eligible studies were randomized controlled trials in adult participants presenting to ED with nausea or emesis and compared one pharmacologic therapy with another or placebo. Outcomes were as follows: (1) change in nausea intensity at 30 minutes, (2) need for rescue drug, and (3) significant adverse reaction. We extracted data according to Preferred Reporting Items for Systematic Reviews and Network Meta-Analysis and appraised studies using Cochrane RoB 2. We performed Bayesian network meta-analysis to calculate odds ratios with 95% credible intervals and frequentist network meta-analysis to calculate mean differences with 95% confidence intervals. We assessed confidence using Confidence in Network Meta-analysis. We ranked agents using surface under the cumulative ranking curve (SUCRA)."
        },
        {
          "label": "RESULTS",
          "text": "Intravenous tropisetron (SUCRA=93.9%) is most likely superior for \"need for rescue drug\" (not needing rescue drug) (11 trials; n=1,465). Intravenous ondansetron (SUCRA=78.6%) is most likely superior for \"significant adverse reaction\" (not causing adverse reaction) (9 trials; n=1,267). The network for change in nausea intensity demonstrated statistically significant incoherence at the overall level."
        },
        {
          "label": "CONCLUSION",
          "text": "Within a minimally contextualized framework, as single agents, intravenous tropisetron and intravenous prochlorperazine are definitely among the most effective, intravenous metoclopramide and intravenous droperidol are possibly among the most effective, and oral ondansetron is definitely among the least effective; considering certain adverse reactions, intravenous metoclopramide, intravenous droperidol, and intravenous promethazine are definitely among the most harmful."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40772912/",
      "pubDate": "2025 Aug 06",
      "doi": "10.1016/j.annemergmed.2025.06.009",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "For single-agent antiemetics, intravenous tropisetron and prochlorperazine are highly effective, metoclopramide and droperidol are potentially effective, oral ondansetron is least effective, and metoclopramide, droperidol, and promethazine are the most likely to cause harm."
    },
    {
      "id": "330ab3cabda8",
      "title": "Aspirin, cardiovascular events, and major bleeding in older adults: extended follow-up of the ASPREE trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117383",
      "abstract": "Guidelines recommend against routine initiation of low-dose aspirin in older adults for primary prevention of atherosclerotic cardiovascular disease events. This study aimed to estimate long-term and post-trial effects of aspirin on major adverse cardiovascular events (MACE) and major haemorrhage using extended follow-up of participants from the ASPREE trial. In-trial (2010-17) and post-trial (2017-22) data were analysed. At enrolment, participants were aged ≥70 years (≥65 years for US minorities) without prior cardiovascular events, dementia, or independence-limiting physical disability. Randomization was to daily low-dose aspirin or matching placebo for the 4.7 years of the trial. Of the 19 114 participants randomized (9525 aspirin, 9589 placebo), 15 668 without in-trial MACE consented to post-trial follow-up. No long-term benefit of randomization to aspirin was observed for MACE for the entire in-trial and post-trial period [hazard ratio (HR) 1.04, 95% confidence interval (CI) .94, 1.15]. However, during the post-trial period (median 4.3 years), there was a higher rate of MACE (HR 1.17, 95% CI 1.01, 1.36) in those randomized to aspirin compared with placebo. Over the entire period, a higher rate of major haemorrhage was observed in the randomized aspirin group compared with placebo (HR 1.24, 95% CI 1.10, 1.39). The present study provides novel evidence concerning long-term MACE and haemorrhage following aspirin use in initially healthy older adults. The finding of no long-term MACE benefit needs to be considered in clinical decision-making if aspirin is being considered for use in this context.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Guidelines recommend against routine initiation of low-dose aspirin in older adults for primary prevention of atherosclerotic cardiovascular disease events. This study aimed to estimate long-term and post-trial effects of aspirin on major adverse cardiovascular events (MACE) and major haemorrhage using extended follow-up of participants from the ASPREE trial."
        },
        {
          "label": "METHODS",
          "text": "In-trial (2010-17) and post-trial (2017-22) data were analysed. At enrolment, participants were aged ≥70 years (≥65 years for US minorities) without prior cardiovascular events, dementia, or independence-limiting physical disability. Randomization was to daily low-dose aspirin or matching placebo for the 4.7 years of the trial."
        },
        {
          "label": "RESULTS",
          "text": "Of the 19 114 participants randomized (9525 aspirin, 9589 placebo), 15 668 without in-trial MACE consented to post-trial follow-up. No long-term benefit of randomization to aspirin was observed for MACE for the entire in-trial and post-trial period [hazard ratio (HR) 1.04, 95% confidence interval (CI) .94, 1.15]. However, during the post-trial period (median 4.3 years), there was a higher rate of MACE (HR 1.17, 95% CI 1.01, 1.36) in those randomized to aspirin compared with placebo. Over the entire period, a higher rate of major haemorrhage was observed in the randomized aspirin group compared with placebo (HR 1.24, 95% CI 1.10, 1.39)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The present study provides novel evidence concerning long-term MACE and haemorrhage following aspirin use in initially healthy older adults. The finding of no long-term MACE benefit needs to be considered in clinical decision-making if aspirin is being considered for use in this context."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40796244/",
      "pubDate": "2025 Aug 12",
      "doi": "10.1093/eurheartj/ehaf514",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "Aspirin use in healthy older adults does not provide long-term benefit in preventing major adverse cardiovascular events (MACE)."
    },
    {
      "id": "76cc774ae6e4",
      "title": "Glucagon-like peptide 1 receptor agonists and risk of venous thromboembolism: a systematic review and meta-analysis of randomized controlled trials.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117358",
      "abstract": "Obesity is an established risk factor for venous thromboembolism (VTE). Observational data suggest that glucagon-like peptide 1 receptor agonists (GLP-1RAs) may reduce the risk of VTE. However, the effects of GLP-1RAs on VTE have not been tested in randomized controlled trials (RCTs). To investigate the impact of GLP-1RAs on VTE risk using data from RCTs. We conducted a systematic review and meta-analysis of placebo-controlled RCTs focusing on GLP-1RA use in patients with type 2 diabetes mellitus (T2DM) or obesity. Five databases were searched from inception to October 2024. The primary outcome was VTE, which was a composite of pulmonary embolism (PE), deep vein thrombosis, and VTE at other sites, and the secondary outcomes were the individual events. Twenty-seven RCTs with 84 003 patients were analyzed. The median incidence of VTE was 1.1 and 2.5 per 1000 patient-years in the GLP-1RA and placebo groups, respectively. There was no statistically significant difference in overall VTE risk between GLP-1RA and placebo groups (risk ratio [RR], 0.70; 95% CI, 0.46-1.07). However, GLP-1RAs were associated with a significantly lower risk of PE (RR, 0.60; 95% CI, 0.39-0.94). In contrast, there were no significant differences in the risk of deep vein thrombosis (RR, 1.21; 95% CI, 0.69-2.12) or VTE at other sites (RR, 0.56; 95% CI, 0.25-1.26). In this meta-analysis of randomized trials, GLP-1RAs were not associated with a significant reduction in overall VTE risk but were associated with a lower risk of PE among patients with T2DM or obesity.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Obesity is an established risk factor for venous thromboembolism (VTE). Observational data suggest that glucagon-like peptide 1 receptor agonists (GLP-1RAs) may reduce the risk of VTE. However, the effects of GLP-1RAs on VTE have not been tested in randomized controlled trials (RCTs)."
        },
        {
          "label": "OBJECTIVES",
          "text": "To investigate the impact of GLP-1RAs on VTE risk using data from RCTs."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review and meta-analysis of placebo-controlled RCTs focusing on GLP-1RA use in patients with type 2 diabetes mellitus (T2DM) or obesity. Five databases were searched from inception to October 2024. The primary outcome was VTE, which was a composite of pulmonary embolism (PE), deep vein thrombosis, and VTE at other sites, and the secondary outcomes were the individual events."
        },
        {
          "label": "RESULTS",
          "text": "Twenty-seven RCTs with 84 003 patients were analyzed. The median incidence of VTE was 1.1 and 2.5 per 1000 patient-years in the GLP-1RA and placebo groups, respectively. There was no statistically significant difference in overall VTE risk between GLP-1RA and placebo groups (risk ratio [RR], 0.70; 95% CI, 0.46-1.07). However, GLP-1RAs were associated with a significantly lower risk of PE (RR, 0.60; 95% CI, 0.39-0.94). In contrast, there were no significant differences in the risk of deep vein thrombosis (RR, 1.21; 95% CI, 0.69-2.12) or VTE at other sites (RR, 0.56; 95% CI, 0.25-1.26)."
        },
        {
          "label": "CONCLUSION",
          "text": "In this meta-analysis of randomized trials, GLP-1RAs were not associated with a significant reduction in overall VTE risk but were associated with a lower risk of PE among patients with T2DM or obesity."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40602613/",
      "pubDate": "2025 Jun 30",
      "doi": "10.1016/j.jtha.2025.06.020",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "GLP-1RAs did not significantly reduce overall VTE risk but were associated with a lower risk of pulmonary embolism in patients with type 2 diabetes or obesity."
    },
    {
      "id": "3c9c278f2a29",
      "title": "Effects of Prophylactic Oxytocin or Carbetocin on Troponin Release and Postpartum Haemorrhage at PlannedCaesarean Delivery: A Double-Blind Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117409",
      "abstract": "Oxytocin may cause dose-dependent myocardial side effects. We investigated if carbetocin, a long-acting oxytocin analogue, causes similar changes. Double-blind randomised trial. University Hospitals, Oslo, Norway. 240 singleton pregnant women, 18-50 years, undergoing planned caesarean delivery. Participants, randomised 1:1, received oxytocin 2.5 IU or carbetocin 100 μg intravenously immediately after delivery. The primary endpoint was change from baseline in cardiac troponin I (cTnI) serum concentration at 6-10 h postpartum. Secondary endpoints included blood loss, uterine tone (numerical rating scale 0-10), rescue treatment, and healthcare costs 48 h postpartum. 215 patients underwent a planned caesarean delivery and received their allocated study drug (oxytocin group, n = 112; carbetocin group, n = 103). We detected no difference in median change from baseline cTnI concentration at 6-10 h postpartum (0.0 [95% CI -1.09 to 1.09] ng/L; p = 1.00). Median (interquartile range [IQR]) estimated blood loss was similar: oxytocin, 395 (96 to 627) mL; carbetocin, 335 (127 to 570) mL (group difference: -41 mL [95% CI -158 to 76]; p = 0.49). Rescue treatment utilisation was higher with oxytocin (46.4%) versus carbetocin (27.2%); risk difference. (-19.2% [95% CI -31.2 to -6.3]; p = 0.004). Median (IQR) uterine tone at 5 min after delivery was lower with oxytocin (7 [6 to 8]) versus carbetocin (8 [7 to 9]; group difference 1.0 NRS [95% CI 1.0 to 1.0]; p < 0.001). Despite carbetocin costing 10 times more than oxytocin, mean total healthcare costs were similar, adjusted group difference 31 NOK ($3 USD; €3; [95% CI -361 to 298 NOK]; p = 0.85). Ischaemic myocardial risk and healthcare costs were comparable for both drugs. Patients receiving carbetocin maintained better uterine tone and required fewer rescue treatments. EudraCT: 2014-000507-27; ClinicalTrials.gov Identifier: NCT03899961 (02/04/2019).",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Oxytocin may cause dose-dependent myocardial side effects. We investigated if carbetocin, a long-acting oxytocin analogue, causes similar changes."
        },
        {
          "label": "DESIGN",
          "text": "Double-blind randomised trial."
        },
        {
          "label": "SETTING",
          "text": "University Hospitals, Oslo, Norway."
        },
        {
          "label": "POPULATION",
          "text": "240 singleton pregnant women, 18-50 years, undergoing planned caesarean delivery."
        },
        {
          "label": "METHODS",
          "text": "Participants, randomised 1:1, received oxytocin 2.5 IU or carbetocin 100 μg intravenously immediately after delivery."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary endpoint was change from baseline in cardiac troponin I (cTnI) serum concentration at 6-10 h postpartum. Secondary endpoints included blood loss, uterine tone (numerical rating scale 0-10), rescue treatment, and healthcare costs 48 h postpartum."
        },
        {
          "label": "RESULTS",
          "text": "215 patients underwent a planned caesarean delivery and received their allocated study drug (oxytocin group, n = 112; carbetocin group, n = 103). We detected no difference in median change from baseline cTnI concentration at 6-10 h postpartum (0.0 [95% CI -1.09 to 1.09] ng/L; p = 1.00). Median (interquartile range [IQR]) estimated blood loss was similar: oxytocin, 395 (96 to 627) mL; carbetocin, 335 (127 to 570) mL (group difference: -41 mL [95% CI -158 to 76]; p = 0.49). Rescue treatment utilisation was higher with oxytocin (46.4%) versus carbetocin (27.2%); risk difference. (-19.2% [95% CI -31.2 to -6.3]; p = 0.004). Median (IQR) uterine tone at 5 min after delivery was lower with oxytocin (7 [6 to 8]) versus carbetocin (8 [7 to 9]; group difference 1.0 NRS [95% CI 1.0 to 1.0]; p < 0.001). Despite carbetocin costing 10 times more than oxytocin, mean total healthcare costs were similar, adjusted group difference 31 NOK ($3 USD; €3; [95% CI -361 to 298 NOK]; p = 0.85)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ischaemic myocardial risk and healthcare costs were comparable for both drugs. Patients receiving carbetocin maintained better uterine tone and required fewer rescue treatments."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "EudraCT: 2014-000507-27; ClinicalTrials.gov Identifier: NCT03899961 (02/04/2019)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40772429/",
      "pubDate": "2025 Aug 07",
      "doi": "10.1111/1471-0528.18312",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "Carbetocin and oxytocin have similar effects on ischemic myocardial risk and healthcare costs, but carbetocin is associated with better uterine tone and fewer rescue treatments."
    },
    {
      "id": "eb8ff994ad22",
      "title": "Stapokibart for Severe Uncontrolled Chronic Rhinosinusitis With Nasal Polyps: The CROWNS-2 Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117411",
      "abstract": "Chronic rhinosinusitis with nasal polyps causes severe symptoms and impaired quality of life. Stapokibart is a novel monoclonal antibody that targets interleukin 4Rα. To assess the efficacy and safety of stapokibart as an add-on treatment to intranasal corticosteroids in patients with severe uncontrolled chronic rhinosinusitis with nasal polyps. From August 9, 2022, to April 28, 2023, this randomized, double-blind, phase 3 clinical trial, conducted at 51 hospitals in China, enrolled adult patients with chronic rhinosinusitis with nasal polyps who had a history of systemic corticosteroid use or sinonasal surgery and a bilateral nasal polyp score of 5 or greater (on a scale of 0-8) and a weekly mean nasal congestion score of 2 or greater (on a scale of 0-3). Eosinophilic chronic rhinosinusitis with nasal polyps was defined as blood eosinophils of 6.9% or greater (without asthma) or 3.7% or greater (with asthma) or an eosinophil count of 55 per high-power field or greater or 27% or greater in nasal polyp tissue. Patient follow-up was completed on June 25, 2024. Four weeks after initiation of mometasone furoate nasal spray, 100 µg in each nostril daily, patients were randomized to receive subcutaneous stapokibart, 300 mg, or placebo (1:1) every 2 weeks for 24 weeks. Both groups then received stapokibart for 28 weeks. Co-primary end points were changes from baseline in nasal polyp score (meaningful change threshold [MCT] ≥1 point) and nasal congestion score (MCT ≥0.5 points) at week 24 in all patients and in the population with eosinophilia. Among 180 patients randomized, 179 (mean age, 45 [SD, 12.9] years; 61 [34.1%] women) received at least 1 treatment dose (n = 90 for stapokibart; n = 89 for placebo). In the overall population, the least-squares (LS) mean change in nasal polyp score from baseline to week 24 in the stapokibart vs placebo groups was -2.6 vs -0.3 points, respectively, (LS mean difference, -2.3; 95% CI, -2.6 to -1.9; P < .001); in the population with eosinophilia, the change was -3.0 vs -0.4 points, respectively (LS mean difference, -2.5; 95% CI, -2.9 to -2.1; P < .001). The LS mean change in nasal congestion score from baseline to week 24 in the stapokibart vs placebo groups was -1.2 vs -0.5 points, respectively, in the overall population (LS mean difference, -0.7; 95% CI, -0.9 to -0.5; P < .001) and -1.3 vs -0.5 points, respectively, in the population with eosinophilia (LS mean difference, -0.8; 95% CI, -1.0 to -0.6; P < .001). Serious adverse events were rare (2.2% in the stapokibart group vs 1.1% in the placebo group). Higher rates of arthralgia (7.8% vs 0%) and hyperuricemia (5.6% vs 1.1%) were reported with stapokibart vs placebo, respectively. Among patients with severe chronic rhinosinusitis with nasal polyps treated with a daily intranasal corticosteroid, stapokibart reduced polyp size and severity of nasal symptoms at 24 weeks. ClinicalTrials.gov Identifier: NCT05436275.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Chronic rhinosinusitis with nasal polyps causes severe symptoms and impaired quality of life. Stapokibart is a novel monoclonal antibody that targets interleukin 4Rα."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of stapokibart as an add-on treatment to intranasal corticosteroids in patients with severe uncontrolled chronic rhinosinusitis with nasal polyps."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "From August 9, 2022, to April 28, 2023, this randomized, double-blind, phase 3 clinical trial, conducted at 51 hospitals in China, enrolled adult patients with chronic rhinosinusitis with nasal polyps who had a history of systemic corticosteroid use or sinonasal surgery and a bilateral nasal polyp score of 5 or greater (on a scale of 0-8) and a weekly mean nasal congestion score of 2 or greater (on a scale of 0-3). Eosinophilic chronic rhinosinusitis with nasal polyps was defined as blood eosinophils of 6.9% or greater (without asthma) or 3.7% or greater (with asthma) or an eosinophil count of 55 per high-power field or greater or 27% or greater in nasal polyp tissue. Patient follow-up was completed on June 25, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Four weeks after initiation of mometasone furoate nasal spray, 100 µg in each nostril daily, patients were randomized to receive subcutaneous stapokibart, 300 mg, or placebo (1:1) every 2 weeks for 24 weeks. Both groups then received stapokibart for 28 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Co-primary end points were changes from baseline in nasal polyp score (meaningful change threshold [MCT] ≥1 point) and nasal congestion score (MCT ≥0.5 points) at week 24 in all patients and in the population with eosinophilia."
        },
        {
          "label": "RESULTS",
          "text": "Among 180 patients randomized, 179 (mean age, 45 [SD, 12.9] years; 61 [34.1%] women) received at least 1 treatment dose (n = 90 for stapokibart; n = 89 for placebo). In the overall population, the least-squares (LS) mean change in nasal polyp score from baseline to week 24 in the stapokibart vs placebo groups was -2.6 vs -0.3 points, respectively, (LS mean difference, -2.3; 95% CI, -2.6 to -1.9; P < .001); in the population with eosinophilia, the change was -3.0 vs -0.4 points, respectively (LS mean difference, -2.5; 95% CI, -2.9 to -2.1; P < .001). The LS mean change in nasal congestion score from baseline to week 24 in the stapokibart vs placebo groups was -1.2 vs -0.5 points, respectively, in the overall population (LS mean difference, -0.7; 95% CI, -0.9 to -0.5; P < .001) and -1.3 vs -0.5 points, respectively, in the population with eosinophilia (LS mean difference, -0.8; 95% CI, -1.0 to -0.6; P < .001). Serious adverse events were rare (2.2% in the stapokibart group vs 1.1% in the placebo group). Higher rates of arthralgia (7.8% vs 0%) and hyperuricemia (5.6% vs 1.1%) were reported with stapokibart vs placebo, respectively."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with severe chronic rhinosinusitis with nasal polyps treated with a daily intranasal corticosteroid, stapokibart reduced polyp size and severity of nasal symptoms at 24 weeks."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05436275."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40824573/",
      "pubDate": "2025 Aug 18",
      "doi": "10.1001/jama.2025.12515",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "Stapokibart, a medication, decreased nasal polyp size and improved nasal symptoms in patients with severe chronic rhinosinusitis with nasal polyps after 24 weeks of treatment."
    },
    {
      "id": "309dcabf85cc",
      "title": "Guided Internet-Based Cognitive Behavior Therapy for Women With Bulimia Nervosa: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47868474/117380",
      "abstract": "Despite the rising prevalence of bulimia nervosa and the associated risks of chronicity and severe physical and psychological morbidity, access to effective treatment remains poor. The effectiveness and acceptability of internet-based cognitive behavior therapy (ICBT) for women with bulimia nervosa in clinical settings in East Asia remain unclear. To determine the effectiveness and acceptability of a guided ICBT program to treat women with bulimia nervosa in Japan. This randomized clinical trial was conducted at 7 university hospitals in Japan between August 2022 and October 2024. This study enrolled female participants aged 13 to 65 years whose symptoms met the Diagnostic and Statistical Manual of Mental Disorders (Fifth Edition) criteria for bulimia nervosa, had a body mass index (BMI) of 17.5 or greater, had internet access, and had no history of practicing CBT-related techniques within the past 2 years. Both the control and intervention groups received usual care. The intervention consisted of ICBT with additional guidance from a therapist. The therapy program was tailored to Japanese culture and grounded in a specific cognitive behavior model, and it was performed over a 12-week period. Severity of bulimia nervosa, measured by the weekly combined frequency of episodes involving binge eating and compensatory behaviors, was assessed by a blinded, independent rating team at baseline and at the 12-week intervention end point. Intention-to-treat analyses were conducted using a linear mixed model with effect sizes calculated using Cohen d. A total of 61 women met the eligibility criteria and were randomized to the intervention group (n = 31) or the control group (n = 30). Participants were predominantly young (mean [SD] age, 27.8 [9.0] years), had normal weight (mean [SD] BMI, 21.1 [3.6]), and had a mean (SD) duration of illness of 9.3 (8.8) years; half (31 [50.8%]) were employed. Intent-to-treat analysis revealed that guided ICBT significantly reduced the weekly combined frequency of episodes involving binge eating and compensatory behaviors (by an adjusted mean difference of 9.84 episodes [95% CI, 2.49-17.18 episodes], P = .01; Cohen d = 0.73 [95% CI, 0.21-1.26]). Sensitivity analyses supported these findings. In this randomized clinical trial, the intervention group experienced a significant decrease in bulimia symptoms compared with the control group, supporting the effectiveness and acceptability of the therapist-guided ICBT program. These findings suggest that integration of therapist-guided ICBT in usual care has the potential to improve accessibility to efficacious treatment options for women with bulimia nervosa. UMIN Clinical Trials Registry Identifier: UMIN00048732.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Despite the rising prevalence of bulimia nervosa and the associated risks of chronicity and severe physical and psychological morbidity, access to effective treatment remains poor. The effectiveness and acceptability of internet-based cognitive behavior therapy (ICBT) for women with bulimia nervosa in clinical settings in East Asia remain unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the effectiveness and acceptability of a guided ICBT program to treat women with bulimia nervosa in Japan."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was conducted at 7 university hospitals in Japan between August 2022 and October 2024. This study enrolled female participants aged 13 to 65 years whose symptoms met the Diagnostic and Statistical Manual of Mental Disorders (Fifth Edition) criteria for bulimia nervosa, had a body mass index (BMI) of 17.5 or greater, had internet access, and had no history of practicing CBT-related techniques within the past 2 years."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Both the control and intervention groups received usual care. The intervention consisted of ICBT with additional guidance from a therapist. The therapy program was tailored to Japanese culture and grounded in a specific cognitive behavior model, and it was performed over a 12-week period."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Severity of bulimia nervosa, measured by the weekly combined frequency of episodes involving binge eating and compensatory behaviors, was assessed by a blinded, independent rating team at baseline and at the 12-week intervention end point. Intention-to-treat analyses were conducted using a linear mixed model with effect sizes calculated using Cohen d."
        },
        {
          "label": "RESULTS",
          "text": "A total of 61 women met the eligibility criteria and were randomized to the intervention group (n = 31) or the control group (n = 30). Participants were predominantly young (mean [SD] age, 27.8 [9.0] years), had normal weight (mean [SD] BMI, 21.1 [3.6]), and had a mean (SD) duration of illness of 9.3 (8.8) years; half (31 [50.8%]) were employed. Intent-to-treat analysis revealed that guided ICBT significantly reduced the weekly combined frequency of episodes involving binge eating and compensatory behaviors (by an adjusted mean difference of 9.84 episodes [95% CI, 2.49-17.18 episodes], P = .01; Cohen d = 0.73 [95% CI, 0.21-1.26]). Sensitivity analyses supported these findings."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, the intervention group experienced a significant decrease in bulimia symptoms compared with the control group, supporting the effectiveness and acceptability of the therapist-guided ICBT program. These findings suggest that integration of therapist-guided ICBT in usual care has the potential to improve accessibility to efficacious treatment options for women with bulimia nervosa."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "UMIN Clinical Trials Registry Identifier: UMIN00048732."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40762916/",
      "pubDate": "2025 Aug 01",
      "doi": "10.1001/jamanetworkopen.2025.25165",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "Therapist-guided ICBT significantly reduced bulimia symptoms, indicating its effectiveness and potential to improve treatment accessibility."
    },
    {
      "id": "cf3fff3e83a5",
      "title": "Comparative analysis on renal and cardiovascular outcomes of antidiabetic treatment in chronic kidney disease patients-A systematic review and network meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47868474/117353",
      "abstract": "Type 2 diabetes mellitus (T2DM) with chronic kidney disease (CKD) is a common complication that increases the risk of cardiovascular (CV) events and kidney failure. Recent therapies, including sodium-glucose cotransporter-2 (SGLT2) inhibitors, glucagon-like peptide-1 receptor agonists (GLP-1 RA) and dipeptidyl peptidase IV (DPP-4) inhibitors, show promise in improving outcomes. However, evidence of their comparative effectiveness in reducing CV and renal outcomes is scarce. We searched electronic databases such as PubMed, Scopus, and clinical trial registries for randomized controlled trials (RCTs) published between 2014 and 2024. A network meta-analysis (NMA) was employed to evaluate the effectiveness of antidiabetic drugs on cardiorenal outcomes. Primary outcomes were (1) major adverse CV events (MACE), (2) composite renal outcomes, (3) all-cause mortality. Other outcomes included heart failure (HF), stroke, macroalbuminuria, and a decline in estimated glomerular filtration rate (eGFR) >40% or renal replacement therapy. Twenty-six studies with 143 296 participants with T2DM and CKD were included. SGLT2 inhibitors were highly effective in reducing the risk of renal outcomes such as composite events (P-score: 0.94), eGFR decline >40% or renal replacement therapy (0.99) and CV outcomes such as MACE (0.93) and HF (1.00) followed by GLP-1 RA. While GLP-1 RA was particularly effective in reducing the risk of MI (0.87), macroalbuminuria (0.86) and stroke (0.83) compared to SGLT2 inhibitors. Both SGLT2 inhibitors and GLP-1 receptor agonists are highly effective (0.83) in reducing all-cause mortality. DPP-4 inhibitors had limited benefits compared to SGLT2 inhibitors and GLP-1 RA. SGLT2 inhibitors followed by GLP-1 RA provide strong benefits for CV and kidney health in patients with T2DM and CKD. SGLT2 inhibitors demonstrate superior benefit over GLP-1 receptor agonists for HF and renal outcomes, highlighting their preferred role in these clinical scenarios.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Type 2 diabetes mellitus (T2DM) with chronic kidney disease (CKD) is a common complication that increases the risk of cardiovascular (CV) events and kidney failure. Recent therapies, including sodium-glucose cotransporter-2 (SGLT2) inhibitors, glucagon-like peptide-1 receptor agonists (GLP-1 RA) and dipeptidyl peptidase IV (DPP-4) inhibitors, show promise in improving outcomes. However, evidence of their comparative effectiveness in reducing CV and renal outcomes is scarce."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We searched electronic databases such as PubMed, Scopus, and clinical trial registries for randomized controlled trials (RCTs) published between 2014 and 2024. A network meta-analysis (NMA) was employed to evaluate the effectiveness of antidiabetic drugs on cardiorenal outcomes. Primary outcomes were (1) major adverse CV events (MACE), (2) composite renal outcomes, (3) all-cause mortality. Other outcomes included heart failure (HF), stroke, macroalbuminuria, and a decline in estimated glomerular filtration rate (eGFR) >40% or renal replacement therapy."
        },
        {
          "label": "RESULTS",
          "text": "Twenty-six studies with 143 296 participants with T2DM and CKD were included. SGLT2 inhibitors were highly effective in reducing the risk of renal outcomes such as composite events (P-score: 0.94), eGFR decline >40% or renal replacement therapy (0.99) and CV outcomes such as MACE (0.93) and HF (1.00) followed by GLP-1 RA. While GLP-1 RA was particularly effective in reducing the risk of MI (0.87), macroalbuminuria (0.86) and stroke (0.83) compared to SGLT2 inhibitors. Both SGLT2 inhibitors and GLP-1 receptor agonists are highly effective (0.83) in reducing all-cause mortality. DPP-4 inhibitors had limited benefits compared to SGLT2 inhibitors and GLP-1 RA."
        },
        {
          "label": "CONCLUSION",
          "text": "SGLT2 inhibitors followed by GLP-1 RA provide strong benefits for CV and kidney health in patients with T2DM and CKD. SGLT2 inhibitors demonstrate superior benefit over GLP-1 receptor agonists for HF and renal outcomes, highlighting their preferred role in these clinical scenarios."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40798873/",
      "pubDate": "2025 Aug 12",
      "doi": "10.1111/dom.70010",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "SGLT2 inhibitors are superior to GLP-1 receptor agonists for heart failure and kidney outcomes in patients with type 2 diabetes and chronic kidney disease."
    },
    {
      "id": "bb417520d8e9",
      "title": "Diagnosis accuracy of touchscreen-based testings for major neurocognitive disorders: a systematic review and meta-analysis.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47868474/117349",
      "abstract": "Facing an increasing prevalence, diagnosis and management of dementia has become a global health challenge. While most cognitive assessments are based on paper tests, the current trend is to digitise them, using new technologies. We aimed to achieve a systematic review on touchscreen-based assessments for neurocognitive disorders. A search on four databases (PubMed, Embase, IEEE Xplore and Web of Science) was performed. Two investigators independently selected the articles and assessed their quality using the QUADAS-2 tool. We included articles whose participants were over 65 years, classified according to the presence/absence of major neurocognitive disorder (M-NCD) determined by conventional assessment of cognition, examined with a novel tool using a touchscreen device (tablet or smartphone). We finally retained 35 articles for the systematic review and 24 for the meta-analysis. Of the 35 articles included in the systematic review, participants had Alzheimer's disease, Parkinson's disease, vascular dementia, Lewy body disease or any type of dementia. Pooled sensitivity and specificity were 0.89 (95% CI: 0.86-0.91) and 0.88 (95% CI: 0.82-0.92), respectively. Performances of self-administered or brief assessment testings were similar to those of assessor-administered or longer duration testings. The major limitation of this review and meta-analysis is the multiplicity and diversity of methods (tools, cognition assessment and type of M-NCD), which make the comparison difficult. We conclude that brief and self-assessment touchscreen-based cognitive tests are appropriate and simple tools to screen major cognitive disorders that can be used in primary care. The study was registered in Prospero (CRD42022358725).",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40742248/",
      "pubDate": "2025 Jul 01",
      "doi": "10.1093/ageing/afaf204",
      "dateReceived": "2025-08-24T12:41:00.507Z",
      "isNew": false,
      "summary": "Touchscreen-based cognitive tests show promise as simple and effective tools for screening major cognitive disorders, particularly in primary care settings."
    },
    {
      "id": "5e1f9a328972",
      "title": "Diabetic Microvascular Disease and Risk of Peripheral Artery Disease, Foot Ulcer, Leg Infection, and Amputation.",
      "journal": "Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47889217/117397",
      "abstract": "Patients with diabetes are at risk for developing peripheral artery disease, foot ulcer, and amputation. We conducted this study to compare the risk of peripheral artery disease, foot ulcer, and amputation between patients with type 2 diabetes with and without microvascular disease.We identified 1,013,154 patients aged 18 to 80 years and newly diagnosed with type 2 diabetes between January 1, 2008, and December 31, 2018, as the study participants. Cox proportional hazard models were used to compare the risk of diabetic foot disease between patients with and without diabetic kidney disease, diabetic retinopathy, and diabetic neuropathy.Patients with more types of microvascular disease were associated with a further increased risk of peripheral artery disease, foot ulcer, leg infection, and amputation compared to those without microvascular disease (p for trend <0.001). Patients with diabetic retinopathy were associated with a significantly increased risk of peripheral artery disease (aHR [95% CI] 1.12 [1.08, 1.16]), foot ulcer (1.50 [1.28, 1.75]), and amputation (2.53 [1.59, 4.01]) compared to those without microvascular disease. Individuals with diabetic neuropathy had a significantly higher risk of peripheral artery disease (1.27 [1.24, 1.29]), foot ulcer (1.27 [1.16, 1.40]), and leg infection (1.16 [1.12, 1.21]) compared to those without microvascular disease.This nationwide cohort study showed that patients with type 2 diabetes and microvascular disease were associated with a higher risk of peripheral artery disease, foot ulcer, leg infection, and amputation than those without microvascular disease.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40763784/",
      "pubDate": "2025 Aug 05",
      "doi": "10.1055/a-2661-2537",
      "dateReceived": "2025-08-24T12:41:00.506Z",
      "isNew": false,
      "summary": "Type 2 diabetes patients with microvascular disease face a significantly elevated risk of peripheral artery disease, foot ulcers, leg infections, and amputation compared to those without microvascular complications."
    }
  ]
}