{
  "updated_at": "2025-12-01T23:27:21.371Z",
  "articles": [
    {
      "id": "63bc3ea45353",
      "title": "Use of inhaled/nebulised ipratropium bromide in addition to standard first-line treatment with inhaled/nebulised short-acting beta 2-agonist and systemic steroid in the management of acute asthma exacerbations: a systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Arch Dis Child",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118167",
      "abstract": "The role of inhaled/nebulised ipratropium bromide (IB) in asthma is unclear. To assess the efficacy and safety of inhaled/nebulised IB for asthma management in children. We searched MEDLINE, EMBASE, CINAHL, the Cochrane Central Register of Controlled Trials and the Web of Science until July 2024. We included randomised controlled trials (RCTs) and followed international guidelines for reporting systematic reviews. Outcomes included morbidity, escalation of care, length of hospital stay, mortality, adverse events and lung function. We included 24 studies (total participants n=3238). The hospitalisation rate (risk ratio (RR) 0.84, 95% CI 0.70 to 1.00, I 30%), hospital stay in hours (MD 1.75, 95% CI -0.87 to 4.36, I 15%) and paediatric intensive care (PICU) admission (RR 0.91, 95% CI 0.35 to 2.32, I 0%) were similar. The hospitalisation rate was lower in patients who received IB nebuliser (RR 0.76, 95% CI 0.64 to 0.90, I 0%).The asthma severity score was significantly better in the IB group (MD -0.38, 95% CI -0.63 to -0.12, I 59%). No serious adverse events were reported. This review found high-certainty evidence that the IB nebuliser leads to a lower hospitalisation rate. However, when inhaled/nebulised IBs were analysed together, the hospitalisation rate was similar, with moderate certainty evidence. IB improved asthma clinical scores, with low certainty evidence. No difference was reported in other prespecified outcomes.Considering the current evidence and safety profile, inhaled/nebulised IB needs to be considered as an additional treatment for acute asthma exacerbation. CRD42023405023.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The role of inhaled/nebulised ipratropium bromide (IB) in asthma is unclear."
        },
        {
          "label": "AIMS",
          "text": "To assess the efficacy and safety of inhaled/nebulised IB for asthma management in children."
        },
        {
          "label": "METHODS",
          "text": "We searched MEDLINE, EMBASE, CINAHL, the Cochrane Central Register of Controlled Trials and the Web of Science until July 2024. We included randomised controlled trials (RCTs) and followed international guidelines for reporting systematic reviews. Outcomes included morbidity, escalation of care, length of hospital stay, mortality, adverse events and lung function."
        },
        {
          "label": "RESULTS",
          "text": "We included 24 studies (total participants n=3238). The hospitalisation rate (risk ratio (RR) 0.84, 95% CI 0.70 to 1.00, I 30%), hospital stay in hours (MD 1.75, 95% CI -0.87 to 4.36, I 15%) and paediatric intensive care (PICU) admission (RR 0.91, 95% CI 0.35 to 2.32, I 0%) were similar. The hospitalisation rate was lower in patients who received IB nebuliser (RR 0.76, 95% CI 0.64 to 0.90, I 0%).The asthma severity score was significantly better in the IB group (MD -0.38, 95% CI -0.63 to -0.12, I 59%). No serious adverse events were reported."
        },
        {
          "label": "CONCLUSION",
          "text": "This review found high-certainty evidence that the IB nebuliser leads to a lower hospitalisation rate. However, when inhaled/nebulised IBs were analysed together, the hospitalisation rate was similar, with moderate certainty evidence. IB improved asthma clinical scores, with low certainty evidence. No difference was reported in other prespecified outcomes.Considering the current evidence and safety profile, inhaled/nebulised IB needs to be considered as an additional treatment for acute asthma exacerbation."
        },
        {
          "label": "PROSPERO REGISTRATION NUMBER",
          "text": "CRD42023405023."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41224524/",
      "pubDate": "2025 Nov 12",
      "doi": "10.1136/archdischild-2024-327898",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": true,
      "summary": "Nebulized inhaled beta-agonists (IB) reduce hospitalizations for acute asthma exacerbations, but when combined with other inhaled IBs, the effect on hospitalization is not significant."
    },
    {
      "id": "8cae940cceb0",
      "title": "Digital Detection of Dementia in Primary Care: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49062791/118160",
      "abstract": "Detection of Alzheimer disease and related dementias (ADRD) is a challenge in primary care settings. The Quick Dementia Rating System (QDRS) and the Passive Digital Marker (PDM) were developed as 2 scalable tools for early detection of ADRD. The QDRS is a patient-reported outcome measure, while the PDM is a machine learning algorithm that uses electronic health record (EHR) data. Both can be embedded in the EHR for ease of use. To evaluate the effect of the combined approach of QDRS plus PDM in improving the annual rate of new documented ADRD diagnoses in primary care practices. This randomized clinical trial was performed between July 2, 2022, and July 1, 2024. Nine federally qualified primary health care clinics in Indianapolis, Indiana, were randomized to usual care (no routine screening for ADRD), PDM only, or QDRS plus PDM. Participants were treated as per the randomization arm. Participants included adults 65 years and older, without a diagnosis of mild cognitive impairment, dementia, or severe mental illness. Data analysis was based on intention to treat and was performed between November 1, 2024, and August 20, 2025. Randomization of clinic to usual care, PDM only, or QDRS plus PDM. The primary outcome was 12-month cumulative incidence of ADRD diagnoses; the secondary outcome was any ADRD diagnostic workup, such as laboratory tests, neuropsychological testing, or brain imaging. The study included 5325 patients (mean [SD] age, 71.1 [5.9] years), 3312 (62.2%) of whom were female. Compared with the usual care clinics (12-month incidence, 213 of 1724 [12.4%]), the odds of an incident ADRD diagnosis were higher in the clinics randomized to QDRS plus PDM (12-month incidence, 355 of 2301 [15.4%]; adjusted odds ratio [AOR], 1.31; 95% CI, 1.05-1.64) but not the clinics randomized to PDM only (12-month incidence, 134 of 1300 [10.3%]; AOR, 0.84; 95% CI, 0.63-1.11]). Compared with the usual care clinics (12-month incidence, 500 of 1724 [29.0%]), the odds of ADRD diagnostic assessments were higher in the QDRS plus PDM clinics (12-month incidence, 844 of 2301 [36.7%]; AOR, 1.41; 95% CI, 1.12-1.77) but not the PDM clinics (12-month incidence, 362 of 1300 [27.8%]; AOR, 0.94; 95% CI, 0.72-1.22). This randomized clinical trial found that the combined approach was effective at scale for the early detection of ADRD in primary care settings. This is an important feature in busy primary care settings that can benefit both the health care system and patients. ClinicalTrials.gov Identifier: NCT05231954.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Detection of Alzheimer disease and related dementias (ADRD) is a challenge in primary care settings. The Quick Dementia Rating System (QDRS) and the Passive Digital Marker (PDM) were developed as 2 scalable tools for early detection of ADRD. The QDRS is a patient-reported outcome measure, while the PDM is a machine learning algorithm that uses electronic health record (EHR) data. Both can be embedded in the EHR for ease of use."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effect of the combined approach of QDRS plus PDM in improving the annual rate of new documented ADRD diagnoses in primary care practices."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was performed between July 2, 2022, and July 1, 2024. Nine federally qualified primary health care clinics in Indianapolis, Indiana, were randomized to usual care (no routine screening for ADRD), PDM only, or QDRS plus PDM. Participants were treated as per the randomization arm. Participants included adults 65 years and older, without a diagnosis of mild cognitive impairment, dementia, or severe mental illness. Data analysis was based on intention to treat and was performed between November 1, 2024, and August 20, 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Randomization of clinic to usual care, PDM only, or QDRS plus PDM."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was 12-month cumulative incidence of ADRD diagnoses; the secondary outcome was any ADRD diagnostic workup, such as laboratory tests, neuropsychological testing, or brain imaging."
        },
        {
          "label": "RESULTS",
          "text": "The study included 5325 patients (mean [SD] age, 71.1 [5.9] years), 3312 (62.2%) of whom were female. Compared with the usual care clinics (12-month incidence, 213 of 1724 [12.4%]), the odds of an incident ADRD diagnosis were higher in the clinics randomized to QDRS plus PDM (12-month incidence, 355 of 2301 [15.4%]; adjusted odds ratio [AOR], 1.31; 95% CI, 1.05-1.64) but not the clinics randomized to PDM only (12-month incidence, 134 of 1300 [10.3%]; AOR, 0.84; 95% CI, 0.63-1.11]). Compared with the usual care clinics (12-month incidence, 500 of 1724 [29.0%]), the odds of ADRD diagnostic assessments were higher in the QDRS plus PDM clinics (12-month incidence, 844 of 2301 [36.7%]; AOR, 1.41; 95% CI, 1.12-1.77) but not the PDM clinics (12-month incidence, 362 of 1300 [27.8%]; AOR, 0.94; 95% CI, 0.72-1.22)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial found that the combined approach was effective at scale for the early detection of ADRD in primary care settings. This is an important feature in busy primary care settings that can benefit both the health care system and patients."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05231954."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212562/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.42222",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": true,
      "summary": "The combined approach effectively detected early ADRD in primary care settings."
    },
    {
      "id": "4d4ad54c4ba4",
      "title": "DASH-Patterned Groceries and Effects on Blood Pressure: The GoFresh Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49062791/118129",
      "abstract": "The Dietary Approaches to Stop Hypertension (DASH) eating plan lowered blood pressure (BP) among Black adults in a controlled environment, but to date, there are no grocery shopping strategies that replicated its health effects in a community setting. The Groceries for Black Residents of Boston to Stop Hypertension (GoFresh) trial was conducted to determine the effects of low sodium-DASH groceries on systolic BP. This parallel-group randomized clinical trial was conducted in Boston from August 2022 to September 2025 among Black residents of urban communities with few grocery stores, a systolic BP of 120 to less than 150 mm Hg, a diastolic BP less than 100 mm Hg, and no hypertension treatment. Data were analyzed from June through October 2025. Participants were randomly assigned to 12 weeks of home-delivered, DASH-patterned groceries ordered weekly with dietitian counseling without emphasizing cost or three $500 stipends every 4 weeks intended for self-directed grocery shopping. The primary comparison was the difference in the 3-month change in model-estimated office systolic BP (based on 3 measurements over at least 2 visits) between interventions. Adherence was assessed via 24-hour urine collection. Secondary outcomes included diastolic BP, body mass index (BMI), hemoglobin A1c levels, and low-density lipoprotein (LDL) cholesterol. Maintenance of effects was assessed 3 months after intervention cessation. Among 180 participants, (mean [SD] age, 46.1 [13.3] years; 102 female [56.7%]; 180 self-reported Black [100%]; 12 Hispanic [6.7%]), 175 individuals (97.2%) completed the primary outcome assessment. Mean (SD) baseline systolic BP and diastolic BP were 130.0 (6.7) mm Hg and 79.8 (8.1) mm Hg. At 3 months, the mean systolic BP changed -5.7 mm Hg (95% CI, -7.4, to-3.9 mm Hg) in the DASH-patterned group and -2.3 mm Hg (95% CI, -4.1 to -0.4 mm Hg) in the self-directed group (difference in changes, -3.4 mm Hg; 95% CI, -5.9 to -0.8 mm Hg; P = .009). Compared with the self-directed group, after 3 months the DASH-patterned group changed mean diastolic BP by -2.4 mm Hg (95% CI, -4.2 to -0.5 mm Hg), urine sodium level by -545 mg/24 h (95% CI, -1041 to -50 mg/24 h), and LDL cholesterol by -8.0 mg/dL (95% CI, -13.7 to -2.3 mg/dL) (to convert LDL cholesterol to millimoles per liter, multiply by 0.0259). Effects were not maintained 6 months after the intervention was initiated. No effects occurred in BMI or hemoglobin A1c level. In this study, a program of home-delivered, DASH-style groceries plus dietitian counseling decreased BP and LDL cholesterol levels beyond comparable monetary compensation. However, effects were not maintained after the intervention ended. ClinicalTrials.gov Identifier: NCT05121337.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The Dietary Approaches to Stop Hypertension (DASH) eating plan lowered blood pressure (BP) among Black adults in a controlled environment, but to date, there are no grocery shopping strategies that replicated its health effects in a community setting."
        },
        {
          "label": "OBJECTIVE",
          "text": "The Groceries for Black Residents of Boston to Stop Hypertension (GoFresh) trial was conducted to determine the effects of low sodium-DASH groceries on systolic BP."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This parallel-group randomized clinical trial was conducted in Boston from August 2022 to September 2025 among Black residents of urban communities with few grocery stores, a systolic BP of 120 to less than 150 mm Hg, a diastolic BP less than 100 mm Hg, and no hypertension treatment. Data were analyzed from June through October 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomly assigned to 12 weeks of home-delivered, DASH-patterned groceries ordered weekly with dietitian counseling without emphasizing cost or three $500 stipends every 4 weeks intended for self-directed grocery shopping."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary comparison was the difference in the 3-month change in model-estimated office systolic BP (based on 3 measurements over at least 2 visits) between interventions. Adherence was assessed via 24-hour urine collection. Secondary outcomes included diastolic BP, body mass index (BMI), hemoglobin A1c levels, and low-density lipoprotein (LDL) cholesterol. Maintenance of effects was assessed 3 months after intervention cessation."
        },
        {
          "label": "RESULTS",
          "text": "Among 180 participants, (mean [SD] age, 46.1 [13.3] years; 102 female [56.7%]; 180 self-reported Black [100%]; 12 Hispanic [6.7%]), 175 individuals (97.2%) completed the primary outcome assessment. Mean (SD) baseline systolic BP and diastolic BP were 130.0 (6.7) mm Hg and 79.8 (8.1) mm Hg. At 3 months, the mean systolic BP changed -5.7 mm Hg (95% CI, -7.4, to-3.9 mm Hg) in the DASH-patterned group and -2.3 mm Hg (95% CI, -4.1 to -0.4 mm Hg) in the self-directed group (difference in changes, -3.4 mm Hg; 95% CI, -5.9 to -0.8 mm Hg; P = .009). Compared with the self-directed group, after 3 months the DASH-patterned group changed mean diastolic BP by -2.4 mm Hg (95% CI, -4.2 to -0.5 mm Hg), urine sodium level by -545 mg/24 h (95% CI, -1041 to -50 mg/24 h), and LDL cholesterol by -8.0 mg/dL (95% CI, -13.7 to -2.3 mg/dL) (to convert LDL cholesterol to millimoles per liter, multiply by 0.0259). Effects were not maintained 6 months after the intervention was initiated. No effects occurred in BMI or hemoglobin A1c level."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this study, a program of home-delivered, DASH-style groceries plus dietitian counseling decreased BP and LDL cholesterol levels beyond comparable monetary compensation. However, effects were not maintained after the intervention ended."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05121337."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41206973/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jama.2025.21112",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": true,
      "summary": "Home-delivered DASH groceries and dietitian counseling effectively lowered blood pressure and LDL cholesterol, but these benefits were not sustained after the program concluded."
    },
    {
      "id": "dbee1cf143c5",
      "title": "Risk of infection and wound dehiscence after use of prophylactic antibiotics in episiotomy or second degree tear (REPAIR study): single centre, double blind, placebo controlled randomised trial.",
      "journal": "BMJ",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49062791/118035",
      "abstract": "To evaluate the effect of prophylactic antibiotics on the risk of wound complications after episiotomy or second degree tear. Single centre, double blind, placebo controlled randomised trial. One university hospital in the Capital Region of Denmark. Participants were enrolled between March and December 2023. All initial clinical consultations were conducted between March 2023 and January 2024, and all long term follow-up consultations were conducted between March and November 2024. This article reports only data from the first consultation. 442 women with episiotomies or second degree tears were consecutively recruited at delivery. Exclusion criteria included treatment allergy (or risk of cross reactivity with related antibiotics), antibiotic use within 24 hours of delivery, non-Danish speakers, caesarean section, or episiotomy extension. A computer generated program randomised participants to either three doses of amoxicillin (500 mg) with clavulanic acid (125 mg) or placebo starting within six hours post partum and repeated at eight hour intervals. Follow-up was conducted four to 14 days post partum. Physicians, the steering committee, and participants were blinded. Wound complications (primary outcome) and clinically relevant wound complications (secondary outcome). The study ended as planned, in December 2024. 433 women completed follow-up and were included in the primary analysis. No significant difference was observed in overall wound complications (antibiotic 47/218, 22%; placebo 62/215, 29%; P=0.10), with a risk difference of -7.2% (95% confidence interval (CI) -15.4% to 0.8%) and a relative risk of 0.75 (0.54 to 1.04). For clinically relevant wound complications, significantly fewer events occurred in the treatment group (19/218, 9%  36/215, 17%; P=0.01), with a risk difference of -8.0% (95% CI -14.3% to -1.8%) and a relative risk of 0.52 (0.31 to 0.88). For clinically relevant wound complications, the number needed to treat was 12 (95% CI 7 to 56). Exploratory outcomes show that the treatment group reported better self-evaluated health, received fewer additional antibiotic treatments, and had smaller average wound dehiscence among patients with dehiscence. No serious adverse reactions occurred. Although no significant effect was seen for overall wound complications, prophylactic antibiotics significantly reduced the risk of clinically relevant wound complications in women with episiotomies and second degree tears and should be considered in postpartum care. Clinical Trials Information System (euclinicaltrials.eu) 2022-501930-49-00 and ClinicalTrials.gov NCT05830162.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effect of prophylactic antibiotics on the risk of wound complications after episiotomy or second degree tear."
        },
        {
          "label": "DESIGN",
          "text": "Single centre, double blind, placebo controlled randomised trial."
        },
        {
          "label": "SETTING",
          "text": "One university hospital in the Capital Region of Denmark. Participants were enrolled between March and December 2023. All initial clinical consultations were conducted between March 2023 and January 2024, and all long term follow-up consultations were conducted between March and November 2024. This article reports only data from the first consultation."
        },
        {
          "label": "PARTICIPANTS",
          "text": "442 women with episiotomies or second degree tears were consecutively recruited at delivery. Exclusion criteria included treatment allergy (or risk of cross reactivity with related antibiotics), antibiotic use within 24 hours of delivery, non-Danish speakers, caesarean section, or episiotomy extension."
        },
        {
          "label": "INTERVENTION",
          "text": "A computer generated program randomised participants to either three doses of amoxicillin (500 mg) with clavulanic acid (125 mg) or placebo starting within six hours post partum and repeated at eight hour intervals. Follow-up was conducted four to 14 days post partum. Physicians, the steering committee, and participants were blinded."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Wound complications (primary outcome) and clinically relevant wound complications (secondary outcome)."
        },
        {
          "label": "RESULTS",
          "text": "The study ended as planned, in December 2024. 433 women completed follow-up and were included in the primary analysis. No significant difference was observed in overall wound complications (antibiotic 47/218, 22%; placebo 62/215, 29%; P=0.10), with a risk difference of -7.2% (95% confidence interval (CI) -15.4% to 0.8%) and a relative risk of 0.75 (0.54 to 1.04). For clinically relevant wound complications, significantly fewer events occurred in the treatment group (19/218, 9%  36/215, 17%; P=0.01), with a risk difference of -8.0% (95% CI -14.3% to -1.8%) and a relative risk of 0.52 (0.31 to 0.88). For clinically relevant wound complications, the number needed to treat was 12 (95% CI 7 to 56). Exploratory outcomes show that the treatment group reported better self-evaluated health, received fewer additional antibiotic treatments, and had smaller average wound dehiscence among patients with dehiscence. No serious adverse reactions occurred."
        },
        {
          "label": "CONCLUSION",
          "text": "Although no significant effect was seen for overall wound complications, prophylactic antibiotics significantly reduced the risk of clinically relevant wound complications in women with episiotomies and second degree tears and should be considered in postpartum care."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Clinical Trials Information System (euclinicaltrials.eu) 2022-501930-49-00 and ClinicalTrials.gov NCT05830162."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161737/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1136/bmj-2025-084312",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": true,
      "summary": "Prophylactic antibiotics significantly reduce clinically relevant wound complications in women with episiotomies and second-degree tears."
    },
    {
      "id": "12e950a3003e",
      "title": "Incremental Value of Cardiac Myosin-Binding Protein C for the Early Diagnosis of Acute Myocardial Infarction.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49138101/118154",
      "abstract": "Cardiac myosin-binding protein C (cMyC) is a cardiac-specific sarcomeric protein with faster release kinetics compared with those of high-sensitivity cardiac troponin (hs-cTn). The aim of this study was to compare the diagnostic performance of cMyC, measured with a novel prototype automated immunoassay, with high-sensitivity cardiac troponin T (hs-cTnT) and high-sensitivity cardiac troponin I (hs-cTnI) for the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI). Furthermore, we derived a single blood draw dual-biomarker strategy combining hs-cTn and cMyC and compared it with the hs-cTnT/I-only strategy endorsed by the European Society of Cardiology. This was a secondary analysis from an international prospective study recruiting adult patients presenting to the emergency department (ED) with suspected NSTEMI. cMyC, hs-cTnT, and hs-cTnI concentrations were measured upon ED presentation. Final diagnoses were centrally adjudicated by 2 independent cardiologists blinded to cMyC values. To compare the single- and dual-biomarker strategy, safety (defined as the sensitivity and negative predictive value for ruling out index NSTEMI) and triage efficacy (defined as the proportion of patients triaged to either rule-out or rule-in) were assessed. The diagnostic endpoint was index NSTEMI. The prognostic endpoint was 30-day, 1-year, and 5-year cardiovascular death or MI. Findings were externally validated in an independent international cohort. Among 4,735 eligible patients, 854 (18%) were diagnosed with NSTEMI. The discrimination for NSTEMI at presentation was higher for cMyC (area under the curve [AUC]: 0.943; 95% CI: 0.936-0.95) than for hs-cTnT (AUC: 0.936; 95% CI: 0.929-0.944; P = 0.008). Differences were mainly driven by patients with chest pain onset ≤3 hours (AUC of 0.939 [95% CI: 0.928-0.951] vs 0.921 [95% CI: 0.907-0.936], respectively; P < 0.001). The dual-biomarker strategy increased overall triage efficacy from 26.8% (hs-cTnT only) to 60.0% (hs-cTnT and cMyC), without compromising safety during the index visit. Despite identifying up to 3 times more patients for rule-out, the dual-biomarker strategy showed comparable cumulative incidences of cardiovascular death or myocardial infarction at 30 days, 1 year, and 5 years. Similar results were observed with hs-cTnI and in the external validation cohort. CMyC adds significant incremental value to hs-cTn values in the early diagnosis of NSTEMI, improving diagnostic discrimination and enabling more patients to be safely and immediately ruled out for NSTEMI. The single blood draw dual-biomarker strategy is particularly attractive in busy ED settings due to its simplicity and quick time-to-decision. (Advantageous Predictors of Acute Coronary Syndromes Evaluation [APACE]; NCT00470587).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cardiac myosin-binding protein C (cMyC) is a cardiac-specific sarcomeric protein with faster release kinetics compared with those of high-sensitivity cardiac troponin (hs-cTn)."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this study was to compare the diagnostic performance of cMyC, measured with a novel prototype automated immunoassay, with high-sensitivity cardiac troponin T (hs-cTnT) and high-sensitivity cardiac troponin I (hs-cTnI) for the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI). Furthermore, we derived a single blood draw dual-biomarker strategy combining hs-cTn and cMyC and compared it with the hs-cTnT/I-only strategy endorsed by the European Society of Cardiology."
        },
        {
          "label": "METHODS",
          "text": "This was a secondary analysis from an international prospective study recruiting adult patients presenting to the emergency department (ED) with suspected NSTEMI. cMyC, hs-cTnT, and hs-cTnI concentrations were measured upon ED presentation. Final diagnoses were centrally adjudicated by 2 independent cardiologists blinded to cMyC values. To compare the single- and dual-biomarker strategy, safety (defined as the sensitivity and negative predictive value for ruling out index NSTEMI) and triage efficacy (defined as the proportion of patients triaged to either rule-out or rule-in) were assessed. The diagnostic endpoint was index NSTEMI. The prognostic endpoint was 30-day, 1-year, and 5-year cardiovascular death or MI. Findings were externally validated in an independent international cohort."
        },
        {
          "label": "RESULTS",
          "text": "Among 4,735 eligible patients, 854 (18%) were diagnosed with NSTEMI. The discrimination for NSTEMI at presentation was higher for cMyC (area under the curve [AUC]: 0.943; 95% CI: 0.936-0.95) than for hs-cTnT (AUC: 0.936; 95% CI: 0.929-0.944; P = 0.008). Differences were mainly driven by patients with chest pain onset ≤3 hours (AUC of 0.939 [95% CI: 0.928-0.951] vs 0.921 [95% CI: 0.907-0.936], respectively; P < 0.001). The dual-biomarker strategy increased overall triage efficacy from 26.8% (hs-cTnT only) to 60.0% (hs-cTnT and cMyC), without compromising safety during the index visit. Despite identifying up to 3 times more patients for rule-out, the dual-biomarker strategy showed comparable cumulative incidences of cardiovascular death or myocardial infarction at 30 days, 1 year, and 5 years. Similar results were observed with hs-cTnI and in the external validation cohort."
        },
        {
          "label": "CONCLUSIONS",
          "text": "CMyC adds significant incremental value to hs-cTn values in the early diagnosis of NSTEMI, improving diagnostic discrimination and enabling more patients to be safely and immediately ruled out for NSTEMI. The single blood draw dual-biomarker strategy is particularly attractive in busy ED settings due to its simplicity and quick time-to-decision. (Advantageous Predictors of Acute Coronary Syndromes Evaluation [APACE]; NCT00470587)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41222525/",
      "pubDate": "2025 Oct 13",
      "doi": "10.1016/j.jacc.2025.09.008",
      "dateReceived": "2025-12-01T23:26:47.003Z",
      "isNew": true,
      "summary": "Combining cardiac myosin-binding protein C (cMyC) with high-sensitivity cardiac troponin (hs-cTn) improves the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI) and allows for safer and faster rule-out decisions."
    },
    {
      "id": "6e31164457c1",
      "title": "Orforglipron, an oral small-molecule GLP-1 receptor agonist, for the treatment of obesity in people with type 2 diabetes (ATTAIN-2): a phase 3, double-blind, randomised, multicentre, placebo-controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49117264/118227",
      "abstract": "Obesity is a chronic disease that significantly contributes to type 2 diabetes and its complications. We aimed to evaluate orforglipron, an oral small-molecule (non-peptide) GLP-1 receptor agonist, for obesity treatment in adults with type 2 diabetes. This 72-week, phase 3, double-blind, placebo-controlled trial was conducted across 136 sites in ten countries. Participants with a BMI of 27 kg/m or higher and glycated haemoglobin (HbA) of 7-10% (53-86 mmol/mol) were randomly assigned (1:1:1:2) to once-daily orforglipron 6 mg, 12 mg, 36 mg, or placebo. The primary endpoint was the mean percent change in bodyweight from baseline to week 72. The treatment regimen estimand (using data from all randomly assigned participants, regardless of intercurrent events) was the primary estimand, with the efficacy estimand considered supportive. Safety was assessed in all patients who received at least one dose of study drug. This trial was registered at ClinicalTrials.gov (NCT05872620) and is completed. From June 5, 2023, to Feb 15, 2024, 2859 participants were screened, and 1613 (757 [46·9%] female) were randomly assigned, following a dose-escalation phase, to receive orforglipron 6 mg (n=329), 12 mg (n=332), 36 mg (n=322), or placebo (n=630), as an adjunct to lifestyle modification; 1444 (89·5%) completed the study. Baseline bodyweight was 101·4 kg (SD 22·5), BMI 35·6 kg/m (SD 6·6), and HbA 8·05% (SD 0·75; 64·4 mmol/mol [SD 8·2]). For the treatment regimen estimand, the mean percent change in bodyweight from baseline to week 72 was -5·1% (95% CI -6·0 to -4·2) with 6 mg (estimated treatment difference [ETD] -2·7 [95% CI -3·7 to -1·6]; p<0·0001), -7·0% (-7·8 to -6·2) with 12 mg (ETD -4·5 [-5·5 to -3·6]; p<0·0001), and -9·6% (-10·5 to -8·7) with 36 mg orforglipron (ETD -7·1 [-8·2 to -6·1]; p<0·0001), versus -2·5% (-3·0 to -1·9) with placebo (all p<0·0001 compared with placebo). All prespecified weight and cardiometabolic measures including HbA statistically significantly improved with orforglipron. Treatment discontinuations due to adverse events (mainly gastrointestinal-related) were higher for orforglipron (6·1-9·9%) versus placebo (4·1%). The most common adverse events with orforglipron were mild-to-moderate gastrointestinal events, predominantly occurring during dose escalation. Ten deaths were reported during the study: six with orforglipron and four with placebo. Investigators deemed all deaths unrelated to the study treatment, except for one case in the placebo group and one case in the 12 mg orforglipron group. For the case in the orforglipron group, no treatment-related association was reported. In adults with obesity or overweight and type 2 diabetes, statistically superior reduction in bodyweight compared with placebo was demonstrated by once-daily orforglipron as an adjunct to lifestyle modification, with a safety profile similar to other GLP-1 receptor agonists. Eli Lilly and Company.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Obesity is a chronic disease that significantly contributes to type 2 diabetes and its complications. We aimed to evaluate orforglipron, an oral small-molecule (non-peptide) GLP-1 receptor agonist, for obesity treatment in adults with type 2 diabetes."
        },
        {
          "label": "METHODS",
          "text": "This 72-week, phase 3, double-blind, placebo-controlled trial was conducted across 136 sites in ten countries. Participants with a BMI of 27 kg/m or higher and glycated haemoglobin (HbA) of 7-10% (53-86 mmol/mol) were randomly assigned (1:1:1:2) to once-daily orforglipron 6 mg, 12 mg, 36 mg, or placebo. The primary endpoint was the mean percent change in bodyweight from baseline to week 72. The treatment regimen estimand (using data from all randomly assigned participants, regardless of intercurrent events) was the primary estimand, with the efficacy estimand considered supportive. Safety was assessed in all patients who received at least one dose of study drug. This trial was registered at ClinicalTrials.gov (NCT05872620) and is completed."
        },
        {
          "label": "FINDINGS",
          "text": "From June 5, 2023, to Feb 15, 2024, 2859 participants were screened, and 1613 (757 [46·9%] female) were randomly assigned, following a dose-escalation phase, to receive orforglipron 6 mg (n=329), 12 mg (n=332), 36 mg (n=322), or placebo (n=630), as an adjunct to lifestyle modification; 1444 (89·5%) completed the study. Baseline bodyweight was 101·4 kg (SD 22·5), BMI 35·6 kg/m (SD 6·6), and HbA 8·05% (SD 0·75; 64·4 mmol/mol [SD 8·2]). For the treatment regimen estimand, the mean percent change in bodyweight from baseline to week 72 was -5·1% (95% CI -6·0 to -4·2) with 6 mg (estimated treatment difference [ETD] -2·7 [95% CI -3·7 to -1·6]; p<0·0001), -7·0% (-7·8 to -6·2) with 12 mg (ETD -4·5 [-5·5 to -3·6]; p<0·0001), and -9·6% (-10·5 to -8·7) with 36 mg orforglipron (ETD -7·1 [-8·2 to -6·1]; p<0·0001), versus -2·5% (-3·0 to -1·9) with placebo (all p<0·0001 compared with placebo). All prespecified weight and cardiometabolic measures including HbA statistically significantly improved with orforglipron. Treatment discontinuations due to adverse events (mainly gastrointestinal-related) were higher for orforglipron (6·1-9·9%) versus placebo (4·1%). The most common adverse events with orforglipron were mild-to-moderate gastrointestinal events, predominantly occurring during dose escalation. Ten deaths were reported during the study: six with orforglipron and four with placebo. Investigators deemed all deaths unrelated to the study treatment, except for one case in the placebo group and one case in the 12 mg orforglipron group. For the case in the orforglipron group, no treatment-related association was reported."
        },
        {
          "label": "INTERPRETATION",
          "text": "In adults with obesity or overweight and type 2 diabetes, statistically superior reduction in bodyweight compared with placebo was demonstrated by once-daily orforglipron as an adjunct to lifestyle modification, with a safety profile similar to other GLP-1 receptor agonists."
        },
        {
          "label": "FUNDING",
          "text": "Eli Lilly and Company."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41275875/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1016/S0140-6736(25)02165-8",
      "dateReceived": "2025-12-01T23:26:47.003Z",
      "isNew": true,
      "summary": "Orforglipron, a GLP-1 receptor agonist, demonstrated statistically significant weight loss in adults with type 2 diabetes over 72 weeks, with higher doses leading to greater weight reduction."
    },
    {
      "id": "765f9b1081f8",
      "title": "Electronic cigarettes for smoking cessation.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49038460/118195",
      "abstract": "There is limited guidance on how to stop using nicotine-containing vapes (otherwise known as e-cigarettes) and ensure long-term abstinence, whilst minimising the risk of tobacco smoking and other unintended consequences. Treatments could include pharmacological interventions, behavioural interventions, or both. To conduct a living systematic review assessing the benefits and harms of interventions to help people stop vaping compared to each other, placebo or no intervention. To assess how these interventions affect the use of combustible tobacco, and whether effects vary based on participant characteristics. We searched CENTRAL, MEDLINE, Embase, PsycINFO, ClinicalTrials.gov and WHO International Clinical Trials Registry Platform from 1 January 2004 to 1 July 2025. We also searched the references of eligible studies and abstracts from the Society for Research on Nicotine and Tobacco conferences, and contacted study authors. We included randomised controlled trials (RCTs) recruiting people of any age using nicotine-containing vapes, regardless of tobacco smoking status. Studies had to test an intervention designed to support people to quit vaping, and plan to measure at least one of our outcomes. Critical outcomes: vaping cessation at six months or longer; change in combustible tobacco use at six months or longer; number of participants reporting serious adverse events (SAEs) at one week or longer. We used Cochrane's RoB 1 tool to assess risk of bias in the included studies. We followed standard Cochrane methods. We grouped studies by comparisons and outcomes, and calculated individual study and pooled effects, as appropriate. We used random-effects Mantel-Haenszel methods to calculate risk ratios (RRs) with 95% confidence intervals (CIs) and random-effects inverse variance methods to calculate mean differences (MDs) and 95% CIs. We used GRADE to assess the certainty of evidence for our critical outcomes. Fifteen studies (six new to this updated version) involving 5800 participants are included. Fourteen studies included some participants who had previously smoked tobacco; in seven studies, participants were not smoking at baseline. Twelve studies only included participants aged 18 or older (five exclusively included people between 18 and 29); two included some participants under 18 years; and one included 13- to 17-year-olds only. Fourteen studies were conducted in the USA and one in Italy. We judged five studies at low, six at high, and four at unclear risk of bias. Pharmacological interventions Studies assessed our critical outcomes in relation to combination nicotine replacement therapy (NRT), cytisine, and varenicline compared to placebo or no/minimal support. For combination NRT versus no/minimal support, there was no clear evidence of benefit for vaping cessation rates at six months or longer, with the CI incorporating the possibility of reduced and increased cessation rates (very low-certainty evidence due to imprecision and risk of bias; RR 0.96, 95% CI 0.73 to 1.25; I² = 0%; 2 studies, 214 participants). One study investigating cytisine versus placebo did not report vaping cessation at six months or longer. When compared to placebo, varenicline increased vaping cessation rates at six months, but evidence was of low certainty due to imprecision (RR 2.71, 95% CI 1.33 to 5.49; I = 48%; 2 studies, 315 participants). One study comparing combination NRT versus no/minimal support reported combustible tobacco cessation. There was no clear evidence of higher tobacco cessation in either arm, and CIs were imprecise. The evidence was of very low certainty due to imprecision and risk of bias (RR 0.99, 95% CI 0.71 to 1.37; 198 participants). Zero participants reported SAEs in the two studies investigating combination NRT versus no/minimal support (706 participants; very low-certainty evidence due to risk of bias and imprecision) and in the one study investigating cytisine versus placebo (159 participants; low-certainty evidence due to imprecision). Four studies evaluating varenicline versus placebo measured SAEs, with zero events reported in two studies. Thus, our effect estimate was based on two studies (RR 2.82, 95% CI 0.45 to 17.59; 304 participants; low-certainty evidence due to imprecision). Behavioural interventions Studies assessed our critical outcomes in relation to reducing nicotine/vaping behaviour and text message-based interventions compared to no/minimal support. There was no clear evidence that nicotine/vaping reduction increased vaping cessation at six months compared to minimal support (RR 3.38, 95% CI 0.43 to 26.30; 1 study, 17 participants; very low-certainty evidence due to imprecision and risk of bias). There was low-certainty evidence (due to indirectness) that text message-based interventions may increase vaping cessation rates compared to no/minimal support in 13- to 24-year-olds specifically (RR 1.32, 95% CI 1.19 to 1.47; I = 0%; 2 studies, 4091 participants). There was very low-certainty evidence (due to indirectness and imprecision) that text message-based interventions for vaping cessation may result in little to no difference in smoking uptake (RR 1.04, 95% CI 0.81 to 1.33; 1 study, 1036 participants) or cessation (RR 1.03, 95% CI 0.90 to 1.19; 1 study, 793 participants) compared to no/minimal support. The one study investigating nicotine/vaping behaviour reduction versus minimal support did not report SAEs. Three studies investigating text message-based interventions reported SAEs; however, zero events were reported (2082 participants; low-certainty evidence due to imprecision). Low-certainty evidence suggests that text message-based interventions to help people stop nicotine vaping may help more youths and young adults to successfully stop compared to no/minimal support, with very uncertain evidence regarding their effect on smoking behaviours. Low-certainty evidence suggests that varenicline may help people quit vaping. Data exploring the effectiveness of combination NRT, cytisine, and nicotine/vaping behaviour reduction are inconclusive due to risk of bias and imprecision. Most studies that measured SAEs reported that none had occurred; however, more data are needed to draw clear conclusions. Studies that have investigated these interventions for quitting smoking have not demonstrated serious concerns about SAEs. It is important that future studies measure combustible tobacco outcomes so the complete risk profile of relevant interventions can be considered. Further RCTs are underway. To ensure this review continues to provide up-to-date information to decision-makers, we will maintain it as a living systematic review by running searches monthly and updating the review when relevant new evidence that will strengthen or change our conclusions emerges. Cancer Research UK (PICCTR-2024/100012); National Institute for Health and Care Research (NIHR206123). Protocol (2024) DOI: 10.1002/14651858.CD016058 Original review (2025) DOI: 10.1002/14651858.CD016058.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "There is limited guidance on how to stop using nicotine-containing vapes (otherwise known as e-cigarettes) and ensure long-term abstinence, whilst minimising the risk of tobacco smoking and other unintended consequences. Treatments could include pharmacological interventions, behavioural interventions, or both."
        },
        {
          "label": "OBJECTIVES",
          "text": "To conduct a living systematic review assessing the benefits and harms of interventions to help people stop vaping compared to each other, placebo or no intervention. To assess how these interventions affect the use of combustible tobacco, and whether effects vary based on participant characteristics."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, PsycINFO, ClinicalTrials.gov and WHO International Clinical Trials Registry Platform from 1 January 2004 to 1 July 2025. We also searched the references of eligible studies and abstracts from the Society for Research on Nicotine and Tobacco conferences, and contacted study authors."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) recruiting people of any age using nicotine-containing vapes, regardless of tobacco smoking status. Studies had to test an intervention designed to support people to quit vaping, and plan to measure at least one of our outcomes."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes: vaping cessation at six months or longer; change in combustible tobacco use at six months or longer; number of participants reporting serious adverse events (SAEs) at one week or longer."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used Cochrane's RoB 1 tool to assess risk of bias in the included studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We followed standard Cochrane methods. We grouped studies by comparisons and outcomes, and calculated individual study and pooled effects, as appropriate. We used random-effects Mantel-Haenszel methods to calculate risk ratios (RRs) with 95% confidence intervals (CIs) and random-effects inverse variance methods to calculate mean differences (MDs) and 95% CIs. We used GRADE to assess the certainty of evidence for our critical outcomes."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Fifteen studies (six new to this updated version) involving 5800 participants are included. Fourteen studies included some participants who had previously smoked tobacco; in seven studies, participants were not smoking at baseline. Twelve studies only included participants aged 18 or older (five exclusively included people between 18 and 29); two included some participants under 18 years; and one included 13- to 17-year-olds only. Fourteen studies were conducted in the USA and one in Italy. We judged five studies at low, six at high, and four at unclear risk of bias."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Pharmacological interventions Studies assessed our critical outcomes in relation to combination nicotine replacement therapy (NRT), cytisine, and varenicline compared to placebo or no/minimal support. For combination NRT versus no/minimal support, there was no clear evidence of benefit for vaping cessation rates at six months or longer, with the CI incorporating the possibility of reduced and increased cessation rates (very low-certainty evidence due to imprecision and risk of bias; RR 0.96, 95% CI 0.73 to 1.25; I² = 0%; 2 studies, 214 participants). One study investigating cytisine versus placebo did not report vaping cessation at six months or longer. When compared to placebo, varenicline increased vaping cessation rates at six months, but evidence was of low certainty due to imprecision (RR 2.71, 95% CI 1.33 to 5.49; I = 48%; 2 studies, 315 participants). One study comparing combination NRT versus no/minimal support reported combustible tobacco cessation. There was no clear evidence of higher tobacco cessation in either arm, and CIs were imprecise. The evidence was of very low certainty due to imprecision and risk of bias (RR 0.99, 95% CI 0.71 to 1.37; 198 participants). Zero participants reported SAEs in the two studies investigating combination NRT versus no/minimal support (706 participants; very low-certainty evidence due to risk of bias and imprecision) and in the one study investigating cytisine versus placebo (159 participants; low-certainty evidence due to imprecision). Four studies evaluating varenicline versus placebo measured SAEs, with zero events reported in two studies. Thus, our effect estimate was based on two studies (RR 2.82, 95% CI 0.45 to 17.59; 304 participants; low-certainty evidence due to imprecision). Behavioural interventions Studies assessed our critical outcomes in relation to reducing nicotine/vaping behaviour and text message-based interventions compared to no/minimal support. There was no clear evidence that nicotine/vaping reduction increased vaping cessation at six months compared to minimal support (RR 3.38, 95% CI 0.43 to 26.30; 1 study, 17 participants; very low-certainty evidence due to imprecision and risk of bias). There was low-certainty evidence (due to indirectness) that text message-based interventions may increase vaping cessation rates compared to no/minimal support in 13- to 24-year-olds specifically (RR 1.32, 95% CI 1.19 to 1.47; I = 0%; 2 studies, 4091 participants). There was very low-certainty evidence (due to indirectness and imprecision) that text message-based interventions for vaping cessation may result in little to no difference in smoking uptake (RR 1.04, 95% CI 0.81 to 1.33; 1 study, 1036 participants) or cessation (RR 1.03, 95% CI 0.90 to 1.19; 1 study, 793 participants) compared to no/minimal support. The one study investigating nicotine/vaping behaviour reduction versus minimal support did not report SAEs. Three studies investigating text message-based interventions reported SAEs; however, zero events were reported (2082 participants; low-certainty evidence due to imprecision)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Low-certainty evidence suggests that text message-based interventions to help people stop nicotine vaping may help more youths and young adults to successfully stop compared to no/minimal support, with very uncertain evidence regarding their effect on smoking behaviours. Low-certainty evidence suggests that varenicline may help people quit vaping. Data exploring the effectiveness of combination NRT, cytisine, and nicotine/vaping behaviour reduction are inconclusive due to risk of bias and imprecision. Most studies that measured SAEs reported that none had occurred; however, more data are needed to draw clear conclusions. Studies that have investigated these interventions for quitting smoking have not demonstrated serious concerns about SAEs. It is important that future studies measure combustible tobacco outcomes so the complete risk profile of relevant interventions can be considered. Further RCTs are underway. To ensure this review continues to provide up-to-date information to decision-makers, we will maintain it as a living systematic review by running searches monthly and updating the review when relevant new evidence that will strengthen or change our conclusions emerges."
        },
        {
          "label": "FUNDING",
          "text": "Cancer Research UK (PICCTR-2024/100012); National Institute for Health and Care Research (NIHR206123)."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2024) DOI: 10.1002/14651858.CD016058 Original review (2025) DOI: 10.1002/14651858.CD016058.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41288132/",
      "pubDate": "2025 Nov 25",
      "doi": "10.1002/14651858.CD016058.pub3",
      "dateReceived": "2025-11-30T23:24:52.415Z",
      "isNew": false,
      "summary": "Text message interventions and varenicline may help young people quit vaping, but more research is needed on other interventions and serious adverse events."
    },
    {
      "id": "d7b1ec7e3125",
      "title": "Complete versus culprit lesion-only revascularisation for acute myocardial infarction (Complete Revascularisation Trialists` Collaboration): an individual patient data meta-analysis of randomised trials.",
      "journal": "Lancet",
      "score": "7/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49038460/118157",
      "abstract": "In patients presenting with acute coronary syndromes and multivessel coronary artery disease, the question of whether to undertake a strategy of complete revascularisation in cases in which percutaneous coronary intervention (PCI) is performed routinely on non-culprit lesions (in addition to the culprit lesion) or whether to restrict PCI only to the culprit lesion is a common dilemma. The Complete Revascularisation Trialists' Collaboration aimed to determine, based on the totality of data from randomised trials, the effect of a complete revascularisation strategy on major cardiovascular events and whether it reduces cardiovascular death. In this individual patient data meta-analysis, trials were included if they enrolled at least 250 patients, compared a complete revascularisation strategy (with PCI) to a culprit lesion-only PCI strategy, and enrolled patients presenting with acute ST-segment elevation myocardial infarction or non-ST-segment elevation myocardial infarction. To ensure that no trials were overlooked, we searched Ovid MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) for randomised controlled trials published between 1996 and Sept 15, 2025. The primary outcomes were the composite of cardiovascular death or new myocardial infarction and cardiovascular death alone. Hierarchical testing of cardiovascular death alone was planned contingent on reduction in cardiovascular death or new myocardial infarction based on the prespecified alpha level of 0·04. A one-stage individual patient data meta-analysis was performed using a Cox frailty model. All-cause death was the secondary outcome; non-cardiovascular death and new myocardial infarction were additional outcomes. All analyses included all randomly assigned patients. The meta-analysis was registered in PROSPERO, CRD420251124098. Six randomised controlled trials involving 8836 individuals were included. The median age was 65·8 years (IQR 57·0-76·0), and 2088 (23·6%) patients were female and 6748 (76·4%) were male. Overall, 7768 (87·9%) patients presented with ST-segment elevation myocardial infarction and 1068 (12·1%) with non-ST-segment elevation myocardial infarction. At a median follow-up of 36·0 months (IQR 30·6-48·0), cardiovascular death or new myocardial infarction occurred in 382 (9·0%) of 4259 patients in the complete revascularisation group compared with 528 (11·5%) of 4577 patients in the culprit lesion-only group (hazard ratio [HR] 0·76 [95% CI 0·67-0·87], p<0·0001). There were 155 (3·6%) cardiovascular deaths in the complete revascularisation group compared with 209 (4·6%) in the culprit lesion-only group (HR 0·76 [95% CI 0·62-0·93], p=0·0091). All-cause death occurred in 308 (7·2%) patients in the complete revascularisation group compared with 370 (8·1%) patients in the culprit lesion-only group (HR 0·85 [95% CI 0·73-0·99], p=0·039). Non-cardiovascular death was similar between the groups (153 [3·6%] in the complete revascularisation group vs 161 [3·5%] in the culprit lesion-only group; HR 0·98 [95% CI 0·78-1·22], p=0·85). Complete revascularisation reduced new myocardial infarctions compared with culprit lesion-only PCI (255 [6·0%] vs 357 [7·8%]; HR 0·76 [95% CI 0·65-0·90], p=0·0011). In patients presenting with acute myocardial infarction and multivessel disease, complete revascularisation reduced the composite of cardiovascular death or new myocardial infarction as well as cardiovascular death alone compared with a culprit lesion-only PCI strategy. In addition, all-cause death was lower with complete revascularisation. These data provide the strongest and most robust evidence to date that complete revascularisation improves important cardiovascular clinical outcomes. None.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In patients presenting with acute coronary syndromes and multivessel coronary artery disease, the question of whether to undertake a strategy of complete revascularisation in cases in which percutaneous coronary intervention (PCI) is performed routinely on non-culprit lesions (in addition to the culprit lesion) or whether to restrict PCI only to the culprit lesion is a common dilemma. The Complete Revascularisation Trialists' Collaboration aimed to determine, based on the totality of data from randomised trials, the effect of a complete revascularisation strategy on major cardiovascular events and whether it reduces cardiovascular death."
        },
        {
          "label": "METHODS",
          "text": "In this individual patient data meta-analysis, trials were included if they enrolled at least 250 patients, compared a complete revascularisation strategy (with PCI) to a culprit lesion-only PCI strategy, and enrolled patients presenting with acute ST-segment elevation myocardial infarction or non-ST-segment elevation myocardial infarction. To ensure that no trials were overlooked, we searched Ovid MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) for randomised controlled trials published between 1996 and Sept 15, 2025. The primary outcomes were the composite of cardiovascular death or new myocardial infarction and cardiovascular death alone. Hierarchical testing of cardiovascular death alone was planned contingent on reduction in cardiovascular death or new myocardial infarction based on the prespecified alpha level of 0·04. A one-stage individual patient data meta-analysis was performed using a Cox frailty model. All-cause death was the secondary outcome; non-cardiovascular death and new myocardial infarction were additional outcomes. All analyses included all randomly assigned patients. The meta-analysis was registered in PROSPERO, CRD420251124098."
        },
        {
          "label": "FINDINGS",
          "text": "Six randomised controlled trials involving 8836 individuals were included. The median age was 65·8 years (IQR 57·0-76·0), and 2088 (23·6%) patients were female and 6748 (76·4%) were male. Overall, 7768 (87·9%) patients presented with ST-segment elevation myocardial infarction and 1068 (12·1%) with non-ST-segment elevation myocardial infarction. At a median follow-up of 36·0 months (IQR 30·6-48·0), cardiovascular death or new myocardial infarction occurred in 382 (9·0%) of 4259 patients in the complete revascularisation group compared with 528 (11·5%) of 4577 patients in the culprit lesion-only group (hazard ratio [HR] 0·76 [95% CI 0·67-0·87], p<0·0001). There were 155 (3·6%) cardiovascular deaths in the complete revascularisation group compared with 209 (4·6%) in the culprit lesion-only group (HR 0·76 [95% CI 0·62-0·93], p=0·0091). All-cause death occurred in 308 (7·2%) patients in the complete revascularisation group compared with 370 (8·1%) patients in the culprit lesion-only group (HR 0·85 [95% CI 0·73-0·99], p=0·039). Non-cardiovascular death was similar between the groups (153 [3·6%] in the complete revascularisation group vs 161 [3·5%] in the culprit lesion-only group; HR 0·98 [95% CI 0·78-1·22], p=0·85). Complete revascularisation reduced new myocardial infarctions compared with culprit lesion-only PCI (255 [6·0%] vs 357 [7·8%]; HR 0·76 [95% CI 0·65-0·90], p=0·0011)."
        },
        {
          "label": "INTERPRETATION",
          "text": "In patients presenting with acute myocardial infarction and multivessel disease, complete revascularisation reduced the composite of cardiovascular death or new myocardial infarction as well as cardiovascular death alone compared with a culprit lesion-only PCI strategy. In addition, all-cause death was lower with complete revascularisation. These data provide the strongest and most robust evidence to date that complete revascularisation improves important cardiovascular clinical outcomes."
        },
        {
          "label": "FUNDING",
          "text": "None."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41223860/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1016/S0140-6736(25)02170-1",
      "dateReceived": "2025-11-30T23:24:52.415Z",
      "isNew": false,
      "summary": "Complete revascularization with PCI in patients with acute coronary syndromes and multivessel disease significantly reduced the composite of cardiovascular death or new myocardial infarction."
    },
    {
      "id": "9a98d8207e12",
      "title": "Early subcutaneous basal insulin with intravenous insulin infusion for diabetic ketoacidosis management: A systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Endocrine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49138101/118215",
      "abstract": "To evaluate the effectiveness and safety of early initiation of subcutaneous (SC) basal insulin in combination with intravenous insulin infusion (IVII), compared with IVII alone, for the management of diabetic ketoacidosis (DKA). A systematic search of PubMed, Embase, Scopus, and the Cochrane Library was conducted to identify randomised controlled trials (RCTs) comparing early initiation of long- or ultra-long-acting basal insulin plus IVII versus IVII alone in DKA management. Studies published up to 6 September 2025, were included. Meta-analysis was performed using mean difference (MD) for continuous outcomes and risk ratio for dichotomous outcomes, both with a 95% confidence interval (CI). The primary outcome was time to DKA resolution. Secondary outcomes included total intravenous insulin use, rebound hyperglycemia, hypoglycemia, hypokalemia, length of hospital stay (LOS), and mortality. A one-stage individual participant data meta-analysis was also conducted when individual-level data were available. Eight RCTs including 468 participants (256 receiving early SC basal insulin plus IVII; 212 receiving IVII alone) were included. Baseline characteristics were comparable across studies. Early SC basal insulin significantly reduced time to DKA resolution (MD -4.02 h, 95%CI -5.52 to -2.52, p <0.001) and total intravenous insulin dose until DKA resolution (MD -19.2 units, 95%CI -28.99 to -9.26, p <0.001). No significant differences were observed between groups for rebound hyperglycemia, safety outcomes, LOS, or in-hospital mortality. Early SC basal insulin in combination with IVII significantly accelerates DKA resolution and reduces total IVII requirements, without increasing the risk of adverse events, including hypoglycemia or hypokalemia.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To evaluate the effectiveness and safety of early initiation of subcutaneous (SC) basal insulin in combination with intravenous insulin infusion (IVII), compared with IVII alone, for the management of diabetic ketoacidosis (DKA)."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "A systematic search of PubMed, Embase, Scopus, and the Cochrane Library was conducted to identify randomised controlled trials (RCTs) comparing early initiation of long- or ultra-long-acting basal insulin plus IVII versus IVII alone in DKA management. Studies published up to 6 September 2025, were included. Meta-analysis was performed using mean difference (MD) for continuous outcomes and risk ratio for dichotomous outcomes, both with a 95% confidence interval (CI). The primary outcome was time to DKA resolution. Secondary outcomes included total intravenous insulin use, rebound hyperglycemia, hypoglycemia, hypokalemia, length of hospital stay (LOS), and mortality. A one-stage individual participant data meta-analysis was also conducted when individual-level data were available."
        },
        {
          "label": "RESULTS",
          "text": "Eight RCTs including 468 participants (256 receiving early SC basal insulin plus IVII; 212 receiving IVII alone) were included. Baseline characteristics were comparable across studies. Early SC basal insulin significantly reduced time to DKA resolution (MD -4.02 h, 95%CI -5.52 to -2.52, p <0.001) and total intravenous insulin dose until DKA resolution (MD -19.2 units, 95%CI -28.99 to -9.26, p <0.001). No significant differences were observed between groups for rebound hyperglycemia, safety outcomes, LOS, or in-hospital mortality."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Early SC basal insulin in combination with IVII significantly accelerates DKA resolution and reduces total IVII requirements, without increasing the risk of adverse events, including hypoglycemia or hypokalemia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208563/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70276",
      "dateReceived": "2025-11-30T23:24:52.414Z",
      "isNew": false,
      "summary": "Early subcutaneous basal insulin combined with intravenous insulin infusion effectively resolves diabetic ketoacidosis faster and lowers total insulin needs, without increasing the risk of complications."
    },
    {
      "id": "ef3076933b99",
      "title": "Temporal trends in the use of oral anticoagulants and clinical outcomes in older, elderly, and very elderly patients with atrial fibrillation: a Danish nationwide study.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49027402/118193",
      "abstract": "Anticoagulation therapy in patients with atrial fibrillation (AF) has changed over time, particularly following the introduction of direct oral anticoagulants. However, it is unknown how the uptake of anticoagulation therapy and the related clinical outcomes in elderly patients with AF have changed over time. Patients with new-onset AF were included and divided into three age groups: older adults (65-74 years), elderly (75-84 years), and very elderly (≥85 years). Temporal trends in the initiation of oral anticoagulants (OACs), the stroke-free survival, major bleedings including intracerebral haemorrhage (ICH), and all-cause mortality were investigated from 1999 to 2022. In total, 243 938 patients were included, of whom 89 184 (36.6%) were older adults, 99 002 were elderly (40.6%), and 55 752 (22.8%) were very elderly. The proportion of very elderly patients with AF receiving OACs was 71% in 2022. The absolute improvement in the 5-year probability of stroke-free survival was 10.1% in the older adult patients, 12.8% in the elderly patients, and 3.5% in the very elderly patients. The 5-year absolute risk of ICH increased among the elderly and very elderly AF patients. Over the past two decades, the risk of stroke decreased significantly among all age groups, with no subsequent increase in the risk of bleeding among older adults in an era where OACs were almost fully implemented. In the very elderly patients aged ≥85 years, the risk of stroke only slightly improved over time, with an increase in the risk of ICH.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Anticoagulation therapy in patients with atrial fibrillation (AF) has changed over time, particularly following the introduction of direct oral anticoagulants. However, it is unknown how the uptake of anticoagulation therapy and the related clinical outcomes in elderly patients with AF have changed over time."
        },
        {
          "label": "METHODS",
          "text": "Patients with new-onset AF were included and divided into three age groups: older adults (65-74 years), elderly (75-84 years), and very elderly (≥85 years). Temporal trends in the initiation of oral anticoagulants (OACs), the stroke-free survival, major bleedings including intracerebral haemorrhage (ICH), and all-cause mortality were investigated from 1999 to 2022."
        },
        {
          "label": "RESULTS",
          "text": "In total, 243 938 patients were included, of whom 89 184 (36.6%) were older adults, 99 002 were elderly (40.6%), and 55 752 (22.8%) were very elderly. The proportion of very elderly patients with AF receiving OACs was 71% in 2022. The absolute improvement in the 5-year probability of stroke-free survival was 10.1% in the older adult patients, 12.8% in the elderly patients, and 3.5% in the very elderly patients. The 5-year absolute risk of ICH increased among the elderly and very elderly AF patients."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Over the past two decades, the risk of stroke decreased significantly among all age groups, with no subsequent increase in the risk of bleeding among older adults in an era where OACs were almost fully implemented. In the very elderly patients aged ≥85 years, the risk of stroke only slightly improved over time, with an increase in the risk of ICH."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41251006/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1093/eurheartj/ehaf877",
      "dateReceived": "2025-11-29T23:24:49.499Z",
      "isNew": false,
      "summary": "Stroke risk decreased across most age groups, but in the very elderly (85+), stroke risk only slightly improved while intracranial hemorrhage risk increased."
    },
    {
      "id": "86147a3cf065",
      "title": "Continuous glucose monitoring in early gestational diabetes improves maternal and neonatal outcomes-The Steady Sugar trial.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49027402/118174",
      "abstract": "Early detection and management of gestational diabetes mellitus (GDM) benefits both mother and infants. We aimed to compare continuous glucose monitoring (CGM) to routine self-monitoring of blood glucose (SMBG) in a randomised controlled trial on glycaemic management and pregnancy outcomes in women with GDM diagnosed in gestational Weeks 8-26. From October 2021 to December 2023, 128 women with GDM were enrolled and 120 completed the trial after 2:1 randomisation to either the intervention (Dexcom G6 CGM, n = 80) or the control group (SMBG 4×/day and monthly blinded CGM [Dexcom G6 Pro], n = 40). Both groups received lifestyle and medication advice based on the CGM interpretation, clinical follow-up and glucose monitoring until delivery. CGM metrics were evaluated with the automated glucose data analysis (AGATA) toolbox (https://github.com/gcappon/agata) and maternal and neonatal outcomes were collected from medical records. Participants completed the CGM Satisfaction survey prior to delivery. While no significant differences between groups in time spent in the glucose target range (TIR) 63-140 mg/dL (primary outcome) were found (p = 0.37), the intervention group experienced significantly lower unscheduled caesarean section rates (20.0% vs. 44.4%, p = 0.046, V = 0.19) and preterm deliveries (6.8% vs. 18.4%, p = 0.041, V = 0.19). Neonates experienced lower large-for-gestational-age rates (5.0% vs. 18.4%, p = 0.019, V = 0.22) and neonatal intensive care unit admissions (22.5% vs. 44.7%, p = 0.013, V = 0.23) compared to the control group. Participants in the intervention group reported high CGM satisfaction and endorsed the behavioural and psychosocial benefits. For women with early GDM, despite no improvement in TIR, CGM improved maternal and neonatal outcomes versus SMBG. The effect may be mediated by improved awareness of glycaemic excursions and by facilitation of treatment regimen adjustments.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Early detection and management of gestational diabetes mellitus (GDM) benefits both mother and infants. We aimed to compare continuous glucose monitoring (CGM) to routine self-monitoring of blood glucose (SMBG) in a randomised controlled trial on glycaemic management and pregnancy outcomes in women with GDM diagnosed in gestational Weeks 8-26."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "From October 2021 to December 2023, 128 women with GDM were enrolled and 120 completed the trial after 2:1 randomisation to either the intervention (Dexcom G6 CGM, n = 80) or the control group (SMBG 4×/day and monthly blinded CGM [Dexcom G6 Pro], n = 40). Both groups received lifestyle and medication advice based on the CGM interpretation, clinical follow-up and glucose monitoring until delivery. CGM metrics were evaluated with the automated glucose data analysis (AGATA) toolbox (https://github.com/gcappon/agata) and maternal and neonatal outcomes were collected from medical records. Participants completed the CGM Satisfaction survey prior to delivery."
        },
        {
          "label": "RESULTS",
          "text": "While no significant differences between groups in time spent in the glucose target range (TIR) 63-140 mg/dL (primary outcome) were found (p = 0.37), the intervention group experienced significantly lower unscheduled caesarean section rates (20.0% vs. 44.4%, p = 0.046, V = 0.19) and preterm deliveries (6.8% vs. 18.4%, p = 0.041, V = 0.19). Neonates experienced lower large-for-gestational-age rates (5.0% vs. 18.4%, p = 0.019, V = 0.22) and neonatal intensive care unit admissions (22.5% vs. 44.7%, p = 0.013, V = 0.23) compared to the control group. Participants in the intervention group reported high CGM satisfaction and endorsed the behavioural and psychosocial benefits."
        },
        {
          "label": "CONCLUSIONS",
          "text": "For women with early GDM, despite no improvement in TIR, CGM improved maternal and neonatal outcomes versus SMBG. The effect may be mediated by improved awareness of glycaemic excursions and by facilitation of treatment regimen adjustments."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41178671/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1111/dom.70254",
      "dateReceived": "2025-11-29T23:24:49.499Z",
      "isNew": false,
      "summary": "In women with early gestational diabetes mellitus (GDM), continuous glucose monitoring (CGM) improved maternal and neonatal outcomes compared to self-monitoring of blood glucose (SMBG), potentially due to better awareness of blood sugar fluctuations and easier treatment adjustments."
    },
    {
      "id": "7cca4ad3ea98",
      "title": "Efficacy of Individual-Level Interventions to Mitigate the Risk for Burnout Among Health Care Professionals : A Systematic Review and Meta-analysis of Randomized Controlled Trials.",
      "journal": "Ann Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49128253/118192",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41248503/",
      "pubDate": "2025 Nov 18",
      "doi": "10.7326/ANNALS-25-04275-VS",
      "dateReceived": "2025-11-29T23:24:49.498Z",
      "isNew": false
    },
    {
      "id": "8a9a5a877247",
      "title": "Evaluation of Interventions for Cognitive Symptoms in Long COVID: A Randomized Clinical Trial.",
      "journal": "JAMA Neurol",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49017025/118178",
      "abstract": "Treatment for cognitive dysfunction due to postacute sequelae of long COVID (ie, symptoms of fatigue, malaise, weakness, confusion that persist beyond 12 weeks after an initial COVID infection) remains a significant unmet need. To test evidence-based rehabilitation strategies for improving cognitive symptoms in persons with long COVID. This was a 5-arm, multicenter, randomized clinical trial of 3 remotely delivered interventions conducted between August 17, 2023, and June 10, 2024. The study took place at 22 trial sites and included the screening of individuals with cognitive long COVID. Participants were randomized to 1 of 5 arms: adaptive computerized cognitive training (BrainHQ [Posit Science]), cognitive-behavioral rehabilitation involving both group and individual counseling sessions (PASC-Cognitive Recovery [PASC-CoRE]) paired with BrainHQ, and transcranial direct current stimulation (tDCS) paired with BrainHQ. Two comparator arms were included as follows: unstructured computer puzzles and games (active comparator) and sham tDCS paired with BrainHQ. The interventions occurred 5 times per week over 10 weeks. Cognitive and behavioral in-person assessments were performed at baseline, midintervention, at the end of intervention, and 3 months after the end of the intervention. The primary outcome measure was the modified Everyday Cognition Scale 2 (ECog2) completed at the end of the intervention compared to the baseline visit based on participant self-report looking back over the prior 7 days. A total of 378 individuals were screened, from which there were 328 participants (median [IQR] age, 48.0 [37.0-58.0] years; 241 female [73.5%]; race: 15 Asian [4.6%], 47 Black [14.3%], and 235 White [71.6%]; ethnicity: 52 Hispanic [15.9%]). None of the 3 active interventions demonstrated benefits on the modified ECog2 in the intention-to-treat population by the end of the intervention period. The adjusted differences in mean change were 0.0 (95% CI, -0.2 to 0.2) for BrainHQ vs active comparator, 0.1 (95% CI, -0.1 to 0.3) for PASC-CoRE + BrainHQ vs active comparator, 0.0 (95% CI, -0.2 to 0.2) for tDCS-active + BrainHQ vs tDCS-sham + BrainHQ, and 0.1 (95% CI, -0.1 to 0.3) for PASC-CoRE + BrainHQ vs BrainHQ alone. Secondary participant-reported outcomes and neuropsychological tests showed no differential benefits for any treatment arm. All 5 arms demonstrated some improvements over time on the modified ECog2 and on secondary outcomes. There were no serious adverse events attributable to the interventions. This phase 2 randomized clinical trial failed to demonstrate differential benefits for online cognitive training, a structured cognitive rehabilitation program, and tDCS for cognitive long COVID. ClinicalTrials.gov Identifier: NCT05965739.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Treatment for cognitive dysfunction due to postacute sequelae of long COVID (ie, symptoms of fatigue, malaise, weakness, confusion that persist beyond 12 weeks after an initial COVID infection) remains a significant unmet need."
        },
        {
          "label": "OBJECTIVE",
          "text": "To test evidence-based rehabilitation strategies for improving cognitive symptoms in persons with long COVID."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a 5-arm, multicenter, randomized clinical trial of 3 remotely delivered interventions conducted between August 17, 2023, and June 10, 2024. The study took place at 22 trial sites and included the screening of individuals with cognitive long COVID."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized to 1 of 5 arms: adaptive computerized cognitive training (BrainHQ [Posit Science]), cognitive-behavioral rehabilitation involving both group and individual counseling sessions (PASC-Cognitive Recovery [PASC-CoRE]) paired with BrainHQ, and transcranial direct current stimulation (tDCS) paired with BrainHQ. Two comparator arms were included as follows: unstructured computer puzzles and games (active comparator) and sham tDCS paired with BrainHQ. The interventions occurred 5 times per week over 10 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Cognitive and behavioral in-person assessments were performed at baseline, midintervention, at the end of intervention, and 3 months after the end of the intervention. The primary outcome measure was the modified Everyday Cognition Scale 2 (ECog2) completed at the end of the intervention compared to the baseline visit based on participant self-report looking back over the prior 7 days."
        },
        {
          "label": "RESULTS",
          "text": "A total of 378 individuals were screened, from which there were 328 participants (median [IQR] age, 48.0 [37.0-58.0] years; 241 female [73.5%]; race: 15 Asian [4.6%], 47 Black [14.3%], and 235 White [71.6%]; ethnicity: 52 Hispanic [15.9%]). None of the 3 active interventions demonstrated benefits on the modified ECog2 in the intention-to-treat population by the end of the intervention period. The adjusted differences in mean change were 0.0 (95% CI, -0.2 to 0.2) for BrainHQ vs active comparator, 0.1 (95% CI, -0.1 to 0.3) for PASC-CoRE + BrainHQ vs active comparator, 0.0 (95% CI, -0.2 to 0.2) for tDCS-active + BrainHQ vs tDCS-sham + BrainHQ, and 0.1 (95% CI, -0.1 to 0.3) for PASC-CoRE + BrainHQ vs BrainHQ alone. Secondary participant-reported outcomes and neuropsychological tests showed no differential benefits for any treatment arm. All 5 arms demonstrated some improvements over time on the modified ECog2 and on secondary outcomes. There were no serious adverse events attributable to the interventions."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This phase 2 randomized clinical trial failed to demonstrate differential benefits for online cognitive training, a structured cognitive rehabilitation program, and tDCS for cognitive long COVID."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05965739."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212544/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1001/jamaneurol.2025.4415",
      "dateReceived": "2025-11-28T23:25:07.665Z",
      "isNew": false,
      "summary": "Online cognitive training, structured cognitive rehabilitation, and tDCS did not show different cognitive benefits for long COVID in this trial."
    },
    {
      "id": "6c0ef06b5172",
      "title": "Colchicine for the secondary prevention of cardiovascular events.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49117264/118212",
      "abstract": "People with cardiovascular disease are at risk of recurrent major adverse cardiovascular events, and chronic low-grade inflammation may be a major underlying factor. Treatment with low-dose colchicine has been proposed for the secondary prevention of cardiovascular events in individuals at high cardiovascular risk. A previous Cochrane review showed considerable uncertainty regarding the benefits and harms of this approach. To evaluate the benefits and harms of low-dose colchicine in the prevention of cardiovascular events in adults with a history of stable CVD or following myocardial infarction or stroke. We conducted a comprehensive search of the literature until February 2025 using Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, EMBASE, the drugs@FDA database, references of key papers, and references of included studies. Randomised controlled trials (RCTs) comparing the use of low-dose colchicine for a minimum of six months versus any control intervention in patients of any age with cardiovascular disease (i.e. history of stable cardiovascular disease, previous myocardial infarction or stroke). Our critical outcomes were all-cause mortality, myocardial infarction, and serious adverse events. Our important outcomes were cardiovascular mortality, stroke, all-cause hospitalisations, coronary revascularisation (percutaneous coronary intervention (PCI)/angioplasty or coronary artery bypass graft (CABG)), quality of life, and gastrointestinal adverse events (i.e. diarrhoea, nausea, abdominal pain, or vomiting). Two authors independently assessed the risk of bias using the Cochrane RoB2 tool. We conducted meta-analyses using the random-effects model. We generated forest plots to facilitate visualisation of the data. We did not perform any subgroup analysis. We used GRADE to assess the certainty of evidence for all critical outcomes and for cardiovascular mortality, stroke, and coronary revascularisation. This was carried out by two review authors working independently. We included 12 studies involving 22,983 randomised participants. The follow-up in the studies ranged from 6 to 80 months. Overall, 11,524 participants were assigned to low-dose colchicine treatment and 11,459 were assigned to a control intervention, which constituted either usual care plus placebo or usual care only. The doses of colchicine used were 0.5 mg once or twice daily. At baseline, the mean age of participants ranged from 57 to 74 years. Most participants (79.4%) were male. There is high-certainty evidence that low-dose colchicine treatment reduces the risk of myocardial infarction, with a risk ratio (RR) of 0.74 (95% confidence interval (CI) 0.57 to 0.96; 22,153 participants, 8 studies; I = 51%), yielding an absolute risk reduction of 9 fewer events (95% CI 16 fewer to 2 fewer) per 1000 patients, when the myocardial infarction rate is about 4% (36 events per 1000 patients) in the control group. There is also high-certainty evidence that low-dose colchicine reduces the risk of stroke with a RR of 0.67 (95% CI 0.47 to 0.95; 22,483 participants, 10 studies; I = 40%), yielding an absolute risk reduction of 8 fewer events (95% CI 12 fewer to 1 fewer) per 1000 patients, when the stroke rate is about 2% (22 events per 1000 patients) in the control group. There is high-certainty evidence that the use of low-dose colchicine does not increase the rate of serious adverse events (RR 0.98, 95% CI 0.94 to 1.02; 15,677 participants, 4 studies; I = 0%). However, gastrointestinal adverse events were more common under treatment with colchicine (RR 1.68, 95% CI 1.11 to 2.57; 22,185 participants, 10 studies; I = 91%). For all other outcomes assessed, the evidence is of moderate certainty. Colchicine probably results in little to no difference in all-cause mortality (RR 1.01, 95% CI 0.84 to 1.21; 22,747 participants, 10 studies; I = 1%; moderate-certainty evidence), in cardiovascular mortality (RR 0.94, 95% CI 0.73 to 1.22; 22,271 participants; 8 studies; I = 13%; moderate-certainty evidence), and coronary revascularisation (RR 0.83, 95% CI 0.64 to 1.08; 13,705 participants, 5 studies; I = 40%; moderate-certainty evidence). There is no evidence about the benefits or harms of colchicine on quality-of-life or on the risk of all-cause hospitalisation. People with cardiovascular disease using low-dose colchicine as secondary prevention for at least six months benefit from reduced rates of myocardial infarction and stroke, without an increase in serious adverse events. Moderate-certainty evidence did not show a benefit from low-dose colchicine for the risk of mortality (i.e. all-cause and cardiovascular mortality) or coronary revascularisation rates. Colchicine use was associated with an increased risk of gastrointestinal adverse events, which were typically described as mild and transient in nature. Additional studies are warranted to investigate the benefits and harms of low-dose colchicine in relevant subgroups and in specific indications, such as long-term use in individuals with stable coronary artery disease versus limited-time use following acute coronary syndrome. Review author FE was supported by the Margot und Erich Goldschmidt & Peter René Jacobson Foundation. Review author CMS was supported by the Janggen Pöhn Foundation and the Swiss National Science Foundation (MD-PhD grant Number: 323530_221860). This review is based on its protocol, which is available via DOI 10.1002/14651858.CD014808, and a previous review, which is available via DOI 10.1002/14651858.CD011047.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "People with cardiovascular disease are at risk of recurrent major adverse cardiovascular events, and chronic low-grade inflammation may be a major underlying factor. Treatment with low-dose colchicine has been proposed for the secondary prevention of cardiovascular events in individuals at high cardiovascular risk. A previous Cochrane review showed considerable uncertainty regarding the benefits and harms of this approach."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the benefits and harms of low-dose colchicine in the prevention of cardiovascular events in adults with a history of stable CVD or following myocardial infarction or stroke."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We conducted a comprehensive search of the literature until February 2025 using Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, EMBASE, the drugs@FDA database, references of key papers, and references of included studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials (RCTs) comparing the use of low-dose colchicine for a minimum of six months versus any control intervention in patients of any age with cardiovascular disease (i.e. history of stable cardiovascular disease, previous myocardial infarction or stroke)."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality, myocardial infarction, and serious adverse events. Our important outcomes were cardiovascular mortality, stroke, all-cause hospitalisations, coronary revascularisation (percutaneous coronary intervention (PCI)/angioplasty or coronary artery bypass graft (CABG)), quality of life, and gastrointestinal adverse events (i.e. diarrhoea, nausea, abdominal pain, or vomiting)."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two authors independently assessed the risk of bias using the Cochrane RoB2 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We conducted meta-analyses using the random-effects model. We generated forest plots to facilitate visualisation of the data. We did not perform any subgroup analysis. We used GRADE to assess the certainty of evidence for all critical outcomes and for cardiovascular mortality, stroke, and coronary revascularisation. This was carried out by two review authors working independently."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 12 studies involving 22,983 randomised participants. The follow-up in the studies ranged from 6 to 80 months. Overall, 11,524 participants were assigned to low-dose colchicine treatment and 11,459 were assigned to a control intervention, which constituted either usual care plus placebo or usual care only. The doses of colchicine used were 0.5 mg once or twice daily. At baseline, the mean age of participants ranged from 57 to 74 years. Most participants (79.4%) were male."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "There is high-certainty evidence that low-dose colchicine treatment reduces the risk of myocardial infarction, with a risk ratio (RR) of 0.74 (95% confidence interval (CI) 0.57 to 0.96; 22,153 participants, 8 studies; I = 51%), yielding an absolute risk reduction of 9 fewer events (95% CI 16 fewer to 2 fewer) per 1000 patients, when the myocardial infarction rate is about 4% (36 events per 1000 patients) in the control group. There is also high-certainty evidence that low-dose colchicine reduces the risk of stroke with a RR of 0.67 (95% CI 0.47 to 0.95; 22,483 participants, 10 studies; I = 40%), yielding an absolute risk reduction of 8 fewer events (95% CI 12 fewer to 1 fewer) per 1000 patients, when the stroke rate is about 2% (22 events per 1000 patients) in the control group. There is high-certainty evidence that the use of low-dose colchicine does not increase the rate of serious adverse events (RR 0.98, 95% CI 0.94 to 1.02; 15,677 participants, 4 studies; I = 0%). However, gastrointestinal adverse events were more common under treatment with colchicine (RR 1.68, 95% CI 1.11 to 2.57; 22,185 participants, 10 studies; I = 91%). For all other outcomes assessed, the evidence is of moderate certainty. Colchicine probably results in little to no difference in all-cause mortality (RR 1.01, 95% CI 0.84 to 1.21; 22,747 participants, 10 studies; I = 1%; moderate-certainty evidence), in cardiovascular mortality (RR 0.94, 95% CI 0.73 to 1.22; 22,271 participants; 8 studies; I = 13%; moderate-certainty evidence), and coronary revascularisation (RR 0.83, 95% CI 0.64 to 1.08; 13,705 participants, 5 studies; I = 40%; moderate-certainty evidence). There is no evidence about the benefits or harms of colchicine on quality-of-life or on the risk of all-cause hospitalisation."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "People with cardiovascular disease using low-dose colchicine as secondary prevention for at least six months benefit from reduced rates of myocardial infarction and stroke, without an increase in serious adverse events. Moderate-certainty evidence did not show a benefit from low-dose colchicine for the risk of mortality (i.e. all-cause and cardiovascular mortality) or coronary revascularisation rates. Colchicine use was associated with an increased risk of gastrointestinal adverse events, which were typically described as mild and transient in nature. Additional studies are warranted to investigate the benefits and harms of low-dose colchicine in relevant subgroups and in specific indications, such as long-term use in individuals with stable coronary artery disease versus limited-time use following acute coronary syndrome."
        },
        {
          "label": "FUNDING",
          "text": "Review author FE was supported by the Margot und Erich Goldschmidt & Peter René Jacobson Foundation. Review author CMS was supported by the Janggen Pöhn Foundation and the Swiss National Science Foundation (MD-PhD grant Number: 323530_221860)."
        },
        {
          "label": "REGISTRATION",
          "text": "This review is based on its protocol, which is available via DOI 10.1002/14651858.CD014808, and a previous review, which is available via DOI 10.1002/14651858.CD011047.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41224205/",
      "pubDate": "2025 Nov 13",
      "doi": "10.1002/14651858.CD014808.pub2",
      "dateReceived": "2025-11-28T23:25:07.664Z",
      "isNew": false,
      "summary": "Low-dose colchicine reduces myocardial infarction and stroke in people with cardiovascular disease using it for at least six months, but does not affect mortality or revascularization, and increases mild gastrointestinal side effects."
    },
    {
      "id": "baa8d5d1bcf5",
      "title": "Effect of Acoramidis on Recurrent and Cumulative Cardiovascular Outcomes in ATTR-CM: Exploratory Analysis From ATTRibute-CM.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49117264/118024",
      "abstract": "Transthyretin (TTR) amyloid cardiomyopathy (ATTR-CM) is a progressive disease with a significant burden of recurrent cardiovascular (CV) events. Acoramidis, an approved oral therapy for ATTR-CM, achieves early, near-complete (≥90%) TTR stabilization. In the phase 3 ATTRibute-CM (Efficacy and Safety of Acoramidis in Participants with Transthyretin Amyloid Cardiomyopathy) study, acoramidis significantly reduced the composite of all-cause mortality or first CV-related hospitalization (CVH), with an effect observed at month 3. Its efficacy on the burden of cumulative CV outcome events has not been reported. This study was a post hoc exploratory recurrent-event analysis of the efficacy of acoramidis on the cumulative incidence of CV outcomes from ATTRibute-CM and its open-label extension. Cumulative incidences of centrally adjudicated CV-related mortality (CVM) or recurrent CVH (first and, if applicable, subsequent CVH), recurrent CVH alone (month 30), and CVM (month 42) were measured in the modified intention-to-treat population (acoramidis, n = 409; placebo, n = 202). Mean cumulative events by treatment, and the difference between treatment groups were estimated by using a modified Andersen-Gill model. Acoramidis significantly reduced the cumulative risk of CVM or recurrent CVH through month 30 vs placebo (HR: 0.51; 95% CI: 0.43-0.62; P < 0.0001). A notable proportion of CV outcome events (19% of CVM or recurrent CVH events, 22% of CVH) occurred within the first 6 months. Numerically fewer cumulative events were observed with acoramidis compared with placebo at month 1, and the difference increased progressively, resulting at month 30 in 53 events avoided per 100 treated participants (95% CI: 29-79). At month 42, CVM was reduced with continuous acoramidis vs placebo-to-acoramidis (HR: 0.55; 95% CI: 0.39-0.79; P = 0.0011). The annualized frequency of recurrent CVH was significantly decreased through month 30 (relative risk ratio: 0.50; 95% CI: 0.35-0.69; P < 0.0001). Acoramidis significantly reduced the cumulative burden of CV outcomes in ATTR-CM over 30 months. Numerically fewer events were observed with acoramidis vs placebo by month 1, and the difference increased progressively over time, resulting in 53 events avoided per 100 treated patients at month 30. Almost one-fourth of the cumulative CV events occurred within the first 6 months. These exploratory findings suggest that cumulative event burden may occur early, highlighting the importance of timely evaluation, diagnosis and treatment in ATTR-CM.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Transthyretin (TTR) amyloid cardiomyopathy (ATTR-CM) is a progressive disease with a significant burden of recurrent cardiovascular (CV) events. Acoramidis, an approved oral therapy for ATTR-CM, achieves early, near-complete (≥90%) TTR stabilization. In the phase 3 ATTRibute-CM (Efficacy and Safety of Acoramidis in Participants with Transthyretin Amyloid Cardiomyopathy) study, acoramidis significantly reduced the composite of all-cause mortality or first CV-related hospitalization (CVH), with an effect observed at month 3. Its efficacy on the burden of cumulative CV outcome events has not been reported."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study was a post hoc exploratory recurrent-event analysis of the efficacy of acoramidis on the cumulative incidence of CV outcomes from ATTRibute-CM and its open-label extension."
        },
        {
          "label": "METHODS",
          "text": "Cumulative incidences of centrally adjudicated CV-related mortality (CVM) or recurrent CVH (first and, if applicable, subsequent CVH), recurrent CVH alone (month 30), and CVM (month 42) were measured in the modified intention-to-treat population (acoramidis, n = 409; placebo, n = 202). Mean cumulative events by treatment, and the difference between treatment groups were estimated by using a modified Andersen-Gill model."
        },
        {
          "label": "RESULTS",
          "text": "Acoramidis significantly reduced the cumulative risk of CVM or recurrent CVH through month 30 vs placebo (HR: 0.51; 95% CI: 0.43-0.62; P < 0.0001). A notable proportion of CV outcome events (19% of CVM or recurrent CVH events, 22% of CVH) occurred within the first 6 months. Numerically fewer cumulative events were observed with acoramidis compared with placebo at month 1, and the difference increased progressively, resulting at month 30 in 53 events avoided per 100 treated participants (95% CI: 29-79). At month 42, CVM was reduced with continuous acoramidis vs placebo-to-acoramidis (HR: 0.55; 95% CI: 0.39-0.79; P = 0.0011). The annualized frequency of recurrent CVH was significantly decreased through month 30 (relative risk ratio: 0.50; 95% CI: 0.35-0.69; P < 0.0001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Acoramidis significantly reduced the cumulative burden of CV outcomes in ATTR-CM over 30 months. Numerically fewer events were observed with acoramidis vs placebo by month 1, and the difference increased progressively over time, resulting in 53 events avoided per 100 treated patients at month 30. Almost one-fourth of the cumulative CV events occurred within the first 6 months. These exploratory findings suggest that cumulative event burden may occur early, highlighting the importance of timely evaluation, diagnosis and treatment in ATTR-CM."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41143759/",
      "pubDate": "2025 Sep 28",
      "doi": "10.1016/j.jacc.2025.09.013",
      "dateReceived": "2025-11-28T23:25:07.664Z",
      "isNew": false,
      "summary": "Acoramidis treatment in ATTR-CM patients significantly reduced the long-term accumulation of cardiovascular events."
    },
    {
      "id": "4d210195585d",
      "title": "A Multicomponent Intervention to Improve Maternal Infection Outcomes.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49105789/118200",
      "abstract": "Maternal infection and sepsis are major causes of maternal death and severe illness worldwide, particularly in low- and middle-income countries. Inconsistent implementation of evidence-based recommendations for infection prevention and management and delays in detection and treatment of maternal sepsis contribute to the number of preventable deaths. We conducted a cluster-randomized trial to assess a multicomponent intervention, the Active Prevention and Treatment of Maternal Sepsis (APT-Sepsis) program. This program was designed to support health care providers in achieving three goals: adherence to World Health Organization (WHO) hand-hygiene standards; adoption of evidence-based practices for maternal infection prevention and management; and early detection of sepsis and use of the FAST-M (fluids, antibiotics, source control, transfer if required, and monitoring) treatment bundle. Usual care was provided in the control group, along with dissemination of guidelines. The primary outcome was a composite of infection-related maternal death, infection-related near-miss event (events in which women survived a life-threatening complication), or severe infection-related illness (deep surgical-site, deep perineal, or body-cavity infection) among women who were pregnant or had recently been pregnant. We randomly assigned 59 health facilities (where 431,394 women gave birth during the trial) in Malawi and Uganda to the intervention group (30 clusters) or the usual-care group (29 clusters). A primary-outcome event occurred in 1.4% of the patients in the intervention group and in 1.9% of those in the usual-care group (risk ratio, 0.68; 95% confidence interval, 0.55 to 0.83; P<0.001). This effect was generally consistent between countries and among facilities of difference sizes and was sustained over time. Implementation of the APT-Sepsis program led to a significantly lower risk of a composite of infection-related maternal death, infection-related near-miss event, or severe infection-related illness than usual care. (Funded by the Joint Global Health Trials scheme and others; APT-Sepsis ISRCTN number, ISRCTN42347014.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Maternal infection and sepsis are major causes of maternal death and severe illness worldwide, particularly in low- and middle-income countries. Inconsistent implementation of evidence-based recommendations for infection prevention and management and delays in detection and treatment of maternal sepsis contribute to the number of preventable deaths."
        },
        {
          "label": "METHODS",
          "text": "We conducted a cluster-randomized trial to assess a multicomponent intervention, the Active Prevention and Treatment of Maternal Sepsis (APT-Sepsis) program. This program was designed to support health care providers in achieving three goals: adherence to World Health Organization (WHO) hand-hygiene standards; adoption of evidence-based practices for maternal infection prevention and management; and early detection of sepsis and use of the FAST-M (fluids, antibiotics, source control, transfer if required, and monitoring) treatment bundle. Usual care was provided in the control group, along with dissemination of guidelines. The primary outcome was a composite of infection-related maternal death, infection-related near-miss event (events in which women survived a life-threatening complication), or severe infection-related illness (deep surgical-site, deep perineal, or body-cavity infection) among women who were pregnant or had recently been pregnant."
        },
        {
          "label": "RESULTS",
          "text": "We randomly assigned 59 health facilities (where 431,394 women gave birth during the trial) in Malawi and Uganda to the intervention group (30 clusters) or the usual-care group (29 clusters). A primary-outcome event occurred in 1.4% of the patients in the intervention group and in 1.9% of those in the usual-care group (risk ratio, 0.68; 95% confidence interval, 0.55 to 0.83; P<0.001). This effect was generally consistent between countries and among facilities of difference sizes and was sustained over time."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Implementation of the APT-Sepsis program led to a significantly lower risk of a composite of infection-related maternal death, infection-related near-miss event, or severe infection-related illness than usual care. (Funded by the Joint Global Health Trials scheme and others; APT-Sepsis ISRCTN number, ISRCTN42347014.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41259754/",
      "pubDate": "2025 Nov 19",
      "doi": "10.1056/NEJMoa2512698",
      "dateReceived": "2025-11-27T23:25:43.563Z",
      "isNew": false,
      "summary": "The APT-Sepsis program significantly reduced the risk of serious infection-related complications and death in mothers compared to standard care."
    },
    {
      "id": "c0a24bccff9e",
      "title": "The ANTICIPATE-NASH Models Stratify Better the Risk of Clinical Events Than Histology in Metabolic Dysfunction-Associated Steatotic Liver Disease Patients With Advanced Chronic Liver Disease.",
      "journal": "Gastroenterology",
      "score": "7/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49090042/118207",
      "abstract": "The reference for risk stratification and clinical trial selection of metabolic dysfunction-associated steatotic liver disease (MASLD) patients is fibrosis degree by histology. The noninvasive ANTICIPATE-NASH models have been validated for risk prediction of clinically significant portal hypertension (CSPH) and liver-related events (LRE). We assessed whether these models provide better risk stratification of events than histology. A multicenter cohort 1, including 699 biopsy specimen-proven F3-F4 patients with MASLD was evaluated. The end point was LRE (hepatic decompensation, hepatocellular carcinoma, transplantation, or liver-related death). We assessed (Cox regression) whether histology provided added value to ANTICIPATE-NASH and whether model predictions differed in F3/F4 patients. Results were validated in cohort 2 (1396 F3-F4 patients) from 4 clinical trials using the clinical regulatory end point. In cohort 1, F3 and F4 were equally distributed. There were 56 LREs (8.0%) during follow-up, concentrated in F4 (51 LREs). The ANTICIPATE-NASH model showed excellent discrimination (C statistic, 0.93) for LRE, higher than histology (C statistic, 0.67). Model calibration was excellent. Adding histology did not improve model prediction. Thresholds of ANTICIPATE-NASH above which F3 patients developed LREs and below which F4 patients did not were identified. Results were reproduced in cohort 2 with the regulatory end point, with higher model discrimination (C statistic, 0.84) compared with histology (C statistic, 0.64). In MASLD patients with F3/F4, the noninvasive ANTICIPATE-NASH models provide better risk stratification of clinical events than histologic classification. These models could be very useful for clinical trials by selecting patients at risk of clinical events and patients with higher chances of observed cirrhosis regression.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "The reference for risk stratification and clinical trial selection of metabolic dysfunction-associated steatotic liver disease (MASLD) patients is fibrosis degree by histology. The noninvasive ANTICIPATE-NASH models have been validated for risk prediction of clinically significant portal hypertension (CSPH) and liver-related events (LRE). We assessed whether these models provide better risk stratification of events than histology."
        },
        {
          "label": "METHODS",
          "text": "A multicenter cohort 1, including 699 biopsy specimen-proven F3-F4 patients with MASLD was evaluated. The end point was LRE (hepatic decompensation, hepatocellular carcinoma, transplantation, or liver-related death). We assessed (Cox regression) whether histology provided added value to ANTICIPATE-NASH and whether model predictions differed in F3/F4 patients. Results were validated in cohort 2 (1396 F3-F4 patients) from 4 clinical trials using the clinical regulatory end point."
        },
        {
          "label": "RESULTS",
          "text": "In cohort 1, F3 and F4 were equally distributed. There were 56 LREs (8.0%) during follow-up, concentrated in F4 (51 LREs). The ANTICIPATE-NASH model showed excellent discrimination (C statistic, 0.93) for LRE, higher than histology (C statistic, 0.67). Model calibration was excellent. Adding histology did not improve model prediction. Thresholds of ANTICIPATE-NASH above which F3 patients developed LREs and below which F4 patients did not were identified. Results were reproduced in cohort 2 with the regulatory end point, with higher model discrimination (C statistic, 0.84) compared with histology (C statistic, 0.64)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In MASLD patients with F3/F4, the noninvasive ANTICIPATE-NASH models provide better risk stratification of clinical events than histologic classification. These models could be very useful for clinical trials by selecting patients at risk of clinical events and patients with higher chances of observed cirrhosis regression."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212130/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1053/j.gastro.2025.08.020",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "In patients with advanced MASLD, noninvasive ANTICIPATE-NASH models are superior to liver biopsy for predicting clinical outcomes."
    },
    {
      "id": "14bbfb082526",
      "title": "Ketogenic Diets and Depression and Anxiety: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118163",
      "abstract": "Ketogenic diets (KDs) have been hypothesized to influence mental health through pathways involving mitochondrial function, inflammation, and neurotransmitters, but their therapeutic value in psychiatric populations remains uncertain. To assess the associations between KDs and mental health outcomes in adults, with a focus on depressive and anxiety symptoms. MEDLINE, Embase, and APA PsycINFO were searched on April 18, 2025. Additional studies were identified through manual searches and clinical trial registries. Studies involving adults aged 18 years or older receiving a KD (<26% energy from carbohydrates or <50 g/day) and assessed with validated psychiatric scales were eligible. Designs included randomized clinical trials (RCTs), quasi-experimental (QSE) studies, cross-sectional studies, case series, and case reports. Data were extracted by 1 reviewer and verified by 2 others. Risk of bias was assessed using critical appraisal tools from the Joanna Briggs Institute. Random-effects meta-analyses were run separately for RCTs and QSEs. The primary outcome was changes in psychiatric symptom severity measured by standardized scales, reported as standardized mean differences (SMDs) or standardized mean change using change scores (SMCCs). A total of 50 studies (41 718 participants) were included. Ten RCTs on KD for depressive symptoms vs control diets showed a significant association (SMD, -0.48; 95% CI, -0.87 to -0.10; I2 = 67.2%), with stronger associations in studies using ketone monitoring, nonobese participants, very low-carbohydrate interventions, and non-high-carbohydrate comparators. Nine RCTs on anxiety showed no significant association (SMD, -0.03; 95% CI, -0.18 to 0.12; I2 = 41%). In QSEs, 9 on depressive symptoms showed a consistent association (SMCC, -0.66; 95% CI, -0.83 to -0.50; I2 = 0%), and 6 on anxiety showed similar results (SMCC, -0.58; 95% CI, -0.81 to -0.36; I2 = 0%). In this systematic review and meta-analysis, KDs were associated with modest improvements in depressive symptoms, particularly with biochemical ketosis verification, while anxiety evidence was inconclusive. Given heterogeneity, comparators, and short follow-up, well-powered trials with standardized, verified protocols, structured support, and prespecified outcomes are needed to confirm efficacy and durability.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Ketogenic diets (KDs) have been hypothesized to influence mental health through pathways involving mitochondrial function, inflammation, and neurotransmitters, but their therapeutic value in psychiatric populations remains uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the associations between KDs and mental health outcomes in adults, with a focus on depressive and anxiety symptoms."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, and APA PsycINFO were searched on April 18, 2025. Additional studies were identified through manual searches and clinical trial registries."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Studies involving adults aged 18 years or older receiving a KD (<26% energy from carbohydrates or <50 g/day) and assessed with validated psychiatric scales were eligible. Designs included randomized clinical trials (RCTs), quasi-experimental (QSE) studies, cross-sectional studies, case series, and case reports."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Data were extracted by 1 reviewer and verified by 2 others. Risk of bias was assessed using critical appraisal tools from the Joanna Briggs Institute. Random-effects meta-analyses were run separately for RCTs and QSEs."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was changes in psychiatric symptom severity measured by standardized scales, reported as standardized mean differences (SMDs) or standardized mean change using change scores (SMCCs)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 50 studies (41 718 participants) were included. Ten RCTs on KD for depressive symptoms vs control diets showed a significant association (SMD, -0.48; 95% CI, -0.87 to -0.10; I2 = 67.2%), with stronger associations in studies using ketone monitoring, nonobese participants, very low-carbohydrate interventions, and non-high-carbohydrate comparators. Nine RCTs on anxiety showed no significant association (SMD, -0.03; 95% CI, -0.18 to 0.12; I2 = 41%). In QSEs, 9 on depressive symptoms showed a consistent association (SMCC, -0.66; 95% CI, -0.83 to -0.50; I2 = 0%), and 6 on anxiety showed similar results (SMCC, -0.58; 95% CI, -0.81 to -0.36; I2 = 0%)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis, KDs were associated with modest improvements in depressive symptoms, particularly with biochemical ketosis verification, while anxiety evidence was inconclusive. Given heterogeneity, comparators, and short follow-up, well-powered trials with standardized, verified protocols, structured support, and prespecified outcomes are needed to confirm efficacy and durability."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41191382/",
      "pubDate": "2025 Nov 05",
      "doi": "10.1001/jamapsychiatry.2025.3261",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "Ketogenic diets showed small improvements in depression symptoms when ketosis was confirmed, but the effect on anxiety was uncertain, and more research is needed."
    },
    {
      "id": "d981e930fa7f",
      "title": "Lifestyle Intervention for Sustained Remission of Metabolic Syndrome: A Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118141",
      "abstract": "Prevalence of metabolic syndrome (MetS) defined as 3 or more cardiometabolic risk factors has grown to 43% among US adults. Lifestyle interventions produce benefits, but with limited sustainability. To determine whether a 6-month habit-based lifestyle program adds benefit to education and activity monitoring for sustained MetS remission at 24 months. The Enhancing Lifestyles in Metabolic Syndrome (ELM) study was a single-blind, individually randomized clinical trial of participants with MetS recruited from July 2019 to January 2022 at 5 locations in the US and followed up for 24 months. Eligible participants were motivated for lifestyle change and were contacted using electronic medical records and social or mass media; those who did not meet medical or logistical criteria were excluded. In all, 14 817 adults were screened during a 2.5 year period. Data were analyzed from March 2024 to May 2025. All participants received education and an activity monitor. Those in the intervention group also received 19 small group in-person meetings during 6 months, which sought to establish the following habits as part of their daily routine: vegetables at meals, brisk walks, sensory awareness, and emotion regulation. Repetition of these habits was encouraged by attention to participants' experience of immediate benefits and peer support. The comparator group received 24 evidence-based educational mailings monthly during the 24 months. MetS remission at 24 months determined by blinded laboratory evaluation and clinical examination. Secondary outcomes were cardiometabolic and lifestyle risk factors at 6 and 24 months. The analysis included 618 participants (mean [SD] age, 55.5 [11.0] years; 468 female [74.7%] and 150 male [24.3%] individuals), of whom 306 (49.5%) were randomized to the intervention and 312 (50.5%) to the comparator. The 24-month follow-up period was completed by 517 participants (83.7%). Obesity, measured by body mass index, was present in 513 participants (83%). At 6 months, the proportion achieving MetS remission was 24.8% in intervention group and 17.9% in comparator (adjusted odds ratio, 1.64; 95% CI, 1.07-2.53; P = .03), supported by improvements in waist circumference, triglycerides, fasting glucose, body mass index, weight, hemoglobin A1c, MetS severity, perceived stress, vegetable intake, moderate-intensity physical activity, daily steps, sensory awareness, and the habits of daily brisk walks and vegetables at meals. At 24 months, the proportion achieving sustained MetS remission was 27.8% (85 of 306 participants) in intervention group and 21.2% (66 of 312) in the comparator (adjusted odds ratio, 1.46; 95% CI, 1.01-2.14; P < .05), supported by sustained improvement in fasting glucose, vegetable intake, daily steps, sensory awareness, and the habit of daily brisk walks. This randomized clinical trial found that sustained MetS remission after treatment may be possible by promoting simple habits through a behavior-based lifestyle program focused on immediate benefits. ClinicalTrials.gov Identifier: NCT04036006.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Prevalence of metabolic syndrome (MetS) defined as 3 or more cardiometabolic risk factors has grown to 43% among US adults. Lifestyle interventions produce benefits, but with limited sustainability."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether a 6-month habit-based lifestyle program adds benefit to education and activity monitoring for sustained MetS remission at 24 months."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The Enhancing Lifestyles in Metabolic Syndrome (ELM) study was a single-blind, individually randomized clinical trial of participants with MetS recruited from July 2019 to January 2022 at 5 locations in the US and followed up for 24 months. Eligible participants were motivated for lifestyle change and were contacted using electronic medical records and social or mass media; those who did not meet medical or logistical criteria were excluded. In all, 14 817 adults were screened during a 2.5 year period. Data were analyzed from March 2024 to May 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "All participants received education and an activity monitor. Those in the intervention group also received 19 small group in-person meetings during 6 months, which sought to establish the following habits as part of their daily routine: vegetables at meals, brisk walks, sensory awareness, and emotion regulation. Repetition of these habits was encouraged by attention to participants' experience of immediate benefits and peer support. The comparator group received 24 evidence-based educational mailings monthly during the 24 months."
        },
        {
          "label": "MAIN OUTCOME AND MEASURES",
          "text": "MetS remission at 24 months determined by blinded laboratory evaluation and clinical examination. Secondary outcomes were cardiometabolic and lifestyle risk factors at 6 and 24 months."
        },
        {
          "label": "RESULTS",
          "text": "The analysis included 618 participants (mean [SD] age, 55.5 [11.0] years; 468 female [74.7%] and 150 male [24.3%] individuals), of whom 306 (49.5%) were randomized to the intervention and 312 (50.5%) to the comparator. The 24-month follow-up period was completed by 517 participants (83.7%). Obesity, measured by body mass index, was present in 513 participants (83%). At 6 months, the proportion achieving MetS remission was 24.8% in intervention group and 17.9% in comparator (adjusted odds ratio, 1.64; 95% CI, 1.07-2.53; P = .03), supported by improvements in waist circumference, triglycerides, fasting glucose, body mass index, weight, hemoglobin A1c, MetS severity, perceived stress, vegetable intake, moderate-intensity physical activity, daily steps, sensory awareness, and the habits of daily brisk walks and vegetables at meals. At 24 months, the proportion achieving sustained MetS remission was 27.8% (85 of 306 participants) in intervention group and 21.2% (66 of 312) in the comparator (adjusted odds ratio, 1.46; 95% CI, 1.01-2.14; P < .05), supported by sustained improvement in fasting glucose, vegetable intake, daily steps, sensory awareness, and the habit of daily brisk walks."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial found that sustained MetS remission after treatment may be possible by promoting simple habits through a behavior-based lifestyle program focused on immediate benefits."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04036006."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41207299/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jamainternmed.2025.5900",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "A behavior-based lifestyle program emphasizing immediate benefits can lead to sustained remission of metabolic syndrome."
    },
    {
      "id": "339ca3c122cd",
      "title": "Semaglutide for adults living with obesity.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118132",
      "abstract": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity. To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity. We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024. We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months. Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities. We used the original version of the Cochrane tool for assessing risk of bias (RoB 1). We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo. We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing. Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity. World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the original version of the Cochrane tool for assessing risk of bias (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity."
        },
        {
          "label": "FUNDING",
          "text": "World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161687/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1002/14651858.CD016018",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "Tirzepatide appears to cause weight loss that lasts over time, but its effects on other health outcomes and the reliability of the evidence are uncertain, and more independent research is needed."
    },
    {
      "id": "b84921a098b8",
      "title": "Olezarsen for Managing Severe Hypertriglyceridemia and Pancreatitis Risk.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118124",
      "abstract": "Patients with severe hypertriglyceridemia have an increased risk of acute pancreatitis. The efficacy and safety of olezarsen, an antisense oligonucleotide targeting apolipoprotein C-III messenger RNA, have not been established in this population. We conducted two double-blind, randomized, placebo-controlled trials (CORE-TIMI 72a and CORE2-TIMI 72b). Patients with severe hypertriglyceridemia were assigned in a 1:1:1 ratio to receive olezarsen at a dose of 50 mg, olezarsen at a dose of 80 mg, or placebo monthly for 12 months. The primary outcome was the percent change from baseline in the triglyceride level at 6 months, reported as the difference between each olezarsen dose group and the placebo group (placebo-adjusted change). Secondary lipid outcomes included the percent change from baseline in the triglyceride level at 12 months and in the levels of apolipoprotein C-III, remnant cholesterol, and non-high-density lipoprotein (non-HDL) cholesterol at 6 months and 12 months. Acute pancreatitis events were assessed across both trials. A total of 1061 patients were included in the primary analysis (617 in the CORE-TIMI 72a trial and 444 in the CORE2-TIMI 72b trial). At 6 months, the placebo-adjusted least-squares mean change from baseline in the triglyceride level was -62.9 percentage points in the olezarsen 50-mg group and -72.2 percentage points in the olezarsen 80-mg group in the CORE-TIMI 72a trial and was -49.2 percentage points in the olezarsen 50-mg group and -54.5 percentage points in the olezarsen 80-mg group in the CORE2-TIMI 72b trial (P<0.001 for all comparisons of olezarsen with placebo). Decreases in the levels of triglycerides, apolipoprotein C-III, remnant cholesterol, and non-HDL cholesterol were greater with olezarsen than with placebo (P<0.001 for all comparisons). The incidence of acute pancreatitis was lower with olezarsen than with placebo (mean rate ratio, 0.15; 95% confidence interval, 0.05 to 0.40; P<0.001). The incidence of any adverse events appeared to be similar across trial groups. Elevations in liver-enzyme levels and thrombocytopenia (platelet count, <100,000 per microliter) were more common with the 80-mg dose of olezarsen, and a dose-dependent increase in the hepatic fat fraction was noted. Among patients with severe hypertriglyceridemia, treatment with olezarsen led to a significantly greater reduction in the triglyceride level at 6 months and in the incidence of acute pancreatitis than placebo. (Funded by Ionis Pharmaceuticals; CORE-TIMI 72a and CORE2-TIMI 72b ClinicalTrials.gov numbers, NCT05079919 and NCT05552326.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients with severe hypertriglyceridemia have an increased risk of acute pancreatitis. The efficacy and safety of olezarsen, an antisense oligonucleotide targeting apolipoprotein C-III messenger RNA, have not been established in this population."
        },
        {
          "label": "METHODS",
          "text": "We conducted two double-blind, randomized, placebo-controlled trials (CORE-TIMI 72a and CORE2-TIMI 72b). Patients with severe hypertriglyceridemia were assigned in a 1:1:1 ratio to receive olezarsen at a dose of 50 mg, olezarsen at a dose of 80 mg, or placebo monthly for 12 months. The primary outcome was the percent change from baseline in the triglyceride level at 6 months, reported as the difference between each olezarsen dose group and the placebo group (placebo-adjusted change). Secondary lipid outcomes included the percent change from baseline in the triglyceride level at 12 months and in the levels of apolipoprotein C-III, remnant cholesterol, and non-high-density lipoprotein (non-HDL) cholesterol at 6 months and 12 months. Acute pancreatitis events were assessed across both trials."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1061 patients were included in the primary analysis (617 in the CORE-TIMI 72a trial and 444 in the CORE2-TIMI 72b trial). At 6 months, the placebo-adjusted least-squares mean change from baseline in the triglyceride level was -62.9 percentage points in the olezarsen 50-mg group and -72.2 percentage points in the olezarsen 80-mg group in the CORE-TIMI 72a trial and was -49.2 percentage points in the olezarsen 50-mg group and -54.5 percentage points in the olezarsen 80-mg group in the CORE2-TIMI 72b trial (P<0.001 for all comparisons of olezarsen with placebo). Decreases in the levels of triglycerides, apolipoprotein C-III, remnant cholesterol, and non-HDL cholesterol were greater with olezarsen than with placebo (P<0.001 for all comparisons). The incidence of acute pancreatitis was lower with olezarsen than with placebo (mean rate ratio, 0.15; 95% confidence interval, 0.05 to 0.40; P<0.001). The incidence of any adverse events appeared to be similar across trial groups. Elevations in liver-enzyme levels and thrombocytopenia (platelet count, <100,000 per microliter) were more common with the 80-mg dose of olezarsen, and a dose-dependent increase in the hepatic fat fraction was noted."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with severe hypertriglyceridemia, treatment with olezarsen led to a significantly greater reduction in the triglyceride level at 6 months and in the incidence of acute pancreatitis than placebo. (Funded by Ionis Pharmaceuticals; CORE-TIMI 72a and CORE2-TIMI 72b ClinicalTrials.gov numbers, NCT05079919 and NCT05552326.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211918/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2512761",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "Olezarsen effectively lowered triglyceride levels and reduced acute pancreatitis risk in patients with severe hypertriglyceridemia compared to a placebo."
    },
    {
      "id": "ac3b5bea5c23",
      "title": "Beta-Blockers after Myocardial Infarction with Normal Ejection Fraction.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118122",
      "abstract": "The benefit of beta-blockers after myocardial infarction in patients with a preserved left ventricular ejection fraction (LVEF) is unclear. We conducted a meta-analysis at the individual-patient level using data from five open-label trials that randomly assigned patients with recent myocardial infarction, no other indications for beta-blocker therapy, and an LVEF of at least 50% to receive beta-blocker therapy or no beta-blocker therapy. The primary end point was a composite of death from any cause, myocardial infarction, or heart failure. Event rates were analyzed with a one-stage fixed-effects Cox proportional-hazards model. A total of 17,801 patients were included from the REBOOT (7459 patients), REDUCE-AMI (4967 patients), BETAMI (2441 patients), DANBLOCK (2277 patients), and CAPITAL-RCT (657 patients) trials. Of these 17,801 patients, 8831 (49.6%) were assigned to receive a beta-blocker and 8970 (50.4%) were assigned to receive no beta-blocker. During a median follow-up of 3.6 years (interquartile range, 2.3 to 4.6), a primary-end-point event occurred in 717 patients (8.1%) in the beta-blocker group and 748 patients (8.3%) in the no-beta-blocker group (hazard ratio, 0.97; 95% confidence interval [CI], 0.87 to 1.07; P = 0.54). Death from any cause occurred in 335 patients in the beta-blocker group and 326 patients in the no-beta-blocker group (hazard ratio, 1.04; 95% CI, 0.89 to 1.21); myocardial infarction occurred in 360 and 407 patients, respectively (hazard ratio, 0.89; 95% CI, 0.77 to 1.03); and heart failure occurred in 75 and 87 patients (hazard ratio, 0.87; 95% CI, 0.64 to 1.19). In this meta-analysis including individual-patient data from five randomized trials, beta-blocker therapy did not reduce the incidence of death from any cause, myocardial infarction, or heart failure in patients with an LVEF of at least 50% after myocardial infarction without other indications for beta-blockers. (Funded by Centro Nacional de Investigaciones Cardiovasculares Carlos III and others; PROSPERO database number, CRD420251119176.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The benefit of beta-blockers after myocardial infarction in patients with a preserved left ventricular ejection fraction (LVEF) is unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted a meta-analysis at the individual-patient level using data from five open-label trials that randomly assigned patients with recent myocardial infarction, no other indications for beta-blocker therapy, and an LVEF of at least 50% to receive beta-blocker therapy or no beta-blocker therapy. The primary end point was a composite of death from any cause, myocardial infarction, or heart failure. Event rates were analyzed with a one-stage fixed-effects Cox proportional-hazards model."
        },
        {
          "label": "RESULTS",
          "text": "A total of 17,801 patients were included from the REBOOT (7459 patients), REDUCE-AMI (4967 patients), BETAMI (2441 patients), DANBLOCK (2277 patients), and CAPITAL-RCT (657 patients) trials. Of these 17,801 patients, 8831 (49.6%) were assigned to receive a beta-blocker and 8970 (50.4%) were assigned to receive no beta-blocker. During a median follow-up of 3.6 years (interquartile range, 2.3 to 4.6), a primary-end-point event occurred in 717 patients (8.1%) in the beta-blocker group and 748 patients (8.3%) in the no-beta-blocker group (hazard ratio, 0.97; 95% confidence interval [CI], 0.87 to 1.07; P = 0.54). Death from any cause occurred in 335 patients in the beta-blocker group and 326 patients in the no-beta-blocker group (hazard ratio, 1.04; 95% CI, 0.89 to 1.21); myocardial infarction occurred in 360 and 407 patients, respectively (hazard ratio, 0.89; 95% CI, 0.77 to 1.03); and heart failure occurred in 75 and 87 patients (hazard ratio, 0.87; 95% CI, 0.64 to 1.19)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this meta-analysis including individual-patient data from five randomized trials, beta-blocker therapy did not reduce the incidence of death from any cause, myocardial infarction, or heart failure in patients with an LVEF of at least 50% after myocardial infarction without other indications for beta-blockers. (Funded by Centro Nacional de Investigaciones Cardiovasculares Carlos III and others; PROSPERO database number, CRD420251119176.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211954/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1056/NEJMoa2512686",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "Beta-blocker therapy did not improve outcomes in patients with a preserved ejection fraction (LVEF ≥50%) after a heart attack without other reasons to take beta-blockers."
    },
    {
      "id": "17609b1f03eb",
      "title": "Oral Icotrokinra for Plaque Psoriasis in Adults and Adolescents.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118090",
      "abstract": "Icotrokinra, a targeted oral peptide that selectively binds the interleukin-23 receptor, is under investigation for the treatment of plaque psoriasis. We conducted a phase 3, double-blind, randomized, placebo-controlled trial involving adults and adolescents (≥12 years of age) with moderate-to-severe plaque psoriasis, as defined by all the following: a total body-surface area of psoriasis involvement of at least 10%, a Psoriasis Area and Severity Index (PASI) score of at least 12 (range, 0 to 72, with higher scores indicating a greater extent or severity of psoriasis), and an Investigator's Global Assessment (IGA) score of at least 3 (range, 0 [clear skin] to 4 [severe disease]). Participants were assigned in a 2:1 ratio to receive icotrokinra at a dose of 200 mg once daily through week 24 or placebo through week 16 followed by transition to icotrokinra. The coprimary end points were an IGA 0/1 response (IGA score of 0 or 1 with ≥2-point reduction from baseline) and a PASI 90 response (≥90% reduction from baseline in the PASI score) at week 16. A total of 684 participants underwent randomization (456 to the icotrokinra group and 228 to the placebo group). At week 16, a total of 65% of the participants receiving icotrokinra and 8% of those receiving placebo had an IGA 0/1 response, and 50% and 4%, respectively, had a PASI 90 response (P<0.001 for both comparisons). Complete clearance of skin at week 16 was significantly more likely with icotrokinra than with placebo (IGA score of 0, 33% vs. 1%; PASI 100 response [100% reduction from baseline in the PASI score], 27% vs. <1%; P<0.001 for both comparisons). The percentage of participants with at least one adverse event through week 16 was 49% in each group; the most common adverse events in each group were nasopharyngitis and upper respiratory tract infection. The exposure-adjusted incidence of adverse events was consistent through week 24. Selective blockade of the interleukin-23 receptor with the targeted oral peptide icotrokinra resulted in a significantly higher incidence of skin clearance at week 16 than placebo among adults and adolescents with moderate-to-severe plaque psoriasis. Longer-term data will provide a more complete understanding of the benefit-risk profile of icotrokinra. (Funded by Johnson & Johnson; ICONIC-LEAD ClinicalTrials.gov number, NCT06095115.)See also in : Targeted Oral Peptide Icotrokinra for Psoriasis Involving High‑Impact Sites.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Icotrokinra, a targeted oral peptide that selectively binds the interleukin-23 receptor, is under investigation for the treatment of plaque psoriasis."
        },
        {
          "label": "METHODS",
          "text": "We conducted a phase 3, double-blind, randomized, placebo-controlled trial involving adults and adolescents (≥12 years of age) with moderate-to-severe plaque psoriasis, as defined by all the following: a total body-surface area of psoriasis involvement of at least 10%, a Psoriasis Area and Severity Index (PASI) score of at least 12 (range, 0 to 72, with higher scores indicating a greater extent or severity of psoriasis), and an Investigator's Global Assessment (IGA) score of at least 3 (range, 0 [clear skin] to 4 [severe disease]). Participants were assigned in a 2:1 ratio to receive icotrokinra at a dose of 200 mg once daily through week 24 or placebo through week 16 followed by transition to icotrokinra. The coprimary end points were an IGA 0/1 response (IGA score of 0 or 1 with ≥2-point reduction from baseline) and a PASI 90 response (≥90% reduction from baseline in the PASI score) at week 16."
        },
        {
          "label": "RESULTS",
          "text": "A total of 684 participants underwent randomization (456 to the icotrokinra group and 228 to the placebo group). At week 16, a total of 65% of the participants receiving icotrokinra and 8% of those receiving placebo had an IGA 0/1 response, and 50% and 4%, respectively, had a PASI 90 response (P<0.001 for both comparisons). Complete clearance of skin at week 16 was significantly more likely with icotrokinra than with placebo (IGA score of 0, 33% vs. 1%; PASI 100 response [100% reduction from baseline in the PASI score], 27% vs. <1%; P<0.001 for both comparisons). The percentage of participants with at least one adverse event through week 16 was 49% in each group; the most common adverse events in each group were nasopharyngitis and upper respiratory tract infection. The exposure-adjusted incidence of adverse events was consistent through week 24."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Selective blockade of the interleukin-23 receptor with the targeted oral peptide icotrokinra resulted in a significantly higher incidence of skin clearance at week 16 than placebo among adults and adolescents with moderate-to-severe plaque psoriasis. Longer-term data will provide a more complete understanding of the benefit-risk profile of icotrokinra. (Funded by Johnson & Johnson; ICONIC-LEAD ClinicalTrials.gov number, NCT06095115.)See also in : Targeted Oral Peptide Icotrokinra for Psoriasis Involving High‑Impact Sites."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41191940/",
      "pubDate": "2025 Nov 06",
      "doi": "10.1056/NEJMoa2504187",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "Icotrokinra, a selective interleukin-23 receptor blocker, demonstrated significantly improved skin clearance compared to placebo in adults and adolescents with moderate-to-severe plaque psoriasis at 16 weeks."
    },
    {
      "id": "0ef71c8aa274",
      "title": "Diabetic Foot Ulcer Beyond Wound Closure: Clinical Practice Guideline.",
      "journal": "Phys Ther",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118082",
      "abstract": "A total of 37.3 million Americans have diabetes, and 96 million more have prediabetes. Hyperglycemia, the hallmark of diabetes, increases the risk for diabetes-related complications, including skin breakdown and cardiovascular disease. Many clinical practice guidelines exist, but there are gaps regarding the best approaches to assess physical fitness and mobility in adults with diabetes; incorporate exercise into the care plan; and reload the diabetic foot after ulcer closure has occurred to avoid ulcer reoccurrence. The purpose of this clinical practice guideline was to review and assess previously published guidelines and address gaps within the guidelines specific to the following: best screening tools/tests and interventions to prevent a future reulceration, best screening tools and interventions to assess and address mobility impairments, best tools to measure and interventions to address reduced physical fitness and activity, best approach to reloading the foot after ulceration closure and, finally, whether improvement in physical fitness will positively change quality of life and health care costs. The Guidelines Development Group performed a systematic literature search and review of the literature. A total of 701 studies were identified. Following duplicate removal and exclusion for irrelevance, 125 studies underwent full-text review, and 38 studies were included. Recommendations were developed using a software assistant created specifically for guideline recommendation development. Recommendations resulted for physical fitness and activity inclusion and measurement for adults with diabetes and with or without foot ulceration. Exercise and physical activity should be prescribed according to the physiologic response of an adult with diabetes to exercise and preferences for optimizing long-term quality of life and reduce health care costs. Reloading following diabetic foot ulcer closure should include maximal offloading, especially during the first 3 months; loading should be titrated using a footwear schedule. Further research is necessary in the areas of exercise in the wound healing process and the assessment of methods to reload a newly reepithelialized ulcer to prevent recurrence.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/39574416/",
      "pubDate": "2025 Jan 08",
      "doi": "10.1093/ptj/pzae171",
      "dateReceived": "2025-11-26T23:25:52.444Z",
      "isNew": false,
      "summary": "Exercise and physical activity should be tailored to the individual's physiological response and preferences to improve long-term quality of life and reduce healthcare costs, and reloading the foot after ulcer closure requires maximal offloading, particularly in the initial three months."
    },
    {
      "id": "8d4d6126ad71",
      "title": "Cognitive Behavior Therapy With and Without Narrative Assessment and Suicide Attempts: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49090042/118222",
      "abstract": "There is currently no evidence-based method to identify the forces that may drive someone to attempt suicide. To examine whether cognitive behavior therapy (CBT) interventions that incorporate a narrative assessment are associated with a greater reduction in suicide attempts than comparable interventions without this component. Studies were identified through version 25.0.1 of the Metapsy Suicide Prevention Database, which includes randomized clinical trials published up to April 2025 retrieved through PubMed, Embase, Web of Science, Scopus, and Cochrane Central, including unpublished studies and references from relevant articles. Included studies were randomized clinical trials of CBT interventions reporting suicide attempts as an outcome. Studies using waiting list controls, reporting only suicidal ideation, or lacking information on the type of assessment used were excluded. Two reviewers independently extracted data and assessed risk of bias using the Cochrane Risk of Bias 2 tool. Meta-analyses were conducted using 3-level models with robust variance estimation. Relative risks (RRs) were pooled using the Mantel-Haenszel method. Analyses followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guidelines. Data were pooled using a random-effects model. The primary outcome was the incidence of suicide attempts. Interventions were grouped by presence or absence of a narrative assessment component. Twenty-three studies with 3262 participants met inclusion criteria. CBT interventions including a narrative assessment were associated with a significantly reduced risk of suicide attempt compared with controls (RR, 0.68; 95% CI, 0.53-0.87; 1764 participants across 14 studies), whereas CBT interventions without this component were not associated with risk of suicide attempt (RR, 1.17; 95% CI, 0.63-2.20; 1498 participants across 9 studies). Subgroup comparison indicated a significant difference between groups (Q1 = 7.27; P = .007; I2 = 86%). Studies without a narrative assessment had significantly younger participants, a lower event rate, and slightly higher risk of bias. In this systematic review and meta-analysis, CBT interventions including a narrative assessment were associated with a reduced risk of suicide attempt, while CBT without this component did not have an association with risk of suicide attempt. Age differences between study populations may partly explain this finding, as interventions in younger populations often show smaller and more inconsistent effect sizes. These results suggest that a narrative assessment may be a simple and effective way to capture the forces that lead to suicide attempts and to direct interventions toward their prevention. Causal conclusions require direct head-to-head trials.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There is currently no evidence-based method to identify the forces that may drive someone to attempt suicide."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine whether cognitive behavior therapy (CBT) interventions that incorporate a narrative assessment are associated with a greater reduction in suicide attempts than comparable interventions without this component."
        },
        {
          "label": "DATA SOURCES",
          "text": "Studies were identified through version 25.0.1 of the Metapsy Suicide Prevention Database, which includes randomized clinical trials published up to April 2025 retrieved through PubMed, Embase, Web of Science, Scopus, and Cochrane Central, including unpublished studies and references from relevant articles."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Included studies were randomized clinical trials of CBT interventions reporting suicide attempts as an outcome. Studies using waiting list controls, reporting only suicidal ideation, or lacking information on the type of assessment used were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers independently extracted data and assessed risk of bias using the Cochrane Risk of Bias 2 tool. Meta-analyses were conducted using 3-level models with robust variance estimation. Relative risks (RRs) were pooled using the Mantel-Haenszel method. Analyses followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guidelines. Data were pooled using a random-effects model."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the incidence of suicide attempts. Interventions were grouped by presence or absence of a narrative assessment component."
        },
        {
          "label": "RESULTS",
          "text": "Twenty-three studies with 3262 participants met inclusion criteria. CBT interventions including a narrative assessment were associated with a significantly reduced risk of suicide attempt compared with controls (RR, 0.68; 95% CI, 0.53-0.87; 1764 participants across 14 studies), whereas CBT interventions without this component were not associated with risk of suicide attempt (RR, 1.17; 95% CI, 0.63-2.20; 1498 participants across 9 studies). Subgroup comparison indicated a significant difference between groups (Q1 = 7.27; P = .007; I2 = 86%). Studies without a narrative assessment had significantly younger participants, a lower event rate, and slightly higher risk of bias."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis, CBT interventions including a narrative assessment were associated with a reduced risk of suicide attempt, while CBT without this component did not have an association with risk of suicide attempt. Age differences between study populations may partly explain this finding, as interventions in younger populations often show smaller and more inconsistent effect sizes. These results suggest that a narrative assessment may be a simple and effective way to capture the forces that lead to suicide attempts and to direct interventions toward their prevention. Causal conclusions require direct head-to-head trials."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41264269/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.44632",
      "dateReceived": "2025-11-26T23:25:52.443Z",
      "isNew": false,
      "summary": "CBT interventions incorporating narrative assessment were associated with a reduced risk of suicide attempts, unlike CBT without this component."
    },
    {
      "id": "1abc0e7a2825",
      "title": "Effects of SGLT2 inhibitors across the spectrum of albuminuria in cardiovascular-kidney-metabolic conditions: A pooled analysis of randomised trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49090042/118214",
      "abstract": "Albuminuria is associated with an increased risk of cardiovascular and kidney events. Sodium glucose co-transporter 2 inhibitors (SGLT2i) reduce albuminuria and improve kidney outcomes in patients with albuminuric chronic kidney disease (CKD). Patients with low- or without albuminuria have been underrepresented in randomised clinical trials (RCTs), and the effects of SGLT2i on cardiovascular and kidney outcomes across the full range of albuminuria require further investigation. To study the effects of SGLT2i on kidney and cardiovascular outcomes across albuminuria levels in populations with different cardiovascular-kidney-metabolic (CKM) risk. Individual-patient data pooled analysis of RCTs across the CKM spectrum. Outcomes were studied across urinary albumin-to-creatinine ratio (UACR) both as categorical and continuous variables using survival and mixed effects models. A total of 26 750 patients were included. The median (pct) baseline UACR was 28 (8-240) mg/g: 13 669 (51.1%) had UACR <30 mg/g, 6904 (25.8%) UACR 30-300 mg/g, and 6177 (23.1%) UACR >300 mg/g. Compared to patients with lower UACR, those with higher UACR were younger, with a more frequent history of hypertension, diabetes, and obesity, and lower eGFR. UACR was linearly associated with kidney and cardiovascular outcomes as well as mortality. Compared to placebo, SGLT2i reduced the risk of kidney events, HF hospitalisations, atherothrombotic events, cardiovascular and all-cause mortality across the full UACR spectrum (Pinteraction >0.1 for all outcomes). Compared to placebo, SGLT2i reduced albuminuria levels by 13%, on average: gMratio 0.87, 95%CI 0.85-0.88, p < 0.001. Higher albuminuria was associated with an increased risk of cardiovascular and kidney outcomes. SGLT2i improved cardiovascular and kidney outcomes across the full range of albuminuria, including normo-albuminuria.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Albuminuria is associated with an increased risk of cardiovascular and kidney events. Sodium glucose co-transporter 2 inhibitors (SGLT2i) reduce albuminuria and improve kidney outcomes in patients with albuminuric chronic kidney disease (CKD). Patients with low- or without albuminuria have been underrepresented in randomised clinical trials (RCTs), and the effects of SGLT2i on cardiovascular and kidney outcomes across the full range of albuminuria require further investigation."
        },
        {
          "label": "AIMS",
          "text": "To study the effects of SGLT2i on kidney and cardiovascular outcomes across albuminuria levels in populations with different cardiovascular-kidney-metabolic (CKM) risk."
        },
        {
          "label": "METHODS",
          "text": "Individual-patient data pooled analysis of RCTs across the CKM spectrum. Outcomes were studied across urinary albumin-to-creatinine ratio (UACR) both as categorical and continuous variables using survival and mixed effects models."
        },
        {
          "label": "RESULTS",
          "text": "A total of 26 750 patients were included. The median (pct) baseline UACR was 28 (8-240) mg/g: 13 669 (51.1%) had UACR <30 mg/g, 6904 (25.8%) UACR 30-300 mg/g, and 6177 (23.1%) UACR >300 mg/g. Compared to patients with lower UACR, those with higher UACR were younger, with a more frequent history of hypertension, diabetes, and obesity, and lower eGFR. UACR was linearly associated with kidney and cardiovascular outcomes as well as mortality. Compared to placebo, SGLT2i reduced the risk of kidney events, HF hospitalisations, atherothrombotic events, cardiovascular and all-cause mortality across the full UACR spectrum (Pinteraction >0.1 for all outcomes). Compared to placebo, SGLT2i reduced albuminuria levels by 13%, on average: gMratio 0.87, 95%CI 0.85-0.88, p < 0.001."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Higher albuminuria was associated with an increased risk of cardiovascular and kidney outcomes. SGLT2i improved cardiovascular and kidney outcomes across the full range of albuminuria, including normo-albuminuria."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208574/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70289",
      "dateReceived": "2025-11-26T23:25:52.443Z",
      "isNew": false,
      "summary": "Increased albuminuria is linked to worse cardiovascular and kidney health, but SGLT2 inhibitors improve outcomes regardless of albuminuria levels."
    },
    {
      "id": "2d9b11fe674e",
      "title": "Efficacy, Immunogenicity, and Safety of Modified mRNA Influenza Vaccine.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118201",
      "abstract": "Influenza remains a major health burden despite the use of licensed vaccines. Nucleoside-modified messenger RNA (modRNA) influenza vaccines have shown promising immunogenicity against influenza and an acceptable safety profile in a phase 1-2 trial. In this phase 3 trial, we randomly assigned healthy adults between the ages of 18 and 64 years to receive either a quadrivalent modRNA influenza vaccine (modRNA group) or a licensed inactivated quadrivalent influenza vaccine (control group) during the 2022-2023 influenza season in the United States, South Africa, and the Philippines. The primary end point was relative efficacy, defined by the reduction in the percentage of participants with laboratory-confirmed influenza associated with influenza-like illness at least 14 days after vaccination with the modRNA vaccine, as compared with the control vaccine, and analyzed for noninferiority and superiority. Immunogenicity was evaluated by means of a hemagglutination inhibition (HAI) assay. We assessed reactogenicity within 7 days after vaccination, adverse events through 1 month, and serious adverse events through 6 months. We assessed vaccine efficacy, immunogenicity, and safety in the modRNA group. A total of 18,476 participants underwent randomization: 9225 were assigned to receive the modRNA vaccine and 9251 to receive the control vaccine. The relative efficacy of the modRNA vaccine as compared with the control vaccine against influenza-like illness was 34.5% (95% confidence interval [CI], 7.4 to 53.9) on the basis of 57 cases in the modRNA group and 87 cases in the control group, a finding that met the criteria for both noninferiority and superiority. Cases of influenza-like illness were caused by A/H3N2 and A/H1N1 strains but almost no B strains. The noninferiority of the antibody response on HAI assay was shown for influenza A strains but not for B strains. Primarily mild or moderate reactogenicity was observed in both vaccine groups but was reported more frequently in the modRNA group (overall local reactions, 70.1% vs. 43.1%; overall systemic events, 65.8% vs. 48.7%). Fever occurred in 5.6% of the participants in the modRNA group and in 1.7% of those in the control group. Adverse event profiles were similar in the two groups. The modRNA vaccine had statistically superior efficacy over the control vaccine, with greater immune responses to A/H3N2 and A/H1N1 strains, but was associated with more reactogenicity events. (Funded by Pfizer; C4781004 ClinicalTrials.gov number, NCT05540522.)See also in : Human clinical trial of a nucleoside-modified mRNA influenza vaccine.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Influenza remains a major health burden despite the use of licensed vaccines. Nucleoside-modified messenger RNA (modRNA) influenza vaccines have shown promising immunogenicity against influenza and an acceptable safety profile in a phase 1-2 trial."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3 trial, we randomly assigned healthy adults between the ages of 18 and 64 years to receive either a quadrivalent modRNA influenza vaccine (modRNA group) or a licensed inactivated quadrivalent influenza vaccine (control group) during the 2022-2023 influenza season in the United States, South Africa, and the Philippines. The primary end point was relative efficacy, defined by the reduction in the percentage of participants with laboratory-confirmed influenza associated with influenza-like illness at least 14 days after vaccination with the modRNA vaccine, as compared with the control vaccine, and analyzed for noninferiority and superiority. Immunogenicity was evaluated by means of a hemagglutination inhibition (HAI) assay. We assessed reactogenicity within 7 days after vaccination, adverse events through 1 month, and serious adverse events through 6 months. We assessed vaccine efficacy, immunogenicity, and safety in the modRNA group."
        },
        {
          "label": "RESULTS",
          "text": "A total of 18,476 participants underwent randomization: 9225 were assigned to receive the modRNA vaccine and 9251 to receive the control vaccine. The relative efficacy of the modRNA vaccine as compared with the control vaccine against influenza-like illness was 34.5% (95% confidence interval [CI], 7.4 to 53.9) on the basis of 57 cases in the modRNA group and 87 cases in the control group, a finding that met the criteria for both noninferiority and superiority. Cases of influenza-like illness were caused by A/H3N2 and A/H1N1 strains but almost no B strains. The noninferiority of the antibody response on HAI assay was shown for influenza A strains but not for B strains. Primarily mild or moderate reactogenicity was observed in both vaccine groups but was reported more frequently in the modRNA group (overall local reactions, 70.1% vs. 43.1%; overall systemic events, 65.8% vs. 48.7%). Fever occurred in 5.6% of the participants in the modRNA group and in 1.7% of those in the control group. Adverse event profiles were similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The modRNA vaccine had statistically superior efficacy over the control vaccine, with greater immune responses to A/H3N2 and A/H1N1 strains, but was associated with more reactogenicity events. (Funded by Pfizer; C4781004 ClinicalTrials.gov number, NCT05540522.)See also in : Human clinical trial of a nucleoside-modified mRNA influenza vaccine."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41259756/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1056/NEJMoa2416779",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "The modRNA influenza vaccine demonstrated higher efficacy and immune responses compared to the control vaccine, but also caused more adverse reactions."
    },
    {
      "id": "823834fec055",
      "title": "Does Time to Achieve a Targeted Body Temperature Matter for Survivors of Cardiac Arrest? A Systematic Review and Meta-Analysis.",
      "journal": "Crit Care Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118197",
      "abstract": "To identify the impact of early hypothermic temperature control (HTC) initiation and achievement on neurologic outcomes after cardiac arrest. Secondary endpoints assessed: 1) overall survival, 2) body temperature at hospital admission, 3) time taken to reach targeted temperature, and 4) adverse events. Subgroup analyses assessed: 1) HTC induction method, 2) presenting rhythms (shockable vs. nonshockable), and 3) timing of HTC initiation (during cardiopulmonary resuscitation [CPR] vs. post-return of spontaneous circulation [ROSC]). PubMed, Cochrane Library, U.S. National Library of Medicine, MedRxiv, BioRxiv. Prospective randomized controlled trials enrolling comatose adult cardiac arrest patients that assessed the efficacy of early cooling (defined by initiation of HTC within 30 min of ROSC) against late cooling. Two reviewers independently conducted study selection, data extraction, and assessment of evidence quality. Full texts were jointly reviewed, with discrepancies resolved by a third reviewer through discussion and consensus. Of 7269 citations, 11 met the inclusion criteria. Early cooling did not improve neurologic outcomes (risk ratio [RR], 1.01; 95% CI, 0.94-1.14) nor survival (RR, 1.01; 95% CI, 0.92-1.11). Nasal evaporative cooling initiated during resuscitation may benefit patients with shockable rhythms (RR, 1.40; 95% CI, 1.00-1.96), while administering cold fluid during CPR was associated with a higher risk of rearrest. Cooling was initiated in the prehospital phase in ten studies, nine of which failed to achieve target temperature (32-34°C) by hospital admission. The median time to reach target temperature ranged from 38 to 360 minutes. Early HTC showed no neurologic nor survival benefit in cardiac arrest survivors. Nasal evaporative cooling during CPR may benefit those with shockable rhythms. Delays in reaching the target temperature may underlie the failure of HTC. Future studies should evaluate whether achieving target temperature, for example, within 30 minutes, rapidly improves outcomes.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To identify the impact of early hypothermic temperature control (HTC) initiation and achievement on neurologic outcomes after cardiac arrest. Secondary endpoints assessed: 1) overall survival, 2) body temperature at hospital admission, 3) time taken to reach targeted temperature, and 4) adverse events. Subgroup analyses assessed: 1) HTC induction method, 2) presenting rhythms (shockable vs. nonshockable), and 3) timing of HTC initiation (during cardiopulmonary resuscitation [CPR] vs. post-return of spontaneous circulation [ROSC])."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, Cochrane Library, U.S. National Library of Medicine, MedRxiv, BioRxiv."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Prospective randomized controlled trials enrolling comatose adult cardiac arrest patients that assessed the efficacy of early cooling (defined by initiation of HTC within 30 min of ROSC) against late cooling."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Two reviewers independently conducted study selection, data extraction, and assessment of evidence quality. Full texts were jointly reviewed, with discrepancies resolved by a third reviewer through discussion and consensus."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Of 7269 citations, 11 met the inclusion criteria. Early cooling did not improve neurologic outcomes (risk ratio [RR], 1.01; 95% CI, 0.94-1.14) nor survival (RR, 1.01; 95% CI, 0.92-1.11). Nasal evaporative cooling initiated during resuscitation may benefit patients with shockable rhythms (RR, 1.40; 95% CI, 1.00-1.96), while administering cold fluid during CPR was associated with a higher risk of rearrest. Cooling was initiated in the prehospital phase in ten studies, nine of which failed to achieve target temperature (32-34°C) by hospital admission. The median time to reach target temperature ranged from 38 to 360 minutes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Early HTC showed no neurologic nor survival benefit in cardiac arrest survivors. Nasal evaporative cooling during CPR may benefit those with shockable rhythms. Delays in reaching the target temperature may underlie the failure of HTC. Future studies should evaluate whether achieving target temperature, for example, within 30 minutes, rapidly improves outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41217361/",
      "pubDate": "2025 Nov 11",
      "doi": "10.1097/CCM.0000000000006964",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Early therapeutic hypothermia did not improve neurological outcomes or survival in cardiac arrest survivors, but rapid cooling during CPR, especially for shockable rhythms, may be beneficial."
    },
    {
      "id": "94b2b752d875",
      "title": "Major Bleeding With Apixaban vs Aspirin: A Subanalysis of the ARTESiA Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118155",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false
    },
    {
      "id": "a779b7d23355",
      "title": "Optimal Dose of Aerobic Exercise Programs to Reduce Pain Intensity and Improve Health Status in Patients With Fibromyalgia: A Dose-Response Meta-Analysis.",
      "journal": "Phys Ther",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118147",
      "abstract": "The purpose of this study was to examine the dose-response relationship between aerobic exercise programs and changes in pain intensity and health status in patients with fibromyalgia. Data sources for this study were PubMed, PEDro, Google Scholar, and EBSCO from inception until February 9, 2024. Randomized controlled trials (RCTs) of aerobic exercise in patients with a clinical diagnosis of fibromyalgia were included. Outcome measures were pain intensity (Visual Analog Scale) and health status (Fibromyalgia Impact Questionnaire (FIQ)). The dose-response relationship was evaluated using a restricted cubic spline model. Twenty-three RCTs were included. The meta-analysis showed a significant improvement in pain intensity and functional status. A minimum dose of 50 min per week standardized mean difference (SMD = -0.67; 95% CI = -0.70 to -0.65) and a total duration of 600 min (SMD = -0.65; 95% CI = -0.69 to -0.62) were estimated to effectively reduce pain intensity. The maximum effect was achieved with 90 min per week (SMD = -1.14; 95% CI = -1.19 to -1.09) and 1200 min total duration (SMD = -1.08; 95%CI = -1.13 to -1.02). Additionally, a minimum dose of 65 min per week (SMD = -0.62; 95% CI = -0.6 to -0.69) and a total duration of 950 min (SMD = -0.61; 95% CI = -0.60 to -0.67) were estimated to effectively reduce the FIQ score. While the maximum effect was obtained with 150 min per week (SMD = -1.77; 95% CI = -1.89 to -1.65) and 3000 min of total duration (SMD = -1.43; 95% CI = -1.54 to -1.31). These findings may be useful in optimizing the minimal dose of aerobic exercise to achieve health improvements in people with fibromyalgia.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "The purpose of this study was to examine the dose-response relationship between aerobic exercise programs and changes in pain intensity and health status in patients with fibromyalgia."
        },
        {
          "label": "DATA SOURCES",
          "text": "Data sources for this study were PubMed, PEDro, Google Scholar, and EBSCO from inception until February 9, 2024."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Randomized controlled trials (RCTs) of aerobic exercise in patients with a clinical diagnosis of fibromyalgia were included."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Outcome measures were pain intensity (Visual Analog Scale) and health status (Fibromyalgia Impact Questionnaire (FIQ)). The dose-response relationship was evaluated using a restricted cubic spline model."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Twenty-three RCTs were included. The meta-analysis showed a significant improvement in pain intensity and functional status. A minimum dose of 50 min per week standardized mean difference (SMD = -0.67; 95% CI = -0.70 to -0.65) and a total duration of 600 min (SMD = -0.65; 95% CI = -0.69 to -0.62) were estimated to effectively reduce pain intensity. The maximum effect was achieved with 90 min per week (SMD = -1.14; 95% CI = -1.19 to -1.09) and 1200 min total duration (SMD = -1.08; 95%CI = -1.13 to -1.02). Additionally, a minimum dose of 65 min per week (SMD = -0.62; 95% CI = -0.6 to -0.69) and a total duration of 950 min (SMD = -0.61; 95% CI = -0.60 to -0.67) were estimated to effectively reduce the FIQ score. While the maximum effect was obtained with 150 min per week (SMD = -1.77; 95% CI = -1.89 to -1.65) and 3000 min of total duration (SMD = -1.43; 95% CI = -1.54 to -1.31)."
        },
        {
          "label": "CONCLUSION",
          "text": "These findings may be useful in optimizing the minimal dose of aerobic exercise to achieve health improvements in people with fibromyalgia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40272395/",
      "pubDate": "2025 Jun 02",
      "doi": "10.1093/ptj/pzaf057",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Aerobic exercise can be optimized to achieve health improvements in people with fibromyalgia."
    },
    {
      "id": "a6fb7822f7cb",
      "title": "Stratified treatment of myocardial infarction with non-obstructive coronary arteries: the PROMISE trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118138",
      "abstract": "Myocardial infarction with non-obstructive coronary arteries (MINOCA) is associated with a significant risk of mortality, rehospitalisation, and angina burden. Despite its clinical impact, no randomized clinical trials have hitherto evaluated optimal management strategy for MINOCA. The PROMISE trial was designed to assess whether a stratified treatment improves clinical outcomes in patients with MINOCA as compared to standard care. PROMISE is a multicentre randomised trial. Patients with MINOCA were randomised 1:1 to either a stratified treatment based on a comprehensive diagnostic workup aimed at identifying the underlying aetiology, or to standard care. The primary endpoint was the between-group difference in the change in angina status at 12 months, assessed by the Seattle Angina Questionnaire summary score (SAQSS). The secondary endpoint was the incidence of major adverse cardiovascular events (MACE), defined as the composite of all-cause mortality, myocardial infarction, stroke, heart failure hospitalization and repeated coronary angiography. The trial was terminated early upon recommendation by the Data and Safety Monitoring Board due to clear benefits observed in the intervention group and potential harm in the control group. Of 101 randomized patients, 92 were confirmed as MINOCA and included in the final analysis (mean age 62±13 years, 48% women; stratified treatment n=45; standard care n=47). At 12-month follow-up, SAQSS was significantly higher in the stratified treatment than in standard care group, with a mean between-group difference of +9.38 in favour of the stratified treatment (95% confidence interval 6.81 to 11.95; p<0.001). MACE occurred in 1 patient (2.2%) in the stratified treatment and in 4 patients (8.5%) in the standard care group, though the difference was not statistically significant (p= 0.18). In this first randomized trial of treatment strategies in MINOCA, a stratified treatment, based on comprehensive diagnostic assessment and aetiology-guided therapy, led to a significant improvement in angina-related health status. While the study findings provide the first evidence supporting individualized management in this heterogeneous and often under-recognized patient population, these results require confirmation in a larger prospective study with longer follow-up.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Myocardial infarction with non-obstructive coronary arteries (MINOCA) is associated with a significant risk of mortality, rehospitalisation, and angina burden. Despite its clinical impact, no randomized clinical trials have hitherto evaluated optimal management strategy for MINOCA. The PROMISE trial was designed to assess whether a stratified treatment improves clinical outcomes in patients with MINOCA as compared to standard care."
        },
        {
          "label": "METHODS",
          "text": "PROMISE is a multicentre randomised trial. Patients with MINOCA were randomised 1:1 to either a stratified treatment based on a comprehensive diagnostic workup aimed at identifying the underlying aetiology, or to standard care. The primary endpoint was the between-group difference in the change in angina status at 12 months, assessed by the Seattle Angina Questionnaire summary score (SAQSS). The secondary endpoint was the incidence of major adverse cardiovascular events (MACE), defined as the composite of all-cause mortality, myocardial infarction, stroke, heart failure hospitalization and repeated coronary angiography. The trial was terminated early upon recommendation by the Data and Safety Monitoring Board due to clear benefits observed in the intervention group and potential harm in the control group."
        },
        {
          "label": "RESULTS",
          "text": "Of 101 randomized patients, 92 were confirmed as MINOCA and included in the final analysis (mean age 62±13 years, 48% women; stratified treatment n=45; standard care n=47). At 12-month follow-up, SAQSS was significantly higher in the stratified treatment than in standard care group, with a mean between-group difference of +9.38 in favour of the stratified treatment (95% confidence interval 6.81 to 11.95; p<0.001). MACE occurred in 1 patient (2.2%) in the stratified treatment and in 4 patients (8.5%) in the standard care group, though the difference was not statistically significant (p= 0.18)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this first randomized trial of treatment strategies in MINOCA, a stratified treatment, based on comprehensive diagnostic assessment and aetiology-guided therapy, led to a significant improvement in angina-related health status. While the study findings provide the first evidence supporting individualized management in this heterogeneous and often under-recognized patient population, these results require confirmation in a larger prospective study with longer follow-up."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41150941/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1093/eurheartj/ehaf917",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "A stratified, etiology-guided treatment approach significantly improved angina-related health status in patients with MINOCA."
    },
    {
      "id": "a515536a8222",
      "title": "Maternal paracetamol (acetaminophen) use during pregnancy and risk of autism spectrum disorder and attention deficit/hyperactivity disorder in offspring: umbrella review of systematic reviews.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118115",
      "abstract": "To assess the quality, biases, and validity of evidence on maternal paracetamol (acetaminophen) use during pregnancy and the risk of autism spectrum disorder (referred to as autism) and attention deficit/hyperactivity disorder (ADHD) in offspring. Umbrella review of systematic reviews. Medline, Embase, PsycINFO, and the Cochrane Database of Systematic Reviews, along with grey literature, Epistemonikos, and the reference lists of included studies (inception to 30 September 2025). Systematic reviews of randomised trials and cohort, case-control, or cross sectional studies that reported maternal paracetamol use during pregnancy and the diagnosis of autism or ADHD in offspring. Details of the primary studies included in the reviews are reported, including adjustments for key confounders (maternal characteristics, indication for paracetamol use, and familial factors) and unmeasured confounders and ascertainment of outcomes. Nine reviews (40 studies) reporting on autism (six studies) and ADHD (17 studies) in offspring were included. Four reviews undertook meta-analysis. The overlap of primary studies included in the reviews was very high (corrected covered area 23%). The reviews reported a possible to strong association between maternal paracetamol intake and autism or ADHD or both in offspring. Seven of the nine reviews advised caution when interpreting the findings owing to the potential risk of bias and confounding in the included studies. Confidence in the findings of the reviews was low (two reviews) to critically low (seven reviews) based on the AMSTAR 2 (A MeaSurement Tool to Assess Systematic Reviews) criteria. Only one review included studies (n=2) reporting autism and ADHD in offspring that appropriately adjusted for familial factors and unmeasured confounding through sibling controlled analyses. In both studies, the increased risk of autism in offspring (one study, hazard ratio 1.05, 95% confidence interval 1.02 to 1.08) and ADHD (two studies, 1.07, 1.05 to 1.10 and 2.02, 1.17 to 3.25 ) observed in the whole cohort analyses did not persist in sibling controlled analyses for autism (0.98, 0.93 to 1.04) and ADHD (0.98, 0.94 to 1.02 and 1.06, 0.51 to 2.05). Existing evidence does not clearly link maternal paracetamol use during pregnancy with autism or ADHD in offspring. PROSPERO CRD420251154052.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess the quality, biases, and validity of evidence on maternal paracetamol (acetaminophen) use during pregnancy and the risk of autism spectrum disorder (referred to as autism) and attention deficit/hyperactivity disorder (ADHD) in offspring."
        },
        {
          "label": "DESIGN",
          "text": "Umbrella review of systematic reviews."
        },
        {
          "label": "DATA SOURCES",
          "text": "Medline, Embase, PsycINFO, and the Cochrane Database of Systematic Reviews, along with grey literature, Epistemonikos, and the reference lists of included studies (inception to 30 September 2025)."
        },
        {
          "label": "INCLUSION CRITERIA",
          "text": "Systematic reviews of randomised trials and cohort, case-control, or cross sectional studies that reported maternal paracetamol use during pregnancy and the diagnosis of autism or ADHD in offspring. Details of the primary studies included in the reviews are reported, including adjustments for key confounders (maternal characteristics, indication for paracetamol use, and familial factors) and unmeasured confounders and ascertainment of outcomes."
        },
        {
          "label": "RESULTS",
          "text": "Nine reviews (40 studies) reporting on autism (six studies) and ADHD (17 studies) in offspring were included. Four reviews undertook meta-analysis. The overlap of primary studies included in the reviews was very high (corrected covered area 23%). The reviews reported a possible to strong association between maternal paracetamol intake and autism or ADHD or both in offspring. Seven of the nine reviews advised caution when interpreting the findings owing to the potential risk of bias and confounding in the included studies. Confidence in the findings of the reviews was low (two reviews) to critically low (seven reviews) based on the AMSTAR 2 (A MeaSurement Tool to Assess Systematic Reviews) criteria. Only one review included studies (n=2) reporting autism and ADHD in offspring that appropriately adjusted for familial factors and unmeasured confounding through sibling controlled analyses. In both studies, the increased risk of autism in offspring (one study, hazard ratio 1.05, 95% confidence interval 1.02 to 1.08) and ADHD (two studies, 1.07, 1.05 to 1.10 and 2.02, 1.17 to 3.25 ) observed in the whole cohort analyses did not persist in sibling controlled analyses for autism (0.98, 0.93 to 1.04) and ADHD (0.98, 0.94 to 1.02 and 1.06, 0.51 to 2.05)."
        },
        {
          "label": "CONCLUSION",
          "text": "Existing evidence does not clearly link maternal paracetamol use during pregnancy with autism or ADHD in offspring."
        },
        {
          "label": "SYSTEMATIC REVIEW REGISTRATION",
          "text": "PROSPERO CRD420251154052."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41207796/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1136/bmj-2025-088141",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Current research does not definitively show a connection between a mother taking paracetamol during pregnancy and autism or ADHD in her child."
    },
    {
      "id": "dad8531a2b28",
      "title": "Preconception and first-trimester metformin on pregnancy outcomes in women with polycystic ovary syndrome: a systematic review and meta-analysis.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118149",
      "abstract": "This study aimed to explore the effects of preconception and first-trimester metformin use on pregnancy outcomes in women with polycystic ovary syndrome. MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials were searched from database inception to August 1, 2024. Randomized controlled trials of metformin started before conception and continued at least until a positive pregnancy test compared with either placebo or no treatment in women with polycystic ovary syndrome were included. A systematic review and meta-analysis was conducted. Pooled odds ratios with 95% confidence intervals were calculated for the following key outcomes: miscarriage (primary) and clinical pregnancy and live birth (secondary). The studies were assessed for quality using the Cochrane risk-of-bias tool for randomized trials (RoB 2) and the Grading of Recommendations, Assessment, Development, and Evaluation approach. Indirect comparisons were performed for all key outcomes on the timing of metformin treatment using the Bucher technique. A total of 12 trustworthy studies (involving 1708 women) were included in the meta-analysis, all of which were graded low to moderate quality. Women who received preconception metformin that was continued throughout the first trimester of pregnancy showed higher clinical pregnancy rates (odds ratio, 1.57 [95% confidence interval, 1.11-2.23]), a possible reduction in miscarriage (odds ratio, 0.64 [95% confidence interval, 0.32-1.25]), and possible increase in live birth (odds ratio, 1.24 [95% confidence interval, 0.59-2.61]) than women who received either a placebo or no treatment. Women who stopped metformin once pregnant not only had an increase in clinical pregnancy rate (odds ratio, 1.35 [95% confidence interval, 1.01-1.80]) but also had an indication of an increase in miscarriage rate (odds ratio, 1.46 [95% confidence interval, 0.73-2.90]) compared with those who received a placebo or no treatment. Indirect comparisons between metformin continued through the first trimester of pregnancy and metformin stopped once pregnant consistently demonstrated a trend favoring the continuation of metformin: clinical pregnancy odds ratio of 1.16 (95% confidence interval, 0.74-1.83), miscarriage odds ratio of 0.44 (95% confidence interval, 0.17-1.16), and live birth odds ratio of 1.14 (95% confidence interval, 0.41-3.13). Continuing metformin treatment throughout the first trimester of pregnancy may reduce the risk of miscarriage and increase live birth rates in women with polycystic ovary syndrome. Continuation of metformin seems to have greater clinical benefit than discontinuation of metformin after a positive pregnancy test. There is a need for further high-quality research.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This study aimed to explore the effects of preconception and first-trimester metformin use on pregnancy outcomes in women with polycystic ovary syndrome."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials were searched from database inception to August 1, 2024."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Randomized controlled trials of metformin started before conception and continued at least until a positive pregnancy test compared with either placebo or no treatment in women with polycystic ovary syndrome were included."
        },
        {
          "label": "METHODS",
          "text": "A systematic review and meta-analysis was conducted. Pooled odds ratios with 95% confidence intervals were calculated for the following key outcomes: miscarriage (primary) and clinical pregnancy and live birth (secondary). The studies were assessed for quality using the Cochrane risk-of-bias tool for randomized trials (RoB 2) and the Grading of Recommendations, Assessment, Development, and Evaluation approach. Indirect comparisons were performed for all key outcomes on the timing of metformin treatment using the Bucher technique."
        },
        {
          "label": "RESULTS",
          "text": "A total of 12 trustworthy studies (involving 1708 women) were included in the meta-analysis, all of which were graded low to moderate quality. Women who received preconception metformin that was continued throughout the first trimester of pregnancy showed higher clinical pregnancy rates (odds ratio, 1.57 [95% confidence interval, 1.11-2.23]), a possible reduction in miscarriage (odds ratio, 0.64 [95% confidence interval, 0.32-1.25]), and possible increase in live birth (odds ratio, 1.24 [95% confidence interval, 0.59-2.61]) than women who received either a placebo or no treatment. Women who stopped metformin once pregnant not only had an increase in clinical pregnancy rate (odds ratio, 1.35 [95% confidence interval, 1.01-1.80]) but also had an indication of an increase in miscarriage rate (odds ratio, 1.46 [95% confidence interval, 0.73-2.90]) compared with those who received a placebo or no treatment. Indirect comparisons between metformin continued through the first trimester of pregnancy and metformin stopped once pregnant consistently demonstrated a trend favoring the continuation of metformin: clinical pregnancy odds ratio of 1.16 (95% confidence interval, 0.74-1.83), miscarriage odds ratio of 0.44 (95% confidence interval, 0.17-1.16), and live birth odds ratio of 1.14 (95% confidence interval, 0.41-3.13)."
        },
        {
          "label": "CONCLUSION",
          "text": "Continuing metformin treatment throughout the first trimester of pregnancy may reduce the risk of miscarriage and increase live birth rates in women with polycystic ovary syndrome. Continuation of metformin seems to have greater clinical benefit than discontinuation of metformin after a positive pregnancy test. There is a need for further high-quality research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40473092/",
      "pubDate": "2025 Dec",
      "doi": "10.1016/j.ajog.2025.05.038",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Continuing metformin in early pregnancy for women with polycystic ovary syndrome may decrease miscarriage risk and improve live birth rates compared to stopping it."
    },
    {
      "id": "68ecf5828a70",
      "title": "Tirzepatide for adults living with obesity.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118131",
      "abstract": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity. To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity. We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024. We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months. Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities. We used the original version of the Cochrane tool for assessing risk of bias (RoB 1). We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo. We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing. Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity. World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the original version of the Cochrane tool for assessing risk of bias (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity."
        },
        {
          "label": "FUNDING",
          "text": "World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161687/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1002/14651858.CD016018",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Tirzepatide appears to cause weight loss that is likely maintained over time, but the impact on other health outcomes and the reliability of the evidence are uncertain, and further independent research is needed."
    },
    {
      "id": "50d7115e8453",
      "title": "Efficacy and Safety of Oral PCSK9 Inhibitor Enlicitide in Adults With Heterozygous Familial Hypercholesterolemia: A Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118130",
      "abstract": "Persons with heterozygous familial hypercholesterolemia (HeFH) are at increased risk of atherosclerotic cardiovascular disease due to lifelong elevated levels of low-density lipoprotein cholesterol (LDL-C). Many patients with HeFH do not achieve guideline-recommended LDL-C goals with the currently available lipid-lowering therapies. To evaluate the efficacy of enlicitide decanoate (an oral proprotein convertase subtilisin/kexin type 9 inhibitor) vs placebo in adults with HeFH requiring further lowering of LDL-C levels despite use of statin therapy. This phase 3, randomized clinical trial included persons aged 18 years or older with HeFH currently using lipid-lowering therapy (taking at least a moderate- or high-intensity statin) and either an LDL-C level of 55 mg/dL or greater and a history of major atherosclerotic cardiovascular disease or an LDL-C level of 70 mg/dL or greater without a history of major atherosclerotic cardiovascular disease. The trial was conducted at 59 sites across 17 countries; the first participant was screened on August 8, 2023, and the last follow-up visit occurred on April 7, 2025. Participants were randomized (2:1) to 20 mg of enlicitide (n = 202) or placebo (n = 101) once daily for 52 weeks. The primary outcome was the mean percentage change in LDL-C level at week 24. The secondary outcomes included the mean percentage change in LDL-C level at week 52, the mean percentage change at week 24 in levels of non-high-density lipoprotein cholesterol (non-HDL-C) and apolipoprotein B, and the median percentage change at week 24 in lipoprotein(a). Of the 303 participants (mean age, 52.4 [SD, 13.5] years; 51% were female) randomized, 293 (96.7%) completed the trial. The mean LDL-C level was 119.0 mg/dL (SD, 41.0 mg/dL) at baseline, all had statin current use (81.5% were taking a high-intensity statin), and 64.4% were taking ezetimibe. The mean percentage change in LDL-C level at week 24 was -58.2% in the enlicitide group vs 2.6% in the placebo group (between-group difference, -59.4% [95% CI, -65.6% to -53.2%]; P < .001). The mean percentage change in LDL-C level at week 52 was -55.3% in the enlicitide group vs 8.7% in the placebo group (between-group difference, -61.5% [95% CI, -69.4% to -53.7%]; P < .001). At week 24, the mean percentage change in non-HDL-C level was -52.3% in the enlicitide group vs 2.1% in the placebo group (between-group difference, -53.0% [95% CI, -58.5% to -47.4%]; P < .001), the mean percentage change in apolipoprotein B level was -48.2% vs 1.8%, respectively (between-group difference, -49.1% [95% CI, -54.0% to -44.3%]; P < .001), and the median percentage change in lipoprotein(a) level was -24.7% vs -1.6% (between-group difference, -27.5% [95% CI, -34.3% to -20.6%]; P < .001). The incidence of adverse events, serious adverse events, and study discontinuation due to adverse events was similar between groups. Among adults with HeFH, treatment with enlicitide was well tolerated and significantly reduced levels of LDL-C, apolipoprotein B, non-HDL-C, and lipoprotein(a). ClinicalTrials.gov Identifier: NCT05952869.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Persons with heterozygous familial hypercholesterolemia (HeFH) are at increased risk of atherosclerotic cardiovascular disease due to lifelong elevated levels of low-density lipoprotein cholesterol (LDL-C). Many patients with HeFH do not achieve guideline-recommended LDL-C goals with the currently available lipid-lowering therapies."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the efficacy of enlicitide decanoate (an oral proprotein convertase subtilisin/kexin type 9 inhibitor) vs placebo in adults with HeFH requiring further lowering of LDL-C levels despite use of statin therapy."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This phase 3, randomized clinical trial included persons aged 18 years or older with HeFH currently using lipid-lowering therapy (taking at least a moderate- or high-intensity statin) and either an LDL-C level of 55 mg/dL or greater and a history of major atherosclerotic cardiovascular disease or an LDL-C level of 70 mg/dL or greater without a history of major atherosclerotic cardiovascular disease. The trial was conducted at 59 sites across 17 countries; the first participant was screened on August 8, 2023, and the last follow-up visit occurred on April 7, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized (2:1) to 20 mg of enlicitide (n = 202) or placebo (n = 101) once daily for 52 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the mean percentage change in LDL-C level at week 24. The secondary outcomes included the mean percentage change in LDL-C level at week 52, the mean percentage change at week 24 in levels of non-high-density lipoprotein cholesterol (non-HDL-C) and apolipoprotein B, and the median percentage change at week 24 in lipoprotein(a)."
        },
        {
          "label": "RESULTS",
          "text": "Of the 303 participants (mean age, 52.4 [SD, 13.5] years; 51% were female) randomized, 293 (96.7%) completed the trial. The mean LDL-C level was 119.0 mg/dL (SD, 41.0 mg/dL) at baseline, all had statin current use (81.5% were taking a high-intensity statin), and 64.4% were taking ezetimibe. The mean percentage change in LDL-C level at week 24 was -58.2% in the enlicitide group vs 2.6% in the placebo group (between-group difference, -59.4% [95% CI, -65.6% to -53.2%]; P < .001). The mean percentage change in LDL-C level at week 52 was -55.3% in the enlicitide group vs 8.7% in the placebo group (between-group difference, -61.5% [95% CI, -69.4% to -53.7%]; P < .001). At week 24, the mean percentage change in non-HDL-C level was -52.3% in the enlicitide group vs 2.1% in the placebo group (between-group difference, -53.0% [95% CI, -58.5% to -47.4%]; P < .001), the mean percentage change in apolipoprotein B level was -48.2% vs 1.8%, respectively (between-group difference, -49.1% [95% CI, -54.0% to -44.3%]; P < .001), and the median percentage change in lipoprotein(a) level was -24.7% vs -1.6% (between-group difference, -27.5% [95% CI, -34.3% to -20.6%]; P < .001). The incidence of adverse events, serious adverse events, and study discontinuation due to adverse events was similar between groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among adults with HeFH, treatment with enlicitide was well tolerated and significantly reduced levels of LDL-C, apolipoprotein B, non-HDL-C, and lipoprotein(a)."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05952869."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41206969/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jama.2025.20620",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Enlicitide effectively and safely lowered LDL-C, apolipoprotein B, non-HDL-C, and lipoprotein(a) in adults with HeFH."
    },
    {
      "id": "3f2cd736016c",
      "title": "Caffeinated Coffee Consumption or Abstinence to Reduce Atrial Fibrillation: The DECAF Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118128",
      "abstract": "Conventional wisdom holds that caffeinated coffee is proarrhythmic. Coffee is the most commonly consumed caffeinated beverage in the US, and a randomized trial assessing caffeinated coffee consumption in patients with atrial fibrillation (AF) has not previously been performed. To determine the effect of caffeinated coffee consumption compared with abstinence from coffee and caffeine on recurrent AF. This was a prospective, open-label, randomized clinical trial enrolling 200 current or previous (within past 5 years) coffee-drinking adults with persistent AF, or atrial flutter with a history of AF, planned for electrical cardioversion from 5 hospitals in the US, Canada, and Australia between November 2021 and December 2024. The date of final follow-up was June 5, 2025. Patients were randomized in a 1:1 ratio to regular caffeinated coffee consumption vs coffee and caffeine abstinence for 6 months. Patients in the coffee consumption group were encouraged to drink at least 1 cup of caffeinated coffee daily. Patients in the abstinence group were encouraged to completely abstain from both caffeinated and decaffeinated coffee and other caffeine-containing products. The primary end point was clinically detected recurrence of AF or atrial flutter over 6 months. Two hundred patients (mean [SD] age, 69 [11] years; 71% male) were randomized to caffeinated coffee consumption (n = 100) or coffee abstinence (n = 100). Baseline coffee intake was 7 cups (IQR, 7-18) per week in both groups. During follow-up, coffee intake in the consumption and abstinence groups was 7 (IQR, 6-11) and 0 (IQR, 0-2) cups per week, respectively, resulting in a between-group difference of 7 cups (95% CI, 7-7) per week. In the primary analysis, AF or atrial flutter recurrence was less in the coffee consumption (47%) than the coffee abstinence (64%) group, resulting in a 39% lower hazard of recurrence (hazard ratio, 0.61 [95% CI, 0.42-0.89]; P = .01). A comparable benefit of coffee consumption was observed with AF recurrence only. There was no significant difference in adverse events. In this clinical trial of coffee drinkers after successful cardioversion, allocation to consumption of caffeinated coffee averaging 1 cup a day was associated with less recurrence of AF or atrial flutter compared with abstinence from coffee and caffeinated products. ClinicalTrials.gov Identifier: NCT05121519.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Conventional wisdom holds that caffeinated coffee is proarrhythmic. Coffee is the most commonly consumed caffeinated beverage in the US, and a randomized trial assessing caffeinated coffee consumption in patients with atrial fibrillation (AF) has not previously been performed."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the effect of caffeinated coffee consumption compared with abstinence from coffee and caffeine on recurrent AF."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a prospective, open-label, randomized clinical trial enrolling 200 current or previous (within past 5 years) coffee-drinking adults with persistent AF, or atrial flutter with a history of AF, planned for electrical cardioversion from 5 hospitals in the US, Canada, and Australia between November 2021 and December 2024. The date of final follow-up was June 5, 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomized in a 1:1 ratio to regular caffeinated coffee consumption vs coffee and caffeine abstinence for 6 months. Patients in the coffee consumption group were encouraged to drink at least 1 cup of caffeinated coffee daily. Patients in the abstinence group were encouraged to completely abstain from both caffeinated and decaffeinated coffee and other caffeine-containing products."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary end point was clinically detected recurrence of AF or atrial flutter over 6 months."
        },
        {
          "label": "RESULTS",
          "text": "Two hundred patients (mean [SD] age, 69 [11] years; 71% male) were randomized to caffeinated coffee consumption (n = 100) or coffee abstinence (n = 100). Baseline coffee intake was 7 cups (IQR, 7-18) per week in both groups. During follow-up, coffee intake in the consumption and abstinence groups was 7 (IQR, 6-11) and 0 (IQR, 0-2) cups per week, respectively, resulting in a between-group difference of 7 cups (95% CI, 7-7) per week. In the primary analysis, AF or atrial flutter recurrence was less in the coffee consumption (47%) than the coffee abstinence (64%) group, resulting in a 39% lower hazard of recurrence (hazard ratio, 0.61 [95% CI, 0.42-0.89]; P = .01). A comparable benefit of coffee consumption was observed with AF recurrence only. There was no significant difference in adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this clinical trial of coffee drinkers after successful cardioversion, allocation to consumption of caffeinated coffee averaging 1 cup a day was associated with less recurrence of AF or atrial flutter compared with abstinence from coffee and caffeinated products."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05121519."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41206802/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jama.2025.21056",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Drinking about one cup of caffeinated coffee daily after successful cardioversion was linked to a lower chance of atrial fibrillation or flutter returning."
    },
    {
      "id": "29fa8d6e9ef5",
      "title": "Evolocumab in Patients without a Previous Myocardial Infarction or Stroke.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118123",
      "abstract": "Improvements in medical therapy, carotid-artery stenting, and carotid endarterectomy call into question the preferred management of asymptomatic carotid stenosis. Whether adding revascularization to intensive medical management would provide greater benefit than intensive medical management alone is unclear. We conducted two parallel, observer-blinded clinical trials that enrolled patients with high-grade (≥70%) asymptomatic carotid stenosis across 155 centers in five countries. The stenting trial compared intensive medical management alone (medical-therapy group) with carotid-artery stenting plus intensive medical management (stenting group); the endarterectomy trial compared intensive medical management alone (medical-therapy group) with carotid endarterectomy plus intensive medical management (endarterectomy group). The primary outcome was a composite of any stroke or death, assessed from randomization to 44 days, or ipsilateral ischemic stroke, assessed during the remaining follow-up period up to 4 years. A total of 1245 patients underwent randomization in the stenting trial and 1240 in the endarterectomy trial. In the stenting trial, the 4-year incidence of primary-outcome events was 6.0% (95% confidence interval [CI], 3.8 to 8.3) in the medical-therapy group and 2.8% (95% CI, 1.5 to 4.3) in the stenting group (P = 0.02 for the absolute difference). In the endarterectomy trial, the 4-year incidence of primary-outcome events was 5.3% (95% CI, 3.3 to 7.4) in the medical-therapy group and 3.7% (95% CI, 2.1 to 5.5) in the endarterectomy group (P = 0.24 for the absolute difference). From day 0 to 44, in the stenting trial, no strokes or deaths occurred in the medical-therapy group and seven strokes and one death occurred in the stenting group; in the endarterectomy trial, three strokes occurred in the medical-therapy group and nine strokes occurred in the endarterectomy group. Among patients with high-grade stenosis without recent symptoms, the addition of stenting led to a lower risk of a composite of perioperative stroke or death or ipsilateral stroke within 4 years than intensive medical management alone. Carotid endarterectomy did not lead to a significant benefit. (Funded by the National Institute of Neurological Disorders and Stroke and others; CREST-2 ClinicalTrials.gov number, NCT02089217.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Improvements in medical therapy, carotid-artery stenting, and carotid endarterectomy call into question the preferred management of asymptomatic carotid stenosis. Whether adding revascularization to intensive medical management would provide greater benefit than intensive medical management alone is unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted two parallel, observer-blinded clinical trials that enrolled patients with high-grade (≥70%) asymptomatic carotid stenosis across 155 centers in five countries. The stenting trial compared intensive medical management alone (medical-therapy group) with carotid-artery stenting plus intensive medical management (stenting group); the endarterectomy trial compared intensive medical management alone (medical-therapy group) with carotid endarterectomy plus intensive medical management (endarterectomy group). The primary outcome was a composite of any stroke or death, assessed from randomization to 44 days, or ipsilateral ischemic stroke, assessed during the remaining follow-up period up to 4 years."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1245 patients underwent randomization in the stenting trial and 1240 in the endarterectomy trial. In the stenting trial, the 4-year incidence of primary-outcome events was 6.0% (95% confidence interval [CI], 3.8 to 8.3) in the medical-therapy group and 2.8% (95% CI, 1.5 to 4.3) in the stenting group (P = 0.02 for the absolute difference). In the endarterectomy trial, the 4-year incidence of primary-outcome events was 5.3% (95% CI, 3.3 to 7.4) in the medical-therapy group and 3.7% (95% CI, 2.1 to 5.5) in the endarterectomy group (P = 0.24 for the absolute difference). From day 0 to 44, in the stenting trial, no strokes or deaths occurred in the medical-therapy group and seven strokes and one death occurred in the stenting group; in the endarterectomy trial, three strokes occurred in the medical-therapy group and nine strokes occurred in the endarterectomy group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with high-grade stenosis without recent symptoms, the addition of stenting led to a lower risk of a composite of perioperative stroke or death or ipsilateral stroke within 4 years than intensive medical management alone. Carotid endarterectomy did not lead to a significant benefit. (Funded by the National Institute of Neurological Disorders and Stroke and others; CREST-2 ClinicalTrials.gov number, NCT02089217.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41269206/",
      "pubDate": "2025 Nov 21",
      "doi": "10.1056/NEJMoa2508800",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "For patients with high-grade carotid stenosis without recent symptoms, carotid artery stenting reduced the risk of stroke or death compared to intensive medical management alone, while endarterectomy did not show a significant benefit."
    },
    {
      "id": "351b153164d1",
      "title": "Effectiveness of Mailed Patient Activation Letters for Blood Pressure Control: A Randomized Quality Improvement Trial.",
      "journal": "J Gen Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118104",
      "abstract": "Uncontrolled hypertension (HTN) is a leading preventable cause of death. Interventions are needed that activate patients and motivate them to work with clinicians to control their blood pressure (BP). To test whether mailing patients a letter including information about their hypertension and a summary of computerized algorithm-generated medication adjustment suggestions improves BP control processes and outcomes. Randomized quality improvement trial. We identified patients receiving primary care at a large academic medical center with diagnosed HTN and uncontrolled BP (> 140 mmHg systolic or > 90 mmHg diastolic) at both of their last 2 visits. Participants were randomized into three groups. The BP Activate Letter group received a letter containing algorithm-generated BP medication adjustment suggestions, and a recommendation to discuss these suggestions with their provider; the Control Letter group received a letter that recommended they talk to their provider about their HTN, without specific medication suggestions; and the No Letter group received no mailed outreach. The primary outcome was time to occurrence of either a BP medication intensification or documented achievement of BP control to < 140/< 90 mmHg using EHR data extracted 6 months after letters were mailed. The primary outcome, which was time to medication intensification or achievement of BP control, did not occur more frequently in the BP Activate Letter group (hazard ratio = 0.86; 95% confidence interval [CI]: 0.65 to 1.14), or in the Control Letter group (0.78; 0.59 to 1.03) compared to the No Letter group, and we saw no evidence of significant improvement in any secondary outcome or subgroup. Time to medication intensification appeared to be significantly longer in the Control Letter compared to the No Letter group (0.50; 0.30 to 0.85). Mailing patients one letter with computerized BP medication adjustment suggestions to consider did not lead to effective patient activation.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Uncontrolled hypertension (HTN) is a leading preventable cause of death. Interventions are needed that activate patients and motivate them to work with clinicians to control their blood pressure (BP)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To test whether mailing patients a letter including information about their hypertension and a summary of computerized algorithm-generated medication adjustment suggestions improves BP control processes and outcomes."
        },
        {
          "label": "DESIGN",
          "text": "Randomized quality improvement trial."
        },
        {
          "label": "PARTICIPANTS",
          "text": "We identified patients receiving primary care at a large academic medical center with diagnosed HTN and uncontrolled BP (> 140 mmHg systolic or > 90 mmHg diastolic) at both of their last 2 visits."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized into three groups. The BP Activate Letter group received a letter containing algorithm-generated BP medication adjustment suggestions, and a recommendation to discuss these suggestions with their provider; the Control Letter group received a letter that recommended they talk to their provider about their HTN, without specific medication suggestions; and the No Letter group received no mailed outreach."
        },
        {
          "label": "MAIN MEASURES",
          "text": "The primary outcome was time to occurrence of either a BP medication intensification or documented achievement of BP control to < 140/< 90 mmHg using EHR data extracted 6 months after letters were mailed."
        },
        {
          "label": "KEY RESULTS",
          "text": "The primary outcome, which was time to medication intensification or achievement of BP control, did not occur more frequently in the BP Activate Letter group (hazard ratio = 0.86; 95% confidence interval [CI]: 0.65 to 1.14), or in the Control Letter group (0.78; 0.59 to 1.03) compared to the No Letter group, and we saw no evidence of significant improvement in any secondary outcome or subgroup. Time to medication intensification appeared to be significantly longer in the Control Letter compared to the No Letter group (0.50; 0.30 to 0.85)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Mailing patients one letter with computerized BP medication adjustment suggestions to consider did not lead to effective patient activation."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41186866/",
      "pubDate": "2025 Nov 04",
      "doi": "10.1007/s11606-025-09946-0",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "A single mailed letter with computerized blood pressure medication suggestions did not improve patient engagement."
    },
    {
      "id": "b087a560731e",
      "title": "Outpatient Follow-Up and 30-Day Readmissions: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118094",
      "abstract": "Outpatient follow-up after discharge has been associated with reduced 30-day readmissions. Since universal follow-up is not feasible, identifying for whom and when outpatient follow-up is most beneficial is essential for optimizing resources and reducing readmissions. To quantify the association between outpatient follow-up within 30, 14, and 7 days postdischarge and 30-day all-cause readmissions and assess differences in outcomes by disease, age, and baseline readmission risk. MEDLINE (via PubMed), Embase, and CINAHL were searched for studies published between January 1, 2000, and August 4, 2025, using terms related to outpatient follow-up and readmissions. English-language studies assessing the association between outpatient follow-up within 30 days of hospital discharge and 30-day all-cause readmissions among adult inpatients were included. Following Preferred Reporting Items for Systematic Review and Meta-Analyses guidelines, 2 reviewers independently screened titles and abstracts. Data were extracted by 1 author and verified by another, and quality assessment was done independently by 2 authors. The primary outcome was all-cause 30-day readmission. Secondary outcomes included all-cause 30-day emergency department (ED) discharge and mortality. Pooled effect sizes (relative risk ratios [RRRs]) were estimated by disease and age group using multilevel random-effects models. Eighty-three studies were included in the review and 76 in the meta-analysis. Outpatient follow-up within 30 days vs no follow-up was associated with a reduction in risk of 30-day all-cause readmission (RRR, 0.68; 95% CI, 0.60-0.75), with less reduction (RRR, 0.78; 95% CI, 0.67-0.89) when restricted to studies with low to moderate risk of bias (ROB). Among patients with heart failure (HF) and acute myocardial infarction (AMI), the RRRs for 30-day follow-up in studies with low to moderate ROB were 0.65 (95% CI, 0.48-0.83) and 0.56 (95% CI, 0.32-0.80), respectively. Subgroup analysis using studies with low to moderate ROB showed benefits of 30-day follow-up only among patients aged 65 years or older with HF (RRR, 0.65; 95% CI, 0.48-0.83), AMI (RRR, 0.56; 95% CI, 0.32-0.80), and other diseases such as stroke and chronic obstructive pulmonary disease (RRR, 0.73; 95% CI, 0.59-0.87). Early follow-up vs no follow-up within 14 and 7 days was associated with a significant reduction in readmissions only among patients aged 65 years or older with HF (14 days: RRR, 0.63 [95% CI, 0.40-0.87]; 7 days: RRR, 0.68 [95% CI, 0.47-0.89]) and AMI (14 days: RRR, 0.57 [95% CI, 0.22-0.91]; 7 days: RRR, 0.63 [95% CI, 0.34-0.92]). In this systematic review and meta-analysis, outpatient follow-up within 30 days was associated with reduced 30-day readmissions, but the association varied by patient age and disease type, indicating a need for targeted rather than universal follow-up.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Outpatient follow-up after discharge has been associated with reduced 30-day readmissions. Since universal follow-up is not feasible, identifying for whom and when outpatient follow-up is most beneficial is essential for optimizing resources and reducing readmissions."
        },
        {
          "label": "OBJECTIVE",
          "text": "To quantify the association between outpatient follow-up within 30, 14, and 7 days postdischarge and 30-day all-cause readmissions and assess differences in outcomes by disease, age, and baseline readmission risk."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE (via PubMed), Embase, and CINAHL were searched for studies published between January 1, 2000, and August 4, 2025, using terms related to outpatient follow-up and readmissions."
        },
        {
          "label": "STUDY SELECTION",
          "text": "English-language studies assessing the association between outpatient follow-up within 30 days of hospital discharge and 30-day all-cause readmissions among adult inpatients were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Following Preferred Reporting Items for Systematic Review and Meta-Analyses guidelines, 2 reviewers independently screened titles and abstracts. Data were extracted by 1 author and verified by another, and quality assessment was done independently by 2 authors."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was all-cause 30-day readmission. Secondary outcomes included all-cause 30-day emergency department (ED) discharge and mortality. Pooled effect sizes (relative risk ratios [RRRs]) were estimated by disease and age group using multilevel random-effects models."
        },
        {
          "label": "RESULTS",
          "text": "Eighty-three studies were included in the review and 76 in the meta-analysis. Outpatient follow-up within 30 days vs no follow-up was associated with a reduction in risk of 30-day all-cause readmission (RRR, 0.68; 95% CI, 0.60-0.75), with less reduction (RRR, 0.78; 95% CI, 0.67-0.89) when restricted to studies with low to moderate risk of bias (ROB). Among patients with heart failure (HF) and acute myocardial infarction (AMI), the RRRs for 30-day follow-up in studies with low to moderate ROB were 0.65 (95% CI, 0.48-0.83) and 0.56 (95% CI, 0.32-0.80), respectively. Subgroup analysis using studies with low to moderate ROB showed benefits of 30-day follow-up only among patients aged 65 years or older with HF (RRR, 0.65; 95% CI, 0.48-0.83), AMI (RRR, 0.56; 95% CI, 0.32-0.80), and other diseases such as stroke and chronic obstructive pulmonary disease (RRR, 0.73; 95% CI, 0.59-0.87). Early follow-up vs no follow-up within 14 and 7 days was associated with a significant reduction in readmissions only among patients aged 65 years or older with HF (14 days: RRR, 0.63 [95% CI, 0.40-0.87]; 7 days: RRR, 0.68 [95% CI, 0.47-0.89]) and AMI (14 days: RRR, 0.57 [95% CI, 0.22-0.91]; 7 days: RRR, 0.63 [95% CI, 0.34-0.92])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis, outpatient follow-up within 30 days was associated with reduced 30-day readmissions, but the association varied by patient age and disease type, indicating a need for targeted rather than universal follow-up."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41186947/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.41272",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Outpatient follow-up within 30 days reduces 30-day readmissions, but its effectiveness depends on patient characteristics and diagnosis, suggesting a need for tailored follow-up strategies."
    },
    {
      "id": "ab50e2062cd8",
      "title": "AGA Clinical Practice Guideline on Surveillance of Barrett's Esophagus.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118021",
      "abstract": "Barrett's esophagus (BE) is the only identifiable precursor to esophageal adenocarcinoma (EAC). Endoscopic surveillance has been proposed for early detection of BE-related neoplasia and reducing EAC mortality. This clinical practice guideline aims to inform clinicians and patients by providing evidence-based practice recommendations for surveillance in patients with BE. The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and make recommendations. The panel prioritized clinical questions and outcomes according to their importance for clinicians and patients, conducted an evidence review, and used the Evidence-to-Decision Framework to develop recommendations regarding the role of endoscopic surveillance in patients with BE. The clinical domains addressed included: (1) overall role of endoscopic surveillance, (2) surveillance in patients with columnar-lined esophagus <1 cm, (3) optimal imaging modalities, (4) adjunctive sampling techniques, (5) the utility of biomarkers in risk-stratification, (6) chemopreventive strategies, and (7) antireflux procedures in the prevention of progression in patients with BE. Clinical recommendations were based on the balance between the desirable and undesirable effects, patient values, costs, and health equity considerations. The panel agreed on 8 recommendations. Based on the available evidence, the panel provided a conditional recommendation in favor of surveillance for patients with nondysplastic BE. In patients with columnar-lined esophagus <1 cm, a conditional recommendation was made against endoscopic surveillance. The panel made a strong recommendation in favor of a combination of high-definition white light endoscopy and chromoendoscopy compared with white light endoscopy alone. The panel made no recommendation on the use of enhanced sampling techniques, such as wide-area transepithelial sampling to enhance neoplasia detection and biomarkers such as p53 and TissueCypher to predict progression in BE. The panel provided a conditional recommendation for the use of daily proton pump inhibitor therapy compared with no therapy and compared with antireflux surgery to prevent progression in BE. This document provides a comprehensive outline on the role of surveillance in patients with BE. Key implementation statements included in this document stress the importance of a high-quality endoscopy examination, sampling using a structured biopsy protocol, and confirming the diagnosis of BE-related neoplasia by an expert pathologist. This document also provides guidance on surveillance intervals and management of patients with BE-related low-grade dysplasia and indefinite for dysplasia. Providers should engage in shared decision making based on patient preferences. Limitations and gaps in the evidence are highlighted to guide future research opportunities. This guideline is endorsed by the Canadian Association of Gastroenterology.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Barrett's esophagus (BE) is the only identifiable precursor to esophageal adenocarcinoma (EAC). Endoscopic surveillance has been proposed for early detection of BE-related neoplasia and reducing EAC mortality. This clinical practice guideline aims to inform clinicians and patients by providing evidence-based practice recommendations for surveillance in patients with BE."
        },
        {
          "label": "METHODS",
          "text": "The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and make recommendations. The panel prioritized clinical questions and outcomes according to their importance for clinicians and patients, conducted an evidence review, and used the Evidence-to-Decision Framework to develop recommendations regarding the role of endoscopic surveillance in patients with BE. The clinical domains addressed included: (1) overall role of endoscopic surveillance, (2) surveillance in patients with columnar-lined esophagus <1 cm, (3) optimal imaging modalities, (4) adjunctive sampling techniques, (5) the utility of biomarkers in risk-stratification, (6) chemopreventive strategies, and (7) antireflux procedures in the prevention of progression in patients with BE. Clinical recommendations were based on the balance between the desirable and undesirable effects, patient values, costs, and health equity considerations."
        },
        {
          "label": "RESULTS",
          "text": "The panel agreed on 8 recommendations. Based on the available evidence, the panel provided a conditional recommendation in favor of surveillance for patients with nondysplastic BE. In patients with columnar-lined esophagus <1 cm, a conditional recommendation was made against endoscopic surveillance. The panel made a strong recommendation in favor of a combination of high-definition white light endoscopy and chromoendoscopy compared with white light endoscopy alone. The panel made no recommendation on the use of enhanced sampling techniques, such as wide-area transepithelial sampling to enhance neoplasia detection and biomarkers such as p53 and TissueCypher to predict progression in BE. The panel provided a conditional recommendation for the use of daily proton pump inhibitor therapy compared with no therapy and compared with antireflux surgery to prevent progression in BE."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This document provides a comprehensive outline on the role of surveillance in patients with BE. Key implementation statements included in this document stress the importance of a high-quality endoscopy examination, sampling using a structured biopsy protocol, and confirming the diagnosis of BE-related neoplasia by an expert pathologist. This document also provides guidance on surveillance intervals and management of patients with BE-related low-grade dysplasia and indefinite for dysplasia. Providers should engage in shared decision making based on patient preferences. Limitations and gaps in the evidence are highlighted to guide future research opportunities."
        },
        {
          "label": "GUIDELINE ENDORSEMENT",
          "text": "This guideline is endorsed by the Canadian Association of Gastroenterology."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41125322/",
      "pubDate": "2025 Nov",
      "doi": "10.1053/j.gastro.2025.09.012",
      "dateReceived": "2025-11-25T23:25:23.872Z",
      "isNew": false,
      "summary": "Surveillance for Barrett's esophagus requires high-quality endoscopy, structured biopsies, expert pathology review, and individualized management based on dysplasia findings and patient preferences."
    },
    {
      "id": "f108882e43a3",
      "title": "Effects of Glucagon-Like Peptide-1 Receptor Agonists After Treatment Withdrawal: A Systematic Review and Meta-Analysis.",
      "journal": "J Gen Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118219",
      "abstract": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) effectively promote weight reduction and improve glycemic control, blood pressure, and lipid profiles in individuals with overweight or obesity. This systematic review and meta-analysis evaluates the durability of these therapeutic benefits following treatment discontinuation. We conducted a systematic search of PubMed, Embase, Web of Science, Cochrane Library, CNKI, Wanfang, and VIP from inception to June 2024, to identify randomized controlled trials that assessed the effects of GLP-1RAs with a follow-up period of at least six months after treatment discontinuation. The outcomes were changes in weight, body mass index (BMI), waist circumference (WC), glycemia, blood pressure, and lipid profiles. We screened 10,670 studies and ultimately identified 5 eligible studies, encompassing 719 patients. Compared to the control group, GLP-1RAs were associated with significant reductions in weight (mean difference (MD) = -5.70 kg, 95% confidence interval (CI): -9.52 to -1.88), BMI (MD = -2.94 kg/m, 95% CI: -5.60 to -0.28), WC (MD = -3.66 cm, 95% CI: -4.89 to -2.43), glycated hemoglobin A1c (HbA1c) (standardized mean difference (SMD) = -0.73, 95% CI: -1.14 to -0.32), and systolic blood pressure (SBP) (MD = -3.62 mm Hg, 95% CI: -5.51 to -1.73) after cessation of therapy. After discontinuation, there was a pronounced rebound in weight (MD = 4.13 kg, 95% CI: 1.60 to 6.65), BMI (MD = 0.84 kg/m, 95% CI: 0.37 to 1.32), WC (MD = 3.64 cm, 95% CI: 2.27 to 5.01), and HbA1c (SMD = 0.69, 95% CI: 0.50 to 0.89). From study baseline to the end of follow-up, GLP-1RAs treatment resulted in statistically significant decreases in weight (MD = -2.32 kg, 95% CI: -4.21 to -0.43) and BMI (MD = -0.82 kg/m, 95% CI: -1.47 to -0.17). This meta-analysis demonstrated that although statistically significant weight reduction persists after GLP-1RAs discontinuation, the clinical significance and durability of this effect are limited. To achieve sustained therapeutic benefits, continued treatment with these agents may be necessary.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) effectively promote weight reduction and improve glycemic control, blood pressure, and lipid profiles in individuals with overweight or obesity. This systematic review and meta-analysis evaluates the durability of these therapeutic benefits following treatment discontinuation."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic search of PubMed, Embase, Web of Science, Cochrane Library, CNKI, Wanfang, and VIP from inception to June 2024, to identify randomized controlled trials that assessed the effects of GLP-1RAs with a follow-up period of at least six months after treatment discontinuation. The outcomes were changes in weight, body mass index (BMI), waist circumference (WC), glycemia, blood pressure, and lipid profiles."
        },
        {
          "label": "RESULTS",
          "text": "We screened 10,670 studies and ultimately identified 5 eligible studies, encompassing 719 patients. Compared to the control group, GLP-1RAs were associated with significant reductions in weight (mean difference (MD) = -5.70 kg, 95% confidence interval (CI): -9.52 to -1.88), BMI (MD = -2.94 kg/m, 95% CI: -5.60 to -0.28), WC (MD = -3.66 cm, 95% CI: -4.89 to -2.43), glycated hemoglobin A1c (HbA1c) (standardized mean difference (SMD) = -0.73, 95% CI: -1.14 to -0.32), and systolic blood pressure (SBP) (MD = -3.62 mm Hg, 95% CI: -5.51 to -1.73) after cessation of therapy. After discontinuation, there was a pronounced rebound in weight (MD = 4.13 kg, 95% CI: 1.60 to 6.65), BMI (MD = 0.84 kg/m, 95% CI: 0.37 to 1.32), WC (MD = 3.64 cm, 95% CI: 2.27 to 5.01), and HbA1c (SMD = 0.69, 95% CI: 0.50 to 0.89). From study baseline to the end of follow-up, GLP-1RAs treatment resulted in statistically significant decreases in weight (MD = -2.32 kg, 95% CI: -4.21 to -0.43) and BMI (MD = -0.82 kg/m, 95% CI: -1.47 to -0.17)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This meta-analysis demonstrated that although statistically significant weight reduction persists after GLP-1RAs discontinuation, the clinical significance and durability of this effect are limited. To achieve sustained therapeutic benefits, continued treatment with these agents may be necessary."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41249646/",
      "pubDate": "2025 Nov 17",
      "doi": "10.1007/s11606-025-09950-4",
      "dateReceived": "2025-11-25T23:25:23.871Z",
      "isNew": false,
      "summary": "Weight loss from GLP-1RAs persists after stopping the medication, but the effect is small and likely requires continued treatment for lasting benefits."
    }
  ]
}