{
  "updated_at": "2025-10-15T23:23:08.952Z",
  "articles": [
    {
      "id": "9736b8d2f7c6",
      "title": "Dupilumab versus omalizumab in patients with chronic rhinosinusitis with nasal polyps and coexisting asthma (EVEREST): a multicentre, randomised, double-blind, head-to-head phase 4 trial.",
      "journal": "Lancet Respir Med",
      "score": "5/7",
      "tags": [
        "Allergy and Immunology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48530164/117797",
      "dateReceived": "2025-10-15T23:22:41.428Z",
      "isNew": true
    },
    {
      "id": "6c395a7cc0bf",
      "title": "Type 2 Diabetes Remission: A Systematic Review and Meta-analysis of Nonsurgical Randomized Controlled Trials.",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117801",
      "abstract": "Evidence that type 2 diabetes can be reversed has been limited by the understanding and implementation of these interventions. We assessed the effect of nonsurgical randomized controlled trials (RCTs) on type 2 diabetes remission and characterized core components. We reviewed articles from MEDLINE and Embase (inception to April 2025). RCTs of multimodal pharmacological or nonpharmacological type 2 diabetes remission interventions for adults with type 2 diabetes were included. Study characteristics and outcomes for clinical/population health, patient-reported, and adverse event were extracted. We performed a random-effects multilevel meta-analysis of studies, grouped based on type of intervention and by length of follow-up. A total of 18 studies were included in this review from 11 different countries. There was a higher likelihood of achieving type 2 diabetes remission through multimodal interventions (risk ratio [RR] 1.75 [95% CI 1.49-2.04]) and for nonpharmacological interventions (RR 5.80 [95% CI 4.28-7.87]), compared with the control group. Other significant outcomes for intervention groups compared with control groups included change in A1C, weight loss, and quality of life and improvements in adverse events of hypoglycemia. There was heterogeneity in our small pool of included studies (diversity of nonpharmacological components), stringent intervention protocols, narrow participant selection criteria, and lack of consistent diabetes remission definitions. With specific protocols, a variety of tailored approaches can induce type 2 diabetes remission for patients with newly diagnosed type 2 diabetes who are able to subscribe to strict protocols. Consideration of long-term sustainability and effectiveness is needed in future research, along with patient preferences.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Evidence that type 2 diabetes can be reversed has been limited by the understanding and implementation of these interventions."
        },
        {
          "label": "PURPOSE",
          "text": "We assessed the effect of nonsurgical randomized controlled trials (RCTs) on type 2 diabetes remission and characterized core components."
        },
        {
          "label": "DATA SOURCES",
          "text": "We reviewed articles from MEDLINE and Embase (inception to April 2025)."
        },
        {
          "label": "STUDY SELECTION",
          "text": "RCTs of multimodal pharmacological or nonpharmacological type 2 diabetes remission interventions for adults with type 2 diabetes were included."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Study characteristics and outcomes for clinical/population health, patient-reported, and adverse event were extracted."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "We performed a random-effects multilevel meta-analysis of studies, grouped based on type of intervention and by length of follow-up. A total of 18 studies were included in this review from 11 different countries. There was a higher likelihood of achieving type 2 diabetes remission through multimodal interventions (risk ratio [RR] 1.75 [95% CI 1.49-2.04]) and for nonpharmacological interventions (RR 5.80 [95% CI 4.28-7.87]), compared with the control group. Other significant outcomes for intervention groups compared with control groups included change in A1C, weight loss, and quality of life and improvements in adverse events of hypoglycemia."
        },
        {
          "label": "LIMITATIONS",
          "text": "There was heterogeneity in our small pool of included studies (diversity of nonpharmacological components), stringent intervention protocols, narrow participant selection criteria, and lack of consistent diabetes remission definitions."
        },
        {
          "label": "CONCLUSIONS",
          "text": "With specific protocols, a variety of tailored approaches can induce type 2 diabetes remission for patients with newly diagnosed type 2 diabetes who are able to subscribe to strict protocols. Consideration of long-term sustainability and effectiveness is needed in future research, along with patient preferences."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982327/",
      "pubDate": "2025 Sep 22",
      "doi": "10.2337/dc25-0562",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "Type 2 diabetes remission is achievable in newly diagnosed patients through strict, tailored protocols, but long-term sustainability and patient preferences require further investigation."
    },
    {
      "id": "a070501d41bd",
      "title": "Pharmacotherapy for mild hypertension.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117782",
      "abstract": "This is an update of a Cochrane review published in 2012 of initiation of antihypertensive monotherapy or step-up therapy in people with untreated mild hypertension (systolic blood pressure 140 to 159 mmHg or diastolic blood pressure 90 to 99 mmHg, or both) and no pre-existing cardiovascular disease. The original review demonstrated no difference in the incidence of all-cause mortality, total cardiovascular events (stroke, myocardial infarction, and congestive heart failure), stroke incidence, coronary heart disease, or withdrawal due to adverse effects (WDAEs). Evidence for antihypertensive pharmacotherapy in people with mild hypertension for primary prevention remains uncertain in the literature with conflicting studies. We therefore performed an update of the original Cochrane review to reassess whether initiation of antihypertensive pharmacotherapy compared to placebo or no treatment in people with untreated mild hypertension and no pre-existing cardiovascular disease reduces the risk of all-cause mortality, total cardiovascular events, stroke, coronary heart disease, or WDAEs. To reassess the efficacy and risks of initiating antihypertensive pharmacotherapy in adults with untreated mild hypertension and no pre-existing cardiovascular disease. The primary objective was to reassess the risk of all-cause mortality and total cardiovascular events (defined as fatal and non-fatal strokes, myocardial infarction, and congestive heart failure). The secondary objectives were to reassess the risk of stroke (fatal and non-fatal), coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs. We searched the Cochrane Hypertension Specialised Register, CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the World Health Organization International Clinical Trials Registry Platform from inception to June 2024. We included randomized controlled trials (RCTs) of at least one-year duration comparing initiation on antihypertensive monotherapy or step-up therapy, or both, versus placebo or no treatment in participants with mild hypertension and no pre-existing cardiovascular disease. Our critical outcomes were all-cause mortality and total cardiovascular events. Important outcomes were stroke, coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs. Two review authors assessed risk of bias independently and in duplicate using Cochrane's RoB 1 tool. Two review authors performed title and abstract screening, full-text review, and data extraction independently and in duplicate. We calculated risk ratio (RR) along with 95% confidence interval (CI) for all-cause mortality, total cardiovascular events, stroke events, coronary heart disease events, and WDAEs with the Mantel-Haenszel test and a fixed-effect model. We assessed the certainty of the evidence using the GRADE approach. We included five trials involving a total of 9124 participants, of whom 4593 received antihypertensives and 4531 received placebo or no treatment. All five trials reported all-cause mortality; four trials reported total cardiovascular events and strokes; three trials reported coronary heart disease; and one trial reported WDAEs. There may be little to no reduction in all-cause mortality (RR 0.85, 95% CI 0.64 to 1.14; 5 trials, 9124 participants; low-certainty evidence), total cardiovascular events (RR 0.93, 95% CI 0.69 to 1.24; 4 trials, 7292 participants; low-certainty evidence), or coronary heart disease (RR 1.12, 95% CI 0.80 to 1.57; 3 trials, 7080 participants; low-certainty evidence). There may be a decreased risk of stroke (RR 0.41, 95% CI 0.20 to 0.84; 4 trials, 7292 participants; low-certainty evidence) and an increase in WDAEs (RR 4.80, 95% CI 4.14 to 5.57; 1 trial, 17,354 participants; low-certainty evidence) with antihypertensives. We downgraded the certainty of evidence for all outcomes due to imprecision, indirectness, and risk of bias. In people with untreated mild hypertension and no pre-existing cardiovascular disease, initiation of antihypertensive monotherapy or step-up therapy may not reduce all-cause mortality, total cardiovascular events, or coronary heart disease compared to those who received placebo or no treatment. There may be a reduction in stroke, but possibly also an increase in WDAEs. CIHR Grant to the Hypertension Review Group and British Columbia Ministry of Health Grant to the Therapeutics Initiative. Protocol (2007): doi.org/10.1002/14651858.CD006742. Original review (2012): doi.org/10.1002/14651858.CD006742.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "This is an update of a Cochrane review published in 2012 of initiation of antihypertensive monotherapy or step-up therapy in people with untreated mild hypertension (systolic blood pressure 140 to 159 mmHg or diastolic blood pressure 90 to 99 mmHg, or both) and no pre-existing cardiovascular disease. The original review demonstrated no difference in the incidence of all-cause mortality, total cardiovascular events (stroke, myocardial infarction, and congestive heart failure), stroke incidence, coronary heart disease, or withdrawal due to adverse effects (WDAEs). Evidence for antihypertensive pharmacotherapy in people with mild hypertension for primary prevention remains uncertain in the literature with conflicting studies. We therefore performed an update of the original Cochrane review to reassess whether initiation of antihypertensive pharmacotherapy compared to placebo or no treatment in people with untreated mild hypertension and no pre-existing cardiovascular disease reduces the risk of all-cause mortality, total cardiovascular events, stroke, coronary heart disease, or WDAEs."
        },
        {
          "label": "OBJECTIVES",
          "text": "To reassess the efficacy and risks of initiating antihypertensive pharmacotherapy in adults with untreated mild hypertension and no pre-existing cardiovascular disease. The primary objective was to reassess the risk of all-cause mortality and total cardiovascular events (defined as fatal and non-fatal strokes, myocardial infarction, and congestive heart failure). The secondary objectives were to reassess the risk of stroke (fatal and non-fatal), coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Hypertension Specialised Register, CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the World Health Organization International Clinical Trials Registry Platform from inception to June 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) of at least one-year duration comparing initiation on antihypertensive monotherapy or step-up therapy, or both, versus placebo or no treatment in participants with mild hypertension and no pre-existing cardiovascular disease."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality and total cardiovascular events. Important outcomes were stroke, coronary heart disease (fatal and non-fatal myocardial infarction and sudden cardiac death), and WDAEs."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors assessed risk of bias independently and in duplicate using Cochrane's RoB 1 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors performed title and abstract screening, full-text review, and data extraction independently and in duplicate. We calculated risk ratio (RR) along with 95% confidence interval (CI) for all-cause mortality, total cardiovascular events, stroke events, coronary heart disease events, and WDAEs with the Mantel-Haenszel test and a fixed-effect model. We assessed the certainty of the evidence using the GRADE approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included five trials involving a total of 9124 participants, of whom 4593 received antihypertensives and 4531 received placebo or no treatment. All five trials reported all-cause mortality; four trials reported total cardiovascular events and strokes; three trials reported coronary heart disease; and one trial reported WDAEs."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "There may be little to no reduction in all-cause mortality (RR 0.85, 95% CI 0.64 to 1.14; 5 trials, 9124 participants; low-certainty evidence), total cardiovascular events (RR 0.93, 95% CI 0.69 to 1.24; 4 trials, 7292 participants; low-certainty evidence), or coronary heart disease (RR 1.12, 95% CI 0.80 to 1.57; 3 trials, 7080 participants; low-certainty evidence). There may be a decreased risk of stroke (RR 0.41, 95% CI 0.20 to 0.84; 4 trials, 7292 participants; low-certainty evidence) and an increase in WDAEs (RR 4.80, 95% CI 4.14 to 5.57; 1 trial, 17,354 participants; low-certainty evidence) with antihypertensives. We downgraded the certainty of evidence for all outcomes due to imprecision, indirectness, and risk of bias."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In people with untreated mild hypertension and no pre-existing cardiovascular disease, initiation of antihypertensive monotherapy or step-up therapy may not reduce all-cause mortality, total cardiovascular events, or coronary heart disease compared to those who received placebo or no treatment. There may be a reduction in stroke, but possibly also an increase in WDAEs."
        },
        {
          "label": "FUNDING",
          "text": "CIHR Grant to the Hypertension Review Group and British Columbia Ministry of Health Grant to the Therapeutics Initiative."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2007): doi.org/10.1002/14651858.CD006742. Original review (2012): doi.org/10.1002/14651858.CD006742.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40990196/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1002/14651858.CD006742.pub3",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "In individuals with untreated mild hypertension and no prior cardiovascular disease, starting antihypertensive medication may not improve overall survival or reduce cardiovascular events, though it might decrease stroke risk while potentially increasing adverse events."
    },
    {
      "id": "eeeeb9563f3a",
      "title": "Once-weekly semaglutide 7.2 mg in adults with obesity and type 2 diabetes (STEP UP T2D): a randomised, controlled, phase 3b trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117711",
      "abstract": "Semaglutide 2·4 mg is approved for weight management in adults with obesity or overweight in the presence of at least one obesity-related complication; however, many people with obesity and type 2 diabetes do not reach their bodyweight reduction goals with this dose. We aimed to investigate the efficacy and safety of a new 7·2 mg maintenance dose of once-weekly subcutaneous semaglutide in people with obesity and type 2 diabetes. STEP UP T2D was a randomised, phase 3b, double-blind controlled, three-arm, parallel-group trial conducted at 68 hospitals, specialist clinics, and medical centres in Bulgaria, Canada, Hungary, Poland, Portugal, Slovakia, South Africa, and the USA. Adults aged 18 years or older (BMI ≥30·0 kg/m, HbA 7·0-10·0% [53-86 mmol/mol]) were randomly assigned (3:1:1) to receive once-weekly subcutaneous semaglutide 7·2 mg, 2·4 mg, or placebo, alongside a lifestyle intervention, for 72 weeks. Coprimary endpoints were the percentage change in bodyweight and the proportion of participants reaching a bodyweight reduction of 5% or greater with semaglutide 7·2 mg versus placebo. Confirmatory secondary endpoints were the proportion of participants reaching a bodyweight reduction of 10% or greater, 15% or greater, and 20% or greater, and changes in waist circumference (cm) and HbA (%) with semaglutide 7·2 mg versus placebo. Efficacy was assessed in all randomly assigned participants, and safety was assessed in all randomly assigned participants who received at least one dose of the trial product. This trial is registered with ClinicalTrials.gov (NCT05649137) and is now closed and completed. Between Jan 4 and May 4, 2023, 512 participants were randomly assigned to receive semaglutide 7·2 mg (n=307), semaglutide 2·4 mg (n=103), or placebo (n=102). 265 (51·8%) of 512 participants were female, the mean age was 56 (SD 10) years, mean bodyweight was 110·1 (22·9) kg, mean BMI was 38·6 (7·1) kg/m, and mean HbA was 8·1% (0·9). Compared with placebo, semaglutide 7·2 mg led to greater reductions in mean bodyweight (-13·2% vs -3·9%; estimated treatment difference [ETD] -9·3% [95% CI -11·0 to -7·7]; p<0·0001); more participants reaching bodyweight reductions of 5% or greater (odds ratio 10·0 [95% CI 6·0 to 16·9]; p<0·0001), 10% or greater (11·3 [5·9 to 21·4]; p<0·0001), 15% or greater (8·1 [3·7 to 17·7]; p<0·0001), and 20% or greater (12·3 [3·0 to 51·0]; p=0·0006); and reduced waist circumference (ETD -6·5 cm [95% CI -9·0 to -4·1]; p<0·0001) and HbA (ETD -1·5% [95% CI -1·8 to -1·2]; p<0·0001). Level 2-3 hypoglycaemia risk was low and comparable between semaglutide doses and placebo. Gastrointestinal events were reported by 163 (53·1%) of 307 participants with semaglutide 7·2 mg, 53 (51·5%) of 103 participants with semaglutide 2·4 mg, 26 (25·5%) of 102 participants with placebo; and serious adverse events were reported by 28 (9·1%) participants with semaglutide 7·2 mg, nine (8·7%) participants with semaglutide 2·4 mg, and nine (8·8%) participants with placebo. Dysaesthesia was more common with semaglutide 7·2 mg (58 [18·9%] of 307) versus 2·4 mg (five [4·9%] of 103) and placebo (none). Among people with obesity and type 2 diabetes, semaglutide 7·2 mg was superior to placebo in reducing bodyweight, waist circumference, and HbA. Safety and tolerability were comparable between semaglutide 7·2 mg and 2·4 mg, except for the imbalance in dysaesthesia. Novo Nordisk. For the Bulgarian, Hungarian and Polish translations of the abstract see Supplementary Materials section.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Semaglutide 2·4 mg is approved for weight management in adults with obesity or overweight in the presence of at least one obesity-related complication; however, many people with obesity and type 2 diabetes do not reach their bodyweight reduction goals with this dose. We aimed to investigate the efficacy and safety of a new 7·2 mg maintenance dose of once-weekly subcutaneous semaglutide in people with obesity and type 2 diabetes."
        },
        {
          "label": "METHODS",
          "text": "STEP UP T2D was a randomised, phase 3b, double-blind controlled, three-arm, parallel-group trial conducted at 68 hospitals, specialist clinics, and medical centres in Bulgaria, Canada, Hungary, Poland, Portugal, Slovakia, South Africa, and the USA. Adults aged 18 years or older (BMI ≥30·0 kg/m, HbA 7·0-10·0% [53-86 mmol/mol]) were randomly assigned (3:1:1) to receive once-weekly subcutaneous semaglutide 7·2 mg, 2·4 mg, or placebo, alongside a lifestyle intervention, for 72 weeks. Coprimary endpoints were the percentage change in bodyweight and the proportion of participants reaching a bodyweight reduction of 5% or greater with semaglutide 7·2 mg versus placebo. Confirmatory secondary endpoints were the proportion of participants reaching a bodyweight reduction of 10% or greater, 15% or greater, and 20% or greater, and changes in waist circumference (cm) and HbA (%) with semaglutide 7·2 mg versus placebo. Efficacy was assessed in all randomly assigned participants, and safety was assessed in all randomly assigned participants who received at least one dose of the trial product. This trial is registered with ClinicalTrials.gov (NCT05649137) and is now closed and completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between Jan 4 and May 4, 2023, 512 participants were randomly assigned to receive semaglutide 7·2 mg (n=307), semaglutide 2·4 mg (n=103), or placebo (n=102). 265 (51·8%) of 512 participants were female, the mean age was 56 (SD 10) years, mean bodyweight was 110·1 (22·9) kg, mean BMI was 38·6 (7·1) kg/m, and mean HbA was 8·1% (0·9). Compared with placebo, semaglutide 7·2 mg led to greater reductions in mean bodyweight (-13·2% vs -3·9%; estimated treatment difference [ETD] -9·3% [95% CI -11·0 to -7·7]; p<0·0001); more participants reaching bodyweight reductions of 5% or greater (odds ratio 10·0 [95% CI 6·0 to 16·9]; p<0·0001), 10% or greater (11·3 [5·9 to 21·4]; p<0·0001), 15% or greater (8·1 [3·7 to 17·7]; p<0·0001), and 20% or greater (12·3 [3·0 to 51·0]; p=0·0006); and reduced waist circumference (ETD -6·5 cm [95% CI -9·0 to -4·1]; p<0·0001) and HbA (ETD -1·5% [95% CI -1·8 to -1·2]; p<0·0001). Level 2-3 hypoglycaemia risk was low and comparable between semaglutide doses and placebo. Gastrointestinal events were reported by 163 (53·1%) of 307 participants with semaglutide 7·2 mg, 53 (51·5%) of 103 participants with semaglutide 2·4 mg, 26 (25·5%) of 102 participants with placebo; and serious adverse events were reported by 28 (9·1%) participants with semaglutide 7·2 mg, nine (8·7%) participants with semaglutide 2·4 mg, and nine (8·8%) participants with placebo. Dysaesthesia was more common with semaglutide 7·2 mg (58 [18·9%] of 307) versus 2·4 mg (five [4·9%] of 103) and placebo (none)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Among people with obesity and type 2 diabetes, semaglutide 7·2 mg was superior to placebo in reducing bodyweight, waist circumference, and HbA. Safety and tolerability were comparable between semaglutide 7·2 mg and 2·4 mg, except for the imbalance in dysaesthesia."
        },
        {
          "label": "FUNDING",
          "text": "Novo Nordisk."
        },
        {
          "label": "TRANSLATIONS",
          "text": "For the Bulgarian, Hungarian and Polish translations of the abstract see Supplementary Materials section."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40961953/",
      "pubDate": "2025 Sep 14",
      "doi": "10.1016/S2213-8587(25)00225-6",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "Semaglutide 7.2 mg demonstrated superior efficacy in weight reduction compared to placebo in adults with obesity and type 2 diabetes."
    },
    {
      "id": "fa62b78ea636",
      "title": "Cardiovascular Effects and Tolerability of GLP-1 Receptor Agonists: A Systematic Review and Meta-Analysis of 99,599 Patients.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117706",
      "abstract": "Glucagon-like peptide-1 receptor agonists (GLP-1 RAs) have demonstrated significant cardiovascular (CV) benefits, particularly in patients with diabetes mellitus, but the safety and efficacy of different GLP-1 RAs across diverse populations remain insufficiently defined. Previous meta-analyses of GLP-1 RAs have been limited by restricted populations, omission of recent trials, or incomplete safety synthesis; this study integrates the latest evidence across 21 randomized controlled trials and diverse populations using advanced meta-analytic methods. Randomized controlled trials comparing GLP-1 RAs vs controls or placebo were included. Analyses were conducted in prespecified subgroups based on the GLP-1 RA used. Prespecified subgroups according to diabetes mellitus, kidney function, obesity, or heart failure were also performed. Main outcomes comprised mortality (all-cause and CV), trial-defined major adverse cardiovascular events (MACE) and serious adverse events. GRADE (Grading of Recommendations Assessment, Development and Evaluation) and trial sequential analyses were performed to evaluate certainty and conclusiveness of findings, respectively. A total of 21 trials encompassing 99,599 patients were included. Eight different GLP-1 RAs were used (lixisenatide, liraglutide, exenatide, semaglutide, efpeglenatide, dulaglutide, albiglutide, and tirzepatide), each administered at therapeutic doses and compared vs placebo or controls. Mean follow-up duration was 2.4 years. We found conclusive, high-certainty evidence that GLP-1 RAs reduced all-cause death (incidence rate ratio [IRR]: 0.88; 95% CI: 0.84-0.92; needed to treat [NNT] = 121), CV death (IRR: 0.87; 95% CI: 0.81-0.92; NNT = 170), and MACE (IRR: 0.87; 95% CI: 0.83-0.91; NNT = 66), compared with controls. GLP-1 RAs reduced serious adverse events (-9%), myocardial infarction (-15%), acute kidney failure (-9%), heart failure (-15%), and infections (-10%), but increased gastrointestinal (+63%) and gallbladder (+26%) disorders. There were no differences in stroke, pancreatitis, or neoplasm between groups. Results were mostly consistent across subgroups. Analysis by GLP-1 RA type revealed potential differences in efficacy and safety profiles. GLP-1 RAs reduce mortality and MACE in high-risk populations, highlighting benefits beyond glycemic control. These come at increased gastrointestinal and gallbladder risks. Variation in efficacy and tolerability supports tailoring GLP-1 RA therapy to individual patient characteristics and treatment goals. (PROSPERO [GLP-1 RAs Reduce Mortality and Cardiovascular Events Across the Spectrum of Treated Patients: A Systematic Review and Meta-Analysis; CRD420251032222]).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Glucagon-like peptide-1 receptor agonists (GLP-1 RAs) have demonstrated significant cardiovascular (CV) benefits, particularly in patients with diabetes mellitus, but the safety and efficacy of different GLP-1 RAs across diverse populations remain insufficiently defined."
        },
        {
          "label": "OBJECTIVES",
          "text": "Previous meta-analyses of GLP-1 RAs have been limited by restricted populations, omission of recent trials, or incomplete safety synthesis; this study integrates the latest evidence across 21 randomized controlled trials and diverse populations using advanced meta-analytic methods."
        },
        {
          "label": "METHODS",
          "text": "Randomized controlled trials comparing GLP-1 RAs vs controls or placebo were included. Analyses were conducted in prespecified subgroups based on the GLP-1 RA used. Prespecified subgroups according to diabetes mellitus, kidney function, obesity, or heart failure were also performed. Main outcomes comprised mortality (all-cause and CV), trial-defined major adverse cardiovascular events (MACE) and serious adverse events. GRADE (Grading of Recommendations Assessment, Development and Evaluation) and trial sequential analyses were performed to evaluate certainty and conclusiveness of findings, respectively."
        },
        {
          "label": "RESULTS",
          "text": "A total of 21 trials encompassing 99,599 patients were included. Eight different GLP-1 RAs were used (lixisenatide, liraglutide, exenatide, semaglutide, efpeglenatide, dulaglutide, albiglutide, and tirzepatide), each administered at therapeutic doses and compared vs placebo or controls. Mean follow-up duration was 2.4 years. We found conclusive, high-certainty evidence that GLP-1 RAs reduced all-cause death (incidence rate ratio [IRR]: 0.88; 95% CI: 0.84-0.92; needed to treat [NNT] = 121), CV death (IRR: 0.87; 95% CI: 0.81-0.92; NNT = 170), and MACE (IRR: 0.87; 95% CI: 0.83-0.91; NNT = 66), compared with controls. GLP-1 RAs reduced serious adverse events (-9%), myocardial infarction (-15%), acute kidney failure (-9%), heart failure (-15%), and infections (-10%), but increased gastrointestinal (+63%) and gallbladder (+26%) disorders. There were no differences in stroke, pancreatitis, or neoplasm between groups. Results were mostly consistent across subgroups. Analysis by GLP-1 RA type revealed potential differences in efficacy and safety profiles."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1 RAs reduce mortality and MACE in high-risk populations, highlighting benefits beyond glycemic control. These come at increased gastrointestinal and gallbladder risks. Variation in efficacy and tolerability supports tailoring GLP-1 RA therapy to individual patient characteristics and treatment goals. (PROSPERO [GLP-1 RAs Reduce Mortality and Cardiovascular Events Across the Spectrum of Treated Patients: A Systematic Review and Meta-Analysis; CRD420251032222])."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892610/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.027",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "GLP-1 receptor agonists (RAs) decrease mortality and major adverse cardiovascular events (MACE) in high-risk patients, but are associated with increased gastrointestinal and gallbladder risks, necessitating individualized treatment approaches."
    },
    {
      "id": "8a69227157df",
      "title": "Efficacy and safety of tirzepatide in children and adolescents with type 2 diabetes (SURPASS-PEDS): a randomised, double-blind, placebo-controlled, phase 3 trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117668",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true
    },
    {
      "id": "1b042009b0a9",
      "title": "Transcatheter or Surgical Treatment of Patients With Aortic Stenosis at Low to Intermediate Risk: An Individual Participant Data Meta-Analysis.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48430414/117652",
      "abstract": "Transcatheter aortic valve replacement (TAVR) reintervention is performed by either redo TAVR or TAVR explant. There is insufficient data on contemporary TAVR reintervention procedural incidence and volume. To evaluate contemporary procedural volumes of redo TAVR and TAVR explant. This retrospective analysis of redo TAVR and TAVR explant annual incidence and procedural volume was performed from January 2012 to June 2024. For comprehensive assessment of aortic valve replacement, analysis of SAVR reintervention annual incidence and procedural volume was also performed. Data were obtained through the US Centers for Medicare & Medicaid Services Virtual Research Data Center. Patients with prior TAVR or SAVR who underwent subsequent TAVR or SAVR were included. Patients who underwent a TAVR after TAVR defined the redo TAVR group, while patients who underwent SAVR after TAVR defined the TAVR explant group. Patients who underwent a TAVR after SAVR defined the valve-in-valve (ViV) TAVR group, while patients who underwent SAVR after SAVR defined the redo SAVR group. Analysis of annual incidences and procedural volumes of all groups at different time intervals was conducted. The primary outcome was annual incidence and procedural volume of both redo TAVR and TAVR explant. The secondary outcome was annual incidence and procedural volume of both ViV TAVR and redo SAVR. Of 410 720 total TAVRs from 2012 to 2024, 2374 redo TAVRs and 1346 TAVR explants were identified. Of 299 780 total SAVRs from 2012 to 2024, 5044 ViV-TAVRs and 4202 redo SAVRs were identified. Since 2020, there have been 1518 redo TAVRs and 1007 TAVR explants. The annual incidence of TAVR reintervention has changed from 0.17% in 2019 to 0.28% in 2023. Although the most common time interval for redo TAVR after index TAVR was within 3 months (410 of 2374 [17.3%]) and for TAVR explant after index TAVR was 1 to 2 years (259 of 1346 [19.2%]), redo TAVR was the predominant procedure beyond 5 years from the index TAVR (725 of 819 [88.5%]). In this study, annual volumes of both redo TAVR and TAVR explant continued to increase, particularly in recent years. Redo TAVR is frequently performed over 5 years from the index TAVR. Future analysis to determine the appropriate TAVR reintervention strategy for individual patients is needed.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Transcatheter aortic valve replacement (TAVR) reintervention is performed by either redo TAVR or TAVR explant. There is insufficient data on contemporary TAVR reintervention procedural incidence and volume."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate contemporary procedural volumes of redo TAVR and TAVR explant."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This retrospective analysis of redo TAVR and TAVR explant annual incidence and procedural volume was performed from January 2012 to June 2024. For comprehensive assessment of aortic valve replacement, analysis of SAVR reintervention annual incidence and procedural volume was also performed. Data were obtained through the US Centers for Medicare & Medicaid Services Virtual Research Data Center. Patients with prior TAVR or SAVR who underwent subsequent TAVR or SAVR were included."
        },
        {
          "label": "EXPOSURES",
          "text": "Patients who underwent a TAVR after TAVR defined the redo TAVR group, while patients who underwent SAVR after TAVR defined the TAVR explant group. Patients who underwent a TAVR after SAVR defined the valve-in-valve (ViV) TAVR group, while patients who underwent SAVR after SAVR defined the redo SAVR group. Analysis of annual incidences and procedural volumes of all groups at different time intervals was conducted."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was annual incidence and procedural volume of both redo TAVR and TAVR explant. The secondary outcome was annual incidence and procedural volume of both ViV TAVR and redo SAVR."
        },
        {
          "label": "RESULTS",
          "text": "Of 410 720 total TAVRs from 2012 to 2024, 2374 redo TAVRs and 1346 TAVR explants were identified. Of 299 780 total SAVRs from 2012 to 2024, 5044 ViV-TAVRs and 4202 redo SAVRs were identified. Since 2020, there have been 1518 redo TAVRs and 1007 TAVR explants. The annual incidence of TAVR reintervention has changed from 0.17% in 2019 to 0.28% in 2023. Although the most common time interval for redo TAVR after index TAVR was within 3 months (410 of 2374 [17.3%]) and for TAVR explant after index TAVR was 1 to 2 years (259 of 1346 [19.2%]), redo TAVR was the predominant procedure beyond 5 years from the index TAVR (725 of 819 [88.5%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this study, annual volumes of both redo TAVR and TAVR explant continued to increase, particularly in recent years. Redo TAVR is frequently performed over 5 years from the index TAVR. Future analysis to determine the appropriate TAVR reintervention strategy for individual patients is needed."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40991268/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1001/jamacardio.2025.3224",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "Both redo TAVR and TAVR explant procedures are increasing, with redo TAVR often occurring more than five years after the initial procedure, necessitating further research into personalized reintervention strategies."
    },
    {
      "id": "f9d2d78e4e39",
      "title": "Rifasutenizol-based triple therapy versus bismuth plus clarithromycin-based triple therapy for first-line treatment of Helicobacter pylori infection in China (EVEREST-HP): a phase 3, multicentre, randomised, triple-dummy, double-blind, controlled, non-inferiority trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Gastroenterology",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48419814/117759",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true
    },
    {
      "id": "50226d1651d7",
      "title": "Once-weekly semaglutide 7.2 mg in adults with obesity (STEP UP): a randomised, controlled, phase 3b trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48419814/117710",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true
    },
    {
      "id": "213c5e7d7455",
      "title": "Safety of Factor XI Inhibition With Abelacimab in Atrial Fibrillation by Kidney Function: A Prespecified Analysis of the AZALEA-TIMI 71 Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48419814/117656",
      "abstract": "Chronic kidney disease is common in patients with atrial fibrillation (AF) and is associated with higher rates of bleeding with anticoagulation. In the AZALEA-TIMI 71 randomized clinical trial, abelacimab, a novel factor XI inhibitor, reduced rates of major or clinically relevant nonmajor (CRNM) bleeding compared with rivaroxaban in patients with AF. To examine the safety of abelacimab vs rivaroxaban across a range of kidney function. The AZALEA-TIMI 71 study randomized patients with AF to 1 of 2 abelacimab doses (150 mg or 90 mg monthly) or to rivaroxaban, with stratification by creatinine clearance (CrCl). Patients with CrCl less than 15 mL/min or receiving dialysis were excluded. This secondary analysis of AZALEA-TIMI 71 examines outcomes by randomized treatment and CrCl at randomization. Patients randomized to rivaroxaban with a CrCl greater than 50 mL/min received rivaroxaban, 20 mg, daily, and those with a CrCl of 50 mL/min or less received rivaroxaban, 15 mg, daily. Patients randomized to abelacimab received the assigned dose irrespective of CrCl. The primary outcome was major bleeding or CRNM bleeding. Among 1284 patients, median (IQR) age was 74 (69-78) years and 572 patients (44.5%) were female. Median (IQR) CrCl was 71 (54-90) mL/min, with 264 patients (20.6%) having a CrCl of 50 mL/min or less. In the rivaroxaban group, patients with CrCl of 50 mL/min or less experienced higher rates of major or CRNM bleeding compared with those with CrCl greater than 50 mL/min despite dose reduction (incidence rates, 13.6 vs 7.0 per 100 person-years). Abelacimab reduced major or CRNM bleeding vs rivaroxaban irrespective of CrCl (CrCl ≤50 mL/min: hazard ratio [HR], 0.26; 95% CI, 0.12-0.54; >50 mL/min: HR, 0.40; 95% CI, 0.26-0.62; P value for interaction = .33), with absolute risk reductions of 10.1 vs 4.2 per 100 person-years in those with CrCl of 50 mL/min or less vs greater than 50 mL/min, respectively (P value for interaction = .09). This risk reduction was consistent for major bleeding alone and for a broader composite inclusive of major, CRNM, and minor bleeding. Results were similar when comparing the individual abelacimab doses to rivaroxaban. In this secondary analysis of the AZALEA-TIMI 71 randomized clinical trial, abelacimab consistently reduced the risk of bleeding relative to rivaroxaban irrespective of kidney function. These findings suggest that abelacimab may offer a particularly favorable safety profile among those with chronic kidney disease; however, larger studies are necessary to characterize the efficacy of abelacimab for stroke prevention in AF.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Chronic kidney disease is common in patients with atrial fibrillation (AF) and is associated with higher rates of bleeding with anticoagulation. In the AZALEA-TIMI 71 randomized clinical trial, abelacimab, a novel factor XI inhibitor, reduced rates of major or clinically relevant nonmajor (CRNM) bleeding compared with rivaroxaban in patients with AF."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine the safety of abelacimab vs rivaroxaban across a range of kidney function."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The AZALEA-TIMI 71 study randomized patients with AF to 1 of 2 abelacimab doses (150 mg or 90 mg monthly) or to rivaroxaban, with stratification by creatinine clearance (CrCl). Patients with CrCl less than 15 mL/min or receiving dialysis were excluded. This secondary analysis of AZALEA-TIMI 71 examines outcomes by randomized treatment and CrCl at randomization."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients randomized to rivaroxaban with a CrCl greater than 50 mL/min received rivaroxaban, 20 mg, daily, and those with a CrCl of 50 mL/min or less received rivaroxaban, 15 mg, daily. Patients randomized to abelacimab received the assigned dose irrespective of CrCl."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURE",
          "text": "The primary outcome was major bleeding or CRNM bleeding."
        },
        {
          "label": "RESULTS",
          "text": "Among 1284 patients, median (IQR) age was 74 (69-78) years and 572 patients (44.5%) were female. Median (IQR) CrCl was 71 (54-90) mL/min, with 264 patients (20.6%) having a CrCl of 50 mL/min or less. In the rivaroxaban group, patients with CrCl of 50 mL/min or less experienced higher rates of major or CRNM bleeding compared with those with CrCl greater than 50 mL/min despite dose reduction (incidence rates, 13.6 vs 7.0 per 100 person-years). Abelacimab reduced major or CRNM bleeding vs rivaroxaban irrespective of CrCl (CrCl ≤50 mL/min: hazard ratio [HR], 0.26; 95% CI, 0.12-0.54; >50 mL/min: HR, 0.40; 95% CI, 0.26-0.62; P value for interaction = .33), with absolute risk reductions of 10.1 vs 4.2 per 100 person-years in those with CrCl of 50 mL/min or less vs greater than 50 mL/min, respectively (P value for interaction = .09). This risk reduction was consistent for major bleeding alone and for a broader composite inclusive of major, CRNM, and minor bleeding. Results were similar when comparing the individual abelacimab doses to rivaroxaban."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this secondary analysis of the AZALEA-TIMI 71 randomized clinical trial, abelacimab consistently reduced the risk of bleeding relative to rivaroxaban irrespective of kidney function. These findings suggest that abelacimab may offer a particularly favorable safety profile among those with chronic kidney disease; however, larger studies are necessary to characterize the efficacy of abelacimab for stroke prevention in AF."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888686/",
      "pubDate": "2025 Sep 01",
      "doi": "10.1001/jamacardio.2025.3393",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "Abelacimab demonstrated a reduced bleeding risk compared to rivaroxaban across varying levels of kidney function."
    },
    {
      "id": "45ad6293436f",
      "title": "Misoprostol for intrauterine device placement.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Gynecology",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48408725/117776",
      "abstract": "Identifying effective approaches to reduce pain and improve providers' ease of intrauterine device (IUD) placement may reduce barriers to IUD access and use. The cervical softening and dilation effects of misoprostol might make IUD placement less painful for women and technically easier for providers. However, evidence suggests that misoprostol does not improve many outcomes and may only be helpful for some patients (e.g. those with a recent failed IUD placement). To examine the effect of misoprostol for routine IUD placement on patient and provider outcomes compared to placebo or no treatment. In November 2021 we searched CENTRAL, MEDLINE, Embase, Cumulative Index to Nursing and Allied Health Literature (CINAHL), and ClinicalTrials.gov. We conducted update searches in July 2022 and September 2024. We searched the World Health Organization International Clinical Trials Registry Platform (WHO ICTRP) in July 2025. We included randomized controlled trials (RCTs) of women undergoing interval IUD placement (i.e. placement outside the postabortion or postpartum period) that compared misoprostol to placebo or no treatment. We included trials that examined the placement of currently available levonorgestrel (LNG)-releasing IUDs, or any copper T IUD, for women of any age, of any parity, and for any indication. Our core critical and important outcomes were pain (during tenaculum placement, during IUD placement, and after IUD placement before clinic discharge); providers' ease of placement; need for cervical dilation; placement success; patient satisfaction; misoprostol side effects (preplacement abdominal pain or cramping, and diarrhea); and adverse events (vasovagal reaction). We used the Risk of Bias 2 tool (RoB 2) to assess the risk of bias for outcomes. We synthesized results for each outcome using meta-analysis. We calculated mean differences (MD) for continuous outcomes using inverse variance estimation and random-effects models. We calculated risk ratios (RR) for dichotomous outcomes using Mantel-Haenszel estimation and random-effects models. We used GRADE to assess the certainty of evidence for each outcome. We included 14 RCTs with a total of 1972 women. The trials were conducted in North America, South America, Europe and Africa, and were published between 2007 and 2022. The results below summarize the effect of misoprostol on outcomes compared to placebo or no treatment. Pain: misoprostol results in little to no difference in pain during tenaculum placement (MD -0.73, 95% confidence interval [CI] -1.19 to -0.28; 3 RCTs, 261 women; high-certainty evidence) and after IUD placement before clinic discharge (MD -0.01, 95% CI -0.45 to 0.43; 5 RCTs, 448 women; high-certainty evidence). Misoprostol may result in little to no difference in pain during IUD placement (MD -0.47, 95% CI -1.23 to 0.29; 7 RCTs, 766 women; low-certainty evidence). Providers' ease of placement: misoprostol may result in little to no difference in a clinically meaningful effect on ease of IUD placement for providers (MD -0.89, 95% CI -1.55 to -0.22; 8 RCTs, 848 women; low-certainty evidence). Need for cervical dilation: misoprostol may result in little to no difference in need for cervical dilation for women without a recent failed placement attempt (RR 0.84, 95% CI 0.38 to 1.85; 6 RCTs, 562 women; low-certainty evidence). Misoprostol probably results in little to no difference in need for cervical dilation for women with a recent failed placement attempt (RR 0.88, 95% CI 0.56 to 1.36; 1 RCT, 90 women; moderate-certainty evidence). Placement success: misoprostol probably results in little to no difference in placement success for women without a recent failed placement attempt (RR 1.01, 95% CI 0.98 to 1.04; 12 RCTs, 1579 women; moderate-certainty evidence) but probably results in a slight increase in placement success for women with a recent failed placement attempt (RR 1.41, 95% CI 1.09 to 1.83; 1 RCT, 90 women; moderate-certainty evidence). Patient satisfaction: misoprostol may increase women's satisfaction with the IUD placement procedure, but the evidence is very uncertain (MD 2.00, 95% CI -0.05 to 4.06; 2 RCTs, 226 women; very low-certainty evidence) Misoprostol side effects before clinic discharge: misoprostol probably results in an increase in preplacement abdominal pain or cramping (RR 2.14, 95% CI 1.42 to 3.23; 7 RCTs, 781 women; moderate-certainty evidence)and probably results in a slight increase in diarrhea (RR 1.76, 95% CI 1.01 to 3.06; 9 RCTs, 940 women; moderate-certainty evidence). Adverse events before clinic discharge: misoprostol may result in little to no difference in vasovagal reaction (RR 0.94, 95% CI 0.37 to 2.37; 6 RCTs [3 RCTs had 0 events], 780 women; low-certainty evidence). We downgraded the evidence due to serious concerns about inconsistency and serious or very serious concerns about imprecision. Evidence from RCTs of women seeking routine IUD placement suggests that receiving misoprostol compared to placebo or no treatment makes little to no difference to pain during tenaculum placement or after IUD placement; and may make little to no difference to pain during IUD placement. Misoprostol may make little to no difference to reduced vasovagal reaction, improved providers' ease of placement, or reduced need for cervical dilation; and probably makes little to no difference to placement success, except for women with a recent failed IUD placement attempt, where misoprostol probably leads to a clinically meaningful increase in placement success. Misoprostol use probably leads to clinically important increases in harms, specifically preplacement abdominal pain or cramping and diarrhea. Misoprostol may increase patient satisfaction with the IUD placement procedure, but the evidence is very uncertain. The number of available RCTs did not support examining effect modifiers such as prior vaginal delivery status, misoprostol dose, or IUD type. This review was supported in part by an appointment to the Research Participation Program at the Centers for Disease Control and Prevention (CDC) administered by the Oak Ridge Institute for Science and Education. Protocol (2022): doi.org/10.1002/14651858.CD015584.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Identifying effective approaches to reduce pain and improve providers' ease of intrauterine device (IUD) placement may reduce barriers to IUD access and use. The cervical softening and dilation effects of misoprostol might make IUD placement less painful for women and technically easier for providers. However, evidence suggests that misoprostol does not improve many outcomes and may only be helpful for some patients (e.g. those with a recent failed IUD placement)."
        },
        {
          "label": "OBJECTIVES",
          "text": "To examine the effect of misoprostol for routine IUD placement on patient and provider outcomes compared to placebo or no treatment."
        },
        {
          "label": "SEARCH METHODS",
          "text": "In November 2021 we searched CENTRAL, MEDLINE, Embase, Cumulative Index to Nursing and Allied Health Literature (CINAHL), and ClinicalTrials.gov. We conducted update searches in July 2022 and September 2024. We searched the World Health Organization International Clinical Trials Registry Platform (WHO ICTRP) in July 2025."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) of women undergoing interval IUD placement (i.e. placement outside the postabortion or postpartum period) that compared misoprostol to placebo or no treatment. We included trials that examined the placement of currently available levonorgestrel (LNG)-releasing IUDs, or any copper T IUD, for women of any age, of any parity, and for any indication."
        },
        {
          "label": "OUTCOMES",
          "text": "Our core critical and important outcomes were pain (during tenaculum placement, during IUD placement, and after IUD placement before clinic discharge); providers' ease of placement; need for cervical dilation; placement success; patient satisfaction; misoprostol side effects (preplacement abdominal pain or cramping, and diarrhea); and adverse events (vasovagal reaction)."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Risk of Bias 2 tool (RoB 2) to assess the risk of bias for outcomes."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesized results for each outcome using meta-analysis. We calculated mean differences (MD) for continuous outcomes using inverse variance estimation and random-effects models. We calculated risk ratios (RR) for dichotomous outcomes using Mantel-Haenszel estimation and random-effects models. We used GRADE to assess the certainty of evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 14 RCTs with a total of 1972 women. The trials were conducted in North America, South America, Europe and Africa, and were published between 2007 and 2022."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "The results below summarize the effect of misoprostol on outcomes compared to placebo or no treatment. Pain: misoprostol results in little to no difference in pain during tenaculum placement (MD -0.73, 95% confidence interval [CI] -1.19 to -0.28; 3 RCTs, 261 women; high-certainty evidence) and after IUD placement before clinic discharge (MD -0.01, 95% CI -0.45 to 0.43; 5 RCTs, 448 women; high-certainty evidence). Misoprostol may result in little to no difference in pain during IUD placement (MD -0.47, 95% CI -1.23 to 0.29; 7 RCTs, 766 women; low-certainty evidence). Providers' ease of placement: misoprostol may result in little to no difference in a clinically meaningful effect on ease of IUD placement for providers (MD -0.89, 95% CI -1.55 to -0.22; 8 RCTs, 848 women; low-certainty evidence). Need for cervical dilation: misoprostol may result in little to no difference in need for cervical dilation for women without a recent failed placement attempt (RR 0.84, 95% CI 0.38 to 1.85; 6 RCTs, 562 women; low-certainty evidence). Misoprostol probably results in little to no difference in need for cervical dilation for women with a recent failed placement attempt (RR 0.88, 95% CI 0.56 to 1.36; 1 RCT, 90 women; moderate-certainty evidence). Placement success: misoprostol probably results in little to no difference in placement success for women without a recent failed placement attempt (RR 1.01, 95% CI 0.98 to 1.04; 12 RCTs, 1579 women; moderate-certainty evidence) but probably results in a slight increase in placement success for women with a recent failed placement attempt (RR 1.41, 95% CI 1.09 to 1.83; 1 RCT, 90 women; moderate-certainty evidence). Patient satisfaction: misoprostol may increase women's satisfaction with the IUD placement procedure, but the evidence is very uncertain (MD 2.00, 95% CI -0.05 to 4.06; 2 RCTs, 226 women; very low-certainty evidence) Misoprostol side effects before clinic discharge: misoprostol probably results in an increase in preplacement abdominal pain or cramping (RR 2.14, 95% CI 1.42 to 3.23; 7 RCTs, 781 women; moderate-certainty evidence)and probably results in a slight increase in diarrhea (RR 1.76, 95% CI 1.01 to 3.06; 9 RCTs, 940 women; moderate-certainty evidence). Adverse events before clinic discharge: misoprostol may result in little to no difference in vasovagal reaction (RR 0.94, 95% CI 0.37 to 2.37; 6 RCTs [3 RCTs had 0 events], 780 women; low-certainty evidence). We downgraded the evidence due to serious concerns about inconsistency and serious or very serious concerns about imprecision."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Evidence from RCTs of women seeking routine IUD placement suggests that receiving misoprostol compared to placebo or no treatment makes little to no difference to pain during tenaculum placement or after IUD placement; and may make little to no difference to pain during IUD placement. Misoprostol may make little to no difference to reduced vasovagal reaction, improved providers' ease of placement, or reduced need for cervical dilation; and probably makes little to no difference to placement success, except for women with a recent failed IUD placement attempt, where misoprostol probably leads to a clinically meaningful increase in placement success. Misoprostol use probably leads to clinically important increases in harms, specifically preplacement abdominal pain or cramping and diarrhea. Misoprostol may increase patient satisfaction with the IUD placement procedure, but the evidence is very uncertain. The number of available RCTs did not support examining effect modifiers such as prior vaginal delivery status, misoprostol dose, or IUD type."
        },
        {
          "label": "FUNDING",
          "text": "This review was supported in part by an appointment to the Research Participation Program at the Centers for Disease Control and Prevention (CDC) administered by the Oak Ridge Institute for Science and Education."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2022): doi.org/10.1002/14651858.CD015584."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40985300/",
      "pubDate": "2025 Sep 23",
      "doi": "10.1002/14651858.CD015584.pub2",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true,
      "summary": "Misoprostol offers little to no benefit for pain or placement success during routine IUD insertion, except for women with a recent failed attempt, but likely increases harms like abdominal pain and diarrhea."
    },
    {
      "id": "377c6801c0cf",
      "title": "A clinical decision tool including a decision tree, point-of-care testing of CRP, and safety-netting advice to guide antibiotic prescribing in acutely ill children in primary care in Belgium (ARON): a pragmatic, cluster-randomised, controlled trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48408725/117734",
      "dateReceived": "2025-10-14T23:23:18.337Z",
      "isNew": true
    },
    {
      "id": "edc6dfd54fd0",
      "title": "Using ``HINTS family`` to diagnose stroke in the acute vestibular syndrome: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48520543/117852",
      "abstract": "Acute vestibular syndrome (AVS) often arises from benign peripheral causes, yet the critical need to distinguish dangerous causes, notably stroke, persists. The Head Impulse test, Nystagmus, Test of Skew (HINTS) examination has emerged as a bedside test to identify stroke. HINTS plus hearing loss and video-oculography-HINTS (v-HINTS) have gained traction for stroke diagnosis. This systematic review and meta-analysis aims to assess the accuracy of the \"HINTS family\" of tests (HINTS, HINTS plus, v-HINTS) in diagnosing stroke in AVS. We searched PubMed, Embase, Web of Science, and Cochrane library for prospective studies involving AVS patients diagnosed using MRI and/or CT as the gold standard. Two authors independently screened articles, extracted data, and assessed study quality using QUADAS-2. A meta-analysis was performed using STATA (12.0) and RevMan 5.3. We included 11 studies in the analysis: 11 for HINTS (n = 1286), 2 for HINTS plus (n = 265), and 1 for v-HINTS (n = 50). Their sensitivities for stroke were 0.97 (95 %CI: 0.94-0.99), 0.99 (0.95-1.00) and 1.00, with specificities of 0.81 (0.72-0.88), 0.82 (0.74-0.88), and 0.90, respectively. LR+ for stroke were 5.2 (95 %CI: 3.3-8.2), 5.5 (3.8-8.2) and 9.75. Youden index were 0.78, 0.81 and 0.90. The AUC for HINTS and HINTS plus in diagnosing stroke were 0.98 and 0.99. \"HINTS Family\" examinations are generally effective in detecting stroke in AVS patients, especially those with stroke risk factors. HINTS plus outperforms the HINTS examination. Furthermore, v-HINTS exhibits the highest accuracy, highlighting the importance of using VOG devices for acute stroke diagnosis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Acute vestibular syndrome (AVS) often arises from benign peripheral causes, yet the critical need to distinguish dangerous causes, notably stroke, persists. The Head Impulse test, Nystagmus, Test of Skew (HINTS) examination has emerged as a bedside test to identify stroke. HINTS plus hearing loss and video-oculography-HINTS (v-HINTS) have gained traction for stroke diagnosis. This systematic review and meta-analysis aims to assess the accuracy of the \"HINTS family\" of tests (HINTS, HINTS plus, v-HINTS) in diagnosing stroke in AVS."
        },
        {
          "label": "METHOD",
          "text": "We searched PubMed, Embase, Web of Science, and Cochrane library for prospective studies involving AVS patients diagnosed using MRI and/or CT as the gold standard. Two authors independently screened articles, extracted data, and assessed study quality using QUADAS-2. A meta-analysis was performed using STATA (12.0) and RevMan 5.3."
        },
        {
          "label": "RESULTS",
          "text": "We included 11 studies in the analysis: 11 for HINTS (n = 1286), 2 for HINTS plus (n = 265), and 1 for v-HINTS (n = 50). Their sensitivities for stroke were 0.97 (95 %CI: 0.94-0.99), 0.99 (0.95-1.00) and 1.00, with specificities of 0.81 (0.72-0.88), 0.82 (0.74-0.88), and 0.90, respectively. LR+ for stroke were 5.2 (95 %CI: 3.3-8.2), 5.5 (3.8-8.2) and 9.75. Youden index were 0.78, 0.81 and 0.90. The AUC for HINTS and HINTS plus in diagnosing stroke were 0.98 and 0.99."
        },
        {
          "label": "CONCLUSION",
          "text": "\"HINTS Family\" examinations are generally effective in detecting stroke in AVS patients, especially those with stroke risk factors. HINTS plus outperforms the HINTS examination. Furthermore, v-HINTS exhibits the highest accuracy, highlighting the importance of using VOG devices for acute stroke diagnosis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41045791/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1016/j.ajem.2025.08.066",
      "dateReceived": "2025-10-14T23:23:18.336Z",
      "isNew": true,
      "summary": "In patients with acute vestibular syndrome (AVS), the HINTS family of examinations effectively detects stroke, with v-HINTS using video-oculography (VOG) being the most accurate."
    },
    {
      "id": "db35cc31563f",
      "title": "Synchronised approach for intrauterine insemination in subfertile couples.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Gynecology",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48520543/117777",
      "abstract": "Intrauterine insemination (IUI) is widely used as a first-line treatment for subfertile couples with favourable prognostic factors, yet pregnancy rates vary considerably. The optimal method for timing IUI - whether through different monitoring strategies or ovulation triggering techniques in natural or stimulated cycles - remains uncertain. This review explores which timing approaches and methods of ovulation monitoring and triggering lead to the best outcomes, including live birth and clinical pregnancy. It updates a Cochrane review last published in 2014. To evaluate the effectiveness of different methods of synchronisation of insemination with ovulation on live birth or ongoing pregnancy, in natural and stimulated cycles for IUI in subfertile couples. We used the Cochrane Gynaecology and Fertility Group specialised register, CENTRAL, MEDLINE, and two other databases, along with reference checking, citation searching, handsearching of conference abstracts, and contact with study authors to identify the studies included in the review. The latest search date was October 2023. We included randomised controlled trials (RCTs) comparing timing methods in natural or stimulated cycles, and different ovulation triggering methods. These included: varying the time interval between ovulation triggering and insemination, luteinising hormone (LH) detection in urine, LH detection in blood, basal body temperature charts, ultrasound detection of ovulation, human chorionic gonadotropin (hCG) administration, a combination of LH detection and hCG administration, gonadotropin-releasing hormone (GnRH) agonist administration, and other trigger administrations. Critical outcome: live birth or ongoing pregnancy rate per couple. Important outcomes (all are rate per couple): clinical pregnancy; multiple pregnancy; miscarriage; ovarian hyperstimulation syndrome; tubal pregnancy. We used the Cochrane Collaboration's original tool to assess the risk of bias in the included RCTs. After the search, we screened the trials, extracted the data, and assessed the risk of bias and trustworthiness of the included studies. We synthesised results for each outcome using meta-analysis where possible. We expressed results for each included study as Mantel-Haenszel odds ratios (OR) with 95% confidence intervals (CI). We used GRADE to assess the certainty of the evidence for each outcome. This review update includes 42 studies: 18 from the 2014 version, plus 24 studies newly identified in the updated search. Of the 42 included studies (a total of 6603 couples), we included seven in the primary meta-analyses (1917 couples) and 12 in the sensitivity meta-analyses (2143 couples). The certainty of the evidence was low for most comparisons. The main limitation of the evidence was serious imprecision. Of the seven studies included in the primary analyses, two compared the optimum time interval from hCG injection to IUI for live birth or ongoing pregnancy rate, comparing different time frames ranging from 0 to 48 hours. We categorised the time frames into three groups: (i) 0 to 33 hours; (ii) 34 to 40 hours; and (iii) more than 40 hours. We compared 0 to 33 hours versus 34 to 40 hours, and 34 to 40 hours versus more than 40 hours. Results were too imprecise to be informative in both comparisons (0 to 33 hours versus 34 to 40 hours: OR 1.42, 95% CI 0.90 to 2.23; 1 study, 374 couples; 34 to 40 hours versus more than 40 hours: OR 0.45, 95% CI 0.15 to 1.33; 1 study, 107 couples). We included one study in the primary analysis for each of the following comparisons: hCG versus LH surge; recombinant hCG versus urinary hCG; and hCG alone versus hCG plus follicle-stimulating hormone (FSH). It is unclear whether there might be a difference in live birth or ongoing pregnancy rates in the first two comparisons: hCG versus LH surge: OR 1.08, 95% CI 0.50 to 2.37; 1 study, 392 couples; low-certainty evidence; recombinant hCG versus urinary hCG: OR 1.13, 95% CI 0.49 to 2.63; 1 study, 125 couples; low-certainty evidence. However, live birth or ongoing pregnancy rates may be lower with hCG alone compared to hCG plus FSH (OR 0.35, 95% CI 0.13 to 0.95; 1 study, 108 couples; low-certainty evidence). We found no clear evidence of a difference between any of the groups in clinical pregnancy rate or adverse events (multiple pregnancy rate, miscarriage rate, tubal pregnancy rate). However, all results were of low-certainty evidence. None of the studies included in the primary analyses reported on ovarian hyperstimulation syndrome. There is insufficient evidence to determine whether there is any difference in effectiveness between different methods of synchronisation of ovulation and insemination. This Cochrane review had no dedicated funding. First review update (2014): doi.org/10.1002/14651858.CD006942.pub3 Review (2010): doi.org/10.1002/14651858.CD006942.pub2 Protocol (2008): doi.org/10.1002/14651858.CD006942.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Intrauterine insemination (IUI) is widely used as a first-line treatment for subfertile couples with favourable prognostic factors, yet pregnancy rates vary considerably. The optimal method for timing IUI - whether through different monitoring strategies or ovulation triggering techniques in natural or stimulated cycles - remains uncertain. This review explores which timing approaches and methods of ovulation monitoring and triggering lead to the best outcomes, including live birth and clinical pregnancy. It updates a Cochrane review last published in 2014."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the effectiveness of different methods of synchronisation of insemination with ovulation on live birth or ongoing pregnancy, in natural and stimulated cycles for IUI in subfertile couples."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used the Cochrane Gynaecology and Fertility Group specialised register, CENTRAL, MEDLINE, and two other databases, along with reference checking, citation searching, handsearching of conference abstracts, and contact with study authors to identify the studies included in the review. The latest search date was October 2023."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) comparing timing methods in natural or stimulated cycles, and different ovulation triggering methods. These included: varying the time interval between ovulation triggering and insemination, luteinising hormone (LH) detection in urine, LH detection in blood, basal body temperature charts, ultrasound detection of ovulation, human chorionic gonadotropin (hCG) administration, a combination of LH detection and hCG administration, gonadotropin-releasing hormone (GnRH) agonist administration, and other trigger administrations."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcome: live birth or ongoing pregnancy rate per couple. Important outcomes (all are rate per couple): clinical pregnancy; multiple pregnancy; miscarriage; ovarian hyperstimulation syndrome; tubal pregnancy."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane Collaboration's original tool to assess the risk of bias in the included RCTs."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "After the search, we screened the trials, extracted the data, and assessed the risk of bias and trustworthiness of the included studies. We synthesised results for each outcome using meta-analysis where possible. We expressed results for each included study as Mantel-Haenszel odds ratios (OR) with 95% confidence intervals (CI). We used GRADE to assess the certainty of the evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This review update includes 42 studies: 18 from the 2014 version, plus 24 studies newly identified in the updated search."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Of the 42 included studies (a total of 6603 couples), we included seven in the primary meta-analyses (1917 couples) and 12 in the sensitivity meta-analyses (2143 couples). The certainty of the evidence was low for most comparisons. The main limitation of the evidence was serious imprecision. Of the seven studies included in the primary analyses, two compared the optimum time interval from hCG injection to IUI for live birth or ongoing pregnancy rate, comparing different time frames ranging from 0 to 48 hours. We categorised the time frames into three groups: (i) 0 to 33 hours; (ii) 34 to 40 hours; and (iii) more than 40 hours. We compared 0 to 33 hours versus 34 to 40 hours, and 34 to 40 hours versus more than 40 hours. Results were too imprecise to be informative in both comparisons (0 to 33 hours versus 34 to 40 hours: OR 1.42, 95% CI 0.90 to 2.23; 1 study, 374 couples; 34 to 40 hours versus more than 40 hours: OR 0.45, 95% CI 0.15 to 1.33; 1 study, 107 couples). We included one study in the primary analysis for each of the following comparisons: hCG versus LH surge; recombinant hCG versus urinary hCG; and hCG alone versus hCG plus follicle-stimulating hormone (FSH). It is unclear whether there might be a difference in live birth or ongoing pregnancy rates in the first two comparisons: hCG versus LH surge: OR 1.08, 95% CI 0.50 to 2.37; 1 study, 392 couples; low-certainty evidence; recombinant hCG versus urinary hCG: OR 1.13, 95% CI 0.49 to 2.63; 1 study, 125 couples; low-certainty evidence. However, live birth or ongoing pregnancy rates may be lower with hCG alone compared to hCG plus FSH (OR 0.35, 95% CI 0.13 to 0.95; 1 study, 108 couples; low-certainty evidence). We found no clear evidence of a difference between any of the groups in clinical pregnancy rate or adverse events (multiple pregnancy rate, miscarriage rate, tubal pregnancy rate). However, all results were of low-certainty evidence. None of the studies included in the primary analyses reported on ovarian hyperstimulation syndrome."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is insufficient evidence to determine whether there is any difference in effectiveness between different methods of synchronisation of ovulation and insemination."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "First review update (2014): doi.org/10.1002/14651858.CD006942.pub3 Review (2010): doi.org/10.1002/14651858.CD006942.pub2 Protocol (2008): doi.org/10.1002/14651858.CD006942."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40985294/",
      "pubDate": "2025 Sep 23",
      "doi": "10.1002/14651858.CD006942.pub4",
      "dateReceived": "2025-10-14T23:23:18.336Z",
      "isNew": true,
      "summary": "The effectiveness of different methods for synchronizing ovulation and insemination remains uncertain due to a lack of sufficient evidence."
    },
    {
      "id": "46f7744e59ac",
      "title": "Fractional flow reserve-guided renal artery stenting in atherosclerotic renovascular hypertension: the FAIR randomized trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48513868/117847",
      "abstract": "The optimal therapy for patients with atherosclerotic renal artery stenosis (ARAS) remains unresolved. This study compared the efficacy of renal fractional flow reserve (FFR)-guided revascularization and traditional angiography-guided revascularization. In total, 101 patients with ARAS and hypertension were randomly assigned to either the FFR-guided or angiography-guided group (ClinicalTrials.gov identifier: NCT05732077). Stenting was performed in the angiography-guided group regardless of FFR, whereas stenting was only performed in the FFR-guided group for patients with FFR < 0.80. The primary endpoints were the percentage changes in ambulatory daytime mean systolic blood pressure (DMSBP) and composite index of antihypertensive medicines (CIAHM) after 3 months. The percentage changes in DMSBP (4% [-2%, 11%] vs 4% [-3%, 10%]; P = .97) and CIAHM (0% [0%, 3%] vs 1% [0%, 4%]; P = .33) did not differ between groups. However, the rate of stenting was significantly lower in the FFR-guided group (46.0% vs 100.0%, P < .01). Moreover, compared with the findings in patients with FFR ≥ 0.80 who did not receive stenting, stenting was beneficial in patients with FFR < 0.80 (adjusted mean DMSBP reduction, 6.2 [95% confidence interval {CI}, 0.6-11.9] mmHg; mean CIAHM reduction, 3.1 [95% CI, 1.5-4.7]), but not in those with FFR ≥ 0.80 (1.4 [95% CI, -4.5-7.2] mmHg, and 0.7 [95% CI, -1.1-2.5], respectively). FFR-guided revascularization significantly reduced unnecessary stenting compared with angiography-guided revascularization. Both blood pressure and antihypertensive medication usage decreased significantly after stenting in patients with FFR < 0.80.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "The optimal therapy for patients with atherosclerotic renal artery stenosis (ARAS) remains unresolved. This study compared the efficacy of renal fractional flow reserve (FFR)-guided revascularization and traditional angiography-guided revascularization."
        },
        {
          "label": "METHODS",
          "text": "In total, 101 patients with ARAS and hypertension were randomly assigned to either the FFR-guided or angiography-guided group (ClinicalTrials.gov identifier: NCT05732077). Stenting was performed in the angiography-guided group regardless of FFR, whereas stenting was only performed in the FFR-guided group for patients with FFR < 0.80. The primary endpoints were the percentage changes in ambulatory daytime mean systolic blood pressure (DMSBP) and composite index of antihypertensive medicines (CIAHM) after 3 months."
        },
        {
          "label": "RESULTS",
          "text": "The percentage changes in DMSBP (4% [-2%, 11%] vs 4% [-3%, 10%]; P = .97) and CIAHM (0% [0%, 3%] vs 1% [0%, 4%]; P = .33) did not differ between groups. However, the rate of stenting was significantly lower in the FFR-guided group (46.0% vs 100.0%, P < .01). Moreover, compared with the findings in patients with FFR ≥ 0.80 who did not receive stenting, stenting was beneficial in patients with FFR < 0.80 (adjusted mean DMSBP reduction, 6.2 [95% confidence interval {CI}, 0.6-11.9] mmHg; mean CIAHM reduction, 3.1 [95% CI, 1.5-4.7]), but not in those with FFR ≥ 0.80 (1.4 [95% CI, -4.5-7.2] mmHg, and 0.7 [95% CI, -1.1-2.5], respectively)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "FFR-guided revascularization significantly reduced unnecessary stenting compared with angiography-guided revascularization. Both blood pressure and antihypertensive medication usage decreased significantly after stenting in patients with FFR < 0.80."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41056188/",
      "pubDate": "2025 Oct 07",
      "doi": "10.1093/eurheartj/ehaf746",
      "dateReceived": "2025-10-13T23:21:57.925Z",
      "isNew": false,
      "summary": "FFR-guided revascularization reduced unnecessary stenting and led to improved blood pressure control in patients with functionally significant stenosis."
    },
    {
      "id": "b2ce1033dac6",
      "title": "AGA Clinical Practice Guideline on Management of Gastroparesis.",
      "journal": "Gastroenterology",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48505184/117682",
      "abstract": "Gastroparesis is a complex gastric motility disorder characterized by nausea, vomiting, and other symptoms associated with a delay in gastric emptying in the absence of mechanical obstruction. Variations in diagnostic testing and limited effective treatments make caring for this patient population challenging. The American Gastroenterological Association developed this guideline to provide recommendations for ensuring an accurate diagnosis and identifying evidence-based, effective treatments among the available pharmacologic and procedural interventions for patients with idiopathic gastroparesis or gastroparesis related to diabetes. The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and develop this guideline. The Guideline Panel prioritized clinical questions and outcomes, conducted an evidence review, and used the Evidence to Decision Framework to develop recommendations. The Guideline Panel agreed on 12 recommendations. A conditional recommendation was issued against using 2-hour gastric emptying testing and in favor of 4-hour testing in patients with suspected gastroparesis. There are conditional recommendations for the use of metoclopramide and erythromycin in patients with gastroparesis. Conditional recommendations were issued against the use of domperidone, prucalopride, aprepitant, nortriptyline, buspirone, and cannabidiol as first-line therapies. In addition, conditional recommendations were issued against the routine initial use of gastric per-oral endoscopic pyloromyotomy or gastric electrical stimulation in patients with gastroparesis, reserving these treatments for select patients with symptoms refractory to medical therapies. No recommendation was given regarding the use of surgical pyloromyotomy and surgical pyloroplasty, which were identified as procedures with knowledge gaps in their use for treatment for gastroparesis. The diagnosis of gastroparesis requires the use of 4-hour gastric emptying tests. Metoclopramide or erythromycin is appropriate for initial pharmacologic treatment. Other treatment recommendations require shared patient-physician decision making. There are still considerable unmet needs in the treatment of gastroparesis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Gastroparesis is a complex gastric motility disorder characterized by nausea, vomiting, and other symptoms associated with a delay in gastric emptying in the absence of mechanical obstruction. Variations in diagnostic testing and limited effective treatments make caring for this patient population challenging. The American Gastroenterological Association developed this guideline to provide recommendations for ensuring an accurate diagnosis and identifying evidence-based, effective treatments among the available pharmacologic and procedural interventions for patients with idiopathic gastroparesis or gastroparesis related to diabetes."
        },
        {
          "label": "METHODS",
          "text": "The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and develop this guideline. The Guideline Panel prioritized clinical questions and outcomes, conducted an evidence review, and used the Evidence to Decision Framework to develop recommendations."
        },
        {
          "label": "RESULTS",
          "text": "The Guideline Panel agreed on 12 recommendations. A conditional recommendation was issued against using 2-hour gastric emptying testing and in favor of 4-hour testing in patients with suspected gastroparesis. There are conditional recommendations for the use of metoclopramide and erythromycin in patients with gastroparesis. Conditional recommendations were issued against the use of domperidone, prucalopride, aprepitant, nortriptyline, buspirone, and cannabidiol as first-line therapies. In addition, conditional recommendations were issued against the routine initial use of gastric per-oral endoscopic pyloromyotomy or gastric electrical stimulation in patients with gastroparesis, reserving these treatments for select patients with symptoms refractory to medical therapies. No recommendation was given regarding the use of surgical pyloromyotomy and surgical pyloroplasty, which were identified as procedures with knowledge gaps in their use for treatment for gastroparesis."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The diagnosis of gastroparesis requires the use of 4-hour gastric emptying tests. Metoclopramide or erythromycin is appropriate for initial pharmacologic treatment. Other treatment recommendations require shared patient-physician decision making. There are still considerable unmet needs in the treatment of gastroparesis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40976635/",
      "pubDate": "2025 Oct",
      "doi": "10.1053/j.gastro.2025.08.004",
      "dateReceived": "2025-10-12T23:21:43.657Z",
      "isNew": false,
      "summary": "Gastroparesis diagnosis relies on 4-hour gastric emptying tests, with metoclopramide or erythromycin as initial drug options, and further treatment decisions should be made collaboratively."
    },
    {
      "id": "5b3da9dddef8",
      "title": "Use of new CORE risk score to predict 10 year risk of liver cirrhosis in general population: population based cohort study.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48386031/117752",
      "abstract": "To develop and validate a novel risk prediction model for incident major adverse liver outcomes (MALO) in a primary care setting. Population based cohort study. Sweden, with validation in Finland and the UK. Model development in 480 651 individuals with no known history of liver disease and blood tests taken in primary care or at occupational healthcare screenings; validation in two cohorts with 24 191 and 449 806 individuals without known history of liver disease. 10 year risk of a composite outcome of compensated and decompensated cirrhosis, hepatocellular carcinoma, liver transplant, and liver related mortality, collectively referred to as MALO. A new risk model was created using flexible parametric survival models and several easily available laboratory based biomarkers. The model includes age, sex, aspartate aminotransferase, alanine aminotransferase, and γ-glutamyl transferase. The model's performance was assessed in terms of discrimination (time dependent area under the curve), calibration (calibration curves), and clinical utility (decision curve analysis). External validation was done using data from the UK Biobank and the FINRISK and Health 2000 cohorts and compared with the FIB-4 score. The median follow-up time was 28 years, and 7168 MALO events were observed in that time. The incident risk of MALO at 10 years was 0.27%. The new risk score, termed CORE (Cirrhosis Outcome Risk Estimator), achieved a 10 year area under the curve of 88% (95% confidence interval 87% to 89%) compared with 79% (78% to 80%) for FIB-4. The calibration of CORE was good in all three cohorts, and according to the decision curve analysis CORE provides a higher net benefit than FIB-4 for all risk thresholds. The CORE model, based on a flexible modelling approach and using biomarkers easily accessible in primary care, outperforms FIB-4 when predicting liver related outcomes in the general population and could be a novel means to stratify patients at risk for liver disease in the general population.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To develop and validate a novel risk prediction model for incident major adverse liver outcomes (MALO) in a primary care setting."
        },
        {
          "label": "DESIGN",
          "text": "Population based cohort study."
        },
        {
          "label": "SETTING",
          "text": "Sweden, with validation in Finland and the UK."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Model development in 480 651 individuals with no known history of liver disease and blood tests taken in primary care or at occupational healthcare screenings; validation in two cohorts with 24 191 and 449 806 individuals without known history of liver disease."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "10 year risk of a composite outcome of compensated and decompensated cirrhosis, hepatocellular carcinoma, liver transplant, and liver related mortality, collectively referred to as MALO."
        },
        {
          "label": "RESULTS",
          "text": "A new risk model was created using flexible parametric survival models and several easily available laboratory based biomarkers. The model includes age, sex, aspartate aminotransferase, alanine aminotransferase, and γ-glutamyl transferase. The model's performance was assessed in terms of discrimination (time dependent area under the curve), calibration (calibration curves), and clinical utility (decision curve analysis). External validation was done using data from the UK Biobank and the FINRISK and Health 2000 cohorts and compared with the FIB-4 score. The median follow-up time was 28 years, and 7168 MALO events were observed in that time. The incident risk of MALO at 10 years was 0.27%. The new risk score, termed CORE (Cirrhosis Outcome Risk Estimator), achieved a 10 year area under the curve of 88% (95% confidence interval 87% to 89%) compared with 79% (78% to 80%) for FIB-4. The calibration of CORE was good in all three cohorts, and according to the decision curve analysis CORE provides a higher net benefit than FIB-4 for all risk thresholds."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The CORE model, based on a flexible modelling approach and using biomarkers easily accessible in primary care, outperforms FIB-4 when predicting liver related outcomes in the general population and could be a novel means to stratify patients at risk for liver disease in the general population."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41022462/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1136/bmj-2024-083182",
      "dateReceived": "2025-10-11T23:22:05.353Z",
      "isNew": false,
      "summary": "The CORE model, utilizing readily available biomarkers, is superior to FIB-4 in predicting liver-related outcomes and may be a new tool for identifying individuals at risk of liver disease."
    },
    {
      "id": "11dbe8cc4477",
      "title": "Impact of Baseline GLP-1 Receptor Agonist Use on Albuminuria Reduction and Safety With Simultaneous Initiation of Finerenone and Empagliflozin in Type 2 Diabetes and Chronic Kidney Disease (CONFIDENCE Trial).",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48386031/117737",
      "abstract": "The CONFIDENCE trial demonstrated additive benefits of simultaneous initiation of finerenone, a nonsteroidal mineralocorticoid receptor antagonist, and a sodium-glucose cotransporter 2 (SGLT2) inhibitor compared with monotherapy in reducing the urinary albumin-to-creatinine ratio (UACR). This prespecified analysis evaluated whether safety and efficacy of combination therapy varies by baseline glucagon-like peptide 1 receptor agonist (GLP-1 RA) use. Adults with chronic kidney disease (UACR ≥100 to <5,000 mg/g; estimated glomerular filtration rate [eGFR] 30-90 mL/min/1.73 m2) and type 2 diabetes (glycated hemoglobin <11% [97 mmol/mol]) were randomized (1:1:1) to once-daily finerenone, empagliflozin, or finerenone plus empagliflozin. Among 800 participants, 182 (23%) used a GLP-1 RA at baseline. At day 180, UACR change from baseline in participants using a GLP-1 RA was -51% (95% CI -59 to -40%) with combination therapy, -34% (-48 to -18%) with finerenone, and -36% (-48 to -21%) with empagliflozin. Corresponding results in those not using a GLP-1 RA at baseline were -56% (-62 to -50%), -37% (-45 to -28%), and -33% (-41 to -23%), respectively. Hyperkalemia incidence rates with combination therapy were 9.0% and 9.5% among individuals with and without baseline GLP-1 RA use. eGFR changes were consistent among individuals with and without baseline GLP-1 RA use. Acute kidney injury was uncommon. Decreases in systolic blood pressure were observed and were more pronounced with combination therapy. In CONFIDENCE, simultaneous initiation with finerenone and an SGLT2 inhibitor was effective and well tolerated compared with monotherapy, irrespective of background use of a GLP-1 RA.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "The CONFIDENCE trial demonstrated additive benefits of simultaneous initiation of finerenone, a nonsteroidal mineralocorticoid receptor antagonist, and a sodium-glucose cotransporter 2 (SGLT2) inhibitor compared with monotherapy in reducing the urinary albumin-to-creatinine ratio (UACR). This prespecified analysis evaluated whether safety and efficacy of combination therapy varies by baseline glucagon-like peptide 1 receptor agonist (GLP-1 RA) use."
        },
        {
          "label": "RESEARCH DESIGN AND METHODS",
          "text": "Adults with chronic kidney disease (UACR ≥100 to <5,000 mg/g; estimated glomerular filtration rate [eGFR] 30-90 mL/min/1.73 m2) and type 2 diabetes (glycated hemoglobin <11% [97 mmol/mol]) were randomized (1:1:1) to once-daily finerenone, empagliflozin, or finerenone plus empagliflozin."
        },
        {
          "label": "RESULTS",
          "text": "Among 800 participants, 182 (23%) used a GLP-1 RA at baseline. At day 180, UACR change from baseline in participants using a GLP-1 RA was -51% (95% CI -59 to -40%) with combination therapy, -34% (-48 to -18%) with finerenone, and -36% (-48 to -21%) with empagliflozin. Corresponding results in those not using a GLP-1 RA at baseline were -56% (-62 to -50%), -37% (-45 to -28%), and -33% (-41 to -23%), respectively. Hyperkalemia incidence rates with combination therapy were 9.0% and 9.5% among individuals with and without baseline GLP-1 RA use. eGFR changes were consistent among individuals with and without baseline GLP-1 RA use. Acute kidney injury was uncommon. Decreases in systolic blood pressure were observed and were more pronounced with combination therapy."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In CONFIDENCE, simultaneous initiation with finerenone and an SGLT2 inhibitor was effective and well tolerated compared with monotherapy, irrespective of background use of a GLP-1 RA."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40968755/",
      "pubDate": "2025 Sep 19",
      "doi": "10.2337/dc25-1673",
      "dateReceived": "2025-10-11T23:22:05.353Z",
      "isNew": false,
      "summary": "Simultaneous initiation of finerenone and an SGLT2 inhibitor was effective and well-tolerated compared to monotherapy, regardless of GLP-1 RA use."
    },
    {
      "id": "c56cf9cb62fe",
      "title": "Best practice summary of dementia care guidelines based on the Competence Onion Model.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48386031/117720",
      "abstract": "The study addresses the growing challenge of ensuring high-quality dementia care, particularly in light of increasing numbers of people with dementia and the complex needs associated with dementia. It identifies a gap in existing dementia care guidelines, especially the lack of integration across the various competencies required by nursing professionals. To search, evaluate and integrate the best available evidence on dementia care content from relevant guidelines. This study has been registered and approved, following the reporting standard established by the Fudan University Center for Evidence-based Nursing, under registration number ES20246923 (http://ebn.nursing.fudan.edu.cn/home). Systematic searches were conducted for dementia care guidelines, and the Appraisal of Guidelines for Research and Evaluation (AGREE II) tool was used to assess the quality of the guidelines. This evidence summary adheres to the reporting specifications established by the Fudan University Center for Evidence-based Nursing, which are based on the methodological framework developed by the Joanna Briggs Institute (JBI). These specifications encompass problem identification, literature retrieval, screening, evaluation, evidence summary and grading, as well as the formulation of practical recommendations. Based on the inclusion and exclusion criteria, a total of 28 guidelines were included. Evidence was extracted according to the Competence Onion Model, focusing on five key areas: dementia-friendly environment, knowledge, skill, attitude and behaviour, traits and motive. A total of 140 pieces of best evidence were identified. This study summarises the best evidence on dementia care content guidelines, providing relevant evidence-based support for clinical practice.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The study addresses the growing challenge of ensuring high-quality dementia care, particularly in light of increasing numbers of people with dementia and the complex needs associated with dementia. It identifies a gap in existing dementia care guidelines, especially the lack of integration across the various competencies required by nursing professionals."
        },
        {
          "label": "OBJECTIVE",
          "text": "To search, evaluate and integrate the best available evidence on dementia care content from relevant guidelines."
        },
        {
          "label": "DESIGN",
          "text": "This study has been registered and approved, following the reporting standard established by the Fudan University Center for Evidence-based Nursing, under registration number ES20246923 (http://ebn.nursing.fudan.edu.cn/home)."
        },
        {
          "label": "METHODS",
          "text": "Systematic searches were conducted for dementia care guidelines, and the Appraisal of Guidelines for Research and Evaluation (AGREE II) tool was used to assess the quality of the guidelines. This evidence summary adheres to the reporting specifications established by the Fudan University Center for Evidence-based Nursing, which are based on the methodological framework developed by the Joanna Briggs Institute (JBI). These specifications encompass problem identification, literature retrieval, screening, evaluation, evidence summary and grading, as well as the formulation of practical recommendations."
        },
        {
          "label": "RESULTS",
          "text": "Based on the inclusion and exclusion criteria, a total of 28 guidelines were included. Evidence was extracted according to the Competence Onion Model, focusing on five key areas: dementia-friendly environment, knowledge, skill, attitude and behaviour, traits and motive. A total of 140 pieces of best evidence were identified."
        },
        {
          "label": "CONCLUSION",
          "text": "This study summarises the best evidence on dementia care content guidelines, providing relevant evidence-based support for clinical practice."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40966618/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf251",
      "dateReceived": "2025-10-11T23:22:05.353Z",
      "isNew": false,
      "summary": "This study synthesizes the best available evidence to inform dementia care guidelines and support clinical practice."
    },
    {
      "id": "a256ee5db3c9",
      "title": "Pre-conception weight loss interventions in women with polycystic ovary syndrome and the effect on perinatal outcomes: A quantitative synthesis of surrogate outcomes.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Gynecology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117836",
      "abstract": "Polycystic ovary syndrome (PCOS) guidelines recommend weight optimisation to improve anthropometric, metabolic and androgenic complications, but data is lacking for pregnancy outcomes. We aimed to assess which weight loss interventions improve pregnancy outcomes for women with PCOS and overweight or obesity. A systematic search of Embase, Medline (Ovid) and the Cochrane Clinical Trials Registry for English language articles from database inception until 22 July 2024 was conducted. We included weight loss intervention randomised controlled trials (RCTs) for women with PCOS and body mass index (BMI) ≥25 kg/m. Primary outcomes were pregnancy rates, live births and miscarriages. Secondary outcomes were anthropometric, androgenic, metabolic and other perinatal complications. Of 9010 articles, 7077 abstracts were screened and 37 RCTs included. One study reported increased pregnancy rates with a 12-month lifestyle intervention versus standard care (23.3%-26.7% vs. 16.7%) (low certainty) but no difference in live birth rate, time to conception or antenatal outcomes. Lifestyle interventions reduced BMI by -0.34 kg/m (-0.65 to -0.02) on quantitative meta-analysis. Limitations include outcome measure heterogeneity, intervention heterogeneity, inconsistent definitions and low use of core outcome sets. Limited data on antenatal outcomes highlight a knowledge gap amongst a group at high perinatal risk.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Polycystic ovary syndrome (PCOS) guidelines recommend weight optimisation to improve anthropometric, metabolic and androgenic complications, but data is lacking for pregnancy outcomes."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We aimed to assess which weight loss interventions improve pregnancy outcomes for women with PCOS and overweight or obesity. A systematic search of Embase, Medline (Ovid) and the Cochrane Clinical Trials Registry for English language articles from database inception until 22 July 2024 was conducted. We included weight loss intervention randomised controlled trials (RCTs) for women with PCOS and body mass index (BMI) ≥25 kg/m. Primary outcomes were pregnancy rates, live births and miscarriages. Secondary outcomes were anthropometric, androgenic, metabolic and other perinatal complications."
        },
        {
          "label": "RESULTS",
          "text": "Of 9010 articles, 7077 abstracts were screened and 37 RCTs included. One study reported increased pregnancy rates with a 12-month lifestyle intervention versus standard care (23.3%-26.7% vs. 16.7%) (low certainty) but no difference in live birth rate, time to conception or antenatal outcomes. Lifestyle interventions reduced BMI by -0.34 kg/m (-0.65 to -0.02) on quantitative meta-analysis. Limitations include outcome measure heterogeneity, intervention heterogeneity, inconsistent definitions and low use of core outcome sets."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Limited data on antenatal outcomes highlight a knowledge gap amongst a group at high perinatal risk."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41035114/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1111/dom.70116",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false,
      "summary": "There is a lack of understanding regarding pregnancy outcomes in a high-risk perinatal population."
    },
    {
      "id": "c0af5bb8576d",
      "title": "Ampicillin and gentamicin prophylaxis is superior to ampicillin alone in patients with prelabor rupture of membranes at term: the results of a randomized clinical trial.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117781",
      "abstract": "Prelabor rupture of membranes is a risk factor for maternal and neonatal infectious morbidity. Ampicillin is indicated for patients with unknown group B Streptococcus status and prelabor rupture of membranes ≥18 hours. Although ampicillin-resistant Enterobacteriaceae contribute to maternal and neonatal infectious morbidity, current guidelines on intrapartum antibiotic prophylaxis primarily target group B Streptococcus and do not adequately cover Enterobacteriaceae. To compare maternal and neonatal infectious morbidity between 2 antibiotic regimens: ampicillin and gentamicin vs ampicillin alone. This randomized controlled trial was conducted between November 2022 and March 2024 in a tertiary university-affiliated hospital. Inclusion criteria were a term singleton pregnancy ≥37 0/7, vertex presentation, unknown group B Streptococcus status, and prelabor rupture of membranes without active labor. Exclusion criteria included penicillin/gentamicin allergy, contraindications for vaginal delivery, and current antibiotic treatment. The participants were randomized at 12 to 18 hours post prelabor rupture of membranes to receive ampicillin and gentamicin (n=102) or ampicillin alone (n=102). They were blinded from the allocation until antibiotics initiation at 18 hours post prelabor rupture of membranes. The antibiotics were administered until delivery. The primary outcome was clinical chorioamnionitis. Secondary maternal outcomes were puerperal endometritis, peripartum infections, intrapartum fever, and a composite of postpartum maternal morbidity, defined as the presence of puerperal endometritis, postpartum antibiotic treatment exceeding 24 hours, wound infection, or infection-related hospitalization >5 days. A neonatal composite adverse outcome included culture-proven neonatal sepsis, admission to the neonatal intensive care unit, empiric antibiotic treatment in the neonatal intensive care unit, performance of a sepsis workup, and infection-related hospitalization >5 days. Microbiologic findings were assessed from chorioamniotic swab cultures. An intention-to-treat analysis was performed. The number needed to treat was calculated for the primary outcome. Multivariate logistic regression was conducted to predict clinical chorioamnionitis, after controlling for antibiotic regimen, prelabor rupture of membranes duration, delivery number, body mass index, delivery week, maternal age, meconium staining, and diabetes mellitus. Ampicillin and gentamicin treatment was associated with lower rates of clinical chorioamnionitis (1/102 [1.0%] vs 8/102 [7.8%], P=.035), intrapartum fever (8/102 [8.0%] vs 18/102 [18.0%], P=.036), and overall peripartum infections (1/102 [1.0%] vs 10/102 [9.8%], P=.005). The number needed to treat to prevent 1 case of clinical chorioamnionitis was 14.7 (95% confidence interval, 10.2-27.0). The rate of the composite postpartum maternal complications was also lower in the ampicillin and gentamicin group (0/102 [0%] vs 6/102 [5.9%], P=.029). Ampicillin and gentamicin treatment was associated with lower rates of the composite neonatal adverse outcome (11/102 [10.8%] vs 22/102 [21.6%], P=.036) and sepsis workups (8/102 [7.8%] vs 18/102 [17.6%], P=.036) and a shorter median neonatal intensive care unit stay (3.0 vs 3.5 days, P=.047). The frequency of positive Enterobacteriaceae cultures in chorioamniotic swab samples was lower following ampicillin and gentamicin (17/85 [20%] vs ampicillin alone 45/89 [51%], P<.001). In term prelabor rupture of membranes, ampicillin and gentamicin prophylaxis, compared to ampicillin alone, resulted in lower rates of clinical chorioamnionitis, maternal postpartum complications, and neonatal adverse outcomes. It is time to reconsider the antimicrobial prophylactic regimen in term prelabor rupture of membranes.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Prelabor rupture of membranes is a risk factor for maternal and neonatal infectious morbidity. Ampicillin is indicated for patients with unknown group B Streptococcus status and prelabor rupture of membranes ≥18 hours. Although ampicillin-resistant Enterobacteriaceae contribute to maternal and neonatal infectious morbidity, current guidelines on intrapartum antibiotic prophylaxis primarily target group B Streptococcus and do not adequately cover Enterobacteriaceae."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare maternal and neonatal infectious morbidity between 2 antibiotic regimens: ampicillin and gentamicin vs ampicillin alone."
        },
        {
          "label": "STUDY DESIGN",
          "text": "This randomized controlled trial was conducted between November 2022 and March 2024 in a tertiary university-affiliated hospital. Inclusion criteria were a term singleton pregnancy ≥37 0/7, vertex presentation, unknown group B Streptococcus status, and prelabor rupture of membranes without active labor. Exclusion criteria included penicillin/gentamicin allergy, contraindications for vaginal delivery, and current antibiotic treatment. The participants were randomized at 12 to 18 hours post prelabor rupture of membranes to receive ampicillin and gentamicin (n=102) or ampicillin alone (n=102). They were blinded from the allocation until antibiotics initiation at 18 hours post prelabor rupture of membranes. The antibiotics were administered until delivery. The primary outcome was clinical chorioamnionitis. Secondary maternal outcomes were puerperal endometritis, peripartum infections, intrapartum fever, and a composite of postpartum maternal morbidity, defined as the presence of puerperal endometritis, postpartum antibiotic treatment exceeding 24 hours, wound infection, or infection-related hospitalization >5 days. A neonatal composite adverse outcome included culture-proven neonatal sepsis, admission to the neonatal intensive care unit, empiric antibiotic treatment in the neonatal intensive care unit, performance of a sepsis workup, and infection-related hospitalization >5 days. Microbiologic findings were assessed from chorioamniotic swab cultures. An intention-to-treat analysis was performed. The number needed to treat was calculated for the primary outcome. Multivariate logistic regression was conducted to predict clinical chorioamnionitis, after controlling for antibiotic regimen, prelabor rupture of membranes duration, delivery number, body mass index, delivery week, maternal age, meconium staining, and diabetes mellitus."
        },
        {
          "label": "RESULTS",
          "text": "Ampicillin and gentamicin treatment was associated with lower rates of clinical chorioamnionitis (1/102 [1.0%] vs 8/102 [7.8%], P=.035), intrapartum fever (8/102 [8.0%] vs 18/102 [18.0%], P=.036), and overall peripartum infections (1/102 [1.0%] vs 10/102 [9.8%], P=.005). The number needed to treat to prevent 1 case of clinical chorioamnionitis was 14.7 (95% confidence interval, 10.2-27.0). The rate of the composite postpartum maternal complications was also lower in the ampicillin and gentamicin group (0/102 [0%] vs 6/102 [5.9%], P=.029). Ampicillin and gentamicin treatment was associated with lower rates of the composite neonatal adverse outcome (11/102 [10.8%] vs 22/102 [21.6%], P=.036) and sepsis workups (8/102 [7.8%] vs 18/102 [17.6%], P=.036) and a shorter median neonatal intensive care unit stay (3.0 vs 3.5 days, P=.047). The frequency of positive Enterobacteriaceae cultures in chorioamniotic swab samples was lower following ampicillin and gentamicin (17/85 [20%] vs ampicillin alone 45/89 [51%], P<.001)."
        },
        {
          "label": "CONCLUSION",
          "text": "In term prelabor rupture of membranes, ampicillin and gentamicin prophylaxis, compared to ampicillin alone, resulted in lower rates of clinical chorioamnionitis, maternal postpartum complications, and neonatal adverse outcomes. It is time to reconsider the antimicrobial prophylactic regimen in term prelabor rupture of membranes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40086563/",
      "pubDate": "2025 Oct",
      "doi": "10.1016/j.ajog.2025.03.011",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false,
      "summary": "Ampicillin and gentamicin prophylaxis is superior to ampicillin alone in term prelabor rupture of membranes, leading to fewer complications for both mother and baby."
    },
    {
      "id": "6e134864581e",
      "title": "A Multicenter Randomized Controlled Trial of Antimicrobial Prophylaxis to Prevent Urinary Tract Infections after Shockwave Lithotripsy for Urolithiasis: The APPEAL Trial.",
      "journal": "Eur Urol",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117774",
      "abstract": "Shockwave lithotripsy (SWL) carries a risk of postprocedural infection. Use of antibiotic prophylaxis by clinicians is variable and international guidelines provide conflicting recommendations, reflecting low-certainty evidence. We investigated whether antibiotic prophylaxis reduces bacteriuria and post-SWL urinary tract infections (UTIs). APPEAL, an international multicenter, blinded trial, randomized adults undergoing SWL for urolithiasis to a single dose of ciprofloxacin or placebo. The primary outcome was the incidence of a composite of bacteriuria or symptomatic UTI after SWL. Other outcomes included the incidence of pyelonephritis or urosepsis. Of the 1722 randomized patients, 28 underwent postrandomization exclusions (mainly nonvisualizable stones). Among the analysis population (n = 1694; median age 50 yr; 30% female), 74% had kidney stones and 26% had ureteral stones. Bacteriuria (without symptoms) or symptomatic UTI occurred in 20 patients (2.7%) in the ciprofloxacin arm and 30 (3.9%) in the placebo arm (risk ratio [RR] 0.68, 95% confidence interval [CI] 0.41-1.15). Symptomatic UTI occurred in ten patients (1.3%) in the ciprofloxacin arm and 21 (2.7%) in the placebo arm (RR 0.49, 95% CI 0.19-1.23). No patients in the ciprofloxacin arm and nine (1.2%) in the placebo arm developed pyelonephritis (RR 0.05, 95% CI 0.003-0.93). No patients developed urosepsis and no serious adverse events occurred. A single dose of ciprofloxacin reduced the risk of post-SWL pyelonephritis, with a modest absolute benefit. The patient importance of this reduction depends on individual preferences in weighing a small absolute reduction in risk against the potential harms and resistance-related implications of antibiotic use. Results from the APPEAL trial will inform global practice and support evidence-based decision-making for patients undergoing SWL.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND OBJECTIVE",
          "text": "Shockwave lithotripsy (SWL) carries a risk of postprocedural infection. Use of antibiotic prophylaxis by clinicians is variable and international guidelines provide conflicting recommendations, reflecting low-certainty evidence. We investigated whether antibiotic prophylaxis reduces bacteriuria and post-SWL urinary tract infections (UTIs)."
        },
        {
          "label": "METHODS",
          "text": "APPEAL, an international multicenter, blinded trial, randomized adults undergoing SWL for urolithiasis to a single dose of ciprofloxacin or placebo. The primary outcome was the incidence of a composite of bacteriuria or symptomatic UTI after SWL. Other outcomes included the incidence of pyelonephritis or urosepsis."
        },
        {
          "label": "KEY FINDINGS AND LIMITATIONS",
          "text": "Of the 1722 randomized patients, 28 underwent postrandomization exclusions (mainly nonvisualizable stones). Among the analysis population (n = 1694; median age 50 yr; 30% female), 74% had kidney stones and 26% had ureteral stones. Bacteriuria (without symptoms) or symptomatic UTI occurred in 20 patients (2.7%) in the ciprofloxacin arm and 30 (3.9%) in the placebo arm (risk ratio [RR] 0.68, 95% confidence interval [CI] 0.41-1.15). Symptomatic UTI occurred in ten patients (1.3%) in the ciprofloxacin arm and 21 (2.7%) in the placebo arm (RR 0.49, 95% CI 0.19-1.23). No patients in the ciprofloxacin arm and nine (1.2%) in the placebo arm developed pyelonephritis (RR 0.05, 95% CI 0.003-0.93). No patients developed urosepsis and no serious adverse events occurred."
        },
        {
          "label": "CONCLUSIONS AND CLINICAL IMPLICATIONS",
          "text": "A single dose of ciprofloxacin reduced the risk of post-SWL pyelonephritis, with a modest absolute benefit. The patient importance of this reduction depends on individual preferences in weighing a small absolute reduction in risk against the potential harms and resistance-related implications of antibiotic use. Results from the APPEAL trial will inform global practice and support evidence-based decision-making for patients undergoing SWL."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40998628/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1016/j.eururo.2025.08.019",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false,
      "summary": "Ciprofloxacin effectively lowers the chance of kidney infection after shock wave lithotripsy, but the value of this benefit is a personal choice considering antibiotic risks."
    },
    {
      "id": "9e8efb679df3",
      "title": "Once-daily oral icotrokinra versus placebo and once-daily oral deucravacitinib in participants with moderate-to-severe plaque psoriasis (ICONIC-ADVANCE 1 & 2): two phase 3, randomised, placebo-controlled and active-comparator-controlled trials.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48474353/117681",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false
    },
    {
      "id": "d16c7fd41b48",
      "title": "Exercise in Pregnancy and Risk of Postpartum Depression: A Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117749",
      "abstract": "To evaluate whether regular aerobic exercise during pregnancy reduces the incidence of postpartum depression in women with low-risk singleton pregnancies. Single-centre randomised controlled trial. Department of Obstetrics and Gynaecology, University of Naples Federico II, Italy. A total of 398 women with low-risk singleton pregnancies enrolled during the first trimester of pregnancy. Participants were randomly allocated in a 1:1 ratio to an exercise group or control group. The intervention consisted of a structured aerobic exercise programme (three 60-min sessions per week) from randomisation until 35 weeks' gestation, or earlier if delivery or obstetric complications occurred. The primary outcome was Edinburgh Postnatal Depression Scale (EPDS) score ≥ 12 3 months postpartum. Secondary outcomes included EPDS ≥ 9, clinical diagnosis of postpartum depression (DSM-V), and maternal/perinatal outcomes. Analyses were performed on an intention-to-treat basis, with relative risk (RR) and 95% confidence interval (CI) calculated. Incidence of postpartum depression, defined as EPDS ≥ 12 at 3 months postpartum. Of the 398 participants, 199 were randomised to the exercise group and 199 to the control group. Women in the exercise group had a significantly lower incidence of EPDS ≥ 12 and ≥ 9 at 3 months postpartum compared with controls, as well as lower mean EPDS scores. No significant differences in adverse maternal or perinatal outcomes were observed. Regular antenatal aerobic exercise significantly reduced the risk of postpartum depression, supporting its role as a preventive strategy in low-risk pregnancies. Clinicaltrials.gov identifier: NCT06355375.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether regular aerobic exercise during pregnancy reduces the incidence of postpartum depression in women with low-risk singleton pregnancies."
        },
        {
          "label": "DESIGN",
          "text": "Single-centre randomised controlled trial."
        },
        {
          "label": "SETTING",
          "text": "Department of Obstetrics and Gynaecology, University of Naples Federico II, Italy."
        },
        {
          "label": "POPULATION OR SAMPLE",
          "text": "A total of 398 women with low-risk singleton pregnancies enrolled during the first trimester of pregnancy."
        },
        {
          "label": "METHODS",
          "text": "Participants were randomly allocated in a 1:1 ratio to an exercise group or control group. The intervention consisted of a structured aerobic exercise programme (three 60-min sessions per week) from randomisation until 35 weeks' gestation, or earlier if delivery or obstetric complications occurred. The primary outcome was Edinburgh Postnatal Depression Scale (EPDS) score ≥ 12 3 months postpartum. Secondary outcomes included EPDS ≥ 9, clinical diagnosis of postpartum depression (DSM-V), and maternal/perinatal outcomes. Analyses were performed on an intention-to-treat basis, with relative risk (RR) and 95% confidence interval (CI) calculated."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Incidence of postpartum depression, defined as EPDS ≥ 12 at 3 months postpartum."
        },
        {
          "label": "RESULTS",
          "text": "Of the 398 participants, 199 were randomised to the exercise group and 199 to the control group. Women in the exercise group had a significantly lower incidence of EPDS ≥ 12 and ≥ 9 at 3 months postpartum compared with controls, as well as lower mean EPDS scores. No significant differences in adverse maternal or perinatal outcomes were observed."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Regular antenatal aerobic exercise significantly reduced the risk of postpartum depression, supporting its role as a preventive strategy in low-risk pregnancies."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Clinicaltrials.gov identifier: NCT06355375."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40976261/",
      "pubDate": "2025 Sep 21",
      "doi": "10.1111/1471-0528.70010",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false,
      "summary": "Aerobic exercise during pregnancy effectively lowers the risk of developing postpartum depression."
    },
    {
      "id": "bb51e536542d",
      "title": "A 3-month clofazimine-rifapentine-containing regimen for drug-susceptible tuberculosis versus standard of care (Clo-Fast): a randomised, open-label, phase 2c clinical trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117743",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false
    },
    {
      "id": "a5780bc0f74f",
      "title": "Oral iptacopan therapy in patients with C3 glomerulopathy: a randomised, double-blind, parallel group, multicentre, placebo-controlled, phase 3 study.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117736",
      "abstract": "C3 glomerulopathy is an ultra-rare, severe form of glomerulonephritis caused by overactivation of the alternative complement pathway. We aimed to assess efficacy and safety of iptacopan (LNP023), an oral, proximal complement inhibitor that targets factor B to selectively inhibit the alternative pathway of the complement cascade. APPEAR-C3G was a multicentre, randomised, double-blind, placebo-controlled, phase 3 study of iptacopan versus placebo (both in addition to supportive care [renin-angiotensin-aldosterone system (RAAS) inhibitors] and immunosuppression). Adult participants (aged 18-60 years) with biopsy-confirmed C3 glomerulopathy were enrolled from 35 hospitals or medical centres in 18 countries. Inclusion criteria included reduced serum C3 concentration (ie, <77 mg/dL [defined as <0·85 × lower limit of the central laboratory normal range]) at screening, urine protein-creatinine ratio (UPCR) of 1·0 g/g or higher at day -75 and day -15 before randomisation, estimated glomerular filtration rate (eGFR) of 30 mL/min per 1·73 m or higher at screening and day -15, and vaccination against Neisseria meningitidis and Streptococcus pneumoniae. All eligible participants were randomised 1:1 via interactive response technology to either the iptacopan or the placebo group, stratified by treatment with corticosteroids, mycophenolic acid, or both (yes or no). During the 6-month double-blind period, participants orally received either iptacopan 200 mg twice daily or placebo; this was followed by a 6-month open-label period in which all participants received iptacopan 200 mg twice daily. The primary endpoint was relative reduction in proteinuria (measured by log-transformed ratio to baseline in UPCR sampled from a 24-h urine collection) at 6 months. The primary analyses were done in the full analysis set (ie, all participants to whom study treatment was assigned by randomisation); all participants who received at least one dose of study treatment were included in the safety analysis. This trial was registered with ClinicalTrials.gov (NCT04817618) and the adult cohort has been completed. Between July 28, 2021, and Feb 15, 2023, 132 participants were screened, of whom 58 did not complete the screening period and 74 (64% male; 69% White) were randomised 1:1 to receive either iptacopan (n=38) or placebo (n=36). One participant in the placebo group discontinued treatment during the open-label period. The 24-h UPCR percentage change relative to baseline at 6 months was -30·2% (95% CI -42·8 to -14·8) in the iptacopan group and 7·6% (-11·9 to 31·3) in the placebo group. In the iptacopan group, the geometric mean of 24-h UPCR was 3·33 g/g (95% CI 2·79 to 3·97) at baseline and 2·17 g/g (1·62 to 2·91) at 6 months; in the placebo group, this was 2·58 g/g (2·18 to 3·05) at baseline and 2·80 g/g (2·37 to 3·30) at 6 months. The primary endpoint was met with a relative reduction in 24-h UPCR at 6 months for iptacopan versus placebo of 35·1% (13·8 to 51·1; p=0·0014). 30 (79%) of 38 participants in the iptacopan group had treatment-emergent adverse events, compared with 24 (67%) of 36 participants in the placebo group; most of these were of mild or moderate severity. There were no deaths, no treatment discontinuations due to treatment-emergent adverse events, and no meningococcal infections. Serious adverse events were reported in three (8%) participants in the iptacopan group and one (3%) participant in the placebo group. Iptacopan showed a statistically significant, clinically meaningful proteinuria reduction in addition to RAAS inhibitors and immunosuppression at 6 months. Iptacopan was well tolerated with an acceptable safety profile in patients with C3 glomerulopathy. Novartis Pharma.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "C3 glomerulopathy is an ultra-rare, severe form of glomerulonephritis caused by overactivation of the alternative complement pathway. We aimed to assess efficacy and safety of iptacopan (LNP023), an oral, proximal complement inhibitor that targets factor B to selectively inhibit the alternative pathway of the complement cascade."
        },
        {
          "label": "METHODS",
          "text": "APPEAR-C3G was a multicentre, randomised, double-blind, placebo-controlled, phase 3 study of iptacopan versus placebo (both in addition to supportive care [renin-angiotensin-aldosterone system (RAAS) inhibitors] and immunosuppression). Adult participants (aged 18-60 years) with biopsy-confirmed C3 glomerulopathy were enrolled from 35 hospitals or medical centres in 18 countries. Inclusion criteria included reduced serum C3 concentration (ie, <77 mg/dL [defined as <0·85 × lower limit of the central laboratory normal range]) at screening, urine protein-creatinine ratio (UPCR) of 1·0 g/g or higher at day -75 and day -15 before randomisation, estimated glomerular filtration rate (eGFR) of 30 mL/min per 1·73 m or higher at screening and day -15, and vaccination against Neisseria meningitidis and Streptococcus pneumoniae. All eligible participants were randomised 1:1 via interactive response technology to either the iptacopan or the placebo group, stratified by treatment with corticosteroids, mycophenolic acid, or both (yes or no). During the 6-month double-blind period, participants orally received either iptacopan 200 mg twice daily or placebo; this was followed by a 6-month open-label period in which all participants received iptacopan 200 mg twice daily. The primary endpoint was relative reduction in proteinuria (measured by log-transformed ratio to baseline in UPCR sampled from a 24-h urine collection) at 6 months. The primary analyses were done in the full analysis set (ie, all participants to whom study treatment was assigned by randomisation); all participants who received at least one dose of study treatment were included in the safety analysis. This trial was registered with ClinicalTrials.gov (NCT04817618) and the adult cohort has been completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between July 28, 2021, and Feb 15, 2023, 132 participants were screened, of whom 58 did not complete the screening period and 74 (64% male; 69% White) were randomised 1:1 to receive either iptacopan (n=38) or placebo (n=36). One participant in the placebo group discontinued treatment during the open-label period. The 24-h UPCR percentage change relative to baseline at 6 months was -30·2% (95% CI -42·8 to -14·8) in the iptacopan group and 7·6% (-11·9 to 31·3) in the placebo group. In the iptacopan group, the geometric mean of 24-h UPCR was 3·33 g/g (95% CI 2·79 to 3·97) at baseline and 2·17 g/g (1·62 to 2·91) at 6 months; in the placebo group, this was 2·58 g/g (2·18 to 3·05) at baseline and 2·80 g/g (2·37 to 3·30) at 6 months. The primary endpoint was met with a relative reduction in 24-h UPCR at 6 months for iptacopan versus placebo of 35·1% (13·8 to 51·1; p=0·0014). 30 (79%) of 38 participants in the iptacopan group had treatment-emergent adverse events, compared with 24 (67%) of 36 participants in the placebo group; most of these were of mild or moderate severity. There were no deaths, no treatment discontinuations due to treatment-emergent adverse events, and no meningococcal infections. Serious adverse events were reported in three (8%) participants in the iptacopan group and one (3%) participant in the placebo group."
        },
        {
          "label": "INTERPRETATION",
          "text": "Iptacopan showed a statistically significant, clinically meaningful proteinuria reduction in addition to RAAS inhibitors and immunosuppression at 6 months. Iptacopan was well tolerated with an acceptable safety profile in patients with C3 glomerulopathy."
        },
        {
          "label": "FUNDING",
          "text": "Novartis Pharma."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41016405/",
      "pubDate": "2025 Sep 25",
      "doi": "10.1016/S0140-6736(25)01148-1",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false,
      "summary": "Iptacopan, an oral complement inhibitor, significantly reduced proteinuria in patients with C3 glomerulopathy compared to placebo."
    },
    {
      "id": "246164ad68fd",
      "title": "Influence of Type 2 Diabetes on the Effects of Tirzepatide in Patients With Heart Failure and a Preserved Ejection Fraction With Obesity: A Prespecified Stratification-Based Analysis.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117658",
      "dateReceived": "2025-10-10T23:22:18.982Z",
      "isNew": false
    },
    {
      "id": "947093ec8651",
      "title": "Inclisiran-based treatment strategy in hypercholesterolaemia: the VICTORION-Difference trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117817",
      "abstract": "Low-density lipoprotein cholesterol (LDL-C) is a causal risk factor for atherosclerotic cardiovascular (CV) disease development and progression. The European Society of Cardiology guidelines recommend combination treatment to achieve CV risk-based LDL-C treatment goals. Inclisiran, a small interfering ribonucleic acid (siRNA) that targets hepatic proprotein convertase subtilisin/kexin type 9 (PCSK9) messenger RNA, can provide sustained and effective LDL-C reduction. VICTORION-Difference, a phase 4 double-blind, placebo-controlled randomised clinical trial included adults with hypercholesterolaemia at high- or very high CV risk. Participants were randomised 1:1 to receive inclisiran sodium (300 mg subcutaneous injections; equivalent to 284 mg inclisiran) or placebo together with individually optimised lipid-lowering therapy (ioLLT), including up-titration with rosuvastatin (open-label) until either their individual LDL-C goal or maximally tolerated statin dose (open-label rosuvastatin) was achieved. The primary objective was assessment of LDL-C goal achievement at Day 90. Key secondary objectives were muscle-related adverse events (MRAEs) and mean LDL-C reduction. Overall, 1770 individuals (mean age, 63.7 years) were randomised to receive inclisiran (n=898) or ioLLT (n=872). At Day 90, a significantly higher proportion of participants receiving inclisiran vs. ioLLT achieved their individual LDL-C goals (84.9% vs. 31.0%; odds ratio [OR] 12.09, p<0.001). The mean percentage reduction in LDL-C from baseline to Day 360 was -59.5% and -24.3% in the inclisiran and ioLLT arms, respectively (least squares mean treatment difference [LSMTD]=-35.14%, p<0.001). Fewer participants receiving inclisiran vs. ioLLT reported a MRAE (11.9% vs. 19.2%; OR 0.57, p<0.001). The mean reduction in Short Form-Brief Pain Inventory pain severity and interference scores favoured inclisiran over ioLLT (LSMTD=-0.11, p=0.039; LSMTD=-0.11, p=0.029, respectively). No new safety concerns were identified. An inclisiran-based treatment strategy was superior to ioLLT in LDL-C goal achievement, delivering early and sustained LDL-C reduction, with fewer MRAEs in individuals with hypercholesterolaemia. cholesterol, muscle-related adverse events, quality of life, statins.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Low-density lipoprotein cholesterol (LDL-C) is a causal risk factor for atherosclerotic cardiovascular (CV) disease development and progression. The European Society of Cardiology guidelines recommend combination treatment to achieve CV risk-based LDL-C treatment goals. Inclisiran, a small interfering ribonucleic acid (siRNA) that targets hepatic proprotein convertase subtilisin/kexin type 9 (PCSK9) messenger RNA, can provide sustained and effective LDL-C reduction."
        },
        {
          "label": "METHODS",
          "text": "VICTORION-Difference, a phase 4 double-blind, placebo-controlled randomised clinical trial included adults with hypercholesterolaemia at high- or very high CV risk. Participants were randomised 1:1 to receive inclisiran sodium (300 mg subcutaneous injections; equivalent to 284 mg inclisiran) or placebo together with individually optimised lipid-lowering therapy (ioLLT), including up-titration with rosuvastatin (open-label) until either their individual LDL-C goal or maximally tolerated statin dose (open-label rosuvastatin) was achieved. The primary objective was assessment of LDL-C goal achievement at Day 90. Key secondary objectives were muscle-related adverse events (MRAEs) and mean LDL-C reduction."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 1770 individuals (mean age, 63.7 years) were randomised to receive inclisiran (n=898) or ioLLT (n=872). At Day 90, a significantly higher proportion of participants receiving inclisiran vs. ioLLT achieved their individual LDL-C goals (84.9% vs. 31.0%; odds ratio [OR] 12.09, p<0.001). The mean percentage reduction in LDL-C from baseline to Day 360 was -59.5% and -24.3% in the inclisiran and ioLLT arms, respectively (least squares mean treatment difference [LSMTD]=-35.14%, p<0.001). Fewer participants receiving inclisiran vs. ioLLT reported a MRAE (11.9% vs. 19.2%; OR 0.57, p<0.001). The mean reduction in Short Form-Brief Pain Inventory pain severity and interference scores favoured inclisiran over ioLLT (LSMTD=-0.11, p=0.039; LSMTD=-0.11, p=0.029, respectively). No new safety concerns were identified."
        },
        {
          "label": "CONCLUSIONS",
          "text": "An inclisiran-based treatment strategy was superior to ioLLT in LDL-C goal achievement, delivering early and sustained LDL-C reduction, with fewer MRAEs in individuals with hypercholesterolaemia. cholesterol, muscle-related adverse events, quality of life, statins."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884558/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1093/eurheartj/ehaf685",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "Inclisiran treatment achieved better LDL-C control and fewer major adverse events compared to ioLLT in hypercholesterolemic patients."
    },
    {
      "id": "30f2dcbcffb3",
      "title": "Improving outcomes of atrial fibrillation ablation by integrated personalized lifestyle interventions: a randomized controlled trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117816",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "b66de1836a58",
      "title": "Suicide Interventions for Youths: A Systematic Review.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117807",
      "abstract": "Suicide is a leading cause of death among young people and an escalating public health crisis. To assess the effectiveness and harms of available treatments for suicidal thoughts and behaviors among youths at heightened risk for suicide. A systematic review was conducted searching databases including MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Cochrane Database of Systematic Reviews, Scopus, and various gray literature sources from January 1, 2000, to September 26, 2024. We included randomized clinical trials, comparative observational studies, and before-after studies of psychosocial interventions, pharmacologic interventions, neurotherapeutics, emerging therapies, and combination therapies. Eligible patients were youths (aged 5-24 years) with heightened risk for suicide, adolescents from racial and ethnic minority groups known to be at increased risk of suicide, or those exposed to crime or violence. Pairs of independent reviewers selected and appraised studies. This review included 65 studies (33 randomized clinical trials, 13 comparative observational studies, and 19 before-after studies) reporting on 14 534 patients (median age, 15.1 years; 75.1% female patients). Psychosocial interventions comprised psychotherapy interventions (33 studies; cognitive behavioral therapy, dialectical behavioral therapy, collaborative assessment and management of suicidality, dynamic deconstructive psychotherapy, attachment-based family therapy, and family-focused therapy), acute (ie, 1-4 sessions or contacts) psychosocial interventions (19 studies; safety planning, family-based crisis management, motivational interviewing crisis interventions, continuity of care after crisis, and brief adjunctive treatments), and school- or community-based psychosocial interventions (13 studies; social network interventions, school-based skills interventions, suicide awareness or gatekeeper programs, and community-based, culturally tailored adjunct programs). Dialectical behavior therapy showed moderate strength of evidence for reducing suicidal ideation. Other categories of psychosocial treatments showed insufficient to low strength of evidence for reducing suicidal outcomes. None of the studies evaluated adverse events. The evidence base on pharmacologic treatment for youths at risk of suicide was largely nonexistent. This systematic review found that the current evidence on available interventions targeting youths at heightened risk of suicide is uncertain. Medication, neurotherapeutics, and emerging therapies remain unstudied among this population. The limited evidence base calls for the development of novel, developmentally and trauma-informed treatments, as well as multilevel interventions to target the increasing suicide risk among youths.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Suicide is a leading cause of death among young people and an escalating public health crisis."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the effectiveness and harms of available treatments for suicidal thoughts and behaviors among youths at heightened risk for suicide."
        },
        {
          "label": "EVIDENCE REVIEW",
          "text": "A systematic review was conducted searching databases including MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Cochrane Database of Systematic Reviews, Scopus, and various gray literature sources from January 1, 2000, to September 26, 2024. We included randomized clinical trials, comparative observational studies, and before-after studies of psychosocial interventions, pharmacologic interventions, neurotherapeutics, emerging therapies, and combination therapies. Eligible patients were youths (aged 5-24 years) with heightened risk for suicide, adolescents from racial and ethnic minority groups known to be at increased risk of suicide, or those exposed to crime or violence. Pairs of independent reviewers selected and appraised studies."
        },
        {
          "label": "FINDINGS",
          "text": "This review included 65 studies (33 randomized clinical trials, 13 comparative observational studies, and 19 before-after studies) reporting on 14 534 patients (median age, 15.1 years; 75.1% female patients). Psychosocial interventions comprised psychotherapy interventions (33 studies; cognitive behavioral therapy, dialectical behavioral therapy, collaborative assessment and management of suicidality, dynamic deconstructive psychotherapy, attachment-based family therapy, and family-focused therapy), acute (ie, 1-4 sessions or contacts) psychosocial interventions (19 studies; safety planning, family-based crisis management, motivational interviewing crisis interventions, continuity of care after crisis, and brief adjunctive treatments), and school- or community-based psychosocial interventions (13 studies; social network interventions, school-based skills interventions, suicide awareness or gatekeeper programs, and community-based, culturally tailored adjunct programs). Dialectical behavior therapy showed moderate strength of evidence for reducing suicidal ideation. Other categories of psychosocial treatments showed insufficient to low strength of evidence for reducing suicidal outcomes. None of the studies evaluated adverse events. The evidence base on pharmacologic treatment for youths at risk of suicide was largely nonexistent."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review found that the current evidence on available interventions targeting youths at heightened risk of suicide is uncertain. Medication, neurotherapeutics, and emerging therapies remain unstudied among this population. The limited evidence base calls for the development of novel, developmentally and trauma-informed treatments, as well as multilevel interventions to target the increasing suicide risk among youths."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41021221/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1001/jamapediatrics.2025.3485",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "The effectiveness of current interventions for youth at heightened suicide risk is uncertain, highlighting the need for new, trauma-informed treatments and multilevel approaches."
    },
    {
      "id": "a6e71ba621f6",
      "title": "Budesonide-formoterol versus salbutamol as reliever therapy in children with mild asthma (CARE): a 52-week, open-label, multicentre, superiority, randomised controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117796",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "3e12a9eef337",
      "title": "Clinical and Prognostic Utility of the Essential Frailty Toolset in Older Patients With Heart Failure.",
      "journal": "J Am Geriatr Soc",
      "score": "4/7",
      "tags": [
        "Cardiology",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117753",
      "abstract": "Heart failure (HF) is associated with frailty, and most frailty assessment methods are subjective and complex. The Essential Frailty Toolset (EFT) is a simple, objective, and comprehensive frailty assessment tool. This study aimed to investigate the clinical and prognostic values of the EFT in patients with HF. Data from a multicenter, observational study on older (≥ 65 years old) patients hospitalized with HF, the FRAGILE-HF cohort, was used. The EFT includes a five-time chair stand test, cognitive function assessment, and hemoglobin and albumin measurements. Patients were divided into three groups based on their EFT points: robust (0 points), pre-frail (1-2 points), and frail (3-5 points). The primary endpoint was 2-year all-cause mortality. Of the total 1237 patients (80.1 ± 7.1 years; 43% females), the robust, pre-frail, and frail groups included 114 (11.6%), 606 (49.0%), and 487 (39.4%) patients, respectively. The prevalence of frailty, evaluated using the Fried phenotype model, increased with increased EFT points (p < 0.001). Within the 2-year follow-up period, 256 deaths occurred. The frail group was significantly associated with a higher risk of the primary endpoint than the robust group (adjusted hazard ratio [aHR], 2.01; 95% confidence interval [CI], 1.12-3.61; p = 0.019). The EFT point, as a continuous variable, was significantly associated with the primary endpoint (aHR, 1.19; 95% CI, 1.08-1.31; p < 0.001). A significant continuous net reclassification improvement was observed when the EFT groups were added to the conventional risk model. The EFT demonstrated valuable clinical and prognostic value in older patients with HF.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Heart failure (HF) is associated with frailty, and most frailty assessment methods are subjective and complex. The Essential Frailty Toolset (EFT) is a simple, objective, and comprehensive frailty assessment tool. This study aimed to investigate the clinical and prognostic values of the EFT in patients with HF."
        },
        {
          "label": "METHODS",
          "text": "Data from a multicenter, observational study on older (≥ 65 years old) patients hospitalized with HF, the FRAGILE-HF cohort, was used. The EFT includes a five-time chair stand test, cognitive function assessment, and hemoglobin and albumin measurements. Patients were divided into three groups based on their EFT points: robust (0 points), pre-frail (1-2 points), and frail (3-5 points). The primary endpoint was 2-year all-cause mortality."
        },
        {
          "label": "RESULTS",
          "text": "Of the total 1237 patients (80.1 ± 7.1 years; 43% females), the robust, pre-frail, and frail groups included 114 (11.6%), 606 (49.0%), and 487 (39.4%) patients, respectively. The prevalence of frailty, evaluated using the Fried phenotype model, increased with increased EFT points (p < 0.001). Within the 2-year follow-up period, 256 deaths occurred. The frail group was significantly associated with a higher risk of the primary endpoint than the robust group (adjusted hazard ratio [aHR], 2.01; 95% confidence interval [CI], 1.12-3.61; p = 0.019). The EFT point, as a continuous variable, was significantly associated with the primary endpoint (aHR, 1.19; 95% CI, 1.08-1.31; p < 0.001). A significant continuous net reclassification improvement was observed when the EFT groups were added to the conventional risk model."
        },
        {
          "label": "CONCLUSION",
          "text": "The EFT demonstrated valuable clinical and prognostic value in older patients with HF."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40981616/",
      "pubDate": "2025 Sep 22",
      "doi": "10.1111/jgs.70103",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "Ejection fraction testing (EFT) is clinically useful for older patients with heart failure."
    },
    {
      "id": "6d15e1082690",
      "title": "Prevention of Adverse Cardiovascular Events Using the 23-Valent Pneumococcal Polysaccharide Vaccine: A Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48444938/117700",
      "abstract": "Animal studies and meta-analysis of human observational data suggest that pneumococcal polysaccharide vaccination (PPV) could be protective against atherosclerosis; however, to the authors' knowledge, no randomized clinical trial has been conducted. To determine whether pneumococcal vaccination (Pneumovax [Merck Sharp & Dohme Corp]) decreases the composite primary outcome of fatal and nonfatal acute coronary syndrome and ischemic stroke in people at increased risk, with an average follow-up of 7 years after immunization. This was a double-blind, placebo-controlled, parallel-arm randomized clinical trial conducted at 6 centers across Australia. Participants were community-dwelling adults 55 to 60 years of age at baseline in 2016 to 2017, with at least 2 risk factors (obesity, hypertension, or hypercholesterolemia) for cardiovascular disease (CVD) but no prior CVD event or indication for early pneumococcal vaccination. Data were analyzed from February 2023 to December 2024 using competing risk proportional hazards regression models, stratified by sex and center. Participants received either 23-valent PPV (PPV23) or placebo (saline). The primary outcome was a composite of fatal and nonfatal myocardial infarction or ischemic stroke, ascertained via electronic medical records from emergency department, admitted patient, and mortality data collections using International Statistical Classification of Diseases, Tenth Revision, Australian Modification (ICD-10-AM) codes. A total of 4725 participants (mean [SD] age, 58.0 [1.7] years; 2433 male [52%]) were included in this study. There was no significant difference in the primary outcome (58 of 2366 events in the active PPV23 group compared with 64 of 2357 events in the control group, hazard ratio, 0.90; 95% CI, 0.63-1.28; P = .57). Similarly, no significant differences occurred in the exploratory outcomes of all-cause mortality, all-cause hospital presentations, and CVD-related hospital procedures. These results are tempered by the lower than expected event rate leading to low power. Results of this randomized clinical trial found that PPV23 did not reduce the rates of fatal and nonfatal acute coronary syndrome and ischemic stroke, although the study was underpowered. ANZCTR Identifier: ACTRN12615000536561.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Animal studies and meta-analysis of human observational data suggest that pneumococcal polysaccharide vaccination (PPV) could be protective against atherosclerosis; however, to the authors' knowledge, no randomized clinical trial has been conducted."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether pneumococcal vaccination (Pneumovax [Merck Sharp & Dohme Corp]) decreases the composite primary outcome of fatal and nonfatal acute coronary syndrome and ischemic stroke in people at increased risk, with an average follow-up of 7 years after immunization."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a double-blind, placebo-controlled, parallel-arm randomized clinical trial conducted at 6 centers across Australia. Participants were community-dwelling adults 55 to 60 years of age at baseline in 2016 to 2017, with at least 2 risk factors (obesity, hypertension, or hypercholesterolemia) for cardiovascular disease (CVD) but no prior CVD event or indication for early pneumococcal vaccination. Data were analyzed from February 2023 to December 2024 using competing risk proportional hazards regression models, stratified by sex and center."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants received either 23-valent PPV (PPV23) or placebo (saline)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite of fatal and nonfatal myocardial infarction or ischemic stroke, ascertained via electronic medical records from emergency department, admitted patient, and mortality data collections using International Statistical Classification of Diseases, Tenth Revision, Australian Modification (ICD-10-AM) codes."
        },
        {
          "label": "RESULTS",
          "text": "A total of 4725 participants (mean [SD] age, 58.0 [1.7] years; 2433 male [52%]) were included in this study. There was no significant difference in the primary outcome (58 of 2366 events in the active PPV23 group compared with 64 of 2357 events in the control group, hazard ratio, 0.90; 95% CI, 0.63-1.28; P = .57). Similarly, no significant differences occurred in the exploratory outcomes of all-cause mortality, all-cause hospital presentations, and CVD-related hospital procedures. These results are tempered by the lower than expected event rate leading to low power."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Results of this randomized clinical trial found that PPV23 did not reduce the rates of fatal and nonfatal acute coronary syndrome and ischemic stroke, although the study was underpowered."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ANZCTR Identifier: ACTRN12615000536561."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40960793/",
      "pubDate": "2025 Sep 17",
      "doi": "10.1001/jamacardio.2025.3043",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "PPV23 vaccination did not decrease the incidence of fatal or nonfatal acute coronary syndrome or ischemic stroke."
    },
    {
      "id": "b3a281a349a3",
      "title": "Efficacy and Safety of Ammoxetine in Major Depressive Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117745",
      "abstract": "Major depressive disorder (MDD) is among the most prevalent mental health disorders, causing substantial disability and economic burden. Although several first-line treatments exist with mild adverse effects, up to 50% to 60% of patients do not tolerate or respond to them. Ammoxetine, a novel selective serotonin and norepinephrine reuptake inhibitor, has been found to reduce adverse effects and hepatotoxicity and more potent inhibition of serotonin and norepinephrine transporters, making it more tolerable and effective. To evaluate the efficacy and safety of ammoxetine in treating adults with MDD. This phase 2 randomized clinical trial was a multicenter, double-masked, placebo-controlled, parallel-group, fixed-dose study of ammoxetine treatment in patients with MDD in China. Patients aged 18 to 65 years from 15 study centers were randomized into daily ammoxetine or placebo groups between March 27, 2023, and June 13, 2024, and followed up for 10 weeks. Participants were randomized 1:1:1 to 3 treatment groups: ammoxetine 40 mg/d, ammoxetine 60 mg/d, and placebo. The primary outcome was change in Montgomery-Åsberg Depression Rating Scale (MADRS) total score from baseline to 8 weeks. Efficacy analyses were performed on both the full-analysis and per-protocol sets using least-squares (LS) mean differences. The safety set analysis was performed using descriptive statistics. Among 239 enrolled patients (mean [SD] age, 30.4 [10.0] years, 158 female [66.1%]), 80 were randomized to the ammoxetine 60 mg/d group, 80 to the ammoxetine 40 mg/d group, and 79 to the placebo group. In the full-analysis set, both ammoxetine doses led to statistically significant improvements in MADRS total scores at week 8 compared with placebo. The LS mean changes (SE) from baseline were -16.7 (1.3) for ammoxetine 40 mg/d, -16.6 (1.3) for ammoxetine 60 mg/d, and -13.5 (1.3) for placebo. The differences vs placebo were -3.3 (97.3 CI, -6.3 to -0.3) for ammoxetine 40 mg/d and -3.1 (97.3% CI, -6.2 to 0.0) for ammoxetine 60 mg/d. Consistent results were observed in the per-protocol set analysis at week 8 for ammoxetine 40 mg/d (LS mean change, -3.2; 97.3% CI, -6.2 to -0.2) and ammoxetine 60 mg/d (LS mean change, -3.18; 97.3% CI, -6.2 to -0.2), both superior to placebo. Treatment-emergent adverse events were reported in 68 participants (85.0%) receiving ammoxetine 60 mg/d, 63 (78.8%) receiving ammoxetine 40 mg/d, and 48 (60.8%) receiving placebo; most were mild to moderate in severity. This randomized clinical trial demonstrated superiority over placebo of ammoxetine treatment at both 40 mg/d and 60 mg/d in patients with MDD. In addition, all doses of ammoxetine were generally well tolerated. ClinicalTrials.gov Identifier: NCT05762458.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Major depressive disorder (MDD) is among the most prevalent mental health disorders, causing substantial disability and economic burden. Although several first-line treatments exist with mild adverse effects, up to 50% to 60% of patients do not tolerate or respond to them. Ammoxetine, a novel selective serotonin and norepinephrine reuptake inhibitor, has been found to reduce adverse effects and hepatotoxicity and more potent inhibition of serotonin and norepinephrine transporters, making it more tolerable and effective."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the efficacy and safety of ammoxetine in treating adults with MDD."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This phase 2 randomized clinical trial was a multicenter, double-masked, placebo-controlled, parallel-group, fixed-dose study of ammoxetine treatment in patients with MDD in China. Patients aged 18 to 65 years from 15 study centers were randomized into daily ammoxetine or placebo groups between March 27, 2023, and June 13, 2024, and followed up for 10 weeks."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1:1 to 3 treatment groups: ammoxetine 40 mg/d, ammoxetine 60 mg/d, and placebo."
        },
        {
          "label": "MAIN OUTCOME AND MEASURES",
          "text": "The primary outcome was change in Montgomery-Åsberg Depression Rating Scale (MADRS) total score from baseline to 8 weeks. Efficacy analyses were performed on both the full-analysis and per-protocol sets using least-squares (LS) mean differences. The safety set analysis was performed using descriptive statistics."
        },
        {
          "label": "RESULTS",
          "text": "Among 239 enrolled patients (mean [SD] age, 30.4 [10.0] years, 158 female [66.1%]), 80 were randomized to the ammoxetine 60 mg/d group, 80 to the ammoxetine 40 mg/d group, and 79 to the placebo group. In the full-analysis set, both ammoxetine doses led to statistically significant improvements in MADRS total scores at week 8 compared with placebo. The LS mean changes (SE) from baseline were -16.7 (1.3) for ammoxetine 40 mg/d, -16.6 (1.3) for ammoxetine 60 mg/d, and -13.5 (1.3) for placebo. The differences vs placebo were -3.3 (97.3 CI, -6.3 to -0.3) for ammoxetine 40 mg/d and -3.1 (97.3% CI, -6.2 to 0.0) for ammoxetine 60 mg/d. Consistent results were observed in the per-protocol set analysis at week 8 for ammoxetine 40 mg/d (LS mean change, -3.2; 97.3% CI, -6.2 to -0.2) and ammoxetine 60 mg/d (LS mean change, -3.18; 97.3% CI, -6.2 to -0.2), both superior to placebo. Treatment-emergent adverse events were reported in 68 participants (85.0%) receiving ammoxetine 60 mg/d, 63 (78.8%) receiving ammoxetine 40 mg/d, and 48 (60.8%) receiving placebo; most were mild to moderate in severity."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial demonstrated superiority over placebo of ammoxetine treatment at both 40 mg/d and 60 mg/d in patients with MDD. In addition, all doses of ammoxetine were generally well tolerated."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05762458."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982284/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamanetworkopen.2025.32650",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "Ammoxetine at both 40 mg/d and 60 mg/d was more effective than placebo in treating major depressive disorder and was generally well tolerated."
    },
    {
      "id": "310bf1b1a5cd",
      "title": "Candesartan versus placebo for migraine prevention in patients with episodic migraine: a randomised, triple-blind, placebo-controlled, phase 2 trial.",
      "journal": "Lancet Neurol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Neurology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117730",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "c5d2271c977c",
      "title": "Cognitive Behavioral Therapy for Insomnia in People With Chronic Disease: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117727",
      "abstract": "Insomnia is highly prevalent among individuals with chronic disease (eg, chronic pain, cardiovascular disease, and cancer) and results in poorer disease outcomes and quality of life. Cognitive behavioral therapy for insomnia (CBT-I) is recommended as first-line treatment for insomnia. However, concerns remain about its applicability and efficacy in people with chronic disease. To evaluate the nature, efficacy, and acceptability of CBT-I in adults with chronic disease, and to identify moderators of treatment outcomes. Systematic searches were conducted in PsycINFO, Medline, Embase, and CENTRAL from database inception to June 5, 2025. Additional records were identified from reference lists of relevant reviews and studies. Eligible studies were randomized clinical trials (RCTs) involving adults (aged ≥18 years) with chronic disease and insomnia. Studies using CBT-I with measured sleep outcomes were included. Two assessors extracted data from RCTs. Hedges g was used to calculate effect sizes, and random effects meta-analyses were conducted. Heterogeneity was assessed via I2. Subgroup analyses examined whether outcomes varied by delivery format, chronic condition type, or control group. Primary outcomes included insomnia severity, sleep efficiency, and sleep onset latency. Secondary outcomes included treatment acceptability and adverse effects. Sixty-seven RCTs (5232 participants) met inclusion criteria, including chronic diseases such as cancer, chronic pain, irritable bowel syndrome, and stroke. CBT-I was associated with significantly improved outcomes for insomnia severity (g = 0.98; 95% CI, 0.81-1.16) and moderate effect sizes regarding sleep efficiency (g = 0.77; 95% CI, 0.63-0.91) and sleep onset latency (g = 0.64; 95% CI, 0.50-0.78). Subgroup analyses revealed some sample, treatment, and methodological moderators (eg, longer treatment yielded better outcomes for sleep efficiency and sleep onset latency). Satisfaction with CBT-I was high, with a mean dropout rate of 13.3%. Treatment-related adverse effects were rare. This systematic review and meta-analysis showed that CBT-I demonstrated strong efficacy and acceptability in chronic disease populations, with moderate to large effect sizes that appear comparable to those in non-chronic disease populations. Efficacy of CBT-I was similar across a range of disease subgroups. Future research should explore the role and nature of treatment adaptations for specific populations and increase access to CBT-I in medical settings.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Insomnia is highly prevalent among individuals with chronic disease (eg, chronic pain, cardiovascular disease, and cancer) and results in poorer disease outcomes and quality of life. Cognitive behavioral therapy for insomnia (CBT-I) is recommended as first-line treatment for insomnia. However, concerns remain about its applicability and efficacy in people with chronic disease."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the nature, efficacy, and acceptability of CBT-I in adults with chronic disease, and to identify moderators of treatment outcomes."
        },
        {
          "label": "DATA SOURCES",
          "text": "Systematic searches were conducted in PsycINFO, Medline, Embase, and CENTRAL from database inception to June 5, 2025. Additional records were identified from reference lists of relevant reviews and studies."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Eligible studies were randomized clinical trials (RCTs) involving adults (aged ≥18 years) with chronic disease and insomnia. Studies using CBT-I with measured sleep outcomes were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two assessors extracted data from RCTs. Hedges g was used to calculate effect sizes, and random effects meta-analyses were conducted. Heterogeneity was assessed via I2. Subgroup analyses examined whether outcomes varied by delivery format, chronic condition type, or control group."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Primary outcomes included insomnia severity, sleep efficiency, and sleep onset latency. Secondary outcomes included treatment acceptability and adverse effects."
        },
        {
          "label": "RESULTS",
          "text": "Sixty-seven RCTs (5232 participants) met inclusion criteria, including chronic diseases such as cancer, chronic pain, irritable bowel syndrome, and stroke. CBT-I was associated with significantly improved outcomes for insomnia severity (g = 0.98; 95% CI, 0.81-1.16) and moderate effect sizes regarding sleep efficiency (g = 0.77; 95% CI, 0.63-0.91) and sleep onset latency (g = 0.64; 95% CI, 0.50-0.78). Subgroup analyses revealed some sample, treatment, and methodological moderators (eg, longer treatment yielded better outcomes for sleep efficiency and sleep onset latency). Satisfaction with CBT-I was high, with a mean dropout rate of 13.3%. Treatment-related adverse effects were rare."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review and meta-analysis showed that CBT-I demonstrated strong efficacy and acceptability in chronic disease populations, with moderate to large effect sizes that appear comparable to those in non-chronic disease populations. Efficacy of CBT-I was similar across a range of disease subgroups. Future research should explore the role and nature of treatment adaptations for specific populations and increase access to CBT-I in medical settings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982264/",
      "pubDate": "2025 Sep 22",
      "doi": "10.1001/jamainternmed.2025.4610",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "Cognitive Behavioral Therapy for Insomnia (CBT-I) is an effective and well-tolerated treatment for insomnia in people with chronic diseases, showing similar effectiveness to those without chronic diseases."
    },
    {
      "id": "0059b4e592ed",
      "title": "Permethrin-Treated Baby Wraps for the Prevention of Malaria.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117718",
      "abstract": "Malaria remains a major cause of childhood death in sub-Saharan Africa. We leveraged the traditional practice of mothers carrying children on their backs in cloth wraps to assess whether treating the wraps with an insect repellent might provide a layer of protection against malaria. In a double-blind, randomized, placebo-controlled trial conducted in Uganda, we enrolled adult women with a child who was 6 to 18 months of age. The mother-child pairs were randomly assigned in a 1:1 ratio to use permethrin-treated wraps (intervention group) or sham-treated wraps (control group). The wraps underwent retreatment every 4 weeks. All the participants received a new, pyrethroid-only long-lasting insecticide-treated bed net. The participants visited the trial clinics every 2 weeks for 24 weeks and made unscheduled visits in the case of febrile illness in the children. The primary outcome was clinical malaria in the children, as defined by fever and a positive malaria rapid diagnostic test. From June 2022 through April 2024, a total of 419 mother-child pairs were screened, and 400 underwent randomization; 200 pairs were assigned to the intervention group and 200 to the control group. Clinic attendance was high (5194 of 5200 planned visits [99.9%] were attended), and no participants were lost to follow-up. The incidence rate of clinical malaria was 0.73 cases per 100 person-weeks (95% confidence interval [CI], 0.51 to 1.02) in the intervention group and 2.14 cases per 100 person-weeks (95% CI, 1.73 to 2.62) in the control group (incidence rate ratio, 0.34; 95% CI, 0.23 to 0.51; P<0.001). Rash was reported more often in the intervention group than in the control group (8.5% vs. 6.0% of participants). Among mother-child pairs who had access to bed nets, maternal use of permethrin-treated baby wraps significantly reduced the incidence of clinical malaria in the children. (Funded by the Doris Duke Foundation and others; ClinicalTrials.gov number, NCT05391230.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Malaria remains a major cause of childhood death in sub-Saharan Africa. We leveraged the traditional practice of mothers carrying children on their backs in cloth wraps to assess whether treating the wraps with an insect repellent might provide a layer of protection against malaria."
        },
        {
          "label": "METHODS",
          "text": "In a double-blind, randomized, placebo-controlled trial conducted in Uganda, we enrolled adult women with a child who was 6 to 18 months of age. The mother-child pairs were randomly assigned in a 1:1 ratio to use permethrin-treated wraps (intervention group) or sham-treated wraps (control group). The wraps underwent retreatment every 4 weeks. All the participants received a new, pyrethroid-only long-lasting insecticide-treated bed net. The participants visited the trial clinics every 2 weeks for 24 weeks and made unscheduled visits in the case of febrile illness in the children. The primary outcome was clinical malaria in the children, as defined by fever and a positive malaria rapid diagnostic test."
        },
        {
          "label": "RESULTS",
          "text": "From June 2022 through April 2024, a total of 419 mother-child pairs were screened, and 400 underwent randomization; 200 pairs were assigned to the intervention group and 200 to the control group. Clinic attendance was high (5194 of 5200 planned visits [99.9%] were attended), and no participants were lost to follow-up. The incidence rate of clinical malaria was 0.73 cases per 100 person-weeks (95% confidence interval [CI], 0.51 to 1.02) in the intervention group and 2.14 cases per 100 person-weeks (95% CI, 1.73 to 2.62) in the control group (incidence rate ratio, 0.34; 95% CI, 0.23 to 0.51; P<0.001). Rash was reported more often in the intervention group than in the control group (8.5% vs. 6.0% of participants)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among mother-child pairs who had access to bed nets, maternal use of permethrin-treated baby wraps significantly reduced the incidence of clinical malaria in the children. (Funded by the Doris Duke Foundation and others; ClinicalTrials.gov number, NCT05391230.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40991921/",
      "pubDate": "2025 Oct 09",
      "doi": "10.1056/NEJMoa2501628",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "In mother-child pairs with bed net access, using permethrin-treated baby wraps by the mothers decreased the occurrence of malaria in their children."
    },
    {
      "id": "f2b87f1d9f81",
      "title": "Computed Tomography Angiography or Standard Care After Left Main PCI?.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117654",
      "abstract": "The clinical benefit of routine coronary computed tomography angiography (CCTA) after percutaneous coronary intervention (PCI) for unprotected left main (LM) disease is uncertain. The authors evaluated whether CCTA-guided follow-up improves clinical outcomes vs symptoms- or ischemia-driven care after LM PCI. PULSE was a prospective, multicenter, open-label randomized trial. A total of 606 patients treated with second-generation drug-eluting stents were enrolled (October 2019 to September 2024) and randomized 1:1 to CCTA at 6 months (experimental) or standard care (control). The primary endpoint was a composite of all-cause death, spontaneous myocardial infarction (MI), unstable angina, or definite or probable stent thrombosis at 18 months. Secondary endpoints included target-lesion revascularization (TLR) and each primary endpoint component. CCTA was completed in 272/303 experimental patients (89.8%) after a median of 200 days (IQR: 181-270 days). The primary endpoint occurred in 36/303 experimental patients vs 38/303 control patients (11.9% vs 12.5%; HR: 0.97; 95% CI: 0.76-1.23; P = 0.80). Compared with the control arm, the CCTA arm showed a reduced risk of spontaneous MI (0.9% vs 4.9%; HR: 0.26; 95% CI: 0.07-0.91; P = 0.004) and an increased risk of imaging-triggered TLR (4.9% vs 0.3%; HR: 7.7; 95% CI: 1.70-33.7; P = 0.001), whereas clinically driven TLR rates were similar (5.3% vs 7.2%; HR: 0.74; 95% CI: 0.38-1.41; P = 0.32). Routine CCTA after LM PCI did not reduce the composite primary endpoint, but was associated with fewer spontaneous MIs and more imaging-triggered revascularizations. Future trials to clarify its value in complex anatomic subsets appear to be warranted. (Angiographic Control vs Ischemia-Driven Management of Patients Treated With PCI on Left Main With Drug-Eluting Stents [PULSE; NCT04144881]).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The clinical benefit of routine coronary computed tomography angiography (CCTA) after percutaneous coronary intervention (PCI) for unprotected left main (LM) disease is uncertain."
        },
        {
          "label": "OBJECTIVES",
          "text": "The authors evaluated whether CCTA-guided follow-up improves clinical outcomes vs symptoms- or ischemia-driven care after LM PCI."
        },
        {
          "label": "METHODS",
          "text": "PULSE was a prospective, multicenter, open-label randomized trial. A total of 606 patients treated with second-generation drug-eluting stents were enrolled (October 2019 to September 2024) and randomized 1:1 to CCTA at 6 months (experimental) or standard care (control). The primary endpoint was a composite of all-cause death, spontaneous myocardial infarction (MI), unstable angina, or definite or probable stent thrombosis at 18 months. Secondary endpoints included target-lesion revascularization (TLR) and each primary endpoint component."
        },
        {
          "label": "RESULTS",
          "text": "CCTA was completed in 272/303 experimental patients (89.8%) after a median of 200 days (IQR: 181-270 days). The primary endpoint occurred in 36/303 experimental patients vs 38/303 control patients (11.9% vs 12.5%; HR: 0.97; 95% CI: 0.76-1.23; P = 0.80). Compared with the control arm, the CCTA arm showed a reduced risk of spontaneous MI (0.9% vs 4.9%; HR: 0.26; 95% CI: 0.07-0.91; P = 0.004) and an increased risk of imaging-triggered TLR (4.9% vs 0.3%; HR: 7.7; 95% CI: 1.70-33.7; P = 0.001), whereas clinically driven TLR rates were similar (5.3% vs 7.2%; HR: 0.74; 95% CI: 0.38-1.41; P = 0.32)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Routine CCTA after LM PCI did not reduce the composite primary endpoint, but was associated with fewer spontaneous MIs and more imaging-triggered revascularizations. Future trials to clarify its value in complex anatomic subsets appear to be warranted. (Angiographic Control vs Ischemia-Driven Management of Patients Treated With PCI on Left Main With Drug-Eluting Stents [PULSE; NCT04144881])."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886174/",
      "pubDate": "2025 Aug 26",
      "doi": "10.1016/j.jacc.2025.07.060",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "ad5cfed2eb2f",
      "title": "Evidence for improved glucose metrics and perinatal outcomes with continuous glucose monitoring compared to self-monitoring in diabetes during pregnancy.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117644",
      "abstract": "Continuous glucose monitoring is recommended for pregnant women with type 1 diabetes, due to associations with decreased hemoglobin A1c and large for gestational age. However, its benefit in type 2 diabetes and gestational diabetes is not established. This systematic review and meta-analysis compared usage of continuous glucose monitoring to self-monitoring of blood glucose both across and within diabetes in pregnancy and determined which glucose metrics are associated with perinatal outcomes, to potentially inform treatment targets in diabetes in pregnancy. We searched Medline, Embase, CENTRAL, CINAHL, and Scopus, from January 2003 to August 2024. Randomized controlled trials and quasi-experimental studies comparing continuous glucose monitoring with self-monitoring of blood glucose in diabetes in pregnancy were included. Randomized controlled trials and quasi-experimental studies were analyzed separately. Data were extracted on continuous glucose monitoring metrics, hemoglobin A1c, rates of cesarean delivery, large for gestational age, small for gestational age, neonatal hypoglycemia, and neonatal intensive care unit admission, summarized as mean differences or odds ratios with 95% confidence intervals and 95% prediction intervals. Prespecified subgroup analyses were undertaken by diabetes in pregnancy subtype, including duration of continuous glucose monitoring use (continuous vs intermittent) for large for gestational age. Certainty of evidence was assessed using the Grading of Recommendations, Assessment, Development, and Evaluations framework. Across diabetes in pregnancy, continuous glucose monitoring (vs self-monitoring of blood glucose) decreased hemoglobin A1c (mean difference, -0.22% [95% confidence interval, -0.37, -0.08]) (7 randomized controlled trials, moderate-certainty evidence). Within diabetes in pregnancy, continuous glucose monitoring use (vs self-monitoring of blood glucose) showed similar but stronger benefits in both type 1 diabetes when used throughout pregnancy (hemoglobin A1c mean difference, -0.18% [95% confidence interval, -0.36, 0.00]; large for gestational age odds ratio, 0.51 [0.28, 0.90]) (1 randomized controlled trial, high-certainty evidence), and gestational diabetes when used intermittently (hemoglobin A1c mean difference, -0.18 [95% confidence interval, -0.33, -0.02]) (5 randomized controlled trials, moderate-certainty evidence) and large for gestational age (odds ratio, 0.46 [0.26, 0.81]) (1 quasi-experimental study, low-certainty evidence), with insufficient data for continuous glucose monitoring benefit in type 2 diabetes. Increased pregnancy %time-in-range (type 1 diabetes) and decreased mean sensor glucose (type 1 diabetes/gestational diabetes) were associated with decreased large for gestational age. Usage of continuous glucose monitoring (vs self-monitoring of blood glucose) reduces hemoglobin A1c and possibly large for gestational age across diabetes in pregnancy. Greatest benefit was evidenced in type 1 diabetes, followed by gestational diabetes, although continuous glucose monitoring duration differed. Mean sensor glucose and pregnancy %time-in-range are important continuous glucose monitoring metrics for reducing large for gestational age.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Continuous glucose monitoring is recommended for pregnant women with type 1 diabetes, due to associations with decreased hemoglobin A1c and large for gestational age. However, its benefit in type 2 diabetes and gestational diabetes is not established. This systematic review and meta-analysis compared usage of continuous glucose monitoring to self-monitoring of blood glucose both across and within diabetes in pregnancy and determined which glucose metrics are associated with perinatal outcomes, to potentially inform treatment targets in diabetes in pregnancy."
        },
        {
          "label": "DATA SOURCES",
          "text": "We searched Medline, Embase, CENTRAL, CINAHL, and Scopus, from January 2003 to August 2024."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Randomized controlled trials and quasi-experimental studies comparing continuous glucose monitoring with self-monitoring of blood glucose in diabetes in pregnancy were included."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Randomized controlled trials and quasi-experimental studies were analyzed separately. Data were extracted on continuous glucose monitoring metrics, hemoglobin A1c, rates of cesarean delivery, large for gestational age, small for gestational age, neonatal hypoglycemia, and neonatal intensive care unit admission, summarized as mean differences or odds ratios with 95% confidence intervals and 95% prediction intervals. Prespecified subgroup analyses were undertaken by diabetes in pregnancy subtype, including duration of continuous glucose monitoring use (continuous vs intermittent) for large for gestational age. Certainty of evidence was assessed using the Grading of Recommendations, Assessment, Development, and Evaluations framework."
        },
        {
          "label": "RESULTS",
          "text": "Across diabetes in pregnancy, continuous glucose monitoring (vs self-monitoring of blood glucose) decreased hemoglobin A1c (mean difference, -0.22% [95% confidence interval, -0.37, -0.08]) (7 randomized controlled trials, moderate-certainty evidence). Within diabetes in pregnancy, continuous glucose monitoring use (vs self-monitoring of blood glucose) showed similar but stronger benefits in both type 1 diabetes when used throughout pregnancy (hemoglobin A1c mean difference, -0.18% [95% confidence interval, -0.36, 0.00]; large for gestational age odds ratio, 0.51 [0.28, 0.90]) (1 randomized controlled trial, high-certainty evidence), and gestational diabetes when used intermittently (hemoglobin A1c mean difference, -0.18 [95% confidence interval, -0.33, -0.02]) (5 randomized controlled trials, moderate-certainty evidence) and large for gestational age (odds ratio, 0.46 [0.26, 0.81]) (1 quasi-experimental study, low-certainty evidence), with insufficient data for continuous glucose monitoring benefit in type 2 diabetes. Increased pregnancy %time-in-range (type 1 diabetes) and decreased mean sensor glucose (type 1 diabetes/gestational diabetes) were associated with decreased large for gestational age."
        },
        {
          "label": "CONCLUSION",
          "text": "Usage of continuous glucose monitoring (vs self-monitoring of blood glucose) reduces hemoglobin A1c and possibly large for gestational age across diabetes in pregnancy. Greatest benefit was evidenced in type 1 diabetes, followed by gestational diabetes, although continuous glucose monitoring duration differed. Mean sensor glucose and pregnancy %time-in-range are important continuous glucose monitoring metrics for reducing large for gestational age."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40216177/",
      "pubDate": "2025 Sep",
      "doi": "10.1016/j.ajog.2025.04.010",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false,
      "summary": "Continuous glucose monitoring improves glycemic control and may reduce large for gestational age infants in pregnant individuals with diabetes, with the greatest benefit seen in type 1 diabetes."
    },
    {
      "id": "4c06bf84a5fd",
      "title": "High-Dose vs Standard-Dose Influenza Vaccine and Cardiovascular Outcomes in Older Adults: A Prespecified Secondary Analysis of the DANFLU-2 Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117638",
      "abstract": "The high-dose inactivated influenza vaccine (HD-IIV) has demonstrated superior protection against laboratory-confirmed influenza infection vs standard-dose IIV (SD-IIV); however, data regarding its effectiveness against cardiovascular (CV) outcomes are mainly from observational studies or specific high-risk groups. To investigate the relative vaccine effectiveness (rVE) of HD-IIV vs SD-IIV against CV outcomes in the general older adult population in Denmark. This was a prespecified secondary analysis of DANFLU-2, a pragmatic, open-label, individually randomized clinical trial (RCT) using nationwide administrative health registries in Denmark during the 2022/2023 to 2024/2025 influenza seasons. Older adults (age ≥65 years) were eligible for inclusion regardless of comorbidity. The trial design specified that if the primary end point was neutral, no hypothesis testing would be performed for secondary or exploratory end points. Data were analyzed from June 29 to August 12, 2025. Individual-level 1:1 randomization to HD-IIV or SD-IIV. Participants re-enrolling in additional seasons were rerandomized. Severe CV outcomes were prespecified secondary and exploratory end points in the trial, occurring from 14 days after vaccination through May 31 the following year. A total of 332 438 participants (170 900 [51.4%] male; mean [SD] age, 73.7 [5.8] years) were randomized (166 218 to HD-IIV and 166 220 to SD-IIV), of whom 91 026 (27.4%) had a history of CV disease. HD-IIV did not significantly reduce the trial's primary end point of hospitalization for influenza or pneumonia. The incidence of hospitalization for any cardiorespiratory disease was lower in the HD-IIV group than the SD-IIV group (rVE, 5.7% [95% CI, 1.4% to 9.9%]; absolute difference, -0.13 [95% CI, -0.24 to -0.03] percentage points), and rVE did not differ by history of CV disease compared with no CV disease at baseline. Hospitalization for any CV disease occurred in fewer participants in the HD-IIV group than the SD-IIV group (rVE, 7.5% [95% CI, 1.5% to 12.5%]; absolute difference, -0.10 [95% CI, -0.18 to -0.02] percentage points) as did hospitalization for heart failure (rVE, 19.5% [95% CI, 3.3% to 33.1%]; absolute difference, -0.03 [95% CI, -0.06 to -0.01] percentage points). This study found reduced incidence of cardiorespiratory hospitalization among those who received HD-IIV vs SD-IIV, driven by a lower incidence of CV hospitalizations, and particularly heart failure hospitalizations. These differences should be interpreted as exploratory findings in the setting of a large RCT with a neutral primary outcome. ClinicalTrials.gov Identifier: NCT05517174.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The high-dose inactivated influenza vaccine (HD-IIV) has demonstrated superior protection against laboratory-confirmed influenza infection vs standard-dose IIV (SD-IIV); however, data regarding its effectiveness against cardiovascular (CV) outcomes are mainly from observational studies or specific high-risk groups."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate the relative vaccine effectiveness (rVE) of HD-IIV vs SD-IIV against CV outcomes in the general older adult population in Denmark."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a prespecified secondary analysis of DANFLU-2, a pragmatic, open-label, individually randomized clinical trial (RCT) using nationwide administrative health registries in Denmark during the 2022/2023 to 2024/2025 influenza seasons. Older adults (age ≥65 years) were eligible for inclusion regardless of comorbidity. The trial design specified that if the primary end point was neutral, no hypothesis testing would be performed for secondary or exploratory end points. Data were analyzed from June 29 to August 12, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Individual-level 1:1 randomization to HD-IIV or SD-IIV. Participants re-enrolling in additional seasons were rerandomized."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Severe CV outcomes were prespecified secondary and exploratory end points in the trial, occurring from 14 days after vaccination through May 31 the following year."
        },
        {
          "label": "RESULTS",
          "text": "A total of 332 438 participants (170 900 [51.4%] male; mean [SD] age, 73.7 [5.8] years) were randomized (166 218 to HD-IIV and 166 220 to SD-IIV), of whom 91 026 (27.4%) had a history of CV disease. HD-IIV did not significantly reduce the trial's primary end point of hospitalization for influenza or pneumonia. The incidence of hospitalization for any cardiorespiratory disease was lower in the HD-IIV group than the SD-IIV group (rVE, 5.7% [95% CI, 1.4% to 9.9%]; absolute difference, -0.13 [95% CI, -0.24 to -0.03] percentage points), and rVE did not differ by history of CV disease compared with no CV disease at baseline. Hospitalization for any CV disease occurred in fewer participants in the HD-IIV group than the SD-IIV group (rVE, 7.5% [95% CI, 1.5% to 12.5%]; absolute difference, -0.10 [95% CI, -0.18 to -0.02] percentage points) as did hospitalization for heart failure (rVE, 19.5% [95% CI, 3.3% to 33.1%]; absolute difference, -0.03 [95% CI, -0.06 to -0.01] percentage points)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This study found reduced incidence of cardiorespiratory hospitalization among those who received HD-IIV vs SD-IIV, driven by a lower incidence of CV hospitalizations, and particularly heart failure hospitalizations. These differences should be interpreted as exploratory findings in the setting of a large RCT with a neutral primary outcome."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05517174."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884442/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1001/jamacardio.2025.3460",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "5d0ee66703e7",
      "title": "Automated Insulin Delivery Systems and Glucose Management in Children and Adolescents With Type 1 Diabetes: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Pediatr",
      "score": "5/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117622",
      "abstract": "Youth living with type 1 diabetes (T1D) are increasingly choosing automated insulin delivery (AID) systems to manage their blood glucose. Few systematic reviews meta-analyzing results from randomized clinical trials (RCTs) are available to guide decision-making. To study the association of prolonged AID system use in an outpatient setting with measures of glucose management and quality of life in youth with T1D. MEDLINE, Embase, CINAHL, and Cochrane Central were searched from January 2017 to March 2025 to identify eligible RCTs. Two reviewers independently performed literature screening, data extraction, and quality assessment. Included in the analysis were RCTs of youth aged 6 to 18 years with T1D that assessed the efficacy of AID systems in outpatient settings longer than 48 hours compared with any other insulin regimen. Two reviewers performed data extraction and quality assessment independently and reported using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) and PRISMA literature search extension guidelines. Random-effects meta-analysis models were used to estimate the pooled measures of efficacy as a mean difference (MD) with 95% CIs for outcomes measures. The 2 primary outcome measures were time in range (TIR) and glycated hemoglobin (HbA1c). Of 2363 citations retrieved, 11 RCTs (n = 901 participants) with measures of HbA1c and 10 RCTs (n = 786 participants) with measures of TIR were included. RCTs tested interventions lasting a mean (SD) of 31 (26) weeks on youth with a median age of 12 years (range, 10.8-15.9 years); 51% were female, mean (SD) HbA1c level was 8.4% (1.1%), and mean (SD) TIR was 51% (9%). Random-effects models revealed that, compared with any insulin regimen, HbA1c level was reduced -0.41% (95% CI, -0.58% to -0.25%; I2 = 39%), whereas TIR increased 11.5% (95% CI, 9.3%-13.7%; I2 = 23%) with nighttime TIR increasing 19.7% (95% CI, 17.0%-22.4%; I2 = 36%). Random-effects models also revealed that AID use was associated with reduced time spent in hypoglycemia (<3.9 mml/L; MD = -0.32%; 95% CI, -0.60% to -0.03%; I2 = 18%) and hyperglycemia (>10 mmol/L; MD = -10.8%; 95% CI, -14.4% to -7.2%; I2 = 55%), particularly during the night (MD = -14.4%; 95% CI, -19.9% to -8.9%; I2 = 79%) compared with any insulin regimen. There were no differences in adverse events between study arms. Only 2 studies reported changes in QOL. This systematic review and meta-analysis found that compared with any other insulin regimen, use of AID systems by youth with T1D was associated with clinically meaningful improvements in multiple measures of glucose management, including the risk of both hyperglycemia and hypoglycemia, without increasing the risk of adverse events. More data are needed on the efficacy of AID systems on patient report outcomes.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Youth living with type 1 diabetes (T1D) are increasingly choosing automated insulin delivery (AID) systems to manage their blood glucose. Few systematic reviews meta-analyzing results from randomized clinical trials (RCTs) are available to guide decision-making."
        },
        {
          "label": "OBJECTIVE",
          "text": "To study the association of prolonged AID system use in an outpatient setting with measures of glucose management and quality of life in youth with T1D."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, CINAHL, and Cochrane Central were searched from January 2017 to March 2025 to identify eligible RCTs."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Two reviewers independently performed literature screening, data extraction, and quality assessment. Included in the analysis were RCTs of youth aged 6 to 18 years with T1D that assessed the efficacy of AID systems in outpatient settings longer than 48 hours compared with any other insulin regimen."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers performed data extraction and quality assessment independently and reported using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) and PRISMA literature search extension guidelines. Random-effects meta-analysis models were used to estimate the pooled measures of efficacy as a mean difference (MD) with 95% CIs for outcomes measures."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The 2 primary outcome measures were time in range (TIR) and glycated hemoglobin (HbA1c)."
        },
        {
          "label": "RESULTS",
          "text": "Of 2363 citations retrieved, 11 RCTs (n = 901 participants) with measures of HbA1c and 10 RCTs (n = 786 participants) with measures of TIR were included. RCTs tested interventions lasting a mean (SD) of 31 (26) weeks on youth with a median age of 12 years (range, 10.8-15.9 years); 51% were female, mean (SD) HbA1c level was 8.4% (1.1%), and mean (SD) TIR was 51% (9%). Random-effects models revealed that, compared with any insulin regimen, HbA1c level was reduced -0.41% (95% CI, -0.58% to -0.25%; I2 = 39%), whereas TIR increased 11.5% (95% CI, 9.3%-13.7%; I2 = 23%) with nighttime TIR increasing 19.7% (95% CI, 17.0%-22.4%; I2 = 36%). Random-effects models also revealed that AID use was associated with reduced time spent in hypoglycemia (<3.9 mml/L; MD = -0.32%; 95% CI, -0.60% to -0.03%; I2 = 18%) and hyperglycemia (>10 mmol/L; MD = -10.8%; 95% CI, -14.4% to -7.2%; I2 = 55%), particularly during the night (MD = -14.4%; 95% CI, -19.9% to -8.9%; I2 = 79%) compared with any insulin regimen. There were no differences in adverse events between study arms. Only 2 studies reported changes in QOL."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review and meta-analysis found that compared with any other insulin regimen, use of AID systems by youth with T1D was associated with clinically meaningful improvements in multiple measures of glucose management, including the risk of both hyperglycemia and hypoglycemia, without increasing the risk of adverse events. More data are needed on the efficacy of AID systems on patient report outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40920375/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1001/jamapediatrics.2025.2740",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "90b39ded809a",
      "title": "Efficacy of pulsed radiofrequency treatment duration to the lumbar dorsal root ganglion in lumbar radicular pain: a double-blind randomized controlled trial.",
      "journal": "Reg Anesth Pain Med",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117621",
      "dateReceived": "2025-10-09T23:22:49.735Z",
      "isNew": false
    },
    {
      "id": "9fa2e2b7ab63",
      "title": "Effect of repurposed simvastatin on disability progression in secondary progressive multiple sclerosis (MS-STAT2): a phase 3, randomised, double-blind, placebo-controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48459634/117813",
      "abstract": "Despite the success of immune modulation in the treatment of relapsing multiple sclerosis, disability progression is a major problem driven by multiple mechanisms. Comorbidities (eg, vascular risk) and ageing are thought to augment these neurodegenerative pathologies. In the phase 2b MS-STAT trial of simvastatin (80 mg) versus placebo in secondary progressive multiple sclerosis (SPMS), the adjusted difference in brain atrophy rate between groups was -0·254% per year: a 43% reduction. In this phase 3 MS-STAT2 trial, we aimed to assess the efficacy of simvastatin versus placebo in slowing the progression of disability in SPMS. This phase 3, randomised, double-blind, parallel group, placebo-controlled clinical trial was conducted at 31 neuroscience centres and district general hospitals in the UK. Participants aged 18-65 years with a diagnosis of SPMS and an Expanded Disability Status Scale (EDSS) of between 4·0 and 6·5 were eligible and randomly assigned (1:1) to oral simvastatin (80 mg) or matched placebo for up to 4·5 years, based on a minimisation algorithm within an independent and secure online randomisation service. All participants, site investigators, and the trial coordinating team were masked to treatment allocation. The primary outcome was time to 6-month EDSS confirmed disability progression (an increase of at least 1 point if EDSS score at baseline visit was less than 6·0 or an increase of 0·5 point if EDSS score at baseline visit was 6·0 or more) assessed in all randomly assigned participants (intention-to-treat analysis) without imputation. This study is registered with ClinicalTrials.gov (NCT03387670) and is on the ISRCTN registry (ISRCTN82598726). The study is completed. Between May 10, 2018, and July 26, 2024, 1079 patients were screened for eligibility and 964 participants were randomly assigned, with 482 (50%) in the placebo group and 482 (50%) in the simvastatin group. Of all 964 participants, 704 (73%) were female and 260 (27%) were male, with a mean age of 54 years (SD 7). 173 (36%) of 482 participants in the placebo group and 192 (40%) of 482 participants in the simvastatin group had 6-month confirmed disability progression (adjusted hazard ratio 1·13 [95% CI 0·91 to 1·39], p=0·26). Although no emergent safety issues were seen, there was one serious adverse reaction (rhabdomyolysis) in the simvastatin group. 12 (2%) of 482 participants in the placebo group and five (1%) of 482 participants in the simvastatin group had a cardiovascular serious adverse event. The MS-STAT2 trial did not show a treatment effect of simvastatin in slowing disability progression in SPMS. Simvastatin use in multiple sclerosis should be confined to existing vascular indications. National Institute for Health and Care Research Health Technology Assessment Programme, UK Multiple Sclerosis Society, and the US National Multiple Sclerosis Society.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Despite the success of immune modulation in the treatment of relapsing multiple sclerosis, disability progression is a major problem driven by multiple mechanisms. Comorbidities (eg, vascular risk) and ageing are thought to augment these neurodegenerative pathologies. In the phase 2b MS-STAT trial of simvastatin (80 mg) versus placebo in secondary progressive multiple sclerosis (SPMS), the adjusted difference in brain atrophy rate between groups was -0·254% per year: a 43% reduction. In this phase 3 MS-STAT2 trial, we aimed to assess the efficacy of simvastatin versus placebo in slowing the progression of disability in SPMS."
        },
        {
          "label": "METHODS",
          "text": "This phase 3, randomised, double-blind, parallel group, placebo-controlled clinical trial was conducted at 31 neuroscience centres and district general hospitals in the UK. Participants aged 18-65 years with a diagnosis of SPMS and an Expanded Disability Status Scale (EDSS) of between 4·0 and 6·5 were eligible and randomly assigned (1:1) to oral simvastatin (80 mg) or matched placebo for up to 4·5 years, based on a minimisation algorithm within an independent and secure online randomisation service. All participants, site investigators, and the trial coordinating team were masked to treatment allocation. The primary outcome was time to 6-month EDSS confirmed disability progression (an increase of at least 1 point if EDSS score at baseline visit was less than 6·0 or an increase of 0·5 point if EDSS score at baseline visit was 6·0 or more) assessed in all randomly assigned participants (intention-to-treat analysis) without imputation. This study is registered with ClinicalTrials.gov (NCT03387670) and is on the ISRCTN registry (ISRCTN82598726). The study is completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between May 10, 2018, and July 26, 2024, 1079 patients were screened for eligibility and 964 participants were randomly assigned, with 482 (50%) in the placebo group and 482 (50%) in the simvastatin group. Of all 964 participants, 704 (73%) were female and 260 (27%) were male, with a mean age of 54 years (SD 7). 173 (36%) of 482 participants in the placebo group and 192 (40%) of 482 participants in the simvastatin group had 6-month confirmed disability progression (adjusted hazard ratio 1·13 [95% CI 0·91 to 1·39], p=0·26). Although no emergent safety issues were seen, there was one serious adverse reaction (rhabdomyolysis) in the simvastatin group. 12 (2%) of 482 participants in the placebo group and five (1%) of 482 participants in the simvastatin group had a cardiovascular serious adverse event."
        },
        {
          "label": "INTERPRETATION",
          "text": "The MS-STAT2 trial did not show a treatment effect of simvastatin in slowing disability progression in SPMS. Simvastatin use in multiple sclerosis should be confined to existing vascular indications."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health and Care Research Health Technology Assessment Programme, UK Multiple Sclerosis Society, and the US National Multiple Sclerosis Society."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41045938/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1016/S0140-6736(25)01039-6",
      "dateReceived": "2025-10-09T23:22:49.734Z",
      "isNew": false,
      "summary": "Simvastatin did not significantly slow disability progression in secondary progressive multiple sclerosis compared to placebo."
    }
  ]
}