{
  "updated_at": "2026-02-02T23:36:59.519Z",
  "articles": [
    {
      "id": "cb65e0a26caa",
      "title": "Low-dose yellow fever vaccination in infants: a randomised, double-blind, non-inferiority trial.",
      "journal": "Lancet",
      "score": "7/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease",
        "Pediatrics (General)",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49839117/118631",
      "abstract": "WHO recommends fractional dose vaccination to address yellow fever vaccine shortages during outbreaks. In adults, a 500 IU dose has recently been shown to be non-inferior to the full standard dose, but the minimum effective dose for children is unknown. We conducted a randomised, double-blind, non-inferiority trial at two centres in Kenya and Uganda, including infants aged 9-12 months with no previous yellow fever vaccination or infection. Participants were randomly assigned 1:1 in blocks of variable sizes of four, six, or eight to receive either the standard dose (>13 000 IU) or 500 IU of the Institut Pasteur de Dakar (Dakar, Senegal) 17D-204 yellow fever vaccine, co-administered with the measles-rubella vaccine. The primary outcome was seroconversion 28 days post-vaccination, defined as a four-fold or greater increase in antibody titre at day 28 from baseline (day 0), as measured by the 50% plaque reduction neutralisation test. Non-inferiority was shown if the lower bound of the 95% CI for the difference in seroconversion rates between doses exceeded -10 percentage points. Safety was assessed in the safety population, which included all participants who received a study vaccine dose. This study is registered with ClinicalTrials.gov (NCT04059471) and is complete. Between Oct 7, 2021, and June 14, 2023, 420 infants were enrolled and randomly assigned (210 participants in each group). The seroconversion rate at day 28 was 99% (95% CI 96-100; 177 of 179 infants) for the standard dose and 93% (88-96; 166 of 179 infants) for the 500 IU dose in the per-protocol population. The difference in seroconversion rate was -6·15 percentage points (95% CI -10·27 to -2·02); therefore, non-inferiority was not met for the 500 IU dose. 12 serious adverse events were reported in the study (eight in the 500 IU dose group and four in the standard dose group), but all were considered unrelated to vaccination. Compared with the standard yellow fever vaccine dose, a dose of 500 IU did not meet the non-inferiority criterion, suggesting that minimum dose requirements in adults are not generalisable to infants. Therefore, standard yellow fever doses should be used for infants in the routine WHO Expanded Programme on Immunization. European and Developing Countries Clinical Trials Partnership and the Wellcome Trust.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "WHO recommends fractional dose vaccination to address yellow fever vaccine shortages during outbreaks. In adults, a 500 IU dose has recently been shown to be non-inferior to the full standard dose, but the minimum effective dose for children is unknown."
        },
        {
          "label": "METHODS",
          "text": "We conducted a randomised, double-blind, non-inferiority trial at two centres in Kenya and Uganda, including infants aged 9-12 months with no previous yellow fever vaccination or infection. Participants were randomly assigned 1:1 in blocks of variable sizes of four, six, or eight to receive either the standard dose (>13 000 IU) or 500 IU of the Institut Pasteur de Dakar (Dakar, Senegal) 17D-204 yellow fever vaccine, co-administered with the measles-rubella vaccine. The primary outcome was seroconversion 28 days post-vaccination, defined as a four-fold or greater increase in antibody titre at day 28 from baseline (day 0), as measured by the 50% plaque reduction neutralisation test. Non-inferiority was shown if the lower bound of the 95% CI for the difference in seroconversion rates between doses exceeded -10 percentage points. Safety was assessed in the safety population, which included all participants who received a study vaccine dose. This study is registered with ClinicalTrials.gov (NCT04059471) and is complete."
        },
        {
          "label": "FINDINGS",
          "text": "Between Oct 7, 2021, and June 14, 2023, 420 infants were enrolled and randomly assigned (210 participants in each group). The seroconversion rate at day 28 was 99% (95% CI 96-100; 177 of 179 infants) for the standard dose and 93% (88-96; 166 of 179 infants) for the 500 IU dose in the per-protocol population. The difference in seroconversion rate was -6·15 percentage points (95% CI -10·27 to -2·02); therefore, non-inferiority was not met for the 500 IU dose. 12 serious adverse events were reported in the study (eight in the 500 IU dose group and four in the standard dose group), but all were considered unrelated to vaccination."
        },
        {
          "label": "INTERPRETATION",
          "text": "Compared with the standard yellow fever vaccine dose, a dose of 500 IU did not meet the non-inferiority criterion, suggesting that minimum dose requirements in adults are not generalisable to infants. Therefore, standard yellow fever doses should be used for infants in the routine WHO Expanded Programme on Immunization."
        },
        {
          "label": "FUNDING",
          "text": "European and Developing Countries Clinical Trials Partnership and the Wellcome Trust."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41544642/",
      "pubDate": "2026 Jan 31",
      "doi": "10.1016/S0140-6736(25)02069-0",
      "dateReceived": "2026-02-02T23:36:47.098Z",
      "isNew": true
    },
    {
      "id": "b613edf7bda1",
      "title": "Cannabis-based medicines for chronic neuropathic pain in adults.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Neurology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49919791/118700",
      "abstract": "Estimates of the population prevalence of chronic pain with neuropathic components range from 6% to 10%. Current pharmacological treatments for neuropathic pain help only a minority. New treatments are needed. Cannabis is increasingly promoted in the media as a treatment for chronic pain. This is an update of a review first published in 2018. To assess the benefits and harms of cannabis-based medicines (herbal, plant-based, synthetic) compared to placebo or conventional drugs for chronic neuropathic pain conditions in adults. We searched CENTRAL, MEDLINE, Embase, and three trial registries, together with reference checking. The latest search date was 29 January 2025. We selected randomised, double-blind controlled trials of medical cannabis, plant-derived and synthetic cannabinoids, against placebo or any other active treatment for chronic neuropathic pain conditions in adults, with a treatment duration of at least two weeks. We excluded studies whose double-blind duration was less than two weeks and studies which did not explicitly state that the pain was of a neuropathic nature. Critical outcomes were the number of participants reporting pain relief of at least 50%, a Patient Global Impression of Change (PGIC) rating of 'much' or 'very much' improved, serious adverse events, and withdrawals due to adverse events. We assessed the risk of bias (RoB) for seven outcomes reported in three summary of findings tables using the Cochrane RoB 1 tool. We synthesised results for each outcome using meta-analysis with a random-effects model by calculating absolute risk differences (RD) and standardised mean differences (SMD) with 95% confidence intervals (CI) for dichotomous outcomes and continuous outcomes, respectively. We used GRADE to assess the certainty of evidence for prespecified outcomes. We included six new studies involving 450 participants, along with 15 studies involving 1737 participants from the 2018 review, for a total of 21 studies with 2187 participants. The studies ranged from two to 26 weeks in duration. Sample sizes ranged from 18 to 339 participants. Participants' mean age ranged from 34 to 61 years, and the proportion of women ranged from 0% to 90%. Five studies included participants with central neuropathic pain, 14 studies included participants with peripheral neuropathic pain, and two studies included both types. Seven studies administered tetrahydrocannabinol (THC)-dominant medicines; nine studies, balanced THC and cannabidiol (CBD) medicines; and five studies, CBD-dominant medicines. Twenty studies compared cannabis-based medicine to placebo, and one study's comparator was dihydrocodeine. We judged the overall risk of bias to be low in six studies, unclear in 10 studies, and high in five studies. THC-dominant medicines versus placebo. There is no clear evidence for an effect on pain relief of at least 50% (RD 0.14, 95% CI -0.07 to 0.37; 7 studies, 534 participants), PGIC rating of 'much' or 'very much' improved (RD 0.17, 95% CI -0.24 to 0.58; 2 studies, 72 participants), withdrawals due to adverse events (RD 0.03, 95% CI -0.02 to 0.08; 6 studies, 511 participants), serious adverse events (RD 0.02, 95% CI -0.01 to 0.06; 7 studies, 537 participants), pain relief of at least 30% (RD 0.16, 95% CI -0.08 to 0.40; 7 studies, 566 participants), and psychiatric disorder-related adverse events (RD 0.01, 95% CI -0.01 to 0.03; 4 studies, 368 participants), all with very low-certainty evidence. They may increase nervous system adverse events (RD 0.25, 95% CI 0.14 to 0.37; 5 studies, 439 participants; low-certainty evidence). THC/CBD-balanced medicines versus placebo. There is no clear evidence for an effect on pain relief of at least 50% (RD 0.04, 95% CI 0.00 to 0.08; 8 studies, 746 participants) and serious adverse events (RD 0.01, 95% CI -0.02 to 0.03; 11 studies, 1449 participants), both with very low-certainty evidence. The evidence is very uncertain about the effect on nervous system-related (RD 0.39, 95% CI 0.23 to 0.55; 11 studies, 1445 participants) and psychiatric disorder-related adverse events (RD 0.08, 95% CI 0.03 to 0.13; 9 studies, 1375 participants), both very low-certainty evidence. They may increase PGIC ratings of 'much' or 'very much' improved (RD 0.07, 95% CI 0.02 to 0.11; 7 studies, 1145 participants), pain relief of at least 30% (RD 0.07, 95% CI 0.02 to 0.12; 10 studies, 1285 participants), and withdrawals due to adverse events (RD 0.05, 95% CI 0.02 to 0.09; 11 studies, 1449 participants), all with low-certainty evidence, though these effects were not clinically relevant. CBD-dominant medicines versus placebo. There is no clear evidence for an effect on pain relief of at least 50% (RD -0.08, 95% CI -0.20 to 0.05; 5 studies, 208 participants; very low-certainty evidence). They may increase or decrease PGIC ratings of 'much' or 'very much' improved (RD -0.03, 95% CI -0.22 to 0.16; 2 studies, 79 participants), withdrawals due to adverse events (RD 0.02, 95% CI -0.03 to 0.06; 5 studies, 213 participants), serious adverse events (RD 0.02, 95% CI -0.03 to 0.06; 5 studies, 213 participants), pain relief of at least 30% (RD -0.04, 95% CI -0.17 to 0.09; 5 studies, 218 participants), nervous system-related adverse events (RD -0.03, 95% CI -0.10 to 0.03; 5 studies, 208 participants), and psychiatric disorder-related adverse events (RD -0.01, 95% CI -0.06 to 0.04; 5 studies, 208 participants), all with low-certainty evidence. There is no clear evidence for an effect of THC-dominant medicines on pain relief of 50% or greater, PGIC ratings of 'much' or 'very much' improved, withdrawals due to adverse events, and serious adverse events (very low-certainty evidence). There is no clear evidence for an effect of THC/CBD-balanced medicines on pain relief of 50% or greater and serious adverse events (very low-certainty evidence). They may increase PGIC ratings of 'much' or 'very much' improved, and withdrawals due to adverse events (low-certainty evidence). There is no clear evidence for an effect of CBD-dominant medicines on pain relief of 50% or greater (very low-certainty evidence). They may increase or decrease PGIC ratings of 'much' or 'very much' improved, serious adverse events, and withdrawals due to adverse events (low-certainty evidence). No funding. DOI 2018 review: 10.1002/14651858.CD012182.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Estimates of the population prevalence of chronic pain with neuropathic components range from 6% to 10%. Current pharmacological treatments for neuropathic pain help only a minority. New treatments are needed. Cannabis is increasingly promoted in the media as a treatment for chronic pain. This is an update of a review first published in 2018."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of cannabis-based medicines (herbal, plant-based, synthetic) compared to placebo or conventional drugs for chronic neuropathic pain conditions in adults."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, and three trial registries, together with reference checking. The latest search date was 29 January 2025."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We selected randomised, double-blind controlled trials of medical cannabis, plant-derived and synthetic cannabinoids, against placebo or any other active treatment for chronic neuropathic pain conditions in adults, with a treatment duration of at least two weeks. We excluded studies whose double-blind duration was less than two weeks and studies which did not explicitly state that the pain was of a neuropathic nature."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were the number of participants reporting pain relief of at least 50%, a Patient Global Impression of Change (PGIC) rating of 'much' or 'very much' improved, serious adverse events, and withdrawals due to adverse events."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed the risk of bias (RoB) for seven outcomes reported in three summary of findings tables using the Cochrane RoB 1 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using meta-analysis with a random-effects model by calculating absolute risk differences (RD) and standardised mean differences (SMD) with 95% confidence intervals (CI) for dichotomous outcomes and continuous outcomes, respectively. We used GRADE to assess the certainty of evidence for prespecified outcomes."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included six new studies involving 450 participants, along with 15 studies involving 1737 participants from the 2018 review, for a total of 21 studies with 2187 participants. The studies ranged from two to 26 weeks in duration. Sample sizes ranged from 18 to 339 participants. Participants' mean age ranged from 34 to 61 years, and the proportion of women ranged from 0% to 90%. Five studies included participants with central neuropathic pain, 14 studies included participants with peripheral neuropathic pain, and two studies included both types. Seven studies administered tetrahydrocannabinol (THC)-dominant medicines; nine studies, balanced THC and cannabidiol (CBD) medicines; and five studies, CBD-dominant medicines. Twenty studies compared cannabis-based medicine to placebo, and one study's comparator was dihydrocodeine. We judged the overall risk of bias to be low in six studies, unclear in 10 studies, and high in five studies."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "THC-dominant medicines versus placebo. There is no clear evidence for an effect on pain relief of at least 50% (RD 0.14, 95% CI -0.07 to 0.37; 7 studies, 534 participants), PGIC rating of 'much' or 'very much' improved (RD 0.17, 95% CI -0.24 to 0.58; 2 studies, 72 participants), withdrawals due to adverse events (RD 0.03, 95% CI -0.02 to 0.08; 6 studies, 511 participants), serious adverse events (RD 0.02, 95% CI -0.01 to 0.06; 7 studies, 537 participants), pain relief of at least 30% (RD 0.16, 95% CI -0.08 to 0.40; 7 studies, 566 participants), and psychiatric disorder-related adverse events (RD 0.01, 95% CI -0.01 to 0.03; 4 studies, 368 participants), all with very low-certainty evidence. They may increase nervous system adverse events (RD 0.25, 95% CI 0.14 to 0.37; 5 studies, 439 participants; low-certainty evidence). THC/CBD-balanced medicines versus placebo. There is no clear evidence for an effect on pain relief of at least 50% (RD 0.04, 95% CI 0.00 to 0.08; 8 studies, 746 participants) and serious adverse events (RD 0.01, 95% CI -0.02 to 0.03; 11 studies, 1449 participants), both with very low-certainty evidence. The evidence is very uncertain about the effect on nervous system-related (RD 0.39, 95% CI 0.23 to 0.55; 11 studies, 1445 participants) and psychiatric disorder-related adverse events (RD 0.08, 95% CI 0.03 to 0.13; 9 studies, 1375 participants), both very low-certainty evidence. They may increase PGIC ratings of 'much' or 'very much' improved (RD 0.07, 95% CI 0.02 to 0.11; 7 studies, 1145 participants), pain relief of at least 30% (RD 0.07, 95% CI 0.02 to 0.12; 10 studies, 1285 participants), and withdrawals due to adverse events (RD 0.05, 95% CI 0.02 to 0.09; 11 studies, 1449 participants), all with low-certainty evidence, though these effects were not clinically relevant. CBD-dominant medicines versus placebo. There is no clear evidence for an effect on pain relief of at least 50% (RD -0.08, 95% CI -0.20 to 0.05; 5 studies, 208 participants; very low-certainty evidence). They may increase or decrease PGIC ratings of 'much' or 'very much' improved (RD -0.03, 95% CI -0.22 to 0.16; 2 studies, 79 participants), withdrawals due to adverse events (RD 0.02, 95% CI -0.03 to 0.06; 5 studies, 213 participants), serious adverse events (RD 0.02, 95% CI -0.03 to 0.06; 5 studies, 213 participants), pain relief of at least 30% (RD -0.04, 95% CI -0.17 to 0.09; 5 studies, 218 participants), nervous system-related adverse events (RD -0.03, 95% CI -0.10 to 0.03; 5 studies, 208 participants), and psychiatric disorder-related adverse events (RD -0.01, 95% CI -0.06 to 0.04; 5 studies, 208 participants), all with low-certainty evidence."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is no clear evidence for an effect of THC-dominant medicines on pain relief of 50% or greater, PGIC ratings of 'much' or 'very much' improved, withdrawals due to adverse events, and serious adverse events (very low-certainty evidence). There is no clear evidence for an effect of THC/CBD-balanced medicines on pain relief of 50% or greater and serious adverse events (very low-certainty evidence). They may increase PGIC ratings of 'much' or 'very much' improved, and withdrawals due to adverse events (low-certainty evidence). There is no clear evidence for an effect of CBD-dominant medicines on pain relief of 50% or greater (very low-certainty evidence). They may increase or decrease PGIC ratings of 'much' or 'very much' improved, serious adverse events, and withdrawals due to adverse events (low-certainty evidence)."
        },
        {
          "label": "FUNDING",
          "text": "No funding."
        },
        {
          "label": "REGISTRATION",
          "text": "DOI 2018 review: 10.1002/14651858.CD012182.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41548880/",
      "pubDate": "2026 Jan 19",
      "doi": "10.1002/14651858.CD012182.pub3",
      "dateReceived": "2026-02-02T23:36:47.097Z",
      "isNew": true,
      "summary": "There is no clear."
    },
    {
      "id": "26f9089b90b1",
      "title": "Safety and efficacy of adjunct dexamethasone in adults with herpes simplex virus encephalitis in the UK (DexEnceph): a multicentre, observer-blind, randomised, phase 3, controlled trial.",
      "journal": "Lancet Neurol",
      "score": "7/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49919791/118698",
      "abstract": "Herpes simplex virus (HSV) encephalitis is characterised by inflammation and swelling of the brain, resulting in death or severe neurocognitive sequelae. HSV encephalitis is treated with the antiviral aciclovir but still has substantial mortality and morbidity. Adjunct corticosteroids are sometimes used, but whether they improve the outcome is unclear. We aimed to establish the safety and efficacy of adjunct corticosteroids in HSV encephalitis. In this multicentre, observer-blind, randomised, phase 3 trial, adults with HSV encephalitis admitted to 53 hospitals in the UK were randomly assigned to receive intravenous dexamethasone (10 mg/kg, four times daily for 4 days) plus intravenous aciclovir (10 mg/kg three times daily for at least 14 days; dexamethasone group), or intravenous aciclovir alone (control group). Eligible patients aged 16 years or older had suspected encephalitis (a febrile illness with new onset seizure, new focal neurological signs or alteration in consciousness, cognition, personality, or behaviour), with positive HSV type 1 or type 2 PCR test in CSF. Participants were randomly assigned by the trial team at the recruiting site, using a secure web-based randomisation programme. The primary outcome was verbal memory score at 26 weeks, measured by the Wechsler Memory Scale (WMS)-IV auditory memory index. Analyses of primary and secondary outcomes were performed according to the modified intention-to-treat principle, and safety analyses were based on whether participants received at least one dose of the study drug. Trial neuropsychologists assessing the primary outcome, and statisticians involved in the study's primary outcome, were masked to treatment group allocation. The trial is registered with the International Standard Randomised Controlled Trial Number Registry, ISRCTN11774734, and EudraCT, EudraCT2016-004835-19, and is completed. Between Sept 22, 2016, and Feb 2, 2022, 94 patients with HSV encephalitis were recruited, 47 (20 [43%] female and 27 [57%] male) to the dexamethasone group, and 47 (24 [51%] female and 23 [49%] male) to the control group. Dexamethasone was initiated a median 7 (IQR 4-8) days after hospital admission. Seven patients withdrew consent, and six were lost to follow-up. Thus, 81 were included in the modified intention-to-treat analysis (39 in the treatment group and 42 in the control group). The primary outcome, verbal memory score at 26 weeks, did not differ significantly between the groups (71 [SD 26] in the dexamethasone group, and 69 [SD 25] in the control group; adjusted difference 1·77 [95% CI -9·57 to 13·12; p=0·76). There were 27 adverse events involving 18 (38%) participants in the control group, and 25 adverse events involving 18 (40%) participants in the dexamethasone group. The most common serious adverse events were seizures requiring readmission to hospital (affecting one [2%] patient in the dexamethasone group and one [2%] patient in the control group) and thrombotic events, including deep vein thrombosis (affecting one [2%] patient in the dexamethasone group) and pulmonary embolism (affecting one [2%]patient in the dexamethasone group). There were no treatment-related deaths. In adults with HSV encephalitis, dexamethasone plus aciclovir had a satisfactory safety profile but did not improve verbal memory score compared with aciclovir alone. Given the established role of corticosteroids in other inflammatory encephalitides, our findings suggest that their early use in suspected encephalitis is unlikely to be harmful. Future studies should assess more targeted immunomodulatory approaches in HSV encephalitis. National Institute for Health and Care Research.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Herpes simplex virus (HSV) encephalitis is characterised by inflammation and swelling of the brain, resulting in death or severe neurocognitive sequelae. HSV encephalitis is treated with the antiviral aciclovir but still has substantial mortality and morbidity. Adjunct corticosteroids are sometimes used, but whether they improve the outcome is unclear. We aimed to establish the safety and efficacy of adjunct corticosteroids in HSV encephalitis."
        },
        {
          "label": "METHODS",
          "text": "In this multicentre, observer-blind, randomised, phase 3 trial, adults with HSV encephalitis admitted to 53 hospitals in the UK were randomly assigned to receive intravenous dexamethasone (10 mg/kg, four times daily for 4 days) plus intravenous aciclovir (10 mg/kg three times daily for at least 14 days; dexamethasone group), or intravenous aciclovir alone (control group). Eligible patients aged 16 years or older had suspected encephalitis (a febrile illness with new onset seizure, new focal neurological signs or alteration in consciousness, cognition, personality, or behaviour), with positive HSV type 1 or type 2 PCR test in CSF. Participants were randomly assigned by the trial team at the recruiting site, using a secure web-based randomisation programme. The primary outcome was verbal memory score at 26 weeks, measured by the Wechsler Memory Scale (WMS)-IV auditory memory index. Analyses of primary and secondary outcomes were performed according to the modified intention-to-treat principle, and safety analyses were based on whether participants received at least one dose of the study drug. Trial neuropsychologists assessing the primary outcome, and statisticians involved in the study's primary outcome, were masked to treatment group allocation. The trial is registered with the International Standard Randomised Controlled Trial Number Registry, ISRCTN11774734, and EudraCT, EudraCT2016-004835-19, and is completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between Sept 22, 2016, and Feb 2, 2022, 94 patients with HSV encephalitis were recruited, 47 (20 [43%] female and 27 [57%] male) to the dexamethasone group, and 47 (24 [51%] female and 23 [49%] male) to the control group. Dexamethasone was initiated a median 7 (IQR 4-8) days after hospital admission. Seven patients withdrew consent, and six were lost to follow-up. Thus, 81 were included in the modified intention-to-treat analysis (39 in the treatment group and 42 in the control group). The primary outcome, verbal memory score at 26 weeks, did not differ significantly between the groups (71 [SD 26] in the dexamethasone group, and 69 [SD 25] in the control group; adjusted difference 1·77 [95% CI -9·57 to 13·12; p=0·76). There were 27 adverse events involving 18 (38%) participants in the control group, and 25 adverse events involving 18 (40%) participants in the dexamethasone group. The most common serious adverse events were seizures requiring readmission to hospital (affecting one [2%] patient in the dexamethasone group and one [2%] patient in the control group) and thrombotic events, including deep vein thrombosis (affecting one [2%] patient in the dexamethasone group) and pulmonary embolism (affecting one [2%]patient in the dexamethasone group). There were no treatment-related deaths."
        },
        {
          "label": "INTERPRETATION",
          "text": "In adults with HSV encephalitis, dexamethasone plus aciclovir had a satisfactory safety profile but did not improve verbal memory score compared with aciclovir alone. Given the established role of corticosteroids in other inflammatory encephalitides, our findings suggest that their early use in suspected encephalitis is unlikely to be harmful. Future studies should assess more targeted immunomodulatory approaches in HSV encephalitis."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health and Care Research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41579900/",
      "pubDate": "2026 Feb",
      "doi": "10.1016/S1474-4422(25)00454-5",
      "dateReceived": "2026-02-02T23:36:47.097Z",
      "isNew": true,
      "summary": "This study investigated."
    },
    {
      "id": "09e09376db92",
      "title": "Psychological Therapy Quantity and Depressive Symptom Reduction in Psychedelic-Assisted Therapy: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49919791/118693",
      "abstract": "Psychedelic-assisted therapy (PAT) is a novel intervention for depressive symptoms, typically delivered with additional psychological therapy sessions. Quantitative evidence on how this concomitant therapy contributes to treatment outcomes is limited, highlighting the need for a systematic synthesis. To evaluate whether the quantity of psychological therapy is associated with symptom reduction in PAT for depressive symptoms. PubMed, PsycINFO, and Scopus databases were searched from inception to June 16, 2025. The analysis included controlled clinical trials involving adults with depressive symptoms who received PAT using classic serotonergic psychedelics (eg, psilocybin or lysergic acid diethylamide). Within these trials, psychedelic dosing sessions were embedded in therapeutic sessions before (preparation) and after (integration). Studies were excluded if they used microdosing as the primary intervention, involved naturalistic or purely pharmacological administration, or did not report therapy session count or duration. Qualitative studies, reviews, case reports, and conference abstracts were also excluded. Of the 226 records identified, 42 full texts were assessed by 2 independent reviewers, of which 12 met inclusion criteria. Two reviewers independently extracted data and assessed risk of bias according to Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Multilevel random-effects meta-analysis and multilevel metaregressions were conducted using robust variance estimation. The primary outcomes were standardized mean differences (Hedges g) in depressive symptoms at all available posttreatment time points. Metaregression analyses assessed associations of different metrics of psychological therapy quantity (duration in hours, number of sessions, and total duration in weeks) with treatment outcomes. The 12 included trials had a total sample of 733 participants (365 female [49.8%]; mean [SD] age, 43.1 [6.2] years). PAT showed a large overall effect size in reducing depressive symptoms compared with control conditions (Hedges g = -0.84; 95% CI, -1.15 to -0.54; P < .001). More preparation therapy hours were significantly associated with greater symptom reduction (β = -0.13; 95% CI, -0.24 to -0.01; P = .04). No significant associations were found for hours of postdosing integration (β = -0.02; 95% CI, -0.08 to 0.05; P = .53) or total session count (β = -0.01; 95% CI, -0.09 to -0.08; P = .86). Longer follow-up periods, measured in weeks from substance administration, were generally associated with smaller treatment effect sizes (β = 0.02; 95% CI, 0.01 to 0.04; P = .003). Risk of bias was high in the majority (9 [75%]) of studies, mostly due to ineffective blinding. In this systematic review and meta-analysis of controlled clinical trials investigating PAT for depressive symptoms, a greater quantity of preparation therapy was associated with significantly larger reductions of depressive symptoms. These findings highlight a potential key role of preparation in optimizing PAT outcomes. The observed association primarily reflects quantitative aspects of therapy exposure rather than qualitative or process-related dimensions of the therapeutic interaction. Additional systematic research is needed to clarify this association and optimize all therapeutic components within psychedelic interventions.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Psychedelic-assisted therapy (PAT) is a novel intervention for depressive symptoms, typically delivered with additional psychological therapy sessions. Quantitative evidence on how this concomitant therapy contributes to treatment outcomes is limited, highlighting the need for a systematic synthesis."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether the quantity of psychological therapy is associated with symptom reduction in PAT for depressive symptoms."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, PsycINFO, and Scopus databases were searched from inception to June 16, 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "The analysis included controlled clinical trials involving adults with depressive symptoms who received PAT using classic serotonergic psychedelics (eg, psilocybin or lysergic acid diethylamide). Within these trials, psychedelic dosing sessions were embedded in therapeutic sessions before (preparation) and after (integration). Studies were excluded if they used microdosing as the primary intervention, involved naturalistic or purely pharmacological administration, or did not report therapy session count or duration. Qualitative studies, reviews, case reports, and conference abstracts were also excluded. Of the 226 records identified, 42 full texts were assessed by 2 independent reviewers, of which 12 met inclusion criteria."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers independently extracted data and assessed risk of bias according to Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Multilevel random-effects meta-analysis and multilevel metaregressions were conducted using robust variance estimation."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were standardized mean differences (Hedges g) in depressive symptoms at all available posttreatment time points. Metaregression analyses assessed associations of different metrics of psychological therapy quantity (duration in hours, number of sessions, and total duration in weeks) with treatment outcomes."
        },
        {
          "label": "RESULTS",
          "text": "The 12 included trials had a total sample of 733 participants (365 female [49.8%]; mean [SD] age, 43.1 [6.2] years). PAT showed a large overall effect size in reducing depressive symptoms compared with control conditions (Hedges g = -0.84; 95% CI, -1.15 to -0.54; P < .001). More preparation therapy hours were significantly associated with greater symptom reduction (β = -0.13; 95% CI, -0.24 to -0.01; P = .04). No significant associations were found for hours of postdosing integration (β = -0.02; 95% CI, -0.08 to 0.05; P = .53) or total session count (β = -0.01; 95% CI, -0.09 to -0.08; P = .86). Longer follow-up periods, measured in weeks from substance administration, were generally associated with smaller treatment effect sizes (β = 0.02; 95% CI, 0.01 to 0.04; P = .003). Risk of bias was high in the majority (9 [75%]) of studies, mostly due to ineffective blinding."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis of controlled clinical trials investigating PAT for depressive symptoms, a greater quantity of preparation therapy was associated with significantly larger reductions of depressive symptoms. These findings highlight a potential key role of preparation in optimizing PAT outcomes. The observed association primarily reflects quantitative aspects of therapy exposure rather than qualitative or process-related dimensions of the therapeutic interaction. Additional systematic research is needed to clarify this association and optimize all therapeutic components within psychedelic interventions."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41563753/",
      "pubDate": "2026 Jan 02",
      "doi": "10.1001/jamanetworkopen.2025.54843",
      "dateReceived": "2026-02-02T23:36:47.097Z",
      "isNew": true,
      "summary": "More preparation."
    },
    {
      "id": "e0a5153c3e5a",
      "title": "Exercise prescriptions for older adults with different degrees of cognitive impairment: A dose-response network meta-analysis.",
      "journal": "Clin Rehabil",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49823789/118662",
      "abstract": "ObjectiveThis study aims to determine the optimal exercise types and dosages for improving cognitive function in older adults with mild cognitive impairment or dementia.Data sourcesPubMed, Web of Science, Scopus, PsycINFO, and SPORTDiscus databases were searched from inception to August 26, 2025.Review methodsTwo reviewers independently screened studies, extracted data, and assessed the risk of bias using the revised Cochrane risk-of-bias tool. A dose-response network meta-analytic model was applied to explore how exercise dosage within different exercise modalities influences cognitive outcomes in older adults with varying degrees of cognitive impairment.ResultsOur search identified 10,721 records, from which 68 studies comprising 6544 participants were included in the final analysis. A nonlinear dose-response relationship between physical activity and cognitive function was observed. A minimum threshold of 336 Metabolic Equivalent of Task minutes per week was required to yield cognitive benefits, while 934 Metabolic Equivalent of Task minutes per week was the minimum dose for clinically meaningful improvements. However, substantial variability was observed, particularly between individuals with mild cognitive impairment and those with dementia. The dose-response relationship varied by exercise modalities, with some modalities showing significant effects at lower doses. Aerobic exercise combined with resistance training exhibited superior efficacy compared to other modalities.ConclusionFor older adults with mild cognitive impairment or dementia, combining aerobic exercise with resistance training is most effective for boosting cognitive function, even with modest activity levels. It is important to choose specific exercise modalities and adjust their amounts to maximize cognitive gains in rehabilitation programs.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41556956/",
      "pubDate": "2026 Feb",
      "doi": "10.1177/02692155251385219",
      "dateReceived": "2026-02-01T23:33:33.615Z",
      "isNew": false
    },
    {
      "id": "709fd08dd97a",
      "title": "Parent-Led Early Intervention in Very Preterm Infants and Executive Function at School Age: Secondary Analysis of a Randomized Clinical Trial.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49823789/118661",
      "abstract": "Children born very preterm or with very low birth weight are at higher risk for executive function deficits, affecting attention, self-regulation, and problem-solving. Early developmental interventions have shown potential benefits, but their long-term effect on executive functioning remains uncertain. To evaluate whether an enhanced developmental intervention (EDI) initiated in the neonatal intensive care unit (NICU) and continued at home through the first 2 years improves executive function at school age in very preterm children. This secondary analysis assessed school-aged outcomes from a randomized clinical trial of infants born with fewer than 32 weeks of gestation or with birth weight less than 1500 g from January 2016 to February 2019. Follow-up assessments were conducted from July 7, 2023, to August 16, 2024, at a single center in Porto Alegre, Brazil. Data analyses were completed from August to December 2024. EDI compared with usual care. The primary outcomes were the scaled scores of Developmental Neuropsychological Assessment, Second Edition, subtests, which measures auditory attention, inhibition, design fluency, and motor persistence. The examiner was masked to group allocation. Medical records identified children with neurodevelopmental conditions that precluded formal assessment. The effect size for the Mann-Whitney U test comparisons was calculated using the rank-biserial correlation. Binary logistic regression was used to compare performance in the primary outcomes. Sensitivity analyses were used for those lost to follow-up. Of the original randomized clinical trial, 80 children (96% of those eligible) were assessed at a mean (SD) age of 7 (1) years; 34 children (43%) were female. Baseline characteristics were similar between groups. In the primary analysis of median scaled scores, children who received EDI demonstrated significantly better performance across all 4 executive function domains compared to usual care (median scores, 12-14 vs 2-9; r = 0.44-0.77; all P < .001). All results remained significant after Bonferroni correction (P < .0125), indicating medium to large effect sizes. In the secondary analysis of performance classification, EDI was associated with higher odds of expected performance in design fluency (odds ratio, 11.3; 95% CI, 4.08-31.7; P < .001). No statistically significant differences were observed for the remaining 3 domains. In this secondary analysis of a randomized clinical trial, early EDI, beginning in the NICU and extending through the first 2 years, contributed to sustained improvements in executive function in very preterm children. These findings support the long-term neurodevelopmental benefits of early intervention, with potential implications for academic and socioemotional outcomes in children from low- and middle-income settings. ClinicalTrials.gov Identifier: NCT02835612.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Children born very preterm or with very low birth weight are at higher risk for executive function deficits, affecting attention, self-regulation, and problem-solving. Early developmental interventions have shown potential benefits, but their long-term effect on executive functioning remains uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether an enhanced developmental intervention (EDI) initiated in the neonatal intensive care unit (NICU) and continued at home through the first 2 years improves executive function at school age in very preterm children."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This secondary analysis assessed school-aged outcomes from a randomized clinical trial of infants born with fewer than 32 weeks of gestation or with birth weight less than 1500 g from January 2016 to February 2019. Follow-up assessments were conducted from July 7, 2023, to August 16, 2024, at a single center in Porto Alegre, Brazil. Data analyses were completed from August to December 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "EDI compared with usual care."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were the scaled scores of Developmental Neuropsychological Assessment, Second Edition, subtests, which measures auditory attention, inhibition, design fluency, and motor persistence. The examiner was masked to group allocation. Medical records identified children with neurodevelopmental conditions that precluded formal assessment. The effect size for the Mann-Whitney U test comparisons was calculated using the rank-biserial correlation. Binary logistic regression was used to compare performance in the primary outcomes. Sensitivity analyses were used for those lost to follow-up."
        },
        {
          "label": "RESULTS",
          "text": "Of the original randomized clinical trial, 80 children (96% of those eligible) were assessed at a mean (SD) age of 7 (1) years; 34 children (43%) were female. Baseline characteristics were similar between groups. In the primary analysis of median scaled scores, children who received EDI demonstrated significantly better performance across all 4 executive function domains compared to usual care (median scores, 12-14 vs 2-9; r = 0.44-0.77; all P < .001). All results remained significant after Bonferroni correction (P < .0125), indicating medium to large effect sizes. In the secondary analysis of performance classification, EDI was associated with higher odds of expected performance in design fluency (odds ratio, 11.3; 95% CI, 4.08-31.7; P < .001). No statistically significant differences were observed for the remaining 3 domains."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this secondary analysis of a randomized clinical trial, early EDI, beginning in the NICU and extending through the first 2 years, contributed to sustained improvements in executive function in very preterm children. These findings support the long-term neurodevelopmental benefits of early intervention, with potential implications for academic and socioemotional outcomes in children from low- and middle-income settings."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT02835612."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41557341/",
      "pubDate": "2026 Jan 20",
      "doi": "10.1001/jamapediatrics.2025.5866",
      "dateReceived": "2026-02-01T23:33:33.615Z",
      "isNew": false
    },
    {
      "id": "16b84dbe4d1c",
      "title": "Interactive Virtual Assistant for Health Promotion Among Older Adults With Type 2 Diabetes: The IVAM-ED Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49906752/118699",
      "abstract": "Older patients with diabetes often experience high levels of mental distress, which may complicate diabetes management and negatively impact health outcomes. To evaluate whether an interactive virtual assistant device built with a behavioral intervention model can improve mental health and diabetes-related outcomes in older adults with diabetes. This open randomized clinical trial was conducted at an academic medical center in Brazil between June 22, 2023, and February 8, 2024. Participants aged 65 years or older with type 2 diabetes were included. Participants were randomized 1:1 to receive the interactive virtual assistant device (Smart Speaker Echo Dot, 3rd generation [Amazon]) for home use over a 12-week period or to continue with usual care. The device was programmed with a behavioral intervention model aimed at enhancing mental health and diabetes management. The primary outcome was the between-group mean difference (MD) in mental distress, assessed using the Self-Reporting Questionnaire, in which scores range from 0 to 20, with higher scores indicating greater mental distress. Secondary outcomes included quality of life (assessed using the 36-Item Short Form Health Survey), perceived stress (assessed using the Perceived Stress Scale), adherence to diabetes self-care behaviors (assessed using the Self-Care Inventory Revised questionnaire), and glycemic control (hemoglobin A1c). All outcomes were assessed at the 12-week follow-up. Among 112 participants (mean [SD] age, 72.5 [5.7] years; 71 females [63.4%]), the mean (SD) hemoglobin A1c level was 7.9% (1.5%), and outcome measures were available for 103 participants (52 in the intervention group and 51 in the usual care group). At 12 weeks, the fully adjusted mean (SE) Self-Reporting Questionnaire score was 6.29 (0.44) for participants in the intervention group and 7.75 (0.42) for those in the usual care group, resulting in a fully adjusted MD of -1.46 (95% CI, -2.73 to -0.19; P = .02), suggesting a reduction in mental distress among the intervention group. Subgroup analyses showed consistent improvement favoring the intervention across all subgroups. The intervention was also associated with improvements in quality of life (MD, 9.46 [95% CI, 3.65 to 15.26]; P = .001), adherence to diabetes self-care behaviors (MD, 3.40 [95% CI, 1.61 to 5.19]; P < .001), and glycemic control (MD, -0.48% [95% CI, -0.85 to -0.11]; P = .01). No difference was observed regarding perceived stress (MD, -3.00 [95% CI, -6.20 to 0.20]; P = .07), and no participants withdrew due to adverse events. In this randomized clinical trial of older adults with diabetes, participants in the smart speaker group showed significant improvements in mental distress, quality of life, diabetes self-care, and glycemic control. These findings suggest that this easily implemented self-management intervention could enhance health outcomes in this population. ClinicalTrials.gov Identifier: NCT05329376.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Older patients with diabetes often experience high levels of mental distress, which may complicate diabetes management and negatively impact health outcomes."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether an interactive virtual assistant device built with a behavioral intervention model can improve mental health and diabetes-related outcomes in older adults with diabetes."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This open randomized clinical trial was conducted at an academic medical center in Brazil between June 22, 2023, and February 8, 2024. Participants aged 65 years or older with type 2 diabetes were included."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1 to receive the interactive virtual assistant device (Smart Speaker Echo Dot, 3rd generation [Amazon]) for home use over a 12-week period or to continue with usual care. The device was programmed with a behavioral intervention model aimed at enhancing mental health and diabetes management."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the between-group mean difference (MD) in mental distress, assessed using the Self-Reporting Questionnaire, in which scores range from 0 to 20, with higher scores indicating greater mental distress. Secondary outcomes included quality of life (assessed using the 36-Item Short Form Health Survey), perceived stress (assessed using the Perceived Stress Scale), adherence to diabetes self-care behaviors (assessed using the Self-Care Inventory Revised questionnaire), and glycemic control (hemoglobin A1c). All outcomes were assessed at the 12-week follow-up."
        },
        {
          "label": "RESULTS",
          "text": "Among 112 participants (mean [SD] age, 72.5 [5.7] years; 71 females [63.4%]), the mean (SD) hemoglobin A1c level was 7.9% (1.5%), and outcome measures were available for 103 participants (52 in the intervention group and 51 in the usual care group). At 12 weeks, the fully adjusted mean (SE) Self-Reporting Questionnaire score was 6.29 (0.44) for participants in the intervention group and 7.75 (0.42) for those in the usual care group, resulting in a fully adjusted MD of -1.46 (95% CI, -2.73 to -0.19; P = .02), suggesting a reduction in mental distress among the intervention group. Subgroup analyses showed consistent improvement favoring the intervention across all subgroups. The intervention was also associated with improvements in quality of life (MD, 9.46 [95% CI, 3.65 to 15.26]; P = .001), adherence to diabetes self-care behaviors (MD, 3.40 [95% CI, 1.61 to 5.19]; P < .001), and glycemic control (MD, -0.48% [95% CI, -0.85 to -0.11]; P = .01). No difference was observed regarding perceived stress (MD, -3.00 [95% CI, -6.20 to 0.20]; P = .07), and no participants withdrew due to adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial of older adults with diabetes, participants in the smart speaker group showed significant improvements in mental distress, quality of life, diabetes self-care, and glycemic control. These findings suggest that this easily implemented self-management intervention could enhance health outcomes in this population."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05329376."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41575748/",
      "pubDate": "2026 Jan 02",
      "doi": "10.1001/jamanetworkopen.2025.53508",
      "dateReceived": "2026-01-31T23:30:52.936Z",
      "isNew": false
    },
    {
      "id": "8aef42dd74dd",
      "title": "Utility of Serum Biomarkers in Addition to Ultrasound for Early Detection of Hepatocellular Carcinoma in High-Risk Patients: A Randomized Controlled Trial.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49906752/118657",
      "abstract": "Hepatocellular carcinoma (HCC) surveillance is key to early diagnosis and timely curative treatment. Current strategies are suboptimal with many patients presenting with advanced HCC. This randomized controlled trial compared the combined use of serum biomarker (BM) measurements and abdominal ultrasound (US) with US alone for the diagnosis of early-stage HCC. Adults with cirrhosis or high-risk hepatitis B virus (HBV) infection were randomized (1:1) to biannual surveillance with US alone (group A) or US and BMs (group B) in blocks of 2 or 4. Positive US results or elevated BMs (α-fetoprotein [AFP] >100 ng/mL, lectin-reactive fraction of AFP [AFP-L3] >10%, des-gamma-carboxy prothrombin [DCP] >2 ng/mL) triggered further imaging for HCC confirmation. Primary end point was proportion of early-stage HCCs. There were 1208 patients randomized (n = 603 group A, n = 605 group B). Mean ± SD age was 58.4 ± 9.8 years, 71.8% were male, 55.1% were Asian, 64.0% had HBV, and 64.3% had cirrhosis. During follow-up, 35 HCCs (5.8%) developed in group A (n = 30 early-stage, n = 5 late-stage) and 27 (4.5%) developed in group B (n = 22 early-stage, n = 5 late-stage). Early-stage HCC incidence was 1.2 per 100 person-years with cumulative probabilities of 1.3% at 52 weeks and 5.9% at 260 weeks. Early-stage HCC detection rate did not differ by study arm (hazard ratio, 0.81; 95% CI, 0.47-1.40; P = .45). In group B, elevated AFP-L3 was equally effective compared with using all 3 BMs. Addition of AFP, AFP-L3, and DCP to biannual US did not improve early-stage HCC detection. The trial was not adequately powered to provide evidence that the use of BMs aside from US plus AFP improves HCC surveillance. Establishing and validating alternative approaches to incorporation of BMs may improve surveillance methods for early-stage HCC detection. gov, Number: NCT02272504.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Hepatocellular carcinoma (HCC) surveillance is key to early diagnosis and timely curative treatment. Current strategies are suboptimal with many patients presenting with advanced HCC. This randomized controlled trial compared the combined use of serum biomarker (BM) measurements and abdominal ultrasound (US) with US alone for the diagnosis of early-stage HCC."
        },
        {
          "label": "METHODS",
          "text": "Adults with cirrhosis or high-risk hepatitis B virus (HBV) infection were randomized (1:1) to biannual surveillance with US alone (group A) or US and BMs (group B) in blocks of 2 or 4. Positive US results or elevated BMs (α-fetoprotein [AFP] >100 ng/mL, lectin-reactive fraction of AFP [AFP-L3] >10%, des-gamma-carboxy prothrombin [DCP] >2 ng/mL) triggered further imaging for HCC confirmation. Primary end point was proportion of early-stage HCCs."
        },
        {
          "label": "RESULTS",
          "text": "There were 1208 patients randomized (n = 603 group A, n = 605 group B). Mean ± SD age was 58.4 ± 9.8 years, 71.8% were male, 55.1% were Asian, 64.0% had HBV, and 64.3% had cirrhosis. During follow-up, 35 HCCs (5.8%) developed in group A (n = 30 early-stage, n = 5 late-stage) and 27 (4.5%) developed in group B (n = 22 early-stage, n = 5 late-stage). Early-stage HCC incidence was 1.2 per 100 person-years with cumulative probabilities of 1.3% at 52 weeks and 5.9% at 260 weeks. Early-stage HCC detection rate did not differ by study arm (hazard ratio, 0.81; 95% CI, 0.47-1.40; P = .45). In group B, elevated AFP-L3 was equally effective compared with using all 3 BMs."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Addition of AFP, AFP-L3, and DCP to biannual US did not improve early-stage HCC detection. The trial was not adequately powered to provide evidence that the use of BMs aside from US plus AFP improves HCC surveillance. Establishing and validating alternative approaches to incorporation of BMs may improve surveillance methods for early-stage HCC detection."
        },
        {
          "label": "CLINICALTRIALS",
          "text": "gov, Number: NCT02272504."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41556856/",
      "pubDate": "2026 Jan 20",
      "doi": "10.1053/j.gastro.2025.09.010",
      "dateReceived": "2026-01-31T23:30:52.936Z",
      "isNew": false
    },
    {
      "id": "fab000747fe6",
      "title": "Fremanezumab in Children and Adolescents with Episodic Migraine.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Neurology",
        "Pediatrics (General)",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49814323/118625",
      "abstract": "Fremanezumab, a humanized monoclonal antibody that selectively targets calcitonin gene-related peptide, is approved for the prevention of migraine in adults. Evidence from randomized, controlled trials in children and adolescents is needed. We randomly assigned participants 6 to 17 years of age with a diagnosis of episodic migraine (defined as migraine for ≥6 months and a history of ≤14 headache days per month) to receive monthly subcutaneous injections of fremanezumab (120 mg for participants with a body weight of <45 kg and 225 mg for those with a body weight of ≥45 kg) or matched placebo for 3 months. Participants were allowed to use migraine-specific medications to treat acute headaches. The primary end point was the change from baseline in the average number of migraine days per month. Key secondary end points included the change in the number of days per month with headache of at least moderate severity and a reduction of 50% or more in the number of migraine days per month. Of 237 participants who underwent randomization, 234 were included in the full analysis population: 123 in the fremanezumab group (36 received the 120-mg dose and 87 received the 225-mg dose) and 111 in the placebo group. Fremanezumab reduced the number of migraine days per month by 2.5 as compared with 1.4 with placebo (difference, 1.1; P = 0.02) and the number of days per month with headache of at least moderate severity by 2.6 as compared with 1.5 with placebo (difference, 1.1; P = 0.02). The percentage of participants who had a reduction of 50% or more in the number of migraine days per month was 47.2% with fremanezumab and 27.0% with placebo (P = 0.002). Injection-site erythema was the most common adverse event with fremanezumab (9.8% of participants, vs. 5.4% with placebo). Among children and adolescents with episodic migraine, fremanezumab resulted in greater reductions in the number of migraine days and headache days than placebo. Injection-site erythema was the most common adverse event with fremanezumab. Longer follow-up is required to further understand the efficacy and safety of the drug in this population. (Funded by Teva Pharmaceuticals; ClinicalTrials.gov number, NCT04458857.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Fremanezumab, a humanized monoclonal antibody that selectively targets calcitonin gene-related peptide, is approved for the prevention of migraine in adults. Evidence from randomized, controlled trials in children and adolescents is needed."
        },
        {
          "label": "METHODS",
          "text": "We randomly assigned participants 6 to 17 years of age with a diagnosis of episodic migraine (defined as migraine for ≥6 months and a history of ≤14 headache days per month) to receive monthly subcutaneous injections of fremanezumab (120 mg for participants with a body weight of <45 kg and 225 mg for those with a body weight of ≥45 kg) or matched placebo for 3 months. Participants were allowed to use migraine-specific medications to treat acute headaches. The primary end point was the change from baseline in the average number of migraine days per month. Key secondary end points included the change in the number of days per month with headache of at least moderate severity and a reduction of 50% or more in the number of migraine days per month."
        },
        {
          "label": "RESULTS",
          "text": "Of 237 participants who underwent randomization, 234 were included in the full analysis population: 123 in the fremanezumab group (36 received the 120-mg dose and 87 received the 225-mg dose) and 111 in the placebo group. Fremanezumab reduced the number of migraine days per month by 2.5 as compared with 1.4 with placebo (difference, 1.1; P = 0.02) and the number of days per month with headache of at least moderate severity by 2.6 as compared with 1.5 with placebo (difference, 1.1; P = 0.02). The percentage of participants who had a reduction of 50% or more in the number of migraine days per month was 47.2% with fremanezumab and 27.0% with placebo (P = 0.002). Injection-site erythema was the most common adverse event with fremanezumab (9.8% of participants, vs. 5.4% with placebo)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among children and adolescents with episodic migraine, fremanezumab resulted in greater reductions in the number of migraine days and headache days than placebo. Injection-site erythema was the most common adverse event with fremanezumab. Longer follow-up is required to further understand the efficacy and safety of the drug in this population. (Funded by Teva Pharmaceuticals; ClinicalTrials.gov number, NCT04458857.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41534042/",
      "pubDate": "2026 Jan 15",
      "doi": "10.1056/NEJMoa2504546",
      "dateReceived": "2026-01-31T23:30:52.936Z",
      "isNew": false
    },
    {
      "id": "181d18c437e2",
      "title": "Metformin, Maternal Glycemic Control, and Neonatal Hypoglycemia After Antenatal Steroids: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49814323/118612",
      "abstract": "Although betamethasone reduces complications of prematurity, it can cause maternal hyperglycemia and neonatal hypoglycemia. Metformin effectively treats maternal hyperglycemia and has been shown to decrease neonatal hypoglycemia in women with gestational diabetes. To evaluate the impact of metformin treatment after betamethasone administration on maternal glycemic control and the incidence of neonatal hypoglycemia in preterm infants. This multicenter, open-label randomized clinical trial was conducted from July 1, 2020, to June 30, 2024, at 3 medical centers in Israel. Pregnant women receiving betamethasone from 24.0 to 36.5 gestational weeks due to increased preterm delivery risk were studied. Women with diabetes were excluded. Participants were randomized to metformin (425 mg 3 times daily before meals and 850-1700 mg at 10 pm) or no treatment. The treatment lasted up to 48 hours after the first betamethasone dose. Capillary glucose was measured before meals (preprandial), 90 minutes after starting meals (postprandial), and at 10 pm. The primary end points were the mean maternal glucose values up to 48 hours from first betamethasone injection and the rate of neonatal hypoglycemia in preterm deliveries (<37 gestational weeks). A total of 169 women (mean [SD] age, 29.7 [5.4] years), including 84 with 48 preterm infants in the metformin group and 85 with 58 preterm neonates in the control group, were included in the study. Mean (SD) maternal total and postprandial glucose values were significantly lower in the metformin group (121 [15] vs 127 [17] mg/dL; P = .01; and 129 [22] vs 138 [26] mg/dL; P = .009, respectively). Neonatal hypoglycemia rate was lower in the metformin group (10 [21%] vs 23 [40%]; P = .04; relative risk, 0.53; 95% CI, 0.28-0.99). Mild adverse effects, mostly gastrointestinal, were reported by 12 women (14%). In this randomized clinical trial, metformin was safe and effective in preventing betamethasone-induced maternal hyperglycemia and neonatal hypoglycemia. Metformin should be considered as a treatment option for women who receive antenatal corticosteroids to prevent their related adverse effects. ClinicalTrials.gov Identifier: NCT04332393.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Although betamethasone reduces complications of prematurity, it can cause maternal hyperglycemia and neonatal hypoglycemia. Metformin effectively treats maternal hyperglycemia and has been shown to decrease neonatal hypoglycemia in women with gestational diabetes."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the impact of metformin treatment after betamethasone administration on maternal glycemic control and the incidence of neonatal hypoglycemia in preterm infants."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This multicenter, open-label randomized clinical trial was conducted from July 1, 2020, to June 30, 2024, at 3 medical centers in Israel. Pregnant women receiving betamethasone from 24.0 to 36.5 gestational weeks due to increased preterm delivery risk were studied. Women with diabetes were excluded."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized to metformin (425 mg 3 times daily before meals and 850-1700 mg at 10 pm) or no treatment. The treatment lasted up to 48 hours after the first betamethasone dose. Capillary glucose was measured before meals (preprandial), 90 minutes after starting meals (postprandial), and at 10 pm."
        },
        {
          "label": "MAIN OUTCOME AND MEASURE",
          "text": "The primary end points were the mean maternal glucose values up to 48 hours from first betamethasone injection and the rate of neonatal hypoglycemia in preterm deliveries (<37 gestational weeks)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 169 women (mean [SD] age, 29.7 [5.4] years), including 84 with 48 preterm infants in the metformin group and 85 with 58 preterm neonates in the control group, were included in the study. Mean (SD) maternal total and postprandial glucose values were significantly lower in the metformin group (121 [15] vs 127 [17] mg/dL; P = .01; and 129 [22] vs 138 [26] mg/dL; P = .009, respectively). Neonatal hypoglycemia rate was lower in the metformin group (10 [21%] vs 23 [40%]; P = .04; relative risk, 0.53; 95% CI, 0.28-0.99). Mild adverse effects, mostly gastrointestinal, were reported by 12 women (14%)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, metformin was safe and effective in preventing betamethasone-induced maternal hyperglycemia and neonatal hypoglycemia. Metformin should be considered as a treatment option for women who receive antenatal corticosteroids to prevent their related adverse effects."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04332393."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41511771/",
      "pubDate": "2026 Jan 02",
      "doi": "10.1001/jamanetworkopen.2025.52807",
      "dateReceived": "2026-01-31T23:30:52.936Z",
      "isNew": false
    },
    {
      "id": "8dbbc39e6356",
      "title": "Intracoronary Low-Dose Recombinant Tissue Plasminogen Activator in Primary PCI for ST-Segment Elevation Myocardial Infarction and Large Thrombus Burden: A Randomized Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49906752/118718",
      "dateReceived": "2026-01-31T23:30:52.935Z",
      "isNew": false
    },
    {
      "id": "9074595fe263",
      "title": "Systematic review and network meta-analysis of randomized trial evidence of spinal cord stimulation for chronic pain.",
      "journal": "Reg Anesth Pain Med",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49799750/118591",
      "abstract": "Existing systematic reviews and meta-analyses of randomized trials of spinal cord stimulation (SCS) for people with chronic pain have consistently excluded direct comparisons between different types of SCS and are therefore at major risk of publication bias. The aim of this systematic review and network meta-analysis (NMA) was to combine both direct and indirect randomized trial evidence on treatment effects of SCS for pain intensity, physical function, and health-related quality of life (HRQoL). MEDLINE, Cochrane Central Register of Controlled Trials (CENTRAL), Embase, and WikiStim were searched from inception to December 19, 2024 for parallel-arm randomized trials comparing SCS to conventional medical management (CMM), an active intervention (including other types of SCS) or placebo for adults with chronic pain. The measure of treatment effect for the primary outcome (pain intensity) and for secondary outcomes (physical function, HRQoL) was mean difference (MD) and 95% CI, and for responder rate was OR and 95% CI. NMA was performed in a frequentist framework. 23 reports of 16 unique randomized trials were included. All but one trial was assessed as having a high risk of bias. Results of NMA show significant reductions in pain intensity scores (0-10) at last follow-up (within the first 24 months) were observed with all types of SCS compared with CMM, with MD range from -2.37 (95% CI -3.54 to -1.20) to -5.55 (95% CI -7.34 to -3.76; 15 trials, 1479 participants; low certainty evidence). Improvements in physical function (MD range from -0.20, 95% CI -10.24 to 9.85) to -31.04 (95% CI -44.36 to -17.33; 8 trials, 837 participants; low certainty evidence) and HRQoL (MD range from 0.15 (95% CI 0.09 to 0.20) to 0.29 (95% CI 0.20 to 0.37; 8 trials, 942 participants; moderate certainty evidence) were observed for SCS compared with CMM at 6 months. Patients were found to have a higher likelihood to be a responder to treatment (ie, ≥50% reduction in pain intensity) with all forms of SCS in comparison to CMM at last follow-up (OR range from 9.75 (95% CI 4.07 to 23.25) to OR 63.4 (18.76 to 212.55; 13 trials, 1887 participants; very low certainty evidence). Clinically meaningful improvements were observed for pain intensity, HRQoL, and in some comparisons for physical function. There is low to moderate certainty of evidence that all types of SCS are superior to CMM for the management of chronic pain conditions.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND/IMPORTANCE",
          "text": "Existing systematic reviews and meta-analyses of randomized trials of spinal cord stimulation (SCS) for people with chronic pain have consistently excluded direct comparisons between different types of SCS and are therefore at major risk of publication bias."
        },
        {
          "label": "OBJECTIVE",
          "text": "The aim of this systematic review and network meta-analysis (NMA) was to combine both direct and indirect randomized trial evidence on treatment effects of SCS for pain intensity, physical function, and health-related quality of life (HRQoL)."
        },
        {
          "label": "EVIDENCE REVIEW",
          "text": "MEDLINE, Cochrane Central Register of Controlled Trials (CENTRAL), Embase, and WikiStim were searched from inception to December 19, 2024 for parallel-arm randomized trials comparing SCS to conventional medical management (CMM), an active intervention (including other types of SCS) or placebo for adults with chronic pain. The measure of treatment effect for the primary outcome (pain intensity) and for secondary outcomes (physical function, HRQoL) was mean difference (MD) and 95% CI, and for responder rate was OR and 95% CI. NMA was performed in a frequentist framework."
        },
        {
          "label": "FINDINGS",
          "text": "23 reports of 16 unique randomized trials were included. All but one trial was assessed as having a high risk of bias. Results of NMA show significant reductions in pain intensity scores (0-10) at last follow-up (within the first 24 months) were observed with all types of SCS compared with CMM, with MD range from -2.37 (95% CI -3.54 to -1.20) to -5.55 (95% CI -7.34 to -3.76; 15 trials, 1479 participants; low certainty evidence). Improvements in physical function (MD range from -0.20, 95% CI -10.24 to 9.85) to -31.04 (95% CI -44.36 to -17.33; 8 trials, 837 participants; low certainty evidence) and HRQoL (MD range from 0.15 (95% CI 0.09 to 0.20) to 0.29 (95% CI 0.20 to 0.37; 8 trials, 942 participants; moderate certainty evidence) were observed for SCS compared with CMM at 6 months. Patients were found to have a higher likelihood to be a responder to treatment (ie, ≥50% reduction in pain intensity) with all forms of SCS in comparison to CMM at last follow-up (OR range from 9.75 (95% CI 4.07 to 23.25) to OR 63.4 (18.76 to 212.55; 13 trials, 1887 participants; very low certainty evidence). Clinically meaningful improvements were observed for pain intensity, HRQoL, and in some comparisons for physical function."
        },
        {
          "label": "CONCLUSIONS",
          "text": "There is low to moderate certainty of evidence that all types of SCS are superior to CMM for the management of chronic pain conditions."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41494785/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1136/rapm-2025-107068",
      "dateReceived": "2026-01-30T23:34:01.478Z",
      "isNew": false
    },
    {
      "id": "f6d2c4508f0b",
      "title": "Efficacy and Safety of Acupuncture Combined with Conventional Drug Therapy for the Treatment of Cancer-Induced Bone Pain: A Network Meta-Analysis of Randomized Controlled Trials.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49799750/118504",
      "dateReceived": "2026-01-30T23:34:01.478Z",
      "isNew": false
    },
    {
      "id": "0c7fa953ef6b",
      "title": "Long forms of cardiac troponin T for myocardial infarction diagnosis: the SuperTROPO study.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49891790/118723",
      "abstract": "Elevated cardiac troponin levels are a frequent finding in emergency department patients, often without a clear cause. Current high-sensitivity cardiac troponin T (cTnT) assays measure intact and fragmented cardiac troponin T (total cTnT) molecules, without distinguishing between them. This study investigated whether measuring only intact and minimally fragmented cTnT (long cTnT) provides additional value for myocardial infarction (MI) identification. Consecutive emergency department patients with standard high-sensitivity cTnT levels (Roche Diagnostics) above the upper reference limit (≥14 ng/L) were recruited. Long cTnT levels were measured using a novel immunoassay. The additional diagnostic value of long cTnT in identifying patients with type 1 MI or any MI was assessed. A total of 1811 patients participated in the study, 1145 (63.2%) presenting with chest pain or dyspnoea. Overall, 205 (11.3%) had MI, including 148 classified as type 1 MI. Only .7% of patients in the lowest long cTnT tertile (<3.7 ng/L) had type 1 MI. The discriminative ability of long cTnT was superior to total cTnT in identifying patients with MI (area under curve [95% confidence intervals]) for any MI: .833 (.804-.863) vs .782 (.744-.819), and for type 1 MI: .839 (.807-.872) vs .777 (.735-.819), both (P < .001). Integrating the predictive data from long cTnT with total cTnT provided additional value in both reclassification and decision curve analyses, compared to total cTnT data alone. The long cTnT assay demonstrated good diagnostic performance in identifying MI in patients with elevated total cTnT levels, with the potential to improve the accuracy of MI diagnosis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Elevated cardiac troponin levels are a frequent finding in emergency department patients, often without a clear cause. Current high-sensitivity cardiac troponin T (cTnT) assays measure intact and fragmented cardiac troponin T (total cTnT) molecules, without distinguishing between them. This study investigated whether measuring only intact and minimally fragmented cTnT (long cTnT) provides additional value for myocardial infarction (MI) identification."
        },
        {
          "label": "METHODS",
          "text": "Consecutive emergency department patients with standard high-sensitivity cTnT levels (Roche Diagnostics) above the upper reference limit (≥14 ng/L) were recruited. Long cTnT levels were measured using a novel immunoassay. The additional diagnostic value of long cTnT in identifying patients with type 1 MI or any MI was assessed."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1811 patients participated in the study, 1145 (63.2%) presenting with chest pain or dyspnoea. Overall, 205 (11.3%) had MI, including 148 classified as type 1 MI. Only .7% of patients in the lowest long cTnT tertile (<3.7 ng/L) had type 1 MI. The discriminative ability of long cTnT was superior to total cTnT in identifying patients with MI (area under curve [95% confidence intervals]) for any MI: .833 (.804-.863) vs .782 (.744-.819), and for type 1 MI: .839 (.807-.872) vs .777 (.735-.819), both (P < .001). Integrating the predictive data from long cTnT with total cTnT provided additional value in both reclassification and decision curve analyses, compared to total cTnT data alone."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The long cTnT assay demonstrated good diagnostic performance in identifying MI in patients with elevated total cTnT levels, with the potential to improve the accuracy of MI diagnosis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41579023/",
      "pubDate": "2026 Jan 24",
      "doi": "10.1093/eurheartj/ehaf975",
      "dateReceived": "2026-01-30T23:34:01.477Z",
      "isNew": false
    },
    {
      "id": "38e1eda2336c",
      "title": "GLP-1 Receptor Agonists and Risk of Optic Nerve or Vision-Threatening Events in Patients With Type 2 Diabetes or Cardiometabolic Diseases: A Meta-analysis of Randomized Controlled Trials.",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician",
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49891790/118703",
      "abstract": "Data concerning glucagon-like peptide 1 receptor agonists (GLP-1 RAs) on risk of ischemic optic neuropathy (ION) are conflicting. We synthesize current evidence of GLP-1 RAs on risk of optic nerve or vision-threatening events from randomized controlled trials (RCTs) in patients with type 2 diabetes or cardiometabolic diseases. A total of 83,288 participants with type 2 diabetes/cardiometabolic diseases from 20 published RCTs were analyzed following Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA). RCTs investigating GLP-1 RAs for type 2 diabetes/cardiometabolic disease populations and reported optic nerve or vision-related adverse events were assessed. Primary outcome was a composite of optic nerve and/or vision-threatening serious adverse events, including ION, ocular ischemic syndrome, papilledema, blindness, blurred vision, visual impairment, and reduced visual acuity. Odds ratios (ORs) were derived. Type 2 diabetes occurred in 76.4% of participants. Over mean follow-up duration of 2.97 years (estimated cumulative exposure of 240,334 patient-years), GLP-1 RA use was not associated with increased risk of primary end point (OR 1.20, 95% CI 0.73-1.97, I2 = 0%). Prespecified individual adverse events, including ION (OR 1.50, 95% CI 0.49-4.63), and vision loss/disturbance events (OR 1.08, 95% CI 0.60-1.94) were not significantly associated with GLP-1 RA use. RCTs reported vision-threatening events as adverse events rather than as prespecified outcomes. Based on a large number of patients who contributed to a meta-analysis of RCTs involving participants with type 2 diabetes and cardiometabolic disease, GLP-1 RAs were not associated with an increased risk of optic nerve/vision-threatening events.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Data concerning glucagon-like peptide 1 receptor agonists (GLP-1 RAs) on risk of ischemic optic neuropathy (ION) are conflicting."
        },
        {
          "label": "PURPOSE",
          "text": "We synthesize current evidence of GLP-1 RAs on risk of optic nerve or vision-threatening events from randomized controlled trials (RCTs) in patients with type 2 diabetes or cardiometabolic diseases."
        },
        {
          "label": "DATA SOURCE",
          "text": "A total of 83,288 participants with type 2 diabetes/cardiometabolic diseases from 20 published RCTs were analyzed following Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA)."
        },
        {
          "label": "STUDY SELECTION",
          "text": "RCTs investigating GLP-1 RAs for type 2 diabetes/cardiometabolic disease populations and reported optic nerve or vision-related adverse events were assessed."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Primary outcome was a composite of optic nerve and/or vision-threatening serious adverse events, including ION, ocular ischemic syndrome, papilledema, blindness, blurred vision, visual impairment, and reduced visual acuity. Odds ratios (ORs) were derived."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Type 2 diabetes occurred in 76.4% of participants. Over mean follow-up duration of 2.97 years (estimated cumulative exposure of 240,334 patient-years), GLP-1 RA use was not associated with increased risk of primary end point (OR 1.20, 95% CI 0.73-1.97, I2 = 0%). Prespecified individual adverse events, including ION (OR 1.50, 95% CI 0.49-4.63), and vision loss/disturbance events (OR 1.08, 95% CI 0.60-1.94) were not significantly associated with GLP-1 RA use."
        },
        {
          "label": "LIMITATIONS",
          "text": "RCTs reported vision-threatening events as adverse events rather than as prespecified outcomes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Based on a large number of patients who contributed to a meta-analysis of RCTs involving participants with type 2 diabetes and cardiometabolic disease, GLP-1 RAs were not associated with an increased risk of optic nerve/vision-threatening events."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41587563/",
      "pubDate": "2026 Jan 26",
      "doi": "10.2337/dc25-1929",
      "dateReceived": "2026-01-30T23:34:01.477Z",
      "isNew": false
    },
    {
      "id": "eec1a2de2881",
      "title": "Cabergoline for Lactation Inhibition After Early Second-Trimester Abortion or Pregnancy Loss: A Randomized Controlled Trial.",
      "journal": "Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49787315/118634",
      "abstract": "To evaluate cabergoline's efficacy at decreasing lactation symptoms after early second-trimester abortion or pregnancy loss. This is a multisite, double-blind, gestational-age stratified superiority trial that compared cabergoline 1 mg once with placebo for preventing bothersome breast symptoms immediately after uterine evacuation. We enrolled pregnant people at 16-20 weeks of gestation who were English- or Spanish-speaking and without contraindication to the study drug. Participants received cabergoline within 4 hours of uterine evacuation or fetal expulsion and, at baseline and at multiple time points through 2 weeks postprocedure, completed a validated electronic survey that assessed breast symptoms, side effects, and bother. Our primary outcome was breast symptoms (a composite of engorgement, milk leakage, tenderness, and need for pain relief) on day 4; we planned to enroll 30 participants in each gestational duration strata to show a 40% difference in breast symptoms (80% power, α=0.049). After screening 145 patients from February 2024 through May 2025, we enrolled 69 eligible participants. Baseline demographics were balanced between groups: Median gestational duration was 18 weeks (range 16 0/7-19 6/7 weeks), 53.0% were nulliparous, 63.6% self-identified as Hispanic, and 68.2% had public insurance. On day 4, significantly fewer participants who received cabergoline reported any breast symptoms compared with placebo (50.0% vs 88.2%, P<.001) (primary outcome) and fewer participants reported significant bother from breast symptoms (3.1% vs 20.6%, P=.05) (secondary outcome). These differences persist even in the earlier gestational duration strata. Cabergoline is an effective and well-tolerated medication to prevent breast symptoms after early second-trimester abortion or pregnancy loss. ClinicalTrials.gov: NCT06029673.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To evaluate cabergoline's efficacy at decreasing lactation symptoms after early second-trimester abortion or pregnancy loss."
        },
        {
          "label": "METHODS",
          "text": "This is a multisite, double-blind, gestational-age stratified superiority trial that compared cabergoline 1 mg once with placebo for preventing bothersome breast symptoms immediately after uterine evacuation. We enrolled pregnant people at 16-20 weeks of gestation who were English- or Spanish-speaking and without contraindication to the study drug. Participants received cabergoline within 4 hours of uterine evacuation or fetal expulsion and, at baseline and at multiple time points through 2 weeks postprocedure, completed a validated electronic survey that assessed breast symptoms, side effects, and bother. Our primary outcome was breast symptoms (a composite of engorgement, milk leakage, tenderness, and need for pain relief) on day 4; we planned to enroll 30 participants in each gestational duration strata to show a 40% difference in breast symptoms (80% power, α=0.049)."
        },
        {
          "label": "RESULTS",
          "text": "After screening 145 patients from February 2024 through May 2025, we enrolled 69 eligible participants. Baseline demographics were balanced between groups: Median gestational duration was 18 weeks (range 16 0/7-19 6/7 weeks), 53.0% were nulliparous, 63.6% self-identified as Hispanic, and 68.2% had public insurance. On day 4, significantly fewer participants who received cabergoline reported any breast symptoms compared with placebo (50.0% vs 88.2%, P<.001) (primary outcome) and fewer participants reported significant bother from breast symptoms (3.1% vs 20.6%, P=.05) (secondary outcome). These differences persist even in the earlier gestational duration strata."
        },
        {
          "label": "CONCLUSION",
          "text": "Cabergoline is an effective and well-tolerated medication to prevent breast symptoms after early second-trimester abortion or pregnancy loss."
        },
        {
          "label": "CLINICAL TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov: NCT06029673."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41538804/",
      "pubDate": "2026 Feb 01",
      "doi": "10.1097/AOG.0000000000006137",
      "dateReceived": "2026-01-29T23:34:22.226Z",
      "isNew": false
    },
    {
      "id": "2c8bfa69092d",
      "title": "Electronic Intervention for Patient-Managed Benzodiazepine Tapering: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49787315/118633",
      "abstract": "More than 30 million people in the US take prescribed benzodiazepines, which, when taken long-term, carry risks of falls, cognitive decline, and dependence. A previous trial showed that a patient-focused self-management intervention (Eliminating Medications Through Patient Ownership of End Results; EMPOWER) can reduce long-term benzodiazepine dependence use and the risks that accompany it. To replicate the finding of the EMPOWER trial after converting the intervention from printed materials to electronic format. This 2-arm, individually randomized clinical trial with a 6-month follow-up was conducted at US Veterans Health Administration primary care clinics in 2 Veterans Affairs health care systems. Participants included 161 primary care patients taking benzodiazepines for 3 or more months and having access to a smartphone, tablet, or desktop computer. Recruitment occurred from June 1, 2022, to January 31, 2024. Participants were randomized to either the electronically delivered EMPOWER (EMPOWER-ED) protocol or asked to continue to follow clinician recommendations regarding their benzodiazepine use (treatment as usual). Preregistered primary outcomes were complete benzodiazepine cessation and at least 25% dose reduction at 6-month follow-up, assessed using pharmacy data. Secondary outcomes were self-reported anxiety symptoms, sleep quality, and overall health and quality of life. Analysis was performed on an intent-to-treat basis. The 161 participants had a mean (SD) age of 61.9 (13.7) years and were mostly male (134 [83.2%]). Individuals assigned to the EMPOWER-ED group had a significantly greater likelihood of complete benzodiazepine cessation (odds ratio [OR], 5.31 [95% CI, 1.12-25.12]). There was no likelihood of at least a 25% dose reduction in the EMPOWER-ED group relative to the control group (OR, 2.51 [95% CI, 0.91-6.90]). No statistically significant difference was found between the 2 groups for the secondary outcomes. This randomized clinical trial found a large effect of a low-cost, self-administered electronic intervention for reducing benzodiazepine use among long-term users. Findings from this replicated clinical trial are encouraging given the prevalence of benzodiazepine dependence and the constraints on clinician time available to address it. Dissemination of this intervention-which is in the public domain-by health care and public health systems seems warranted. ClinicalTrials.gov Identifier: NCT04572750.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "More than 30 million people in the US take prescribed benzodiazepines, which, when taken long-term, carry risks of falls, cognitive decline, and dependence. A previous trial showed that a patient-focused self-management intervention (Eliminating Medications Through Patient Ownership of End Results; EMPOWER) can reduce long-term benzodiazepine dependence use and the risks that accompany it."
        },
        {
          "label": "OBJECTIVE",
          "text": "To replicate the finding of the EMPOWER trial after converting the intervention from printed materials to electronic format."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This 2-arm, individually randomized clinical trial with a 6-month follow-up was conducted at US Veterans Health Administration primary care clinics in 2 Veterans Affairs health care systems. Participants included 161 primary care patients taking benzodiazepines for 3 or more months and having access to a smartphone, tablet, or desktop computer. Recruitment occurred from June 1, 2022, to January 31, 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Participants were randomized to either the electronically delivered EMPOWER (EMPOWER-ED) protocol or asked to continue to follow clinician recommendations regarding their benzodiazepine use (treatment as usual)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Preregistered primary outcomes were complete benzodiazepine cessation and at least 25% dose reduction at 6-month follow-up, assessed using pharmacy data. Secondary outcomes were self-reported anxiety symptoms, sleep quality, and overall health and quality of life. Analysis was performed on an intent-to-treat basis."
        },
        {
          "label": "RESULTS",
          "text": "The 161 participants had a mean (SD) age of 61.9 (13.7) years and were mostly male (134 [83.2%]). Individuals assigned to the EMPOWER-ED group had a significantly greater likelihood of complete benzodiazepine cessation (odds ratio [OR], 5.31 [95% CI, 1.12-25.12]). There was no likelihood of at least a 25% dose reduction in the EMPOWER-ED group relative to the control group (OR, 2.51 [95% CI, 0.91-6.90]). No statistically significant difference was found between the 2 groups for the secondary outcomes."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial found a large effect of a low-cost, self-administered electronic intervention for reducing benzodiazepine use among long-term users. Findings from this replicated clinical trial are encouraging given the prevalence of benzodiazepine dependence and the constraints on clinician time available to address it. Dissemination of this intervention-which is in the public domain-by health care and public health systems seems warranted."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04572750."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41533380/",
      "pubDate": "2026 Jan 02",
      "doi": "10.1001/jamanetworkopen.2025.51807",
      "dateReceived": "2026-01-29T23:34:22.226Z",
      "isNew": false
    },
    {
      "id": "fa375bd8dcb3",
      "title": "Remimazolam Besylate Versus Dexmedetomidine As a Sedative in ICU Patients Undergoing Mechanical Ventilation: A Multicenter, Single-blinded, Randomized, Noninferiority Trial.",
      "journal": "Crit Care Med",
      "score": "6/7",
      "tags": [
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49787315/118600",
      "abstract": "To evaluate whether remimazolam besylate could provide noninferior sedation to dexmedetomidine in patients under mechanical ventilation (MV) in the ICU. A multicenter, single-blind, randomized, noninferiority trial. Fifteen ICUs across China between October 2021 and November 2023. Adults under endotracheal intubation MV who were expected to require sedation for 8-48 hours. Three hundred fourteen patients were randomly assigned at a 1:1 ratio to the remimazolam besylate or dexmedetomidine group. Analgesia was provided via a continuous IV infusion of remifentanil at 1.2-9.0 µg/kg/hr. Remimazolam besylate or dexmedetomidine was administered IV at an initial loading dose of 0.1 mg/kg followed by a maintenance dose of 0.10-0.30 mg/kg/hr or at an initial loading dose of 0.20 µg/kg followed by a maintenance dose of 0.2-0.70 µg/kg/hr to achieve the targeted sedation range on the Richmond Agitation-Sedation Scale of -2 to +1. Of the 314 patients enrolled, 299 completed the study. The sedation efficacy rates, as the primary endpoint, were 82.6% and 83.2% in remimazolam besylate and dexmedetomidine groups, respectively, in the per-protocol set (PPS), whereas the rate was 72.9% in both groups in the intention-to-treat (ITT) set. The noninferiority margin was set as 10%, and the lower limits of the two-sided 95% CI for the intergroup difference were -3.0% and -2.6% in the PPS and ITT sets, respectively. The dexmedetomidine group had a higher incidence of bradycardia than the remimazolam besylate group (4.7% vs. 0.7%; p = 0.029), whereas no intergroup differences were noted for the remaining secondary endpoints and adverse events. Remimazolam besylate could provide noninferior sedation as dexmedetomidine with a lower risk of bradycardia for 48 hours in mechanically ventilated patients in the ICU.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To evaluate whether remimazolam besylate could provide noninferior sedation to dexmedetomidine in patients under mechanical ventilation (MV) in the ICU."
        },
        {
          "label": "DESIGN",
          "text": "A multicenter, single-blind, randomized, noninferiority trial."
        },
        {
          "label": "SETTING",
          "text": "Fifteen ICUs across China between October 2021 and November 2023."
        },
        {
          "label": "PATIENTS",
          "text": "Adults under endotracheal intubation MV who were expected to require sedation for 8-48 hours."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Three hundred fourteen patients were randomly assigned at a 1:1 ratio to the remimazolam besylate or dexmedetomidine group. Analgesia was provided via a continuous IV infusion of remifentanil at 1.2-9.0 µg/kg/hr. Remimazolam besylate or dexmedetomidine was administered IV at an initial loading dose of 0.1 mg/kg followed by a maintenance dose of 0.10-0.30 mg/kg/hr or at an initial loading dose of 0.20 µg/kg followed by a maintenance dose of 0.2-0.70 µg/kg/hr to achieve the targeted sedation range on the Richmond Agitation-Sedation Scale of -2 to +1."
        },
        {
          "label": "MEASUREMENTS AND MAIN RESULTS",
          "text": "Of the 314 patients enrolled, 299 completed the study. The sedation efficacy rates, as the primary endpoint, were 82.6% and 83.2% in remimazolam besylate and dexmedetomidine groups, respectively, in the per-protocol set (PPS), whereas the rate was 72.9% in both groups in the intention-to-treat (ITT) set. The noninferiority margin was set as 10%, and the lower limits of the two-sided 95% CI for the intergroup difference were -3.0% and -2.6% in the PPS and ITT sets, respectively. The dexmedetomidine group had a higher incidence of bradycardia than the remimazolam besylate group (4.7% vs. 0.7%; p = 0.029), whereas no intergroup differences were noted for the remaining secondary endpoints and adverse events."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Remimazolam besylate could provide noninferior sedation as dexmedetomidine with a lower risk of bradycardia for 48 hours in mechanically ventilated patients in the ICU."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41524483/",
      "pubDate": "2026 Jan 12",
      "doi": "10.1097/CCM.0000000000007011",
      "dateReceived": "2026-01-29T23:34:22.226Z",
      "isNew": false
    },
    {
      "id": "ea95b6e45fc2",
      "title": "Efficacy and Safety of Auricular Acupressure for Insomnia in Patients With Functional Dyspepsia: A Randomized Controlled Trial.",
      "journal": "Am J Gastroenterol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49787315/118592",
      "abstract": "Insomnia is a prevalent and debilitating disorder often experienced by patients with functional dyspepsia (FD). Auricular acupressure (AA) has gained attention for its potential in treating both FD and insomnia. However, its clinical efficacy and safety remain unclear because of a lack of high-quality randomized controlled trials. Patients with FD and insomnia were enrolled and randomly divided into AA group or sham AA (SAA) group. Patients in the AA group were treated in the ear concha region, and patients in the SAA group were treated in the earlobe region. Treatment was given 3 times a day, 1 day apart, for 2 weeks. The primary outcome was the response rate, defined as a reduction of at least 50% in the Pittsburgh Sleep Quality Index score at week 2; minimal clinically important improvement was defined as a 4-point reduction, and minimal clinically important difference was defined as a 3-point reduction. Secondary outcomes included the response rate at 8 weeks, sleep parameters measured by actigraphy, FD symptoms, quality of life, mental health status, and autonomic functions. Eighty-two participants were randomized into the AA group (41 participants) or the SAA group (41 participants). The response rate at week 2 was 53.7% in the AA group compared with 29.3% in the SAA group (95% confidence interval -35.6 to -13.2, P < 0.001). The efficacy of AA was sustained during the 8-week posttreatment follow-up. Adverse events were all mild and comparable between the 2 groups ( P = 0.53). Among patients with FD and insomnia, a 2-week treatment of AA is more effective than SAA in improving the response rate, with benefits maintained over an 8-week follow-up period.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Insomnia is a prevalent and debilitating disorder often experienced by patients with functional dyspepsia (FD). Auricular acupressure (AA) has gained attention for its potential in treating both FD and insomnia. However, its clinical efficacy and safety remain unclear because of a lack of high-quality randomized controlled trials."
        },
        {
          "label": "METHODS",
          "text": "Patients with FD and insomnia were enrolled and randomly divided into AA group or sham AA (SAA) group. Patients in the AA group were treated in the ear concha region, and patients in the SAA group were treated in the earlobe region. Treatment was given 3 times a day, 1 day apart, for 2 weeks. The primary outcome was the response rate, defined as a reduction of at least 50% in the Pittsburgh Sleep Quality Index score at week 2; minimal clinically important improvement was defined as a 4-point reduction, and minimal clinically important difference was defined as a 3-point reduction. Secondary outcomes included the response rate at 8 weeks, sleep parameters measured by actigraphy, FD symptoms, quality of life, mental health status, and autonomic functions."
        },
        {
          "label": "RESULTS",
          "text": "Eighty-two participants were randomized into the AA group (41 participants) or the SAA group (41 participants). The response rate at week 2 was 53.7% in the AA group compared with 29.3% in the SAA group (95% confidence interval -35.6 to -13.2, P < 0.001). The efficacy of AA was sustained during the 8-week posttreatment follow-up. Adverse events were all mild and comparable between the 2 groups ( P = 0.53)."
        },
        {
          "label": "DISCUSSION",
          "text": "Among patients with FD and insomnia, a 2-week treatment of AA is more effective than SAA in improving the response rate, with benefits maintained over an 8-week follow-up period."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41369283/",
      "pubDate": "2025 Dec 10",
      "doi": "10.14309/ajg.0000000000003880",
      "dateReceived": "2026-01-29T23:34:22.226Z",
      "isNew": false
    },
    {
      "id": "880b540ee193",
      "title": "2026 Guideline for the Early Management of Patients With Acute Ischemic Stroke: A Guideline From the American Heart Association/American Stroke Association.",
      "journal": "Stroke",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Intensivist/Critical Care",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49880737/118695",
      "abstract": "The \"2026 Guideline for the Early Management of Patients With AIS\" replaces the \"2018 Guidelines for the Early Management of Patients With AIS\" and the 2019 update to reflect recent advances in evidence. This updated guideline is intended to provide a comprehensive, up-to-date, evidence-based set of recommendations, advising management from prehospital evaluation through acute treatment and early in-hospital management of complications and initiation of early secondary prevention measures. The intended audience includes prehospital care professionals, physicians, allied health professionals, and hospital administrators. A search for literature derived from research principally involving human subjects, published in English since the last AIS guideline in 2018 and the 2019 update, and indexed in MEDLINE, PubMed, Cochrane Library, and other selected databases relevant to this guideline, was conducted between September and December 2024. Additional high impact studies and articles published through March 2025 were added later, where appropriate. This guideline represents the most current and comprehensive evidence available in AIS care. Key updates include the incorporation of new evidence related to thrombolytic choice and eligibility, determination of eligibility for endovascular thrombectomy, and management of hyperglycemia and dysphagia; a focused consideration of the pediatric population; and modification of the approach to thrombolysis contraindications. Although this guideline reflects significant advances, it also highlights gaps in knowledge and underscores the urgent need for continued research to further refine and improve treatment strategies.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "The \"2026 Guideline for the Early Management of Patients With AIS\" replaces the \"2018 Guidelines for the Early Management of Patients With AIS\" and the 2019 update to reflect recent advances in evidence. This updated guideline is intended to provide a comprehensive, up-to-date, evidence-based set of recommendations, advising management from prehospital evaluation through acute treatment and early in-hospital management of complications and initiation of early secondary prevention measures. The intended audience includes prehospital care professionals, physicians, allied health professionals, and hospital administrators."
        },
        {
          "label": "METHODS",
          "text": "A search for literature derived from research principally involving human subjects, published in English since the last AIS guideline in 2018 and the 2019 update, and indexed in MEDLINE, PubMed, Cochrane Library, and other selected databases relevant to this guideline, was conducted between September and December 2024. Additional high impact studies and articles published through March 2025 were added later, where appropriate."
        },
        {
          "label": "STRUCTURE",
          "text": "This guideline represents the most current and comprehensive evidence available in AIS care. Key updates include the incorporation of new evidence related to thrombolytic choice and eligibility, determination of eligibility for endovascular thrombectomy, and management of hyperglycemia and dysphagia; a focused consideration of the pediatric population; and modification of the approach to thrombolysis contraindications. Although this guideline reflects significant advances, it also highlights gaps in knowledge and underscores the urgent need for continued research to further refine and improve treatment strategies."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41582814/",
      "pubDate": "2026 Jan 26",
      "doi": "10.1161/STR.0000000000000513",
      "dateReceived": "2026-01-29T23:34:22.225Z",
      "isNew": false
    },
    {
      "id": "e1d893ae0c95",
      "title": "Enhanced Detection and Prompt Diagnosis of Atrial Fibrillation Using Apple Watch: A Randomized Controlled Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49880737/118677",
      "abstract": "Atrial fibrillation (AF), the most common cardiac arrhythmia, is a major cause of stroke and often remains undiagnosed due to its paroxysmal and frequently asymptomatic nature. Wearables provide a scalable, noninvasive screening tool. This trial evaluated new onset AF detection in patients at elevated stroke risk using remote smartwatch-based screening. This prospective multicenter randomized controlled trial included patients ≥65 years with elevated stroke risk (CHADS-VASc ≥2 men, ≥3 women) from 2 secondary care centers in the Netherlands. Patients were randomized to 6-month (180-day) monitoring with a smartwatch with photoplethysmography and single-lead electrocardiogram (ECG) functions, or standard care. ECGs were reviewed remotely by an independent eHealth team within 24 hours. The primary outcome was new onset AF, defined as a confirmed episode lasting ≥30 seconds on single-lead ECG or standard ECG methods. Between November 2022 and December 2023, 437 patients were randomized (219 intervention, 218 control); the median age was 75 years, 46.7% were female and the median CHADS-VASc score was 3.0. New onset AF occurred in 21 (9.6%) patients of the intervention group and 5 (2.3%) patients of the control group (risk difference: 7.3 percentage points; 95% CI: 2.9-11.7 percentage points; P = 0.001; HR: 4.40; 95% CI: 1.66-11.66). Several asymptomatic AF episodes were detected only in the intervention group, while paroxysmal AF occurred in both groups. This randomized controlled trial provides evidence that 6-month smartwatch-based AF screening enhances the detection rate of new onset AF compared with standard care in patients at elevated stroke risk. (Detection and Quantification of Atrial Fibrillation in High-risk Patients Using a Smartwatch Wearable [Apple Watch] [EQUAL]; NCT05686330).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Atrial fibrillation (AF), the most common cardiac arrhythmia, is a major cause of stroke and often remains undiagnosed due to its paroxysmal and frequently asymptomatic nature. Wearables provide a scalable, noninvasive screening tool."
        },
        {
          "label": "OBJECTIVES",
          "text": "This trial evaluated new onset AF detection in patients at elevated stroke risk using remote smartwatch-based screening."
        },
        {
          "label": "METHODS",
          "text": "This prospective multicenter randomized controlled trial included patients ≥65 years with elevated stroke risk (CHADS-VASc ≥2 men, ≥3 women) from 2 secondary care centers in the Netherlands. Patients were randomized to 6-month (180-day) monitoring with a smartwatch with photoplethysmography and single-lead electrocardiogram (ECG) functions, or standard care. ECGs were reviewed remotely by an independent eHealth team within 24 hours. The primary outcome was new onset AF, defined as a confirmed episode lasting ≥30 seconds on single-lead ECG or standard ECG methods."
        },
        {
          "label": "RESULTS",
          "text": "Between November 2022 and December 2023, 437 patients were randomized (219 intervention, 218 control); the median age was 75 years, 46.7% were female and the median CHADS-VASc score was 3.0. New onset AF occurred in 21 (9.6%) patients of the intervention group and 5 (2.3%) patients of the control group (risk difference: 7.3 percentage points; 95% CI: 2.9-11.7 percentage points; P = 0.001; HR: 4.40; 95% CI: 1.66-11.66). Several asymptomatic AF episodes were detected only in the intervention group, while paroxysmal AF occurred in both groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This randomized controlled trial provides evidence that 6-month smartwatch-based AF screening enhances the detection rate of new onset AF compared with standard care in patients at elevated stroke risk. (Detection and Quantification of Atrial Fibrillation in High-risk Patients Using a Smartwatch Wearable [Apple Watch] [EQUAL]; NCT05686330)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41569211/",
      "pubDate": "2026 Jan 22",
      "doi": "10.1016/j.jacc.2025.11.032",
      "dateReceived": "2026-01-29T23:34:22.225Z",
      "isNew": false
    },
    {
      "id": "118f837ecacb",
      "title": "Increasing uptake of physical health checks for people living with severe mental illness: a systematic review.",
      "journal": "Br J Gen Pract",
      "score": "5/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49865316/118692",
      "abstract": "People living with severe mental illness (SMI) can experience greater risk of premature mortality than the general population with preventable physical ill health a major contributor. Physical health checks are a strategy to improve physical health but uptake is variable. To collate and assess the published evidence on the effectiveness of interventions to increase access to, and uptake of, physical health reviews for people living with SMI. This was a systematic review. Three databases (Medline, CINAHL, and PsycINFO) were searched for studies evaluating interventions aiming to increase access to and uptake of physical health checks for people with SMI. Searches were conducted during October and November 2024 for studies published from 2000 onwards. Studies were included that reported on outcomes of uptake or receipt of physical health checks or screening, including cancer screening. Both randomised controlled trials (RCTs) and comparative non-randomised studies were eligible. Primary, secondary, and tertiary care settings were included. Studies from high-income countries were also included. Risk of bias was assessed using version 2 of the Cochrane risk-of-bias tool for randomised trials (RoB2), an adaptation of the Risk of Bias in Non-randomised Studies of Exposures (ROBINS-E), and Risk of Bias in Non-randomised Studies - of Interventions (ROBINS-I) tools. Data synthesis involved an effect direction plot. Of 4437 identified studies, 12 were eligible. Intervention categories were case management ( = 2), financial incentivisation ( = 3), service change ( = 5), invitation ( = 1), and mixed ( = 1). Two RCTs showed a positive effect of a case-management approach; for one study there was 'high' risk of bias. For other interventions, diverse non-randomised studies were included with either positive or mixed findings and risk of bias ranging from 'moderate' to 'critical'. The study identified a scarcity of data and although a case-management approach shows promise there should be further robust and high-quality research.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "People living with severe mental illness (SMI) can experience greater risk of premature mortality than the general population with preventable physical ill health a major contributor. Physical health checks are a strategy to improve physical health but uptake is variable."
        },
        {
          "label": "AIM",
          "text": "To collate and assess the published evidence on the effectiveness of interventions to increase access to, and uptake of, physical health reviews for people living with SMI."
        },
        {
          "label": "DESIGN AND SETTING",
          "text": "This was a systematic review."
        },
        {
          "label": "METHOD",
          "text": "Three databases (Medline, CINAHL, and PsycINFO) were searched for studies evaluating interventions aiming to increase access to and uptake of physical health checks for people with SMI. Searches were conducted during October and November 2024 for studies published from 2000 onwards. Studies were included that reported on outcomes of uptake or receipt of physical health checks or screening, including cancer screening. Both randomised controlled trials (RCTs) and comparative non-randomised studies were eligible. Primary, secondary, and tertiary care settings were included. Studies from high-income countries were also included. Risk of bias was assessed using version 2 of the Cochrane risk-of-bias tool for randomised trials (RoB2), an adaptation of the Risk of Bias in Non-randomised Studies of Exposures (ROBINS-E), and Risk of Bias in Non-randomised Studies - of Interventions (ROBINS-I) tools. Data synthesis involved an effect direction plot."
        },
        {
          "label": "RESULTS",
          "text": "Of 4437 identified studies, 12 were eligible. Intervention categories were case management ( = 2), financial incentivisation ( = 3), service change ( = 5), invitation ( = 1), and mixed ( = 1). Two RCTs showed a positive effect of a case-management approach; for one study there was 'high' risk of bias. For other interventions, diverse non-randomised studies were included with either positive or mixed findings and risk of bias ranging from 'moderate' to 'critical'."
        },
        {
          "label": "CONCLUSION",
          "text": "The study identified a scarcity of data and although a case-management approach shows promise there should be further robust and high-quality research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40897506/",
      "pubDate": "2026 Jan 01",
      "doi": "10.3399/BJGP.2024.0826",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "c2275b5206c4",
      "title": "Mobile Chat Messaging for Smoking Relapse Prevention: A Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49865316/118679",
      "abstract": "Most individuals attempting smoking cessation relapse, even with evidence-based treatment. Mobile interventions offer a potential but largely untested strategy to sustain cessation. To test the effectiveness of mobile chat messaging for relapse prevention among individuals who recently quit smoking. This randomized clinical trial was conducted from March 14, 2023, to August 15, 2024, at 2 clinic-based smoking cessation services in Hong Kong. Participants were adults who smoked daily and had abstained for 3 to 30 days; they were randomly assigned to an intervention group or a control group. All participants received usual smoking cessation treatment from the services. The intervention group additionally received 3 months of mobile relapse prevention intervention, including chat-based support delivered by a live counselor and access to a supportive chatbot via a messaging app. The control group received 8 text messages on generic smoking cessation advice over 3 months as a contact control. The primary outcome was biochemically validated tobacco abstinence at 6 months after randomization, defined by an exhaled carbon monoxide level of less than 5 ppm or a negative salivary cotinine test result. Secondary outcomes at 6 months included self-reported prolonged abstinence, 7-day point prevalence abstinence, and relapse (7 consecutive days of smoking) rate. Intention-to-treat analyses were conducted, assuming participants with missing outcomes relapsed. Of 590 participants, 465 (78.8%) were male, and the mean (SD) age was 47.1 (11.2) years; 294 were randomized to the intervention group and 296 were randomized to the control group. The retention rate at 6-month follow-up was 98.0% (n = 578). Biochemically validated abstinence at 6 months was significantly higher in the intervention group than in the control group (45.9% [135 of 294] vs 35.5% [105 of 296]; relative risk [RR], 1.29; 95% CI, 1.06-1.58; P = .01). The intervention group also reported significantly higher prolonged abstinence (57.5% [169 of 294] vs 47.6% [141 of 296]; RR, 1.21; 95% CI, 1.03-1.41; P = .02), higher 7-day point prevalence abstinence (65.6% [193 of 294] vs 54.7% [162 of 296]; RR, 1.20; 95% CI, 1.05-1.37; P = .007), and lower relapse rate (33.0% [97 of 294] vs 44.9% [133 of 296]; RR, 0.73; 95% CI, 0.60-0.90; P = .003) at 6 months. This randomized clinical trial found that mobile chat messaging for smoking relapse prevention increased validated abstinence by approximately 30%, offering a scalable approach to sustain abstinence among individuals who recently quit smoking. ClinicalTrials.gov Identifier: NCT05370352.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Most individuals attempting smoking cessation relapse, even with evidence-based treatment. Mobile interventions offer a potential but largely untested strategy to sustain cessation."
        },
        {
          "label": "OBJECTIVE",
          "text": "To test the effectiveness of mobile chat messaging for relapse prevention among individuals who recently quit smoking."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was conducted from March 14, 2023, to August 15, 2024, at 2 clinic-based smoking cessation services in Hong Kong. Participants were adults who smoked daily and had abstained for 3 to 30 days; they were randomly assigned to an intervention group or a control group."
        },
        {
          "label": "INTERVENTIONS",
          "text": "All participants received usual smoking cessation treatment from the services. The intervention group additionally received 3 months of mobile relapse prevention intervention, including chat-based support delivered by a live counselor and access to a supportive chatbot via a messaging app. The control group received 8 text messages on generic smoking cessation advice over 3 months as a contact control."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was biochemically validated tobacco abstinence at 6 months after randomization, defined by an exhaled carbon monoxide level of less than 5 ppm or a negative salivary cotinine test result. Secondary outcomes at 6 months included self-reported prolonged abstinence, 7-day point prevalence abstinence, and relapse (7 consecutive days of smoking) rate. Intention-to-treat analyses were conducted, assuming participants with missing outcomes relapsed."
        },
        {
          "label": "RESULTS",
          "text": "Of 590 participants, 465 (78.8%) were male, and the mean (SD) age was 47.1 (11.2) years; 294 were randomized to the intervention group and 296 were randomized to the control group. The retention rate at 6-month follow-up was 98.0% (n = 578). Biochemically validated abstinence at 6 months was significantly higher in the intervention group than in the control group (45.9% [135 of 294] vs 35.5% [105 of 296]; relative risk [RR], 1.29; 95% CI, 1.06-1.58; P = .01). The intervention group also reported significantly higher prolonged abstinence (57.5% [169 of 294] vs 47.6% [141 of 296]; RR, 1.21; 95% CI, 1.03-1.41; P = .02), higher 7-day point prevalence abstinence (65.6% [193 of 294] vs 54.7% [162 of 296]; RR, 1.20; 95% CI, 1.05-1.37; P = .007), and lower relapse rate (33.0% [97 of 294] vs 44.9% [133 of 296]; RR, 0.73; 95% CI, 0.60-0.90; P = .003) at 6 months."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial found that mobile chat messaging for smoking relapse prevention increased validated abstinence by approximately 30%, offering a scalable approach to sustain abstinence among individuals who recently quit smoking."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05370352."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41557345/",
      "pubDate": "2026 Jan 20",
      "doi": "10.1001/jamainternmed.2025.7439",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "5c8879f84ad8",
      "title": "Antibiotic Therapy for Uncomplicated Acute Appendicitis: Ten-Year Follow-Up of the APPAC Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49865316/118665",
      "abstract": "Antibiotic therapy is effective and safe for uncomplicated acute appendicitis in adults, but randomized clinical trial results exceeding 5 years are missing. To determine the 10-year appendicitis recurrence and appendectomy rate in patients with uncomplicated appendicitis treated with antibiotics. Ten-year observational follow-up of patients in the Appendicitis Acuta (APPAC) multicenter randomized clinical trial comparing appendectomy with antibiotics at 6 Finnish hospitals from November 2009 to June 2012, where 530 patients (aged 18-60 years) with uncomplicated acute appendicitis diagnosed by computed tomography were randomly assigned to appendectomy (n = 273) or antibiotics (n = 257). Last follow-up was April 29, 2024. This current analysis focused on assessing the 10-year appendicitis recurrence rate among patients assigned to antibiotics. Open appendectomy vs antibiotics with intravenous ertapenem sodium (1 g/d) for 3 days followed by 7 days of oral levofloxacin (500 mg once daily) and metronidazole (500 mg 3 times/d). Prespecified 10-year secondary end points included late (after 1 year) appendectomy and appendicitis recurrence rate after antibiotics and complications. Post hoc outcomes included the detection of possible appendiceal tumors among patients in the antibiotic group undergoing appendectomy or with an intact appendix using magnetic resonance imaging. Additional post hoc outcomes were quality of life and patient satisfaction. At 10-year follow-up, 253/257 patients (98.4%) randomized to receive antibiotics (median age, 33 years; 102 [40.3%] female) were assessed for appendicitis recurrence, with a true appendicitis recurrence rate (appendicitis at histopathology) of 37.8% (95% CI, 31.6%-44.1% [87/230]) and a cumulative appendectomy rate of 44.3% (95% CI, 38.2%-50.4% [112/253]). Overall, the 10-year cumulative complication rate in the group randomized to appendectomy was 27.4% (95% CI, 21.6%-33.3% [62/226]) and 8.5% (95% CI, 4.8%-12.1% [19/224]) in the group randomized to receive antibiotics (P < .001). There was no observed significant difference in quality of life between antibiotics and appendectomy (387/530; median health index value, 1.0 [95% CI, 1.0-1.0] for both groups; P = .18). Among patients initially treated with antibiotics for uncomplicated acute appendicitis, the rate of recurrence and appendectomy at 10-year follow-up supports the use of antibiotics as an option for uncomplicated acute appendicitis in adult patients. ClinicalTrials.gov Identifier: NCT01022567.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Antibiotic therapy is effective and safe for uncomplicated acute appendicitis in adults, but randomized clinical trial results exceeding 5 years are missing."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the 10-year appendicitis recurrence and appendectomy rate in patients with uncomplicated appendicitis treated with antibiotics."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Ten-year observational follow-up of patients in the Appendicitis Acuta (APPAC) multicenter randomized clinical trial comparing appendectomy with antibiotics at 6 Finnish hospitals from November 2009 to June 2012, where 530 patients (aged 18-60 years) with uncomplicated acute appendicitis diagnosed by computed tomography were randomly assigned to appendectomy (n = 273) or antibiotics (n = 257). Last follow-up was April 29, 2024. This current analysis focused on assessing the 10-year appendicitis recurrence rate among patients assigned to antibiotics."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Open appendectomy vs antibiotics with intravenous ertapenem sodium (1 g/d) for 3 days followed by 7 days of oral levofloxacin (500 mg once daily) and metronidazole (500 mg 3 times/d)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Prespecified 10-year secondary end points included late (after 1 year) appendectomy and appendicitis recurrence rate after antibiotics and complications. Post hoc outcomes included the detection of possible appendiceal tumors among patients in the antibiotic group undergoing appendectomy or with an intact appendix using magnetic resonance imaging. Additional post hoc outcomes were quality of life and patient satisfaction."
        },
        {
          "label": "RESULTS",
          "text": "At 10-year follow-up, 253/257 patients (98.4%) randomized to receive antibiotics (median age, 33 years; 102 [40.3%] female) were assessed for appendicitis recurrence, with a true appendicitis recurrence rate (appendicitis at histopathology) of 37.8% (95% CI, 31.6%-44.1% [87/230]) and a cumulative appendectomy rate of 44.3% (95% CI, 38.2%-50.4% [112/253]). Overall, the 10-year cumulative complication rate in the group randomized to appendectomy was 27.4% (95% CI, 21.6%-33.3% [62/226]) and 8.5% (95% CI, 4.8%-12.1% [19/224]) in the group randomized to receive antibiotics (P < .001). There was no observed significant difference in quality of life between antibiotics and appendectomy (387/530; median health index value, 1.0 [95% CI, 1.0-1.0] for both groups; P = .18)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients initially treated with antibiotics for uncomplicated acute appendicitis, the rate of recurrence and appendectomy at 10-year follow-up supports the use of antibiotics as an option for uncomplicated acute appendicitis in adult patients."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT01022567."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41563747/",
      "pubDate": "2026 Jan 21",
      "doi": "10.1001/jama.2025.25921",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "9c4303750a2b",
      "title": "Genetic Testing for All Breast Cancer Patients: The GET FACTS Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Genetics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49865316/118618",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "9da8400bdc8c",
      "title": "Comparative analysis of radiation exposure from computed tomography and ventilation-perfusion scans in the diagnosis of pulmonary embolism: an early-onset cancer risk assessment.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49865316/118615",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "d6f5f740d2e0",
      "title": "Spinal manipulative therapy for adults with chronic low back pain.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49865316/118595",
      "abstract": "Many therapies exist for the treatment of chronic low back pain (LBP), including spinal manipulative therapy (SMT), which is a worldwide, extensively practised intervention. The effectiveness of SMT for chronic LBP is not without dispute. This Cochrane review is an update of a Cochrane systematic review published in 2011. To evaluate the benefits and harms of SMT compared to (1) sham SMT/placebo intervention, (2) no treatment, and (3) other conservative interventions in people with chronic LBP (18+ years old). We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, two other databases, and two trial registers up to 18 October 2024, unrestricted by language. We also screened the reference lists of all included studies and relevant systematic reviews, and approached content experts to identify potentially missing studies. We included randomised controlled trials (RCTs) that examined the effect of spinal manipulation or mobilisation in adults with chronic LBP compared to sham SMT/placebo, no treatment, and other conservative interventions. We placed no restrictions on the setting. We excluded studies that exclusively examined sciatica. Our critical outcomes were pain, functional status, and adverse events. The primary time point was one month for pain and functional status. We evaluated adverse events at the end of the intervention. We assessed bias in the included studies using the original Cochrane risk of bias tool (RoB 1). Where possible, we synthesised results using meta-analysis with a generic inverse-variance approach and random-effects models; otherwise, we used narrative synthesis. We assessed the certainty of evidence using the GRADE approach. Our main comparisons were SMT versus (1) sham SMT/placebo treatment, (2) no treatment, and (3) other conservative interventions at one month. We converted all pain scales to a 100-point scale. Seventy-six RCTs (11,866 participants) met our inclusion criteria, 50 (66%) of which were not included in the previous version of this review. Seventeen trials (2021 participants) compared SMT to sham SMT/placebo, and four trials (435 participants) compared SMT to no treatment. Most trials (43, including 8291 participants) examined the effect of SMT compared to other conservative interventions. The remaining trials examined other comparisons. Treatment allocation was appropriately conducted in just four sham SMT/placebo-controlled trials (24%), while only six trials 'blinded' participants to the intervention (35%), indicating a high risk of selection and performance bias. Similarly, the no-treatment controlled trials were as susceptible to selection bias (50%) and performance bias (75%). All trials were conducted in high-income (n = 53) or middle-income (n = 23) countries. In most studies, the population was middle-aged and included men and women. SMT versus sham SMT/placebo We found very low-certainty evidence (downgraded for inconsistency and study limitations) that SMT may result in a small reduction in pain compared to sham SMT/placebo at one month (mean difference (MD) -7.01, 95% confidence interval (CI) -12.48 to -1.53; I = 94%; 16 studies, 1570 participants) and very low-certainty evidence (downgraded for study limitations and inconsistency) that SMT may result in a medium improvement in functional status compared to sham SMT/placebo at one month (standardised mean difference (SMD) -0.41, 95% CI -0.69 to -0.13; I = 82%; 13 studies, 1416 participants), but the evidence is very uncertain. SMT versus no treatment We found very low-certainty evidence (downgraded for study limitations, inconsistency, and imprecision) that SMT may result in a medium reduction in pain compared to no treatment at one month (MD -13.99, 95% CI -27.33 to -0.66; I = 89%; 4 studies, 325 participants), but the evidence is very uncertain. We found low-certainty evidence (downgraded for study limitations and imprecision) that SMT may result in a large improvement in functional status compared to no treatment at one month (SMD -0.84, 95% CI -1.32 to -0.35; I = 71%; 4 studies, 312 participants). SMT versus other conservative interventions Low-certainty evidence (downgraded for inconsistency) indicated that SMT may result in little to no difference in pain (MD -4.72, 95% CI -8.26 to -1.17; I = 89%; 31 studies, 4109 participants) and may result in a small improvement in functional status (SMD -0.25, 95% CI -0.38 to -0.11; I = 73%; 28 studies, 3940 participants) compared to other conservative interventions at one month. These effects, however, should be interpreted with caution due to the substantial statistical heterogeneity for which there is no clear explanation. Less than half of the studies (47%) reported on adverse events, of which 12 studies reported these systematically. Adverse events in the SMT group were limited to muscle soreness, stiffness, and/or transient increase in pain. None of the studies registered any serious complications related to either the experimental or control group treatment. The evidence is very uncertain about the adverse effects of SMT. When SMT is compared to sham SMT/placebo, it may result in a small improvement in pain and medium improvement in functional status in adults with chronic low back pain. When compared to no treatment, SMT may result in a medium improvement in pain and a large improvement in functional status. When compared to other conservative interventions, SMT may result in little to no difference in pain and a small improvement in functional status. The evidence is of low to very low certainty, largely due to the fact that the effects of SMT were examined in trials conducted in different settings and populations, with different types of SMT technique, dosage, and frequency of treatment. Continuing to conduct RCTs in the same manner will neither strengthen the evidence nor our confidence in it. This Cochrane review had no dedicated funding, only 'in-kind' support from the Department of General Practice, Erasmus Medical Center, Rotterdam, Netherlands, and the Department of Health Sciences, Faculty of Sciences, Vrije Universiteit Amsterdam, Amsterdam Movement Science Research Institute, Netherlands. Protocol (2009): DOI: 10.1002/14651858.CD008112 Original review (2011): DOI: 10.1002/14651858.CD000447.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Many therapies exist for the treatment of chronic low back pain (LBP), including spinal manipulative therapy (SMT), which is a worldwide, extensively practised intervention. The effectiveness of SMT for chronic LBP is not without dispute. This Cochrane review is an update of a Cochrane systematic review published in 2011."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the benefits and harms of SMT compared to (1) sham SMT/placebo intervention, (2) no treatment, and (3) other conservative interventions in people with chronic LBP (18+ years old)."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, two other databases, and two trial registers up to 18 October 2024, unrestricted by language. We also screened the reference lists of all included studies and relevant systematic reviews, and approached content experts to identify potentially missing studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) that examined the effect of spinal manipulation or mobilisation in adults with chronic LBP compared to sham SMT/placebo, no treatment, and other conservative interventions. We placed no restrictions on the setting. We excluded studies that exclusively examined sciatica."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were pain, functional status, and adverse events. The primary time point was one month for pain and functional status. We evaluated adverse events at the end of the intervention."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed bias in the included studies using the original Cochrane risk of bias tool (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Where possible, we synthesised results using meta-analysis with a generic inverse-variance approach and random-effects models; otherwise, we used narrative synthesis. We assessed the certainty of evidence using the GRADE approach. Our main comparisons were SMT versus (1) sham SMT/placebo treatment, (2) no treatment, and (3) other conservative interventions at one month. We converted all pain scales to a 100-point scale."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Seventy-six RCTs (11,866 participants) met our inclusion criteria, 50 (66%) of which were not included in the previous version of this review. Seventeen trials (2021 participants) compared SMT to sham SMT/placebo, and four trials (435 participants) compared SMT to no treatment. Most trials (43, including 8291 participants) examined the effect of SMT compared to other conservative interventions. The remaining trials examined other comparisons. Treatment allocation was appropriately conducted in just four sham SMT/placebo-controlled trials (24%), while only six trials 'blinded' participants to the intervention (35%), indicating a high risk of selection and performance bias. Similarly, the no-treatment controlled trials were as susceptible to selection bias (50%) and performance bias (75%). All trials were conducted in high-income (n = 53) or middle-income (n = 23) countries. In most studies, the population was middle-aged and included men and women."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "SMT versus sham SMT/placebo We found very low-certainty evidence (downgraded for inconsistency and study limitations) that SMT may result in a small reduction in pain compared to sham SMT/placebo at one month (mean difference (MD) -7.01, 95% confidence interval (CI) -12.48 to -1.53; I = 94%; 16 studies, 1570 participants) and very low-certainty evidence (downgraded for study limitations and inconsistency) that SMT may result in a medium improvement in functional status compared to sham SMT/placebo at one month (standardised mean difference (SMD) -0.41, 95% CI -0.69 to -0.13; I = 82%; 13 studies, 1416 participants), but the evidence is very uncertain. SMT versus no treatment We found very low-certainty evidence (downgraded for study limitations, inconsistency, and imprecision) that SMT may result in a medium reduction in pain compared to no treatment at one month (MD -13.99, 95% CI -27.33 to -0.66; I = 89%; 4 studies, 325 participants), but the evidence is very uncertain. We found low-certainty evidence (downgraded for study limitations and imprecision) that SMT may result in a large improvement in functional status compared to no treatment at one month (SMD -0.84, 95% CI -1.32 to -0.35; I = 71%; 4 studies, 312 participants). SMT versus other conservative interventions Low-certainty evidence (downgraded for inconsistency) indicated that SMT may result in little to no difference in pain (MD -4.72, 95% CI -8.26 to -1.17; I = 89%; 31 studies, 4109 participants) and may result in a small improvement in functional status (SMD -0.25, 95% CI -0.38 to -0.11; I = 73%; 28 studies, 3940 participants) compared to other conservative interventions at one month. These effects, however, should be interpreted with caution due to the substantial statistical heterogeneity for which there is no clear explanation. Less than half of the studies (47%) reported on adverse events, of which 12 studies reported these systematically. Adverse events in the SMT group were limited to muscle soreness, stiffness, and/or transient increase in pain. None of the studies registered any serious complications related to either the experimental or control group treatment. The evidence is very uncertain about the adverse effects of SMT."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "When SMT is compared to sham SMT/placebo, it may result in a small improvement in pain and medium improvement in functional status in adults with chronic low back pain. When compared to no treatment, SMT may result in a medium improvement in pain and a large improvement in functional status. When compared to other conservative interventions, SMT may result in little to no difference in pain and a small improvement in functional status. The evidence is of low to very low certainty, largely due to the fact that the effects of SMT were examined in trials conducted in different settings and populations, with different types of SMT technique, dosage, and frequency of treatment. Continuing to conduct RCTs in the same manner will neither strengthen the evidence nor our confidence in it."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review had no dedicated funding, only 'in-kind' support from the Department of General Practice, Erasmus Medical Center, Rotterdam, Netherlands, and the Department of Health Sciences, Faculty of Sciences, Vrije Universiteit Amsterdam, Amsterdam Movement Science Research Institute, Netherlands."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2009): DOI: 10.1002/14651858.CD008112 Original review (2011): DOI: 10.1002/14651858.CD000447.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41494147/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1002/14651858.CD008112.pub3",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "d38e694c2a1f",
      "title": "GLP1-1RAs improve walking distance and reduce amputation in people with type 2 diabetes and peripheral artery disease: A systematic review and meta-analysis of randomised controlled trials and cohort studies.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49772593/118623",
      "abstract": "The aim of this systematic review and meta-analysis was to evaluate the effect of GLP-1RAs on functional walking distance and the risk of major adverse limb events (MALE) or lower extremity amputation (LEA) in people with type 2 diabetes and peripheral artery disease (PAD). We searched many electronic databases up to 10 October 2025 for randomised controlled trials (RCTs) and cohort studies. We included studies enrolling adults with type 2 diabetes and PAD, comparing GLP-1RAs against placebo or other glucose-lowering drugs. The primary outcomes were walking distance, MALE, or LEA. Data were pooled using a random-effects model, with hazard ratios (HR) or risk ratios (RR). Risk of bias was assessed using RoB2 for RCTs and ROBINS-I for cohort studies; evidence certainty was evaluated using the GRADE approach. We included seven studies (3 RCTs, 4 cohorts) enrolling 107 092 participants. The meta-analysis of two RCTs with 847 participants demonstrated a significant improvement in walking distance with liraglutide or semaglutide (HR = 1.10, 95% CI 1.05-1.15, p < 0.001), with no heterogeneity (I = 0.0%) and moderate certainty of evidence. In the additional meta-analysis of two RCTs with 3592 participants, the incidence of MALE or LEA did not differ significantly between patients receiving exenatide or semaglutide and those receiving placebo. The meta-analysis of four cohort studies with 104 292 participants showed that GLP-1RAs reduced the risk of LEA (RR = 0.53, 95% CI 0.39-0.73, p < 0.001), with high heterogeneity (I = 85.96%), totally related to one study, and very low certainty of evidence. Subgroup analyses showed a significant difference (p < 0.001) between GLP-1RA therapies, with the strongest associations with LEA reduction for tirzepatide and semaglutide (55% and 54% risk reduction, respectively); there was no difference in the LEA outcome excluding from the analysis patients with type 2 diabetes and diabetic foot ulcers at baseline. This meta-analysis suggests that GLP-1RAs are associated with a significant improvement in functional walking distance and a reduction in the risk of LEA in people with type 2 and PAD. Further dedicated RCTs are needed to confirm these limb-specific benefits of GLP-1RAs.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "The aim of this systematic review and meta-analysis was to evaluate the effect of GLP-1RAs on functional walking distance and the risk of major adverse limb events (MALE) or lower extremity amputation (LEA) in people with type 2 diabetes and peripheral artery disease (PAD)."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We searched many electronic databases up to 10 October 2025 for randomised controlled trials (RCTs) and cohort studies. We included studies enrolling adults with type 2 diabetes and PAD, comparing GLP-1RAs against placebo or other glucose-lowering drugs. The primary outcomes were walking distance, MALE, or LEA. Data were pooled using a random-effects model, with hazard ratios (HR) or risk ratios (RR). Risk of bias was assessed using RoB2 for RCTs and ROBINS-I for cohort studies; evidence certainty was evaluated using the GRADE approach."
        },
        {
          "label": "RESULTS",
          "text": "We included seven studies (3 RCTs, 4 cohorts) enrolling 107 092 participants. The meta-analysis of two RCTs with 847 participants demonstrated a significant improvement in walking distance with liraglutide or semaglutide (HR = 1.10, 95% CI 1.05-1.15, p < 0.001), with no heterogeneity (I = 0.0%) and moderate certainty of evidence. In the additional meta-analysis of two RCTs with 3592 participants, the incidence of MALE or LEA did not differ significantly between patients receiving exenatide or semaglutide and those receiving placebo. The meta-analysis of four cohort studies with 104 292 participants showed that GLP-1RAs reduced the risk of LEA (RR = 0.53, 95% CI 0.39-0.73, p < 0.001), with high heterogeneity (I = 85.96%), totally related to one study, and very low certainty of evidence. Subgroup analyses showed a significant difference (p < 0.001) between GLP-1RA therapies, with the strongest associations with LEA reduction for tirzepatide and semaglutide (55% and 54% risk reduction, respectively); there was no difference in the LEA outcome excluding from the analysis patients with type 2 diabetes and diabetic foot ulcers at baseline."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This meta-analysis suggests that GLP-1RAs are associated with a significant improvement in functional walking distance and a reduction in the risk of LEA in people with type 2 and PAD. Further dedicated RCTs are needed to confirm these limb-specific benefits of GLP-1RAs."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41508745/",
      "pubDate": "2026 Jan 08",
      "doi": "10.1111/dom.70454",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "65191aa3c2a3",
      "title": "High-Dose vs Standard-Dose Influenza Vaccine in Older Adults With Diabetes: A Secondary Analysis of the DANFLU-2 Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49772593/118614",
      "abstract": "Influenza infection poses a substantial risk of severe complications, particularly in older adults and high-risk populations, such as individuals with diabetes. The high-dose inactivated influenza vaccine (HD-IIV) has demonstrated superior efficacy against influenza infection compared with the standard-dose inactivated influenza vaccine (SD-IIV) among adults 65 years or older. However, there is limited evidence on its effectiveness in preventing severe respiratory and cardiovascular outcomes in individuals with diabetes. To investigate the relative vaccine effectiveness (rVE) of HD-IIV vs SD-IIV against severe respiratory and cardiovascular outcomes according to diabetes status and across diabetes subgroups. This was a prespecified secondary analysis of DANFLU-2, a pragmatic, open-label, individually randomized clinical trial conducted in Denmark during the 2022/2023 to 2024/2025 influenza seasons. Adults 65 years or older were eligible for inclusion regardless of comorbidities. Data were obtained from nationwide health registries and analyzed from June to October 2025. Participants were randomly allocated 1:1 to receive HD-IIV or SD-IIV. Outcomes included respiratory and cardiovascular hospitalizations. The potential effect modification by diabetes status and across diabetes subgroups was tested. Among 332 438 participants (mean [SD] age, 73.7 [5.8] years; 161 538 female individuals [48.6%]), 43 881 (13.2%) had diabetes. Overall, HD-IIV compared with SD-IIV was associated with reduced cardiorespiratory hospitalization, cardiovascular hospitalization, and influenza hospitalization. Effect estimates were similar for participants with and without diabetes for cardiorespiratory hospitalization (diabetes: rVE, 7.4%; 95% CI, -2.5% to 16.3%; no diabetes: rVE, 5.3%; 95% CI, 0.4%-10.0%; interaction P = .69), cardiovascular hospitalization (diabetes: rVE, 12.0%; 95% CI, -0.9% to 23.3%; no diabetes: rVE, 6.0%; 95% CI, -0.4% to 12.0%; interaction P = .38), and influenza hospitalization (diabetes: rVE, 41.6%; 95% CI, 5.0%-64.7%, vs no diabetes: rVE, 44.3%; 95% CI, 25.3%-58.7%; interaction P = .87). Duration of diabetes appeared to modify the effect of HD-IIV vs SD-IIV for cardiorespiratory hospitalization, with suggested benefit of HD-IIV in participants with diabetes duration longer than 5 years (rVE, 20.4%; 95% CI, 5.3%-33.1%), but not in those with shorter duration (rVE, -0.4%; 95% CI, -13.8% to 11.5%; interaction P = .03). The trial results suggest that, among adults 65 years or older, HD-IIV provided consistent benefit for cardiorespiratory, cardiovascular, and influenza hospitalizations compared with SD-IIV, regardless of diabetes status. ClinicalTrials.gov Identifier: NCT05517174.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Influenza infection poses a substantial risk of severe complications, particularly in older adults and high-risk populations, such as individuals with diabetes. The high-dose inactivated influenza vaccine (HD-IIV) has demonstrated superior efficacy against influenza infection compared with the standard-dose inactivated influenza vaccine (SD-IIV) among adults 65 years or older. However, there is limited evidence on its effectiveness in preventing severe respiratory and cardiovascular outcomes in individuals with diabetes."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate the relative vaccine effectiveness (rVE) of HD-IIV vs SD-IIV against severe respiratory and cardiovascular outcomes according to diabetes status and across diabetes subgroups."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a prespecified secondary analysis of DANFLU-2, a pragmatic, open-label, individually randomized clinical trial conducted in Denmark during the 2022/2023 to 2024/2025 influenza seasons. Adults 65 years or older were eligible for inclusion regardless of comorbidities. Data were obtained from nationwide health registries and analyzed from June to October 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomly allocated 1:1 to receive HD-IIV or SD-IIV."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Outcomes included respiratory and cardiovascular hospitalizations. The potential effect modification by diabetes status and across diabetes subgroups was tested."
        },
        {
          "label": "RESULTS",
          "text": "Among 332 438 participants (mean [SD] age, 73.7 [5.8] years; 161 538 female individuals [48.6%]), 43 881 (13.2%) had diabetes. Overall, HD-IIV compared with SD-IIV was associated with reduced cardiorespiratory hospitalization, cardiovascular hospitalization, and influenza hospitalization. Effect estimates were similar for participants with and without diabetes for cardiorespiratory hospitalization (diabetes: rVE, 7.4%; 95% CI, -2.5% to 16.3%; no diabetes: rVE, 5.3%; 95% CI, 0.4%-10.0%; interaction P = .69), cardiovascular hospitalization (diabetes: rVE, 12.0%; 95% CI, -0.9% to 23.3%; no diabetes: rVE, 6.0%; 95% CI, -0.4% to 12.0%; interaction P = .38), and influenza hospitalization (diabetes: rVE, 41.6%; 95% CI, 5.0%-64.7%, vs no diabetes: rVE, 44.3%; 95% CI, 25.3%-58.7%; interaction P = .87). Duration of diabetes appeared to modify the effect of HD-IIV vs SD-IIV for cardiorespiratory hospitalization, with suggested benefit of HD-IIV in participants with diabetes duration longer than 5 years (rVE, 20.4%; 95% CI, 5.3%-33.1%), but not in those with shorter duration (rVE, -0.4%; 95% CI, -13.8% to 11.5%; interaction P = .03)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "The trial results suggest that, among adults 65 years or older, HD-IIV provided consistent benefit for cardiorespiratory, cardiovascular, and influenza hospitalizations compared with SD-IIV, regardless of diabetes status."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05517174."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41525066/",
      "pubDate": "2026 Jan 12",
      "doi": "10.1001/jamainternmed.2025.7286",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "fe3f36b1436e",
      "title": "Online cognitive behaviour therapy for asthma-related anxiety: a randomised controlled trial.",
      "journal": "Thorax",
      "score": "6/7",
      "tags": [
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49772593/118602",
      "abstract": "Anxiety affects up to one-third of adults with asthma and is linked to poorer disease outcomes and reduced quality of life. This study evaluated the efficacy of therapist-guided, internet-delivered cognitive behavioural therapy (ICBT) versus treatment as usual plus medical education for reducing asthma-related anxiety. A randomised controlled trial was conducted including 90 adult participants with anxiety related to asthma. ICBT was therapist-guided and lasted 8 weeks. The primary outcome, the Catastrophising about Asthma Scale, was assessed from pretreatment to the primary endpoint at 16 weeks. Secondary outcomes included asthma control, avoidance behaviour and quality of life. Forced expiratory volume in 1 s (FEV) was collected using a digital spirometer. ICBT demonstrated a significantly larger reduction in catastrophising about asthma than the control group (mean difference -18.53, 95% CI -25.54 to -11.53, p<0.001). Asthma control, avoidance behaviour, quality of life and other key outcomes improved significantly more in the ICBT group compared with controls. No changes in FEV were observed. Improvements were sustained at 6 months follow-up. ICBT effectively and safely reduces catastrophising about asthma, improves asthma control, avoidance behaviour and quality of life and represents a promising adjunct to routine medical care for patients with asthma complicated by anxiety. Clinicaltrials.gov (ID: NCT04230369).",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Anxiety affects up to one-third of adults with asthma and is linked to poorer disease outcomes and reduced quality of life. This study evaluated the efficacy of therapist-guided, internet-delivered cognitive behavioural therapy (ICBT) versus treatment as usual plus medical education for reducing asthma-related anxiety."
        },
        {
          "label": "METHODS",
          "text": "A randomised controlled trial was conducted including 90 adult participants with anxiety related to asthma. ICBT was therapist-guided and lasted 8 weeks. The primary outcome, the Catastrophising about Asthma Scale, was assessed from pretreatment to the primary endpoint at 16 weeks. Secondary outcomes included asthma control, avoidance behaviour and quality of life. Forced expiratory volume in 1 s (FEV) was collected using a digital spirometer."
        },
        {
          "label": "RESULTS",
          "text": "ICBT demonstrated a significantly larger reduction in catastrophising about asthma than the control group (mean difference -18.53, 95% CI -25.54 to -11.53, p<0.001). Asthma control, avoidance behaviour, quality of life and other key outcomes improved significantly more in the ICBT group compared with controls. No changes in FEV were observed. Improvements were sustained at 6 months follow-up."
        },
        {
          "label": "CONCLUSION",
          "text": "ICBT effectively and safely reduces catastrophising about asthma, improves asthma control, avoidance behaviour and quality of life and represents a promising adjunct to routine medical care for patients with asthma complicated by anxiety."
        },
        {
          "label": "TRIAL REGISTRATION NUMBER",
          "text": "Clinicaltrials.gov (ID: NCT04230369)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41494908/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1136/thorax-2025-223886",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "2e8b86c71666",
      "title": "Comparative effectiveness of glucose monitoring methods and glycaemic control in patients with type 2 diabetes: An umbrella review.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49772593/118551",
      "abstract": "Type 2 diabetes is highly prevalent, and many adults, especially those not using insulin, struggle to reach HbA1c targets. This review aimed to evaluate the effect of self-monitoring blood glucose (SMBG) and continuous glucose monitoring (CGM) on glycaemic control in adults with type 2 diabetes. We searched MEDLINE, Cochrane Library, Embase, and Scopus from January 2014 to May 2025 for systematic reviews of randomized controlled trials enrolling adults with type 2 diabetes that evaluated SMBG or CGM versus no monitoring or SMBG, respectively. Fifteen systematic reviews comprising 81 unique studies and 23 657 participants were included. Reviews comparing SMBG with no monitoring demonstrated a modest but significant reduction in HbA1c (MD -0.23%, 95% CI -0.29 to -0.18; I = 21%). Reviews directly comparing CGM with SMBG showed greater HbA1c reduction with CGM (MD -0.29%, 95% CI -0.34 to -0.24; I = 0%). Subgroup analyses for SMBG indicated consistent benefits across follow-up duration, monitoring structure, and study quality, although heterogeneity was high in some comparisons. Subgroup analyses for CGM types found both isCGM/FGM (MD -0.27%, 95% CI -0.43 to -0.11) and rtCGM (MD -0.36%, 95% CI -0.45 to -0.27) superior to SMBG. These findings support glucose monitoring for optimizing glycaemic management and outcomes. Further investment in cost-effectiveness studies is warranted to assess broader implementation in this population.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41457339/",
      "pubDate": "2025 Dec 28",
      "doi": "10.1111/dom.70401",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "4e4ff9df1160",
      "title": "Predictive and Prognostic Performance of the Phoenix Sepsis Criteria and Phoenix Sepsis Score in PICU Patients With Suspected Infection: A Multicenter Prospective Study.",
      "journal": "Crit Care Med",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49753606/118626",
      "abstract": "Evaluate the predictive and prognostic performance of the Phoenix Sepsis Criteria (PSC) and Phoenix Sepsis Score (PSS) compared with International Pediatric Sepsis Consensus Conference (IPSCC) criteria and other organ dysfunction scores in children admitted to the PICU with suspected infection. Multicenter, prospective cohort study. Eight PICUs within the Italian Network of PICU Study Group (TIPNet). Patients younger than 18 years admitted with suspected infection (from February 2022 to April 2024). None. Vital signs, organ dysfunction markers, and organ support requirements were collected during day 1 and day 2 of PICU admission. Sepsis was assessed using IPSCC criteria and PSC. IPSCC Severe Sepsis, PSS, Phoenix-8, Pediatric Logistic Organ Dysfunction-2 (PELOD-2), pediatric Sequential Organ Failure Assessment, and Pediatric Multiple Organ Dysfunction Score were calculated as organ dysfunction scores. Sepsis criteria predictive performance was assessed using sensitivity and positive predictive value (PPV). Organ dysfunction scores prognostic performance was assessed using the area under the precision-recall curve (AUPRC). Primary outcome was PICU mortality. Among 687 patients, PSC showed higher predictive performance than IPSCC sepsis criteria, with improved sensitivity and PPV for mortality on day 1 (PSC: sensitivity, 96.4%; 95% CI, 95.0-97.8%; PPV, 7.6%; 95% CI, 5.6-9.6% and IPSCC: sensitivity, 82.1%; 95% CI, 79.3-85.0%; PPV, 6.2%; 95% CI, 4.4-8.0%) and day 2 (PSC: sensitivity, 100.0%; 95% CI, 100.0-100.0%; PPV, 10.0%; 95% CI, 7.6-12.5% and IPSCC: sensitivity, 75.0%; 95% CI, 71.5-78.5%; PPV, 9.0%; 95% CI, 6.7-11.3%). PELOD-2 exhibited the highest AUPRC for mortality (day 1, 0.45; 95% CI, 0.26-0.63 and day 2, 0.59; 95% CI, 0.38-0.77). IPSCC Severe Sepsis score was outperformed by all other organ dysfunction scores, including PSS and Phoenix-8. All prognostic performances improved from day 1 to day 2. PSC and PSS performed superior to IPSCC criteria in diagnosing and prognosticating pediatric sepsis, with improved performance at day 2 of PICU admission. This study first validated PSC and PSS in a European cohort.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "Evaluate the predictive and prognostic performance of the Phoenix Sepsis Criteria (PSC) and Phoenix Sepsis Score (PSS) compared with International Pediatric Sepsis Consensus Conference (IPSCC) criteria and other organ dysfunction scores in children admitted to the PICU with suspected infection."
        },
        {
          "label": "DESIGN",
          "text": "Multicenter, prospective cohort study."
        },
        {
          "label": "SETTING",
          "text": "Eight PICUs within the Italian Network of PICU Study Group (TIPNet)."
        },
        {
          "label": "PATIENTS",
          "text": "Patients younger than 18 years admitted with suspected infection (from February 2022 to April 2024)."
        },
        {
          "label": "INTERVENTIONS",
          "text": "None."
        },
        {
          "label": "MEASUREMENTS AND MAIN RESULTS",
          "text": "Vital signs, organ dysfunction markers, and organ support requirements were collected during day 1 and day 2 of PICU admission. Sepsis was assessed using IPSCC criteria and PSC. IPSCC Severe Sepsis, PSS, Phoenix-8, Pediatric Logistic Organ Dysfunction-2 (PELOD-2), pediatric Sequential Organ Failure Assessment, and Pediatric Multiple Organ Dysfunction Score were calculated as organ dysfunction scores. Sepsis criteria predictive performance was assessed using sensitivity and positive predictive value (PPV). Organ dysfunction scores prognostic performance was assessed using the area under the precision-recall curve (AUPRC). Primary outcome was PICU mortality. Among 687 patients, PSC showed higher predictive performance than IPSCC sepsis criteria, with improved sensitivity and PPV for mortality on day 1 (PSC: sensitivity, 96.4%; 95% CI, 95.0-97.8%; PPV, 7.6%; 95% CI, 5.6-9.6% and IPSCC: sensitivity, 82.1%; 95% CI, 79.3-85.0%; PPV, 6.2%; 95% CI, 4.4-8.0%) and day 2 (PSC: sensitivity, 100.0%; 95% CI, 100.0-100.0%; PPV, 10.0%; 95% CI, 7.6-12.5% and IPSCC: sensitivity, 75.0%; 95% CI, 71.5-78.5%; PPV, 9.0%; 95% CI, 6.7-11.3%). PELOD-2 exhibited the highest AUPRC for mortality (day 1, 0.45; 95% CI, 0.26-0.63 and day 2, 0.59; 95% CI, 0.38-0.77). IPSCC Severe Sepsis score was outperformed by all other organ dysfunction scores, including PSS and Phoenix-8. All prognostic performances improved from day 1 to day 2."
        },
        {
          "label": "CONCLUSIONS",
          "text": "PSC and PSS performed superior to IPSCC criteria in diagnosing and prognosticating pediatric sepsis, with improved performance at day 2 of PICU admission. This study first validated PSC and PSS in a European cohort."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41532812/",
      "pubDate": "2026 Jan 14",
      "doi": "10.1097/CCM.0000000000007034",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "d3bc5a51ed19",
      "title": "The impact of skin tone on performance of pulse oximeters used by NHS England COVID Oximetry @home scheme: measurement and diagnostic accuracy study.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49753606/118621",
      "abstract": "To assess the impact of skin tone on the measurement and diagnostic accuracy of five fingertip pulse oximeters used by patients in the NHS (National Health Service) England COVID Oximetry @home scheme. Measurement and diagnostic accuracy study (exploring pulse oximeter accuracy across skin tones-EXAKT). Twenty four intensive care units in England between June 2022 and August 2024. 903 critically ill adults admitted to intensive care units screened for or enrolled into a trial evaluating different approaches to oxygen therapy. Pulse oximetry derived peripheral oxygen saturation (SpO) measurements were compared with paired arterial oxygen saturation (SaO) measurements from arterial blood analysed by co-oximetry (gold standard). Skin tone (individual typology angle) was objectively measured using a handheld spectrophotometer. Pulse oximeter measurement accuracy was assessed for bias, precision, and overall accuracy. Diagnostic accuracy for identifying SaO ≤92% was assessed by false negative and false positive rates for SpO using thresholds of ≤92% and ≤94%, and the area under the receiver operating characteristic curve, and by the presence of occult hypoxaemia (SaO <88% with SpO >92%). 11 018 paired SpO-SaO measurements were analysed. All tested pulse oximeters overestimated at lower values and underestimated at higher values of SaO. On average, SpO readings were 0.6-1.5 percentage points higher for patients with darker skin tone (individual typology angle -44°) than for those with lighter skin tone (46°). At both SpO thresholds assessed, false negative rates increased with darker skin tones; the proportion of SpO measurements >94% despite a paired SaO ≤92% ranged from 5.3 to 35.3 percentage points higher for patients with darker skin tones than for those with lighter skin tones (7.6-62.2%  1.2-26.9%, rate ratio 2.3-7.1). By contrast, false positive rates decreased with darker skin tones. Five pulse oximeters provided by the NHS England COVID Oximetry @home scheme yielded higher SpO measurements for patients with darker skin tones compared with those with lighter skin tones, which could translate into potentially clinically important differences in false negative and false positive rates for detecting hypoxaemia. ClinicalTrials.gov NCT05481515.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To assess the impact of skin tone on the measurement and diagnostic accuracy of five fingertip pulse oximeters used by patients in the NHS (National Health Service) England COVID Oximetry @home scheme."
        },
        {
          "label": "DESIGN",
          "text": "Measurement and diagnostic accuracy study (exploring pulse oximeter accuracy across skin tones-EXAKT)."
        },
        {
          "label": "SETTING",
          "text": "Twenty four intensive care units in England between June 2022 and August 2024."
        },
        {
          "label": "PARTICIPANTS",
          "text": "903 critically ill adults admitted to intensive care units screened for or enrolled into a trial evaluating different approaches to oxygen therapy."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Pulse oximetry derived peripheral oxygen saturation (SpO) measurements were compared with paired arterial oxygen saturation (SaO) measurements from arterial blood analysed by co-oximetry (gold standard). Skin tone (individual typology angle) was objectively measured using a handheld spectrophotometer."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Pulse oximeter measurement accuracy was assessed for bias, precision, and overall accuracy. Diagnostic accuracy for identifying SaO ≤92% was assessed by false negative and false positive rates for SpO using thresholds of ≤92% and ≤94%, and the area under the receiver operating characteristic curve, and by the presence of occult hypoxaemia (SaO <88% with SpO >92%)."
        },
        {
          "label": "RESULTS",
          "text": "11 018 paired SpO-SaO measurements were analysed. All tested pulse oximeters overestimated at lower values and underestimated at higher values of SaO. On average, SpO readings were 0.6-1.5 percentage points higher for patients with darker skin tone (individual typology angle -44°) than for those with lighter skin tone (46°). At both SpO thresholds assessed, false negative rates increased with darker skin tones; the proportion of SpO measurements >94% despite a paired SaO ≤92% ranged from 5.3 to 35.3 percentage points higher for patients with darker skin tones than for those with lighter skin tones (7.6-62.2%  1.2-26.9%, rate ratio 2.3-7.1). By contrast, false positive rates decreased with darker skin tones."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Five pulse oximeters provided by the NHS England COVID Oximetry @home scheme yielded higher SpO measurements for patients with darker skin tones compared with those with lighter skin tones, which could translate into potentially clinically important differences in false negative and false positive rates for detecting hypoxaemia."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov NCT05481515."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41534914/",
      "pubDate": "2026 Jan 14",
      "doi": "10.1136/bmj-2025-085535",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "787aca8ad111",
      "title": "Enhancing Medication Adherence in Older Adults: A Systematic Review of Evidence-Based Strategies.",
      "journal": "J Am Geriatr Soc",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49753606/118553",
      "abstract": "Medication adherence is essential for achieving favorable health outcomes, particularly in older adults with multiple chronic conditions. This systematic review critically appraised current evidence on interventions aimed at enhancing medication adherence in older adults. Literature searches were performed in PubMed/MedLine, EMBASE, and Web of Science for articles published up to December 31, 2024. We identified peer-reviewed studies assessing interventions to improve medication adherence in older adults (≥ 60 years). The primary outcome was intervention effectiveness; secondary outcomes were clinical parameters, disease control, health-related quality of life, rehospitalization rates, event rates, mortality rates, feasibility, acceptability or satisfaction levels, and overall costs or cost-effectiveness. A total of 128 studies was included: 96 randomized controlled trials (RCTs), 16 pre-post studies, 9 non-RCTs, and 7 longitudinal evaluations. The majority (51.2%) was implemented in primary care. An educational component was present in 56.3% of interventions, a technical component in 47.6%, and an attitudinal component in 32.0%. Only 3.2% of interventions included rewards. Various healthcare professionals, such as pharmacists, nurses, and physicians, were involved in delivering interventions. Most studies reported improved adherence, though some factors, such as high baseline adherence, insufficient intervention intensity, and brief follow-up limited the effectiveness. Secondary outcomes often included improvements in disease knowledge, patient satisfaction, quality of life, and clinical indicators like blood pressure and HbA1c levels. Despite most studies showed a positive impact on adherence, a high heterogeneity was highlighted, and effectiveness was mainly observed in the short term.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Medication adherence is essential for achieving favorable health outcomes, particularly in older adults with multiple chronic conditions."
        },
        {
          "label": "OBJECTIVE",
          "text": "This systematic review critically appraised current evidence on interventions aimed at enhancing medication adherence in older adults."
        },
        {
          "label": "METHODS",
          "text": "Literature searches were performed in PubMed/MedLine, EMBASE, and Web of Science for articles published up to December 31, 2024. We identified peer-reviewed studies assessing interventions to improve medication adherence in older adults (≥ 60 years). The primary outcome was intervention effectiveness; secondary outcomes were clinical parameters, disease control, health-related quality of life, rehospitalization rates, event rates, mortality rates, feasibility, acceptability or satisfaction levels, and overall costs or cost-effectiveness."
        },
        {
          "label": "RESULTS",
          "text": "A total of 128 studies was included: 96 randomized controlled trials (RCTs), 16 pre-post studies, 9 non-RCTs, and 7 longitudinal evaluations. The majority (51.2%) was implemented in primary care. An educational component was present in 56.3% of interventions, a technical component in 47.6%, and an attitudinal component in 32.0%. Only 3.2% of interventions included rewards. Various healthcare professionals, such as pharmacists, nurses, and physicians, were involved in delivering interventions. Most studies reported improved adherence, though some factors, such as high baseline adherence, insufficient intervention intensity, and brief follow-up limited the effectiveness. Secondary outcomes often included improvements in disease knowledge, patient satisfaction, quality of life, and clinical indicators like blood pressure and HbA1c levels."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Despite most studies showed a positive impact on adherence, a high heterogeneity was highlighted, and effectiveness was mainly observed in the short term."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41467772/",
      "pubDate": "2025 Dec 30",
      "doi": "10.1111/jgs.70257",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "36dae6de0b55",
      "title": "Age-Adjusted D-Dimer Cutoff Levels to Rule Out Deep Vein Thrombosis.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49753606/118535",
      "abstract": "The age-adjusted D-dimer cutoff (age × 10 µg/L in patients 50 years or older), safely increases the diagnostic yield of D-dimer in patients with suspected pulmonary embolism but has not been validated in patients with suspected leg deep vein thrombosis (DVT). To prospectively validate whether using an age-adjusted D-dimer cutoff allows clinicians to safely rule out DVT. Multicenter, multinational prospective management outcome study conducted in 27 centers in Belgium, Canada, France, and Switzerland between January 2015 and October 2022 (last follow-up visit, January 30, 2023) and including outpatients presenting to the emergency department with suspected DVT. Patients were assessed by a sequential diagnostic strategy based on the assessment of clinical pretest probability by the Wells score, a highly sensitive D-dimer test, and leg compression ultrasonography. Patients in whom DVT was ruled out were followed up for a 3-month period. The primary outcome was the rate of adjudicated symptomatic venous thromboembolic events during follow-up in patients in whom DVT was ruled out based on a D-dimer value between the conventional cutoff of 500 µg/L and their age-adjusted cutoff. A total of 3205 patients were included. Median age was 59 years, and 1737 (54%) were female. DVT prevalence was 14%. Among the 2169 patients with a non-high or unlikely clinical probability, 531 (24.5% [95% CI, 22.7%-26.4%]) had a D-dimer level less than 500 µg/L, and 161 additional patients (7.4% [95% CI, 6.4%-8.6%]) had a D-dimer level between 500 µg/L and their age-adjusted cutoff. No failures were identified in patients with a D-dimer level 500 µg/L or greater but below the age-adjusted cutoff (0% [95% CI, 0%-2.3%]). Among patients 75 years or older, using the age-adjusted cutoff instead of the 500-µg/L cutoff increased the proportion of negative D-dimer from 33 of 379 (8.7% [95% CI, 6.3%-12.0%]) to 99 of 379 (26.1% [95% CI, 22.0%-30.8%]), without any false-negative test results. The age-adjusted D-dimer cutoff may safely rule out DVT and was associated with a larger number of patients in whom DVT could be effectively ruled out. ClinicalTrials.gov Identifier: NCT02384135.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The age-adjusted D-dimer cutoff (age × 10 µg/L in patients 50 years or older), safely increases the diagnostic yield of D-dimer in patients with suspected pulmonary embolism but has not been validated in patients with suspected leg deep vein thrombosis (DVT)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To prospectively validate whether using an age-adjusted D-dimer cutoff allows clinicians to safely rule out DVT."
        },
        {
          "label": "DESIGN, SETTING, AND PATIENTS",
          "text": "Multicenter, multinational prospective management outcome study conducted in 27 centers in Belgium, Canada, France, and Switzerland between January 2015 and October 2022 (last follow-up visit, January 30, 2023) and including outpatients presenting to the emergency department with suspected DVT."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were assessed by a sequential diagnostic strategy based on the assessment of clinical pretest probability by the Wells score, a highly sensitive D-dimer test, and leg compression ultrasonography. Patients in whom DVT was ruled out were followed up for a 3-month period."
        },
        {
          "label": "MAIN OUTCOME AND MEASURE",
          "text": "The primary outcome was the rate of adjudicated symptomatic venous thromboembolic events during follow-up in patients in whom DVT was ruled out based on a D-dimer value between the conventional cutoff of 500 µg/L and their age-adjusted cutoff."
        },
        {
          "label": "RESULTS",
          "text": "A total of 3205 patients were included. Median age was 59 years, and 1737 (54%) were female. DVT prevalence was 14%. Among the 2169 patients with a non-high or unlikely clinical probability, 531 (24.5% [95% CI, 22.7%-26.4%]) had a D-dimer level less than 500 µg/L, and 161 additional patients (7.4% [95% CI, 6.4%-8.6%]) had a D-dimer level between 500 µg/L and their age-adjusted cutoff. No failures were identified in patients with a D-dimer level 500 µg/L or greater but below the age-adjusted cutoff (0% [95% CI, 0%-2.3%]). Among patients 75 years or older, using the age-adjusted cutoff instead of the 500-µg/L cutoff increased the proportion of negative D-dimer from 33 of 379 (8.7% [95% CI, 6.3%-12.0%]) to 99 of 379 (26.1% [95% CI, 22.0%-30.8%]), without any false-negative test results."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "The age-adjusted D-dimer cutoff may safely rule out DVT and was associated with a larger number of patients in whom DVT could be effectively ruled out."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT02384135."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41490105/",
      "pubDate": "2026 Jan 05",
      "doi": "10.1001/jama.2025.21561",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "c374b3fbad82",
      "title": "Effects of lifestyle interventions in pregnancy on gestational diabetes: individual participant data and network meta-analysis.",
      "journal": "BMJ",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49753606/118534",
      "abstract": "To assess the effects of lifestyle interventions on gestational diabetes, determine whether the effects vary by maternal body mass index, age, parity, ethnicity, education level, or intervention, and rank interventions by effectiveness. Individual participant data (IPD) and network meta-analysis. Major electronic databases (January 1990 to April 2025). This meta-analysis included randomised trials on the effects of lifestyle interventions (physical activity based, diet based, or mixed) in pregnancy on gestational diabetes. Main outcomes were gestational diabetes defined by any criteria and by UK NICE (National Institute for Health and Care Excellence) criteria; other outcomes included IADPSG (International Association of Diabetes in Pregnancy Study Group) and modified IADPSG defined gestational diabetes. A two stage IPD meta-analysis estimated summary odds ratios and 95% confidence intervals and interactions (subgroup effects), along with absolute risk reduction estimates. Aggregate data from non-IPD trials were added to the meta-analysis when possible. Intervention effects were ranked using network meta-analysis. 104 randomised trials (35 993 women) were included, with IPD for 68% of participants (24 391 women; 54 studies). Lifestyle interventions reduced gestational diabetes defined by any criteria by 10% in IPD trials (odds ratio 0.90, 95% confidence interval (CI) 0.80 to 1.02; absolute risk reduction 1.3%, 95% CI -0.3% to 2.6%), and by 20% when combining IPD and non-IPD trials (odds ratio 0.80, 95% CI 0.73 to 0.88; absolute risk reduction 2.6%, 95% CI 1.6% to 3.6%), and no reduction was observed using NICE criteria (odds ratio 0.98, 95% CI 0.84to 1.13). Lifestyle interventions reduced gestational diabetes defined using IADPSG criteria by 14% in IPD trials (odds ratio 0.86, 95% CI 0.75 to 0.97; absolute risk reduction 2.7%, 95% CI 0.6% to 5.0%) and by 18% when combining IPD and non-IPD trials (odds ratio 0.82, 95% CI 0.72 to 0.93; absolute risk reduction 3.5%, 95% CI 1.3% to 5.7%). Effects did not vary by maternal characteristics, except for education. Although women of all educational levels benefited from the intervention, the benefit was less in those with low education (low  middle interaction: odds ratio 0.68, 95% CI 0.51 to 0.90; low  high interaction: odds ratio 0.71, 95% CI 0.54 to 0.93). Benefits did not vary by intervention characteristics, except for greater effectiveness with group format (odds ratio 0.81, 95% CI 0.68 to 0.97; absolute risk reduction 2.5%, 95% CI 0.4% to 4.3%) and newly trained facilitators (odds ratio 0.82, 95% CI 0.69 to 0.96; absolute risk reduction 2.4%, 95% CI 0.5% to 4.2%). Physical activity based interventions ranked highest (mean rank 1.1, 95% CI 1 to 2) in preventing gestational diabetes. Lifestyle interventions in pregnancy are likely to prevent gestational diabetes, with effects varying according to diagnostic criteria. Implementation strategies should address inequalities by maternal education, and consider group formats, provider training, and physical activity based interventions to prevent gestational diabetes. PROSPERO CRD42020212884.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of lifestyle interventions on gestational diabetes, determine whether the effects vary by maternal body mass index, age, parity, ethnicity, education level, or intervention, and rank interventions by effectiveness."
        },
        {
          "label": "DESIGN",
          "text": "Individual participant data (IPD) and network meta-analysis."
        },
        {
          "label": "DATA SOURCES",
          "text": "Major electronic databases (January 1990 to April 2025)."
        },
        {
          "label": "METHODS",
          "text": "This meta-analysis included randomised trials on the effects of lifestyle interventions (physical activity based, diet based, or mixed) in pregnancy on gestational diabetes. Main outcomes were gestational diabetes defined by any criteria and by UK NICE (National Institute for Health and Care Excellence) criteria; other outcomes included IADPSG (International Association of Diabetes in Pregnancy Study Group) and modified IADPSG defined gestational diabetes. A two stage IPD meta-analysis estimated summary odds ratios and 95% confidence intervals and interactions (subgroup effects), along with absolute risk reduction estimates. Aggregate data from non-IPD trials were added to the meta-analysis when possible. Intervention effects were ranked using network meta-analysis."
        },
        {
          "label": "RESULTS",
          "text": "104 randomised trials (35 993 women) were included, with IPD for 68% of participants (24 391 women; 54 studies). Lifestyle interventions reduced gestational diabetes defined by any criteria by 10% in IPD trials (odds ratio 0.90, 95% confidence interval (CI) 0.80 to 1.02; absolute risk reduction 1.3%, 95% CI -0.3% to 2.6%), and by 20% when combining IPD and non-IPD trials (odds ratio 0.80, 95% CI 0.73 to 0.88; absolute risk reduction 2.6%, 95% CI 1.6% to 3.6%), and no reduction was observed using NICE criteria (odds ratio 0.98, 95% CI 0.84to 1.13). Lifestyle interventions reduced gestational diabetes defined using IADPSG criteria by 14% in IPD trials (odds ratio 0.86, 95% CI 0.75 to 0.97; absolute risk reduction 2.7%, 95% CI 0.6% to 5.0%) and by 18% when combining IPD and non-IPD trials (odds ratio 0.82, 95% CI 0.72 to 0.93; absolute risk reduction 3.5%, 95% CI 1.3% to 5.7%). Effects did not vary by maternal characteristics, except for education. Although women of all educational levels benefited from the intervention, the benefit was less in those with low education (low  middle interaction: odds ratio 0.68, 95% CI 0.51 to 0.90; low  high interaction: odds ratio 0.71, 95% CI 0.54 to 0.93). Benefits did not vary by intervention characteristics, except for greater effectiveness with group format (odds ratio 0.81, 95% CI 0.68 to 0.97; absolute risk reduction 2.5%, 95% CI 0.4% to 4.3%) and newly trained facilitators (odds ratio 0.82, 95% CI 0.69 to 0.96; absolute risk reduction 2.4%, 95% CI 0.5% to 4.2%). Physical activity based interventions ranked highest (mean rank 1.1, 95% CI 1 to 2) in preventing gestational diabetes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Lifestyle interventions in pregnancy are likely to prevent gestational diabetes, with effects varying according to diagnostic criteria. Implementation strategies should address inequalities by maternal education, and consider group formats, provider training, and physical activity based interventions to prevent gestational diabetes."
        },
        {
          "label": "STUDY REGISTRATION",
          "text": "PROSPERO CRD42020212884."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41494781/",
      "pubDate": "2026 Jan 06",
      "doi": "10.1136/bmj-2025-084159",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "d5e5a02da35e",
      "title": "Impact of rapid nucleic acid amplification tests for tuberculosis on patient outcomes.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49753606/118500",
      "abstract": "The World Health Organization (WHO) recommends rapid nucleic acid amplification tests (NAATs), such as Xpert MTB/RIF Ultra, as the initial diagnostic test for tuberculosis (TB). However, the effect of these tests on key health outcomes is not well-established. To assess the effects of three classes of rapid NAATs-low-complexity automated (LC-aNAATs), low-complexity manual (LC-mNAATs) and moderate-complexity automated (MC-aNAATs)-compared with smear microscopy or bacterial culture on patient outcomes in people investigated for TB, irrespective of age or disease severity. Our secondary objective was to assess the effects of the three classes of rapid NAATs in vulnerable populations such as children and people living with HIV, to inform health equity considerations. We searched Cochrane CENTRAL, MEDLINE, Embase, five other electronic bibliographic databases, and two trial registries, from 1900 up to 21 January 2025. We also checked reference lists of included articles and relevant systematic reviews to identify additional studies. We contacted manufacturers, researchers, and experts working on new diagnostic tests for TB through a WHO public call for data, which lasted from 30 November 2023 to 15 February 2024. We included randomised controlled trials (RCTs) that involved children and adults of any age who were suspected to have TB (i.e. 'presumptive TB'). We included both individually randomised and cluster-randomised designs. In terms of the intervention, we considered \"design-locked, marketed test technologies\" (i.e. testing technologies with designs that have been finalised and are currently being sold or promoted in the healthcare market) by class and tests provided by the WHO: LC-aNAATs (e.g. Xpert MTB/RIF Ultra, Truenat MTB Plus, Truenat MTB-RIF Dx); LC-mNAATs (e.g. TB-LAMP); and MC-aNAATs (e.g. FluoroType XDR-TB). We restricted comparative strategies to smear microscopy and bacterial culture methods. We excluded studies on standard Xpert MTB/RIF, which has been superseded by the Xpert MTB/RIF Ultra test. Our critical outcomes were all-cause mortality from the time of the first diagnostic test to the end of the trial follow-up, and cure rates among people with bacteriologically-confirmed TB at the beginning of treatment and who completed treatment with no evidence of failure. Our important outcomes were the proportion of participants lost to follow-up, time to TB diagnosis, and time to treatment initiation. Two review authors independently assessed the risk of bias for all reported outcomes in the included studies using the revised Cochrane risk of bias tool (RoB 2). Disagreements were resolved through discussion or by consulting a senior review author as needed. We could not combine the results statistically because the included studies measured, defined, or reported outcomes differently. As a result, we presented the findings from each study in tables, forest plots, and using narrative descriptions. We used GRADE to assess the certainty of evidence for each outcome using GRADEpro GDT software. Of the 2231 records identified by our search, we included two trials (reported in three articles) in the review. The trials compared an LC-aNAAT (Xpert MTB/RIF Ultra) with smear microscopy and involved 11,228 adults aged 18 years and above. One was an individually randomised trial and one was cluster-randomised. Both trials were conducted in Africa (one in South Africa and the other in Uganda). One trial assessed all-cause mortality at six and 18 months, loss-to-follow-up, and the time taken to diagnose TB, while the other assessed the time taken to initiate treatment. Whether Xpert MTB/RIF Ultra or smear microscopy was used to detect TB made little to no difference to all-cause mortality at six months (risk ratio 0.79, 95% CI 0.61 to 1.01; 1 RCT, 8116 participants; high-certainty evidence) and 18 months (adjusted rate ratio 0.77, 95% confidence interval (CI) 0.46 to 1.29; 1 RCT, 8413 participants; high-certainty evidence). Neither study assessed how the test used affects the likelihood of curing TB. One trial (XPEL-TB 2021) reported a slightly higher risk of loss to follow-up with Xpert MTB/RIF Ultra (13.6%) than with smear microscopy (10.1%), with a risk ratio of 1.35 (95% CI 1.20 to 1.51; 1 RCT, 9563 participants; high-certainty evidence). A testing strategy that includes Xpert MTB/RIF Ultra probably results in a reduction in time to diagnosis (adjusted geometric mean ratio 0.49, 95% CI 0.39 to 0.62; 1 RCT, 10,644 participants; moderate-certainty evidence), and a similar reduction in time to treatment (adjusted geometric mean ratio 0.35, 95% CI 0.21 to 0.58; 1 RCT, 10,644 participants; hazard ratio 3.00, 95% CI 1.18 to 7.60; 1 RCT, 584 participants; moderate-certainty evidence). The evidence in this review is limited by sparse data, a lack of some key outcomes (specifically, cure), the use of varied effect measures, and the exclusion of paediatric populations. While we graded the evidence as moderate certainty for time to diagnosis and treatment initiation, serious concerns about the risk of bias and the narrow scope restrict the applicability and generalisability of the evidence to other NAATs and patient outcomes. Based on limited evidence from two trials that compared Xpert MTB/RIF Ultra to smear microscopy, the use of Xpert MTB/RIF Ultra to test for TB makes little to no difference to all-cause mortality at six and 18 months. Xpert MTB/RIF Ultra probably decreases the time taken to diagnose TB and time to treatment initiation. The use of Xpert MTB/RIF Ultra increases the risk of loss to follow-up compared with smear microscopy. There were no data on the effects of Xpert MTB/RIF Ultra compared with smear microscopy or culture on tuberculosis cure rates. This Cochrane review was funded by the World Health Organization (WHO). The protocol is available via the Open Science Framework registry at https://osf.io/puax2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "The World Health Organization (WHO) recommends rapid nucleic acid amplification tests (NAATs), such as Xpert MTB/RIF Ultra, as the initial diagnostic test for tuberculosis (TB). However, the effect of these tests on key health outcomes is not well-established."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of three classes of rapid NAATs-low-complexity automated (LC-aNAATs), low-complexity manual (LC-mNAATs) and moderate-complexity automated (MC-aNAATs)-compared with smear microscopy or bacterial culture on patient outcomes in people investigated for TB, irrespective of age or disease severity. Our secondary objective was to assess the effects of the three classes of rapid NAATs in vulnerable populations such as children and people living with HIV, to inform health equity considerations."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched Cochrane CENTRAL, MEDLINE, Embase, five other electronic bibliographic databases, and two trial registries, from 1900 up to 21 January 2025. We also checked reference lists of included articles and relevant systematic reviews to identify additional studies. We contacted manufacturers, researchers, and experts working on new diagnostic tests for TB through a WHO public call for data, which lasted from 30 November 2023 to 15 February 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) that involved children and adults of any age who were suspected to have TB (i.e. 'presumptive TB'). We included both individually randomised and cluster-randomised designs. In terms of the intervention, we considered \"design-locked, marketed test technologies\" (i.e. testing technologies with designs that have been finalised and are currently being sold or promoted in the healthcare market) by class and tests provided by the WHO: LC-aNAATs (e.g. Xpert MTB/RIF Ultra, Truenat MTB Plus, Truenat MTB-RIF Dx); LC-mNAATs (e.g. TB-LAMP); and MC-aNAATs (e.g. FluoroType XDR-TB). We restricted comparative strategies to smear microscopy and bacterial culture methods. We excluded studies on standard Xpert MTB/RIF, which has been superseded by the Xpert MTB/RIF Ultra test."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality from the time of the first diagnostic test to the end of the trial follow-up, and cure rates among people with bacteriologically-confirmed TB at the beginning of treatment and who completed treatment with no evidence of failure. Our important outcomes were the proportion of participants lost to follow-up, time to TB diagnosis, and time to treatment initiation."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors independently assessed the risk of bias for all reported outcomes in the included studies using the revised Cochrane risk of bias tool (RoB 2). Disagreements were resolved through discussion or by consulting a senior review author as needed."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We could not combine the results statistically because the included studies measured, defined, or reported outcomes differently. As a result, we presented the findings from each study in tables, forest plots, and using narrative descriptions. We used GRADE to assess the certainty of evidence for each outcome using GRADEpro GDT software."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Of the 2231 records identified by our search, we included two trials (reported in three articles) in the review. The trials compared an LC-aNAAT (Xpert MTB/RIF Ultra) with smear microscopy and involved 11,228 adults aged 18 years and above. One was an individually randomised trial and one was cluster-randomised. Both trials were conducted in Africa (one in South Africa and the other in Uganda). One trial assessed all-cause mortality at six and 18 months, loss-to-follow-up, and the time taken to diagnose TB, while the other assessed the time taken to initiate treatment."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Whether Xpert MTB/RIF Ultra or smear microscopy was used to detect TB made little to no difference to all-cause mortality at six months (risk ratio 0.79, 95% CI 0.61 to 1.01; 1 RCT, 8116 participants; high-certainty evidence) and 18 months (adjusted rate ratio 0.77, 95% confidence interval (CI) 0.46 to 1.29; 1 RCT, 8413 participants; high-certainty evidence). Neither study assessed how the test used affects the likelihood of curing TB. One trial (XPEL-TB 2021) reported a slightly higher risk of loss to follow-up with Xpert MTB/RIF Ultra (13.6%) than with smear microscopy (10.1%), with a risk ratio of 1.35 (95% CI 1.20 to 1.51; 1 RCT, 9563 participants; high-certainty evidence). A testing strategy that includes Xpert MTB/RIF Ultra probably results in a reduction in time to diagnosis (adjusted geometric mean ratio 0.49, 95% CI 0.39 to 0.62; 1 RCT, 10,644 participants; moderate-certainty evidence), and a similar reduction in time to treatment (adjusted geometric mean ratio 0.35, 95% CI 0.21 to 0.58; 1 RCT, 10,644 participants; hazard ratio 3.00, 95% CI 1.18 to 7.60; 1 RCT, 584 participants; moderate-certainty evidence). The evidence in this review is limited by sparse data, a lack of some key outcomes (specifically, cure), the use of varied effect measures, and the exclusion of paediatric populations. While we graded the evidence as moderate certainty for time to diagnosis and treatment initiation, serious concerns about the risk of bias and the narrow scope restrict the applicability and generalisability of the evidence to other NAATs and patient outcomes."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Based on limited evidence from two trials that compared Xpert MTB/RIF Ultra to smear microscopy, the use of Xpert MTB/RIF Ultra to test for TB makes little to no difference to all-cause mortality at six and 18 months. Xpert MTB/RIF Ultra probably decreases the time taken to diagnose TB and time to treatment initiation. The use of Xpert MTB/RIF Ultra increases the risk of loss to follow-up compared with smear microscopy. There were no data on the effects of Xpert MTB/RIF Ultra compared with smear microscopy or culture on tuberculosis cure rates."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review was funded by the World Health Organization (WHO)."
        },
        {
          "label": "REGISTRATION",
          "text": "The protocol is available via the Open Science Framework registry at https://osf.io/puax2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41410210/",
      "pubDate": "2025 Dec 18",
      "doi": "10.1002/14651858.CD016194",
      "dateReceived": "2026-01-28T23:34:19.513Z",
      "isNew": false
    },
    {
      "id": "dbeed4bfe1ff",
      "title": "Natural ovulation versus programmed regimens before frozen embryo transfer in ovulatory women: multicentre, randomised clinical trial.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49847437/118663",
      "abstract": "To test the hypothesis that women assigned to a natural ovulation regimen before frozen embryo transfer compared with a programmed regimen would have an increased chance of a healthy live birth and a reduced risk of pre-eclampsia or eclampsia. Multicentre, randomised, parallel group, assessor blinded clinical trial. 24 academic fertility centres in China. 4376 ovulatory women (aged 20-40 years) planning to undergo a frozen single blastocyst transfer. Eligible participants were randomised (1:1) to receive a natural ovulation regimen or a programmed regimen of hormone replacement for endometrial preparation. Endometrial preparation and frozen embryo transfer timing were determined in the natural ovulation regimen group by monitoring natural follicle development and measuring serum levels of luteinising hormone, oestradiol, and progesterone. In the programmed regimen group, endometrial preparation was achieved by sequential administration of oestrogen and progesterone. Primary outcomes were a healthy live birth and pre-eclampsia or eclampsia after a frozen embryo transfer. Secondary outcomes were cycle cancellation, biochemical pregnancy, clinical pregnancy, ongoing pregnancy, pregnancy loss, ectopic pregnancy, live birth, birth weight, and maternal, fetal, and neonatal complications. In the intention-to-treat analyses, 910 (41.6%) of 2185 patients in the natural ovulation regimen group and 890 (40.6%) of 2191 in the programmed regimen group achieved a healthy live birth (relative ratio 1.03 (95% confidence interval (CI) 0.96 to 1.10); P=0.49). The risk of pre-eclampsia was lower in the natural ovulation regimen group among patients who achieved clinical pregnancy than in the programmed regimen group (2.9% (38 of 1302)  4.6% (61 of 1326); 0.63 (0.43 to 0.94); P=0.02). The incidences of early pregnancy loss (12.1% (158 of 1302)  15.2% (201 of 1326); 0.80 (0.66 to 0.97)), placental accreta spectrum (1.8% (24 of 1302)  3.6% (48 of 1326); 0.51 (0.31 to 0.83)), caesarean section (69.5% (776 of 1117)  75.6% (831 of 1100); 0.92 (0.87 to 0.97)), and postpartum haemorrhage (2.0% (22 of 1117)  6.1% (67 of 1100); 0.32 (0.20 to 0.52)) were lower in the natural ovulation regimen group. No differences between groups were observed for birth weight or neonatal complications. The rate of cycle cancellation was higher in the natural ovulation regimen (16.2% (354 of 2185)  11.5% (251 of 2191), P<0.001). The prespecified per protocol and subgroup analyses yielded results consistent with the intention-to-treat analyses. In ovulatory women, a natural ovulation regimen for endometrial preparation was as effective as programmed regimen in terms of achieving a healthy live birth after frozen embryo transfer, but with a lower risk of maternal complications during pregnancy. Chinese Clinical Trial Registry ChiCTR2200057990.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To test the hypothesis that women assigned to a natural ovulation regimen before frozen embryo transfer compared with a programmed regimen would have an increased chance of a healthy live birth and a reduced risk of pre-eclampsia or eclampsia."
        },
        {
          "label": "DESIGN",
          "text": "Multicentre, randomised, parallel group, assessor blinded clinical trial."
        },
        {
          "label": "SETTING",
          "text": "24 academic fertility centres in China."
        },
        {
          "label": "PARTICIPANTS",
          "text": "4376 ovulatory women (aged 20-40 years) planning to undergo a frozen single blastocyst transfer."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Eligible participants were randomised (1:1) to receive a natural ovulation regimen or a programmed regimen of hormone replacement for endometrial preparation. Endometrial preparation and frozen embryo transfer timing were determined in the natural ovulation regimen group by monitoring natural follicle development and measuring serum levels of luteinising hormone, oestradiol, and progesterone. In the programmed regimen group, endometrial preparation was achieved by sequential administration of oestrogen and progesterone."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Primary outcomes were a healthy live birth and pre-eclampsia or eclampsia after a frozen embryo transfer. Secondary outcomes were cycle cancellation, biochemical pregnancy, clinical pregnancy, ongoing pregnancy, pregnancy loss, ectopic pregnancy, live birth, birth weight, and maternal, fetal, and neonatal complications."
        },
        {
          "label": "RESULTS",
          "text": "In the intention-to-treat analyses, 910 (41.6%) of 2185 patients in the natural ovulation regimen group and 890 (40.6%) of 2191 in the programmed regimen group achieved a healthy live birth (relative ratio 1.03 (95% confidence interval (CI) 0.96 to 1.10); P=0.49). The risk of pre-eclampsia was lower in the natural ovulation regimen group among patients who achieved clinical pregnancy than in the programmed regimen group (2.9% (38 of 1302)  4.6% (61 of 1326); 0.63 (0.43 to 0.94); P=0.02). The incidences of early pregnancy loss (12.1% (158 of 1302)  15.2% (201 of 1326); 0.80 (0.66 to 0.97)), placental accreta spectrum (1.8% (24 of 1302)  3.6% (48 of 1326); 0.51 (0.31 to 0.83)), caesarean section (69.5% (776 of 1117)  75.6% (831 of 1100); 0.92 (0.87 to 0.97)), and postpartum haemorrhage (2.0% (22 of 1117)  6.1% (67 of 1100); 0.32 (0.20 to 0.52)) were lower in the natural ovulation regimen group. No differences between groups were observed for birth weight or neonatal complications. The rate of cycle cancellation was higher in the natural ovulation regimen (16.2% (354 of 2185)  11.5% (251 of 2191), P<0.001). The prespecified per protocol and subgroup analyses yielded results consistent with the intention-to-treat analyses."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In ovulatory women, a natural ovulation regimen for endometrial preparation was as effective as programmed regimen in terms of achieving a healthy live birth after frozen embryo transfer, but with a lower risk of maternal complications during pregnancy."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Chinese Clinical Trial Registry ChiCTR2200057990."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41565309/",
      "pubDate": "2026 Jan 21",
      "doi": "10.1136/bmj-2025-087045",
      "dateReceived": "2026-01-27T23:31:06.495Z",
      "isNew": false
    },
    {
      "id": "2e86645ecacd",
      "title": "Intranasal Treatments for Children With Sleep-Disordered Breathing: The MIST+ Randomized Clinical Trial.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Surgery - Ear Nose Throat"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49847437/118660",
      "abstract": "Symptoms of obstructive sleep apnea are common in childhood and associated with significant comorbidity. Surgical treatment with adenotonsillectomy is first-line treatment but medical treatments show potential to improve symptoms and reduce the need for surgery. To determine the efficacy of 6 weeks of intranasal steroid (INS) compared with saline in children with obstructive sleep-disordered breathing (OSDB) with persistent symptoms after a 6-week intranasal saline run-in. This was a double-blind, placebo-controlled, randomized clinical trial involving specialist clinic waitlists at 2 sites in Australia. Included were children aged 3 to 12 years. Study data were analyzed from January to June 2025. All children received once-daily intranasal saline for 6 weeks (run-in). Those with persisting symptoms (SDB score ≥-1) were randomized to either once-daily intranasal mometasone furoate, 50 µg, (INS) or continued saline for a further 6 weeks. The primary outcome was symptom resolution (SDB score <-1). Secondary outcomes included behavior, quality of life, and parental perception of need for surgery. Analyses were adjusted for site and baseline measures. A total of 150 children (mean [SD] age, 6.2 [2.3] years; 93 male [62%]) were recruited. Of 139 children who completed the run-in phase, 41 (29.5%) had symptom resolution after saline run-in. Among 93 children randomized to intervention groups (47 INS; 46 saline), symptom resolution occurred in 35.6% (95% CI, 22.9%-50.6%) and 36.4% (95% CI, 23.5%-51.6%) of the INS and saline group, respectively, with no evidence for a clinically significant difference between groups (risk difference, -0.9%; 95% CI, -20.7% to 19.0%; P = .93). No group differences were found in secondary outcomes. Subgroup analysis did not reveal a group more or less likely to respond to medical treatment. Results of this randomized clinical trial show that 6 weeks of intranasal saline resolved OSDB symptoms in nearly one-third of children. An additional 6-week course of INS or saline led to resolution in another one-third (total resolution around 50%), with no added benefit from INS. Intranasal saline is an effective short-term first-line treatment for OSDB before consideration of polysomnography or surgical intervention. Results suggest that saline should be recommended for 3 months before assessing the need for specialist referral. ClinicalTrials.gov Identifier: NCT05382494.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Symptoms of obstructive sleep apnea are common in childhood and associated with significant comorbidity. Surgical treatment with adenotonsillectomy is first-line treatment but medical treatments show potential to improve symptoms and reduce the need for surgery."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the efficacy of 6 weeks of intranasal steroid (INS) compared with saline in children with obstructive sleep-disordered breathing (OSDB) with persistent symptoms after a 6-week intranasal saline run-in."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a double-blind, placebo-controlled, randomized clinical trial involving specialist clinic waitlists at 2 sites in Australia. Included were children aged 3 to 12 years. Study data were analyzed from January to June 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "All children received once-daily intranasal saline for 6 weeks (run-in). Those with persisting symptoms (SDB score ≥-1) were randomized to either once-daily intranasal mometasone furoate, 50 µg, (INS) or continued saline for a further 6 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was symptom resolution (SDB score <-1). Secondary outcomes included behavior, quality of life, and parental perception of need for surgery. Analyses were adjusted for site and baseline measures."
        },
        {
          "label": "RESULTS",
          "text": "A total of 150 children (mean [SD] age, 6.2 [2.3] years; 93 male [62%]) were recruited. Of 139 children who completed the run-in phase, 41 (29.5%) had symptom resolution after saline run-in. Among 93 children randomized to intervention groups (47 INS; 46 saline), symptom resolution occurred in 35.6% (95% CI, 22.9%-50.6%) and 36.4% (95% CI, 23.5%-51.6%) of the INS and saline group, respectively, with no evidence for a clinically significant difference between groups (risk difference, -0.9%; 95% CI, -20.7% to 19.0%; P = .93). No group differences were found in secondary outcomes. Subgroup analysis did not reveal a group more or less likely to respond to medical treatment."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Results of this randomized clinical trial show that 6 weeks of intranasal saline resolved OSDB symptoms in nearly one-third of children. An additional 6-week course of INS or saline led to resolution in another one-third (total resolution around 50%), with no added benefit from INS. Intranasal saline is an effective short-term first-line treatment for OSDB before consideration of polysomnography or surgical intervention. Results suggest that saline should be recommended for 3 months before assessing the need for specialist referral."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05382494."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41557344/",
      "pubDate": "2026 Jan 20",
      "doi": "10.1001/jamapediatrics.2025.5717",
      "dateReceived": "2026-01-27T23:31:06.495Z",
      "isNew": false
    },
    {
      "id": "e6718b0340e0",
      "title": "Empirical Antifungal Therapy Improves Survival in Patients With Acute-on-Chronic Liver Failure With Suspected Invasive Fungal Infections: A Pragmatic Randomized Trial.",
      "journal": "Am J Gastroenterol",
      "score": "5/7",
      "tags": [
        "Gastroenterology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49847437/118676",
      "abstract": "Invasive fungal infections (IFIs) in acute-on-chronic liver failure (ACLF) are associated with transplant delistings, high morbidity, and mortality. An optimal strategy of antifungal therapy in this setting remains uncertain. We compared suspicion-based (empirical) with investigation-driven (diagnostic/biomarker-driven-pre-emptive) antifungal therapy among patients with ACLF in a high-burden setting. In this parallel-group, pragmatic, randomized trial with blinded endpoint adjudication (NCT04157465), 216 hospitalized ACLF patients with predefined host and clinical factors for IFI were randomized (1:1) to empirical antifungal therapy at enrolment or diagnostic/biomarker-driven-pre-emptive therapy on laboratory, radiological, or mycological confirmation. Biomarker-guided and culture-guided antifungal stewardship protocols were implemented in both groups. The primary outcome was 28-day overall survival. Secondary outcomes included in-hospital mortality, changes in severity scores, adverse events, and cost-effectiveness. Heterogeneous treatment effects were explored through causal tree analysis. Empirical antifungal therapy significantly improved 28-day survival compared with diagnostic/biomarker-driven-pre-emptive therapy (35% vs 13%; hazard ratio: 0.64, 95% confidence interval: 0.47-0.88; P = 0.005). Treatment success (37.4% vs 16.9%; P = 0.002) and IFI resolution (45.8% vs 22.5%, P = 0.001) were higher; in-hospital and IFI-attributable mortality (55.6% vs 75.9%; P = 0.003) was lower in the empirical group. Fewer adverse events with greater quality-of-life years gains (29.9 vs 10.1) and an incremental cost-effectiveness ratio of international normalized ratio 1,42,737 were observed with empirical therapy. The survival benefit was maximum among patients aged 40 years or older with cardiovascular failure but without respiratory failure. Early empirical antifungal therapy within a structured stewardship framework improves survival in patients with ACLF and IFIs. Timely recognition, rapid diagnostics, and individualized antifungal strategies are essential to bridge these high-risk patients toward recovery or definitive therapies.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Invasive fungal infections (IFIs) in acute-on-chronic liver failure (ACLF) are associated with transplant delistings, high morbidity, and mortality. An optimal strategy of antifungal therapy in this setting remains uncertain. We compared suspicion-based (empirical) with investigation-driven (diagnostic/biomarker-driven-pre-emptive) antifungal therapy among patients with ACLF in a high-burden setting."
        },
        {
          "label": "METHODS",
          "text": "In this parallel-group, pragmatic, randomized trial with blinded endpoint adjudication (NCT04157465), 216 hospitalized ACLF patients with predefined host and clinical factors for IFI were randomized (1:1) to empirical antifungal therapy at enrolment or diagnostic/biomarker-driven-pre-emptive therapy on laboratory, radiological, or mycological confirmation. Biomarker-guided and culture-guided antifungal stewardship protocols were implemented in both groups. The primary outcome was 28-day overall survival. Secondary outcomes included in-hospital mortality, changes in severity scores, adverse events, and cost-effectiveness. Heterogeneous treatment effects were explored through causal tree analysis."
        },
        {
          "label": "RESULTS",
          "text": "Empirical antifungal therapy significantly improved 28-day survival compared with diagnostic/biomarker-driven-pre-emptive therapy (35% vs 13%; hazard ratio: 0.64, 95% confidence interval: 0.47-0.88; P = 0.005). Treatment success (37.4% vs 16.9%; P = 0.002) and IFI resolution (45.8% vs 22.5%, P = 0.001) were higher; in-hospital and IFI-attributable mortality (55.6% vs 75.9%; P = 0.003) was lower in the empirical group. Fewer adverse events with greater quality-of-life years gains (29.9 vs 10.1) and an incremental cost-effectiveness ratio of international normalized ratio 1,42,737 were observed with empirical therapy. The survival benefit was maximum among patients aged 40 years or older with cardiovascular failure but without respiratory failure."
        },
        {
          "label": "DISCUSSION",
          "text": "Early empirical antifungal therapy within a structured stewardship framework improves survival in patients with ACLF and IFIs. Timely recognition, rapid diagnostics, and individualized antifungal strategies are essential to bridge these high-risk patients toward recovery or definitive therapies."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41268913/",
      "pubDate": "2025 Nov 21",
      "doi": "10.14309/ajg.0000000000003832",
      "dateReceived": "2026-01-27T23:31:06.494Z",
      "isNew": false
    }
  ]
}