{
  "updated_at": "2026-01-04T23:27:36.727Z",
  "articles": [
    {
      "id": "dde74f1c8dd3",
      "title": "Cardiovascular Outcomes with Tirzepatide versus Dulaglutide in Type 2 Diabetes.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49505016/118436",
      "abstract": "Tirzepatide, a dual incretin agonist of the glucagon-like peptide-1 and glucose-dependent insulinotropic polypeptide receptors, has favorable effects on glycemic control and body weight. The effects on cardiovascular outcomes are uncertain. We conducted an active-comparator-controlled, double-blind, noninferiority trial in which patients with type 2 diabetes and atherosclerotic cardiovascular disease were randomly assigned in a 1:1 ratio to receive a weekly subcutaneous injection of tirzepatide (up to 15 mg) or dulaglutide (1.5 mg), an agent that has been shown to reduce the incidence of cardiovascular events. The primary end point was a composite of death from cardiovascular causes, myocardial infarction, or stroke and was tested for noninferiority of tirzepatide to dulaglutide with a margin of 1.05 for the upper limit of the 95.3% confidence interval for the hazard ratio. An upper limit of less than 1.00 was considered to indicate superiority of tirzepatide to dulaglutide. A total of 13,299 patients underwent randomization; 134 were subsequently excluded because they did not meet inclusion criteria. The modified intention-to-treat population thus included 6586 patients in the tirzepatide group and 6579 in the dulaglutide group. The mean (±SD) age of the patients was 64.1±8.8 years, 29.0% were women, the mean body-mass index (the weight in kilograms divided by the square of the height in meters) was 32.6±5.5, the mean glycated hemoglobin level was 8.4±0.9%, and the mean duration of diabetes was 14.7±8.8 years. A primary end-point event occurred in 801 patients (12.2%) in the tirzepatide group and 862 (13.1%) in the dulaglutide group (hazard ratio, 0.92; 95.3% confidence interval, 0.83 to 1.01; P = 0.003 for noninferiority; P = 0.09 for superiority). The incidence of adverse events appeared to be similar in the two groups, although more gastrointestinal adverse events were observed in the tirzepatide group. Among patients with type 2 diabetes and atherosclerotic cardiovascular disease, tirzepatide was noninferior to dulaglutide with respect to a composite of death from cardiovascular causes, myocardial infarction, or stroke. (Funded by Eli Lilly; SURPASS-CVOT ClinicalTrials.gov number, NCT04255433.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Tirzepatide, a dual incretin agonist of the glucagon-like peptide-1 and glucose-dependent insulinotropic polypeptide receptors, has favorable effects on glycemic control and body weight. The effects on cardiovascular outcomes are uncertain."
        },
        {
          "label": "METHODS",
          "text": "We conducted an active-comparator-controlled, double-blind, noninferiority trial in which patients with type 2 diabetes and atherosclerotic cardiovascular disease were randomly assigned in a 1:1 ratio to receive a weekly subcutaneous injection of tirzepatide (up to 15 mg) or dulaglutide (1.5 mg), an agent that has been shown to reduce the incidence of cardiovascular events. The primary end point was a composite of death from cardiovascular causes, myocardial infarction, or stroke and was tested for noninferiority of tirzepatide to dulaglutide with a margin of 1.05 for the upper limit of the 95.3% confidence interval for the hazard ratio. An upper limit of less than 1.00 was considered to indicate superiority of tirzepatide to dulaglutide."
        },
        {
          "label": "RESULTS",
          "text": "A total of 13,299 patients underwent randomization; 134 were subsequently excluded because they did not meet inclusion criteria. The modified intention-to-treat population thus included 6586 patients in the tirzepatide group and 6579 in the dulaglutide group. The mean (±SD) age of the patients was 64.1±8.8 years, 29.0% were women, the mean body-mass index (the weight in kilograms divided by the square of the height in meters) was 32.6±5.5, the mean glycated hemoglobin level was 8.4±0.9%, and the mean duration of diabetes was 14.7±8.8 years. A primary end-point event occurred in 801 patients (12.2%) in the tirzepatide group and 862 (13.1%) in the dulaglutide group (hazard ratio, 0.92; 95.3% confidence interval, 0.83 to 1.01; P = 0.003 for noninferiority; P = 0.09 for superiority). The incidence of adverse events appeared to be similar in the two groups, although more gastrointestinal adverse events were observed in the tirzepatide group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with type 2 diabetes and atherosclerotic cardiovascular disease, tirzepatide was noninferior to dulaglutide with respect to a composite of death from cardiovascular causes, myocardial infarction, or stroke. (Funded by Eli Lilly; SURPASS-CVOT ClinicalTrials.gov number, NCT04255433.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41406444/",
      "pubDate": "2025 Dec 18",
      "doi": "10.1056/NEJMoa2505928",
      "dateReceived": "2026-01-04T23:27:35.574Z",
      "isNew": true
    },
    {
      "id": "fbcfd9e1a6ba",
      "title": "Diagnosis and Management of Community-acquired Pneumonia. An Official American Thoracic Society Clinical Practice Guideline.",
      "journal": "Am J Respir Crit Care Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49570862/118443",
      "abstract": "Understanding of the diagnosis and treatment of adults with community-acquired pneumonia (CAP) has evolved thanks to new evidence, experience, and emerging technologies. This document updates evidence-based clinical practice guidelines on four key questions for the diagnosis and management of adult patients with CAP. A multidisciplinary panel integrated systematic reviews of comparative evidence with other relevant research and clinical experience, then applied Grading of Recommendations, Assessment, Development and Evaluation (GRADE) methodology to produce recommendations using the Evidence to Decision Framework. The panel formulated clinical recommendations that address questions related to CAP, including lung ultrasound for diagnosis, empiric antibacterial therapy if a test for a respiratory virus is positive, antibiotic duration, and the use of systemic corticosteroids. The panel formulated and provided the rationale for recommendations on selected diagnostic and treatment strategies for adult patients with CAP.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Understanding of the diagnosis and treatment of adults with community-acquired pneumonia (CAP) has evolved thanks to new evidence, experience, and emerging technologies. This document updates evidence-based clinical practice guidelines on four key questions for the diagnosis and management of adult patients with CAP."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary panel integrated systematic reviews of comparative evidence with other relevant research and clinical experience, then applied Grading of Recommendations, Assessment, Development and Evaluation (GRADE) methodology to produce recommendations using the Evidence to Decision Framework."
        },
        {
          "label": "RESULTS",
          "text": "The panel formulated clinical recommendations that address questions related to CAP, including lung ultrasound for diagnosis, empiric antibacterial therapy if a test for a respiratory virus is positive, antibiotic duration, and the use of systemic corticosteroids."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The panel formulated and provided the rationale for recommendations on selected diagnostic and treatment strategies for adult patients with CAP."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40679934/",
      "pubDate": "2025 Jul 18",
      "doi": "10.1164/rccm.202507-1692ST",
      "dateReceived": "2026-01-04T23:27:35.573Z",
      "isNew": true
    },
    {
      "id": "086d54e3d331",
      "title": "Semaglutide and Hospitalizations in Patients With Obesity and Established Cardiovascular Disease: An Exploratory Analysis of the SELECT Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118489",
      "abstract": "The primary analysis of the SELECT randomized clinical trial suggests that semaglutide reduced the rates of cardiovascular (CV) death, myocardial infarction, and stroke in patients with established CV disease (CVD) and overweight or obesity without diabetes. However, the effect of semaglutide on hospitalizations in this population remains unknown. To determine the impact of semaglutide on total hospital admissions and duration of hospital stay. The SELECT trial included patients aged 45 years or older with established CVD and a body mass index (BMI, calculated as weight in kilograms divided by height in meters squared) of 27 or higher without diabetes at 804 clinical settings across North America, South America, Europe, Asia, Africa, and Australia. Patients were randomized from October 2018 to March 2021. This prespecified exploratory analysis was conducted from February 2024 to September 2025. Once-weekly subcutaneous semaglutide, 2.4 mg, or placebo. The total number of hospital admissions and days in hospital between the semaglutide and placebo groups. A total of 17 604 patients (median [IQR] age, 61.0 [55.0-68.0] years; 4872 female patients [27.7%]; median [IQR] BMI, 32.1 [29.7-35.7]) were followed up for a median (IQR) period of 41.8 (33.0-47.0) months. There were 11 287 hospital admissions. The number of total hospitalizations was lower in the semaglutide group vs placebo for any indication (18.3 vs 20.4 admissions per 100 patient-years; mean ratio [MR], 0.90; 95% CI, 0.85-0.95; P < .001) and for serious adverse events (15.2 vs 17.1 admissions per 100 patient-years; MR, 0.89; 95% CI, 0.84-0.94; P < .001). The number of days hospitalized for any indication per 100 patient-years was lower in the semaglutide group vs placebo (157.2 vs 176.2 days; rate ratio [RR], 0.89; 95% CI, 0.82-0.98; P = .01), as well as hospitalizations for serious adverse events (137.6 vs 153.9 days; RR, 0.89; 95% CI, 0.81-0.98; P = .02). No heterogeneity was observed for the reduction of hospital admissions with semaglutide in selected subgroups, including BMI, age, and sex. In this prespecified exploratory analysis of the SELECT randomized clinical trial, the trial cohort had a high rate of hospital admissions. Treatment with once-weekly semaglutide was associated with significant reductions in hospital admissions and overall time spent in hospital, extending its benefits beyond CV risk reduction. ClinicalTrials.gov Identifier: NCT03574597.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The primary analysis of the SELECT randomized clinical trial suggests that semaglutide reduced the rates of cardiovascular (CV) death, myocardial infarction, and stroke in patients with established CV disease (CVD) and overweight or obesity without diabetes. However, the effect of semaglutide on hospitalizations in this population remains unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the impact of semaglutide on total hospital admissions and duration of hospital stay."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The SELECT trial included patients aged 45 years or older with established CVD and a body mass index (BMI, calculated as weight in kilograms divided by height in meters squared) of 27 or higher without diabetes at 804 clinical settings across North America, South America, Europe, Asia, Africa, and Australia. Patients were randomized from October 2018 to March 2021. This prespecified exploratory analysis was conducted from February 2024 to September 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Once-weekly subcutaneous semaglutide, 2.4 mg, or placebo."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The total number of hospital admissions and days in hospital between the semaglutide and placebo groups."
        },
        {
          "label": "RESULTS",
          "text": "A total of 17 604 patients (median [IQR] age, 61.0 [55.0-68.0] years; 4872 female patients [27.7%]; median [IQR] BMI, 32.1 [29.7-35.7]) were followed up for a median (IQR) period of 41.8 (33.0-47.0) months. There were 11 287 hospital admissions. The number of total hospitalizations was lower in the semaglutide group vs placebo for any indication (18.3 vs 20.4 admissions per 100 patient-years; mean ratio [MR], 0.90; 95% CI, 0.85-0.95; P < .001) and for serious adverse events (15.2 vs 17.1 admissions per 100 patient-years; MR, 0.89; 95% CI, 0.84-0.94; P < .001). The number of days hospitalized for any indication per 100 patient-years was lower in the semaglutide group vs placebo (157.2 vs 176.2 days; rate ratio [RR], 0.89; 95% CI, 0.82-0.98; P = .01), as well as hospitalizations for serious adverse events (137.6 vs 153.9 days; RR, 0.89; 95% CI, 0.81-0.98; P = .02). No heterogeneity was observed for the reduction of hospital admissions with semaglutide in selected subgroups, including BMI, age, and sex."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this prespecified exploratory analysis of the SELECT randomized clinical trial, the trial cohort had a high rate of hospital admissions. Treatment with once-weekly semaglutide was associated with significant reductions in hospital admissions and overall time spent in hospital, extending its benefits beyond CV risk reduction."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03574597."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41433034/",
      "pubDate": "2025 Dec 23",
      "doi": "10.1001/jamacardio.2025.4824",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "b1d0b99907b8",
      "title": "Once-Weekly Oral Islatravir Plus Lenacapavir Versus Daily Oral Bictegravir, Emtricitabine, and Tenofovir Alafenamide in Persons With HIV-1: A Phase 2 Randomized Study.",
      "journal": "Ann Intern Med",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118472",
      "abstract": "Once-weekly oral islatravir plus lenacapavir (ISL+LEN) has the potential to address adherence challenges with daily HIV-1 treatment. To evaluate efficacy and safety of once-weekly ISL+LEN. Phase 2, randomized, open-label, active-controlled study. (ClinialTrials.gov: NCT05052996). 44 U.S. sites. Adults with HIV-1 RNA viral load of less than 50 copies/mL receiving daily bictegravir, emtricitabine, and tenofovir alafenamide combination (B/F/TAF) for 24 weeks or more. Once-weekly oral ISL, 2 mg, plus LEN, 300 mg, or daily oral B/F/TAF. Proportion with HIV-1 RNA viral load of 50 copies/mL or more at week 24 (primary end point; U.S. Food and Drug Administration Snapshot Algorithm). Secondary end points: proportion of participants with HIV-1 RNA viral load of 50 copies/mL or more (weeks 12 and 48) and HIV-1 RNA viral load of less than 50 copies/mL (weeks 12, 24. and 48), safety, and CD4 T-cell and lymphocyte count changes (weeks 12, 24, and 48). A total of 104 participants were randomly assigned and treated (= 52 per group). At week 24, one ISL+LEN participant and no B/F/TAF participants had HIV-1 RNA viral load of 50 copies/mL or more (difference, 1.9% [95% CI, -5.2% to 10.5%]); 94.2% of participants in both groups had HIV-1 RNA viral load of less than 50 copies/mL (difference, 0% [CI, -10.9% to 10.9%]). At week 48, 94.2% and 92.3% of ISL+LEN and B/F/TAF participants, respectively, had HIV-1 RNA viral load of less than 50 copies/mL (difference, 1.9% [CI, -9.3% to 13.6%]); no participant had HIV-1 RNA viral load of 50 copies/mL or more. Two ISL+LEN participants discontinued treatment (before week 24) due to adverse events (AEs) unrelated to the study drug. No AEs that were grade 3 or greater or serious were related to treatment in either group. Changes in CD4 T-cell and lymphocyte counts from baseline to week 48 were similar between groups, with no discontinuations of study drug treatment due to decreased CD4 T cells or lymphocytes. Open-label, modest sample size, and only U.S.-based participants. Once-weekly oral ISL+LEN maintained high rates of virologic suppression through week 48 and was not associated with any treatment-related grade 3 or greater or serious AEs. Gilead Sciences, Inc.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Once-weekly oral islatravir plus lenacapavir (ISL+LEN) has the potential to address adherence challenges with daily HIV-1 treatment."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate efficacy and safety of once-weekly ISL+LEN."
        },
        {
          "label": "DESIGN",
          "text": "Phase 2, randomized, open-label, active-controlled study. (ClinialTrials.gov: NCT05052996)."
        },
        {
          "label": "SETTING",
          "text": "44 U.S. sites."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Adults with HIV-1 RNA viral load of less than 50 copies/mL receiving daily bictegravir, emtricitabine, and tenofovir alafenamide combination (B/F/TAF) for 24 weeks or more."
        },
        {
          "label": "INTERVENTION",
          "text": "Once-weekly oral ISL, 2 mg, plus LEN, 300 mg, or daily oral B/F/TAF."
        },
        {
          "label": "MEASUREMENTS",
          "text": "Proportion with HIV-1 RNA viral load of 50 copies/mL or more at week 24 (primary end point; U.S. Food and Drug Administration Snapshot Algorithm). Secondary end points: proportion of participants with HIV-1 RNA viral load of 50 copies/mL or more (weeks 12 and 48) and HIV-1 RNA viral load of less than 50 copies/mL (weeks 12, 24. and 48), safety, and CD4 T-cell and lymphocyte count changes (weeks 12, 24, and 48)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 104 participants were randomly assigned and treated (= 52 per group). At week 24, one ISL+LEN participant and no B/F/TAF participants had HIV-1 RNA viral load of 50 copies/mL or more (difference, 1.9% [95% CI, -5.2% to 10.5%]); 94.2% of participants in both groups had HIV-1 RNA viral load of less than 50 copies/mL (difference, 0% [CI, -10.9% to 10.9%]). At week 48, 94.2% and 92.3% of ISL+LEN and B/F/TAF participants, respectively, had HIV-1 RNA viral load of less than 50 copies/mL (difference, 1.9% [CI, -9.3% to 13.6%]); no participant had HIV-1 RNA viral load of 50 copies/mL or more. Two ISL+LEN participants discontinued treatment (before week 24) due to adverse events (AEs) unrelated to the study drug. No AEs that were grade 3 or greater or serious were related to treatment in either group. Changes in CD4 T-cell and lymphocyte counts from baseline to week 48 were similar between groups, with no discontinuations of study drug treatment due to decreased CD4 T cells or lymphocytes."
        },
        {
          "label": "LIMITATION",
          "text": "Open-label, modest sample size, and only U.S.-based participants."
        },
        {
          "label": "CONCLUSION",
          "text": "Once-weekly oral ISL+LEN maintained high rates of virologic suppression through week 48 and was not associated with any treatment-related grade 3 or greater or serious AEs."
        },
        {
          "label": "PRIMARY FUNDING SOURCE",
          "text": "Gilead Sciences, Inc."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41429026/",
      "pubDate": "2025 Dec 23",
      "doi": "10.7326/ANNALS-25-01939",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "2043b3237fff",
      "title": "The Limit of Detection in the Emergency Department Trial (LEGEND): A Stepped-Wedge Cluster Randomized Trial to Rule Out Acute Myocardial Infarction and Reduce Hospital Length of Stay for Patients Presenting to the Emergency Department.",
      "journal": "Ann Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118439",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "1096e3143cb5",
      "title": "Repetitive Transcranial Magnetic Stimulation and Motor Control Exercise for Chronic Low Back Pain: The ExTraStim Randomized Placebo-Controlled Trial.",
      "journal": "J Orthop Sports Phys Ther",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49558359/118428",
      "abstract": " To (1) assess the efficacy of combining repetitive transcranial magnetic stimulation (rTMS) and motor control exercise on pain intensity compared to each intervention alone or a placebo in patients with nonspecific chronic low back pain (CLBP), and (2) evaluate the effects of motor control exercise versus no-motor control exercise, and active rTMS versus sham rTMS.  Factorial randomized controlled trial.  Adults aged 18 to 65 years with nonspecific CLBP were randomly assigned in a 1:1:1:1 ratio to 1 of 4 groups: active rTMS, sham rTMS, active rTMS + motor control exercise, and sham rTMS + motor control exercise. Participants received 10 sessions of their allocated intervention over 8 weeks. Active and sham rTMS were performed over the primary motor cortex (10 Hz, 2000 pulses/session). The primary outcome was the average pain intensity at 8 weeks.  One hundred forty participants (80 females; mean age, 38.4 years) were recruited. Pain intensity significantly reduced over time, with no difference between groups. At 8 weeks, active rTMS + motor control exercise was not better than active rTMS (mean difference [MD], 0.1; 95% confidence interval [CI]: -1.0, 1.1;  = .89), sham rTMS (MD, 0.1; 95% CI:-0.9, 1.1;  = .83), or sham rTMS + motor control exercise (MD, 0.8; 95% CI: -0.3, 1.8;  = .15) to reduce pain. No significant differences in pain intensity were found between active and sham rTMS groups, with or without motor control exercise at 8 weeks.  Combining rTMS and motor control exercise did not significantly reduce pain intensity compared to each intervention used alone or placebo in participants with CLBP. .",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41385357/",
      "pubDate": "2026 Jan",
      "doi": "10.2519/jospt.2025.13681",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "2baee90bbab8",
      "title": "Metformin safety during pregnancy in women with gestational diabetes mellitus: A systematic review and meta-analysis of maternal, neonatal and long-term outcomes.",
      "journal": "Diabet Med",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49497926/118425",
      "abstract": "This systematic review and meta-analysis assessed the safety and efficacy of metformin in managing gestational diabetes mellitus (GDM), focusing on maternal, neonatal and long-term outcomes. While lifestyle changes are first-line treatment, pharmacological therapy is often required. Insulin, the standard, has drawbacks including weight gain, neonatal hypoglycaemia and maternal anxiety. Metformin is a promising alternative due to its insulin-sensitizing effects, but concerns remain about placental transfer and long-term effects on offspring. A systematic search was conducted in PubMed and Embase up to 29 August 2024, including randomized controlled trials (RCTs) and follow-up studies. Primary outcomes were neonatal hypoglycaemia, birthweight and long-term metabolic outcomes. Study quality was assessed using RoB 2.0 and ROBINS-I. Data were synthesized using the IVhet model. Ten RCTs were included. Metformin was associated with a statistically significant reduction in neonatal hypoglycaemia (OR: 0.65, 95% CI: 0.46-0.92) and lower birthweight (MD: -68.96 g, 95% CI: -108.34 to -29.57). A non-significant trend towards reduced LGA risk was observed. No significant differences in prediabetes, diabetes or insulin resistance were found. Long-term outcomes in children remain uncertain due to limited and heterogeneous follow-up data. Metformin appears safe and effective in GDM management, but more data are needed on long-term outcomes.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "This systematic review and meta-analysis assessed the safety and efficacy of metformin in managing gestational diabetes mellitus (GDM), focusing on maternal, neonatal and long-term outcomes. While lifestyle changes are first-line treatment, pharmacological therapy is often required. Insulin, the standard, has drawbacks including weight gain, neonatal hypoglycaemia and maternal anxiety. Metformin is a promising alternative due to its insulin-sensitizing effects, but concerns remain about placental transfer and long-term effects on offspring."
        },
        {
          "label": "METHODS",
          "text": "A systematic search was conducted in PubMed and Embase up to 29 August 2024, including randomized controlled trials (RCTs) and follow-up studies. Primary outcomes were neonatal hypoglycaemia, birthweight and long-term metabolic outcomes. Study quality was assessed using RoB 2.0 and ROBINS-I. Data were synthesized using the IVhet model."
        },
        {
          "label": "RESULTS",
          "text": "Ten RCTs were included. Metformin was associated with a statistically significant reduction in neonatal hypoglycaemia (OR: 0.65, 95% CI: 0.46-0.92) and lower birthweight (MD: -68.96 g, 95% CI: -108.34 to -29.57). A non-significant trend towards reduced LGA risk was observed. No significant differences in prediabetes, diabetes or insulin resistance were found. Long-term outcomes in children remain uncertain due to limited and heterogeneous follow-up data."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Metformin appears safe and effective in GDM management, but more data are needed on long-term outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41354637/",
      "pubDate": "2025 Dec 07",
      "doi": "10.1111/dme.70173",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "bd1aad27005c",
      "title": "Results of a 1-year randomised double-blind placebo-controlled trial with methotrexate 25 mg/week in recently diagnosed polymyalgia rheumatica.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49485495/118473",
      "abstract": "Methotrexate is recommended in current guidelines as a first-choice glucocorticoid (GC)-sparing agent for patients with polymyalgia rheumatica (PMR) prone to relapses or prolonged GC use. Previous randomised controlled trials (RCTs) have reported conflicting results but used low doses of methotrexate (7.5-10 mg/wk). More evidence on higher doses (25 mg/wk) is needed. In this 52-week blinded, placebo-controlled RCT, patients with recently diagnosed PMR (per 2012 European League Against Rheumatism/American College of Rheumatology criteria) and <8 weeks of GC use were randomised 1:1 to methotrexate 25 mg/wk or placebo, alongside a 24-week GC-tapering protocol. The primary outcome was GC-free remission (Polymyalgia Rheumatica-Activity Score <10 and no GC use) at week 52, tested with a 1-sided Cochran-Mantel-Haenszel test stratified by sex and inflammatory markers. Sixty-four patients were recruited, of whom 58 were included in the final analysis. GC-free remission at 52 weeks was achieved in 80% of patients in the methotrexate group vs 46% in the placebo group (risk difference 34%, 1-sided 95% CI: 14%, 1-sided P = .0042). This small but high-quality RCT demonstrated that methotrexate 25 mg/wk significantly increases the likelihood of achieving GC-free remission at 52 weeks in newly diagnosed PMR. These findings show a benefit of early introduction of methotrexate in PMR. Further research is needed to determine the optimal timing of methotrexate initiation.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "Methotrexate is recommended in current guidelines as a first-choice glucocorticoid (GC)-sparing agent for patients with polymyalgia rheumatica (PMR) prone to relapses or prolonged GC use. Previous randomised controlled trials (RCTs) have reported conflicting results but used low doses of methotrexate (7.5-10 mg/wk). More evidence on higher doses (25 mg/wk) is needed."
        },
        {
          "label": "METHODS",
          "text": "In this 52-week blinded, placebo-controlled RCT, patients with recently diagnosed PMR (per 2012 European League Against Rheumatism/American College of Rheumatology criteria) and <8 weeks of GC use were randomised 1:1 to methotrexate 25 mg/wk or placebo, alongside a 24-week GC-tapering protocol. The primary outcome was GC-free remission (Polymyalgia Rheumatica-Activity Score <10 and no GC use) at week 52, tested with a 1-sided Cochran-Mantel-Haenszel test stratified by sex and inflammatory markers."
        },
        {
          "label": "RESULTS",
          "text": "Sixty-four patients were recruited, of whom 58 were included in the final analysis. GC-free remission at 52 weeks was achieved in 80% of patients in the methotrexate group vs 46% in the placebo group (risk difference 34%, 1-sided 95% CI: 14%, 1-sided P = .0042)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This small but high-quality RCT demonstrated that methotrexate 25 mg/wk significantly increases the likelihood of achieving GC-free remission at 52 weeks in newly diagnosed PMR. These findings show a benefit of early introduction of methotrexate in PMR. Further research is needed to determine the optimal timing of methotrexate initiation."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41423373/",
      "pubDate": "2025 Dec 20",
      "doi": "10.1016/j.ard.2025.11.025",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "becefd6aa693",
      "title": "Diagnosis and management of paediatric magnet ingestion: a systematic review of clinical practice guidelines.",
      "journal": "Emerg Med J",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49485495/118458",
      "abstract": "The widespread use of small and powerful neodymium magnets in consumer products has led to a significant rise in paediatric magnet ingestion. The ingestion of multiple magnets poses serious risks, including bowel obstruction and perforation. Evidence-based Clinical Practice Guidelines (CPGs) are necessary to inform clinicians of the safest and most effective management strategies across a range of healthcare settings. This systematic review aims to summarise existing CPGs for diagnosing and managing paediatric magnet ingestion, evaluate the supporting evidence, highlight variation and consensus, and identify areas requiring further research. MEDLINE, Scopus, the Cochrane Library, Web of Science and Embase were searched to identify CPGs. Study characteristics, investigation and management recommendations, and indications for conservative management, endoscopy, surgery and discharge with and without follow-up were extracted. Two reviewers independently assessed CPG quality using the Appraisal of Guidelines for Research and Evaluation (AGREE) II instrument. 25 CPGs were included. Recommendations varied for diagnostic imaging, management of single and multiple magnet ingestion and the use of conservative, endoscopic or surgical interventions. However, there was consensus that: abdominal X-ray is the preferred first-line imaging modality, conservative management is recommended for asymptomatic single magnets, endoscopic removal is recommended for prepyloric asymptomatic multiple magnets and surgery for symptomatic multiple magnets. AGREE II appraisal revealed poor scores in CPG Applicability, Stakeholder Involvement and Rigour of Development, but strong scores for Editorial Independence. Existing CPGs for paediatric magnet ingestion are based on low-quality evidence or expert consensus. This review highlights inconsistencies and areas of consensus in current CPGs for paediatric magnet ingestion. Variations underscore the need for standardised, evidence-based guidelines to optimise care for affected children. Future research should focus on addressing gaps in evidence and consensus to ensure consistent management across healthcare settings.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The widespread use of small and powerful neodymium magnets in consumer products has led to a significant rise in paediatric magnet ingestion. The ingestion of multiple magnets poses serious risks, including bowel obstruction and perforation. Evidence-based Clinical Practice Guidelines (CPGs) are necessary to inform clinicians of the safest and most effective management strategies across a range of healthcare settings."
        },
        {
          "label": "AIM",
          "text": "This systematic review aims to summarise existing CPGs for diagnosing and managing paediatric magnet ingestion, evaluate the supporting evidence, highlight variation and consensus, and identify areas requiring further research."
        },
        {
          "label": "METHODS",
          "text": "MEDLINE, Scopus, the Cochrane Library, Web of Science and Embase were searched to identify CPGs. Study characteristics, investigation and management recommendations, and indications for conservative management, endoscopy, surgery and discharge with and without follow-up were extracted. Two reviewers independently assessed CPG quality using the Appraisal of Guidelines for Research and Evaluation (AGREE) II instrument."
        },
        {
          "label": "RESULTS",
          "text": "25 CPGs were included. Recommendations varied for diagnostic imaging, management of single and multiple magnet ingestion and the use of conservative, endoscopic or surgical interventions. However, there was consensus that: abdominal X-ray is the preferred first-line imaging modality, conservative management is recommended for asymptomatic single magnets, endoscopic removal is recommended for prepyloric asymptomatic multiple magnets and surgery for symptomatic multiple magnets. AGREE II appraisal revealed poor scores in CPG Applicability, Stakeholder Involvement and Rigour of Development, but strong scores for Editorial Independence. Existing CPGs for paediatric magnet ingestion are based on low-quality evidence or expert consensus."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This review highlights inconsistencies and areas of consensus in current CPGs for paediatric magnet ingestion. Variations underscore the need for standardised, evidence-based guidelines to optimise care for affected children. Future research should focus on addressing gaps in evidence and consensus to ensure consistent management across healthcare settings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41381185/",
      "pubDate": "2025 Dec 11",
      "doi": "10.1136/emermed-2024-214794",
      "dateReceived": "2026-01-03T23:26:35.723Z",
      "isNew": false
    },
    {
      "id": "d15e99bbd955",
      "title": "US-guided axillary nerve block vs. fracture hematoma block for forearm fracture analgesia in the ED: A randomised controlled trial.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49472755/118462",
      "dateReceived": "2026-01-01T23:27:44.986Z",
      "isNew": false
    },
    {
      "id": "eafb476500f5",
      "title": "Meta-analysis of clinically available pharmacotherapy of biopsy confirmed metabolic dysfunction associated steatohepatitis (MASH).",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49472755/118442",
      "abstract": "Pharmacotherapy for metabolic associated steatotic liver disease (MASLD) is reserved for steatohepatitis (MASH) with moderate Fibrosis Grades 2-3. Randomised controlled trials (RCT) of clinically available medications with biopsy data were evaluated for treatment benefits in steatohepatitis. PUBMED, Cochrane, and Scopus databases were searched for 'MASH/NASH/NAFLD/randomised-controlled trials/liver biopsy' (N = 848 publications) which provided 14 publications with biopsy data. Outcomes were changes in biopsy MASLD Activity Scores (MAS), Fibrosis Grades, resolution of MASH with no worsening of liver fibrosis (RSw/oF) or reduction ≥1 fibrosis stage with no worsening of steatohepatitis (RFw/oS). Meta-analyses and meta-regression analyses were performed. There were 3173 subjects (age 53.1 ± 5.8 SD years). Steatohepatitis scores (MAS) improved with treatment versus placebo by mean difference (md) = -1.27 ± 0.16 SD Units, p < 0.001. MAS sub scores improved for steatosis, lobar inflammation, and ballooning for dapagliflozin, semaglutide, and pioglitazone (all p < 0.002). Fibrosis Grades improved compared to placebo (md = -0.352 ± 0.03 Units, p < 0.001). Relative rates (rr) of RSw/oF and RFw/oS were found with resmetirom, semaglutide, tirzepatide, and dapagliflozin (all p < 0.015). Changes in RSw/oF and RFw/oS inversely correlated with the baseline levels of Fibrosis Grades (p = 0.025, and p = 0.076 respectively), with greater improvements of both at lower Fibrosis Grades. Clinically available medications are beneficial in reversing MASH. Improvements in RSw/oF and RFw/oS were greater at earlier stages of fibrosis. Future analyses of drug effects should include assessments adjusted for baseline study characteristics of Fibrosis Grades and may evaluate whether preventive therapy will have long term benefits if started at earlier stages of MASLD.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Pharmacotherapy for metabolic associated steatotic liver disease (MASLD) is reserved for steatohepatitis (MASH) with moderate Fibrosis Grades 2-3. Randomised controlled trials (RCT) of clinically available medications with biopsy data were evaluated for treatment benefits in steatohepatitis."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "PUBMED, Cochrane, and Scopus databases were searched for 'MASH/NASH/NAFLD/randomised-controlled trials/liver biopsy' (N = 848 publications) which provided 14 publications with biopsy data. Outcomes were changes in biopsy MASLD Activity Scores (MAS), Fibrosis Grades, resolution of MASH with no worsening of liver fibrosis (RSw/oF) or reduction ≥1 fibrosis stage with no worsening of steatohepatitis (RFw/oS). Meta-analyses and meta-regression analyses were performed."
        },
        {
          "label": "RESULTS",
          "text": "There were 3173 subjects (age 53.1 ± 5.8 SD years). Steatohepatitis scores (MAS) improved with treatment versus placebo by mean difference (md) = -1.27 ± 0.16 SD Units, p < 0.001. MAS sub scores improved for steatosis, lobar inflammation, and ballooning for dapagliflozin, semaglutide, and pioglitazone (all p < 0.002). Fibrosis Grades improved compared to placebo (md = -0.352 ± 0.03 Units, p < 0.001). Relative rates (rr) of RSw/oF and RFw/oS were found with resmetirom, semaglutide, tirzepatide, and dapagliflozin (all p < 0.015). Changes in RSw/oF and RFw/oS inversely correlated with the baseline levels of Fibrosis Grades (p = 0.025, and p = 0.076 respectively), with greater improvements of both at lower Fibrosis Grades."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Clinically available medications are beneficial in reversing MASH. Improvements in RSw/oF and RFw/oS were greater at earlier stages of fibrosis. Future analyses of drug effects should include assessments adjusted for baseline study characteristics of Fibrosis Grades and may evaluate whether preventive therapy will have long term benefits if started at earlier stages of MASLD."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41365848/",
      "pubDate": "2025 Dec 09",
      "doi": "10.1111/dom.70314",
      "dateReceived": "2026-01-01T23:27:44.986Z",
      "isNew": false
    },
    {
      "id": "501f6a791747",
      "title": "Management of Cancer During Pregnancy: ASCO Guideline.",
      "journal": "J Clin Oncol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49472755/118417",
      "abstract": "To provide guidance on the recommended management of cancer in pregnant patients. A multidisciplinary Expert Panel convened and conducted a systematic review of the literature. The systematic review identified 450 eligible studies. Much of the evidence consisted of observational data, case series, and case reports. Management of cancer during pregnancy should be grounded in a values-based informed-consent process outlining maternal and fetal risks and anticipated benefits. Diagnostic evaluation should follow the as low as reasonably achievable (ALARA) principle, with timing of diagnostic studies individualized based on urgency of cancer detection, potential dangers of delay, and the balance of risks to both the pregnant patient and her embryo or fetus. Due to significant risk of harm to the developing embryo and/or fetus, systemic therapy should be deferred until the second trimester. Methotrexate, hormonal therapies, human epidermal growth factor receptor 2-targeted agents, vascular endothelial growth factor and poly (ADP-ribose) polymerase inhibitors, antibody-drug conjugates, and all cellular therapies are contraindicated during pregnancy, regardless of gestational age. For patients who wish to continue their pregnancy, delivery should be planned at or after 37 weeks, with the final chemotherapy dose scheduled 2-4 weeks before birth. Referral to psychosocial support services is essential to address emotional and practical challenges, reduce distress, and support shared decision making.Additional information is available at www.asco.org/survivorship-guidelines.",
      "structuredAbstract": [
        {
          "label": "PURPOSE",
          "text": "To provide guidance on the recommended management of cancer in pregnant patients."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary Expert Panel convened and conducted a systematic review of the literature."
        },
        {
          "label": "RESULTS",
          "text": "The systematic review identified 450 eligible studies. Much of the evidence consisted of observational data, case series, and case reports."
        },
        {
          "label": "RECOMMENDATIONS",
          "text": "Management of cancer during pregnancy should be grounded in a values-based informed-consent process outlining maternal and fetal risks and anticipated benefits. Diagnostic evaluation should follow the as low as reasonably achievable (ALARA) principle, with timing of diagnostic studies individualized based on urgency of cancer detection, potential dangers of delay, and the balance of risks to both the pregnant patient and her embryo or fetus. Due to significant risk of harm to the developing embryo and/or fetus, systemic therapy should be deferred until the second trimester. Methotrexate, hormonal therapies, human epidermal growth factor receptor 2-targeted agents, vascular endothelial growth factor and poly (ADP-ribose) polymerase inhibitors, antibody-drug conjugates, and all cellular therapies are contraindicated during pregnancy, regardless of gestational age. For patients who wish to continue their pregnancy, delivery should be planned at or after 37 weeks, with the final chemotherapy dose scheduled 2-4 weeks before birth. Referral to psychosocial support services is essential to address emotional and practical challenges, reduce distress, and support shared decision making.Additional information is available at www.asco.org/survivorship-guidelines."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41380115/",
      "pubDate": "2025 Dec 11",
      "doi": "10.1200/JCO-25-02115",
      "dateReceived": "2026-01-01T23:27:44.986Z",
      "isNew": false
    },
    {
      "id": "f510725f932e",
      "title": "Medical and surgical interventions for neurotrophic keratopathy.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49472755/118403",
      "abstract": "Alterations to the corneal nerves can lead to neurotrophic keratopathy (NK), which is marked by breakdown of the corneal epithelium and impaired healing. If untreated, NK can cause severe corneal damage and significant visual impairment. Etiologies include infection, inflammation, chemical or mechanical trauma, systemic disease (e.g. diabetes mellitus), drug toxicity, contact lens overuse, and ophthalmic, neurosurgical, or otolaryngologic surgery. Treatments are often clinician-dependent and include an array of topical medications and surgical techniques to promote re-epithelialization and preserve vision. There is no consensus on the \"gold standard\" treatment. To examine the efficacy and safety of medical and surgical interventions when compared with no treatment, placebo, standard care, or an alternative treatment, for people with neurotrophic keratopathy. We searched CENTRAL, MEDLINE, Embase, PubMed, LILACS, and trial registries on 10 January 2025. We included randomized controlled trials (RCTs) in which medical or surgical interventions were compared with no treatment, placebo (e.g. ophthalmic vehicle, normal saline), standard care (e.g. artificial tears, bandage contact lens (BCL)), or an alternative treatment. Our outcomes of interest were corneal re-epithelialization, visual acuity, corneal sensitivity, worsening or relapse of the disease, and adverse events as assessed by investigators. We analyzed most outcome data at one to three months post-intervention; we assessed disease progression at six months or longer, and non-serious and serious adverse events at the longest follow-up time point. Using Cochrane's risk of bias tool RoB 2, we assessed the risk of bias for outcomes reported in our summary of findings table. We performed separate comparisons for medical and surgical interventions. In addition to the qualitative synthesis of included studies, where possible, we conducted fixed-effect meta-analyses, calculating risk ratios (RRs) with 95% confidence intervals (CI) for dichotomous outcomes and mean differences (MDs) and 95% CIs for continuous outcomes. We checked continuous data for skewness. We assessed the certainty of evidence using the GRADE approach. We included seven parallel-group RCTs with a total of 494 participants (study sample size: 18 to 156 participants; mean age: 25 to 68 years; proportion of female participants: 60% to 77%). Follow-up duration in the studies ranged from 28 days to 18 months. Four studies (57.1%) were multicenter RCTs in the USA and Europe; three studies were conducted in Europe or Asia. Five studies (71.4%) that reported funding sources were industry-sponsored. Six studies compared medical interventions versus opthalmic vehicle or artificial tears; the medical interventions included two topical biologic interventions (20 μg/ml recombinant human nerve growth factor (rhNGF; two studies), and recombinant bovine basic fibroblast growth factor (rb-bFGF)), and three non-biologic interventions (0.1% RGN-259, topical citicoline and vitamin B12 (Cit-B12), and CACICOL20 (T4020)). One trial compared amniotic membrane transplantation with tarsorrhaphy or BCL for NK. Six studies evaluated medical interventions versus vehicle or artificial tears. Meta-analysis of two studies showed that rhNGF may slightly improve corneal re-epithelialization (defined as < 0.5 mm of corneal staining) (RR 1.88, 95% CI 1.37 to 2.58; I = 0%; 148 participants; low-certainty evidence). The same two studies assessed complete corneal re-epithelialization (defined as < 0.1 mm of corneal staining) and found similar results but with substantial heterogeneity in the meta-analysis (RR 2.75, 95% CI 1.82 to 4.16; I = 72%; 148 participants; low-certainty evidence). One trial of CACICOL20 found that it may not increase the proportion of participants with corneal re-epithelialization (RR 0.89, 95% CI 0.66 to 1.19; 148 participants; low-certainty evidence), while one trial of 0.1% RGN-259 found the same (RR 9.00, 95% CI 0.57 to 141.88; 18 participants; low-certainty evidence). Meta-analysis of two studies showed that rhNGF may not improve visual acuity (RR 0.07, 95% CI -0.58 to 0.71; I = 0%; 151 participants; low-certainty evidence). Meta-analysis of two studies suggested that medical interventions, specifically rb-bFGF, may improve corneal sensitivity (MD 8.43, 95% CI 1.90 to 14.97; I = 0%; 60 participants; very low-certainty evidence), but the evidence is very uncertain. One trial showed that rhNGF may not improve corneal sensitivity (MD 1.08, 95% CI -0.32 to 2.48; 33 participants; very low-certainty evidence), but the evidence for this result is also very uncertain. Two studies narratively reported lower rates of disease recurrence with rhNGF compared with the opthalmic vehicle. One trial of CACICOL20 found that it may result in little to no difference in risk of adverse events compared with control groups (RR 0.98, 95% CI 0.63 to 1.52; 152 participants; low-certainty evidence); similar results were found in meta-analysis of two studies of rhNGF (RR 1.08, 95% CI 0.62 to 1.86; I = 0%; 151 participants; low-certainty evidence). Only one trial evaluated surgical interventions, comparing amniotic membrane transplantation versus tarsorrhaphy or BCL. Amniotic membrane may have little to no effect on the proportion of participants with corneal re-epithelialization (RR 1.10, 95% CI 0.69 to 1.76; 30 participants; very low-certainty evidence) or improvements in visual acuity (RR 1.40, 95% CI 0.57 to 3.43; 30 participants; very low-certainty evidence), but the evidence is very uncertain. No other prespecified outcomes were reported in this comparison. Neurotrophic keratopathy is a rare condition with an array of etiologies, which poses challenges for research in terms of study design, participant recruitment, and consensus on objective outcome measures. Our review found low or very low certainty of evidence regarding the effects of medical or surgical interventions on corneal re-epithelialization, visual acuity, and corneal sensitivity. We downgraded the certainty of the evidence mostly because of imprecision, followed by indirectness, risk of bias, and inconsistency. Given the current evidence and lack of universal guidelines, clinicians should individualize treatment based on clinical judgment and available resources. We expect future studies examining a wider range of interventions will be able to offer higher quality evidence and produce more conclusive assessments. This review had no internal source of support. External sources: National Eye Institute, National Institutes of Health, USA; Public Health Agency, UK; Queen's University Belfast, UK; Birmingham Health Partners, UK. Protocol available via doi.org/10.1002/14651858.CD015723.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Alterations to the corneal nerves can lead to neurotrophic keratopathy (NK), which is marked by breakdown of the corneal epithelium and impaired healing. If untreated, NK can cause severe corneal damage and significant visual impairment. Etiologies include infection, inflammation, chemical or mechanical trauma, systemic disease (e.g. diabetes mellitus), drug toxicity, contact lens overuse, and ophthalmic, neurosurgical, or otolaryngologic surgery. Treatments are often clinician-dependent and include an array of topical medications and surgical techniques to promote re-epithelialization and preserve vision. There is no consensus on the \"gold standard\" treatment."
        },
        {
          "label": "OBJECTIVES",
          "text": "To examine the efficacy and safety of medical and surgical interventions when compared with no treatment, placebo, standard care, or an alternative treatment, for people with neurotrophic keratopathy."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, PubMed, LILACS, and trial registries on 10 January 2025."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) in which medical or surgical interventions were compared with no treatment, placebo (e.g. ophthalmic vehicle, normal saline), standard care (e.g. artificial tears, bandage contact lens (BCL)), or an alternative treatment."
        },
        {
          "label": "OUTCOMES",
          "text": "Our outcomes of interest were corneal re-epithelialization, visual acuity, corneal sensitivity, worsening or relapse of the disease, and adverse events as assessed by investigators. We analyzed most outcome data at one to three months post-intervention; we assessed disease progression at six months or longer, and non-serious and serious adverse events at the longest follow-up time point."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Using Cochrane's risk of bias tool RoB 2, we assessed the risk of bias for outcomes reported in our summary of findings table."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We performed separate comparisons for medical and surgical interventions. In addition to the qualitative synthesis of included studies, where possible, we conducted fixed-effect meta-analyses, calculating risk ratios (RRs) with 95% confidence intervals (CI) for dichotomous outcomes and mean differences (MDs) and 95% CIs for continuous outcomes. We checked continuous data for skewness. We assessed the certainty of evidence using the GRADE approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included seven parallel-group RCTs with a total of 494 participants (study sample size: 18 to 156 participants; mean age: 25 to 68 years; proportion of female participants: 60% to 77%). Follow-up duration in the studies ranged from 28 days to 18 months. Four studies (57.1%) were multicenter RCTs in the USA and Europe; three studies were conducted in Europe or Asia. Five studies (71.4%) that reported funding sources were industry-sponsored. Six studies compared medical interventions versus opthalmic vehicle or artificial tears; the medical interventions included two topical biologic interventions (20 μg/ml recombinant human nerve growth factor (rhNGF; two studies), and recombinant bovine basic fibroblast growth factor (rb-bFGF)), and three non-biologic interventions (0.1% RGN-259, topical citicoline and vitamin B12 (Cit-B12), and CACICOL20 (T4020)). One trial compared amniotic membrane transplantation with tarsorrhaphy or BCL for NK."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Six studies evaluated medical interventions versus vehicle or artificial tears. Meta-analysis of two studies showed that rhNGF may slightly improve corneal re-epithelialization (defined as < 0.5 mm of corneal staining) (RR 1.88, 95% CI 1.37 to 2.58; I = 0%; 148 participants; low-certainty evidence). The same two studies assessed complete corneal re-epithelialization (defined as < 0.1 mm of corneal staining) and found similar results but with substantial heterogeneity in the meta-analysis (RR 2.75, 95% CI 1.82 to 4.16; I = 72%; 148 participants; low-certainty evidence). One trial of CACICOL20 found that it may not increase the proportion of participants with corneal re-epithelialization (RR 0.89, 95% CI 0.66 to 1.19; 148 participants; low-certainty evidence), while one trial of 0.1% RGN-259 found the same (RR 9.00, 95% CI 0.57 to 141.88; 18 participants; low-certainty evidence). Meta-analysis of two studies showed that rhNGF may not improve visual acuity (RR 0.07, 95% CI -0.58 to 0.71; I = 0%; 151 participants; low-certainty evidence). Meta-analysis of two studies suggested that medical interventions, specifically rb-bFGF, may improve corneal sensitivity (MD 8.43, 95% CI 1.90 to 14.97; I = 0%; 60 participants; very low-certainty evidence), but the evidence is very uncertain. One trial showed that rhNGF may not improve corneal sensitivity (MD 1.08, 95% CI -0.32 to 2.48; 33 participants; very low-certainty evidence), but the evidence for this result is also very uncertain. Two studies narratively reported lower rates of disease recurrence with rhNGF compared with the opthalmic vehicle. One trial of CACICOL20 found that it may result in little to no difference in risk of adverse events compared with control groups (RR 0.98, 95% CI 0.63 to 1.52; 152 participants; low-certainty evidence); similar results were found in meta-analysis of two studies of rhNGF (RR 1.08, 95% CI 0.62 to 1.86; I = 0%; 151 participants; low-certainty evidence). Only one trial evaluated surgical interventions, comparing amniotic membrane transplantation versus tarsorrhaphy or BCL. Amniotic membrane may have little to no effect on the proportion of participants with corneal re-epithelialization (RR 1.10, 95% CI 0.69 to 1.76; 30 participants; very low-certainty evidence) or improvements in visual acuity (RR 1.40, 95% CI 0.57 to 3.43; 30 participants; very low-certainty evidence), but the evidence is very uncertain. No other prespecified outcomes were reported in this comparison."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Neurotrophic keratopathy is a rare condition with an array of etiologies, which poses challenges for research in terms of study design, participant recruitment, and consensus on objective outcome measures. Our review found low or very low certainty of evidence regarding the effects of medical or surgical interventions on corneal re-epithelialization, visual acuity, and corneal sensitivity. We downgraded the certainty of the evidence mostly because of imprecision, followed by indirectness, risk of bias, and inconsistency. Given the current evidence and lack of universal guidelines, clinicians should individualize treatment based on clinical judgment and available resources. We expect future studies examining a wider range of interventions will be able to offer higher quality evidence and produce more conclusive assessments."
        },
        {
          "label": "FUNDING",
          "text": "This review had no internal source of support. External sources: National Eye Institute, National Institutes of Health, USA; Public Health Agency, UK; Queen's University Belfast, UK; Birmingham Health Partners, UK."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via doi.org/10.1002/14651858.CD015723."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41347649/",
      "pubDate": "2025 Dec 05",
      "doi": "10.1002/14651858.CD015723.pub2",
      "dateReceived": "2026-01-01T23:27:44.986Z",
      "isNew": false
    },
    {
      "id": "ebc96532ec7b",
      "title": "Safety and efficiency of diagnostic strategies for ruling out pulmonary embolism in patients with chronic lung disease: an individual-patient data meta-analysis.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49460464/118446",
      "abstract": "The optimal diagnostic management of patients with chronic lung disease (CLD) and suspected pulmonary embolism (PE) is unclear. The aim of this study was to evaluate the performance of PE diagnostic strategies in patients with and without CLD. This is a secondary analysis of an individual-patient data meta-analysis (PROSPERO CRD42018089366) of prospective or cross-sectional studies evaluating conventional (Wells or revised Geneva score with fixed or age-adjusted D-dimer) and newer (YEARS and the Pulmonary Embolism Graduated D-dimer Study algorithms) diagnostic strategies. Main outcomes were safety and efficiency. Safety was defined by the failure rate (proportion of patients diagnosed with venous thromboembolism during initial workup or follow-up among those in whom PE was considered ruled out at baseline without imaging). Efficiency was defined as the proportion of patients in whom PE was considered excluded without the need for imaging among all patients. Twelve studies, representing 16 990 patients (2201 patients with CLD) were included. The safety of each strategy was comparable in patients with and without CLD, whereas efficiency of the strategies was lower in patients with CLD. In patients with CLD, the predicted failure rate varied between 0.58% (95% CI, 0.10%-3.20%) and 1.06% (95% CI, 0.44%-2.53%), and between 2.54% (95% CI, 1.45%-4.39%) and 3.12% (95% CI, 2.04%-4.74%) for conventional and newer diagnostic strategies, respectively. The predicted efficiency was 19.0% to 33.2% and 35.8% to 43.9% for conventional and newer diagnostic strategies, respectively. In patients with CLD, diagnostic failure rate seemed slightly lower with conventional diagnostic strategies, but more patients would need imaging to rule out PE, compared with newer diagnostic strategies.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The optimal diagnostic management of patients with chronic lung disease (CLD) and suspected pulmonary embolism (PE) is unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this study was to evaluate the performance of PE diagnostic strategies in patients with and without CLD."
        },
        {
          "label": "METHODS",
          "text": "This is a secondary analysis of an individual-patient data meta-analysis (PROSPERO CRD42018089366) of prospective or cross-sectional studies evaluating conventional (Wells or revised Geneva score with fixed or age-adjusted D-dimer) and newer (YEARS and the Pulmonary Embolism Graduated D-dimer Study algorithms) diagnostic strategies. Main outcomes were safety and efficiency. Safety was defined by the failure rate (proportion of patients diagnosed with venous thromboembolism during initial workup or follow-up among those in whom PE was considered ruled out at baseline without imaging). Efficiency was defined as the proportion of patients in whom PE was considered excluded without the need for imaging among all patients."
        },
        {
          "label": "RESULTS",
          "text": "Twelve studies, representing 16 990 patients (2201 patients with CLD) were included. The safety of each strategy was comparable in patients with and without CLD, whereas efficiency of the strategies was lower in patients with CLD. In patients with CLD, the predicted failure rate varied between 0.58% (95% CI, 0.10%-3.20%) and 1.06% (95% CI, 0.44%-2.53%), and between 2.54% (95% CI, 1.45%-4.39%) and 3.12% (95% CI, 2.04%-4.74%) for conventional and newer diagnostic strategies, respectively. The predicted efficiency was 19.0% to 33.2% and 35.8% to 43.9% for conventional and newer diagnostic strategies, respectively."
        },
        {
          "label": "CONCLUSION",
          "text": "In patients with CLD, diagnostic failure rate seemed slightly lower with conventional diagnostic strategies, but more patients would need imaging to rule out PE, compared with newer diagnostic strategies."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161416/",
      "pubDate": "2025 Oct 27",
      "doi": "10.1016/j.jtha.2025.10.004",
      "dateReceived": "2025-12-31T23:27:26.618Z",
      "isNew": false
    },
    {
      "id": "782bc104d390",
      "title": "Therapeutic Exercise Progression in Patients with Nonspecific Low Back Pain: A Systematic Review.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49460464/118361",
      "abstract": "This systematic review aimed to identify and synthesize the objective and subjective criteria currently used to guide the progression of therapeutic exercise during the rehabilitation of adults with nonspecific low back pain (NSLBP). A secondary objective was to determine whether the use of those progression criteria enhances the effectiveness of exercise interventions compared to protocols without specific criteria. A comprehensive search was performed across three electronic databases and supplemented by a manual reference screening. Eligible studies were randomized controlled trials (RCTs) including adults (>18 years) with NSLBP where at least one group received therapeutic exercise with defined progression criteria. Study selection and full-text screening were followed by risk of bias assessment using the Cochrane Risk of Bias 2 tool. A total of 47 RCTs met the inclusion criteria. Due to the heterogeneity of included studies, a qualitative synthesis was conducted. Progression criteria were found to be both subjective and objective. Overall, intervention groups using predefined progression criteria showed greater short- and medium-term improvements than controls. However, only a subset of low-risk-of-bias studies confirmed these effects, and long-term benefits were rarely reported. Exercise progression based on specific criteria appears to offer promising benefits, particularly in the short-term reduction of pain and improvement in function. However, limitations persist regarding the direct applicability of these findings to clinical practice. Future research should aim to further standardize methodologies and establish measurable, clearly defined progression criteria for exercise-based interventions in patients with NSLBP.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This systematic review aimed to identify and synthesize the objective and subjective criteria currently used to guide the progression of therapeutic exercise during the rehabilitation of adults with nonspecific low back pain (NSLBP). A secondary objective was to determine whether the use of those progression criteria enhances the effectiveness of exercise interventions compared to protocols without specific criteria."
        },
        {
          "label": "METHODS",
          "text": "A comprehensive search was performed across three electronic databases and supplemented by a manual reference screening. Eligible studies were randomized controlled trials (RCTs) including adults (>18 years) with NSLBP where at least one group received therapeutic exercise with defined progression criteria. Study selection and full-text screening were followed by risk of bias assessment using the Cochrane Risk of Bias 2 tool."
        },
        {
          "label": "RESULTS",
          "text": "A total of 47 RCTs met the inclusion criteria. Due to the heterogeneity of included studies, a qualitative synthesis was conducted. Progression criteria were found to be both subjective and objective. Overall, intervention groups using predefined progression criteria showed greater short- and medium-term improvements than controls. However, only a subset of low-risk-of-bias studies confirmed these effects, and long-term benefits were rarely reported."
        },
        {
          "label": "CONCLUSION",
          "text": "Exercise progression based on specific criteria appears to offer promising benefits, particularly in the short-term reduction of pain and improvement in function. However, limitations persist regarding the direct applicability of these findings to clinical practice. Future research should aim to further standardize methodologies and establish measurable, clearly defined progression criteria for exercise-based interventions in patients with NSLBP."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41356704/",
      "pubDate": "2025",
      "doi": "10.2147/JPR.S539160",
      "dateReceived": "2025-12-31T23:27:26.618Z",
      "isNew": false
    },
    {
      "id": "d8cf0bbfa8b9",
      "title": "Rapid, point-of-care antigen tests for diagnosis of SARS-CoV-2 infection.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49460464/118357",
      "abstract": "Accurate rapid diagnostic tests for SARS-CoV-2 infection could help manage the COVID-19 pandemic by potentially increasing access to testing and speed detection of infection, as well as informing clinical and public health management decisions to reduce transmission. Previous iterations of this review provided clear and conclusive evidence of superior test performance in those experiencing possible signs and symptoms of Covid-19. However, test performance in asymptomatic individuals and sensitivity by setting and indication for testing remains unclear. This is the fourth iteration of this review, first published in 2020. To assess the diagnostic accuracy of rapid, point-of-care antigen tests (Ag-RDTs) for diagnosis of SARS-CoV-2 infection in asymptomatic population groups. We searched the COVID-19 Open Access Project living evidence database from the University of Bern (which includes daily updates from MEDLINE and Embase and preprints from medRxiv and bioRxiv) on 17 February 2022. We included independent evaluations from national reference laboratories, FIND and the Diagnostics Global Health website. We did not apply language restrictions. We included test accuracy studies of any design that evaluated commercially produced, rapid antigen tests in asymptomatic people tested because of known or suspected contact with SARS-CoV-2 infection, known SARS-CoV-2 infection or known absence of infection, or those who were being screened for infection. We included evaluations of single applications of a test (one test result reported per person). Reference standards for presence or absence of infection were any laboratory-based molecular test (primarily reverse transcription polymerase chain reaction (RT-PCR)). We used standard screening procedures with three reviewers. Two reviewers independently carried out quality assessment (using the QUADAS-2 tool) and extracted study results. Other study characteristics were extracted by one review author and checked by a second. We present sensitivity and specificity with 95% confidence intervals (CIs) for each test, and pooled data using the bivariate model. We investigated heterogeneity by including indicator variables in the random-effects logistic regression models. We tabulated results by test manufacturer and compliance with manufacturer instructions for use and according to symptom status. We included 146 study cohorts (described in 130 study reports). The main results relate to 164 evaluations of single test applications including 144,250 unique samples (7104 with confirmed SARS-CoV-2) obtained from asymptomatic or mainly asymptomatic populations. Studies were mainly conducted in Europe (85/146, 58%), and evaluated 41 different commercial antigen assays (test kit). Only six studies compared two or more brands of test. Nearly all studies (96%) used RT-PCR alone to define presence or absence of infection. Risk of bias was high because of participant selection (13, 9%); interpretation of the index test (3, 2%); weaknesses in the reference standard for absence of infection (3, 2%); and participant flow and timing (46, 32%). Characteristics of participants (11, 8%) and index test delivery (117, 80%) differed from the way in which and in whom the test was intended to be used. Estimates of sensitivity varied considerably between studies, with consistently high specificities. Average sensitivity was 55.0% (95% CI 50.9%, 59.0%) and average specificity was 99.5% (95% CI 99.5%, 99.6%) across the 147 evaluations of Ag-RDTs reporting both sensitivity and specificity (149,251 samples, 7636 cases). Average sensitivity was higher when epidemiological exposure to SARS-CoV-2 was suspected (58.6%, 95% CI 51.4% to 65.5%; 43 evaluations; 15,516 samples, 1483 cases) compared to where COVID-19 testing was reported to be widely available to anyone on presentation for testing (53.0%, 95% CI 48.4% to 57.5%; 103 evaluations; 129,032 samples, 5660 cases); however CIs overlapped, limiting the inference that can be drawn from these data. Average specificity was similarly high for both groups (99.4% and 99.6%). Sensitivity was generally lower when used in a screening context (summary values from 40.6% to 42.1% for three of four screening settings) compared to testing asymptomatic individuals at Covid-19 test centres (56.7%) or emergency departments (54.7%). We observed a decline in summary sensitivities as measures of sample viral load decreased. Sensitivity varied between brands. When tests were used according to manufacturer instructions, average sensitivities by brand ranged from 36.3% to 78.8% in asymptomatic participants (14 assays with sufficient data for pooling). None of the assays met the WHO acceptable performance standard for sensitivity (of 80%) based on meta-analysis; however, sensitivities from individual studies (where meta-analysis was not possible) exceeded 80% for three assays. The WHO acceptable performance criterion of 97% specificity was met by all but four assays (based on individual studies or meta-analysis) when tests were used according to manufacturer instructions. At 0.5% prevalence using summary data for asymptomatic people, where testing was widely available and where epidemiological exposure to COVID-19 was suspected, resulting PPVs would be 40% and 33%, meaning that 3 in 5 or 2 in 3 positive results will be false positives, and between 1 in 2 and 2 in 5 cases will be missed. Evidence for antigen testing in asymptomatic cohorts has increased considerably since the publication of the previous update of this review. Average sensitivities remain lower for testing of asymptomatic when compared to symptomatic individuals; however, there is an indication that sensitivities may be higher where epidemiological exposure to SARS-CoV-2 is suspected compared to testing any asymptomatic individual regardless of indication. Sensitivities were particularly low when antigen tests were used in screening settings. Assays from different manufacturers also vary in sensitivity, indicating the need for appropriate clinical validation of a particular antigen test in a given intended use setting prior to more widespread deployment. Further research is needed to evaluate the effectiveness of screening programmes at reducing transmission of infection, whether mass screening or targeted approaches, including schools, healthcare setting and traveller screening. This paper presents independent research supported by the NIHR Birmingham Biomedical Research Centre, University Hospitals Birmingham NHS Foundation Trust, and the University of Birmingham. The views expressed are those of the author(s) and not necessarily those of the NHS, the NIHR or the Department of Health and Social Care. Protocol (2020) doi: 10.1002/14651858.CD013596.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Accurate rapid diagnostic tests for SARS-CoV-2 infection could help manage the COVID-19 pandemic by potentially increasing access to testing and speed detection of infection, as well as informing clinical and public health management decisions to reduce transmission. Previous iterations of this review provided clear and conclusive evidence of superior test performance in those experiencing possible signs and symptoms of Covid-19. However, test performance in asymptomatic individuals and sensitivity by setting and indication for testing remains unclear. This is the fourth iteration of this review, first published in 2020."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the diagnostic accuracy of rapid, point-of-care antigen tests (Ag-RDTs) for diagnosis of SARS-CoV-2 infection in asymptomatic population groups."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the COVID-19 Open Access Project living evidence database from the University of Bern (which includes daily updates from MEDLINE and Embase and preprints from medRxiv and bioRxiv) on 17 February 2022. We included independent evaluations from national reference laboratories, FIND and the Diagnostics Global Health website. We did not apply language restrictions."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included test accuracy studies of any design that evaluated commercially produced, rapid antigen tests in asymptomatic people tested because of known or suspected contact with SARS-CoV-2 infection, known SARS-CoV-2 infection or known absence of infection, or those who were being screened for infection. We included evaluations of single applications of a test (one test result reported per person). Reference standards for presence or absence of infection were any laboratory-based molecular test (primarily reverse transcription polymerase chain reaction (RT-PCR))."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We used standard screening procedures with three reviewers. Two reviewers independently carried out quality assessment (using the QUADAS-2 tool) and extracted study results. Other study characteristics were extracted by one review author and checked by a second. We present sensitivity and specificity with 95% confidence intervals (CIs) for each test, and pooled data using the bivariate model. We investigated heterogeneity by including indicator variables in the random-effects logistic regression models. We tabulated results by test manufacturer and compliance with manufacturer instructions for use and according to symptom status."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 146 study cohorts (described in 130 study reports). The main results relate to 164 evaluations of single test applications including 144,250 unique samples (7104 with confirmed SARS-CoV-2) obtained from asymptomatic or mainly asymptomatic populations. Studies were mainly conducted in Europe (85/146, 58%), and evaluated 41 different commercial antigen assays (test kit). Only six studies compared two or more brands of test. Nearly all studies (96%) used RT-PCR alone to define presence or absence of infection. Risk of bias was high because of participant selection (13, 9%); interpretation of the index test (3, 2%); weaknesses in the reference standard for absence of infection (3, 2%); and participant flow and timing (46, 32%). Characteristics of participants (11, 8%) and index test delivery (117, 80%) differed from the way in which and in whom the test was intended to be used. Estimates of sensitivity varied considerably between studies, with consistently high specificities. Average sensitivity was 55.0% (95% CI 50.9%, 59.0%) and average specificity was 99.5% (95% CI 99.5%, 99.6%) across the 147 evaluations of Ag-RDTs reporting both sensitivity and specificity (149,251 samples, 7636 cases). Average sensitivity was higher when epidemiological exposure to SARS-CoV-2 was suspected (58.6%, 95% CI 51.4% to 65.5%; 43 evaluations; 15,516 samples, 1483 cases) compared to where COVID-19 testing was reported to be widely available to anyone on presentation for testing (53.0%, 95% CI 48.4% to 57.5%; 103 evaluations; 129,032 samples, 5660 cases); however CIs overlapped, limiting the inference that can be drawn from these data. Average specificity was similarly high for both groups (99.4% and 99.6%). Sensitivity was generally lower when used in a screening context (summary values from 40.6% to 42.1% for three of four screening settings) compared to testing asymptomatic individuals at Covid-19 test centres (56.7%) or emergency departments (54.7%). We observed a decline in summary sensitivities as measures of sample viral load decreased. Sensitivity varied between brands. When tests were used according to manufacturer instructions, average sensitivities by brand ranged from 36.3% to 78.8% in asymptomatic participants (14 assays with sufficient data for pooling). None of the assays met the WHO acceptable performance standard for sensitivity (of 80%) based on meta-analysis; however, sensitivities from individual studies (where meta-analysis was not possible) exceeded 80% for three assays. The WHO acceptable performance criterion of 97% specificity was met by all but four assays (based on individual studies or meta-analysis) when tests were used according to manufacturer instructions. At 0.5% prevalence using summary data for asymptomatic people, where testing was widely available and where epidemiological exposure to COVID-19 was suspected, resulting PPVs would be 40% and 33%, meaning that 3 in 5 or 2 in 3 positive results will be false positives, and between 1 in 2 and 2 in 5 cases will be missed."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Evidence for antigen testing in asymptomatic cohorts has increased considerably since the publication of the previous update of this review. Average sensitivities remain lower for testing of asymptomatic when compared to symptomatic individuals; however, there is an indication that sensitivities may be higher where epidemiological exposure to SARS-CoV-2 is suspected compared to testing any asymptomatic individual regardless of indication. Sensitivities were particularly low when antigen tests were used in screening settings. Assays from different manufacturers also vary in sensitivity, indicating the need for appropriate clinical validation of a particular antigen test in a given intended use setting prior to more widespread deployment. Further research is needed to evaluate the effectiveness of screening programmes at reducing transmission of infection, whether mass screening or targeted approaches, including schools, healthcare setting and traveller screening."
        },
        {
          "label": "FUNDING",
          "text": "This paper presents independent research supported by the NIHR Birmingham Biomedical Research Centre, University Hospitals Birmingham NHS Foundation Trust, and the University of Birmingham. The views expressed are those of the author(s) and not necessarily those of the NHS, the NIHR or the Department of Health and Social Care."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2020) doi: 10.1002/14651858.CD013596."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41312797/",
      "pubDate": "2025 Nov 28",
      "doi": "10.1002/14651858.CD013705.pub4",
      "dateReceived": "2025-12-31T23:27:26.618Z",
      "isNew": false
    },
    {
      "id": "508d30b3bca5",
      "title": "Systematic review and meta-analyses of nonpharmacological interventions for co-occurring chronic pain and posttraumatic stress disorder.",
      "journal": "Pain",
      "score": "5/7",
      "tags": [
        "Psychiatry",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118423",
      "abstract": "Chronic pain and posttraumatic stress disorder (PTSD) frequently co-occur; however, evidence for effective nonpharmacological treatments is limited, resulting in a guidance gap for clinicians. The aim of this systematic review with meta-analysis was to synthesize and analyze the evidence base for nonpharmacological interventions for chronic pain and posttraumatic stress symptoms. MEDLINE, Embase, PsycINFO, and the PTSD Repository were searched for randomized controlled trials of noninvasive, nonpharmacological interventions in adults with chronic pain, PTSD, or both published from January 1, 1988 to August 31, 2024. Studies reporting assessments of both pain intensity and PTSD symptoms were included, and the primary outcomes were change in pain intensity and PTSD symptom severity. Meta-analyses calculated standardized mean differences (SMDs) in change scores for PTSD symptom severity and pain intensity from pre- to posttreatment. Confidence in the evidence was assessed using Grading of Recommendations, Assessment, Development and Evaluation (GRADE). The study is registered with PROSPERO, CRD42024507881. We identified 30 eligible trials (N = 3245 participants). We found evidence (low quality) that trauma-focused treatments may improve both PTSD symptom severity (a medium effect; SMD -0·75, 95% CI -1·37 to -0·12) and pain intensity (a small effect; SMD -0·34, 95% CI -0·56 to -0·11). We found no significant effects for cognitive-behavioral therapies, mind-body therapies, or peripheral modulation interventions for either outcome. Most studies were methodologically weak. Our findings suggest that treatments targeting chronic pain and PTSD should, at minimum, include a trauma-focused therapy component. However, further research is required to develop effective treatments for co-occurring chronic pain and PTSD.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41380098/",
      "pubDate": "2025 Dec 03",
      "doi": "10.1097/j.pain.0000000000003880",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "2ce86323d9dd",
      "title": "Awake Prone Positioning in Patients With COVID-19 Respiratory Failure: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118420",
      "abstract": "Awake prone positioning (APP) has shown inconstant associations with improved clinical outcomes in nonintubated patients with COVID-19 developing severe pneumonia. To evaluate the effects of APP on the need for intubation or incidence of death among patients with COVID-19-related hypoxemic respiratory failure. This randomized clinical trial was conducted at 20 hospitals in France and 1 hospital in Mexico between July 2020 and August 2021. The study included patients from wards and intensive care units. Adult patients (18 years or older) who were not intubated and required at least 3 L/min of oxygen flow due to COVID-19 infection were included and randomly assigned in a 1:1 ratio to either APP or standard care. Intention-to-treat statistical analysis was performed from September to December 2024. Patients randomly assigned to the APP group were offered the intervention lasting at least 6 hours a day. Patients randomly assigned to standard care had no positioning constraint, including no contraindication to spontaneous APP. The primary outcome was a composite criterion of intubation and/or death in the first 28 days of randomization. Prespecified secondary outcomes at 28 days of enrollment were days alive outside the intensive care unit (ICU), days alive outside the hospital, proportion of patients admitted to ICU (for patients not in ICU at baseline), and days alive and free from mechanical ventilation. A bayesian approach was used to provide insights into the complete distribution of the effect estimates. A total of 445 patients were included in the final analysis (mean [SD] age, 60 [11] years; 329 males [74%]; median [IQR] SpO2 to FIO2 [peripheral oxygen saturation to fraction of inspired oxygen] ratio, 150 [114-194] and 155 [109-221] in the standard care and APP groups, respectively). With a noninformative prior distribution, the posterior probability that APP decreased intubation and/or death compared with standard care was 93.8% (mean odds ratio [OR], 0.74; 95% credible interval [CrI], 0.48-1.09). For secondary outcomes, between the APP and standard care groups, the mean difference in the number of days alive and free from mechanical ventilation was 0.33 (95% CrI, -1.37 to 2.03) days; in the number of days alive outside the ICU was 1.28 (95% CrI, -0.78 to 3.34) days; and in the number of days alive outside the hospital was 1.55 (95% CrI, -0.22 to 3.32) days. In this randomized clinical trial of nonintubated patients with COVID-19 and hypoxemic respiratory failure, daily APP of 6 hours showed a high probability of reduced endotracheal intubation and/or death over a wide range of prior distributions. These results support APP's use in patients with hypoxemic pneumonia due to COVID-19 infection. ClinicalTrials.gov Identifier: NCT04366856.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Awake prone positioning (APP) has shown inconstant associations with improved clinical outcomes in nonintubated patients with COVID-19 developing severe pneumonia."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effects of APP on the need for intubation or incidence of death among patients with COVID-19-related hypoxemic respiratory failure."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was conducted at 20 hospitals in France and 1 hospital in Mexico between July 2020 and August 2021. The study included patients from wards and intensive care units. Adult patients (18 years or older) who were not intubated and required at least 3 L/min of oxygen flow due to COVID-19 infection were included and randomly assigned in a 1:1 ratio to either APP or standard care. Intention-to-treat statistical analysis was performed from September to December 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients randomly assigned to the APP group were offered the intervention lasting at least 6 hours a day. Patients randomly assigned to standard care had no positioning constraint, including no contraindication to spontaneous APP."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite criterion of intubation and/or death in the first 28 days of randomization. Prespecified secondary outcomes at 28 days of enrollment were days alive outside the intensive care unit (ICU), days alive outside the hospital, proportion of patients admitted to ICU (for patients not in ICU at baseline), and days alive and free from mechanical ventilation. A bayesian approach was used to provide insights into the complete distribution of the effect estimates."
        },
        {
          "label": "RESULTS",
          "text": "A total of 445 patients were included in the final analysis (mean [SD] age, 60 [11] years; 329 males [74%]; median [IQR] SpO2 to FIO2 [peripheral oxygen saturation to fraction of inspired oxygen] ratio, 150 [114-194] and 155 [109-221] in the standard care and APP groups, respectively). With a noninformative prior distribution, the posterior probability that APP decreased intubation and/or death compared with standard care was 93.8% (mean odds ratio [OR], 0.74; 95% credible interval [CrI], 0.48-1.09). For secondary outcomes, between the APP and standard care groups, the mean difference in the number of days alive and free from mechanical ventilation was 0.33 (95% CrI, -1.37 to 2.03) days; in the number of days alive outside the ICU was 1.28 (95% CrI, -0.78 to 3.34) days; and in the number of days alive outside the hospital was 1.55 (95% CrI, -0.22 to 3.32) days."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial of nonintubated patients with COVID-19 and hypoxemic respiratory failure, daily APP of 6 hours showed a high probability of reduced endotracheal intubation and/or death over a wide range of prior distributions. These results support APP's use in patients with hypoxemic pneumonia due to COVID-19 infection."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04366856."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41370078/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamanetworkopen.2025.48201",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "3c5eeaf305a8",
      "title": "Targeting IL-22RA1 with temtokibart: A novel approach in atopic dermatitis: Phase 2a monotherapy study results.",
      "journal": "J Allergy Clin Immunol",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Dermatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118415",
      "abstract": "Atopic dermatitis (AD) is a chronic inflammatory skin disease in which increased IL-22 expression contributes to epidermal hyperplasia and barrier defects. Temtokibart is a monoclonal antibody targeting IL-22RA1 (IL-22 receptor subunit alpha-1), blocking the signaling of IL-22 and potentially also of IL-20 and IL-24. We evaluated the efficacy and safety of temtokibart in adults with moderate-to-severe AD. In this phase 2a study (NCT04922021), 58 adults were randomized 1:1 to subcutaneous temtokibart 450 mg or placebo every 2 weeks for 16 weeks, with an additional dose (450 mg) at week 1, followed by additional 16 weeks of safety follow-up. The primary end point was change in Eczema Area Severity Index (EASI) from baseline to week 16. Biomarkers in serum, including IL-22, were analyzed as an exploratory end point. Mean change in EASI from baseline to week 16 was significantly greater for temtokibart compared to placebo (-15.3 vs -3.5; P = .003), corresponding to 65.4% and 19.7% improvement for temtokibart and placebo groups, respectively. At week 16, greater proportions of patients receiving temtokibart relative to placebo obtained EASI-75 (41.6% vs 13.7%; P = .011), EASI-90 (30.8% vs 3.5%; P = .003), and EASI-100 (20.9% vs 0%; P = .006). Treatment with temtokibart was well tolerated, and no safety signals were observed. Further, temtokibart treatment was associated with a general reduction of systemic inflammatory proteins. This proof-of-concept study demonstrates that targeting the IL-22 pathway with temtokibart is clinically effective with a favorable safety profile.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Atopic dermatitis (AD) is a chronic inflammatory skin disease in which increased IL-22 expression contributes to epidermal hyperplasia and barrier defects. Temtokibart is a monoclonal antibody targeting IL-22RA1 (IL-22 receptor subunit alpha-1), blocking the signaling of IL-22 and potentially also of IL-20 and IL-24."
        },
        {
          "label": "OBJECTIVE",
          "text": "We evaluated the efficacy and safety of temtokibart in adults with moderate-to-severe AD."
        },
        {
          "label": "METHODS",
          "text": "In this phase 2a study (NCT04922021), 58 adults were randomized 1:1 to subcutaneous temtokibart 450 mg or placebo every 2 weeks for 16 weeks, with an additional dose (450 mg) at week 1, followed by additional 16 weeks of safety follow-up. The primary end point was change in Eczema Area Severity Index (EASI) from baseline to week 16. Biomarkers in serum, including IL-22, were analyzed as an exploratory end point."
        },
        {
          "label": "RESULTS",
          "text": "Mean change in EASI from baseline to week 16 was significantly greater for temtokibart compared to placebo (-15.3 vs -3.5; P = .003), corresponding to 65.4% and 19.7% improvement for temtokibart and placebo groups, respectively. At week 16, greater proportions of patients receiving temtokibart relative to placebo obtained EASI-75 (41.6% vs 13.7%; P = .011), EASI-90 (30.8% vs 3.5%; P = .003), and EASI-100 (20.9% vs 0%; P = .006). Treatment with temtokibart was well tolerated, and no safety signals were observed. Further, temtokibart treatment was associated with a general reduction of systemic inflammatory proteins."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This proof-of-concept study demonstrates that targeting the IL-22 pathway with temtokibart is clinically effective with a favorable safety profile."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41232575/",
      "pubDate": "2025 Nov 11",
      "doi": "10.1016/j.jaci.2025.08.034",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "cd29e2bb7bd7",
      "title": "Potent P2Y(12) Inhibitor Monotherapy vs DAPT After PCI in Patients With and Without STEMI: The NEO-MINDSET Substudy.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118407",
      "abstract": "The effects of very early aspirin withdrawal with potent P2Y inhibitor monotherapy after percutaneous coronary intervention may differ based on acute coronary syndrome (ACS) presentation. This prespecified analysis from the NEO-MINDSET trial evaluated whether treatment effects of early aspirin discontinuation differ between ST-segment elevation myocardial infarction (STEMI) and non-ST-segment elevation ACS (NSTE-ACS; defined as unstable angina or non-ST-segment elevation myocardial infarction). NEO-MINDSET randomized ACS patients to potent P2Y inhibitor monotherapy initiated within 4 days of hospitalization vs standard dual antiplatelet therapy (DAPT) with aspirin and a potent P2Y inhibitor for 12 months. Co-primary outcomes were: 1) the composite of all-cause death, myocardial infarction, stroke, and urgent target vessel revascularization (ischemic outcome); and 2) Bleeding Academic Research Consortium types 2, 3, or 5 bleeding (bleeding outcome). Of the 3,410 participants included, 2,119 (62.1%) presented with STEMI and 1,291 (37.9%) with NSTE-ACS. Among STEMI patients, an early aspirin-free strategy was associated with a higher rate of the co-primary ischemic composite outcome compared with DAPT at 1 year (8.2% vs 5.2%, respectively; HR: 1.60; 95% CI: 1.14-2.24), whereas among those with NSTE-ACS, ischemic event rates were similar between monotherapy and DAPT (5.1% vs 6.0%, respectively; HR: 0.84; 95% CI: 0.53-1.35; P for interaction = 0.030). The co-primary bleeding outcome was lower with monotherapy than with DAPT in both STEMI (HR: 0.37; 95% CI: 0.22-0.61) and NSTE-ACS (HR: 0.45; 95% CI: 0.23-0.86) populations (P for interaction = 0.650). In patients with STEMI treated with percutaneous coronary intervention, early aspirin withdrawal may be harmful, because it increases the risk of ischemic events. Conversely, in NSTE-ACS, potent P2Y inhibitor monotherapy may be a viable therapeutic option: Ischemic event rates were similar and bleeding was reduced compared with DAPT. (Percutaneous Coronary Intervention Followed by Antiplatelet Monotherapy in the Setting of Acute Coronary Syndromes [NEOMINDSET]; NCT04360720).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The effects of very early aspirin withdrawal with potent P2Y inhibitor monotherapy after percutaneous coronary intervention may differ based on acute coronary syndrome (ACS) presentation."
        },
        {
          "label": "OBJECTIVES",
          "text": "This prespecified analysis from the NEO-MINDSET trial evaluated whether treatment effects of early aspirin discontinuation differ between ST-segment elevation myocardial infarction (STEMI) and non-ST-segment elevation ACS (NSTE-ACS; defined as unstable angina or non-ST-segment elevation myocardial infarction)."
        },
        {
          "label": "METHODS",
          "text": "NEO-MINDSET randomized ACS patients to potent P2Y inhibitor monotherapy initiated within 4 days of hospitalization vs standard dual antiplatelet therapy (DAPT) with aspirin and a potent P2Y inhibitor for 12 months. Co-primary outcomes were: 1) the composite of all-cause death, myocardial infarction, stroke, and urgent target vessel revascularization (ischemic outcome); and 2) Bleeding Academic Research Consortium types 2, 3, or 5 bleeding (bleeding outcome)."
        },
        {
          "label": "RESULTS",
          "text": "Of the 3,410 participants included, 2,119 (62.1%) presented with STEMI and 1,291 (37.9%) with NSTE-ACS. Among STEMI patients, an early aspirin-free strategy was associated with a higher rate of the co-primary ischemic composite outcome compared with DAPT at 1 year (8.2% vs 5.2%, respectively; HR: 1.60; 95% CI: 1.14-2.24), whereas among those with NSTE-ACS, ischemic event rates were similar between monotherapy and DAPT (5.1% vs 6.0%, respectively; HR: 0.84; 95% CI: 0.53-1.35; P for interaction = 0.030). The co-primary bleeding outcome was lower with monotherapy than with DAPT in both STEMI (HR: 0.37; 95% CI: 0.22-0.61) and NSTE-ACS (HR: 0.45; 95% CI: 0.23-0.86) populations (P for interaction = 0.650)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with STEMI treated with percutaneous coronary intervention, early aspirin withdrawal may be harmful, because it increases the risk of ischemic events. Conversely, in NSTE-ACS, potent P2Y inhibitor monotherapy may be a viable therapeutic option: Ischemic event rates were similar and bleeding was reduced compared with DAPT. (Percutaneous Coronary Intervention Followed by Antiplatelet Monotherapy in the Setting of Acute Coronary Syndromes [NEOMINDSET]; NCT04360720)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41384891/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.058",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "3bb6615da412",
      "title": "Switching From Aspirin Monotherapy After Noncardioembolic Stroke: A Systematic Review and Network Meta-Analysis.",
      "journal": "Stroke",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118381",
      "abstract": "Patients who experience an ischemic stroke while on aspirin therapy present a clinical dilemma about optimal long-term secondary prevention. While switching to an alternative antithrombotic agent is often considered, the effectiveness of switching remains uncertain. We conducted a systematic review and network meta-analysis of randomized controlled trials reporting outcomes among patients with ischemic stroke while on aspirin and were either continued on aspirin or switched to an alternative antithrombotic therapy. Alternative antithrombotics included 2 trials of vitamin K antagonists (n=478), 3 trials of dual antiplatelet therapy (n=2229), 3 trials of direct oral anticoagulant (n=2660) monotherapy, and 1 trial of low-dose direct oral anticoagulant added onto aspirin (n=92). We excluded trials of patients with only short-term outcomes of 90 days or fewer, or those with cardioembolic sources of stroke requiring anticoagulation. Our primary outcome was recurrent ischemic stroke; the secondary outcome was a composite of ischemic stroke, myocardial infarction, and vascular death (or all-cause mortality). Outcomes reflect recurrent events measured over a median of ≈19 months (range 11-42 months). In the network portion of this meta-analysis, surface under the cumulative ranking curve rankings and pairwise meta-analyses were used to evaluate and compare the relative efficacy of alternative antithrombotic medications. Data were available from 9 studies (total N=5459 patients) for the outcome of recurrent ischemic stroke. Switching to another therapy was associated with a pooled relative risk of recurrent stroke of 0.88 (95% CI, 0.76-1.03) compared with continuing aspirin, with minimal heterogeneity (=0.93; ²=0). For the composite secondary outcome, 6 studies contributed data, yielding a pooled relative risk of 0.89 (95% CI, 0.72-1.10). In the network meta-analysis, dabigatran, apixaban, and aspirin+low-dose rivaroxaban ranked the highest among antithrombotic alternatives to aspirin, though none were significantly better than continuing aspirin. Rankings were similar when based on posterior estimates from the clinical trials and when using predictive distributions that incorporate between-study variance (ie, expected performance in future settings). Among patients experiencing ischemic stroke while taking aspirin, switching to an alternative antithrombotic therapy was not conclusively associated with a reduction in recurrent stroke and composite cardiovascular events. Trials are needed to determine whether specific antithrombotic strategies meaningfully improve outcomes in this high-risk population.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients who experience an ischemic stroke while on aspirin therapy present a clinical dilemma about optimal long-term secondary prevention. While switching to an alternative antithrombotic agent is often considered, the effectiveness of switching remains uncertain."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review and network meta-analysis of randomized controlled trials reporting outcomes among patients with ischemic stroke while on aspirin and were either continued on aspirin or switched to an alternative antithrombotic therapy. Alternative antithrombotics included 2 trials of vitamin K antagonists (n=478), 3 trials of dual antiplatelet therapy (n=2229), 3 trials of direct oral anticoagulant (n=2660) monotherapy, and 1 trial of low-dose direct oral anticoagulant added onto aspirin (n=92). We excluded trials of patients with only short-term outcomes of 90 days or fewer, or those with cardioembolic sources of stroke requiring anticoagulation. Our primary outcome was recurrent ischemic stroke; the secondary outcome was a composite of ischemic stroke, myocardial infarction, and vascular death (or all-cause mortality). Outcomes reflect recurrent events measured over a median of ≈19 months (range 11-42 months). In the network portion of this meta-analysis, surface under the cumulative ranking curve rankings and pairwise meta-analyses were used to evaluate and compare the relative efficacy of alternative antithrombotic medications."
        },
        {
          "label": "RESULTS",
          "text": "Data were available from 9 studies (total N=5459 patients) for the outcome of recurrent ischemic stroke. Switching to another therapy was associated with a pooled relative risk of recurrent stroke of 0.88 (95% CI, 0.76-1.03) compared with continuing aspirin, with minimal heterogeneity (=0.93; ²=0). For the composite secondary outcome, 6 studies contributed data, yielding a pooled relative risk of 0.89 (95% CI, 0.72-1.10). In the network meta-analysis, dabigatran, apixaban, and aspirin+low-dose rivaroxaban ranked the highest among antithrombotic alternatives to aspirin, though none were significantly better than continuing aspirin. Rankings were similar when based on posterior estimates from the clinical trials and when using predictive distributions that incorporate between-study variance (ie, expected performance in future settings)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients experiencing ischemic stroke while taking aspirin, switching to an alternative antithrombotic therapy was not conclusively associated with a reduction in recurrent stroke and composite cardiovascular events. Trials are needed to determine whether specific antithrombotic strategies meaningfully improve outcomes in this high-risk population."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41347302/",
      "pubDate": "2025 Dec 05",
      "doi": "10.1161/STROKEAHA.125.053030",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "4b061449431d",
      "title": "Scheduled birth at term for the prevention of pre-eclampsia (PREVENT-PE): an open-label randomised controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118348",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "faecf553f3ec",
      "title": "Lifestyle Interventions Addressing Blood Pressure in Children: A Systematic Review.",
      "journal": "JAMA Pediatr",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118313",
      "abstract": "The prevalence of high blood pressure in children is increasing, with health consequences reaching into adulthood. Individual-level interventions may help address the burden of high blood pressure at a population level, but there is less evidence from pediatric settings. To assess the effectiveness of school- or community-based lifestyle interventions to reduce high blood pressure in children (aged 3-18 years) and identify components that support effectiveness. Ovid MEDLINE, Embase, and PubMed were searched for studies from June 2013 to March 2024. Randomized clinical trials and quasi-experimental studies were assessed using the following strict inclusion criteria: longer than 6-month intervention duration, participants aged 3 to 18 years, major aim to modify cardiometabolic risk, and measurement of blood pressure before and after the intervention. Interventions aimed at specific patient groups were excluded. Quality assessment was performed using the Joanna Briggs Institute critical appraisal tools. Blood pressure before and after the intervention was extracted, with the mean difference in blood pressure recorded. Data analysis was performed from June 2023 to July 2024. A total of 27 studies were included, of which 13 reported a beneficial effect on blood pressure; 24 studies targeted physical activity, 15 targeted nutrition, 16 targeted education, and 11 included family involvement. Of 14 multicomponent studies, 9 reported a beneficial effect on blood pressure. In this systematic review, results indicate that lifestyle interventions can have a beneficial effect on blood pressure in the pediatric population, with multicomponent designs targeting both physical activity and nutrition showing the most promise. Future research should aim to further clarify intervention design and physical activity dosage, feasibility, and scalability, along with the long-term success of interventions that promote healthy blood pressure in children.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The prevalence of high blood pressure in children is increasing, with health consequences reaching into adulthood. Individual-level interventions may help address the burden of high blood pressure at a population level, but there is less evidence from pediatric settings."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the effectiveness of school- or community-based lifestyle interventions to reduce high blood pressure in children (aged 3-18 years) and identify components that support effectiveness."
        },
        {
          "label": "EVIDENCE REVIEW",
          "text": "Ovid MEDLINE, Embase, and PubMed were searched for studies from June 2013 to March 2024. Randomized clinical trials and quasi-experimental studies were assessed using the following strict inclusion criteria: longer than 6-month intervention duration, participants aged 3 to 18 years, major aim to modify cardiometabolic risk, and measurement of blood pressure before and after the intervention. Interventions aimed at specific patient groups were excluded. Quality assessment was performed using the Joanna Briggs Institute critical appraisal tools. Blood pressure before and after the intervention was extracted, with the mean difference in blood pressure recorded. Data analysis was performed from June 2023 to July 2024."
        },
        {
          "label": "FINDINGS",
          "text": "A total of 27 studies were included, of which 13 reported a beneficial effect on blood pressure; 24 studies targeted physical activity, 15 targeted nutrition, 16 targeted education, and 11 included family involvement. Of 14 multicomponent studies, 9 reported a beneficial effect on blood pressure."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review, results indicate that lifestyle interventions can have a beneficial effect on blood pressure in the pediatric population, with multicomponent designs targeting both physical activity and nutrition showing the most promise. Future research should aim to further clarify intervention design and physical activity dosage, feasibility, and scalability, along with the long-term success of interventions that promote healthy blood pressure in children."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324936/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamapediatrics.2025.4943",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "54a83d10ebd7",
      "title": "Trajectories of type 2 diabetes and cancer in 330 000 individuals with prediabetes: 20-year observational study in England.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118271",
      "abstract": "Higher than normal glucose concentrations have been linked to an increased risk of cancer. We aimed to describe the disease trajectories from prediabetes to cancer, accounting for the possible conversion to type 2 diabetes and risk of death. We used the Clinical Practice Research Datalink primary care records linked to hospital and mortality records to identify individuals aged 18-100 years with newly diagnosed prediabetes between Jan 1, 1998, and Nov 30, 2018, in England. Individuals were followed from the diagnosis of prediabetes until death or Nov 30, 2018, with two intermediate outcomes: type 2 diabetes and cancer. In a multistate model, we estimated state occupancy probabilities and lengths of stay (sojourn times) across eight states and seven transitions (eg, one transition from the prediabetes state to the cancer state; or three transitions from the prediabetes state to the type 2 diabetes, cancer, and death state). During a median follow-up of 7·7 years, 163 782 transitions occurred in 328 049 individuals. In both women and men, cancer incidence rates were greater in older individuals (aged ≥75 years at prediabetes diagnosis) and only marginally higher in those who developed type 2 diabetes versus those with prediabetes (over 10 years, the largest differences were 4·1 more cases per 1000 person-years in women and 4·8 more cases per 1000 person-years in men). 10 years after the diagnosis of prediabetes, the probability of remaining in the prediabetes state ranged from 23·2% (men aged ≥75 years at diagnosis) to 72·1% (men aged <55 years), the probability of death following prediabetes ranged from 1·2% (women aged <55 years) to 38·7% (women aged ≥75 years), the probability of developing type 2 diabetes and remaining in this state ranged from 7·9% (men aged ≥75 years) to 24·0% (women aged <55 years), and the probability of developing cancer and remaining in this state ranged from 1·9% (men aged <55 years) to 7·8% (men aged ≥65 to <75 years) in men and women. During the 10 years following the diagnosis of prediabetes, individuals spent between 5·34 years (men aged ≥75 years at diagnosis) to 8·34 years (men aged <55 years) in the prediabetes state. BMI, smoking, socioeconomic status, and ethnicity were associated with occupancy probabilities and sojourn times. The trajectories of type 2 diabetes and cancer following a diagnosis of prediabetes varied substantially by age at prediabetes diagnosis and, to a lesser extent, other sociodemographic and lifestyle factors, with most younger individuals (aged <55 years) remaining in the prediabetes state. Strategies to improve the prevention and early identification of type 2 diabetes and cancer in individuals with prediabetes should be tailored to the age at which prediabetes is diagnosed. National Institute for Health and Care Research (NIHR) Applied Research Collaboration, East Midlands, NIHR Leicester British Retail Consortium, Hope Against Cancer.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Higher than normal glucose concentrations have been linked to an increased risk of cancer. We aimed to describe the disease trajectories from prediabetes to cancer, accounting for the possible conversion to type 2 diabetes and risk of death."
        },
        {
          "label": "METHODS",
          "text": "We used the Clinical Practice Research Datalink primary care records linked to hospital and mortality records to identify individuals aged 18-100 years with newly diagnosed prediabetes between Jan 1, 1998, and Nov 30, 2018, in England. Individuals were followed from the diagnosis of prediabetes until death or Nov 30, 2018, with two intermediate outcomes: type 2 diabetes and cancer. In a multistate model, we estimated state occupancy probabilities and lengths of stay (sojourn times) across eight states and seven transitions (eg, one transition from the prediabetes state to the cancer state; or three transitions from the prediabetes state to the type 2 diabetes, cancer, and death state)."
        },
        {
          "label": "FINDINGS",
          "text": "During a median follow-up of 7·7 years, 163 782 transitions occurred in 328 049 individuals. In both women and men, cancer incidence rates were greater in older individuals (aged ≥75 years at prediabetes diagnosis) and only marginally higher in those who developed type 2 diabetes versus those with prediabetes (over 10 years, the largest differences were 4·1 more cases per 1000 person-years in women and 4·8 more cases per 1000 person-years in men). 10 years after the diagnosis of prediabetes, the probability of remaining in the prediabetes state ranged from 23·2% (men aged ≥75 years at diagnosis) to 72·1% (men aged <55 years), the probability of death following prediabetes ranged from 1·2% (women aged <55 years) to 38·7% (women aged ≥75 years), the probability of developing type 2 diabetes and remaining in this state ranged from 7·9% (men aged ≥75 years) to 24·0% (women aged <55 years), and the probability of developing cancer and remaining in this state ranged from 1·9% (men aged <55 years) to 7·8% (men aged ≥65 to <75 years) in men and women. During the 10 years following the diagnosis of prediabetes, individuals spent between 5·34 years (men aged ≥75 years at diagnosis) to 8·34 years (men aged <55 years) in the prediabetes state. BMI, smoking, socioeconomic status, and ethnicity were associated with occupancy probabilities and sojourn times."
        },
        {
          "label": "INTERPRETATION",
          "text": "The trajectories of type 2 diabetes and cancer following a diagnosis of prediabetes varied substantially by age at prediabetes diagnosis and, to a lesser extent, other sociodemographic and lifestyle factors, with most younger individuals (aged <55 years) remaining in the prediabetes state. Strategies to improve the prevention and early identification of type 2 diabetes and cancer in individuals with prediabetes should be tailored to the age at which prediabetes is diagnosed."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health and Care Research (NIHR) Applied Research Collaboration, East Midlands, NIHR Leicester British Retail Consortium, Hope Against Cancer."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41274303/",
      "pubDate": "2026 Jan",
      "doi": "10.1016/S2213-8587(25)00285-2",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    },
    {
      "id": "ebcabd3104c0",
      "title": "Blood pressure lowering in isolated diastolic hypertension and cardiovascular risk: an individual patient data meta-analysis.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49427975/118408",
      "abstract": "Blood pressure (BP) lowering reduces cardiovascular disease (CVD) risk; however, the benefits of treating patients with normal systolic BP but elevated diastolic BP remain uncertain. Data from 51 randomized controlled trials were pooled to compare BP-lowering effects in participants with and without isolated diastolic hypertension (IDH), defined as systolic BP < 130 mmHg and diastolic BP ≥ 80 mmHg. Treatment effects were stratified across baseline diastolic BP categories (range < 60 to ≥90 mmHg) among individuals with baseline systolic BP < 130 mmHg. Fixed-effect one-stage individual participant data meta-analyses were used, and Cox proportional hazard models, stratified by trial, were applied to analyse the data. Among 358 325 participants, 15 845 (4.4%) had IDH. At a median follow-up of 4.2 years, a 5 mmHg reduction in systolic BP reduced the risk of major cardiovascular events similarly in individuals with IDH [hazard ratio 0.91; 95% confidence interval (CI) 0.82-1.01] and those without IDH (hazard ratio 0.90; 95% CI 0.89-0.92; P for interaction = 1.00). Analyses by baseline diastolic BP showed no evidence of heterogeneity in treatment effects among individuals with baseline systolic BP < 130 mmHg (P for interaction = .26). Relative treatment effects were not statistically different by CVD history, age, prior medication use, and BP measurement methods. The study found no evidence to suggest that pharmacological BP-lowering therapy in individuals with IDH is less or more effective than in those without IDH. Relative risk reductions also did not diminish in those with lower diastolic BP, down to <60 mmHg at baseline. No meaningful differences across various clinical phenotypes were detected.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Blood pressure (BP) lowering reduces cardiovascular disease (CVD) risk; however, the benefits of treating patients with normal systolic BP but elevated diastolic BP remain uncertain."
        },
        {
          "label": "METHODS",
          "text": "Data from 51 randomized controlled trials were pooled to compare BP-lowering effects in participants with and without isolated diastolic hypertension (IDH), defined as systolic BP < 130 mmHg and diastolic BP ≥ 80 mmHg. Treatment effects were stratified across baseline diastolic BP categories (range < 60 to ≥90 mmHg) among individuals with baseline systolic BP < 130 mmHg. Fixed-effect one-stage individual participant data meta-analyses were used, and Cox proportional hazard models, stratified by trial, were applied to analyse the data."
        },
        {
          "label": "RESULTS",
          "text": "Among 358 325 participants, 15 845 (4.4%) had IDH. At a median follow-up of 4.2 years, a 5 mmHg reduction in systolic BP reduced the risk of major cardiovascular events similarly in individuals with IDH [hazard ratio 0.91; 95% confidence interval (CI) 0.82-1.01] and those without IDH (hazard ratio 0.90; 95% CI 0.89-0.92; P for interaction = 1.00). Analyses by baseline diastolic BP showed no evidence of heterogeneity in treatment effects among individuals with baseline systolic BP < 130 mmHg (P for interaction = .26). Relative treatment effects were not statistically different by CVD history, age, prior medication use, and BP measurement methods."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The study found no evidence to suggest that pharmacological BP-lowering therapy in individuals with IDH is less or more effective than in those without IDH. Relative risk reductions also did not diminish in those with lower diastolic BP, down to <60 mmHg at baseline. No meaningful differences across various clinical phenotypes were detected."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41384429/",
      "pubDate": "2025 Dec 12",
      "doi": "10.1093/eurheartj/ehaf962",
      "dateReceived": "2025-12-30T23:26:41.706Z",
      "isNew": false
    }
  ]
}