{
  "updated_at": "2025-11-20T23:25:02.989Z",
  "articles": [
    {
      "id": "d981e930fa7f",
      "title": "Lifestyle Intervention for Sustained Remission of Metabolic Syndrome: A Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118141",
      "abstract": "Prevalence of metabolic syndrome (MetS) defined as 3 or more cardiometabolic risk factors has grown to 43% among US adults. Lifestyle interventions produce benefits, but with limited sustainability. To determine whether a 6-month habit-based lifestyle program adds benefit to education and activity monitoring for sustained MetS remission at 24 months. The Enhancing Lifestyles in Metabolic Syndrome (ELM) study was a single-blind, individually randomized clinical trial of participants with MetS recruited from July 2019 to January 2022 at 5 locations in the US and followed up for 24 months. Eligible participants were motivated for lifestyle change and were contacted using electronic medical records and social or mass media; those who did not meet medical or logistical criteria were excluded. In all, 14 817 adults were screened during a 2.5 year period. Data were analyzed from March 2024 to May 2025. All participants received education and an activity monitor. Those in the intervention group also received 19 small group in-person meetings during 6 months, which sought to establish the following habits as part of their daily routine: vegetables at meals, brisk walks, sensory awareness, and emotion regulation. Repetition of these habits was encouraged by attention to participants' experience of immediate benefits and peer support. The comparator group received 24 evidence-based educational mailings monthly during the 24 months. MetS remission at 24 months determined by blinded laboratory evaluation and clinical examination. Secondary outcomes were cardiometabolic and lifestyle risk factors at 6 and 24 months. The analysis included 618 participants (mean [SD] age, 55.5 [11.0] years; 468 female [74.7%] and 150 male [24.3%] individuals), of whom 306 (49.5%) were randomized to the intervention and 312 (50.5%) to the comparator. The 24-month follow-up period was completed by 517 participants (83.7%). Obesity, measured by body mass index, was present in 513 participants (83%). At 6 months, the proportion achieving MetS remission was 24.8% in intervention group and 17.9% in comparator (adjusted odds ratio, 1.64; 95% CI, 1.07-2.53; P = .03), supported by improvements in waist circumference, triglycerides, fasting glucose, body mass index, weight, hemoglobin A1c, MetS severity, perceived stress, vegetable intake, moderate-intensity physical activity, daily steps, sensory awareness, and the habits of daily brisk walks and vegetables at meals. At 24 months, the proportion achieving sustained MetS remission was 27.8% (85 of 306 participants) in intervention group and 21.2% (66 of 312) in the comparator (adjusted odds ratio, 1.46; 95% CI, 1.01-2.14; P < .05), supported by sustained improvement in fasting glucose, vegetable intake, daily steps, sensory awareness, and the habit of daily brisk walks. This randomized clinical trial found that sustained MetS remission after treatment may be possible by promoting simple habits through a behavior-based lifestyle program focused on immediate benefits. ClinicalTrials.gov Identifier: NCT04036006.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Prevalence of metabolic syndrome (MetS) defined as 3 or more cardiometabolic risk factors has grown to 43% among US adults. Lifestyle interventions produce benefits, but with limited sustainability."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether a 6-month habit-based lifestyle program adds benefit to education and activity monitoring for sustained MetS remission at 24 months."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The Enhancing Lifestyles in Metabolic Syndrome (ELM) study was a single-blind, individually randomized clinical trial of participants with MetS recruited from July 2019 to January 2022 at 5 locations in the US and followed up for 24 months. Eligible participants were motivated for lifestyle change and were contacted using electronic medical records and social or mass media; those who did not meet medical or logistical criteria were excluded. In all, 14 817 adults were screened during a 2.5 year period. Data were analyzed from March 2024 to May 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "All participants received education and an activity monitor. Those in the intervention group also received 19 small group in-person meetings during 6 months, which sought to establish the following habits as part of their daily routine: vegetables at meals, brisk walks, sensory awareness, and emotion regulation. Repetition of these habits was encouraged by attention to participants' experience of immediate benefits and peer support. The comparator group received 24 evidence-based educational mailings monthly during the 24 months."
        },
        {
          "label": "MAIN OUTCOME AND MEASURES",
          "text": "MetS remission at 24 months determined by blinded laboratory evaluation and clinical examination. Secondary outcomes were cardiometabolic and lifestyle risk factors at 6 and 24 months."
        },
        {
          "label": "RESULTS",
          "text": "The analysis included 618 participants (mean [SD] age, 55.5 [11.0] years; 468 female [74.7%] and 150 male [24.3%] individuals), of whom 306 (49.5%) were randomized to the intervention and 312 (50.5%) to the comparator. The 24-month follow-up period was completed by 517 participants (83.7%). Obesity, measured by body mass index, was present in 513 participants (83%). At 6 months, the proportion achieving MetS remission was 24.8% in intervention group and 17.9% in comparator (adjusted odds ratio, 1.64; 95% CI, 1.07-2.53; P = .03), supported by improvements in waist circumference, triglycerides, fasting glucose, body mass index, weight, hemoglobin A1c, MetS severity, perceived stress, vegetable intake, moderate-intensity physical activity, daily steps, sensory awareness, and the habits of daily brisk walks and vegetables at meals. At 24 months, the proportion achieving sustained MetS remission was 27.8% (85 of 306 participants) in intervention group and 21.2% (66 of 312) in the comparator (adjusted odds ratio, 1.46; 95% CI, 1.01-2.14; P < .05), supported by sustained improvement in fasting glucose, vegetable intake, daily steps, sensory awareness, and the habit of daily brisk walks."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial found that sustained MetS remission after treatment may be possible by promoting simple habits through a behavior-based lifestyle program focused on immediate benefits."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04036006."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41207299/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jamainternmed.2025.5900",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "A behavior-based lifestyle program emphasizing immediate benefits can lead to sustained remission of metabolic syndrome."
    },
    {
      "id": "339ca3c122cd",
      "title": "Semaglutide for adults living with obesity.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118132",
      "abstract": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity. To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity. We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024. We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months. Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities. We used the original version of the Cochrane tool for assessing risk of bias (RoB 1). We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo. We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing. Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity. World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the original version of the Cochrane tool for assessing risk of bias (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity."
        },
        {
          "label": "FUNDING",
          "text": "World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161687/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1002/14651858.CD016018",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "Tirzepatide appears to cause weight loss that lasts over time, but its effects on other health outcomes and the reasons people stop taking it are not well understood, and independent research is needed."
    },
    {
      "id": "b84921a098b8",
      "title": "Olezarsen for Managing Severe Hypertriglyceridemia and Pancreatitis Risk.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118124",
      "abstract": "Patients with severe hypertriglyceridemia have an increased risk of acute pancreatitis. The efficacy and safety of olezarsen, an antisense oligonucleotide targeting apolipoprotein C-III messenger RNA, have not been established in this population. We conducted two double-blind, randomized, placebo-controlled trials (CORE-TIMI 72a and CORE2-TIMI 72b). Patients with severe hypertriglyceridemia were assigned in a 1:1:1 ratio to receive olezarsen at a dose of 50 mg, olezarsen at a dose of 80 mg, or placebo monthly for 12 months. The primary outcome was the percent change from baseline in the triglyceride level at 6 months, reported as the difference between each olezarsen dose group and the placebo group (placebo-adjusted change). Secondary lipid outcomes included the percent change from baseline in the triglyceride level at 12 months and in the levels of apolipoprotein C-III, remnant cholesterol, and non-high-density lipoprotein (non-HDL) cholesterol at 6 months and 12 months. Acute pancreatitis events were assessed across both trials. A total of 1061 patients were included in the primary analysis (617 in the CORE-TIMI 72a trial and 444 in the CORE2-TIMI 72b trial). At 6 months, the placebo-adjusted least-squares mean change from baseline in the triglyceride level was -62.9 percentage points in the olezarsen 50-mg group and -72.2 percentage points in the olezarsen 80-mg group in the CORE-TIMI 72a trial and was -49.2 percentage points in the olezarsen 50-mg group and -54.5 percentage points in the olezarsen 80-mg group in the CORE2-TIMI 72b trial (P<0.001 for all comparisons of olezarsen with placebo). Decreases in the levels of triglycerides, apolipoprotein C-III, remnant cholesterol, and non-HDL cholesterol were greater with olezarsen than with placebo (P<0.001 for all comparisons). The incidence of acute pancreatitis was lower with olezarsen than with placebo (mean rate ratio, 0.15; 95% confidence interval, 0.05 to 0.40; P<0.001). The incidence of any adverse events appeared to be similar across trial groups. Elevations in liver-enzyme levels and thrombocytopenia (platelet count, <100,000 per microliter) were more common with the 80-mg dose of olezarsen, and a dose-dependent increase in the hepatic fat fraction was noted. Among patients with severe hypertriglyceridemia, treatment with olezarsen led to a significantly greater reduction in the triglyceride level at 6 months and in the incidence of acute pancreatitis than placebo. (Funded by Ionis Pharmaceuticals; CORE-TIMI 72a and CORE2-TIMI 72b ClinicalTrials.gov numbers, NCT05079919 and NCT05552326.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients with severe hypertriglyceridemia have an increased risk of acute pancreatitis. The efficacy and safety of olezarsen, an antisense oligonucleotide targeting apolipoprotein C-III messenger RNA, have not been established in this population."
        },
        {
          "label": "METHODS",
          "text": "We conducted two double-blind, randomized, placebo-controlled trials (CORE-TIMI 72a and CORE2-TIMI 72b). Patients with severe hypertriglyceridemia were assigned in a 1:1:1 ratio to receive olezarsen at a dose of 50 mg, olezarsen at a dose of 80 mg, or placebo monthly for 12 months. The primary outcome was the percent change from baseline in the triglyceride level at 6 months, reported as the difference between each olezarsen dose group and the placebo group (placebo-adjusted change). Secondary lipid outcomes included the percent change from baseline in the triglyceride level at 12 months and in the levels of apolipoprotein C-III, remnant cholesterol, and non-high-density lipoprotein (non-HDL) cholesterol at 6 months and 12 months. Acute pancreatitis events were assessed across both trials."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1061 patients were included in the primary analysis (617 in the CORE-TIMI 72a trial and 444 in the CORE2-TIMI 72b trial). At 6 months, the placebo-adjusted least-squares mean change from baseline in the triglyceride level was -62.9 percentage points in the olezarsen 50-mg group and -72.2 percentage points in the olezarsen 80-mg group in the CORE-TIMI 72a trial and was -49.2 percentage points in the olezarsen 50-mg group and -54.5 percentage points in the olezarsen 80-mg group in the CORE2-TIMI 72b trial (P<0.001 for all comparisons of olezarsen with placebo). Decreases in the levels of triglycerides, apolipoprotein C-III, remnant cholesterol, and non-HDL cholesterol were greater with olezarsen than with placebo (P<0.001 for all comparisons). The incidence of acute pancreatitis was lower with olezarsen than with placebo (mean rate ratio, 0.15; 95% confidence interval, 0.05 to 0.40; P<0.001). The incidence of any adverse events appeared to be similar across trial groups. Elevations in liver-enzyme levels and thrombocytopenia (platelet count, <100,000 per microliter) were more common with the 80-mg dose of olezarsen, and a dose-dependent increase in the hepatic fat fraction was noted."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with severe hypertriglyceridemia, treatment with olezarsen led to a significantly greater reduction in the triglyceride level at 6 months and in the incidence of acute pancreatitis than placebo. (Funded by Ionis Pharmaceuticals; CORE-TIMI 72a and CORE2-TIMI 72b ClinicalTrials.gov numbers, NCT05079919 and NCT05552326.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211918/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2512761",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "Olezarsen effectively lowered triglycerides and reduced pancreatitis risk in patients with severe hypertriglyceridemia compared to a placebo."
    },
    {
      "id": "ac3b5bea5c23",
      "title": "Beta-Blockers after Myocardial Infarction with Normal Ejection Fraction.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118122",
      "abstract": "The benefit of beta-blockers after myocardial infarction in patients with a preserved left ventricular ejection fraction (LVEF) is unclear. We conducted a meta-analysis at the individual-patient level using data from five open-label trials that randomly assigned patients with recent myocardial infarction, no other indications for beta-blocker therapy, and an LVEF of at least 50% to receive beta-blocker therapy or no beta-blocker therapy. The primary end point was a composite of death from any cause, myocardial infarction, or heart failure. Event rates were analyzed with a one-stage fixed-effects Cox proportional-hazards model. A total of 17,801 patients were included from the REBOOT (7459 patients), REDUCE-AMI (4967 patients), BETAMI (2441 patients), DANBLOCK (2277 patients), and CAPITAL-RCT (657 patients) trials. Of these 17,801 patients, 8831 (49.6%) were assigned to receive a beta-blocker and 8970 (50.4%) were assigned to receive no beta-blocker. During a median follow-up of 3.6 years (interquartile range, 2.3 to 4.6), a primary-end-point event occurred in 717 patients (8.1%) in the beta-blocker group and 748 patients (8.3%) in the no-beta-blocker group (hazard ratio, 0.97; 95% confidence interval [CI], 0.87 to 1.07; P = 0.54). Death from any cause occurred in 335 patients in the beta-blocker group and 326 patients in the no-beta-blocker group (hazard ratio, 1.04; 95% CI, 0.89 to 1.21); myocardial infarction occurred in 360 and 407 patients, respectively (hazard ratio, 0.89; 95% CI, 0.77 to 1.03); and heart failure occurred in 75 and 87 patients (hazard ratio, 0.87; 95% CI, 0.64 to 1.19). In this meta-analysis including individual-patient data from five randomized trials, beta-blocker therapy did not reduce the incidence of death from any cause, myocardial infarction, or heart failure in patients with an LVEF of at least 50% after myocardial infarction without other indications for beta-blockers. (Funded by Centro Nacional de Investigaciones Cardiovasculares Carlos III and others; PROSPERO database number, CRD420251119176.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The benefit of beta-blockers after myocardial infarction in patients with a preserved left ventricular ejection fraction (LVEF) is unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted a meta-analysis at the individual-patient level using data from five open-label trials that randomly assigned patients with recent myocardial infarction, no other indications for beta-blocker therapy, and an LVEF of at least 50% to receive beta-blocker therapy or no beta-blocker therapy. The primary end point was a composite of death from any cause, myocardial infarction, or heart failure. Event rates were analyzed with a one-stage fixed-effects Cox proportional-hazards model."
        },
        {
          "label": "RESULTS",
          "text": "A total of 17,801 patients were included from the REBOOT (7459 patients), REDUCE-AMI (4967 patients), BETAMI (2441 patients), DANBLOCK (2277 patients), and CAPITAL-RCT (657 patients) trials. Of these 17,801 patients, 8831 (49.6%) were assigned to receive a beta-blocker and 8970 (50.4%) were assigned to receive no beta-blocker. During a median follow-up of 3.6 years (interquartile range, 2.3 to 4.6), a primary-end-point event occurred in 717 patients (8.1%) in the beta-blocker group and 748 patients (8.3%) in the no-beta-blocker group (hazard ratio, 0.97; 95% confidence interval [CI], 0.87 to 1.07; P = 0.54). Death from any cause occurred in 335 patients in the beta-blocker group and 326 patients in the no-beta-blocker group (hazard ratio, 1.04; 95% CI, 0.89 to 1.21); myocardial infarction occurred in 360 and 407 patients, respectively (hazard ratio, 0.89; 95% CI, 0.77 to 1.03); and heart failure occurred in 75 and 87 patients (hazard ratio, 0.87; 95% CI, 0.64 to 1.19)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this meta-analysis including individual-patient data from five randomized trials, beta-blocker therapy did not reduce the incidence of death from any cause, myocardial infarction, or heart failure in patients with an LVEF of at least 50% after myocardial infarction without other indications for beta-blockers. (Funded by Centro Nacional de Investigaciones Cardiovasculares Carlos III and others; PROSPERO database number, CRD420251119176.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211954/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1056/NEJMoa2512686",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "Beta-blocker therapy did not improve outcomes in patients with a preserved ejection fraction (LVEF ≥50%) after a heart attack without other reasons to take beta-blockers."
    },
    {
      "id": "17609b1f03eb",
      "title": "Oral Icotrokinra for Plaque Psoriasis in Adults and Adolescents.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118090",
      "abstract": "Icotrokinra, a targeted oral peptide that selectively binds the interleukin-23 receptor, is under investigation for the treatment of plaque psoriasis. We conducted a phase 3, double-blind, randomized, placebo-controlled trial involving adults and adolescents (≥12 years of age) with moderate-to-severe plaque psoriasis, as defined by all the following: a total body-surface area of psoriasis involvement of at least 10%, a Psoriasis Area and Severity Index (PASI) score of at least 12 (range, 0 to 72, with higher scores indicating a greater extent or severity of psoriasis), and an Investigator's Global Assessment (IGA) score of at least 3 (range, 0 [clear skin] to 4 [severe disease]). Participants were assigned in a 2:1 ratio to receive icotrokinra at a dose of 200 mg once daily through week 24 or placebo through week 16 followed by transition to icotrokinra. The coprimary end points were an IGA 0/1 response (IGA score of 0 or 1 with ≥2-point reduction from baseline) and a PASI 90 response (≥90% reduction from baseline in the PASI score) at week 16. A total of 684 participants underwent randomization (456 to the icotrokinra group and 228 to the placebo group). At week 16, a total of 65% of the participants receiving icotrokinra and 8% of those receiving placebo had an IGA 0/1 response, and 50% and 4%, respectively, had a PASI 90 response (P<0.001 for both comparisons). Complete clearance of skin at week 16 was significantly more likely with icotrokinra than with placebo (IGA score of 0, 33% vs. 1%; PASI 100 response [100% reduction from baseline in the PASI score], 27% vs. <1%; P<0.001 for both comparisons). The percentage of participants with at least one adverse event through week 16 was 49% in each group; the most common adverse events in each group were nasopharyngitis and upper respiratory tract infection. The exposure-adjusted incidence of adverse events was consistent through week 24. Selective blockade of the interleukin-23 receptor with the targeted oral peptide icotrokinra resulted in a significantly higher incidence of skin clearance at week 16 than placebo among adults and adolescents with moderate-to-severe plaque psoriasis. Longer-term data will provide a more complete understanding of the benefit-risk profile of icotrokinra. (Funded by Johnson & Johnson; ICONIC-LEAD ClinicalTrials.gov number, NCT06095115.)See also in : Targeted Oral Peptide Icotrokinra for Psoriasis Involving High‑Impact Sites.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Icotrokinra, a targeted oral peptide that selectively binds the interleukin-23 receptor, is under investigation for the treatment of plaque psoriasis."
        },
        {
          "label": "METHODS",
          "text": "We conducted a phase 3, double-blind, randomized, placebo-controlled trial involving adults and adolescents (≥12 years of age) with moderate-to-severe plaque psoriasis, as defined by all the following: a total body-surface area of psoriasis involvement of at least 10%, a Psoriasis Area and Severity Index (PASI) score of at least 12 (range, 0 to 72, with higher scores indicating a greater extent or severity of psoriasis), and an Investigator's Global Assessment (IGA) score of at least 3 (range, 0 [clear skin] to 4 [severe disease]). Participants were assigned in a 2:1 ratio to receive icotrokinra at a dose of 200 mg once daily through week 24 or placebo through week 16 followed by transition to icotrokinra. The coprimary end points were an IGA 0/1 response (IGA score of 0 or 1 with ≥2-point reduction from baseline) and a PASI 90 response (≥90% reduction from baseline in the PASI score) at week 16."
        },
        {
          "label": "RESULTS",
          "text": "A total of 684 participants underwent randomization (456 to the icotrokinra group and 228 to the placebo group). At week 16, a total of 65% of the participants receiving icotrokinra and 8% of those receiving placebo had an IGA 0/1 response, and 50% and 4%, respectively, had a PASI 90 response (P<0.001 for both comparisons). Complete clearance of skin at week 16 was significantly more likely with icotrokinra than with placebo (IGA score of 0, 33% vs. 1%; PASI 100 response [100% reduction from baseline in the PASI score], 27% vs. <1%; P<0.001 for both comparisons). The percentage of participants with at least one adverse event through week 16 was 49% in each group; the most common adverse events in each group were nasopharyngitis and upper respiratory tract infection. The exposure-adjusted incidence of adverse events was consistent through week 24."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Selective blockade of the interleukin-23 receptor with the targeted oral peptide icotrokinra resulted in a significantly higher incidence of skin clearance at week 16 than placebo among adults and adolescents with moderate-to-severe plaque psoriasis. Longer-term data will provide a more complete understanding of the benefit-risk profile of icotrokinra. (Funded by Johnson & Johnson; ICONIC-LEAD ClinicalTrials.gov number, NCT06095115.)See also in : Targeted Oral Peptide Icotrokinra for Psoriasis Involving High‑Impact Sites."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41191940/",
      "pubDate": "2025 Nov 06",
      "doi": "10.1056/NEJMoa2504187",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "Icotrokinra, a selective interleukin-23 receptor blocker, demonstrated significantly improved skin clearance compared to placebo in adults and adolescents with moderate-to-severe plaque psoriasis at 16 weeks."
    },
    {
      "id": "0ef71c8aa274",
      "title": "Diabetic Foot Ulcer Beyond Wound Closure: Clinical Practice Guideline.",
      "journal": "Phys Ther",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118082",
      "abstract": "A total of 37.3 million Americans have diabetes, and 96 million more have prediabetes. Hyperglycemia, the hallmark of diabetes, increases the risk for diabetes-related complications, including skin breakdown and cardiovascular disease. Many clinical practice guidelines exist, but there are gaps regarding the best approaches to assess physical fitness and mobility in adults with diabetes; incorporate exercise into the care plan; and reload the diabetic foot after ulcer closure has occurred to avoid ulcer reoccurrence. The purpose of this clinical practice guideline was to review and assess previously published guidelines and address gaps within the guidelines specific to the following: best screening tools/tests and interventions to prevent a future reulceration, best screening tools and interventions to assess and address mobility impairments, best tools to measure and interventions to address reduced physical fitness and activity, best approach to reloading the foot after ulceration closure and, finally, whether improvement in physical fitness will positively change quality of life and health care costs. The Guidelines Development Group performed a systematic literature search and review of the literature. A total of 701 studies were identified. Following duplicate removal and exclusion for irrelevance, 125 studies underwent full-text review, and 38 studies were included. Recommendations were developed using a software assistant created specifically for guideline recommendation development. Recommendations resulted for physical fitness and activity inclusion and measurement for adults with diabetes and with or without foot ulceration. Exercise and physical activity should be prescribed according to the physiologic response of an adult with diabetes to exercise and preferences for optimizing long-term quality of life and reduce health care costs. Reloading following diabetic foot ulcer closure should include maximal offloading, especially during the first 3 months; loading should be titrated using a footwear schedule. Further research is necessary in the areas of exercise in the wound healing process and the assessment of methods to reload a newly reepithelialized ulcer to prevent recurrence.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/39574416/",
      "pubDate": "2025 Jan 08",
      "doi": "10.1093/ptj/pzae171",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "Exercise and physical activity should be tailored to the individual's physiological response and preferences to improve long-term quality of life and reduce healthcare costs, and reloading the foot after ulcer closure requires maximal offloading, particularly in the initial three months."
    },
    {
      "id": "af51107ceb2c",
      "title": "Double-blind randomized controlled trial of Er: YAG vaginal laser to treat female stress urinary incontinence.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48892119/118083",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true
    },
    {
      "id": "60087dc11c40",
      "title": "PCI of Native Coronary Artery vs Saphenous Vein Graft After Prior Bypass Surgery: A Multicenter, Randomized Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48892119/118040",
      "abstract": "In patients with prior coronary artery bypass grafting (CABG) presenting with graft failure, current guidelines recommend percutaneous coronary intervention (PCI) of the bypassed native coronary artery over PCI of the bypass graft. However, this recommendation relies solely on observational data. This study compared clinical outcomes between a strategy of native vessel PCI with saphenous vein graft (SVG) PCI in post-CABG patients presenting with SVG failure. The multicenter, randomized PROCTOR (Percutaneous Coronary Intervention of Native Coronary Artery versus Saphenous Vein Graft in Patients with Prior Coronary Artery Bypass Graft Surgery) trial included patients with significant SVG stenosis and a heart team-defined clinical indication for revascularization. Patients were randomly assigned (1:1) to either a strategy of native vessel PCI or SVG PCI using an interactive web-based randomization platform. The trial was conducted across 14 centers in Europe. We report the occurrence of major adverse cardiac events at 1 year following the index PCI, defined as the composite of all-cause mortality, nonfatal target coronary territory myocardial infarction (MI), or clinically driven target coronary territory revascularization, analyzed on an intention-to-treat basis. The trial is registered with ClinicalTrials.gov (NCT03805048), and long-term follow-up is ongoing. Between January 2019 and December 2023, 220 patients (mean age 73 ± 7 years; 84% men [185/220 patients]) were randomized to a strategy of native vessel PCI (n = 108) or SVG PCI (n = 112). At 1 year, major adverse cardiac events occurred in 37 patients (34%) in the native vessel PCI group and 21 patients (19%) in the SVG PCI group (HR: 2.14; 95% CI: 1.25-3.65; P = 0.006). There was no significant difference in all-cause mortality (HR: 1.59; 95% CI: 0.45-5.64; P = 0.472), whereas both nonfatal target coronary territory MI (HR: 2.12; 95% CI: 1.08-4.17; P = 0.029) and clinically driven target coronary territory revascularization (HR: 2.19; 95% CI: 1.02-4.72; P = 0.044) occurred more frequently in patients assigned to native vessel PCI. The incidence of PCI-related MI was 13% in the native vessel PCI group and 1% in the SVG PCI group (HR: 14.85; 95% CI: 1.95-112.96; P = 0.009). In the randomized PROCTOR trial, SVG PCI was associated with improved 1-year clinical outcomes compared with native vessel PCI, primarily driven by lower rates of PCI-related MI and clinically driven target coronary territory revascularization.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In patients with prior coronary artery bypass grafting (CABG) presenting with graft failure, current guidelines recommend percutaneous coronary intervention (PCI) of the bypassed native coronary artery over PCI of the bypass graft. However, this recommendation relies solely on observational data."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study compared clinical outcomes between a strategy of native vessel PCI with saphenous vein graft (SVG) PCI in post-CABG patients presenting with SVG failure."
        },
        {
          "label": "METHODS",
          "text": "The multicenter, randomized PROCTOR (Percutaneous Coronary Intervention of Native Coronary Artery versus Saphenous Vein Graft in Patients with Prior Coronary Artery Bypass Graft Surgery) trial included patients with significant SVG stenosis and a heart team-defined clinical indication for revascularization. Patients were randomly assigned (1:1) to either a strategy of native vessel PCI or SVG PCI using an interactive web-based randomization platform. The trial was conducted across 14 centers in Europe. We report the occurrence of major adverse cardiac events at 1 year following the index PCI, defined as the composite of all-cause mortality, nonfatal target coronary territory myocardial infarction (MI), or clinically driven target coronary territory revascularization, analyzed on an intention-to-treat basis. The trial is registered with ClinicalTrials.gov (NCT03805048), and long-term follow-up is ongoing."
        },
        {
          "label": "RESULTS",
          "text": "Between January 2019 and December 2023, 220 patients (mean age 73 ± 7 years; 84% men [185/220 patients]) were randomized to a strategy of native vessel PCI (n = 108) or SVG PCI (n = 112). At 1 year, major adverse cardiac events occurred in 37 patients (34%) in the native vessel PCI group and 21 patients (19%) in the SVG PCI group (HR: 2.14; 95% CI: 1.25-3.65; P = 0.006). There was no significant difference in all-cause mortality (HR: 1.59; 95% CI: 0.45-5.64; P = 0.472), whereas both nonfatal target coronary territory MI (HR: 2.12; 95% CI: 1.08-4.17; P = 0.029) and clinically driven target coronary territory revascularization (HR: 2.19; 95% CI: 1.02-4.72; P = 0.044) occurred more frequently in patients assigned to native vessel PCI. The incidence of PCI-related MI was 13% in the native vessel PCI group and 1% in the SVG PCI group (HR: 14.85; 95% CI: 1.95-112.96; P = 0.009)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In the randomized PROCTOR trial, SVG PCI was associated with improved 1-year clinical outcomes compared with native vessel PCI, primarily driven by lower rates of PCI-related MI and clinically driven target coronary territory revascularization."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159978/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1016/j.jacc.2025.09.1577",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "SVG PCI resulted in better 1-year clinical outcomes than native vessel PCI, mainly due to fewer heart attacks related to the procedure and less need for repeat procedures in the treated area."
    },
    {
      "id": "59745d3a7f74",
      "title": "Falling short on implementation of fall prevention guidelines in health services: a systematic review with meta-analysis.",
      "journal": "Age Ageing",
      "score": "6/7",
      "tags": [
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48892119/118014",
      "abstract": "Falls are a serious risk for people who use health services. We aimed to evaluate the implementation of fall prevention guidelines in health services. Databases and grey literature were searched for studies of the implementation of fall prevention guidelines in health services. Implementation outcomes were aligned with the reach, effectiveness, adoption, implementation and maintenance framework. The methodological quality of included papers was assessed using an internal validity checklist. Results were synthesised using narrative synthesis and meta-analysis. The certainty of evidence of each meta-analysis was assessed using the Grading of Recommendations Assessment, Development and Evaluation framework. Fifty-five studies of over 115 000 patients implemented recommendations from 14 fall prevention guidelines. Methodological quality was generally poor (median of 5 of 13 internal validity criteria). Median reach of guideline implementation was 64% (range 38%-96%, five studies). Meta-analysis provided low certainty evidence that implementing guidelines did not prevent falls [falls risk ratio 1.01, 95% confidence interval (CI) = 0.81-1.26; falls rate ratio 1.06, 95% CI = 0.77-1.46]. Adoption of fall prevention recommendations by health professionals improved in 87% of recorded outcomes across 43 studies and was maintained 50% of the time. Adherence of patients to recommendations, however, varied from 7% to 73%. Two studies assessed maintenance of reduced falls percentage or rates and found that changes were sustained. Implementation of fall prevention guidelines in health services can change and sometimes sustain fall prevention behaviour of health professionals. It is uncertain whether implementation leads to reduced falls or changes in patient behaviour.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Falls are a serious risk for people who use health services. We aimed to evaluate the implementation of fall prevention guidelines in health services."
        },
        {
          "label": "METHODS",
          "text": "Databases and grey literature were searched for studies of the implementation of fall prevention guidelines in health services. Implementation outcomes were aligned with the reach, effectiveness, adoption, implementation and maintenance framework. The methodological quality of included papers was assessed using an internal validity checklist. Results were synthesised using narrative synthesis and meta-analysis. The certainty of evidence of each meta-analysis was assessed using the Grading of Recommendations Assessment, Development and Evaluation framework."
        },
        {
          "label": "RESULTS",
          "text": "Fifty-five studies of over 115 000 patients implemented recommendations from 14 fall prevention guidelines. Methodological quality was generally poor (median of 5 of 13 internal validity criteria). Median reach of guideline implementation was 64% (range 38%-96%, five studies). Meta-analysis provided low certainty evidence that implementing guidelines did not prevent falls [falls risk ratio 1.01, 95% confidence interval (CI) = 0.81-1.26; falls rate ratio 1.06, 95% CI = 0.77-1.46]. Adoption of fall prevention recommendations by health professionals improved in 87% of recorded outcomes across 43 studies and was maintained 50% of the time. Adherence of patients to recommendations, however, varied from 7% to 73%. Two studies assessed maintenance of reduced falls percentage or rates and found that changes were sustained."
        },
        {
          "label": "CONCLUSION",
          "text": "Implementation of fall prevention guidelines in health services can change and sometimes sustain fall prevention behaviour of health professionals. It is uncertain whether implementation leads to reduced falls or changes in patient behaviour."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41134532/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf307",
      "dateReceived": "2025-11-19T23:25:34.441Z",
      "isNew": true,
      "summary": "Implementing fall prevention guidelines can alter healthcare professionals' fall prevention practices, but the impact on patient falls or behavior is unclear."
    },
    {
      "id": "14bbfb082526",
      "title": "Ketogenic Diets and Depression and Anxiety: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48991376/118163",
      "abstract": "Ketogenic diets (KDs) have been hypothesized to influence mental health through pathways involving mitochondrial function, inflammation, and neurotransmitters, but their therapeutic value in psychiatric populations remains uncertain. To assess the associations between KDs and mental health outcomes in adults, with a focus on depressive and anxiety symptoms. MEDLINE, Embase, and APA PsycINFO were searched on April 18, 2025. Additional studies were identified through manual searches and clinical trial registries. Studies involving adults aged 18 years or older receiving a KD (<26% energy from carbohydrates or <50 g/day) and assessed with validated psychiatric scales were eligible. Designs included randomized clinical trials (RCTs), quasi-experimental (QSE) studies, cross-sectional studies, case series, and case reports. Data were extracted by 1 reviewer and verified by 2 others. Risk of bias was assessed using critical appraisal tools from the Joanna Briggs Institute. Random-effects meta-analyses were run separately for RCTs and QSEs. The primary outcome was changes in psychiatric symptom severity measured by standardized scales, reported as standardized mean differences (SMDs) or standardized mean change using change scores (SMCCs). A total of 50 studies (41 718 participants) were included. Ten RCTs on KD for depressive symptoms vs control diets showed a significant association (SMD, -0.48; 95% CI, -0.87 to -0.10; I2 = 67.2%), with stronger associations in studies using ketone monitoring, nonobese participants, very low-carbohydrate interventions, and non-high-carbohydrate comparators. Nine RCTs on anxiety showed no significant association (SMD, -0.03; 95% CI, -0.18 to 0.12; I2 = 41%). In QSEs, 9 on depressive symptoms showed a consistent association (SMCC, -0.66; 95% CI, -0.83 to -0.50; I2 = 0%), and 6 on anxiety showed similar results (SMCC, -0.58; 95% CI, -0.81 to -0.36; I2 = 0%). In this systematic review and meta-analysis, KDs were associated with modest improvements in depressive symptoms, particularly with biochemical ketosis verification, while anxiety evidence was inconclusive. Given heterogeneity, comparators, and short follow-up, well-powered trials with standardized, verified protocols, structured support, and prespecified outcomes are needed to confirm efficacy and durability.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Ketogenic diets (KDs) have been hypothesized to influence mental health through pathways involving mitochondrial function, inflammation, and neurotransmitters, but their therapeutic value in psychiatric populations remains uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the associations between KDs and mental health outcomes in adults, with a focus on depressive and anxiety symptoms."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, and APA PsycINFO were searched on April 18, 2025. Additional studies were identified through manual searches and clinical trial registries."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Studies involving adults aged 18 years or older receiving a KD (<26% energy from carbohydrates or <50 g/day) and assessed with validated psychiatric scales were eligible. Designs included randomized clinical trials (RCTs), quasi-experimental (QSE) studies, cross-sectional studies, case series, and case reports."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Data were extracted by 1 reviewer and verified by 2 others. Risk of bias was assessed using critical appraisal tools from the Joanna Briggs Institute. Random-effects meta-analyses were run separately for RCTs and QSEs."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was changes in psychiatric symptom severity measured by standardized scales, reported as standardized mean differences (SMDs) or standardized mean change using change scores (SMCCs)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 50 studies (41 718 participants) were included. Ten RCTs on KD for depressive symptoms vs control diets showed a significant association (SMD, -0.48; 95% CI, -0.87 to -0.10; I2 = 67.2%), with stronger associations in studies using ketone monitoring, nonobese participants, very low-carbohydrate interventions, and non-high-carbohydrate comparators. Nine RCTs on anxiety showed no significant association (SMD, -0.03; 95% CI, -0.18 to 0.12; I2 = 41%). In QSEs, 9 on depressive symptoms showed a consistent association (SMCC, -0.66; 95% CI, -0.83 to -0.50; I2 = 0%), and 6 on anxiety showed similar results (SMCC, -0.58; 95% CI, -0.81 to -0.36; I2 = 0%)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis, KDs were associated with modest improvements in depressive symptoms, particularly with biochemical ketosis verification, while anxiety evidence was inconclusive. Given heterogeneity, comparators, and short follow-up, well-powered trials with standardized, verified protocols, structured support, and prespecified outcomes are needed to confirm efficacy and durability."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41191382/",
      "pubDate": "2025 Nov 05",
      "doi": "10.1001/jamapsychiatry.2025.3261",
      "dateReceived": "2025-11-19T23:25:34.440Z",
      "isNew": true,
      "summary": "Ketogenic diets may slightly improve depressive symptoms when ketosis is confirmed, but their effect on anxiety is uncertain, and further research is needed."
    },
    {
      "id": "68ecf5828a70",
      "title": "Tirzepatide for adults living with obesity.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118131",
      "abstract": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity. To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity. We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024. We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months. Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities. We used the original version of the Cochrane tool for assessing risk of bias (RoB 1). We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo. We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing. Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity. World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Obesity is a complex chronic condition linked to various comorbidities, such as hypertension, diabetes, and dyslipidaemia, with a significant global burden. Standard treatments, such as diet, exercise and behavioural changes, often have limited effects and poor compliance. Pharmacological options, including glucagon-like peptide receptor agonists (GLP-1RAs) and glucose-dependent insulinotropic polypeptide (GIP) dual agonists, show promise for individuals with obesity. This is one of three reviews investigating different GIP/GLP1-RAs for adults living with obesity."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of the dual GIP/GLP-1 receptor agonist, tirzepatide, for adults living with obesity."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, LILACS and two trials registries on 17 December 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) on adults with obesity that compared tirzepatide at any dose with placebo, structured lifestyle modification programmes, another anti-obesity medication or other GLP-1RAs or GIP/GLP-1RAs, with a minimum follow-up of six months."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were weight, adverse events, major adverse cardiovascular events (MACE), quality of life, and mortality. Important outcomes included waist circumference and other obesity-related comorbidities."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the original version of the Cochrane tool for assessing risk of bias (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using meta-analysis with a random-effects model. Where this was not possible, we described the results narratively. We used GRADE to assess the certainty of evidence for each outcome. The main comparison of interest in the review is tirzepatide versus placebo."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included nine RCTs with 7111 participants, aged 36.1 to 65.25 years, primarily from middle- and high-income countries. The main comparison, tirzepatide versus placebo, is based on eight studies; one study compared tirzepatide with semaglutide. Studies included participants with weight-related comorbidities. Seven studies focused on specific subgroups, including type 2 diabetes, prediabetes, chronic heart failure, obstructive sleep apnoea (after a long pretreatment phase), and different racial populations. Tirzepatide was injected once a week, with dosing ranging from 5 mg to 15 mg. All the studies had medium-term follow-ups, and one had a long-term follow-up. All nine studies reported a major role of the drug manufacturer in their design, conduct, analysis, or writing."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Tirzepatide versus placebo (medium-term: 12 to 18 months) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (mean difference (MD) -16.03, 95% confidence interval (CI) -18.91 to -13.14; 8 studies, 6317 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (risk ratio (RR) 3.60, 95% CI 2.44 to 5.30; I2 = 86%; 5 studies, 4455 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.33, 95% CI 1.03 to 1.71; 5 studies, 4582 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 0.99, 95% CI 0.88 to 1.12; 8 studies, 6359 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 2.06, 95% CI 1.21 to 3.52; 8 studies, 6359 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.75, 95% CI 0.34 to 1.66; I² = 0%; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide likely results in little to no clinically important difference in quality of life as measured by the IWQOL-Lite-CT physical function domain (MD 9.91, 95% CI 7.81 to 12.02; 6 studies, 5020 participants; moderate-certainty evidence). Tirzepatide likely results in little to no difference in mortality (RR 0.79, 95% CI 0.34 to 1.83; 7 studies, 5628 participants; moderate-certainty evidence). Tirzepatide versus placebo (long-term: 3.5 years) Tirzepatide likely results in a greater percentage reduction in body weight from baseline (MD -15.66, 95% CI -19.14 to -12.18; 1 study, 1032 participants; moderate-certainty evidence), and an increase in the number of people achieving a 5% weight reduction (RR 2.81, 95% CI 2.33 to 3.38; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in an increase in non-serious adverse events (RR 1.05, 95% CI 0.98 to 1.11; 1 study, 1032 participants; low-certainty evidence). The evidence is very uncertain about the effect on serious adverse events (RR 1.14, 95% CI 0.79 to 1.65; 1 study, 1032 participants; very low-certainty evidence). Tirzepatide may result in little to no difference in adverse events leading to withdrawal (RR 1.64, 95% CI 0.97 to 2.76; 1 study, 1032 participants; low-certainty evidence). Tirzepatide likely results in little to no difference in MACE (RR 0.56, 95% CI 0.22 to 1.42; 1 study, 1032 participants; moderate-certainty evidence). Tirzepatide may result in little to no clinically important difference in quality of life as measured by SF-36 physical component score (MD 2.70, 95% CI 0.00 to 5.40; 1 study, 1032 participants; low-certainty evidence). Tirzepatide may result in little to no difference in mortality (RR 0.83, 95% CI 0.22 to 3.17; 1 study, 1032 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Tirzepatide likely results in weight loss at medium-term follow-up, and this initial weight loss is likely to be sustained at longer-term follow-up. The long-term impact on other patient-important outcomes may be limited or uncertain. The certainty of the evidence on events leading to withdrawal at medium- and long-term follow-up is low, which might further limit our understanding of the sustainability of the initial effects. All the included studies were funded by the drug manufacturer, raising concerns about potential conflicts of interest. Further independent studies are needed, particularly in underrepresented populations, to better understand the broader effects of tirzepatide in the management of obesity."
        },
        {
          "label": "FUNDING",
          "text": "World Health Organization (WHO) REGISTRATION: Protocol (2022) DOI: 10.1002/14651858.CD015092 Updated Protocol (2025): PROSPERO CRD420250654193."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161687/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1002/14651858.CD016018",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false
    },
    {
      "id": "50d7115e8453",
      "title": "Efficacy and Safety of Oral PCSK9 Inhibitor Enlicitide in Adults With Heterozygous Familial Hypercholesterolemia: A Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118130",
      "abstract": "Persons with heterozygous familial hypercholesterolemia (HeFH) are at increased risk of atherosclerotic cardiovascular disease due to lifelong elevated levels of low-density lipoprotein cholesterol (LDL-C). Many patients with HeFH do not achieve guideline-recommended LDL-C goals with the currently available lipid-lowering therapies. To evaluate the efficacy of enlicitide decanoate (an oral proprotein convertase subtilisin/kexin type 9 inhibitor) vs placebo in adults with HeFH requiring further lowering of LDL-C levels despite use of statin therapy. This phase 3, randomized clinical trial included persons aged 18 years or older with HeFH currently using lipid-lowering therapy (taking at least a moderate- or high-intensity statin) and either an LDL-C level of 55 mg/dL or greater and a history of major atherosclerotic cardiovascular disease or an LDL-C level of 70 mg/dL or greater without a history of major atherosclerotic cardiovascular disease. The trial was conducted at 59 sites across 17 countries; the first participant was screened on August 8, 2023, and the last follow-up visit occurred on April 7, 2025. Participants were randomized (2:1) to 20 mg of enlicitide (n = 202) or placebo (n = 101) once daily for 52 weeks. The primary outcome was the mean percentage change in LDL-C level at week 24. The secondary outcomes included the mean percentage change in LDL-C level at week 52, the mean percentage change at week 24 in levels of non-high-density lipoprotein cholesterol (non-HDL-C) and apolipoprotein B, and the median percentage change at week 24 in lipoprotein(a). Of the 303 participants (mean age, 52.4 [SD, 13.5] years; 51% were female) randomized, 293 (96.7%) completed the trial. The mean LDL-C level was 119.0 mg/dL (SD, 41.0 mg/dL) at baseline, all had statin current use (81.5% were taking a high-intensity statin), and 64.4% were taking ezetimibe. The mean percentage change in LDL-C level at week 24 was -58.2% in the enlicitide group vs 2.6% in the placebo group (between-group difference, -59.4% [95% CI, -65.6% to -53.2%]; P < .001). The mean percentage change in LDL-C level at week 52 was -55.3% in the enlicitide group vs 8.7% in the placebo group (between-group difference, -61.5% [95% CI, -69.4% to -53.7%]; P < .001). At week 24, the mean percentage change in non-HDL-C level was -52.3% in the enlicitide group vs 2.1% in the placebo group (between-group difference, -53.0% [95% CI, -58.5% to -47.4%]; P < .001), the mean percentage change in apolipoprotein B level was -48.2% vs 1.8%, respectively (between-group difference, -49.1% [95% CI, -54.0% to -44.3%]; P < .001), and the median percentage change in lipoprotein(a) level was -24.7% vs -1.6% (between-group difference, -27.5% [95% CI, -34.3% to -20.6%]; P < .001). The incidence of adverse events, serious adverse events, and study discontinuation due to adverse events was similar between groups. Among adults with HeFH, treatment with enlicitide was well tolerated and significantly reduced levels of LDL-C, apolipoprotein B, non-HDL-C, and lipoprotein(a). ClinicalTrials.gov Identifier: NCT05952869.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Persons with heterozygous familial hypercholesterolemia (HeFH) are at increased risk of atherosclerotic cardiovascular disease due to lifelong elevated levels of low-density lipoprotein cholesterol (LDL-C). Many patients with HeFH do not achieve guideline-recommended LDL-C goals with the currently available lipid-lowering therapies."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the efficacy of enlicitide decanoate (an oral proprotein convertase subtilisin/kexin type 9 inhibitor) vs placebo in adults with HeFH requiring further lowering of LDL-C levels despite use of statin therapy."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This phase 3, randomized clinical trial included persons aged 18 years or older with HeFH currently using lipid-lowering therapy (taking at least a moderate- or high-intensity statin) and either an LDL-C level of 55 mg/dL or greater and a history of major atherosclerotic cardiovascular disease or an LDL-C level of 70 mg/dL or greater without a history of major atherosclerotic cardiovascular disease. The trial was conducted at 59 sites across 17 countries; the first participant was screened on August 8, 2023, and the last follow-up visit occurred on April 7, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized (2:1) to 20 mg of enlicitide (n = 202) or placebo (n = 101) once daily for 52 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the mean percentage change in LDL-C level at week 24. The secondary outcomes included the mean percentage change in LDL-C level at week 52, the mean percentage change at week 24 in levels of non-high-density lipoprotein cholesterol (non-HDL-C) and apolipoprotein B, and the median percentage change at week 24 in lipoprotein(a)."
        },
        {
          "label": "RESULTS",
          "text": "Of the 303 participants (mean age, 52.4 [SD, 13.5] years; 51% were female) randomized, 293 (96.7%) completed the trial. The mean LDL-C level was 119.0 mg/dL (SD, 41.0 mg/dL) at baseline, all had statin current use (81.5% were taking a high-intensity statin), and 64.4% were taking ezetimibe. The mean percentage change in LDL-C level at week 24 was -58.2% in the enlicitide group vs 2.6% in the placebo group (between-group difference, -59.4% [95% CI, -65.6% to -53.2%]; P < .001). The mean percentage change in LDL-C level at week 52 was -55.3% in the enlicitide group vs 8.7% in the placebo group (between-group difference, -61.5% [95% CI, -69.4% to -53.7%]; P < .001). At week 24, the mean percentage change in non-HDL-C level was -52.3% in the enlicitide group vs 2.1% in the placebo group (between-group difference, -53.0% [95% CI, -58.5% to -47.4%]; P < .001), the mean percentage change in apolipoprotein B level was -48.2% vs 1.8%, respectively (between-group difference, -49.1% [95% CI, -54.0% to -44.3%]; P < .001), and the median percentage change in lipoprotein(a) level was -24.7% vs -1.6% (between-group difference, -27.5% [95% CI, -34.3% to -20.6%]; P < .001). The incidence of adverse events, serious adverse events, and study discontinuation due to adverse events was similar between groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among adults with HeFH, treatment with enlicitide was well tolerated and significantly reduced levels of LDL-C, apolipoprotein B, non-HDL-C, and lipoprotein(a)."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05952869."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41206969/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jama.2025.20620",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Enlicitide effectively and safely lowered LDL-C, apolipoprotein B, non-HDL-C, and lipoprotein(a) in adults with HeFH."
    },
    {
      "id": "3f2cd736016c",
      "title": "Caffeinated Coffee Consumption or Abstinence to Reduce Atrial Fibrillation: The DECAF Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118128",
      "abstract": "Conventional wisdom holds that caffeinated coffee is proarrhythmic. Coffee is the most commonly consumed caffeinated beverage in the US, and a randomized trial assessing caffeinated coffee consumption in patients with atrial fibrillation (AF) has not previously been performed. To determine the effect of caffeinated coffee consumption compared with abstinence from coffee and caffeine on recurrent AF. This was a prospective, open-label, randomized clinical trial enrolling 200 current or previous (within past 5 years) coffee-drinking adults with persistent AF, or atrial flutter with a history of AF, planned for electrical cardioversion from 5 hospitals in the US, Canada, and Australia between November 2021 and December 2024. The date of final follow-up was June 5, 2025. Patients were randomized in a 1:1 ratio to regular caffeinated coffee consumption vs coffee and caffeine abstinence for 6 months. Patients in the coffee consumption group were encouraged to drink at least 1 cup of caffeinated coffee daily. Patients in the abstinence group were encouraged to completely abstain from both caffeinated and decaffeinated coffee and other caffeine-containing products. The primary end point was clinically detected recurrence of AF or atrial flutter over 6 months. Two hundred patients (mean [SD] age, 69 [11] years; 71% male) were randomized to caffeinated coffee consumption (n = 100) or coffee abstinence (n = 100). Baseline coffee intake was 7 cups (IQR, 7-18) per week in both groups. During follow-up, coffee intake in the consumption and abstinence groups was 7 (IQR, 6-11) and 0 (IQR, 0-2) cups per week, respectively, resulting in a between-group difference of 7 cups (95% CI, 7-7) per week. In the primary analysis, AF or atrial flutter recurrence was less in the coffee consumption (47%) than the coffee abstinence (64%) group, resulting in a 39% lower hazard of recurrence (hazard ratio, 0.61 [95% CI, 0.42-0.89]; P = .01). A comparable benefit of coffee consumption was observed with AF recurrence only. There was no significant difference in adverse events. In this clinical trial of coffee drinkers after successful cardioversion, allocation to consumption of caffeinated coffee averaging 1 cup a day was associated with less recurrence of AF or atrial flutter compared with abstinence from coffee and caffeinated products. ClinicalTrials.gov Identifier: NCT05121519.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Conventional wisdom holds that caffeinated coffee is proarrhythmic. Coffee is the most commonly consumed caffeinated beverage in the US, and a randomized trial assessing caffeinated coffee consumption in patients with atrial fibrillation (AF) has not previously been performed."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the effect of caffeinated coffee consumption compared with abstinence from coffee and caffeine on recurrent AF."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a prospective, open-label, randomized clinical trial enrolling 200 current or previous (within past 5 years) coffee-drinking adults with persistent AF, or atrial flutter with a history of AF, planned for electrical cardioversion from 5 hospitals in the US, Canada, and Australia between November 2021 and December 2024. The date of final follow-up was June 5, 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomized in a 1:1 ratio to regular caffeinated coffee consumption vs coffee and caffeine abstinence for 6 months. Patients in the coffee consumption group were encouraged to drink at least 1 cup of caffeinated coffee daily. Patients in the abstinence group were encouraged to completely abstain from both caffeinated and decaffeinated coffee and other caffeine-containing products."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary end point was clinically detected recurrence of AF or atrial flutter over 6 months."
        },
        {
          "label": "RESULTS",
          "text": "Two hundred patients (mean [SD] age, 69 [11] years; 71% male) were randomized to caffeinated coffee consumption (n = 100) or coffee abstinence (n = 100). Baseline coffee intake was 7 cups (IQR, 7-18) per week in both groups. During follow-up, coffee intake in the consumption and abstinence groups was 7 (IQR, 6-11) and 0 (IQR, 0-2) cups per week, respectively, resulting in a between-group difference of 7 cups (95% CI, 7-7) per week. In the primary analysis, AF or atrial flutter recurrence was less in the coffee consumption (47%) than the coffee abstinence (64%) group, resulting in a 39% lower hazard of recurrence (hazard ratio, 0.61 [95% CI, 0.42-0.89]; P = .01). A comparable benefit of coffee consumption was observed with AF recurrence only. There was no significant difference in adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this clinical trial of coffee drinkers after successful cardioversion, allocation to consumption of caffeinated coffee averaging 1 cup a day was associated with less recurrence of AF or atrial flutter compared with abstinence from coffee and caffeinated products."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05121519."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41206802/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jama.2025.21056",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Drinking about one cup of caffeinated coffee daily after successful cardioversion was linked to a lower chance of atrial fibrillation or flutter returning."
    },
    {
      "id": "29fa8d6e9ef5",
      "title": "Evolocumab in Patients without a Previous Myocardial Infarction or Stroke.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118123",
      "abstract": "Whether successful catheter ablation for atrial fibrillation eliminates the need for long-term oral anticoagulant therapy is unknown. We conducted an international, open-label, randomized, blinded-outcome-assessment trial involving 1284 patients who had undergone successful catheter ablation for atrial fibrillation at least 1 year earlier and had a CHADS-VASc score (scores range from 0 to 9, with higher scores indicating a higher risk of stroke) of 1 or more (or ≥2 for women or for patients in whom vascular disease was a risk factor). Patients were randomly assigned to receive either aspirin (at a dose of 70 to 120 mg daily, depending on availability in the local jurisdiction) or rivaroxaban (at a dose of 15 mg) and followed for 3 years. Magnetic resonance imaging (MRI) of the head was performed after enrollment and at 3 years. The primary outcome was a composite of stroke, systemic embolism, or new covert embolic stroke (defined by ≥1 new infarct measuring ≥15 mm on MRI) at 3 years. A total of 641 patients were assigned to the rivaroxaban group and 643 to the aspirin group. A primary-outcome event occurred in 5 patients (0.31 events per 100 patient-years) in the rivaroxaban group and in 9 patients (0.66 events per 100 patient-years) in the aspirin group (relative risk, 0.56; 95% confidence interval [CI], 0.19 to 1.65; absolute risk difference at 3 years, -0.6 percentage points; 95% CI, -1.8 to 0.5; P = 0.28). New cerebral infarcts measuring less than 15 mm occurred in 22 of 568 patients (3.9%) in the rivaroxaban group and in 26 of 590 patients (4.4%) in the aspirin group (relative risk, 0.89; 95% CI, 0.51 to 1.55). Fatal or major bleeding (the composite primary safety outcome) had occurred in 10 patients (1.6%) with rivaroxaban and in 4 patients (0.6%) with aspirin (hazard ratio, 2.51; 95% CI, 0.79 to 7.95) at 3 years. Among patients who had had successful catheter ablation for atrial fibrillation at least 1 year earlier and had risk factors for stroke, treatment with rivaroxaban did not result in a significantly lower incidence of a composite of stroke, systemic embolism, or new covert embolic stroke than treatment with aspirin. (Funded by Bayer and others; OCEAN ClinicalTrials.gov number, NCT02168829.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Whether successful catheter ablation for atrial fibrillation eliminates the need for long-term oral anticoagulant therapy is unknown."
        },
        {
          "label": "METHODS",
          "text": "We conducted an international, open-label, randomized, blinded-outcome-assessment trial involving 1284 patients who had undergone successful catheter ablation for atrial fibrillation at least 1 year earlier and had a CHADS-VASc score (scores range from 0 to 9, with higher scores indicating a higher risk of stroke) of 1 or more (or ≥2 for women or for patients in whom vascular disease was a risk factor). Patients were randomly assigned to receive either aspirin (at a dose of 70 to 120 mg daily, depending on availability in the local jurisdiction) or rivaroxaban (at a dose of 15 mg) and followed for 3 years. Magnetic resonance imaging (MRI) of the head was performed after enrollment and at 3 years. The primary outcome was a composite of stroke, systemic embolism, or new covert embolic stroke (defined by ≥1 new infarct measuring ≥15 mm on MRI) at 3 years."
        },
        {
          "label": "RESULTS",
          "text": "A total of 641 patients were assigned to the rivaroxaban group and 643 to the aspirin group. A primary-outcome event occurred in 5 patients (0.31 events per 100 patient-years) in the rivaroxaban group and in 9 patients (0.66 events per 100 patient-years) in the aspirin group (relative risk, 0.56; 95% confidence interval [CI], 0.19 to 1.65; absolute risk difference at 3 years, -0.6 percentage points; 95% CI, -1.8 to 0.5; P = 0.28). New cerebral infarcts measuring less than 15 mm occurred in 22 of 568 patients (3.9%) in the rivaroxaban group and in 26 of 590 patients (4.4%) in the aspirin group (relative risk, 0.89; 95% CI, 0.51 to 1.55). Fatal or major bleeding (the composite primary safety outcome) had occurred in 10 patients (1.6%) with rivaroxaban and in 4 patients (0.6%) with aspirin (hazard ratio, 2.51; 95% CI, 0.79 to 7.95) at 3 years."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients who had had successful catheter ablation for atrial fibrillation at least 1 year earlier and had risk factors for stroke, treatment with rivaroxaban did not result in a significantly lower incidence of a composite of stroke, systemic embolism, or new covert embolic stroke than treatment with aspirin. (Funded by Bayer and others; OCEAN ClinicalTrials.gov number, NCT02168829.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211931/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2509688",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "In patients with successful atrial fibrillation ablation and stroke risk factors, rivaroxaban did not significantly reduce the risk of stroke, systemic embolism, or new covert embolic stroke compared to aspirin."
    },
    {
      "id": "351b153164d1",
      "title": "Effectiveness of Mailed Patient Activation Letters for Blood Pressure Control: A Randomized Quality Improvement Trial.",
      "journal": "J Gen Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118104",
      "abstract": "Uncontrolled hypertension (HTN) is a leading preventable cause of death. Interventions are needed that activate patients and motivate them to work with clinicians to control their blood pressure (BP). To test whether mailing patients a letter including information about their hypertension and a summary of computerized algorithm-generated medication adjustment suggestions improves BP control processes and outcomes. Randomized quality improvement trial. We identified patients receiving primary care at a large academic medical center with diagnosed HTN and uncontrolled BP (> 140 mmHg systolic or > 90 mmHg diastolic) at both of their last 2 visits. Participants were randomized into three groups. The BP Activate Letter group received a letter containing algorithm-generated BP medication adjustment suggestions, and a recommendation to discuss these suggestions with their provider; the Control Letter group received a letter that recommended they talk to their provider about their HTN, without specific medication suggestions; and the No Letter group received no mailed outreach. The primary outcome was time to occurrence of either a BP medication intensification or documented achievement of BP control to < 140/< 90 mmHg using EHR data extracted 6 months after letters were mailed. The primary outcome, which was time to medication intensification or achievement of BP control, did not occur more frequently in the BP Activate Letter group (hazard ratio = 0.86; 95% confidence interval [CI]: 0.65 to 1.14), or in the Control Letter group (0.78; 0.59 to 1.03) compared to the No Letter group, and we saw no evidence of significant improvement in any secondary outcome or subgroup. Time to medication intensification appeared to be significantly longer in the Control Letter compared to the No Letter group (0.50; 0.30 to 0.85). Mailing patients one letter with computerized BP medication adjustment suggestions to consider did not lead to effective patient activation.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Uncontrolled hypertension (HTN) is a leading preventable cause of death. Interventions are needed that activate patients and motivate them to work with clinicians to control their blood pressure (BP)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To test whether mailing patients a letter including information about their hypertension and a summary of computerized algorithm-generated medication adjustment suggestions improves BP control processes and outcomes."
        },
        {
          "label": "DESIGN",
          "text": "Randomized quality improvement trial."
        },
        {
          "label": "PARTICIPANTS",
          "text": "We identified patients receiving primary care at a large academic medical center with diagnosed HTN and uncontrolled BP (> 140 mmHg systolic or > 90 mmHg diastolic) at both of their last 2 visits."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized into three groups. The BP Activate Letter group received a letter containing algorithm-generated BP medication adjustment suggestions, and a recommendation to discuss these suggestions with their provider; the Control Letter group received a letter that recommended they talk to their provider about their HTN, without specific medication suggestions; and the No Letter group received no mailed outreach."
        },
        {
          "label": "MAIN MEASURES",
          "text": "The primary outcome was time to occurrence of either a BP medication intensification or documented achievement of BP control to < 140/< 90 mmHg using EHR data extracted 6 months after letters were mailed."
        },
        {
          "label": "KEY RESULTS",
          "text": "The primary outcome, which was time to medication intensification or achievement of BP control, did not occur more frequently in the BP Activate Letter group (hazard ratio = 0.86; 95% confidence interval [CI]: 0.65 to 1.14), or in the Control Letter group (0.78; 0.59 to 1.03) compared to the No Letter group, and we saw no evidence of significant improvement in any secondary outcome or subgroup. Time to medication intensification appeared to be significantly longer in the Control Letter compared to the No Letter group (0.50; 0.30 to 0.85)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Mailing patients one letter with computerized BP medication adjustment suggestions to consider did not lead to effective patient activation."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41186866/",
      "pubDate": "2025 Nov 04",
      "doi": "10.1007/s11606-025-09946-0",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "A single mailed letter with computerized blood pressure medication suggestions did not improve patient engagement."
    },
    {
      "id": "b087a560731e",
      "title": "Outpatient Follow-Up and 30-Day Readmissions: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118094",
      "abstract": "Outpatient follow-up after discharge has been associated with reduced 30-day readmissions. Since universal follow-up is not feasible, identifying for whom and when outpatient follow-up is most beneficial is essential for optimizing resources and reducing readmissions. To quantify the association between outpatient follow-up within 30, 14, and 7 days postdischarge and 30-day all-cause readmissions and assess differences in outcomes by disease, age, and baseline readmission risk. MEDLINE (via PubMed), Embase, and CINAHL were searched for studies published between January 1, 2000, and August 4, 2025, using terms related to outpatient follow-up and readmissions. English-language studies assessing the association between outpatient follow-up within 30 days of hospital discharge and 30-day all-cause readmissions among adult inpatients were included. Following Preferred Reporting Items for Systematic Review and Meta-Analyses guidelines, 2 reviewers independently screened titles and abstracts. Data were extracted by 1 author and verified by another, and quality assessment was done independently by 2 authors. The primary outcome was all-cause 30-day readmission. Secondary outcomes included all-cause 30-day emergency department (ED) discharge and mortality. Pooled effect sizes (relative risk ratios [RRRs]) were estimated by disease and age group using multilevel random-effects models. Eighty-three studies were included in the review and 76 in the meta-analysis. Outpatient follow-up within 30 days vs no follow-up was associated with a reduction in risk of 30-day all-cause readmission (RRR, 0.68; 95% CI, 0.60-0.75), with less reduction (RRR, 0.78; 95% CI, 0.67-0.89) when restricted to studies with low to moderate risk of bias (ROB). Among patients with heart failure (HF) and acute myocardial infarction (AMI), the RRRs for 30-day follow-up in studies with low to moderate ROB were 0.65 (95% CI, 0.48-0.83) and 0.56 (95% CI, 0.32-0.80), respectively. Subgroup analysis using studies with low to moderate ROB showed benefits of 30-day follow-up only among patients aged 65 years or older with HF (RRR, 0.65; 95% CI, 0.48-0.83), AMI (RRR, 0.56; 95% CI, 0.32-0.80), and other diseases such as stroke and chronic obstructive pulmonary disease (RRR, 0.73; 95% CI, 0.59-0.87). Early follow-up vs no follow-up within 14 and 7 days was associated with a significant reduction in readmissions only among patients aged 65 years or older with HF (14 days: RRR, 0.63 [95% CI, 0.40-0.87]; 7 days: RRR, 0.68 [95% CI, 0.47-0.89]) and AMI (14 days: RRR, 0.57 [95% CI, 0.22-0.91]; 7 days: RRR, 0.63 [95% CI, 0.34-0.92]). In this systematic review and meta-analysis, outpatient follow-up within 30 days was associated with reduced 30-day readmissions, but the association varied by patient age and disease type, indicating a need for targeted rather than universal follow-up.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Outpatient follow-up after discharge has been associated with reduced 30-day readmissions. Since universal follow-up is not feasible, identifying for whom and when outpatient follow-up is most beneficial is essential for optimizing resources and reducing readmissions."
        },
        {
          "label": "OBJECTIVE",
          "text": "To quantify the association between outpatient follow-up within 30, 14, and 7 days postdischarge and 30-day all-cause readmissions and assess differences in outcomes by disease, age, and baseline readmission risk."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE (via PubMed), Embase, and CINAHL were searched for studies published between January 1, 2000, and August 4, 2025, using terms related to outpatient follow-up and readmissions."
        },
        {
          "label": "STUDY SELECTION",
          "text": "English-language studies assessing the association between outpatient follow-up within 30 days of hospital discharge and 30-day all-cause readmissions among adult inpatients were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Following Preferred Reporting Items for Systematic Review and Meta-Analyses guidelines, 2 reviewers independently screened titles and abstracts. Data were extracted by 1 author and verified by another, and quality assessment was done independently by 2 authors."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was all-cause 30-day readmission. Secondary outcomes included all-cause 30-day emergency department (ED) discharge and mortality. Pooled effect sizes (relative risk ratios [RRRs]) were estimated by disease and age group using multilevel random-effects models."
        },
        {
          "label": "RESULTS",
          "text": "Eighty-three studies were included in the review and 76 in the meta-analysis. Outpatient follow-up within 30 days vs no follow-up was associated with a reduction in risk of 30-day all-cause readmission (RRR, 0.68; 95% CI, 0.60-0.75), with less reduction (RRR, 0.78; 95% CI, 0.67-0.89) when restricted to studies with low to moderate risk of bias (ROB). Among patients with heart failure (HF) and acute myocardial infarction (AMI), the RRRs for 30-day follow-up in studies with low to moderate ROB were 0.65 (95% CI, 0.48-0.83) and 0.56 (95% CI, 0.32-0.80), respectively. Subgroup analysis using studies with low to moderate ROB showed benefits of 30-day follow-up only among patients aged 65 years or older with HF (RRR, 0.65; 95% CI, 0.48-0.83), AMI (RRR, 0.56; 95% CI, 0.32-0.80), and other diseases such as stroke and chronic obstructive pulmonary disease (RRR, 0.73; 95% CI, 0.59-0.87). Early follow-up vs no follow-up within 14 and 7 days was associated with a significant reduction in readmissions only among patients aged 65 years or older with HF (14 days: RRR, 0.63 [95% CI, 0.40-0.87]; 7 days: RRR, 0.68 [95% CI, 0.47-0.89]) and AMI (14 days: RRR, 0.57 [95% CI, 0.22-0.91]; 7 days: RRR, 0.63 [95% CI, 0.34-0.92])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis, outpatient follow-up within 30 days was associated with reduced 30-day readmissions, but the association varied by patient age and disease type, indicating a need for targeted rather than universal follow-up."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41186947/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.41272",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Outpatient follow-up within 30 days reduces 30-day readmissions, but its effectiveness depends on patient age and disease."
    },
    {
      "id": "ab50e2062cd8",
      "title": "AGA Clinical Practice Guideline on Surveillance of Barrett's Esophagus.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118021",
      "abstract": "Barrett's esophagus (BE) is the only identifiable precursor to esophageal adenocarcinoma (EAC). Endoscopic surveillance has been proposed for early detection of BE-related neoplasia and reducing EAC mortality. This clinical practice guideline aims to inform clinicians and patients by providing evidence-based practice recommendations for surveillance in patients with BE. The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and make recommendations. The panel prioritized clinical questions and outcomes according to their importance for clinicians and patients, conducted an evidence review, and used the Evidence-to-Decision Framework to develop recommendations regarding the role of endoscopic surveillance in patients with BE. The clinical domains addressed included: (1) overall role of endoscopic surveillance, (2) surveillance in patients with columnar-lined esophagus <1 cm, (3) optimal imaging modalities, (4) adjunctive sampling techniques, (5) the utility of biomarkers in risk-stratification, (6) chemopreventive strategies, and (7) antireflux procedures in the prevention of progression in patients with BE. Clinical recommendations were based on the balance between the desirable and undesirable effects, patient values, costs, and health equity considerations. The panel agreed on 8 recommendations. Based on the available evidence, the panel provided a conditional recommendation in favor of surveillance for patients with nondysplastic BE. In patients with columnar-lined esophagus <1 cm, a conditional recommendation was made against endoscopic surveillance. The panel made a strong recommendation in favor of a combination of high-definition white light endoscopy and chromoendoscopy compared with white light endoscopy alone. The panel made no recommendation on the use of enhanced sampling techniques, such as wide-area transepithelial sampling to enhance neoplasia detection and biomarkers such as p53 and TissueCypher to predict progression in BE. The panel provided a conditional recommendation for the use of daily proton pump inhibitor therapy compared with no therapy and compared with antireflux surgery to prevent progression in BE. This document provides a comprehensive outline on the role of surveillance in patients with BE. Key implementation statements included in this document stress the importance of a high-quality endoscopy examination, sampling using a structured biopsy protocol, and confirming the diagnosis of BE-related neoplasia by an expert pathologist. This document also provides guidance on surveillance intervals and management of patients with BE-related low-grade dysplasia and indefinite for dysplasia. Providers should engage in shared decision making based on patient preferences. Limitations and gaps in the evidence are highlighted to guide future research opportunities. This guideline is endorsed by the Canadian Association of Gastroenterology.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Barrett's esophagus (BE) is the only identifiable precursor to esophageal adenocarcinoma (EAC). Endoscopic surveillance has been proposed for early detection of BE-related neoplasia and reducing EAC mortality. This clinical practice guideline aims to inform clinicians and patients by providing evidence-based practice recommendations for surveillance in patients with BE."
        },
        {
          "label": "METHODS",
          "text": "The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and make recommendations. The panel prioritized clinical questions and outcomes according to their importance for clinicians and patients, conducted an evidence review, and used the Evidence-to-Decision Framework to develop recommendations regarding the role of endoscopic surveillance in patients with BE. The clinical domains addressed included: (1) overall role of endoscopic surveillance, (2) surveillance in patients with columnar-lined esophagus <1 cm, (3) optimal imaging modalities, (4) adjunctive sampling techniques, (5) the utility of biomarkers in risk-stratification, (6) chemopreventive strategies, and (7) antireflux procedures in the prevention of progression in patients with BE. Clinical recommendations were based on the balance between the desirable and undesirable effects, patient values, costs, and health equity considerations."
        },
        {
          "label": "RESULTS",
          "text": "The panel agreed on 8 recommendations. Based on the available evidence, the panel provided a conditional recommendation in favor of surveillance for patients with nondysplastic BE. In patients with columnar-lined esophagus <1 cm, a conditional recommendation was made against endoscopic surveillance. The panel made a strong recommendation in favor of a combination of high-definition white light endoscopy and chromoendoscopy compared with white light endoscopy alone. The panel made no recommendation on the use of enhanced sampling techniques, such as wide-area transepithelial sampling to enhance neoplasia detection and biomarkers such as p53 and TissueCypher to predict progression in BE. The panel provided a conditional recommendation for the use of daily proton pump inhibitor therapy compared with no therapy and compared with antireflux surgery to prevent progression in BE."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This document provides a comprehensive outline on the role of surveillance in patients with BE. Key implementation statements included in this document stress the importance of a high-quality endoscopy examination, sampling using a structured biopsy protocol, and confirming the diagnosis of BE-related neoplasia by an expert pathologist. This document also provides guidance on surveillance intervals and management of patients with BE-related low-grade dysplasia and indefinite for dysplasia. Providers should engage in shared decision making based on patient preferences. Limitations and gaps in the evidence are highlighted to guide future research opportunities."
        },
        {
          "label": "GUIDELINE ENDORSEMENT",
          "text": "This guideline is endorsed by the Canadian Association of Gastroenterology."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41125322/",
      "pubDate": "2025 Nov",
      "doi": "10.1053/j.gastro.2025.09.012",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Surveillance for Barrett's esophagus requires high-quality endoscopy, structured biopsies, expert pathology review, and individualized management based on dysplasia findings and patient preferences."
    },
    {
      "id": "d201455fe2de",
      "title": "Comparative Gastrointestinal Safety of Dulaglutide, Semaglutide, and Tirzepatide in Adults With Type 2 Diabetes.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118093",
      "abstract": "The comparative gastrointestinal safety across glucagon-like peptide-1 receptor agonists and tirzepatide is still unclear. To compare the risk for severe gastrointestinal adverse events across dulaglutide, subcutaneous semaglutide, and tirzepatide in patients with type 2 diabetes (T2D) in routine clinical practice. New-user, active-comparator cohort study. Population-based study. Adults with T2D initiating dulaglutide, subcutaneous semaglutide, and tirzepatide between 1 January 2019 and 30 August 2024 in 3 cohorts corresponding to 3 pairwise comparisons. The primary outcome was a composite of acute pancreatitis, biliary disease, bowel obstruction, gastroparesis, and severe constipation. Secondary outcomes of interest were the individual components of the primary outcome. Patients were 1:1 propensity score matched within each comparison. We calculated hazard ratios (HRs) with 95% CIs. There were 65 238 matched pairs in the semaglutide versus dulaglutide cohort, 20 893 in the tirzepatide versus dulaglutide cohort, and 46 620 in the tirzepatide versus semaglutide cohort. The HR of gastrointestinal events was 0.96 (95% CI, 0.87 to 1.06) in the semaglutide versus dulaglutide cohort, 0.96 (CI, 0.77 to 1.20) in the tirzepatide versus dulaglutide cohort, and 1.07 (CI, 0.90 to 1.26) in the tirzepatide versus semaglutide cohort. Possible residual confounding by glycemic control and body mass index. These findings suggest that dulaglutide, semaglutide, and tirzepatide have similar gastrointestinal safety profiles in adults with T2D. This study provides clinicians with evidence to weigh the benefits and risks of these medications. National Institute of Diabetes and Digestive and Kidney Diseases.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The comparative gastrointestinal safety across glucagon-like peptide-1 receptor agonists and tirzepatide is still unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the risk for severe gastrointestinal adverse events across dulaglutide, subcutaneous semaglutide, and tirzepatide in patients with type 2 diabetes (T2D) in routine clinical practice."
        },
        {
          "label": "DESIGN",
          "text": "New-user, active-comparator cohort study."
        },
        {
          "label": "SETTING",
          "text": "Population-based study."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Adults with T2D initiating dulaglutide, subcutaneous semaglutide, and tirzepatide between 1 January 2019 and 30 August 2024 in 3 cohorts corresponding to 3 pairwise comparisons."
        },
        {
          "label": "MEASUREMENTS",
          "text": "The primary outcome was a composite of acute pancreatitis, biliary disease, bowel obstruction, gastroparesis, and severe constipation. Secondary outcomes of interest were the individual components of the primary outcome. Patients were 1:1 propensity score matched within each comparison. We calculated hazard ratios (HRs) with 95% CIs."
        },
        {
          "label": "RESULTS",
          "text": "There were 65 238 matched pairs in the semaglutide versus dulaglutide cohort, 20 893 in the tirzepatide versus dulaglutide cohort, and 46 620 in the tirzepatide versus semaglutide cohort. The HR of gastrointestinal events was 0.96 (95% CI, 0.87 to 1.06) in the semaglutide versus dulaglutide cohort, 0.96 (CI, 0.77 to 1.20) in the tirzepatide versus dulaglutide cohort, and 1.07 (CI, 0.90 to 1.26) in the tirzepatide versus semaglutide cohort."
        },
        {
          "label": "LIMITATION",
          "text": "Possible residual confounding by glycemic control and body mass index."
        },
        {
          "label": "CONCLUSION",
          "text": "These findings suggest that dulaglutide, semaglutide, and tirzepatide have similar gastrointestinal safety profiles in adults with T2D. This study provides clinicians with evidence to weigh the benefits and risks of these medications."
        },
        {
          "label": "PRIMARY FUNDING SOURCE",
          "text": "National Institute of Diabetes and Digestive and Kidney Diseases."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41183330/",
      "pubDate": "2025 Nov 04",
      "doi": "10.7326/ANNALS-25-01724",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Dulaglutide, semaglutide, and tirzepatide appear to have comparable gastrointestinal safety in adults with type 2 diabetes."
    },
    {
      "id": "5da8d1a0a808",
      "title": "Molnupiravir for treating COVID-19.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118077",
      "abstract": "Five years from the start of the COVID-19 pandemic, morbidity and mortality have subsided. Vaccines have contributed to reducing the risk of infection and severe disease. However, new COVID-19 variants continue to emerge, and the role of oral antivirals such as molnupiravir in preventing progression of disease or hospitalisation must be assessed. To assess the effects of molnupiravir in people with confirmed severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection and mild to moderate symptoms. We identified all relevant randomised controlled trials (RCTs) by searching the Cochrane COVID-19 Study Register, Science Citation Index Expanded, the World Health Organization (WHO) Global Literature on Coronavirus Disease database, and the COVID Network Meta-Analysis database with no language restrictions up to 26 April 2024. We considered full-text articles, preprints, abstracts, trial registry records, and reports of ongoing trials. Cluster-RCTs were eligible for inclusion, but cross-over trials were ineligible. Participants had confirmed SARS-CoV-2 infection with or without risk factors for severe disease. The intervention was molnupiravir 800 mg taken orally every 12 hours for five days, and control was no treatment, placebo, or standard of care, as defined by the study authors. We excluded studies comparing molnupiravir with treatment strategies that included molnupiravir. Our critical outcomes were all-cause mortality and hospitalisation. Our important outcomes were change in clinical status, viral clearance, quality of life, adverse events, and serious adverse events. Two review authors independently assessed the risk of bias in each included study using the Cochrane risk of bias tool (RoB 2). Disagreements were resolved through discussion. We conducted a meta-analysis where two or more studies with reasonably similar clinical and methodological characteristics reported the same outcome. We used data from intention-to-treat analysis where available. We analysed all outcomes at the participant level using the generic inverse variance method, applying a random-effects model. We used the GRADE approach to assess the certainty of evidence. This review included 11 studies (31,272 participants). Eight studies recruited outpatients and three recruited inpatients. We did not meta-analyse inpatient studies, as characteristics varied widely. All outpatient studies included participants with mild to moderate COVID-19, with a mean age ranging from 35 years to 57 years and variable prevalences of comorbidities and COVID-19 vaccination. We excluded suboptimal molnupiravir dosing arms in four outpatient studies and one inpatient study. Outpatients Molnupiravir compared to placebo or usual care probably results in little to no difference in all-cause mortality at 28 to 30 days (risk ratio (RR) 0.17, 95% confidence interval (CI) 0.04 to 0.65; 7 RCTs, 29,238 participants; moderate-certainty evidence). The absolute reduction in mortality is nine fewer deaths per 10,000 people treated (95% CI 10 fewer to four fewer per 10,000), which we consider clinically insignificant. Molnupiravir may result in little to no difference in hospitalisation (RR 0.70, 95% CI 0.43 to 1.12; 6 RCTs, 29,228 participants; low-certainty evidence), symptom resolution by day 14 (RR 1.20, 95% CI 0.84 to 1.71; 3 RCTs, 22,400 participants; low-certainty evidence), and symptom resolution by day 28 (RR 1.06, 95% CI 0.89 to 1.26; 3 RCTs, 24,728 participants; low-certainty evidence). Four studies reported viral clearance by day 5, which was higher in people receiving molnupiravir compared with those receiving placebo or usual care (RR 3.40, 95% CI 2.15 to 5.36; 3067 participants). The effect size decreased by day 10 (RR 1.58, 95% CI 1.07 to 2.34; 2 RCTs, 2438 participants) and indicated little to no difference between molnupiravir and control by day 14 to 15 (RR 1.05, 95% CI 0.98 to 1.13; 4 RCTs, 3062 participants). The results at day 28 to 30 again showed higher virus clearance in the molnupiravir arm (RR 1.11, 95% CI 1.03 to 1.19; 3 RCTs, 397 participants), although there were few participants in this analysis. Molnupiravir probably results in little to no difference in adverse events (RR 1.00, 95% CI 0.87 to 1.15; 7 RCTs, 4304 participants; moderate-certainty evidence). Molnupiravir results in little to no difference in serious adverse events (RR 0.86, 95% CI 0.62 to 1.21; 8 RCTs, 30,009 participants; high-certainty evidence). Inpatients The effect of molnupiravir in inpatients is unclear; substantial heterogeneity precluded meta-analysis. Risk of bias and certainty of the evidence We assigned high risk of bias judgements to one of seven RCTs for all-cause mortality, one of six RCTs for hospitalisation, two of three RCTs for symptom resolution at 14 days and 28 days, three of seven RCTs for adverse events, and three of eight RCTs for serious adverse events. We downgraded the certainty of the evidence for serious indirectness as well as risk of bias, as the populations across trials differed by vaccination status. There was no serious imprecision identified for any outcome. Publication bias is likely high in this review, as we identified 16 unpublished trials. Six were listed as complete, but only one had available data. In outpatients with mild to moderate COVID-19, molnupiravir 800 mg taken orally every 12 hours for five days probably results in little to no difference in all-cause mortality and may result in little to no difference in rates of hospitalisation and symptom resolution. There is evidence of increased viral clearance by day 5, but the clinical relevance of this finding is unclear. There is probably little to no difference in adverse events, and there is little to no difference in serious adverse events, with molnupiravir versus placebo or standard care. Inpatient data are lacking, and there is no evidence of benefit of molnupiravir in this population. Further research involving inpatients may change this. The editorial base of the Cochrane Infectious Diseases Group is funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104). The views expressed herein do not necessarily reflect the UK Government's official policies. Protocol available at https://doi.org/10.1002/14651858.CD015381.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Five years from the start of the COVID-19 pandemic, morbidity and mortality have subsided. Vaccines have contributed to reducing the risk of infection and severe disease. However, new COVID-19 variants continue to emerge, and the role of oral antivirals such as molnupiravir in preventing progression of disease or hospitalisation must be assessed."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of molnupiravir in people with confirmed severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection and mild to moderate symptoms."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We identified all relevant randomised controlled trials (RCTs) by searching the Cochrane COVID-19 Study Register, Science Citation Index Expanded, the World Health Organization (WHO) Global Literature on Coronavirus Disease database, and the COVID Network Meta-Analysis database with no language restrictions up to 26 April 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We considered full-text articles, preprints, abstracts, trial registry records, and reports of ongoing trials. Cluster-RCTs were eligible for inclusion, but cross-over trials were ineligible. Participants had confirmed SARS-CoV-2 infection with or without risk factors for severe disease. The intervention was molnupiravir 800 mg taken orally every 12 hours for five days, and control was no treatment, placebo, or standard of care, as defined by the study authors. We excluded studies comparing molnupiravir with treatment strategies that included molnupiravir."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality and hospitalisation. Our important outcomes were change in clinical status, viral clearance, quality of life, adverse events, and serious adverse events."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors independently assessed the risk of bias in each included study using the Cochrane risk of bias tool (RoB 2). Disagreements were resolved through discussion."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We conducted a meta-analysis where two or more studies with reasonably similar clinical and methodological characteristics reported the same outcome. We used data from intention-to-treat analysis where available. We analysed all outcomes at the participant level using the generic inverse variance method, applying a random-effects model. We used the GRADE approach to assess the certainty of evidence."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This review included 11 studies (31,272 participants). Eight studies recruited outpatients and three recruited inpatients. We did not meta-analyse inpatient studies, as characteristics varied widely. All outpatient studies included participants with mild to moderate COVID-19, with a mean age ranging from 35 years to 57 years and variable prevalences of comorbidities and COVID-19 vaccination. We excluded suboptimal molnupiravir dosing arms in four outpatient studies and one inpatient study."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Outpatients Molnupiravir compared to placebo or usual care probably results in little to no difference in all-cause mortality at 28 to 30 days (risk ratio (RR) 0.17, 95% confidence interval (CI) 0.04 to 0.65; 7 RCTs, 29,238 participants; moderate-certainty evidence). The absolute reduction in mortality is nine fewer deaths per 10,000 people treated (95% CI 10 fewer to four fewer per 10,000), which we consider clinically insignificant. Molnupiravir may result in little to no difference in hospitalisation (RR 0.70, 95% CI 0.43 to 1.12; 6 RCTs, 29,228 participants; low-certainty evidence), symptom resolution by day 14 (RR 1.20, 95% CI 0.84 to 1.71; 3 RCTs, 22,400 participants; low-certainty evidence), and symptom resolution by day 28 (RR 1.06, 95% CI 0.89 to 1.26; 3 RCTs, 24,728 participants; low-certainty evidence). Four studies reported viral clearance by day 5, which was higher in people receiving molnupiravir compared with those receiving placebo or usual care (RR 3.40, 95% CI 2.15 to 5.36; 3067 participants). The effect size decreased by day 10 (RR 1.58, 95% CI 1.07 to 2.34; 2 RCTs, 2438 participants) and indicated little to no difference between molnupiravir and control by day 14 to 15 (RR 1.05, 95% CI 0.98 to 1.13; 4 RCTs, 3062 participants). The results at day 28 to 30 again showed higher virus clearance in the molnupiravir arm (RR 1.11, 95% CI 1.03 to 1.19; 3 RCTs, 397 participants), although there were few participants in this analysis. Molnupiravir probably results in little to no difference in adverse events (RR 1.00, 95% CI 0.87 to 1.15; 7 RCTs, 4304 participants; moderate-certainty evidence). Molnupiravir results in little to no difference in serious adverse events (RR 0.86, 95% CI 0.62 to 1.21; 8 RCTs, 30,009 participants; high-certainty evidence). Inpatients The effect of molnupiravir in inpatients is unclear; substantial heterogeneity precluded meta-analysis. Risk of bias and certainty of the evidence We assigned high risk of bias judgements to one of seven RCTs for all-cause mortality, one of six RCTs for hospitalisation, two of three RCTs for symptom resolution at 14 days and 28 days, three of seven RCTs for adverse events, and three of eight RCTs for serious adverse events. We downgraded the certainty of the evidence for serious indirectness as well as risk of bias, as the populations across trials differed by vaccination status. There was no serious imprecision identified for any outcome. Publication bias is likely high in this review, as we identified 16 unpublished trials. Six were listed as complete, but only one had available data."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In outpatients with mild to moderate COVID-19, molnupiravir 800 mg taken orally every 12 hours for five days probably results in little to no difference in all-cause mortality and may result in little to no difference in rates of hospitalisation and symptom resolution. There is evidence of increased viral clearance by day 5, but the clinical relevance of this finding is unclear. There is probably little to no difference in adverse events, and there is little to no difference in serious adverse events, with molnupiravir versus placebo or standard care. Inpatient data are lacking, and there is no evidence of benefit of molnupiravir in this population. Further research involving inpatients may change this."
        },
        {
          "label": "FUNDING",
          "text": "The editorial base of the Cochrane Infectious Diseases Group is funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104). The views expressed herein do not necessarily reflect the UK Government's official policies."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available at https://doi.org/10.1002/14651858.CD015381."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41147546/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1002/14651858.CD015381.pub2",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Molnupiravir shows little to no impact on mortality, hospitalization, or symptom resolution in outpatients with mild to moderate COVID-19, with unclear clinical significance of increased viral clearance and no significant difference in adverse events."
    },
    {
      "id": "7d2def0e9edf",
      "title": "Oral nicotine pouches for cessation or reduction of use of other tobacco or nicotine products.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118067",
      "abstract": "Electronic cigarettes (EC) are handheld electronic vaping devices that produce an aerosol by heating a liquid. People who smoke, healthcare providers, and regulators want to know if EC can help people quit smoking, and if they are safe to use for this purpose. This review update was conducted as part of a living systematic review. To examine the safety, tolerability, and effectiveness of EC for helping people who smoke tobacco achieve long-term smoking abstinence, in comparison to non-nicotine EC, other smoking cessation treatments, and no treatment. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and PsycINFO to 1 March 2025, reference-checked, and contacted study authors. We included trials randomising people who smoked to an EC or control condition. We also included uncontrolled intervention studies where all participants received an EC intervention. Studies had to measure an eligible outcome. Critical outcomes were abstinence from smoking after at least six months, adverse events (AEs), and serious adverse events (SAEs). Important outcomes were biomarkers, toxicants/carcinogens, and longer-term EC use. We used the RoB 1 tool to assess risk of bias for each study and GRADE to assess evidence certainty. We followed standard Cochrane methods for screening and data extraction. Where appropriate, we pooled data using random-effects models to calculate risk ratios (RRs) with 95% confidence intervals (CIs) for dichotomous outcomes. For continuous outcomes, we calculated mean differences with 95% CIs. We included 104 completed studies (14 new to this update), representing 30,366 participants, of which 61 were randomised controlled trials (RCTs). We rated 11 included studies as being at low risk of bias, 70 at high risk (including all non-randomised studies), and the remainder at unclear risk overall. Nicotine EC result in increased quit rates compared to nicotine replacement therapy (NRT) (high-certainty evidence) (RR 1.55, 95% CI 1.28 to 1.88; I² = 0%; 9 studies, 2703 participants). In absolute terms, this might translate to an additional three quitters per 100 (95% CI 2 to 5 more). The rate of occurrence of AEs is probably similar between groups (moderate-certainty evidence (limited by imprecision)) (RR 1.00, 95% CI 0.73 to 1.37; I² = 58%; 7 studies, 2241 participants). SAEs were rare, and there is insufficient evidence to determine whether rates differ between groups due to very serious imprecision (RR 1.22, 95% CI 0.73 to 2.03; I² = 30%; 8 studies, 2950 participants; low-certainty evidence). Nicotine EC probably result in increased quit rates compared to non-nicotine EC (moderate-certainty evidence, limited by imprecision) (RR 1.34, 95% CI 1.06 to 1.70; I² = 0%; 7 studies, 1918 participants). In absolute terms, this might lead to an additional two quitters per 100 (95% CI 0 to 4 more). There is probably little to no difference in the rate of AEs between these groups (moderate-certainty evidence) (RR 1.01, 95% CI 0.95 to 1.08; I² = 0%; 5 studies, 840 participants). There is insufficient evidence to determine whether rates of SAEs differ between groups, due to very serious imprecision (RR 0.98, 95% CI 0.55 to 1.73; I² = 0%; 10 studies, 1717 participants; low-certainty evidence). Compared to behavioural support only or no support, quit rates may be higher for participants randomised to nicotine EC (low-certainty evidence due to risk of bias) (RR 1.78, 95% CI 1.42 to 2.25; I² = 13%; 11 studies, 6819 participants). In absolute terms, this represents an additional three quitters per 100 (95% CI 2 to 5 more). There was some evidence that (non-serious) AEs may be more common in people randomised to nicotine EC (RR 1.22, 95% CI 0.96 to 1.55; I² = 66%; 8 studies, 2485 participants; very low-certainty evidence) but the evidence is uncertain and, again, there was insufficient evidence to determine whether rates of SAEs differed between groups (RR 0.93, 95% CI 0.67 to 1.29; I² = 0%; 15 studies, 4716 participants; very low-certainty evidence). Data from non-randomised studies were consistent with RCT data. The most commonly reported AEs were throat/mouth irritation, headache, cough, and nausea, which tended to dissipate with continued EC use. Very few studies reported data on other outcomes or comparisons; hence, evidence for these is limited, with CIs often encompassing both clinically significant harm and benefit. There is high-certainty evidence that nicotine EC increase quit rates compared to NRT, and moderate-certainty evidence that they probably increase quit rates compared to EC without nicotine. Evidence comparing nicotine EC with behavioural support or no support also suggests benefit, but is less certain due to risk of bias inherent in the study designs. CIs were, for the most part, wide for data on AEs, SAEs, and other safety markers, with no evidence of a difference in AEs between nicotine and non-nicotine EC nor between nicotine EC and NRT, but low-certainty evidence for increased AEs compared with behavioural support/no support. Overall incidence of SAEs was low across all study arms. We did not detect evidence of serious harm from nicotine EC, but longer, larger trials are needed to fully evaluate safety. Included studies tested regulated nicotine-containing EC; illicit products and/or products containing other active substances (e.g. tetrahydrocannabinol (THC)) may have different harm profiles. The main limitation of the evidence base remains imprecision for some comparisons and for safety outcomes due to the relatively small number of RCTs contributing, often with low event rates. Further RCTs are underway. To ensure the review continues to provide up-to-date information to decision-makers, this is a living systematic review. We run and screen searches monthly, with the review updated when relevant new evidence becomes available. Please refer to the Cochrane Database of Systematic Reviews for the review's current status. Cancer Research UK (PICCTR-2024/100012). Original 2012 protocol available via DOI: 10.1002/14651858.CD010216. Updated 2023 protocol available via DOI 10.17605/OSF.IO/ZWGSK (https://osf.io/ZWGSK/). 2025 updates to protocol available via DOI: 10.17605/OSF.IO/59M4U (https://osf.io/59M4U/) and DOI: 10.17605/OSF.IO/UPGJC (https://osf.io/UPGJC/).",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Electronic cigarettes (EC) are handheld electronic vaping devices that produce an aerosol by heating a liquid. People who smoke, healthcare providers, and regulators want to know if EC can help people quit smoking, and if they are safe to use for this purpose. This review update was conducted as part of a living systematic review."
        },
        {
          "label": "OBJECTIVES",
          "text": "To examine the safety, tolerability, and effectiveness of EC for helping people who smoke tobacco achieve long-term smoking abstinence, in comparison to non-nicotine EC, other smoking cessation treatments, and no treatment."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and PsycINFO to 1 March 2025, reference-checked, and contacted study authors."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included trials randomising people who smoked to an EC or control condition. We also included uncontrolled intervention studies where all participants received an EC intervention. Studies had to measure an eligible outcome."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were abstinence from smoking after at least six months, adverse events (AEs), and serious adverse events (SAEs). Important outcomes were biomarkers, toxicants/carcinogens, and longer-term EC use."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the RoB 1 tool to assess risk of bias for each study and GRADE to assess evidence certainty."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We followed standard Cochrane methods for screening and data extraction. Where appropriate, we pooled data using random-effects models to calculate risk ratios (RRs) with 95% confidence intervals (CIs) for dichotomous outcomes. For continuous outcomes, we calculated mean differences with 95% CIs."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 104 completed studies (14 new to this update), representing 30,366 participants, of which 61 were randomised controlled trials (RCTs). We rated 11 included studies as being at low risk of bias, 70 at high risk (including all non-randomised studies), and the remainder at unclear risk overall."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Nicotine EC result in increased quit rates compared to nicotine replacement therapy (NRT) (high-certainty evidence) (RR 1.55, 95% CI 1.28 to 1.88; I² = 0%; 9 studies, 2703 participants). In absolute terms, this might translate to an additional three quitters per 100 (95% CI 2 to 5 more). The rate of occurrence of AEs is probably similar between groups (moderate-certainty evidence (limited by imprecision)) (RR 1.00, 95% CI 0.73 to 1.37; I² = 58%; 7 studies, 2241 participants). SAEs were rare, and there is insufficient evidence to determine whether rates differ between groups due to very serious imprecision (RR 1.22, 95% CI 0.73 to 2.03; I² = 30%; 8 studies, 2950 participants; low-certainty evidence). Nicotine EC probably result in increased quit rates compared to non-nicotine EC (moderate-certainty evidence, limited by imprecision) (RR 1.34, 95% CI 1.06 to 1.70; I² = 0%; 7 studies, 1918 participants). In absolute terms, this might lead to an additional two quitters per 100 (95% CI 0 to 4 more). There is probably little to no difference in the rate of AEs between these groups (moderate-certainty evidence) (RR 1.01, 95% CI 0.95 to 1.08; I² = 0%; 5 studies, 840 participants). There is insufficient evidence to determine whether rates of SAEs differ between groups, due to very serious imprecision (RR 0.98, 95% CI 0.55 to 1.73; I² = 0%; 10 studies, 1717 participants; low-certainty evidence). Compared to behavioural support only or no support, quit rates may be higher for participants randomised to nicotine EC (low-certainty evidence due to risk of bias) (RR 1.78, 95% CI 1.42 to 2.25; I² = 13%; 11 studies, 6819 participants). In absolute terms, this represents an additional three quitters per 100 (95% CI 2 to 5 more). There was some evidence that (non-serious) AEs may be more common in people randomised to nicotine EC (RR 1.22, 95% CI 0.96 to 1.55; I² = 66%; 8 studies, 2485 participants; very low-certainty evidence) but the evidence is uncertain and, again, there was insufficient evidence to determine whether rates of SAEs differed between groups (RR 0.93, 95% CI 0.67 to 1.29; I² = 0%; 15 studies, 4716 participants; very low-certainty evidence). Data from non-randomised studies were consistent with RCT data. The most commonly reported AEs were throat/mouth irritation, headache, cough, and nausea, which tended to dissipate with continued EC use. Very few studies reported data on other outcomes or comparisons; hence, evidence for these is limited, with CIs often encompassing both clinically significant harm and benefit."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is high-certainty evidence that nicotine EC increase quit rates compared to NRT, and moderate-certainty evidence that they probably increase quit rates compared to EC without nicotine. Evidence comparing nicotine EC with behavioural support or no support also suggests benefit, but is less certain due to risk of bias inherent in the study designs. CIs were, for the most part, wide for data on AEs, SAEs, and other safety markers, with no evidence of a difference in AEs between nicotine and non-nicotine EC nor between nicotine EC and NRT, but low-certainty evidence for increased AEs compared with behavioural support/no support. Overall incidence of SAEs was low across all study arms. We did not detect evidence of serious harm from nicotine EC, but longer, larger trials are needed to fully evaluate safety. Included studies tested regulated nicotine-containing EC; illicit products and/or products containing other active substances (e.g. tetrahydrocannabinol (THC)) may have different harm profiles. The main limitation of the evidence base remains imprecision for some comparisons and for safety outcomes due to the relatively small number of RCTs contributing, often with low event rates. Further RCTs are underway. To ensure the review continues to provide up-to-date information to decision-makers, this is a living systematic review. We run and screen searches monthly, with the review updated when relevant new evidence becomes available. Please refer to the Cochrane Database of Systematic Reviews for the review's current status."
        },
        {
          "label": "FUNDING",
          "text": "Cancer Research UK (PICCTR-2024/100012)."
        },
        {
          "label": "REGISTRATION",
          "text": "Original 2012 protocol available via DOI: 10.1002/14651858.CD010216. Updated 2023 protocol available via DOI 10.17605/OSF.IO/ZWGSK (https://osf.io/ZWGSK/). 2025 updates to protocol available via DOI: 10.17605/OSF.IO/59M4U (https://osf.io/59M4U/) and DOI: 10.17605/OSF.IO/UPGJC (https://osf.io/UPGJC/)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212103/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1002/14651858.CD010216.pub10",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Nicotine-containing e-cigarettes likely increase smoking cessation rates compared to nicotine replacement therapy and e-cigarettes without nicotine, with no evidence of serious harm detected in the included studies, though longer-term safety data are still needed."
    },
    {
      "id": "5d17f6088dd5",
      "title": "Management of systemic lupus erythematosus with kidney involvement: systematic literature review to inform the 2025 update of EULAR recommendations.",
      "journal": "EULAR Rheumatology Open",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Nephrology",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118019",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false
    },
    {
      "id": "62e2a5805606",
      "title": "Efficacy and safety of European Medicines Agency (EMA)-approved pharmacological, endoscopic, and surgical treatments in different classes of obesity: A network meta-analysis of randomised controlled trials for the development of the SIO (Societa Italiana Obesita) Italian guidelines for the diagnosis and treatment of overweight and obesity.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/117992",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false
    },
    {
      "id": "fa4112247617",
      "title": "Time to Benefit for Lung Cancer Screening: A Systematic Review and Survival Meta-Analysis.",
      "journal": "Am J Prev Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/117949",
      "abstract": "Lung cancer screening with low-dose computed tomography reduces lung cancer mortality in the long term but carries immediate risks. Guidelines recommend screening persons whose life expectancy exceeds the screening test's time to benefit, defined as the time from screening initiation to first observed benefit. This study aimed to estimate the time to benefit for lung cancer screening to prevent lung cancer mortality. Randomized controlled trials of lung cancer screening with low-dose computed tomography were identified from two prior systematic reviews and an updated search to December 3, 2023. Studies that reported lung cancer mortality were included. For each study, independent Weibull survival curves were fitted and Markov chain Monte Carlo simulations were generated to estimate the absolute risk reduction at different time points. Time to benefit was determined as the time at which absolute risk reduction thresholds (ARR=0.0005, 0.001, 0.002) were crossed. These estimates were pooled using a random-effects meta-analysis model. A total of eight randomized controlled trials comprising 88,526 participants were included. Enrollment age ranged from age 50 to 70 years; follow-up duration ranged from 7.3 to 12.3 years. For every 1,000 persons screened, 3.4 years (95%=CI 2.2, 5.1) passed before 1 death from lung cancer was prevented (ARR=0.001). The time to prevent one lung cancer death per 2,000 persons screened (ARR=0.0005) was 2.2 years (95% CI=1.4, 3.4); per 500 persons screened (ARR=0.002), it was 5.2 years (95%=CI 3.7, 7.3). Lung cancer screening is most appropriate for older adults at high risk of lung cancer with a life expectancy greater than 3.4 years.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Lung cancer screening with low-dose computed tomography reduces lung cancer mortality in the long term but carries immediate risks. Guidelines recommend screening persons whose life expectancy exceeds the screening test's time to benefit, defined as the time from screening initiation to first observed benefit. This study aimed to estimate the time to benefit for lung cancer screening to prevent lung cancer mortality."
        },
        {
          "label": "METHODS",
          "text": "Randomized controlled trials of lung cancer screening with low-dose computed tomography were identified from two prior systematic reviews and an updated search to December 3, 2023. Studies that reported lung cancer mortality were included. For each study, independent Weibull survival curves were fitted and Markov chain Monte Carlo simulations were generated to estimate the absolute risk reduction at different time points. Time to benefit was determined as the time at which absolute risk reduction thresholds (ARR=0.0005, 0.001, 0.002) were crossed. These estimates were pooled using a random-effects meta-analysis model."
        },
        {
          "label": "RESULTS",
          "text": "A total of eight randomized controlled trials comprising 88,526 participants were included. Enrollment age ranged from age 50 to 70 years; follow-up duration ranged from 7.3 to 12.3 years. For every 1,000 persons screened, 3.4 years (95%=CI 2.2, 5.1) passed before 1 death from lung cancer was prevented (ARR=0.001). The time to prevent one lung cancer death per 2,000 persons screened (ARR=0.0005) was 2.2 years (95% CI=1.4, 3.4); per 500 persons screened (ARR=0.002), it was 5.2 years (95%=CI 3.7, 7.3)."
        },
        {
          "label": "DISCUSSION",
          "text": "Lung cancer screening is most appropriate for older adults at high risk of lung cancer with a life expectancy greater than 3.4 years."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40447235/",
      "pubDate": "2025 Aug",
      "doi": "10.1016/j.amepre.2025.107736",
      "dateReceived": "2025-11-18T23:25:08.818Z",
      "isNew": false,
      "summary": "Lung cancer screening with low-dose computed tomography prevents one lung cancer death after approximately 3.4 years of screening for every 1,000 people screened."
    },
    {
      "id": "dad8531a2b28",
      "title": "Preconception and first-trimester metformin on pregnancy outcomes in women with polycystic ovary syndrome: a systematic review and meta-analysis.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48970507/118149",
      "abstract": "This study aimed to explore the effects of preconception and first-trimester metformin use on pregnancy outcomes in women with polycystic ovary syndrome. MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials were searched from database inception to August 1, 2024. Randomized controlled trials of metformin started before conception and continued at least until a positive pregnancy test compared with either placebo or no treatment in women with polycystic ovary syndrome were included. A systematic review and meta-analysis was conducted. Pooled odds ratios with 95% confidence intervals were calculated for the following key outcomes: miscarriage (primary) and clinical pregnancy and live birth (secondary). The studies were assessed for quality using the Cochrane risk-of-bias tool for randomized trials (RoB 2) and the Grading of Recommendations, Assessment, Development, and Evaluation approach. Indirect comparisons were performed for all key outcomes on the timing of metformin treatment using the Bucher technique. A total of 12 trustworthy studies (involving 1708 women) were included in the meta-analysis, all of which were graded low to moderate quality. Women who received preconception metformin that was continued throughout the first trimester of pregnancy showed higher clinical pregnancy rates (odds ratio, 1.57 [95% confidence interval, 1.11-2.23]), a possible reduction in miscarriage (odds ratio, 0.64 [95% confidence interval, 0.32-1.25]), and possible increase in live birth (odds ratio, 1.24 [95% confidence interval, 0.59-2.61]) than women who received either a placebo or no treatment. Women who stopped metformin once pregnant not only had an increase in clinical pregnancy rate (odds ratio, 1.35 [95% confidence interval, 1.01-1.80]) but also had an indication of an increase in miscarriage rate (odds ratio, 1.46 [95% confidence interval, 0.73-2.90]) compared with those who received a placebo or no treatment. Indirect comparisons between metformin continued through the first trimester of pregnancy and metformin stopped once pregnant consistently demonstrated a trend favoring the continuation of metformin: clinical pregnancy odds ratio of 1.16 (95% confidence interval, 0.74-1.83), miscarriage odds ratio of 0.44 (95% confidence interval, 0.17-1.16), and live birth odds ratio of 1.14 (95% confidence interval, 0.41-3.13). Continuing metformin treatment throughout the first trimester of pregnancy may reduce the risk of miscarriage and increase live birth rates in women with polycystic ovary syndrome. Continuation of metformin seems to have greater clinical benefit than discontinuation of metformin after a positive pregnancy test. There is a need for further high-quality research.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This study aimed to explore the effects of preconception and first-trimester metformin use on pregnancy outcomes in women with polycystic ovary syndrome."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials were searched from database inception to August 1, 2024."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Randomized controlled trials of metformin started before conception and continued at least until a positive pregnancy test compared with either placebo or no treatment in women with polycystic ovary syndrome were included."
        },
        {
          "label": "METHODS",
          "text": "A systematic review and meta-analysis was conducted. Pooled odds ratios with 95% confidence intervals were calculated for the following key outcomes: miscarriage (primary) and clinical pregnancy and live birth (secondary). The studies were assessed for quality using the Cochrane risk-of-bias tool for randomized trials (RoB 2) and the Grading of Recommendations, Assessment, Development, and Evaluation approach. Indirect comparisons were performed for all key outcomes on the timing of metformin treatment using the Bucher technique."
        },
        {
          "label": "RESULTS",
          "text": "A total of 12 trustworthy studies (involving 1708 women) were included in the meta-analysis, all of which were graded low to moderate quality. Women who received preconception metformin that was continued throughout the first trimester of pregnancy showed higher clinical pregnancy rates (odds ratio, 1.57 [95% confidence interval, 1.11-2.23]), a possible reduction in miscarriage (odds ratio, 0.64 [95% confidence interval, 0.32-1.25]), and possible increase in live birth (odds ratio, 1.24 [95% confidence interval, 0.59-2.61]) than women who received either a placebo or no treatment. Women who stopped metformin once pregnant not only had an increase in clinical pregnancy rate (odds ratio, 1.35 [95% confidence interval, 1.01-1.80]) but also had an indication of an increase in miscarriage rate (odds ratio, 1.46 [95% confidence interval, 0.73-2.90]) compared with those who received a placebo or no treatment. Indirect comparisons between metformin continued through the first trimester of pregnancy and metformin stopped once pregnant consistently demonstrated a trend favoring the continuation of metformin: clinical pregnancy odds ratio of 1.16 (95% confidence interval, 0.74-1.83), miscarriage odds ratio of 0.44 (95% confidence interval, 0.17-1.16), and live birth odds ratio of 1.14 (95% confidence interval, 0.41-3.13)."
        },
        {
          "label": "CONCLUSION",
          "text": "Continuing metformin treatment throughout the first trimester of pregnancy may reduce the risk of miscarriage and increase live birth rates in women with polycystic ovary syndrome. Continuation of metformin seems to have greater clinical benefit than discontinuation of metformin after a positive pregnancy test. There is a need for further high-quality research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40473092/",
      "pubDate": "2025 Jun 03",
      "doi": "10.1016/j.ajog.2025.05.038",
      "dateReceived": "2025-11-18T23:25:08.817Z",
      "isNew": false
    },
    {
      "id": "ff3a7dcdd578",
      "title": "Transcatheter or Surgical Aortic-Valve Replacement in Low-Risk Patients at 7 Years.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48868381/118011",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160827/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1056/NEJMc2507935",
      "dateReceived": "2025-11-17T23:25:05.557Z",
      "isNew": false
    },
    {
      "id": "36491efce2b9",
      "title": "Low-dose belimumab reduced risk of flares in patients with systemic lupus erythematosus: a multicentre, randomised, double-blind, placebo-controlled trial.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48959239/118102",
      "abstract": "The efficacy of low-dose belimumab for disease flare prevention in patients with lupus with low disease activity was evaluated (NCT04515719). In this 52-week, randomised, placebo-controlled trial, patients who had a Safety of Estrogens in Lupus Erythematosus National Assessment-Systemic Lupus Erythematosus Disease Activity Index (SELENA-SLEDAI) score of ≤6, with no A and ≤ 1 B on British Isles Lupus Assessment Group, and who had prednisone ≤20 mg/d at screening were enrolled and randomly assigned 1:1 to intravenous 120 mg belimumab or placebo (saline). The primary outcome was disease flares within 52 weeks. The trial was terminated prematurely on 10 April 2022 when Renji Hospital was designated as a COVID-19 referral centre during the Shanghai lockdown. Overall, 90.5% and 86.1% of patients in the belimumab (n = 116) and placebo (n = 115) arms completed the study within a follow-up of 31 ± 16.1 weeks. The primary endpoint was met. In total, 7.8% of patients receiving low-dose belimumab had disease flares, significantly lower than that in the placebo group (19.1%) (P = .012; difference 11.3%; 95% CI 1.8%-20.9%). Kaplan-Meier curves also demonstrated lower cumulative flare rates in the belimumab arm (P = .011, Hazard Ratio (HR), 0.38; 95% CI 0.17-0.83). Glucocorticoid-sparing effects were comparable (Δprednisone from baseline, -1.55 ± 10.11 mg/d vs -0.91 ± 7.43 mg/d, P = .075). SELENA-SLEDAI was reduced by 0.62 ± 2.14 in the belimumab group; however, it increased by 0.12 ± 2.80 in the placebo group (P = .009). Any adverse events were comparable (61.2% vs 64.3%). Only 4 (3.4%) and 6 (5.2%) severe adverse events occurred in 2 groups, respectively. Treatment with low-dose belimumab helped reduce the risks of disease flares in Chinese patients with systemic lupus erythematosus at low disease activity. Belimumab was generally well-tolerated.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "The efficacy of low-dose belimumab for disease flare prevention in patients with lupus with low disease activity was evaluated (NCT04515719)."
        },
        {
          "label": "METHODS",
          "text": "In this 52-week, randomised, placebo-controlled trial, patients who had a Safety of Estrogens in Lupus Erythematosus National Assessment-Systemic Lupus Erythematosus Disease Activity Index (SELENA-SLEDAI) score of ≤6, with no A and ≤ 1 B on British Isles Lupus Assessment Group, and who had prednisone ≤20 mg/d at screening were enrolled and randomly assigned 1:1 to intravenous 120 mg belimumab or placebo (saline). The primary outcome was disease flares within 52 weeks. The trial was terminated prematurely on 10 April 2022 when Renji Hospital was designated as a COVID-19 referral centre during the Shanghai lockdown."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 90.5% and 86.1% of patients in the belimumab (n = 116) and placebo (n = 115) arms completed the study within a follow-up of 31 ± 16.1 weeks. The primary endpoint was met. In total, 7.8% of patients receiving low-dose belimumab had disease flares, significantly lower than that in the placebo group (19.1%) (P = .012; difference 11.3%; 95% CI 1.8%-20.9%). Kaplan-Meier curves also demonstrated lower cumulative flare rates in the belimumab arm (P = .011, Hazard Ratio (HR), 0.38; 95% CI 0.17-0.83). Glucocorticoid-sparing effects were comparable (Δprednisone from baseline, -1.55 ± 10.11 mg/d vs -0.91 ± 7.43 mg/d, P = .075). SELENA-SLEDAI was reduced by 0.62 ± 2.14 in the belimumab group; however, it increased by 0.12 ± 2.80 in the placebo group (P = .009). Any adverse events were comparable (61.2% vs 64.3%). Only 4 (3.4%) and 6 (5.2%) severe adverse events occurred in 2 groups, respectively."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Treatment with low-dose belimumab helped reduce the risks of disease flares in Chinese patients with systemic lupus erythematosus at low disease activity. Belimumab was generally well-tolerated."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41203461/",
      "pubDate": "2025 Nov 06",
      "doi": "10.1016/j.ard.2025.10.010",
      "dateReceived": "2025-11-17T23:25:05.556Z",
      "isNew": false,
      "summary": "Low-dose belimumab effectively decreased flare risk and was well-tolerated in Chinese systemic lupus erythematosus patients with low disease activity."
    },
    {
      "id": "726f375e5b41",
      "title": "Hormone therapy in postmenopausal women and risk of endometrial hyperplasia or endometrial cancer.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48959239/118073",
      "abstract": "Reduced circulating estrogen levels around the time of menopause can induce symptoms that affect health and well-being. Estrogen therapy is the most effective treatment, but may be associated with some adverse health outcomes, including endometrial pathology. This is an update of a review first published in 1999 and last updated in 2012. • To assess the effects of hormone therapy regimens for protecting postmenopausal women against endometrial hyperplasia and endometrial cancer. • To define the lowest effective dose(s) of progestogen used in combination with estrogen therapy for protecting the endometrium. We searched for trials in the Cochrane Gynaecology and Fertility Group specialized register, CENTRAL (containing output from two trial registers and CINAHL), MEDLINE, Embase, and PsycINFO to 22 July 2024. We also checked references and contacted study authors to identify additional studies. Interventions of interest were unopposed estrogen, continuous combined estrogen and progestogen, and sequential combined estrogen and progestogen, administered for at least one year. These interventions could be compared head to head or with placebo. Trials had to report rates of endometrial hyperplasia or endometrial cancer (histologic diagnosis). Our critical outcomes were endometrial hyperplasia and endometrial cancer at one year and after one year. Our important outcomes were adherence to therapy, requirement for additional interventions, and withdrawal due to adverse events. We used the original Cochrane risk of bias tool (RoB 1). Where meta-analysis was possible, we calculated odds ratios (ORs) with 95% confidence intervals (CIs). We used GRADE to assess the certainty of evidence for each outcome. This update included 72 studies (involving 40,652 women) conducted worldwide. There were 42 multicenter trials. There were too few studies with events to draw conclusions about endometrial cancer. The results for endometrial hyperplasia are presented below. Unopposed estrogen versus placebo Unopposed estrogen probably increases the risk of endometrial hyperplasia at one year compared with placebo (22-43 events/1000 women versus 5 events/1000 women; OR 5.86, 95% CI 4.09 to 8.40; I² = 0%; 6 RCTs, 2493 women; moderate-certainty-evidence). Unopposed estrogen probably increases the risk of endometrial hyperplasia after one year (40-68 events/1000 women versus 6 events/1000 women; OR 8.97, 95% CI 6.78 to 11.87; I² = 49%; 9 RCTs, 2539 women; moderate-certainty-evidence). Continuous combined estrogen plus progestogen versus placebo Continuous combined therapy may have little to no effect on the risk of endometrial hyperplasia at one year compared with placebo (0-16 events/1000 women versus 5 events/1000 women; OR 0.51, 95% CI 0.08 to 3.38; I² = 48%; 4 RCTs, 3893 women; low-certainty-evidence). We are unsure about the effect of continuous combined therapy after one year (OR 0.25, 95% CI 0.04 to 1.40; I² = 47%; 4 RCTs, 789 women; very low-certainty evidence). Sequential combined estrogen plus progestogen versus placebo Sequential combined therapy may increase the risk of endometrial hyperplasia at one year compared with placebo (6-27 events/1000 women versus 2 events/1000 women; OR 5.53, 95% CI 2.60 to 11.76; I² = 0%; 4 RCTs, 1030 women; low-certainty-evidence). Sequential combined therapy may result in little to no difference in the risk of endometrial hyperplasia after one year (16-97 events/1000 women versus 20 events/1000 women; OR 2.30, 95% CI 0.76 to 6.99; I² = 0%; 3 RCTs, 534 women; low-certainty-evidence). Unopposed estrogen versus continuous combined estrogen plus progestogen Unopposed estrogen probably increases the risk of endometrial hyperplasia at one year compared with continuous combined therapy (46-75 events/1000 women versus 3 events /1000 women; OR 21.90, 95% CI 16.76 to 28.62; I² = 53%; 11 RCTs, 7856 women; moderate-certainty-evidence). Unopposed estrogen probably increases the risk of endometrial hyperplasia after one year compared with continuous combined therapy (33-73 events/1000 women versus 3 events/1000 women; OR 16.78, 95% CI 11.01 to 25.55; I² = 69%; 3 RCTs, 1191 women; moderate-certainty-evidence). Unopposed estrogen versus sequential combined estrogen plus progestogen Unopposed estrogen may increase the risk of endometrial hyperplasia at one year compared with sequential combined therapy (156-301 events/1000 women versus 16 events/1000 women; OR 17.19, 95% CI 11.27 to 26.22; I² = 70%; 5 RCTs, 2354 women; low-certainty-evidence). Unopposed estrogen may increase the risk of endometrial hyperplasia after one year compared with sequential combined treatment (379-612 events/1000 women versus 49 events/1000 women; OR 19.21, 95% CI 11.95 to 30.90; I² = 15%; 2 RCTs, 417 women; low-certainty-evidence). Continuous combined estrogen plus progestogen versus sequential combined estrogen plus progestogen All analyses had insufficient events to draw conclusions. Continuous combined estrogen plus progestogen - dose comparisons We are unsure about the effect of moderate-dose estrogen plus low-dose progestogen compared with moderate-dose estrogen plus moderate-dose progestogen on the risk of endometrial hyperplasia at one year (OR 1.18, 95% CI 0.24 to 5.84; I² = 36%; 2 RCTs, 2363 women; very low-certainty-evidence). The remaining dose comparisons had insufficient events to draw conclusions. Sequential combined estrogen plus progestogen - dose comparisons Moderate-dose estrogen plus low-dose progestogen may result in little to no difference in the risk of endometrial hyperplasia at one year compared with moderate-dose estrogen plus moderate-dose progestogen (3-32 events/1000 women versus 6 events/1000 women; OR 1.66, 95% CI 0.49 to 5.65; I² = 0%; 4 RCTs, 1072 women; low-certainty-evidence). The remaining dose comparisons had insufficient events to draw conclusions. Unopposed estrogen probably increases the risk of endometrial hyperplasia versus placebo and continuous combined therapy at one year and later. Sequential combined therapy may increase the risk of endometrial hyperplasia at one year versus placebo. The evidence is less certain for continuous versus sequential combined regimens and dose comparisons of continuous and sequential combined regimens. The trials had few events, and long-term follow-up was challenging. For endometrial cancer, events were rare and trials were underpowered to draw meaningful conclusions. This review had no dedicated funding. Original review (1999) DOI: 10.1002/14651858.CD000402 Review update (2004) DOI: 10.1002/14651858.CD000402.pub2 Review update (2009) DOI: 10.1002/14651858.CD000402.pub3 Review update (2012) DOI: 10.1002/14651858.CD000402.pub4.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Reduced circulating estrogen levels around the time of menopause can induce symptoms that affect health and well-being. Estrogen therapy is the most effective treatment, but may be associated with some adverse health outcomes, including endometrial pathology. This is an update of a review first published in 1999 and last updated in 2012."
        },
        {
          "label": "OBJECTIVES",
          "text": "• To assess the effects of hormone therapy regimens for protecting postmenopausal women against endometrial hyperplasia and endometrial cancer. • To define the lowest effective dose(s) of progestogen used in combination with estrogen therapy for protecting the endometrium."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched for trials in the Cochrane Gynaecology and Fertility Group specialized register, CENTRAL (containing output from two trial registers and CINAHL), MEDLINE, Embase, and PsycINFO to 22 July 2024. We also checked references and contacted study authors to identify additional studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Interventions of interest were unopposed estrogen, continuous combined estrogen and progestogen, and sequential combined estrogen and progestogen, administered for at least one year. These interventions could be compared head to head or with placebo. Trials had to report rates of endometrial hyperplasia or endometrial cancer (histologic diagnosis)."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were endometrial hyperplasia and endometrial cancer at one year and after one year. Our important outcomes were adherence to therapy, requirement for additional interventions, and withdrawal due to adverse events."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the original Cochrane risk of bias tool (RoB 1)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Where meta-analysis was possible, we calculated odds ratios (ORs) with 95% confidence intervals (CIs). We used GRADE to assess the certainty of evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This update included 72 studies (involving 40,652 women) conducted worldwide. There were 42 multicenter trials."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "There were too few studies with events to draw conclusions about endometrial cancer. The results for endometrial hyperplasia are presented below. Unopposed estrogen versus placebo Unopposed estrogen probably increases the risk of endometrial hyperplasia at one year compared with placebo (22-43 events/1000 women versus 5 events/1000 women; OR 5.86, 95% CI 4.09 to 8.40; I² = 0%; 6 RCTs, 2493 women; moderate-certainty-evidence). Unopposed estrogen probably increases the risk of endometrial hyperplasia after one year (40-68 events/1000 women versus 6 events/1000 women; OR 8.97, 95% CI 6.78 to 11.87; I² = 49%; 9 RCTs, 2539 women; moderate-certainty-evidence). Continuous combined estrogen plus progestogen versus placebo Continuous combined therapy may have little to no effect on the risk of endometrial hyperplasia at one year compared with placebo (0-16 events/1000 women versus 5 events/1000 women; OR 0.51, 95% CI 0.08 to 3.38; I² = 48%; 4 RCTs, 3893 women; low-certainty-evidence). We are unsure about the effect of continuous combined therapy after one year (OR 0.25, 95% CI 0.04 to 1.40; I² = 47%; 4 RCTs, 789 women; very low-certainty evidence). Sequential combined estrogen plus progestogen versus placebo Sequential combined therapy may increase the risk of endometrial hyperplasia at one year compared with placebo (6-27 events/1000 women versus 2 events/1000 women; OR 5.53, 95% CI 2.60 to 11.76; I² = 0%; 4 RCTs, 1030 women; low-certainty-evidence). Sequential combined therapy may result in little to no difference in the risk of endometrial hyperplasia after one year (16-97 events/1000 women versus 20 events/1000 women; OR 2.30, 95% CI 0.76 to 6.99; I² = 0%; 3 RCTs, 534 women; low-certainty-evidence). Unopposed estrogen versus continuous combined estrogen plus progestogen Unopposed estrogen probably increases the risk of endometrial hyperplasia at one year compared with continuous combined therapy (46-75 events/1000 women versus 3 events /1000 women; OR 21.90, 95% CI 16.76 to 28.62; I² = 53%; 11 RCTs, 7856 women; moderate-certainty-evidence). Unopposed estrogen probably increases the risk of endometrial hyperplasia after one year compared with continuous combined therapy (33-73 events/1000 women versus 3 events/1000 women; OR 16.78, 95% CI 11.01 to 25.55; I² = 69%; 3 RCTs, 1191 women; moderate-certainty-evidence). Unopposed estrogen versus sequential combined estrogen plus progestogen Unopposed estrogen may increase the risk of endometrial hyperplasia at one year compared with sequential combined therapy (156-301 events/1000 women versus 16 events/1000 women; OR 17.19, 95% CI 11.27 to 26.22; I² = 70%; 5 RCTs, 2354 women; low-certainty-evidence). Unopposed estrogen may increase the risk of endometrial hyperplasia after one year compared with sequential combined treatment (379-612 events/1000 women versus 49 events/1000 women; OR 19.21, 95% CI 11.95 to 30.90; I² = 15%; 2 RCTs, 417 women; low-certainty-evidence). Continuous combined estrogen plus progestogen versus sequential combined estrogen plus progestogen All analyses had insufficient events to draw conclusions. Continuous combined estrogen plus progestogen - dose comparisons We are unsure about the effect of moderate-dose estrogen plus low-dose progestogen compared with moderate-dose estrogen plus moderate-dose progestogen on the risk of endometrial hyperplasia at one year (OR 1.18, 95% CI 0.24 to 5.84; I² = 36%; 2 RCTs, 2363 women; very low-certainty-evidence). The remaining dose comparisons had insufficient events to draw conclusions. Sequential combined estrogen plus progestogen - dose comparisons Moderate-dose estrogen plus low-dose progestogen may result in little to no difference in the risk of endometrial hyperplasia at one year compared with moderate-dose estrogen plus moderate-dose progestogen (3-32 events/1000 women versus 6 events/1000 women; OR 1.66, 95% CI 0.49 to 5.65; I² = 0%; 4 RCTs, 1072 women; low-certainty-evidence). The remaining dose comparisons had insufficient events to draw conclusions."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Unopposed estrogen probably increases the risk of endometrial hyperplasia versus placebo and continuous combined therapy at one year and later. Sequential combined therapy may increase the risk of endometrial hyperplasia at one year versus placebo. The evidence is less certain for continuous versus sequential combined regimens and dose comparisons of continuous and sequential combined regimens. The trials had few events, and long-term follow-up was challenging. For endometrial cancer, events were rare and trials were underpowered to draw meaningful conclusions."
        },
        {
          "label": "FUNDING",
          "text": "This review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Original review (1999) DOI: 10.1002/14651858.CD000402 Review update (2004) DOI: 10.1002/14651858.CD000402.pub2 Review update (2009) DOI: 10.1002/14651858.CD000402.pub3 Review update (2012) DOI: 10.1002/14651858.CD000402.pub4."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41128095/",
      "pubDate": "2025 Oct 23",
      "doi": "10.1002/14651858.CD000402.pub5",
      "dateReceived": "2025-11-17T23:25:05.556Z",
      "isNew": false,
      "summary": "Unopposed estrogen increases the risk of endometrial hyperplasia compared to placebo and continuous combined therapy, while sequential combined therapy may increase the risk compared to placebo at one year."
    },
    {
      "id": "e2c0564ae2d0",
      "title": "Diagnostic utility of speech-based biomarkers in mild cognitive impairment: a systematic review and meta-analysis.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48849269/118070",
      "abstract": "Among various tools developed for mild cognitive impairment (MCI) detection, analysing speech features is a non-invasive and cost-effective approach that shows promise for early detection. This review aimed to systematically synthesise and analyse current evidence on the diagnostic utility of speech-based biomarkers for identifying MCI. A systematic review and meta-analysis were conducted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. PubMed, Scopus, Ovid Medline and PsycINFO databases were searched up to April 2025 without restrictions on language, article status or year. Of 4432 identified records, 54 peer-reviewed articles met the inclusion criteria. Fixed-effects meta-analyses showed pooled estimates of 80.0% 'accuracy' [95% confidence intervals (CI): 70.0%-89.0%, P < .001, n = 21], 78.0% 'area under the curve' (95% CI: 70.0%-86.0%, P < .001, n = 21), 80.0% 'sensitivity' (95% CI: 71.0%-90.0%, P < .001, n = 22), and 77.0% 'specificity' (95% CI: 65.0%-89.0%, P < .001, n = 15) in differentiating MCI from cognitively unimpaired (CU) individuals. Egger's regression tests indicated no publication bias (P ≥ .299), and the I2 statistic revealed no heterogeneity across studies (I2 = 0.00%, P = 1.00). Four studies also included a subjective cognitive decline group, reporting significant differences in certain speech features compared to CU. Speech analysis demonstrates moderate classification performance, with balanced sensitivity and specificity, in distinguishing MCI from CU, suggesting its potential as an accurate and cost-effective diagnostic tool for MCI detection. Further research is needed to address variations in study methodologies, refine speech analysis protocols and validate findings in diverse populations to enhance generalisability.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Among various tools developed for mild cognitive impairment (MCI) detection, analysing speech features is a non-invasive and cost-effective approach that shows promise for early detection. This review aimed to systematically synthesise and analyse current evidence on the diagnostic utility of speech-based biomarkers for identifying MCI."
        },
        {
          "label": "METHODS",
          "text": "A systematic review and meta-analysis were conducted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. PubMed, Scopus, Ovid Medline and PsycINFO databases were searched up to April 2025 without restrictions on language, article status or year."
        },
        {
          "label": "RESULTS",
          "text": "Of 4432 identified records, 54 peer-reviewed articles met the inclusion criteria. Fixed-effects meta-analyses showed pooled estimates of 80.0% 'accuracy' [95% confidence intervals (CI): 70.0%-89.0%, P < .001, n = 21], 78.0% 'area under the curve' (95% CI: 70.0%-86.0%, P < .001, n = 21), 80.0% 'sensitivity' (95% CI: 71.0%-90.0%, P < .001, n = 22), and 77.0% 'specificity' (95% CI: 65.0%-89.0%, P < .001, n = 15) in differentiating MCI from cognitively unimpaired (CU) individuals. Egger's regression tests indicated no publication bias (P ≥ .299), and the I2 statistic revealed no heterogeneity across studies (I2 = 0.00%, P = 1.00). Four studies also included a subjective cognitive decline group, reporting significant differences in certain speech features compared to CU."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Speech analysis demonstrates moderate classification performance, with balanced sensitivity and specificity, in distinguishing MCI from CU, suggesting its potential as an accurate and cost-effective diagnostic tool for MCI detection. Further research is needed to address variations in study methodologies, refine speech analysis protocols and validate findings in diverse populations to enhance generalisability."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41148189/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf316",
      "dateReceived": "2025-11-16T23:23:49.678Z",
      "isNew": false,
      "summary": "Speech analysis shows promise as a moderately accurate and affordable way to identify mild cognitive impairment (MCI) compared to cognitively unimpaired individuals (CU)."
    },
    {
      "id": "5722ccc719a0",
      "title": "Outcomes of boarding critically ill patients in U.S. EDs: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/118072",
      "abstract": "Boarding is the practice of holding patients in the emergency department (ED) or a temporary location after the decision to admit or transfer has been made. Previous literature suggests that ED Length of Stay (LOS), prolonged in boarded patients, is linked to worse outcomes. We conducted a systematic review and meta-analysis (SR/MA) to evaluate the differences in mortality and hospital LOS in ED-boarding (EDB) and non-ED boarding (non-EDB) critically ill patients in U.S. EDs. A systematic search was performed with medical librarians using major health science databases from 2012 through December 2024. Eligible studies included observational or randomized trials involving adults comparing EDB and non-EDB groups in U.S. EDs. Only full-text English-language articles were included. Outcomes were mortality and hospital LOS. We used random-effects meta-analysis to compare the outcomes. Heterogeneity was assessed with the I value while publication bias was assessed via the funnel plot. We identified 3139 studies and included 17, comprising 407,178 ED patients: 194,814 (48 %) EDB and 212,364 (52 %) non-EDB. 87.4 % of patients came from urban academic Emergency Departments with a resuscitation unit or team. Median ED LOS was 6.5 h (IQR 5.18-8.1) for EDB and 4.2 h (IQR 2.38-5.75) for non-EDB (p < 0.01). EDB patients had similar all-cause mortality (OR 1.06, 95 % CI 0.94-1.19, I = 69 %, p = 0.38) and hospital LOS (mean difference 0.38 days, 95 % CI -0.75-1.50, I = 61 %, p = 0.51). Funnel plot suggested publication bias favoring higher mortality in EDB. Our SR/MA suggested that EDB was associated with a non-statistically significant increase in mortality and hospital LOS compared to non-EDB. High heterogeneity and inconsistent boarding definitions were also noted.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Boarding is the practice of holding patients in the emergency department (ED) or a temporary location after the decision to admit or transfer has been made. Previous literature suggests that ED Length of Stay (LOS), prolonged in boarded patients, is linked to worse outcomes. We conducted a systematic review and meta-analysis (SR/MA) to evaluate the differences in mortality and hospital LOS in ED-boarding (EDB) and non-ED boarding (non-EDB) critically ill patients in U.S. EDs."
        },
        {
          "label": "METHODS",
          "text": "A systematic search was performed with medical librarians using major health science databases from 2012 through December 2024. Eligible studies included observational or randomized trials involving adults comparing EDB and non-EDB groups in U.S. EDs. Only full-text English-language articles were included. Outcomes were mortality and hospital LOS. We used random-effects meta-analysis to compare the outcomes. Heterogeneity was assessed with the I value while publication bias was assessed via the funnel plot."
        },
        {
          "label": "RESULTS",
          "text": "We identified 3139 studies and included 17, comprising 407,178 ED patients: 194,814 (48 %) EDB and 212,364 (52 %) non-EDB. 87.4 % of patients came from urban academic Emergency Departments with a resuscitation unit or team. Median ED LOS was 6.5 h (IQR 5.18-8.1) for EDB and 4.2 h (IQR 2.38-5.75) for non-EDB (p < 0.01). EDB patients had similar all-cause mortality (OR 1.06, 95 % CI 0.94-1.19, I = 69 %, p = 0.38) and hospital LOS (mean difference 0.38 days, 95 % CI -0.75-1.50, I = 61 %, p = 0.51). Funnel plot suggested publication bias favoring higher mortality in EDB."
        },
        {
          "label": "CONCLUSION",
          "text": "Our SR/MA suggested that EDB was associated with a non-statistically significant increase in mortality and hospital LOS compared to non-EDB. High heterogeneity and inconsistent boarding definitions were also noted."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41151219/",
      "pubDate": "2025 Oct 17",
      "doi": "10.1016/j.ajem.2025.10.036",
      "dateReceived": "2025-11-16T23:23:49.678Z",
      "isNew": false,
      "summary": "Emergency department boarding (EDB) may be linked to a possible, but not statistically significant, increase in mortality and hospital length of stay."
    },
    {
      "id": "8417b56e9afa",
      "title": "Predictive value of clinical risk scores for adverse outcomes and safe discharge in acute lower gastrointestinal bleeding.",
      "journal": "Am J Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48937743/118150",
      "abstract": "This study aims to evaluate the predictive value of various clinical prediction tools in predicting adverse outcomes and safe discharge in patients with lower gastrointestinal bleeding (LGIB). This retrospective cohort study was conducted in the emergency department of a tertiary training and research hospital between October 1, 2017, and October 1, 2022. Adult patients (≥18 years) with a final diagnosis of acute LGIB were included. Demographics, medication history, chief complaints, vital signs, physical examination findings, laboratory results, bleeding sources, adverse outcomes (in-hospital mortality, severe bleeding, transfusion needs, and therapeutic interventions), and the variables needed to calculate the CHAMPS, NOBLADS, Oakland, SALGIB, and Strate scores were recorded, and analysis was performed. A total of 2051 patients were included in the final analysis. The median age of the patients was 59 years (IQR: 42-75), and 40.7 % were female. An adverse outcome occurred in 792 (38.6 %) patients, and severe bleeding occurred in 611 patients (29.8 %). A total of 752 patients (36.7 %) required blood transfusions, and 67 patients (3.3 %) underwent therapeutic intervention. The Oakland score demonstrated the highest predictive performance for adverse outcomes (AUC: 0.902), severe bleeding (AUC: 0.925), and safe discharge (AUC: 0.889). The SALGIB score followed, with AUC values of 0.880, 0.901, and 0.867, respectively, for the same outcomes. The remaining scores exhibited moderate predictive performance across all three outcomes. The Oakland and SALGIB scores outperformed other clinical prediction tools and may aid clinicians in identifying patients at risk of adverse outcomes and making safe discharge decisions in acute LGIB.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "This study aims to evaluate the predictive value of various clinical prediction tools in predicting adverse outcomes and safe discharge in patients with lower gastrointestinal bleeding (LGIB)."
        },
        {
          "label": "METHODS",
          "text": "This retrospective cohort study was conducted in the emergency department of a tertiary training and research hospital between October 1, 2017, and October 1, 2022. Adult patients (≥18 years) with a final diagnosis of acute LGIB were included. Demographics, medication history, chief complaints, vital signs, physical examination findings, laboratory results, bleeding sources, adverse outcomes (in-hospital mortality, severe bleeding, transfusion needs, and therapeutic interventions), and the variables needed to calculate the CHAMPS, NOBLADS, Oakland, SALGIB, and Strate scores were recorded, and analysis was performed."
        },
        {
          "label": "RESULTS",
          "text": "A total of 2051 patients were included in the final analysis. The median age of the patients was 59 years (IQR: 42-75), and 40.7 % were female. An adverse outcome occurred in 792 (38.6 %) patients, and severe bleeding occurred in 611 patients (29.8 %). A total of 752 patients (36.7 %) required blood transfusions, and 67 patients (3.3 %) underwent therapeutic intervention. The Oakland score demonstrated the highest predictive performance for adverse outcomes (AUC: 0.902), severe bleeding (AUC: 0.925), and safe discharge (AUC: 0.889). The SALGIB score followed, with AUC values of 0.880, 0.901, and 0.867, respectively, for the same outcomes. The remaining scores exhibited moderate predictive performance across all three outcomes."
        },
        {
          "label": "CONCLUSION",
          "text": "The Oakland and SALGIB scores outperformed other clinical prediction tools and may aid clinicians in identifying patients at risk of adverse outcomes and making safe discharge decisions in acute LGIB."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41175440/",
      "pubDate": "2025 Oct 25",
      "doi": "10.1016/j.ajem.2025.10.051",
      "dateReceived": "2025-11-16T23:23:49.677Z",
      "isNew": false,
      "summary": "The Oakland and SALGIB scores are effective in predicting adverse outcomes and guiding safe discharge decisions for patients with acute lower gastrointestinal bleeding (LGIB)."
    },
    {
      "id": "9dfd0f4a0422",
      "title": "Therapy for Atrial Fibrillation in Patients with Drug-Eluting Stents.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48929961/118125",
      "abstract": "Despite guideline recommendations, evidence for the use of non-vitamin K antagonist oral anticoagulant (NOAC) monotherapy in patients with atrial fibrillation after implantation of a drug-eluting stent remains limited. In this multicenter, randomized, open-label, noninferiority trial in South Korea, we assigned patients with atrial fibrillation who had undergone the implantation of a drug-eluting stent at least 1 year earlier in a 1:1 ratio to receive NOAC monotherapy or combination therapy (NOAC plus clopidogrel). The primary end point was net adverse clinical events, a composite of death from any cause, myocardial infarction, stent thrombosis, stroke, systemic embolism, or major bleeding or clinically relevant nonmajor bleeding at 12 months. The noninferiority margin was 3.0 percentage points. A total of 960 patients underwent randomization: 482 patients to receive monotherapy and 478 to receive combination therapy. The mean age of the patients was 71.1 years, and 21.4% were women. At 12 months, a primary end-point event had occurred in 46 patients (Kaplan-Meier estimate, 9.6%) in the monotherapy group and in 82 patients (Kaplan-Meier estimate, 17.2%) in the combination-therapy group, for an absolute difference of -7.6 percentage points (95.2% confidence interval [CI], -11.9 to -3.3; P<0.001 for noninferiority) and a hazard ratio of 0.54 (95.2% CI, 0.37 to 0.77; P<0.001 for superiority). Major bleeding or clinically relevant nonmajor bleeding occurred in 25 patients (5.2%) in the monotherapy group and in 63 patients (13.2%) in the combination-therapy group (hazard ratio, 0.38; 95% CI, 0.24 to 0.60). Among patients with atrial fibrillation who had undergone implantation of a drug-eluting stent at least 1 year earlier, NOAC monotherapy was noninferior to combination therapy for net adverse clinical events. (Funded by Cardiovascular Research Center and Samjin Pharmaceutical; ADAPT AF-DES ClinicalTrials.gov number, NCT04250116.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Despite guideline recommendations, evidence for the use of non-vitamin K antagonist oral anticoagulant (NOAC) monotherapy in patients with atrial fibrillation after implantation of a drug-eluting stent remains limited."
        },
        {
          "label": "METHODS",
          "text": "In this multicenter, randomized, open-label, noninferiority trial in South Korea, we assigned patients with atrial fibrillation who had undergone the implantation of a drug-eluting stent at least 1 year earlier in a 1:1 ratio to receive NOAC monotherapy or combination therapy (NOAC plus clopidogrel). The primary end point was net adverse clinical events, a composite of death from any cause, myocardial infarction, stent thrombosis, stroke, systemic embolism, or major bleeding or clinically relevant nonmajor bleeding at 12 months. The noninferiority margin was 3.0 percentage points."
        },
        {
          "label": "RESULTS",
          "text": "A total of 960 patients underwent randomization: 482 patients to receive monotherapy and 478 to receive combination therapy. The mean age of the patients was 71.1 years, and 21.4% were women. At 12 months, a primary end-point event had occurred in 46 patients (Kaplan-Meier estimate, 9.6%) in the monotherapy group and in 82 patients (Kaplan-Meier estimate, 17.2%) in the combination-therapy group, for an absolute difference of -7.6 percentage points (95.2% confidence interval [CI], -11.9 to -3.3; P<0.001 for noninferiority) and a hazard ratio of 0.54 (95.2% CI, 0.37 to 0.77; P<0.001 for superiority). Major bleeding or clinically relevant nonmajor bleeding occurred in 25 patients (5.2%) in the monotherapy group and in 63 patients (13.2%) in the combination-therapy group (hazard ratio, 0.38; 95% CI, 0.24 to 0.60)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with atrial fibrillation who had undergone implantation of a drug-eluting stent at least 1 year earlier, NOAC monotherapy was noninferior to combination therapy for net adverse clinical events. (Funded by Cardiovascular Research Center and Samjin Pharmaceutical; ADAPT AF-DES ClinicalTrials.gov number, NCT04250116.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211917/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2512091",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "In patients with atrial fibrillation and a drug-eluting stent implanted at least a year prior, a NOAC alone was as safe as a NOAC plus another medication for adverse clinical events."
    },
    {
      "id": "cab2369526a9",
      "title": "Nivolumab for Resected Stage III or IV Melanoma at 9 Years.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Dermatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48929961/117989",
      "abstract": "In the CheckMate 238 trial, patients with resected stage IIIB-C or stage IV melanoma who were treated with nivolumab had longer recurrence-free survival than those who received ipilimumab. Data were needed on longer-term survival. We randomly assigned patients in a 1:1 ratio to receive an intravenous infusion of nivolumab (at a dose of 3 mg per kilogram of body weight every 2 weeks) or ipilimumab (at a dose of 10 mg per kilogram every 3 weeks for four doses, then every 12 weeks) for up to 1 year or until disease recurrence or the occurrence of unacceptable toxic effects. Randomization was stratified according to disease stage and status with respect to programmed cell death ligand 1. The primary end point was recurrence-free survival; secondary end points included overall and distant metastasis-free survival and safety. At a minimum follow-up of nearly 9 years (107 months), the median duration of recurrence-free survival was 61.1 months with nivolumab and 24.2 months with ipilimumab (hazard ratio for recurrence or death, 0.76; 95% confidence interval [CI], 0.63 to 0.90); 9-year recurrence-free survival was 44% and 37%, respectively. The median duration of distant metastasis-free survival in patients with stage III melanoma was more than 9 years with nivolumab and 83.8 months with ipilimumab, with 9-year survival of 54% and 48%, respectively (hazard ratio for distant metastasis or death, 0.81; 95% CI, 0.65 to 1.00). The median overall survival was more than 9 years in both trial groups, with 9-year survival of 69% in the nivolumab group and 65% in the ipilimumab group (hazard ratio for death, 0.88; 95.03% CI, 0.69 to 1.11). The rates of death from melanoma at 9 years were 26% with nivolumab and 30% with ipilimumab (hazard ratio, 0.87; 95% CI, 0.67 to 1.13). Subsequent systemic therapy was administered to fewer patients in the nivolumab group than in the ipilimumab group (37.3% vs. 44.6%). No new late adverse events were reported. The 9-year final data support a sustained finding of longer recurrence-free survival with nivolumab than with ipilimumab. (Funded by Bristol Myers Squibb and Ono Pharmaceutical; CheckMate 238 ClinicalTrials.gov number, NCT02388906; Eudra-CT number, 2014-002351-26.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In the CheckMate 238 trial, patients with resected stage IIIB-C or stage IV melanoma who were treated with nivolumab had longer recurrence-free survival than those who received ipilimumab. Data were needed on longer-term survival."
        },
        {
          "label": "METHODS",
          "text": "We randomly assigned patients in a 1:1 ratio to receive an intravenous infusion of nivolumab (at a dose of 3 mg per kilogram of body weight every 2 weeks) or ipilimumab (at a dose of 10 mg per kilogram every 3 weeks for four doses, then every 12 weeks) for up to 1 year or until disease recurrence or the occurrence of unacceptable toxic effects. Randomization was stratified according to disease stage and status with respect to programmed cell death ligand 1. The primary end point was recurrence-free survival; secondary end points included overall and distant metastasis-free survival and safety."
        },
        {
          "label": "RESULTS",
          "text": "At a minimum follow-up of nearly 9 years (107 months), the median duration of recurrence-free survival was 61.1 months with nivolumab and 24.2 months with ipilimumab (hazard ratio for recurrence or death, 0.76; 95% confidence interval [CI], 0.63 to 0.90); 9-year recurrence-free survival was 44% and 37%, respectively. The median duration of distant metastasis-free survival in patients with stage III melanoma was more than 9 years with nivolumab and 83.8 months with ipilimumab, with 9-year survival of 54% and 48%, respectively (hazard ratio for distant metastasis or death, 0.81; 95% CI, 0.65 to 1.00). The median overall survival was more than 9 years in both trial groups, with 9-year survival of 69% in the nivolumab group and 65% in the ipilimumab group (hazard ratio for death, 0.88; 95.03% CI, 0.69 to 1.11). The rates of death from melanoma at 9 years were 26% with nivolumab and 30% with ipilimumab (hazard ratio, 0.87; 95% CI, 0.67 to 1.13). Subsequent systemic therapy was administered to fewer patients in the nivolumab group than in the ipilimumab group (37.3% vs. 44.6%). No new late adverse events were reported."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The 9-year final data support a sustained finding of longer recurrence-free survival with nivolumab than with ipilimumab. (Funded by Bristol Myers Squibb and Ono Pharmaceutical; CheckMate 238 ClinicalTrials.gov number, NCT02388906; Eudra-CT number, 2014-002351-26.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41124198/",
      "pubDate": "2025 Oct 18",
      "doi": "10.1056/NEJMoa2504966",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "Nivolumab demonstrates a durable benefit in extending recurrence-free survival compared to ipilimumab."
    },
    {
      "id": "a13c665d47d8",
      "title": "Deferring Arterial Catheterization in Critically Ill Patients with Shock.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/118036",
      "abstract": "In patients with shock, whether noninvasive blood-pressure monitoring is an effective alternative to the recommended use of an arterial catheter is uncertain. In this multicenter, open-label, noninferiority trial, we randomly assigned patients who had shock and had been admitted to an intensive care unit within the past 24 hours to receive early insertion (<4 hours after randomization) of an arterial catheter (invasive strategy) or to be monitored with an automated brachial cuff (noninvasive strategy). Insertion of an arterial catheter was allowed later in patients assigned to the noninvasive-strategy group who met prespecified safety criteria. The primary outcome was death from any cause at day 28 (noninferiority margin, 5 percentage points). Adverse events of special interest related to the blood-pressure-monitoring device that was used were recorded, as was patient-reported pain or discomfort related to the ongoing presence of the device. A total of 1010 patients underwent randomization; 504 patients assigned to the noninvasive-strategy group and 502 assigned to the invasive-strategy group were included in the analyses. A total of 74 patients (14.7%) in the noninvasive-strategy group and 493 (98.2%) in the invasive-strategy group underwent insertion of an arterial catheter. Death within 28 days occurred in 173 patients (34.3%) in the noninvasive-strategy group and 185 (36.9%) in the invasive-strategy group (adjusted risk difference, -3.2 percentage points; 95% confidence interval, -8.9 to 2.5; P = 0.006 for noninferiority). Results of per-protocol analyses were similar in the two groups. A total of 66 patients (13.1%) in the noninvasive-strategy group and 45 (9.0%) in the invasive-strategy group had at least 1 day of pain or discomfort related to the ongoing presence of the blood-pressure-monitoring device. Hematoma or hemorrhage related to the arterial catheter occurred in 5 patients (1.0%) in the noninvasive-strategy group and 41 patients (8.2%) in the invasive-strategy group. Among patients with shock, results for death from any cause at day 28 indicated that management without early arterial catheter insertion was noninferior to early catheter insertion. (Funded by the French Ministry of Health; ClinicalTrials.gov number, NCT03680963.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In patients with shock, whether noninvasive blood-pressure monitoring is an effective alternative to the recommended use of an arterial catheter is uncertain."
        },
        {
          "label": "METHODS",
          "text": "In this multicenter, open-label, noninferiority trial, we randomly assigned patients who had shock and had been admitted to an intensive care unit within the past 24 hours to receive early insertion (<4 hours after randomization) of an arterial catheter (invasive strategy) or to be monitored with an automated brachial cuff (noninvasive strategy). Insertion of an arterial catheter was allowed later in patients assigned to the noninvasive-strategy group who met prespecified safety criteria. The primary outcome was death from any cause at day 28 (noninferiority margin, 5 percentage points). Adverse events of special interest related to the blood-pressure-monitoring device that was used were recorded, as was patient-reported pain or discomfort related to the ongoing presence of the device."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1010 patients underwent randomization; 504 patients assigned to the noninvasive-strategy group and 502 assigned to the invasive-strategy group were included in the analyses. A total of 74 patients (14.7%) in the noninvasive-strategy group and 493 (98.2%) in the invasive-strategy group underwent insertion of an arterial catheter. Death within 28 days occurred in 173 patients (34.3%) in the noninvasive-strategy group and 185 (36.9%) in the invasive-strategy group (adjusted risk difference, -3.2 percentage points; 95% confidence interval, -8.9 to 2.5; P = 0.006 for noninferiority). Results of per-protocol analyses were similar in the two groups. A total of 66 patients (13.1%) in the noninvasive-strategy group and 45 (9.0%) in the invasive-strategy group had at least 1 day of pain or discomfort related to the ongoing presence of the blood-pressure-monitoring device. Hematoma or hemorrhage related to the arterial catheter occurred in 5 patients (1.0%) in the noninvasive-strategy group and 41 patients (8.2%) in the invasive-strategy group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with shock, results for death from any cause at day 28 indicated that management without early arterial catheter insertion was noninferior to early catheter insertion. (Funded by the French Ministry of Health; ClinicalTrials.gov number, NCT03680963.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159885/",
      "pubDate": "2025 Nov 13",
      "doi": "10.1056/NEJMoa2502136",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "In patients with shock, early arterial catheter insertion did not improve 28-day mortality compared to management without it."
    },
    {
      "id": "ba42ab146ac7",
      "title": "A Randomized Trial of Physical Therapy for Meniscal Tear and Knee Pain.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/118034",
      "abstract": "Physical therapy is routinely recommended for knee pain attributed to a degenerative meniscal tear, but its efficacy has not been established. We randomly assigned participants 45 to 85 years of age with knee pain, osteoarthritis, and meniscal tear to one of four groups: home exercise (3-month home-exercise program), home exercise plus text messages to encourage exercise adherence, home exercise plus text messages plus sham physical therapy (in-clinic sham manual therapy and sham ultrasound therapy), and home exercise plus text messages plus standard physical therapy (supervised strengthening, functional, and stretching exercises and manual therapy). The primary outcome was the change in the Knee Injury and Osteoarthritis Outcome Score (KOOS) pain subscore (range, 0 to 100, with higher scores indicating more pain) between baseline and 3 months, with adjustment for trial site, baseline KOOS pain subscore, and radiographic grade. A total of 879 participants underwent randomization (mean [±SD] age, 59.2±7.8 years). The difference in the 3-month change in the KOOS pain subscore between home exercise and home exercise plus text messages was -0.1 points (98.3% confidence interval [CI], -3.8 to 3.7) and between home exercise and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.3 to 6.2); the difference between home exercise plus text messages and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.4 to 6.5). Adverse events were generally nonserious and evenly distributed overall across groups. For patients with degenerative meniscal tear and knee pain, the addition of physical therapy or text messages to encourage adherence to home exercises was not superior in reducing pain to a home-exercise program alone. (Funded by the National Institute of Arthritis and Musculoskeletal and Skin Diseases and others; TeMPO ClinicalTrials.gov number, NCT03059004.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Physical therapy is routinely recommended for knee pain attributed to a degenerative meniscal tear, but its efficacy has not been established."
        },
        {
          "label": "METHODS",
          "text": "We randomly assigned participants 45 to 85 years of age with knee pain, osteoarthritis, and meniscal tear to one of four groups: home exercise (3-month home-exercise program), home exercise plus text messages to encourage exercise adherence, home exercise plus text messages plus sham physical therapy (in-clinic sham manual therapy and sham ultrasound therapy), and home exercise plus text messages plus standard physical therapy (supervised strengthening, functional, and stretching exercises and manual therapy). The primary outcome was the change in the Knee Injury and Osteoarthritis Outcome Score (KOOS) pain subscore (range, 0 to 100, with higher scores indicating more pain) between baseline and 3 months, with adjustment for trial site, baseline KOOS pain subscore, and radiographic grade."
        },
        {
          "label": "RESULTS",
          "text": "A total of 879 participants underwent randomization (mean [±SD] age, 59.2±7.8 years). The difference in the 3-month change in the KOOS pain subscore between home exercise and home exercise plus text messages was -0.1 points (98.3% confidence interval [CI], -3.8 to 3.7) and between home exercise and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.3 to 6.2); the difference between home exercise plus text messages and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.4 to 6.5). Adverse events were generally nonserious and evenly distributed overall across groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "For patients with degenerative meniscal tear and knee pain, the addition of physical therapy or text messages to encourage adherence to home exercises was not superior in reducing pain to a home-exercise program alone. (Funded by the National Institute of Arthritis and Musculoskeletal and Skin Diseases and others; TeMPO ClinicalTrials.gov number, NCT03059004.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160820/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1056/NEJMoa2503385",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "Physical therapy or text message support did not improve pain reduction compared to a home exercise program for patients with degenerative meniscal tears and knee pain."
    },
    {
      "id": "66b2b1d36c68",
      "title": "Effect of Vericiguat on Total Heart Failure Events in Compensated Outpatients With HFrEF: Insights From VICTOR.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/117953",
      "abstract": "In the VICTOR (Vericiguat Global Study in Participants With Chronic Heart Failure) trial, in a contemporary ambulatory cohort with heart failure and reduced ejection fraction (HFrEF) and no recent hospitalization, the primary outcome of hospitalization for heart failure (HHF) and cardiovascular death was not statistically significantly reduced with vericiguat. Vericiguat reduced risk of mortality but not HHF. In this ambulatory compensated cohort, time to first HHF may underestimate the overall worsening HF burden by failing to consider the high proportion of outpatient worsening HF events. This study aimed to determine the effect of vericiguat on the overall risk of worsening HF by incorporating the entire patient experience of worsening outpatient and inpatient HF episodes. VICTOR was a phase 3, double-blind, placebo-controlled trial testing the effect of vericiguat in ambulatory patients with HFrEF who had not experienced recent worsening (defined as HHF admission within 6 months or outpatient intravenous diuretic use within 3 months) and were on a background of high use of contemporary guideline therapy. The primary endpoint was a composite of cardiovascular death or HHF. The current analysis provides detailed effects of vericiguat on overall worsening HF in both the inpatient and outpatient settings, including urgent care visits for intravenous diuretics or outpatient oral diuretic initiation or intensification. A total of 6,105 participants were randomized. Outpatient worsening HF was more common as the first worsening HF event (n = 851, 59.3%), compared with HHF (n = 507, 35.4%) or urgent HF visits (n = 76, 5.3%). Outpatient oral diuretic initiation or intensification was associated with increased mortality (RR: 1.69; 95% CI: 1.47-1.94; P < 0.001). Overall worsening HF occurred in 686 participants (22.5%) in the vericiguat group and 748 participants (24.8%) in the placebo group (HR: 0.90; 95% CI: 0.81-1.00; P = 0.047). The composite of all-cause death and overall worsening HF occurred in 917 participants (30.0%) in the vericiguat group and 1,004 participants (32.9%) in the placebo group (HR: 0.90; 95% CI: 0.82-0.98; P = 0.016). In compensated patients with HFrEF on contemporary guideline therapy, worsening HF in outpatients was more common than HHF and was associated with higher risk of mortality. Exploratory analyses suggested a potential reduction in overall worsening HF events when both inpatient and outpatient settings were considered.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In the VICTOR (Vericiguat Global Study in Participants With Chronic Heart Failure) trial, in a contemporary ambulatory cohort with heart failure and reduced ejection fraction (HFrEF) and no recent hospitalization, the primary outcome of hospitalization for heart failure (HHF) and cardiovascular death was not statistically significantly reduced with vericiguat. Vericiguat reduced risk of mortality but not HHF. In this ambulatory compensated cohort, time to first HHF may underestimate the overall worsening HF burden by failing to consider the high proportion of outpatient worsening HF events."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study aimed to determine the effect of vericiguat on the overall risk of worsening HF by incorporating the entire patient experience of worsening outpatient and inpatient HF episodes."
        },
        {
          "label": "METHODS",
          "text": "VICTOR was a phase 3, double-blind, placebo-controlled trial testing the effect of vericiguat in ambulatory patients with HFrEF who had not experienced recent worsening (defined as HHF admission within 6 months or outpatient intravenous diuretic use within 3 months) and were on a background of high use of contemporary guideline therapy. The primary endpoint was a composite of cardiovascular death or HHF. The current analysis provides detailed effects of vericiguat on overall worsening HF in both the inpatient and outpatient settings, including urgent care visits for intravenous diuretics or outpatient oral diuretic initiation or intensification."
        },
        {
          "label": "RESULTS",
          "text": "A total of 6,105 participants were randomized. Outpatient worsening HF was more common as the first worsening HF event (n = 851, 59.3%), compared with HHF (n = 507, 35.4%) or urgent HF visits (n = 76, 5.3%). Outpatient oral diuretic initiation or intensification was associated with increased mortality (RR: 1.69; 95% CI: 1.47-1.94; P < 0.001). Overall worsening HF occurred in 686 participants (22.5%) in the vericiguat group and 748 participants (24.8%) in the placebo group (HR: 0.90; 95% CI: 0.81-1.00; P = 0.047). The composite of all-cause death and overall worsening HF occurred in 917 participants (30.0%) in the vericiguat group and 1,004 participants (32.9%) in the placebo group (HR: 0.90; 95% CI: 0.82-0.98; P = 0.016)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In compensated patients with HFrEF on contemporary guideline therapy, worsening HF in outpatients was more common than HHF and was associated with higher risk of mortality. Exploratory analyses suggested a potential reduction in overall worsening HF events when both inpatient and outpatient settings were considered."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892609/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.051",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "In heart failure patients with reduced ejection fraction receiving standard treatment, worsening heart failure in the outpatient setting was more frequent than hospitalization for heart failure and linked to increased death risk, though considering both inpatient and outpatient settings might reduce overall worsening events."
    },
    {
      "id": "1dd31aace9ff",
      "title": "Metformin to Improve Walking Performance in Lower Extremity Peripheral Artery Disease: The PERMET Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48929961/118127",
      "abstract": "Lower extremity peripheral artery disease (PAD) is a disabling cardiovascular condition that impairs walking ability. Few effective therapies improve walking performance in people with PAD. Metformin is a widely available and inexpensive therapy for type 2 diabetes with pleiotropic effects that include activating AMP-activated protein kinase, reducing oxidative stress, and stimulating endothelial nitric oxide synthase (eNOS). To determine whether metformin improves 6-minute walk distance, compared with placebo, in people with PAD and without diabetes at 6-month follow-up. Randomized double-blind clinical trial involving 4 centers in the US. Enrollment began May 23, 2017, and ended on February 17, 2025, with 202 of the targeted 212 (95%) enrolled, due to funding limitations. Participants were adults aged 50 years and older with PAD. Final follow-up occurred August 19, 2025. Participants with PAD were randomized to receive either metformin (n = 97) or placebo (n = 105) for 6 months. The primary outcome was 6-month change in 6-minute walk distance (minimum clinically important difference, 8 to 20 m). Secondary outcomes were maximal treadmill walking time, pain-free treadmill walking time, the Walking Impairment Questionnaire distance and speed scores, the Short-Form 36 physical functioning score, and brachial artery flow-mediated dilation. Results were adjusted for site and the baseline value for each outcome measure. Of 202 randomized patients (mean [SD] age, 69.6 [8.4] years, 56 [28%] female, 79 [39%] Black), 179 (89%) completed 6-month follow-up. Metformin did not significantly improve 6-minute walk distance compared with placebo (metformin: 358.6 to 353.2 m, within-group change: -5.4 m; placebo: 359.8 to 354.5 m, within-group change: -5.3 m, adjusted between-group difference: 1.1 m [95% CI, -16.3 to 18.6 m]; P = .90). Compared with placebo, metformin did not significantly improve any secondary outcomes. The most common serious adverse events were cardiovascular events (3.1% for metformin and 1.9% for placebo). The most common nonserious adverse events were indigestion/stomach upset (64.9% for metformin and 40.6% for placebo) and headache (37.2% for metformin and 49.5% for placebo). Among people with PAD without diabetes, metformin did not improve 6-minute walk distance at 6-month follow-up compared with placebo. These results do not support metformin for improving walking performance in patients with PAD. ClinicalTrials.gov Identifier: NCT03054519.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Lower extremity peripheral artery disease (PAD) is a disabling cardiovascular condition that impairs walking ability. Few effective therapies improve walking performance in people with PAD. Metformin is a widely available and inexpensive therapy for type 2 diabetes with pleiotropic effects that include activating AMP-activated protein kinase, reducing oxidative stress, and stimulating endothelial nitric oxide synthase (eNOS)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether metformin improves 6-minute walk distance, compared with placebo, in people with PAD and without diabetes at 6-month follow-up."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Randomized double-blind clinical trial involving 4 centers in the US. Enrollment began May 23, 2017, and ended on February 17, 2025, with 202 of the targeted 212 (95%) enrolled, due to funding limitations. Participants were adults aged 50 years and older with PAD. Final follow-up occurred August 19, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants with PAD were randomized to receive either metformin (n = 97) or placebo (n = 105) for 6 months."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was 6-month change in 6-minute walk distance (minimum clinically important difference, 8 to 20 m). Secondary outcomes were maximal treadmill walking time, pain-free treadmill walking time, the Walking Impairment Questionnaire distance and speed scores, the Short-Form 36 physical functioning score, and brachial artery flow-mediated dilation. Results were adjusted for site and the baseline value for each outcome measure."
        },
        {
          "label": "RESULTS",
          "text": "Of 202 randomized patients (mean [SD] age, 69.6 [8.4] years, 56 [28%] female, 79 [39%] Black), 179 (89%) completed 6-month follow-up. Metformin did not significantly improve 6-minute walk distance compared with placebo (metformin: 358.6 to 353.2 m, within-group change: -5.4 m; placebo: 359.8 to 354.5 m, within-group change: -5.3 m, adjusted between-group difference: 1.1 m [95% CI, -16.3 to 18.6 m]; P = .90). Compared with placebo, metformin did not significantly improve any secondary outcomes. The most common serious adverse events were cardiovascular events (3.1% for metformin and 1.9% for placebo). The most common nonserious adverse events were indigestion/stomach upset (64.9% for metformin and 40.6% for placebo) and headache (37.2% for metformin and 49.5% for placebo)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among people with PAD without diabetes, metformin did not improve 6-minute walk distance at 6-month follow-up compared with placebo. These results do not support metformin for improving walking performance in patients with PAD."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03054519."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41205146/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1001/jama.2025.21358",
      "dateReceived": "2025-11-15T23:23:25.943Z",
      "isNew": false,
      "summary": "Metformin did not improve walking distance in people with peripheral artery disease (PAD) without diabetes."
    },
    {
      "id": "b31a329b43d3",
      "title": "Antithrombotic Therapy after Successful Catheter Ablation for Atrial Fibrillation.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48917141/118121",
      "abstract": "Whether successful catheter ablation for atrial fibrillation eliminates the need for long-term oral anticoagulant therapy is unknown. We conducted an international, open-label, randomized, blinded-outcome-assessment trial involving 1284 patients who had undergone successful catheter ablation for atrial fibrillation at least 1 year earlier and had a CHADS-VASc score (scores range from 0 to 9, with higher scores indicating a higher risk of stroke) of 1 or more (or ≥2 for women or for patients in whom vascular disease was a risk factor). Patients were randomly assigned to receive either aspirin (at a dose of 70 to 120 mg daily, depending on availability in the local jurisdiction) or rivaroxaban (at a dose of 15 mg) and followed for 3 years. Magnetic resonance imaging (MRI) of the head was performed after enrollment and at 3 years. The primary outcome was a composite of stroke, systemic embolism, or new covert embolic stroke (defined by ≥1 new infarct measuring ≥15 mm on MRI) at 3 years. A total of 641 patients were assigned to the rivaroxaban group and 643 to the aspirin group. A primary-outcome event occurred in 5 patients (0.31 events per 100 patient-years) in the rivaroxaban group and in 9 patients (0.66 events per 100 patient-years) in the aspirin group (relative risk, 0.56; 95% confidence interval [CI], 0.19 to 1.65; absolute risk difference at 3 years, -0.6 percentage points; 95% CI, -1.8 to 0.5; P = 0.28). New cerebral infarcts measuring less than 15 mm occurred in 22 of 568 patients (3.9%) in the rivaroxaban group and in 26 of 590 patients (4.4%) in the aspirin group (relative risk, 0.89; 95% CI, 0.51 to 1.55). Fatal or major bleeding (the composite primary safety outcome) had occurred in 10 patients (1.6%) with rivaroxaban and in 4 patients (0.6%) with aspirin (hazard ratio, 2.51; 95% CI, 0.79 to 7.95) at 3 years. Among patients who had had successful catheter ablation for atrial fibrillation at least 1 year earlier and had risk factors for stroke, treatment with rivaroxaban did not result in a significantly lower incidence of a composite of stroke, systemic embolism, or new covert embolic stroke than treatment with aspirin. (Funded by Bayer and others; OCEAN ClinicalTrials.gov number, NCT02168829.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Whether successful catheter ablation for atrial fibrillation eliminates the need for long-term oral anticoagulant therapy is unknown."
        },
        {
          "label": "METHODS",
          "text": "We conducted an international, open-label, randomized, blinded-outcome-assessment trial involving 1284 patients who had undergone successful catheter ablation for atrial fibrillation at least 1 year earlier and had a CHADS-VASc score (scores range from 0 to 9, with higher scores indicating a higher risk of stroke) of 1 or more (or ≥2 for women or for patients in whom vascular disease was a risk factor). Patients were randomly assigned to receive either aspirin (at a dose of 70 to 120 mg daily, depending on availability in the local jurisdiction) or rivaroxaban (at a dose of 15 mg) and followed for 3 years. Magnetic resonance imaging (MRI) of the head was performed after enrollment and at 3 years. The primary outcome was a composite of stroke, systemic embolism, or new covert embolic stroke (defined by ≥1 new infarct measuring ≥15 mm on MRI) at 3 years."
        },
        {
          "label": "RESULTS",
          "text": "A total of 641 patients were assigned to the rivaroxaban group and 643 to the aspirin group. A primary-outcome event occurred in 5 patients (0.31 events per 100 patient-years) in the rivaroxaban group and in 9 patients (0.66 events per 100 patient-years) in the aspirin group (relative risk, 0.56; 95% confidence interval [CI], 0.19 to 1.65; absolute risk difference at 3 years, -0.6 percentage points; 95% CI, -1.8 to 0.5; P = 0.28). New cerebral infarcts measuring less than 15 mm occurred in 22 of 568 patients (3.9%) in the rivaroxaban group and in 26 of 590 patients (4.4%) in the aspirin group (relative risk, 0.89; 95% CI, 0.51 to 1.55). Fatal or major bleeding (the composite primary safety outcome) had occurred in 10 patients (1.6%) with rivaroxaban and in 4 patients (0.6%) with aspirin (hazard ratio, 2.51; 95% CI, 0.79 to 7.95) at 3 years."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients who had had successful catheter ablation for atrial fibrillation at least 1 year earlier and had risk factors for stroke, treatment with rivaroxaban did not result in a significantly lower incidence of a composite of stroke, systemic embolism, or new covert embolic stroke than treatment with aspirin. (Funded by Bayer and others; OCEAN ClinicalTrials.gov number, NCT02168829.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211931/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2509688",
      "dateReceived": "2025-11-14T23:24:51.705Z",
      "isNew": false,
      "summary": "In patients with successful atrial fibrillation ablation and stroke risk factors, rivaroxaban did not significantly reduce stroke, systemic embolism, or covert embolic stroke compared to aspirin."
    },
    {
      "id": "3f63e0573bf5",
      "title": "Fish-Oil Supplementation and Cardiovascular Events in Patients Receiving Hemodialysis.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48917141/118117",
      "abstract": "Cardiovascular disease is the leading cause of death in patients receiving hemodialysis, yet effective preventive therapies remain limited. Supplementation with n-3 polyunsaturated fatty acids, especially eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), may have cardiovascular benefits in the general population, but efficacy among patients receiving hemodialysis is uncertain. In a double-blind, randomized, placebo-controlled trial conducted at 26 sites in Canada and Australia, we assigned adult patients receiving maintenance hemodialysis to daily supplementation with fish oil (4 g of n-3 polyunsaturated fatty acids [1.6 g of EPA and 0.8 g of DHA]) or corn-oil placebo. The primary end point was a composite of all serious cardiovascular events including sudden and nonsudden cardiac death, fatal and nonfatal myocardial infarction, peripheral vascular disease leading to amputation, and fatal and nonfatal stroke. Secondary end points included extension of the primary end point to include noncardiac causes of death, the individual components of the primary end point, and a first cardiovascular event or death from any cause. Between November 28, 2013, and July 22, 2019, a total of 1228 participants underwent randomization; 610 were assigned to the fish-oil group and 618 to the placebo group. During 3.5 years of follow-up, the rate of serious cardiovascular events was significantly lower in the fish-oil group than in the placebo group (0.31 vs. 0.61 per 1000 patient-days; hazard ratio, 0.57; 95% confidence interval [CI], 0.47 to 0.70; P<0.001). The rate of the extended primary end point that included noncardiac causes of death appeared to be lower in the fish-oil group than in the placebo group, with a hazard ratio of 0.77 (95% CI, 0.65 to 0.90). The hazard ratio for cardiac death was 0.55 (95% CI, 0.40 to 0.75); for fatal and nonfatal myocardial infarction, 0.56 (95% CI, 0.40 to 0.80); for peripheral vascular disease leading to amputation, 0.57 (95% CI, 0.38 to 0.86); for fatal and nonfatal stroke, 0.37 (95% CI, 0.18 to 0.76); and for a first cardiovascular event or death from any cause, 0.73 (95% CI, 0.61 to 0.87). Adherence to the trial regimen and the incidence of adverse events did not differ meaningfully between the groups. The rate of serious cardiovascular events among participants receiving maintenance hemodialysis was lower with daily supplementation with n-3 fatty acids than with placebo. (Supported by the Heart and Stroke Foundation of Canada and others; PISCES ClinicalTrials.gov number, ISRCTN00691795.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cardiovascular disease is the leading cause of death in patients receiving hemodialysis, yet effective preventive therapies remain limited. Supplementation with n-3 polyunsaturated fatty acids, especially eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), may have cardiovascular benefits in the general population, but efficacy among patients receiving hemodialysis is uncertain."
        },
        {
          "label": "METHODS",
          "text": "In a double-blind, randomized, placebo-controlled trial conducted at 26 sites in Canada and Australia, we assigned adult patients receiving maintenance hemodialysis to daily supplementation with fish oil (4 g of n-3 polyunsaturated fatty acids [1.6 g of EPA and 0.8 g of DHA]) or corn-oil placebo. The primary end point was a composite of all serious cardiovascular events including sudden and nonsudden cardiac death, fatal and nonfatal myocardial infarction, peripheral vascular disease leading to amputation, and fatal and nonfatal stroke. Secondary end points included extension of the primary end point to include noncardiac causes of death, the individual components of the primary end point, and a first cardiovascular event or death from any cause."
        },
        {
          "label": "RESULTS",
          "text": "Between November 28, 2013, and July 22, 2019, a total of 1228 participants underwent randomization; 610 were assigned to the fish-oil group and 618 to the placebo group. During 3.5 years of follow-up, the rate of serious cardiovascular events was significantly lower in the fish-oil group than in the placebo group (0.31 vs. 0.61 per 1000 patient-days; hazard ratio, 0.57; 95% confidence interval [CI], 0.47 to 0.70; P<0.001). The rate of the extended primary end point that included noncardiac causes of death appeared to be lower in the fish-oil group than in the placebo group, with a hazard ratio of 0.77 (95% CI, 0.65 to 0.90). The hazard ratio for cardiac death was 0.55 (95% CI, 0.40 to 0.75); for fatal and nonfatal myocardial infarction, 0.56 (95% CI, 0.40 to 0.80); for peripheral vascular disease leading to amputation, 0.57 (95% CI, 0.38 to 0.86); for fatal and nonfatal stroke, 0.37 (95% CI, 0.18 to 0.76); and for a first cardiovascular event or death from any cause, 0.73 (95% CI, 0.61 to 0.87). Adherence to the trial regimen and the incidence of adverse events did not differ meaningfully between the groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The rate of serious cardiovascular events among participants receiving maintenance hemodialysis was lower with daily supplementation with n-3 fatty acids than with placebo. (Supported by the Heart and Stroke Foundation of Canada and others; PISCES ClinicalTrials.gov number, ISRCTN00691795.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41201837/",
      "pubDate": "2025 Nov 07",
      "doi": "10.1056/NEJMoa2513032",
      "dateReceived": "2025-11-14T23:24:51.705Z",
      "isNew": false,
      "summary": "Daily n-3 fatty acid supplementation in hemodialysis patients reduced the incidence of serious cardiovascular events compared to placebo."
    },
    {
      "id": "c290266cdbb7",
      "title": "Vernakalant versus procainamide for rapid cardioversion of patients with acute atrial fibrillation (RAFF4): randomised clinical trial.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48917141/118136",
      "abstract": "To conduct a randomised, open label comparison of the effectiveness and safety of intravenous vernakalant and intravenous procainamide for the management of acute atrial fibrillation in the emergency department. Randomised clinical trial (RAFF4 trial). 12 tertiary care emergency departments in Canada. Patients with acute atrial fibrillation for whom acute rhythm control was a safe option. Patients were randomised (1:1) to an intravenous infusion of vernakalant or procainamide; when rapid conversion did not occur, patients were offered electrical cardioversion. The primary outcome was conversion to sinus rhythm within 30 minutes of drug infusion completion. Secondary outcomes included time to conversion to sinus rhythm and whether the patient required electrical cardioversion. Of the 350 enrolled eligible patients, baseline characteristics were similar in the procainamide (n=172) and vernakalant (n=178) groups. For the primary outcome of conversion success, vernakalant was more effective (62.4%  48.3%; adjusted absolute difference 15.0%, 95% confidence interval 4.6% to 25.0%, P=0.005; adjusted odds ratio 1.87, 95% confidence interval 1.2 to 2.9, P=0.006). With vernakalant, time to conversion was faster (21.8  44.7 minutes; mean difference -22.9, 95% confidence interval -29.9 to -16.0, P<0.001), and fewer patients underwent attempted electrical cardioversion (33.7%  44.2%; odds ratio 0.62, 95% confidence interval 0.39 to 0.96, P=0.033). Adverse events were similar in both groups, were generally mild and brief, and most patients were discharged home. Subgroup analysis strongly favoured vernakalant for conversion in patients younger than 70 years (73.3%  47.2%; adjusted odds ratio 3.1, 95% confidence interval 1.7 to 5.5, P=0.001, interaction P=0.005). In this head-to-head comparison, vernakalant was superior to procainamide for patients with higher conversion rates and faster times to conversion. Therefore, vernakalant is a safe and highly effective intravenous alternative for the rapid cardioversion and discharge home of patients with acute atrial fibrillation. ClinicalTrials.gov NCT04485195.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To conduct a randomised, open label comparison of the effectiveness and safety of intravenous vernakalant and intravenous procainamide for the management of acute atrial fibrillation in the emergency department."
        },
        {
          "label": "DESIGN",
          "text": "Randomised clinical trial (RAFF4 trial)."
        },
        {
          "label": "SETTING",
          "text": "12 tertiary care emergency departments in Canada."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Patients with acute atrial fibrillation for whom acute rhythm control was a safe option."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomised (1:1) to an intravenous infusion of vernakalant or procainamide; when rapid conversion did not occur, patients were offered electrical cardioversion."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was conversion to sinus rhythm within 30 minutes of drug infusion completion. Secondary outcomes included time to conversion to sinus rhythm and whether the patient required electrical cardioversion."
        },
        {
          "label": "RESULTS",
          "text": "Of the 350 enrolled eligible patients, baseline characteristics were similar in the procainamide (n=172) and vernakalant (n=178) groups. For the primary outcome of conversion success, vernakalant was more effective (62.4%  48.3%; adjusted absolute difference 15.0%, 95% confidence interval 4.6% to 25.0%, P=0.005; adjusted odds ratio 1.87, 95% confidence interval 1.2 to 2.9, P=0.006). With vernakalant, time to conversion was faster (21.8  44.7 minutes; mean difference -22.9, 95% confidence interval -29.9 to -16.0, P<0.001), and fewer patients underwent attempted electrical cardioversion (33.7%  44.2%; odds ratio 0.62, 95% confidence interval 0.39 to 0.96, P=0.033). Adverse events were similar in both groups, were generally mild and brief, and most patients were discharged home. Subgroup analysis strongly favoured vernakalant for conversion in patients younger than 70 years (73.3%  47.2%; adjusted odds ratio 3.1, 95% confidence interval 1.7 to 5.5, P=0.001, interaction P=0.005)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this head-to-head comparison, vernakalant was superior to procainamide for patients with higher conversion rates and faster times to conversion. Therefore, vernakalant is a safe and highly effective intravenous alternative for the rapid cardioversion and discharge home of patients with acute atrial fibrillation."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov NCT04485195."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41218981/",
      "pubDate": "2025 Nov 11",
      "doi": "10.1136/bmj-2025-085632",
      "dateReceived": "2025-11-14T23:24:51.704Z",
      "isNew": false,
      "summary": "Vernakalant is a safe and highly effective intravenous medication for rapidly converting acute atrial fibrillation to normal rhythm, leading to faster conversion times and higher success rates compared to procainamide."
    },
    {
      "id": "e099a1fcf599",
      "title": "Efficacy and safety of tirzepatide added to basal insulin in patients with type 2 diabetes in China (SURPASS-CN-INS): a double-blind, multicentre, randomised, placebo-controlled, phase 3 trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118088",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false
    },
    {
      "id": "2269be1b1635",
      "title": "Xpert MTB/RIF Ultra assay for tuberculosis disease and rifampicin resistance in children.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118068",
      "abstract": "In 2023, an estimated 1.3 million children (aged 0-14 years) became ill with tuberculosis, and 166,000 children (aged 0-15 years) died from the disease. Xpert MTB/RIF Ultra (Xpert Ultra) is a molecular World Health Organization (WHO)-recommended rapid diagnostic test that detects Mycobacterium tuberculosis complex and rifampicin resistance. This is an update of a Cochrane review first published in 2020 and last updated in 2022. Parts of the current update informed the 2024 WHO updated guidance for the diagnosis of tuberculosis. To assess the diagnostic accuracy of Xpert Ultra for detecting pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance in children (aged 0-9 years) with presumed tuberculosis. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, three other databases, and three trial registers without language restrictions to 6 October 2023. For study design, we included cross-sectional and cohort studies and randomized trials that evaluated Xpert Ultra in HIV-positive and HIV-negative children aged birth to nine years. Regarding specimen type, we included studies evaluating sputum, gastric, stool, or nasopharyngeal specimens (pulmonary tuberculosis); cerebrospinal fluid (tuberculous meningitis); and fine needle aspirate or surgical biopsy tissue (lymph node tuberculosis). Reference standards for detection of tuberculosis were microbiological reference standard (MRS; including culture) or composite reference standard (CRS); for stool, we considered Xpert Ultra in sputum or gastric aspirates in addition to culture. Reference standards for detection of rifampicin resistance in sputum were phenotypic drug susceptibility testing or targeted or whole genome sequencing. Two review authors independently extracted data and assessed methodological quality using the tailored QUADAS-2 tool, judging risk of bias separately for each target condition and sample type. We conducted separate meta-analyses for detection of pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance. We used a bivariate model to estimate summary sensitivity and specificity with 95% confidence intervals (CIs). We assessed certainty of evidence using the GRADE approach. This update included 23 studies (including 9 new studies since the previous review) that evaluated detection of pulmonary tuberculosis (21 studies, 9223 children), tuberculous meningitis (3 studies, 215 children), lymph node tuberculosis (2 studies, 58 children), and rifampicin resistance (3 studies, 130 children). Seventeen studies (74%) took place in countries with a high tuberculosis burden. Overall, risk of bias and applicability concerns were low. Detection of pulmonary tuberculosis (microbiological reference standard) Sputum (11 studies) Xpert Ultra summary sensitivity was 75.3% (95% CI 68.9% to 80.8%; 345 children; moderate-certainty evidence), and specificity was 95.9% (95% CI 92.3% to 97.9%; 2645 children; high-certainty evidence). Gastric aspirate (12 studies) Xpert Ultra summary sensitivity was 69.6% (95% CI 60.3% to 77.6%; 167 children; moderate-certainty evidence), and specificity was 91.0% (95% CI 82.5% to 95.6%; 1792 children; moderate-certainty evidence). Stool (10 studies) Xpert Ultra summary sensitivity was 68.0% (95% CI 50.3% to 81.7%; 255 children; moderate-certainty evidence), and specificity was 98.2% (95% CI 96.3% to 99.1%; 2630 children; high-certainty evidence). Nasopharyngeal aspirate (6 studies) Xpert Ultra summary sensitivity was 46.2% (95% CI 34.9% to 57.9%; 94 children; moderate-certainty evidence), and specificity was 97.5% (95% CI 95.1% to 98.7%; 1259 children; high-certainty evidence). Xpert Ultra sensitivity was lower against CRS than against MRS for all specimen types, while the specificities were similar. Extrapulmonary tuberculosis Meta-analysis was not possible for lymph node tuberculosis and tuberculous meningitis due to low study numbers. Interpretation of results For a population of 1000 children, where 100 have pulmonary tuberculosis: In sputum: • 112 would be Xpert Ultra positive, of whom 75 would have pulmonary tuberculosis (true positives) and 37 would not (false positives). • 888 would be Xpert Ultra negative, of whom 863 would not have pulmonary tuberculosis (true negatives) and 25 would have pulmonary tuberculosis (false negatives). In gastric aspirate: • 151 would be Xpert Ultra positive, of whom 70 would have pulmonary tuberculosis (true positives) and 81 would not (false positives). • 849 would be Xpert Ultra negative, of whom 819 would not have pulmonary tuberculosis (true negatives) and 30 would have pulmonary tuberculosis (false negatives). In stool: • 85 would be Xpert Ultra positive, of whom 68 would have pulmonary tuberculosis (true positives) and 17 would not (false positives). • 915 would be Xpert Ultra negative, of whom 883 would not have pulmonary tuberculosis (true negatives) and 32 would have pulmonary tuberculosis (false negatives). In nasopharyngeal aspirate: • 68 would be Xpert Ultra positive, of whom 46 would have pulmonary tuberculosis (true positives) and 22 would not (false positives). • 932 would be Xpert Ultra negative, of whom 878 would not have pulmonary tuberculosis (true negatives), and 54 would have pulmonary tuberculosis (false negatives). Detection of rifampicin resistance Three studies with 76 children evaluated detection of rifampicin resistance (sputum only); two of these studies reported no cases and one reported rifampicin resistance in two children. Xpert Ultra sensitivity was moderate in sputum, gastric aspirate, and stool specimens. Nasopharyngeal aspirate had the lowest sensitivity. Xpert Ultra specificity was high against both MRS and CRS. We were unable to determine the accuracy of Xpert Ultra for detecting tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance due to a paucity of data. This update was funded through WHO. The protocol for this review was originally published through Cochrane in 2019. The protocol for this update was a generic protocol that consolidated previously published Cochrane protocols of Xpert Ultra for tuberculosis detection and can be accessed at https://osf.io/26wg7/. Protocol (2019) DOI: 10.1002/14651858.CD013359 Original review (2020) DOI: 10.1002/14651858.CD013359.pub2 Review update (2022) DOI: 10.1002/14651858.CD013359.pub3.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In 2023, an estimated 1.3 million children (aged 0-14 years) became ill with tuberculosis, and 166,000 children (aged 0-15 years) died from the disease. Xpert MTB/RIF Ultra (Xpert Ultra) is a molecular World Health Organization (WHO)-recommended rapid diagnostic test that detects Mycobacterium tuberculosis complex and rifampicin resistance. This is an update of a Cochrane review first published in 2020 and last updated in 2022. Parts of the current update informed the 2024 WHO updated guidance for the diagnosis of tuberculosis."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the diagnostic accuracy of Xpert Ultra for detecting pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance in children (aged 0-9 years) with presumed tuberculosis."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, three other databases, and three trial registers without language restrictions to 6 October 2023."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "For study design, we included cross-sectional and cohort studies and randomized trials that evaluated Xpert Ultra in HIV-positive and HIV-negative children aged birth to nine years. Regarding specimen type, we included studies evaluating sputum, gastric, stool, or nasopharyngeal specimens (pulmonary tuberculosis); cerebrospinal fluid (tuberculous meningitis); and fine needle aspirate or surgical biopsy tissue (lymph node tuberculosis). Reference standards for detection of tuberculosis were microbiological reference standard (MRS; including culture) or composite reference standard (CRS); for stool, we considered Xpert Ultra in sputum or gastric aspirates in addition to culture. Reference standards for detection of rifampicin resistance in sputum were phenotypic drug susceptibility testing or targeted or whole genome sequencing."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Two review authors independently extracted data and assessed methodological quality using the tailored QUADAS-2 tool, judging risk of bias separately for each target condition and sample type. We conducted separate meta-analyses for detection of pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance. We used a bivariate model to estimate summary sensitivity and specificity with 95% confidence intervals (CIs). We assessed certainty of evidence using the GRADE approach."
        },
        {
          "label": "MAIN RESULTS",
          "text": "This update included 23 studies (including 9 new studies since the previous review) that evaluated detection of pulmonary tuberculosis (21 studies, 9223 children), tuberculous meningitis (3 studies, 215 children), lymph node tuberculosis (2 studies, 58 children), and rifampicin resistance (3 studies, 130 children). Seventeen studies (74%) took place in countries with a high tuberculosis burden. Overall, risk of bias and applicability concerns were low. Detection of pulmonary tuberculosis (microbiological reference standard) Sputum (11 studies) Xpert Ultra summary sensitivity was 75.3% (95% CI 68.9% to 80.8%; 345 children; moderate-certainty evidence), and specificity was 95.9% (95% CI 92.3% to 97.9%; 2645 children; high-certainty evidence). Gastric aspirate (12 studies) Xpert Ultra summary sensitivity was 69.6% (95% CI 60.3% to 77.6%; 167 children; moderate-certainty evidence), and specificity was 91.0% (95% CI 82.5% to 95.6%; 1792 children; moderate-certainty evidence). Stool (10 studies) Xpert Ultra summary sensitivity was 68.0% (95% CI 50.3% to 81.7%; 255 children; moderate-certainty evidence), and specificity was 98.2% (95% CI 96.3% to 99.1%; 2630 children; high-certainty evidence). Nasopharyngeal aspirate (6 studies) Xpert Ultra summary sensitivity was 46.2% (95% CI 34.9% to 57.9%; 94 children; moderate-certainty evidence), and specificity was 97.5% (95% CI 95.1% to 98.7%; 1259 children; high-certainty evidence). Xpert Ultra sensitivity was lower against CRS than against MRS for all specimen types, while the specificities were similar. Extrapulmonary tuberculosis Meta-analysis was not possible for lymph node tuberculosis and tuberculous meningitis due to low study numbers. Interpretation of results For a population of 1000 children, where 100 have pulmonary tuberculosis: In sputum: • 112 would be Xpert Ultra positive, of whom 75 would have pulmonary tuberculosis (true positives) and 37 would not (false positives). • 888 would be Xpert Ultra negative, of whom 863 would not have pulmonary tuberculosis (true negatives) and 25 would have pulmonary tuberculosis (false negatives). In gastric aspirate: • 151 would be Xpert Ultra positive, of whom 70 would have pulmonary tuberculosis (true positives) and 81 would not (false positives). • 849 would be Xpert Ultra negative, of whom 819 would not have pulmonary tuberculosis (true negatives) and 30 would have pulmonary tuberculosis (false negatives). In stool: • 85 would be Xpert Ultra positive, of whom 68 would have pulmonary tuberculosis (true positives) and 17 would not (false positives). • 915 would be Xpert Ultra negative, of whom 883 would not have pulmonary tuberculosis (true negatives) and 32 would have pulmonary tuberculosis (false negatives). In nasopharyngeal aspirate: • 68 would be Xpert Ultra positive, of whom 46 would have pulmonary tuberculosis (true positives) and 22 would not (false positives). • 932 would be Xpert Ultra negative, of whom 878 would not have pulmonary tuberculosis (true negatives), and 54 would have pulmonary tuberculosis (false negatives). Detection of rifampicin resistance Three studies with 76 children evaluated detection of rifampicin resistance (sputum only); two of these studies reported no cases and one reported rifampicin resistance in two children."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Xpert Ultra sensitivity was moderate in sputum, gastric aspirate, and stool specimens. Nasopharyngeal aspirate had the lowest sensitivity. Xpert Ultra specificity was high against both MRS and CRS. We were unable to determine the accuracy of Xpert Ultra for detecting tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance due to a paucity of data."
        },
        {
          "label": "FUNDING",
          "text": "This update was funded through WHO."
        },
        {
          "label": "REGISTRATION",
          "text": "The protocol for this review was originally published through Cochrane in 2019. The protocol for this update was a generic protocol that consolidated previously published Cochrane protocols of Xpert Ultra for tuberculosis detection and can be accessed at https://osf.io/26wg7/. Protocol (2019) DOI: 10.1002/14651858.CD013359 Original review (2020) DOI: 10.1002/14651858.CD013359.pub2 Review update (2022) DOI: 10.1002/14651858.CD013359.pub3."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41128098/",
      "pubDate": "2025 Oct 23",
      "doi": "10.1002/14651858.CD013359.pub4",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false,
      "summary": "Xpert Ultra showed moderate sensitivity in sputum, gastric aspirate, and stool, low sensitivity in nasopharyngeal aspirate, and high specificity against MRS and CRS, but data was insufficient to assess its accuracy for certain conditions."
    },
    {
      "id": "69c648f896d3",
      "title": "GRADE-Based Clinical Practice Guidelines for Emergency Department Delirium Risk Stratification, Screening, and Brain Imaging in Older Patients With Suspected Delirium.",
      "journal": "Acad Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118025",
      "abstract": "This portion of the Geriatric Emergency Department (GED) Guidelines 2.0 focuses on delirium in the emergency department (ED). A multidisciplinary group applied the Grading of Recommendations Assessment, Development, and Evaluation (GRADE) approach to assess the certainty of evidence and develop recommendations related to older ED patients with possible delirium. The GED Guidelines 2.0 Delirium Work Group derived six evidence-based recommendations for risk stratification, diagnosis, and brain imaging. To reduce universal screening, the Delirium Risk Score may be used to identify older adults at low risk for delirium, though the evidence certainty is very low. In adults over 65 admitted to ED observation units, Zucchelli's risk assessment tool (threshold ≥ 4) may stratify delirium risk, also with very low certainty. For adults over 75, the REDEEM Score may be used to identify low- or high-risk individuals, again with very low certainty. For diagnosis, 4AT, bCAM, CAM-ICU, mCAM, AMT-4, or RASS may be used to rule delirium in or out, based on very low certainty. The Delirium Triage Screen (DTS) may be used to rule out, but not to rule in, delirium, also with very low certainty. For diagnostic imaging, there is very low certainty of evidence to recommend for or against obtaining a head CT as part of the evaluation for older ED patients with delirium. All recommendations are conditional, reflecting very low certainty of evidence due to the lack of high-quality ED-based studies and comparative effectiveness research. Rigorous ED-based research is needed to strengthen evidence and guide delirium care for older adults in geriatric emergency medicine.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "This portion of the Geriatric Emergency Department (GED) Guidelines 2.0 focuses on delirium in the emergency department (ED)."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary group applied the Grading of Recommendations Assessment, Development, and Evaluation (GRADE) approach to assess the certainty of evidence and develop recommendations related to older ED patients with possible delirium."
        },
        {
          "label": "RESULTS",
          "text": "The GED Guidelines 2.0 Delirium Work Group derived six evidence-based recommendations for risk stratification, diagnosis, and brain imaging. To reduce universal screening, the Delirium Risk Score may be used to identify older adults at low risk for delirium, though the evidence certainty is very low. In adults over 65 admitted to ED observation units, Zucchelli's risk assessment tool (threshold ≥ 4) may stratify delirium risk, also with very low certainty. For adults over 75, the REDEEM Score may be used to identify low- or high-risk individuals, again with very low certainty. For diagnosis, 4AT, bCAM, CAM-ICU, mCAM, AMT-4, or RASS may be used to rule delirium in or out, based on very low certainty. The Delirium Triage Screen (DTS) may be used to rule out, but not to rule in, delirium, also with very low certainty. For diagnostic imaging, there is very low certainty of evidence to recommend for or against obtaining a head CT as part of the evaluation for older ED patients with delirium. All recommendations are conditional, reflecting very low certainty of evidence due to the lack of high-quality ED-based studies and comparative effectiveness research."
        },
        {
          "label": "CONCLUSION",
          "text": "Rigorous ED-based research is needed to strengthen evidence and guide delirium care for older adults in geriatric emergency medicine."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41146403/",
      "pubDate": "2025 Oct 27",
      "doi": "10.1111/acem.70167",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false,
      "summary": "Further research in emergency departments is crucial to improve the care of older adults experiencing delirium."
    },
    {
      "id": "9907f25425a5",
      "title": "Aggressive Risk Factor Reduction Study for Atrial Fibrillation Implications for Ablation Outcomes: The ARREST-AF Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48816420/118041",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false
    },
    {
      "id": "3ea9f95c5d86",
      "title": "Pyronaridine-artesunate for treating uncomplicated Plasmodium falciparum malaria.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48816420/118004",
      "abstract": "The World Health Organization (WHO) recommends artemisinin-based combination therapies (ACTs) to treat uncomplicated Plasmodium falciparum malaria. Concerns about artemisinin resistance have led to global initiatives to develop new partner drugs to protect artemisinin derivatives in ACT. Pyronaridine-artesunate (PY-AS) is a novel ACT first recommended by the WHO in 2022. To evaluate the benefits of pyronaridine-artesunate compared to alternative ACTs for treating people with uncomplicated P falciparum malaria, and to evaluate the harms of pyronaridine-artesunate and other pyronaridine treatments compared to alternative treatments. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and LILACS. We also searched ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, and the ISRCTN registry for ongoing or recently completed trials. The date of the last search was 31 July 2024. For the efficacy analysis, we included randomized controlled trials (RCTs) of pyronaridine-artesunate for treating adults and children with uncomplicated P falciparum malaria compared to any other WHO-recommended ACT. For the safety analysis, we included RCTs that used pyronaridine alone or in combination with any other antimalarials. Our primary outcomes were treatment failure at days 28 and 42 (PCR-adjusted and -unadjusted), serious adverse events, adverse events leading to withdrawal from treatment, and elevated liver function tests. Secondary outcomes included early treatment failure, other adverse events, cost-effectiveness, feasibility, and acceptability. We used the Cochrane RoB 1 tool to assess bias in the RCTs. Two review authors independently extracted all data and assessed the certainty of the evidence. We meta-analyzed data to calculate risk ratios (RRs) for treatment failures between comparisons, and for safety outcomes between and across comparisons. We included 15 studies (14 RCTs reporting safety and efficacy, 1 quasi-experimental study reporting acceptability and feasibility) with 7295 participants. For a separate safety analysis, we included 10 non-randomized studies (NRS) with 11,783 participants. Efficacy analysis (RCTs) We evaluated pyronaridine-artesunate versus the following. - Artemether-lumefantrine. Pyronaridine-artesunate probably performs better for PCR-adjusted failures at day 28 (RR 0.40, 95% confidence interval (CI) 0.19 to 0.85; 5 RCTs, 3213 participants; moderate-certainty evidence); for unadjusted failures at day 28 (RR 0.27, 95% CI 0.14 to 0.52; 5 RCTs, 3314 participants; moderate-certainty evidence); and for unadjusted failures at day 42 (RR 0.61, 95% CI 0.46 to 0.82; 4 RCTs, 3080 participants; moderate-certainty evidence). For PCR-adjusted failures at day 42, there is probably little or no difference between groups (RR 0.86, 95% CI 0.49 to 1.51; 4 RCTs, 2575 participants; moderate-certainty evidence). - Artesunate-amodiaquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.55, 95% CI 0.11 to 2.77; 1 RCT, 1245 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.49, 95% CI 0.30 to 0.81; 1 RCT, 1257 participants; moderate-certainty evidence); may make little or no difference for PCR-adjusted failures at day 42 (RR 0.98, 95% CI 0.20 to 4.83; 1 RCT, 1091 participants; low-certainty evidence); and probably makes little or no difference for unadjusted failures at day 42 (RR 0.98, 95% CI 0.78 to 1.23; 1 RCT, 1235 participants; moderate-certainty evidence). - Artesunate-mefloquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.37, 95% CI 0.13 to 1.05; 1 RCT, 1117 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.36, 95% CI 0.17 to 0.78; 1 RCT, 1120 participants; moderate-certainty evidence); may make little or no difference for unadjusted failures at day 42 (RR 0.84, 95% CI 0.54 to 1.31; 1 RCT, 1059 participants; low-certainty evidence); but may lead to higher PCR-adjusted failures at day 42 (RR 1.80, 95% CI 0.90 to 3.57; 1 RCT, 1037 participants; low-certainty evidence). Safety analysis in adults and children (RCTs) Pyronaridine-artesunate was associated with raised liver enzymes compared to other antimalarials: alanine aminotransferase (ALT) (RR 3.59, 95% CI 1.76 to 7.33; 8 RCTs, 6669 participants; high-certainty evidence) and aspartate transaminase (AST) (RR 2.22, 95% CI 1.12 to 4.41; 8 RCTs, 6669 participants; high-certainty evidence). There was no such effect with bilirubin (RR 1.03, 95% CI 0.49 to 2.18; 7 RCTs, 6384 participants; moderate-certainty evidence). There was one reported case in which raised ALT occurred with raised bilirubin. No study reported severe drug-induced liver injury. Safety analysis in pregnant women (RCTs) We do not know if malaria testing and treatment with pyronaridine-artesunate for positive cases resulted in any difference in serious adverse effects for pregnant women compared to intermittent preventive treatment with sulfadoxine-pyrimethamine (RR 0.57, 95% CI 0.28 to 1.15; 1 RCT, 250 participants; very-low certainty evidence). Acceptability and feasibility One study determined that the adherence rate to a three-day treatment with pyronaridine-artesunate in children aged under five years was 85.3%. Limited qualitative data suggests pyronaridine-artesunate is acceptable to patients and their carers. Certainty of the evidence and limitations The studies included in this review ranged between very low-certainty and high-certainty evidence, largely due to imprecision of the effect estimate with wide CIs, and indirectness, given that children under five years were under-represented (especially in Asia). We did not identify any evidence of cost-effectiveness. Pyronaridine-artesunate was efficacious against uncomplicated P falciparum malaria; achieved a PCR-adjusted treatment failure rate of less than 8% at days 28 and 42; and may be at least as good as artesunate-amodiaquine and artesunate-mefloquine (based on 1 RCT per drug) and may be at least as good as, or better than, artemether-lumefantrine. Pyronaridine-artesunate increases the risk of episodes of abnormally raised ALT and AST compared to other studied therapeutics. Tilly Fox and the Cochrane Infectious Diseases Group editorial base were funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104, ended 31 December 2024). The views expressed do not necessarily reflect the UK Government's official policies. Protocol and previous versions available via doi.org/10.1002/14651858.CD006404, doi.org/10.1002/14651858.CD006404.pub2, doi.org/10.1002/14651858.CD006404.pub3, doi.org/10.1002/14651858.CD006404.pub4.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "The World Health Organization (WHO) recommends artemisinin-based combination therapies (ACTs) to treat uncomplicated Plasmodium falciparum malaria. Concerns about artemisinin resistance have led to global initiatives to develop new partner drugs to protect artemisinin derivatives in ACT. Pyronaridine-artesunate (PY-AS) is a novel ACT first recommended by the WHO in 2022."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the benefits of pyronaridine-artesunate compared to alternative ACTs for treating people with uncomplicated P falciparum malaria, and to evaluate the harms of pyronaridine-artesunate and other pyronaridine treatments compared to alternative treatments."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and LILACS. We also searched ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, and the ISRCTN registry for ongoing or recently completed trials. The date of the last search was 31 July 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "For the efficacy analysis, we included randomized controlled trials (RCTs) of pyronaridine-artesunate for treating adults and children with uncomplicated P falciparum malaria compared to any other WHO-recommended ACT. For the safety analysis, we included RCTs that used pyronaridine alone or in combination with any other antimalarials."
        },
        {
          "label": "OUTCOMES",
          "text": "Our primary outcomes were treatment failure at days 28 and 42 (PCR-adjusted and -unadjusted), serious adverse events, adverse events leading to withdrawal from treatment, and elevated liver function tests. Secondary outcomes included early treatment failure, other adverse events, cost-effectiveness, feasibility, and acceptability."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane RoB 1 tool to assess bias in the RCTs."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently extracted all data and assessed the certainty of the evidence. We meta-analyzed data to calculate risk ratios (RRs) for treatment failures between comparisons, and for safety outcomes between and across comparisons."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 15 studies (14 RCTs reporting safety and efficacy, 1 quasi-experimental study reporting acceptability and feasibility) with 7295 participants. For a separate safety analysis, we included 10 non-randomized studies (NRS) with 11,783 participants."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Efficacy analysis (RCTs) We evaluated pyronaridine-artesunate versus the following. - Artemether-lumefantrine. Pyronaridine-artesunate probably performs better for PCR-adjusted failures at day 28 (RR 0.40, 95% confidence interval (CI) 0.19 to 0.85; 5 RCTs, 3213 participants; moderate-certainty evidence); for unadjusted failures at day 28 (RR 0.27, 95% CI 0.14 to 0.52; 5 RCTs, 3314 participants; moderate-certainty evidence); and for unadjusted failures at day 42 (RR 0.61, 95% CI 0.46 to 0.82; 4 RCTs, 3080 participants; moderate-certainty evidence). For PCR-adjusted failures at day 42, there is probably little or no difference between groups (RR 0.86, 95% CI 0.49 to 1.51; 4 RCTs, 2575 participants; moderate-certainty evidence). - Artesunate-amodiaquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.55, 95% CI 0.11 to 2.77; 1 RCT, 1245 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.49, 95% CI 0.30 to 0.81; 1 RCT, 1257 participants; moderate-certainty evidence); may make little or no difference for PCR-adjusted failures at day 42 (RR 0.98, 95% CI 0.20 to 4.83; 1 RCT, 1091 participants; low-certainty evidence); and probably makes little or no difference for unadjusted failures at day 42 (RR 0.98, 95% CI 0.78 to 1.23; 1 RCT, 1235 participants; moderate-certainty evidence). - Artesunate-mefloquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.37, 95% CI 0.13 to 1.05; 1 RCT, 1117 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.36, 95% CI 0.17 to 0.78; 1 RCT, 1120 participants; moderate-certainty evidence); may make little or no difference for unadjusted failures at day 42 (RR 0.84, 95% CI 0.54 to 1.31; 1 RCT, 1059 participants; low-certainty evidence); but may lead to higher PCR-adjusted failures at day 42 (RR 1.80, 95% CI 0.90 to 3.57; 1 RCT, 1037 participants; low-certainty evidence). Safety analysis in adults and children (RCTs) Pyronaridine-artesunate was associated with raised liver enzymes compared to other antimalarials: alanine aminotransferase (ALT) (RR 3.59, 95% CI 1.76 to 7.33; 8 RCTs, 6669 participants; high-certainty evidence) and aspartate transaminase (AST) (RR 2.22, 95% CI 1.12 to 4.41; 8 RCTs, 6669 participants; high-certainty evidence). There was no such effect with bilirubin (RR 1.03, 95% CI 0.49 to 2.18; 7 RCTs, 6384 participants; moderate-certainty evidence). There was one reported case in which raised ALT occurred with raised bilirubin. No study reported severe drug-induced liver injury. Safety analysis in pregnant women (RCTs) We do not know if malaria testing and treatment with pyronaridine-artesunate for positive cases resulted in any difference in serious adverse effects for pregnant women compared to intermittent preventive treatment with sulfadoxine-pyrimethamine (RR 0.57, 95% CI 0.28 to 1.15; 1 RCT, 250 participants; very-low certainty evidence). Acceptability and feasibility One study determined that the adherence rate to a three-day treatment with pyronaridine-artesunate in children aged under five years was 85.3%. Limited qualitative data suggests pyronaridine-artesunate is acceptable to patients and their carers. Certainty of the evidence and limitations The studies included in this review ranged between very low-certainty and high-certainty evidence, largely due to imprecision of the effect estimate with wide CIs, and indirectness, given that children under five years were under-represented (especially in Asia). We did not identify any evidence of cost-effectiveness."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Pyronaridine-artesunate was efficacious against uncomplicated P falciparum malaria; achieved a PCR-adjusted treatment failure rate of less than 8% at days 28 and 42; and may be at least as good as artesunate-amodiaquine and artesunate-mefloquine (based on 1 RCT per drug) and may be at least as good as, or better than, artemether-lumefantrine. Pyronaridine-artesunate increases the risk of episodes of abnormally raised ALT and AST compared to other studied therapeutics."
        },
        {
          "label": "FUNDING",
          "text": "Tilly Fox and the Cochrane Infectious Diseases Group editorial base were funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104, ended 31 December 2024). The views expressed do not necessarily reflect the UK Government's official policies."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol and previous versions available via doi.org/10.1002/14651858.CD006404, doi.org/10.1002/14651858.CD006404.pub2, doi.org/10.1002/14651858.CD006404.pub3, doi.org/10.1002/14651858.CD006404.pub4."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41085194/",
      "pubDate": "2025 Oct 14",
      "doi": "10.1002/14651858.CD006404.pub5",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false,
      "summary": "Pyronaridine-artesunate effectively treats uncomplicated *P. falciparum* malaria with a low failure rate, potentially performing as well or better than other artemisinin-based combination therapies, but increases the risk of elevated liver enzymes."
    },
    {
      "id": "2fd1834f5ccb",
      "title": "Triple Versus Dual Lipid-Lowering Therapy in Acute Coronary Syndrome: The ES-BempeDACS Randomized Clinical Trial.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118089",
      "abstract": "Current guidelines recommend a stepwise strategy to achieve low-density lipoprotein cholesterol (LDL-C) goals after acute coronary syndrome (ACS). Earlier intensive strategies based on a combination of lipid-lowering therapies (LLTs) could be useful from the onset of ACS. However, the role of bempedoic acid in ACS, particularly when combined with high-intensity statins and ezetimibe, remains uncertain. The aim of ES-BempeDACS (Efficacy and Security of Bempedoic Acid in Acute Coronary Syndrome) was to compare the efficacy and safety of triple LLT (high-dose, high-intensity statin+ezetimibe+bempedoic acid) versus standard of care (high-dose, high-intensity statin+ezetimibe) after ACS. ES-BempeDACS is a multicenter, independent, pragmatic, prospective, randomized, open, blinded end point controlled trial conducted in 12 Spanish hospitals between November 2023 and October 2024. The primary end point was the proportion of patients achieving LDL-C <55 mg/dL (<1.4 mmol/L) at 8 weeks after ACS, comparing triple LLT with standard of care. A total of 206 patients (59.5±10.9 years of age [mean±SD]; 21.4% women) were randomized within the first 72 hours of ACS to triple LLT or standard therapy of high-intensity statin+ezetimibe (ie, dual LLT). The baseline LDL-C level was 133.6±28.8 mg/dL. After 8 weeks, the LDL-C level was reduced to <55 mg/dL in 59.4% of patients in the triple LLT group compared with 53.1% in the control group (dual LLT; =0.376). The percentage change in LDL-C level was 57.5±17.8% and 56.9±18.5% in the triple and dual LLT groups, respectively (=0.823). Triple versus dual LLT showed similar results in reduction of non-high-density lipoprotein cholesterol levels (49.0±25.4 in triple LLT versus 49.1±31.2 in dual LLT; =0.970) and triglyceride levels (14.9±36.9 in triple LLT versus 16.8±36.0 in dual LLT;) =0.718), without differences in adverse events. Both dual and triple LLT after ACS allow for high rates (>50%) of adequate LDL-C control (<55 mg/dL) at 8 weeks. Adding bempedoic acid to statin-ezetimibe therapy in the setting of ACS is safe but failed to improve the percentage of patients achieving the LDL-C goal (<55 mg/dL) at 8 weeks. Larger, randomized studies are needed to confirm our findings. URL: https://www.clinicaltrialsregister.eu; Unique identifier: 2021-006550-31.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Current guidelines recommend a stepwise strategy to achieve low-density lipoprotein cholesterol (LDL-C) goals after acute coronary syndrome (ACS). Earlier intensive strategies based on a combination of lipid-lowering therapies (LLTs) could be useful from the onset of ACS. However, the role of bempedoic acid in ACS, particularly when combined with high-intensity statins and ezetimibe, remains uncertain. The aim of ES-BempeDACS (Efficacy and Security of Bempedoic Acid in Acute Coronary Syndrome) was to compare the efficacy and safety of triple LLT (high-dose, high-intensity statin+ezetimibe+bempedoic acid) versus standard of care (high-dose, high-intensity statin+ezetimibe) after ACS."
        },
        {
          "label": "METHODS",
          "text": "ES-BempeDACS is a multicenter, independent, pragmatic, prospective, randomized, open, blinded end point controlled trial conducted in 12 Spanish hospitals between November 2023 and October 2024. The primary end point was the proportion of patients achieving LDL-C <55 mg/dL (<1.4 mmol/L) at 8 weeks after ACS, comparing triple LLT with standard of care."
        },
        {
          "label": "RESULTS",
          "text": "A total of 206 patients (59.5±10.9 years of age [mean±SD]; 21.4% women) were randomized within the first 72 hours of ACS to triple LLT or standard therapy of high-intensity statin+ezetimibe (ie, dual LLT). The baseline LDL-C level was 133.6±28.8 mg/dL. After 8 weeks, the LDL-C level was reduced to <55 mg/dL in 59.4% of patients in the triple LLT group compared with 53.1% in the control group (dual LLT; =0.376). The percentage change in LDL-C level was 57.5±17.8% and 56.9±18.5% in the triple and dual LLT groups, respectively (=0.823). Triple versus dual LLT showed similar results in reduction of non-high-density lipoprotein cholesterol levels (49.0±25.4 in triple LLT versus 49.1±31.2 in dual LLT; =0.970) and triglyceride levels (14.9±36.9 in triple LLT versus 16.8±36.0 in dual LLT;) =0.718), without differences in adverse events."
        },
        {
          "label": "CONCLUSION",
          "text": "Both dual and triple LLT after ACS allow for high rates (>50%) of adequate LDL-C control (<55 mg/dL) at 8 weeks. Adding bempedoic acid to statin-ezetimibe therapy in the setting of ACS is safe but failed to improve the percentage of patients achieving the LDL-C goal (<55 mg/dL) at 8 weeks. Larger, randomized studies are needed to confirm our findings."
        },
        {
          "label": "REGISTRATION",
          "text": "URL: https://www.clinicaltrialsregister.eu; Unique identifier: 2021-006550-31."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41200807/",
      "pubDate": "2025 Nov 07",
      "doi": "10.1161/CIRCULATIONAHA.125.075388",
      "dateReceived": "2025-11-13T23:25:17.292Z",
      "isNew": false,
      "summary": "In patients with acute coronary syndrome, both dual and triple lipid-lowering therapy achieved high rates of LDL-C control, but adding bempedoic acid to statin-ezetimibe did not further improve LDL-C goal attainment."
    }
  ]
}