{
  "updated_at": "2025-10-03T23:22:03.538Z",
  "articles": [
    {
      "id": "d16c7fd41b48",
      "title": "Exercise in Pregnancy and Risk of Postpartum Depression: A Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117749",
      "abstract": "To evaluate whether regular aerobic exercise during pregnancy reduces the incidence of postpartum depression in women with low-risk singleton pregnancies. Single-centre randomised controlled trial. Department of Obstetrics and Gynaecology, University of Naples Federico II, Italy. A total of 398 women with low-risk singleton pregnancies enrolled during the first trimester of pregnancy. Participants were randomly allocated in a 1:1 ratio to an exercise group or control group. The intervention consisted of a structured aerobic exercise programme (three 60-min sessions per week) from randomisation until 35 weeks' gestation, or earlier if delivery or obstetric complications occurred. The primary outcome was Edinburgh Postnatal Depression Scale (EPDS) score ≥ 12 3 months postpartum. Secondary outcomes included EPDS ≥ 9, clinical diagnosis of postpartum depression (DSM-V), and maternal/perinatal outcomes. Analyses were performed on an intention-to-treat basis, with relative risk (RR) and 95% confidence interval (CI) calculated. Incidence of postpartum depression, defined as EPDS ≥ 12 at 3 months postpartum. Of the 398 participants, 199 were randomised to the exercise group and 199 to the control group. Women in the exercise group had a significantly lower incidence of EPDS ≥ 12 and ≥ 9 at 3 months postpartum compared with controls, as well as lower mean EPDS scores. No significant differences in adverse maternal or perinatal outcomes were observed. Regular antenatal aerobic exercise significantly reduced the risk of postpartum depression, supporting its role as a preventive strategy in low-risk pregnancies. Clinicaltrials.gov identifier: NCT06355375.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether regular aerobic exercise during pregnancy reduces the incidence of postpartum depression in women with low-risk singleton pregnancies."
        },
        {
          "label": "DESIGN",
          "text": "Single-centre randomised controlled trial."
        },
        {
          "label": "SETTING",
          "text": "Department of Obstetrics and Gynaecology, University of Naples Federico II, Italy."
        },
        {
          "label": "POPULATION OR SAMPLE",
          "text": "A total of 398 women with low-risk singleton pregnancies enrolled during the first trimester of pregnancy."
        },
        {
          "label": "METHODS",
          "text": "Participants were randomly allocated in a 1:1 ratio to an exercise group or control group. The intervention consisted of a structured aerobic exercise programme (three 60-min sessions per week) from randomisation until 35 weeks' gestation, or earlier if delivery or obstetric complications occurred. The primary outcome was Edinburgh Postnatal Depression Scale (EPDS) score ≥ 12 3 months postpartum. Secondary outcomes included EPDS ≥ 9, clinical diagnosis of postpartum depression (DSM-V), and maternal/perinatal outcomes. Analyses were performed on an intention-to-treat basis, with relative risk (RR) and 95% confidence interval (CI) calculated."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Incidence of postpartum depression, defined as EPDS ≥ 12 at 3 months postpartum."
        },
        {
          "label": "RESULTS",
          "text": "Of the 398 participants, 199 were randomised to the exercise group and 199 to the control group. Women in the exercise group had a significantly lower incidence of EPDS ≥ 12 and ≥ 9 at 3 months postpartum compared with controls, as well as lower mean EPDS scores. No significant differences in adverse maternal or perinatal outcomes were observed."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Regular antenatal aerobic exercise significantly reduced the risk of postpartum depression, supporting its role as a preventive strategy in low-risk pregnancies."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Clinicaltrials.gov identifier: NCT06355375."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40976261/",
      "pubDate": "2025 Sep 21",
      "doi": "10.1111/1471-0528.70010",
      "dateReceived": "2025-10-03T23:21:19.060Z",
      "isNew": true,
      "summary": "Aerobic exercise during pregnancy effectively lowers the risk of developing postpartum depression."
    },
    {
      "id": "bb51e536542d",
      "title": "A 3-month clofazimine-rifapentine-containing regimen for drug-susceptible tuberculosis versus standard of care (Clo-Fast): a randomised, open-label, phase 2c clinical trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117743",
      "dateReceived": "2025-10-03T23:21:19.060Z",
      "isNew": true
    },
    {
      "id": "a5780bc0f74f",
      "title": "Oral iptacopan therapy in patients with C3 glomerulopathy: a randomised, double-blind, parallel group, multicentre, placebo-controlled, phase 3 study.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117736",
      "abstract": "C3 glomerulopathy is an ultra-rare, severe form of glomerulonephritis caused by overactivation of the alternative complement pathway. We aimed to assess efficacy and safety of iptacopan (LNP023), an oral, proximal complement inhibitor that targets factor B to selectively inhibit the alternative pathway of the complement cascade. APPEAR-C3G was a multicentre, randomised, double-blind, placebo-controlled, phase 3 study of iptacopan versus placebo (both in addition to supportive care [renin-angiotensin-aldosterone system (RAAS) inhibitors] and immunosuppression). Adult participants (aged 18-60 years) with biopsy-confirmed C3 glomerulopathy were enrolled from 35 hospitals or medical centres in 18 countries. Inclusion criteria included reduced serum C3 concentration (ie, <77 mg/dL [defined as <0·85 × lower limit of the central laboratory normal range]) at screening, urine protein-creatinine ratio (UPCR) of 1·0 g/g or higher at day -75 and day -15 before randomisation, estimated glomerular filtration rate (eGFR) of 30 mL/min per 1·73 m or higher at screening and day -15, and vaccination against Neisseria meningitidis and Streptococcus pneumoniae. All eligible participants were randomised 1:1 via interactive response technology to either the iptacopan or the placebo group, stratified by treatment with corticosteroids, mycophenolic acid, or both (yes or no). During the 6-month double-blind period, participants orally received either iptacopan 200 mg twice daily or placebo; this was followed by a 6-month open-label period in which all participants received iptacopan 200 mg twice daily. The primary endpoint was relative reduction in proteinuria (measured by log-transformed ratio to baseline in UPCR sampled from a 24-h urine collection) at 6 months. The primary analyses were done in the full analysis set (ie, all participants to whom study treatment was assigned by randomisation); all participants who received at least one dose of study treatment were included in the safety analysis. This trial was registered with ClinicalTrials.gov (NCT04817618) and the adult cohort has been completed. Between July 28, 2021, and Feb 15, 2023, 132 participants were screened, of whom 58 did not complete the screening period and 74 (64% male; 69% White) were randomised 1:1 to receive either iptacopan (n=38) or placebo (n=36). One participant in the placebo group discontinued treatment during the open-label period. The 24-h UPCR percentage change relative to baseline at 6 months was -30·2% (95% CI -42·8 to -14·8) in the iptacopan group and 7·6% (-11·9 to 31·3) in the placebo group. In the iptacopan group, the geometric mean of 24-h UPCR was 3·33 g/g (95% CI 2·79 to 3·97) at baseline and 2·17 g/g (1·62 to 2·91) at 6 months; in the placebo group, this was 2·58 g/g (2·18 to 3·05) at baseline and 2·80 g/g (2·37 to 3·30) at 6 months. The primary endpoint was met with a relative reduction in 24-h UPCR at 6 months for iptacopan versus placebo of 35·1% (13·8 to 51·1; p=0·0014). 30 (79%) of 38 participants in the iptacopan group had treatment-emergent adverse events, compared with 24 (67%) of 36 participants in the placebo group; most of these were of mild or moderate severity. There were no deaths, no treatment discontinuations due to treatment-emergent adverse events, and no meningococcal infections. Serious adverse events were reported in three (8%) participants in the iptacopan group and one (3%) participant in the placebo group. Iptacopan showed a statistically significant, clinically meaningful proteinuria reduction in addition to RAAS inhibitors and immunosuppression at 6 months. Iptacopan was well tolerated with an acceptable safety profile in patients with C3 glomerulopathy. Novartis Pharma.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "C3 glomerulopathy is an ultra-rare, severe form of glomerulonephritis caused by overactivation of the alternative complement pathway. We aimed to assess efficacy and safety of iptacopan (LNP023), an oral, proximal complement inhibitor that targets factor B to selectively inhibit the alternative pathway of the complement cascade."
        },
        {
          "label": "METHODS",
          "text": "APPEAR-C3G was a multicentre, randomised, double-blind, placebo-controlled, phase 3 study of iptacopan versus placebo (both in addition to supportive care [renin-angiotensin-aldosterone system (RAAS) inhibitors] and immunosuppression). Adult participants (aged 18-60 years) with biopsy-confirmed C3 glomerulopathy were enrolled from 35 hospitals or medical centres in 18 countries. Inclusion criteria included reduced serum C3 concentration (ie, <77 mg/dL [defined as <0·85 × lower limit of the central laboratory normal range]) at screening, urine protein-creatinine ratio (UPCR) of 1·0 g/g or higher at day -75 and day -15 before randomisation, estimated glomerular filtration rate (eGFR) of 30 mL/min per 1·73 m or higher at screening and day -15, and vaccination against Neisseria meningitidis and Streptococcus pneumoniae. All eligible participants were randomised 1:1 via interactive response technology to either the iptacopan or the placebo group, stratified by treatment with corticosteroids, mycophenolic acid, or both (yes or no). During the 6-month double-blind period, participants orally received either iptacopan 200 mg twice daily or placebo; this was followed by a 6-month open-label period in which all participants received iptacopan 200 mg twice daily. The primary endpoint was relative reduction in proteinuria (measured by log-transformed ratio to baseline in UPCR sampled from a 24-h urine collection) at 6 months. The primary analyses were done in the full analysis set (ie, all participants to whom study treatment was assigned by randomisation); all participants who received at least one dose of study treatment were included in the safety analysis. This trial was registered with ClinicalTrials.gov (NCT04817618) and the adult cohort has been completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between July 28, 2021, and Feb 15, 2023, 132 participants were screened, of whom 58 did not complete the screening period and 74 (64% male; 69% White) were randomised 1:1 to receive either iptacopan (n=38) or placebo (n=36). One participant in the placebo group discontinued treatment during the open-label period. The 24-h UPCR percentage change relative to baseline at 6 months was -30·2% (95% CI -42·8 to -14·8) in the iptacopan group and 7·6% (-11·9 to 31·3) in the placebo group. In the iptacopan group, the geometric mean of 24-h UPCR was 3·33 g/g (95% CI 2·79 to 3·97) at baseline and 2·17 g/g (1·62 to 2·91) at 6 months; in the placebo group, this was 2·58 g/g (2·18 to 3·05) at baseline and 2·80 g/g (2·37 to 3·30) at 6 months. The primary endpoint was met with a relative reduction in 24-h UPCR at 6 months for iptacopan versus placebo of 35·1% (13·8 to 51·1; p=0·0014). 30 (79%) of 38 participants in the iptacopan group had treatment-emergent adverse events, compared with 24 (67%) of 36 participants in the placebo group; most of these were of mild or moderate severity. There were no deaths, no treatment discontinuations due to treatment-emergent adverse events, and no meningococcal infections. Serious adverse events were reported in three (8%) participants in the iptacopan group and one (3%) participant in the placebo group."
        },
        {
          "label": "INTERPRETATION",
          "text": "Iptacopan showed a statistically significant, clinically meaningful proteinuria reduction in addition to RAAS inhibitors and immunosuppression at 6 months. Iptacopan was well tolerated with an acceptable safety profile in patients with C3 glomerulopathy."
        },
        {
          "label": "FUNDING",
          "text": "Novartis Pharma."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41016405/",
      "pubDate": "2025 Sep 25",
      "doi": "10.1016/S0140-6736(25)01148-1",
      "dateReceived": "2025-10-03T23:21:19.060Z",
      "isNew": true,
      "summary": "Iptacopan, an oral complement inhibitor, significantly reduced proteinuria in patients with C3 glomerulopathy compared to placebo."
    },
    {
      "id": "246164ad68fd",
      "title": "Influence of Type 2 Diabetes on the Effects of Tirzepatide in Patients With Heart Failure and a Preserved Ejection Fraction With Obesity: A Prespecified Stratification-Based Analysis.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48374559/117658",
      "dateReceived": "2025-10-03T23:21:19.060Z",
      "isNew": true
    },
    {
      "id": "5de1be6d5af2",
      "title": "Early antiplatelet treatment for minor stroke following thrombolysis: the EAST trial.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48275397/117683",
      "abstract": "Antiplatelet treatment is recommended to start 24 h after intravenous thrombolysis due to concerns about haemorrhagic transformation. This study aimed to investigate the potential benefit of early antiplatelet after intravenous thrombolysis in minor stroke. A multicentre, double-blind, randomized trial was conducted in China between 7 August 2022 and 1 August 2024, to evaluate the efficacy and safety of early antiplatelet in acute ischaemic stroke patients presenting with mild neurological deficits, as indicated by a National Institutes of Health Stroke Scale (NIHSS) score of 0-5, who received intravenous thrombolysis. Patients were randomly assigned to receive either clopidogrel and aspirin or placebo within 6 h after intravenous thrombolysis. The primary endpoint was an excellent functional outcome at 90 days, indicated by a modified Rankin Scale (mRS) score of 0-1. Statistical analysis was based on a modified intention-to-treat population. Symptomatic intracranial haemorrhage, any intracranial haemorrhage, and major systemic bleeding were safety endpoints. The primary endpoint was not met in this study. Of the randomly assigned 1022 patients, 995 patients were included in the modified intention-to-treat analysis (503 with early antiplatelet treatment and 492 with placebo). The primary endpoint occurred in 89.7% (451/503) of patients receiving early antiplatelet vs 89.6% (441/492) of those receiving placebo with no significant difference (odds ratio 1.00, 95% confidence interval .67-1.51, P = .99). Similar safety profiles were found between the two groups. Among Chinese patients with acute minor ischaemic stroke who received intravenous thrombolysis, early antiplatelet treatment with clopidogrel plus aspirin was safe but did not improve already excellent functional outcome (mRS 0-1) at 90 days.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Antiplatelet treatment is recommended to start 24 h after intravenous thrombolysis due to concerns about haemorrhagic transformation. This study aimed to investigate the potential benefit of early antiplatelet after intravenous thrombolysis in minor stroke."
        },
        {
          "label": "METHODS",
          "text": "A multicentre, double-blind, randomized trial was conducted in China between 7 August 2022 and 1 August 2024, to evaluate the efficacy and safety of early antiplatelet in acute ischaemic stroke patients presenting with mild neurological deficits, as indicated by a National Institutes of Health Stroke Scale (NIHSS) score of 0-5, who received intravenous thrombolysis. Patients were randomly assigned to receive either clopidogrel and aspirin or placebo within 6 h after intravenous thrombolysis. The primary endpoint was an excellent functional outcome at 90 days, indicated by a modified Rankin Scale (mRS) score of 0-1. Statistical analysis was based on a modified intention-to-treat population. Symptomatic intracranial haemorrhage, any intracranial haemorrhage, and major systemic bleeding were safety endpoints."
        },
        {
          "label": "RESULTS",
          "text": "The primary endpoint was not met in this study. Of the randomly assigned 1022 patients, 995 patients were included in the modified intention-to-treat analysis (503 with early antiplatelet treatment and 492 with placebo). The primary endpoint occurred in 89.7% (451/503) of patients receiving early antiplatelet vs 89.6% (441/492) of those receiving placebo with no significant difference (odds ratio 1.00, 95% confidence interval .67-1.51, P = .99). Similar safety profiles were found between the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among Chinese patients with acute minor ischaemic stroke who received intravenous thrombolysis, early antiplatelet treatment with clopidogrel plus aspirin was safe but did not improve already excellent functional outcome (mRS 0-1) at 90 days."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40973702/",
      "pubDate": "2025 Sep 19",
      "doi": "10.1093/eurheartj/ehaf702",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "In Chinese patients with minor ischemic stroke treated with thrombolysis, early clopidogrel and aspirin was safe but didn't further improve good functional recovery at 90 days."
    },
    {
      "id": "deef1ab5ce5e",
      "title": "Temporal modulation of antiplatelet therapy in high-risk patients undergoing complex percutaneous coronary intervention: the TAILORED-CHIP randomized clinical trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48275397/117653",
      "abstract": "Limited data exist on optimal antiplatelet strategies for high-risk patients undergoing complex percutaneous coronary intervention (PCI). This study aimed to investigate the efficacy and safety of tailored antiplatelet treatment with temporal modulation of the intensity of platelet inhibition in patients undergoing complex high-risk PCI. We randomly assigned 2018 patients with high-risk anatomical or clinical characteristics undergoing complex PCI to a tailored antiplatelet strategy with early escalation (low-dose ticagrelor at 60 mg twice daily plus aspirin <6 months) and late de-escalation (clopidogrel monotherapy >6 months) or dual antiplatelet therapy (clopidogrel plus aspirin for 12 months). The primary outcome was a composite of death from any cause, myocardial infarction, stroke, stent thrombosis, unplanned urgent revascularization, and clinically relevant bleeding (Bleeding Academic Research Consortium Type 2, 3, or 5) at 12 months. The mean age was 64.0 years, 22.6% had left main PCI, 19.5% had complex bifurcation PCI, 84.1% had diffuse long lesions, 93.7% had multivessel PCI, and 36.7% had medically treated diabetes. At 12 months, a primary outcome event occurred in 105 patients (10.5%) assigned to tailored antiplatelet therapy and in 89 patients (8.8%) assigned to dual antiplatelet therapy [hazard ratio, 1.19; 95% confidence interval (CI), 0.90-1.58; P = .21]. The incidence of major ischaemic events appeared to be similar in both groups. The incidence of clinically relevant bleeding at 12 months was 7.2% in the tailored-therapy group and 4.8% in the dual-therapy group (difference, 2.45% points; 95% CI, 0.37-4.53). Among high-risk patients undergoing complex PCI, tailored antiplatelet strategy with early escalation and late de-escalation, as compared with dual antiplatelet therapy, did not decrease the incidence of primary net adverse events at 12 months. ClinicalTrials.gov number, NCT03465644.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Limited data exist on optimal antiplatelet strategies for high-risk patients undergoing complex percutaneous coronary intervention (PCI). This study aimed to investigate the efficacy and safety of tailored antiplatelet treatment with temporal modulation of the intensity of platelet inhibition in patients undergoing complex high-risk PCI."
        },
        {
          "label": "METHODS",
          "text": "We randomly assigned 2018 patients with high-risk anatomical or clinical characteristics undergoing complex PCI to a tailored antiplatelet strategy with early escalation (low-dose ticagrelor at 60 mg twice daily plus aspirin <6 months) and late de-escalation (clopidogrel monotherapy >6 months) or dual antiplatelet therapy (clopidogrel plus aspirin for 12 months). The primary outcome was a composite of death from any cause, myocardial infarction, stroke, stent thrombosis, unplanned urgent revascularization, and clinically relevant bleeding (Bleeding Academic Research Consortium Type 2, 3, or 5) at 12 months."
        },
        {
          "label": "RESULTS",
          "text": "The mean age was 64.0 years, 22.6% had left main PCI, 19.5% had complex bifurcation PCI, 84.1% had diffuse long lesions, 93.7% had multivessel PCI, and 36.7% had medically treated diabetes. At 12 months, a primary outcome event occurred in 105 patients (10.5%) assigned to tailored antiplatelet therapy and in 89 patients (8.8%) assigned to dual antiplatelet therapy [hazard ratio, 1.19; 95% confidence interval (CI), 0.90-1.58; P = .21]. The incidence of major ischaemic events appeared to be similar in both groups. The incidence of clinically relevant bleeding at 12 months was 7.2% in the tailored-therapy group and 4.8% in the dual-therapy group (difference, 2.45% points; 95% CI, 0.37-4.53)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among high-risk patients undergoing complex PCI, tailored antiplatelet strategy with early escalation and late de-escalation, as compared with dual antiplatelet therapy, did not decrease the incidence of primary net adverse events at 12 months."
        },
        {
          "label": "CLINICAL TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov number, NCT03465644."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886179/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1093/eurheartj/ehaf652",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "In high-risk patients undergoing complex PCI, a tailored antiplatelet strategy did not reduce adverse events compared to standard dual antiplatelet therapy at 12 months."
    },
    {
      "id": "d35348b261da",
      "title": "Effectiveness of bivalent respiratory syncytial virus prefusion F protein-based vaccine in individuals with or without atherosclerotic cardiovascular disease: the DAN-RSV trial.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48275397/117636",
      "abstract": "It is not known whether the bivalent respiratory syncytial virus prefusion F protein-based (RSVpreF) vaccine reduces outcomes in individuals with atherosclerotic cardiovascular disease (ASCVD). The aim was to evaluate the vaccine effectiveness (VE) of an RSVpreF vaccine vs no vaccine on respiratory and cardiovascular outcomes in persons with or without pre-existing ASCVD. We conducted a prespecified secondary analysis of the DAN-RSV trial. Adults aged ≥60 years were randomized 1:1 to RSVpreF vaccine or no vaccine. Baseline and outcome data were collected through nationwide registries. The primary outcome was respiratory syncytial virus-related respiratory tract disease hospitalization. The principal major adverse cardiovascular event outcome was a composite of hospitalization for myocardial infarction, stroke, or heart failure. Heterogeneity in VE was assessed among participants with and without ASCVD. The incidence rate of almost all outcomes was higher in participants with pre-existing ASCVD (n = 14 241) vs those without (n = 117 035). Vaccine effectiveness was generally consistent by ASCVD status (Pinteraction ≥ .05 for all but one interaction). Among persons without and with ASCVD, VE for the primary outcome was 80.0% [95% confidence interval (CI), 29.3-96.3] vs 100.0% (95% CI, -141.3 to 100.0), respectively (Pinteraction > .99). Vaccine effectiveness for major adverse cardiovascular events was 9.3% (95% CI, -15.1 to 28.6) in participants without, and 12.0% (95% CI, -34.6 to 43.3) in participants with, pre-existing ASCVD (Pinteraction = .90). The VE of an RSVpreF vaccine vs no vaccine against respiratory and cardiovascular outcomes was similar among individuals ≥ 60 years of age with pre-existing ASCVD as compared with those without.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "It is not known whether the bivalent respiratory syncytial virus prefusion F protein-based (RSVpreF) vaccine reduces outcomes in individuals with atherosclerotic cardiovascular disease (ASCVD). The aim was to evaluate the vaccine effectiveness (VE) of an RSVpreF vaccine vs no vaccine on respiratory and cardiovascular outcomes in persons with or without pre-existing ASCVD."
        },
        {
          "label": "METHODS",
          "text": "We conducted a prespecified secondary analysis of the DAN-RSV trial. Adults aged ≥60 years were randomized 1:1 to RSVpreF vaccine or no vaccine. Baseline and outcome data were collected through nationwide registries. The primary outcome was respiratory syncytial virus-related respiratory tract disease hospitalization. The principal major adverse cardiovascular event outcome was a composite of hospitalization for myocardial infarction, stroke, or heart failure. Heterogeneity in VE was assessed among participants with and without ASCVD."
        },
        {
          "label": "RESULTS",
          "text": "The incidence rate of almost all outcomes was higher in participants with pre-existing ASCVD (n = 14 241) vs those without (n = 117 035). Vaccine effectiveness was generally consistent by ASCVD status (Pinteraction ≥ .05 for all but one interaction). Among persons without and with ASCVD, VE for the primary outcome was 80.0% [95% confidence interval (CI), 29.3-96.3] vs 100.0% (95% CI, -141.3 to 100.0), respectively (Pinteraction > .99). Vaccine effectiveness for major adverse cardiovascular events was 9.3% (95% CI, -15.1 to 28.6) in participants without, and 12.0% (95% CI, -34.6 to 43.3) in participants with, pre-existing ASCVD (Pinteraction = .90)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The VE of an RSVpreF vaccine vs no vaccine against respiratory and cardiovascular outcomes was similar among individuals ≥ 60 years of age with pre-existing ASCVD as compared with those without."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884439/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1093/eurheartj/ehaf679",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "RSVpreF vaccine efficacy against respiratory and cardiovascular outcomes was consistent in adults 60+ regardless of pre-existing atherosclerotic cardiovascular disease."
    },
    {
      "id": "e276eb9cb594",
      "title": "Menopausal Hormone Therapy and Cardiovascular Diseases in Women With Vasomotor Symptoms: A Secondary Analysis of the Women`s Health Initiative Randomized Clinical Trials.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48260265/117680",
      "abstract": "Identification of appropriate patients for treatment of vasomotor symptoms (VMS) with menopausal hormone therapy (HT) is challenging. To assess risk of cardiovascular disease (CVD) due to HT in women with VMS. In this secondary analysis of 2 randomized clinical trials of HT, postmenopausal women aged 50 to 79 years from 40 US clinical centers were included. Data were collected from November 1993 to September 2012, and data were analyzed from December 2024 to May 2025. Conjugated equine estrogens (CEE), 0.625 mg per day, or CEE with medroxyprogesterone acetate (MPA), 2.5 mg per day, vs placebo. Atherosclerotic CVD (ASCVD; defined as composite of nonfatal myocardial infarction, hospitalization for angina, coronary revascularization, ischemic stroke, peripheral arterial disease, carotid artery disease, or CVD death). Of 27 347 included postmenopausal women, the mean (SD) age was 63.4 (7.2) years; a total of 10 739 (39.3%) had a hysterectomy, and 16 608 (60.7%) had an intact uterus. The median (IQR) follow-up was 7.2 (6.4-8.1) years and 5.6 (4.8-6.5) years for those in the CEE alone trial and the CEE plus MPA trial, respectively. In the CEE alone trial, moderate or severe VMS were present at baseline in 905 (27.6%), 705 (14.7%), and 220 (8.7%) women aged 50 to 59 years, 60 to 69 years, and 70 to 79 years, respectively; in the CEE plus MPA trial, moderate or severe VMS was present in 1225 (22.4%), 649 (8.7%), and 172 (4.8%), respectively. Among women with moderate or severe VMS at enrollment, 3382 (96.7%) recalled having symptoms near menopause onset. CEE alone reduced VMS by 41% across all age groups (overall relative risk [RR], 0.59; 95% CI, 0.53-0.66). However, in the CEE plus MPA trial, VMS reduction was attenuated with age (age 50-59 years: RR, 0.41; 95% CI, 0.35-0.48; age 60-69 years: RR, 0.72; 95% CI, 0.61-0.85; age 70-79 years: RR, 1.20; 95% CI, 0.91-1.59; interaction P for trend < .001). Both CEE alone and CEE plus MPA appeared to have neutral effects on ASCVD in women with moderate or severe VMS aged 50 to 59 years (CEE alone: hazard ratio [HR], 0.85; 95% CI, 0.53-1.35; CEE plus MPA: HR, 0.84; 95% CI, 0.44-1.57). While the estimated risk was higher for CEE alone in women with VMS aged 60 to 69 years, there was no clear signal of harm (CEE alone: HR, 1.31; 95% CI, 0.90-1.90; CEE plus MPA: HR, 0.84; 95% CI, 0.51-1.39). However, women with VMS 70 years and older had increased risks of ASCVD (CEE alone: HR, 1.95; 95% CI, 1.06-3.59; 217 excess events per 10 000 person-years; interaction P for trend = .03; CEE plus MPA: HR, 3.22; 95% CI, 1.36-7.63; 382 excess events per 10 000 person-years; interaction P for trend = .02). In this secondary analysis of 2 randomized clinical trials, among younger postmenopausal women aged 50 to 59 years, both CEE alone and CEE plus MPA reduced VMS without significantly affecting ASCVD risk. In women with VMS 70 years and older, risks for ASCVD were increased in both trials. The findings support guideline recommendations for treatment of VMS with HT in women aged 50 to 59 years, caution if initiating HT in women aged 60 to 69 years, and avoidance of HT in women 70 years and older. ClinicalTrials.gov Identifier: NCT00000611.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Identification of appropriate patients for treatment of vasomotor symptoms (VMS) with menopausal hormone therapy (HT) is challenging."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess risk of cardiovascular disease (CVD) due to HT in women with VMS."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "In this secondary analysis of 2 randomized clinical trials of HT, postmenopausal women aged 50 to 79 years from 40 US clinical centers were included. Data were collected from November 1993 to September 2012, and data were analyzed from December 2024 to May 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Conjugated equine estrogens (CEE), 0.625 mg per day, or CEE with medroxyprogesterone acetate (MPA), 2.5 mg per day, vs placebo."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Atherosclerotic CVD (ASCVD; defined as composite of nonfatal myocardial infarction, hospitalization for angina, coronary revascularization, ischemic stroke, peripheral arterial disease, carotid artery disease, or CVD death)."
        },
        {
          "label": "RESULTS",
          "text": "Of 27 347 included postmenopausal women, the mean (SD) age was 63.4 (7.2) years; a total of 10 739 (39.3%) had a hysterectomy, and 16 608 (60.7%) had an intact uterus. The median (IQR) follow-up was 7.2 (6.4-8.1) years and 5.6 (4.8-6.5) years for those in the CEE alone trial and the CEE plus MPA trial, respectively. In the CEE alone trial, moderate or severe VMS were present at baseline in 905 (27.6%), 705 (14.7%), and 220 (8.7%) women aged 50 to 59 years, 60 to 69 years, and 70 to 79 years, respectively; in the CEE plus MPA trial, moderate or severe VMS was present in 1225 (22.4%), 649 (8.7%), and 172 (4.8%), respectively. Among women with moderate or severe VMS at enrollment, 3382 (96.7%) recalled having symptoms near menopause onset. CEE alone reduced VMS by 41% across all age groups (overall relative risk [RR], 0.59; 95% CI, 0.53-0.66). However, in the CEE plus MPA trial, VMS reduction was attenuated with age (age 50-59 years: RR, 0.41; 95% CI, 0.35-0.48; age 60-69 years: RR, 0.72; 95% CI, 0.61-0.85; age 70-79 years: RR, 1.20; 95% CI, 0.91-1.59; interaction P for trend < .001). Both CEE alone and CEE plus MPA appeared to have neutral effects on ASCVD in women with moderate or severe VMS aged 50 to 59 years (CEE alone: hazard ratio [HR], 0.85; 95% CI, 0.53-1.35; CEE plus MPA: HR, 0.84; 95% CI, 0.44-1.57). While the estimated risk was higher for CEE alone in women with VMS aged 60 to 69 years, there was no clear signal of harm (CEE alone: HR, 1.31; 95% CI, 0.90-1.90; CEE plus MPA: HR, 0.84; 95% CI, 0.51-1.39). However, women with VMS 70 years and older had increased risks of ASCVD (CEE alone: HR, 1.95; 95% CI, 1.06-3.59; 217 excess events per 10 000 person-years; interaction P for trend = .03; CEE plus MPA: HR, 3.22; 95% CI, 1.36-7.63; 382 excess events per 10 000 person-years; interaction P for trend = .02)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this secondary analysis of 2 randomized clinical trials, among younger postmenopausal women aged 50 to 59 years, both CEE alone and CEE plus MPA reduced VMS without significantly affecting ASCVD risk. In women with VMS 70 years and older, risks for ASCVD were increased in both trials. The findings support guideline recommendations for treatment of VMS with HT in women aged 50 to 59 years, caution if initiating HT in women aged 60 to 69 years, and avoidance of HT in women 70 years and older."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT00000611."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40952729/",
      "pubDate": "2025 Sep 15",
      "doi": "10.1001/jamainternmed.2025.4510",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "Hormone therapy effectively treats vasomotor symptoms in younger postmenopausal women without increasing cardiovascular risk, but increases cardiovascular risk in women aged 70 and older."
    },
    {
      "id": "35e4ce8628ab",
      "title": "Oral Semaglutide at a Dose of 25 mg in Adults with Overweight or Obesity.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48260265/117628",
      "abstract": "Orforglipron, a small-molecule, nonpeptide oral glucagon-like peptide-1 (GLP-1) receptor agonist, is being investigated as a treatment for obesity. In this phase 3, multinational, randomized, double-blind trial, we examined the safety and efficacy of once-daily orforglipron at doses of 6 mg, 12 mg, or 36 mg, as compared with placebo (assigned in a 3:3:3:4 ratio) as an adjunct to healthy diet and physical activity for 72 weeks. All the patients had obesity without diabetes mellitus. The primary end point was the percent change in body weight from baseline to week 72, as assessed according to the treatment-regimen estimand in the intention-to-treat population. A total of 3127 patients underwent randomization. The mean change in body weight from baseline to week 72 was -7.5% (95% confidence interval [CI], -8.2 to -6.8) with 6 mg of orforglipron, -8.4% (95% CI, -9.1 to -7.7) with 12 mg of orforglipron, and -11.2% (95% CI, -12.0 to -10.4) with 36 mg of orforglipron, as compared with -2.1% (95% CI, -2.8 to -1.4) with placebo (P<0.001 for all comparisons with placebo). Among the patients in the orforglipron 36-mg group, 54.6% had a reduction of 10% or more, 36.0% had a reduction of 15% or more, and 18.4% had a reduction of 20% or more, as compared with 12.9%, 5.9%, and 2.8% of the patients, respectively, in the placebo group. Waist circumference, systolic blood pressure, triglyceride levels, and non-HDL cholesterol levels significantly improved with orforglipron treatment as compared with placebo. Adverse events resulted in treatment discontinuation in 5.3 to 10.3% of the patients in the orforglipron groups and in 2.7% of those in the placebo group. The most common adverse events with orforglipron were gastrointestinal effects, which were mostly mild to moderate. In adults with obesity, 72-week treatment with orforglipron led to significantly greater reductions in body weight than placebo; the adverse-event profile was consistent with that of other GLP-1 receptor agonists. (Funded by Eli Lilly; ATTAIN-1 ClinicalTrials.gov number, NCT05869903.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Orforglipron, a small-molecule, nonpeptide oral glucagon-like peptide-1 (GLP-1) receptor agonist, is being investigated as a treatment for obesity."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3, multinational, randomized, double-blind trial, we examined the safety and efficacy of once-daily orforglipron at doses of 6 mg, 12 mg, or 36 mg, as compared with placebo (assigned in a 3:3:3:4 ratio) as an adjunct to healthy diet and physical activity for 72 weeks. All the patients had obesity without diabetes mellitus. The primary end point was the percent change in body weight from baseline to week 72, as assessed according to the treatment-regimen estimand in the intention-to-treat population."
        },
        {
          "label": "RESULTS",
          "text": "A total of 3127 patients underwent randomization. The mean change in body weight from baseline to week 72 was -7.5% (95% confidence interval [CI], -8.2 to -6.8) with 6 mg of orforglipron, -8.4% (95% CI, -9.1 to -7.7) with 12 mg of orforglipron, and -11.2% (95% CI, -12.0 to -10.4) with 36 mg of orforglipron, as compared with -2.1% (95% CI, -2.8 to -1.4) with placebo (P<0.001 for all comparisons with placebo). Among the patients in the orforglipron 36-mg group, 54.6% had a reduction of 10% or more, 36.0% had a reduction of 15% or more, and 18.4% had a reduction of 20% or more, as compared with 12.9%, 5.9%, and 2.8% of the patients, respectively, in the placebo group. Waist circumference, systolic blood pressure, triglyceride levels, and non-HDL cholesterol levels significantly improved with orforglipron treatment as compared with placebo. Adverse events resulted in treatment discontinuation in 5.3 to 10.3% of the patients in the orforglipron groups and in 2.7% of those in the placebo group. The most common adverse events with orforglipron were gastrointestinal effects, which were mostly mild to moderate."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In adults with obesity, 72-week treatment with orforglipron led to significantly greater reductions in body weight than placebo; the adverse-event profile was consistent with that of other GLP-1 receptor agonists. (Funded by Eli Lilly; ATTAIN-1 ClinicalTrials.gov number, NCT05869903.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40960239/",
      "pubDate": "2025 Sep 16",
      "doi": "10.1056/NEJMoa2511774",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "Orforglipron resulted in significantly more weight loss compared to placebo in obese adults over 72 weeks, with side effects similar to other GLP-1 receptor agonists."
    },
    {
      "id": "ba0792328dbb",
      "title": "The Efficacy of Aromatherapy on Pain and Anxiety During Needle-Related Procedures in Adults: A Systematic Review and Meta-Analysis.",
      "journal": "J Pain Res",
      "score": "5/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48260265/117478",
      "abstract": "Pain and anxiety resulting from needle-related manipulation are major causes of patient refusal and missed optimal treatment. This study focuses on assessing the effectiveness and benefits of aromatherapy in adult patients undergoing needle-related manipulation for pain and anxiety. The researchers conducted detailed searches of a total of five databases, the Cochrane Library, Web of Science, Embase Databases, and Scopus, from the period of the library's construction until November 23, 2024. Inclusion criteria involved adults undergoing needle-related manipulation, aromatherapy as an intervention, and outcome indicators such as pain, anxiety, and satisfaction. And the results were analyzed in subgroups. This study used RevMan 5.4.1 software to analyse the included data. This meta-analysis and systematic review included a total of 9 studies. A meta-analysis demonstrated that aromatherapy as an intervention significantly reduced pain (MD = -1.82, 95% CI [-2.35, -1.30], p < 0.00001) and anxiety (SMD = -0.92, 95% CI [-1.71, -0.14], p = 0.02) in adult patients undergoing needle-related invasive procedures compared to placebo and conventional interventions. Subgroup analyses indicated aromatherapy reduced pain during needle procedures for arteriovenous fistulae (AVF) and catheter placement, and alleviated anxiety in AVF patients. Lavender oil effectively reduced both pain and anxiety. The 5-minute duration of action is superior to the 3-minute duration of action. Both inhalation and topical application reduced pain. This meta-analysis supports aromatherapy for needle-related pain relief and targeted anxiety reduction. However, protocol standardization in future RCTs is needed to address high heterogeneity and methodological limitations.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Pain and anxiety resulting from needle-related manipulation are major causes of patient refusal and missed optimal treatment. This study focuses on assessing the effectiveness and benefits of aromatherapy in adult patients undergoing needle-related manipulation for pain and anxiety."
        },
        {
          "label": "METHODS",
          "text": "The researchers conducted detailed searches of a total of five databases, the Cochrane Library, Web of Science, Embase Databases, and Scopus, from the period of the library's construction until November 23, 2024. Inclusion criteria involved adults undergoing needle-related manipulation, aromatherapy as an intervention, and outcome indicators such as pain, anxiety, and satisfaction. And the results were analyzed in subgroups. This study used RevMan 5.4.1 software to analyse the included data."
        },
        {
          "label": "RESULTS",
          "text": "This meta-analysis and systematic review included a total of 9 studies. A meta-analysis demonstrated that aromatherapy as an intervention significantly reduced pain (MD = -1.82, 95% CI [-2.35, -1.30], p < 0.00001) and anxiety (SMD = -0.92, 95% CI [-1.71, -0.14], p = 0.02) in adult patients undergoing needle-related invasive procedures compared to placebo and conventional interventions. Subgroup analyses indicated aromatherapy reduced pain during needle procedures for arteriovenous fistulae (AVF) and catheter placement, and alleviated anxiety in AVF patients. Lavender oil effectively reduced both pain and anxiety. The 5-minute duration of action is superior to the 3-minute duration of action. Both inhalation and topical application reduced pain."
        },
        {
          "label": "CONCLUSION",
          "text": "This meta-analysis supports aromatherapy for needle-related pain relief and targeted anxiety reduction. However, protocol standardization in future RCTs is needed to address high heterogeneity and methodological limitations."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40827258/",
      "pubDate": "2025",
      "doi": "10.2147/JPR.S533076",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "Aromatherapy effectively reduces needle-related pain and anxiety, but future research needs standardized protocols."
    },
    {
      "id": "ee00a6805e7c",
      "title": "Elinzanetant for the Treatment of Vasomotor Symptoms Associated With Menopause: A Phase 3 Randomized Clinical Trial.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117610",
      "abstract": "There is an unmet need for long-term, safe, effective, and hormone-free treatments for menopausal symptoms, including vasomotor symptoms (VMS) and sleep disturbances. To evaluate the 52-week efficacy and safety of elinzanetant, a dual neurokinin-targeted therapy, for treating moderate to severe VMS associated with menopause. OASIS-3 was a double-blind, placebo-controlled, randomized phase 3 clinical trial that was conducted at 83 sites in North America and Europe from August 27, 2021, to February 12, 2024, and included postmenopausal women aged 40 to 65 years who were seeking treatment for moderate to severe VMS (no requirement for a minimum number of VMS events per week). The data were analyzed on March 11, 2024. Once-daily oral elinzanetant, 120 mg, or matching placebo for 52 weeks. The primary outcome was mean change from baseline to week 12 in the frequency of daily moderate to severe VMS, which was analyzed using a mixed model with repeated measures. Secondary end points included changes over 52 weeks in measures evaluating sleep disturbance and the effect on menopause-related quality of life. Exploratory end points included mean changes over 50 weeks in frequency and severity of daily moderate to severe VMS. Exploratory and secondary end points were analyzed using descriptive statistics. Safety was also assessed. Overall, 313 women (mean [SD] age, 54.6 [4.7] years; 51 [16.3%] were Black or African American, and 240 [76.7%] were White individuals; 34 [10.9%] were Hispanic or Latina) were randomized to receive elinzanetant and 315 (mean [SD] age, 54.9 [5.0] years; 44 [14.0%] Black or African American, 34 [10.8%] Hispanic or Latina, and 253 [80.3%] White individuals) to receive placebo. At week 12, the mean change from baseline in daily moderate to severe VMS frequency was -5.4 (95% CI, -6.3 to -4.5) for elinzanetant and -3.5 (95% CI, -4.1 to -2.9) for placebo; the least-squares mean difference for elinzanetant vs placebo was -1.6 (95% CI, -2.0 to -1.1; P < .001). Although no statistical hypotheses were defined, nor was the study powered to detect between-group differences for the secondary and exploratory end points, descriptive analyses showed numerical advantages for elinzanetant vs placebo for improving VMS frequency and severity over 50 weeks and sleep disturbances and menopause-related quality of life over 52 weeks. Regarding safety, elinzanetant was not associated with hepatotoxic effects, endometrial hyperplasia, or meaningful changes in bone density or bone turnover markers. Treatment-related adverse events were more common with elinzanetant than placebo (30.4% vs 14.6%); the most frequent were somnolence, fatigue, and headache. The OASIS-3 randomized clinical trial expanded on findings from the 26-week OASIS-1 and OASIS-2 trials, exploring the use of elinzanetant over a longer duration and in a broader population. Elinzanetant shows promise as a treatment for moderate to severe VMS. ClinicalTrials.gov Identifier: NCT05030584.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There is an unmet need for long-term, safe, effective, and hormone-free treatments for menopausal symptoms, including vasomotor symptoms (VMS) and sleep disturbances."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the 52-week efficacy and safety of elinzanetant, a dual neurokinin-targeted therapy, for treating moderate to severe VMS associated with menopause."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "OASIS-3 was a double-blind, placebo-controlled, randomized phase 3 clinical trial that was conducted at 83 sites in North America and Europe from August 27, 2021, to February 12, 2024, and included postmenopausal women aged 40 to 65 years who were seeking treatment for moderate to severe VMS (no requirement for a minimum number of VMS events per week). The data were analyzed on March 11, 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Once-daily oral elinzanetant, 120 mg, or matching placebo for 52 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was mean change from baseline to week 12 in the frequency of daily moderate to severe VMS, which was analyzed using a mixed model with repeated measures. Secondary end points included changes over 52 weeks in measures evaluating sleep disturbance and the effect on menopause-related quality of life. Exploratory end points included mean changes over 50 weeks in frequency and severity of daily moderate to severe VMS. Exploratory and secondary end points were analyzed using descriptive statistics. Safety was also assessed."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 313 women (mean [SD] age, 54.6 [4.7] years; 51 [16.3%] were Black or African American, and 240 [76.7%] were White individuals; 34 [10.9%] were Hispanic or Latina) were randomized to receive elinzanetant and 315 (mean [SD] age, 54.9 [5.0] years; 44 [14.0%] Black or African American, 34 [10.8%] Hispanic or Latina, and 253 [80.3%] White individuals) to receive placebo. At week 12, the mean change from baseline in daily moderate to severe VMS frequency was -5.4 (95% CI, -6.3 to -4.5) for elinzanetant and -3.5 (95% CI, -4.1 to -2.9) for placebo; the least-squares mean difference for elinzanetant vs placebo was -1.6 (95% CI, -2.0 to -1.1; P < .001). Although no statistical hypotheses were defined, nor was the study powered to detect between-group differences for the secondary and exploratory end points, descriptive analyses showed numerical advantages for elinzanetant vs placebo for improving VMS frequency and severity over 50 weeks and sleep disturbances and menopause-related quality of life over 52 weeks. Regarding safety, elinzanetant was not associated with hepatotoxic effects, endometrial hyperplasia, or meaningful changes in bone density or bone turnover markers. Treatment-related adverse events were more common with elinzanetant than placebo (30.4% vs 14.6%); the most frequent were somnolence, fatigue, and headache."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "The OASIS-3 randomized clinical trial expanded on findings from the 26-week OASIS-1 and OASIS-2 trials, exploring the use of elinzanetant over a longer duration and in a broader population. Elinzanetant shows promise as a treatment for moderate to severe VMS."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05030584."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40920404/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1001/jamainternmed.2025.4421",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "Elinzanetant demonstrates potential as a treatment for moderate to severe vasomotor symptoms (VMS)."
    },
    {
      "id": "9f02bd42fc9f",
      "title": "Minimally Invasive Surgery vs Medical Management Alone for Intracerebral Hemorrhage: The MIND Randomized Clinical Trial.",
      "journal": "JAMA Neurol",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117608",
      "abstract": "It remains uncertain whether surgical evacuation improves functional outcomes in patients with supratentorial intracerebral hemorrhage (ICH). To compare the safety and efficacy of minimally invasive surgery with the Artemis Neuro Evacuation Device to guideline-based medical management alone for spontaneous supratentorial ICH. The MIND open-label, multicenter randomized clinical trial randomized patients with spontaneous supratentorial ICH in a 2:1 ratio to either minimally invasive surgery or medical management alone. Participants were enrolled at 32 participating global sites between February 6, 2018, and August 28, 2023. This article reports on the primary trial outcome. Of 4066 eligible adult patients (aged 18-80 years) with moderate- to large-volume supratentorial ICH (20-80 mL), baseline National Institutes of Health Stroke Scale score of 6 or higher, and Glasgow Coma Scale score between 5 and 15, 154 were randomized to minimally invasive surgery and 82 to medical management. Data were analyzed from February to September 2024. Minimally invasive surgery (within 72 hours of symptom onset) plus medical management or medical management alone. The primary efficacy outcome was 180-day combined death and disability via ordinal modified Rankin Scale score (range, 0 [no symptoms] to 6 [death]). The primary safety outcome was 30-day mortality. Following an independent feasibility analysis prompted by the publication of positive results of a contemporaneous ICH trial, enrollment was stopped early at 236 participants. Overall median (IQR) participant age was 60 (50-70) years, 87 participants (36.9%) were female, 164 (69.5%) had primarily deep bleeds, and 72 (30.5%) had primarily lobar bleeds. Efficacy results of the primary model analysis suggested lack of evidence for the superiority of minimally invasive surgery over medical management (odds ratio [OR], 1.03; 96% CI, 0.62-1.72; P = .45). The adjusted model's mean OR was also nonsignificantly greater than 1 (OR, 1.10; 96% CI, 0.66-1.85; P = .35). By 30 days, 11 participants (7.2%) in the surgery group and 8 (9.8%) in the medical management group died (difference, -2.5%; 95% CI, -11.7% to 4.8%). In the MIND randomized clinical trial, minimally invasive surgery within 72 hours did not significantly reduce 30-day mortality or improve 180-day disability in patients with supratentorial ICH compared to medical management alone. ClinicalTrials.gov Identifier: NCT03342664.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "It remains uncertain whether surgical evacuation improves functional outcomes in patients with supratentorial intracerebral hemorrhage (ICH)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the safety and efficacy of minimally invasive surgery with the Artemis Neuro Evacuation Device to guideline-based medical management alone for spontaneous supratentorial ICH."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The MIND open-label, multicenter randomized clinical trial randomized patients with spontaneous supratentorial ICH in a 2:1 ratio to either minimally invasive surgery or medical management alone. Participants were enrolled at 32 participating global sites between February 6, 2018, and August 28, 2023. This article reports on the primary trial outcome. Of 4066 eligible adult patients (aged 18-80 years) with moderate- to large-volume supratentorial ICH (20-80 mL), baseline National Institutes of Health Stroke Scale score of 6 or higher, and Glasgow Coma Scale score between 5 and 15, 154 were randomized to minimally invasive surgery and 82 to medical management. Data were analyzed from February to September 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Minimally invasive surgery (within 72 hours of symptom onset) plus medical management or medical management alone."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcome was 180-day combined death and disability via ordinal modified Rankin Scale score (range, 0 [no symptoms] to 6 [death]). The primary safety outcome was 30-day mortality."
        },
        {
          "label": "RESULTS",
          "text": "Following an independent feasibility analysis prompted by the publication of positive results of a contemporaneous ICH trial, enrollment was stopped early at 236 participants. Overall median (IQR) participant age was 60 (50-70) years, 87 participants (36.9%) were female, 164 (69.5%) had primarily deep bleeds, and 72 (30.5%) had primarily lobar bleeds. Efficacy results of the primary model analysis suggested lack of evidence for the superiority of minimally invasive surgery over medical management (odds ratio [OR], 1.03; 96% CI, 0.62-1.72; P = .45). The adjusted model's mean OR was also nonsignificantly greater than 1 (OR, 1.10; 96% CI, 0.66-1.85; P = .35). By 30 days, 11 participants (7.2%) in the surgery group and 8 (9.8%) in the medical management group died (difference, -2.5%; 95% CI, -11.7% to 4.8%)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In the MIND randomized clinical trial, minimally invasive surgery within 72 hours did not significantly reduce 30-day mortality or improve 180-day disability in patients with supratentorial ICH compared to medical management alone."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03342664."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892424/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamaneurol.2025.3151",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "Minimally invasive surgery within 72 hours did not improve outcomes compared to medical management for supratentorial intracerebral hemorrhage."
    },
    {
      "id": "142403726089",
      "title": "Glucagon-Like Peptide-1 Receptor Agonists and Gastrointestinal Adverse Events: A Systematic Review and Meta-Analysis.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117605",
      "abstract": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) are widely used for glycemic control or weight management in patients with type 2 diabetes mellitus or overweight/obesity. However, there are concerns regarding their association with serious gastrointestinal adverse events, although findings have been inconsistent. We systematically searched 5 databases for placebo-controlled randomized controlled trials assessing GLP-1RAs in patients with type 2 diabetes mellitus, overweight/obesity, or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease. We included trials that reported cholecystitis, cholelithiasis, cholangitis, cholestasis, pancreatitis, gastroesophageal reflux disease (GERD), gastritis, esophagitis, gastrointestinal ischemia, gastrointestinal hemorrhage, intestinal obstruction, paralytic ileus, gastrointestinal ulceration, gastrointestinal perforation, or gastroparesis. Meta-analyses were performed using a random-effects model, with subgroup analyses evaluating risks based on patient population, GLP-1RA vs dual-agonist formulation, weight-loss profile, dosing, and duration of action. We included 55 randomized controlled trials involving 106,395 participants. GLP-1RAs increased the risk of cholelithiasis (risk ratio [RR], 1.46; 95% CI, 1.09-1.97; 2 more cases per 1000) and probably increased the risk of GERD (RR, 2.19; 95% CI, 1.48-3.25; 4 more cases per 1000) compared with placebo. GLP-1RAs probably have little or no effect on the risk of other gastrointestinal or biliary events. Subgroup analyses showed that the increased risks of cholelithiasis and GERD were more pronounced in trials including individuals with overweight/obesity or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease, weight-loss-inducing GLP-1RAs, or high-dose formulations, although these subgroup effects were not statistically significant. GLP-1RAs are associated with an increased risk of cholelithiasis and GERD, but do not appear to increase the risk of other gastrointestinal or biliary adverse events.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) are widely used for glycemic control or weight management in patients with type 2 diabetes mellitus or overweight/obesity. However, there are concerns regarding their association with serious gastrointestinal adverse events, although findings have been inconsistent."
        },
        {
          "label": "METHODS",
          "text": "We systematically searched 5 databases for placebo-controlled randomized controlled trials assessing GLP-1RAs in patients with type 2 diabetes mellitus, overweight/obesity, or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease. We included trials that reported cholecystitis, cholelithiasis, cholangitis, cholestasis, pancreatitis, gastroesophageal reflux disease (GERD), gastritis, esophagitis, gastrointestinal ischemia, gastrointestinal hemorrhage, intestinal obstruction, paralytic ileus, gastrointestinal ulceration, gastrointestinal perforation, or gastroparesis. Meta-analyses were performed using a random-effects model, with subgroup analyses evaluating risks based on patient population, GLP-1RA vs dual-agonist formulation, weight-loss profile, dosing, and duration of action."
        },
        {
          "label": "RESULTS",
          "text": "We included 55 randomized controlled trials involving 106,395 participants. GLP-1RAs increased the risk of cholelithiasis (risk ratio [RR], 1.46; 95% CI, 1.09-1.97; 2 more cases per 1000) and probably increased the risk of GERD (RR, 2.19; 95% CI, 1.48-3.25; 4 more cases per 1000) compared with placebo. GLP-1RAs probably have little or no effect on the risk of other gastrointestinal or biliary events. Subgroup analyses showed that the increased risks of cholelithiasis and GERD were more pronounced in trials including individuals with overweight/obesity or metabolic dysfunction-associated steatohepatitis/metabolic dysfunction-associated steatotic liver disease, weight-loss-inducing GLP-1RAs, or high-dose formulations, although these subgroup effects were not statistically significant."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1RAs are associated with an increased risk of cholelithiasis and GERD, but do not appear to increase the risk of other gastrointestinal or biliary adverse events."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40499738/",
      "pubDate": "2025 Jun 09",
      "doi": "10.1053/j.gastro.2025.06.003",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists are linked to a higher chance of gallstones and acid reflux, but not other digestive or biliary problems."
    },
    {
      "id": "2ff49a0d3e4f",
      "title": "Fractional Flow Reserve-Guided Complete vs Culprit-Only Revascularization in Non-ST-Elevation Myocardial Infarction and Multivessel Disease: The SLIM Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48206400/117572",
      "abstract": "The benefits of fractional flow reserve (FFR)-guided complete coronary revascularization in patients with non-ST-segment elevation myocardial infarction (NSTEMI) and multivessel disease remain unclear. To compare FFR-guided complete revascularization of nonculprit lesions vs culprit-only revascularization in patients with NSTEMI and multivessel disease. This prospective, investigator-initiated, multicenter, international randomized clinical trial was conducted at 9 hospitals in Europe. Patients with NSTEMI and multivessel disease who had successful revascularization of the culprit lesion were enrolled between June 2018 and July 2024, and final follow-up was completed on July 21, 2025. The analysis was conducted on July 28, 2025. Eligibility criteria included the presence of at least 1 stenosis of at least 50% in a nonculprit lesion amendable for revascularization. Patients were randomized to receive either FFR-guided complete or culprit-only revascularization during the index procedure. Staged revascularization within 6 weeks after the index procedure was allowed in the culprit-only group. The primary outcome was a composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. Key secondary outcomes included individual components of the primary outcome, net adverse clinical events, all-cause death or nonfatal myocardial infarction, cardiac rehospitalization, and bleeding events. Among 478 randomized patients (mean [SD] age, 65.9 [10.6] years; 347 [72.9%] males), 240 were randomized to receive FFR-guided complete revascularization and 238 were randomized to receive culprit-only revascularization, with crossover occurring in 7 patients in the culprit-only group. The primary outcome occurred in 13 patients (5.5%) in the FFR-guided complete revascularization group vs 32 patients (13.6%) in the culprit-only group (hazard ratio [HR], 0.38 [95% CI, 0.20-0.72]; P = .003). Rates of any revascularization (3.0% vs 11.5%; HR, 0.24 [95% CI, 0.11-0.56]; P < .001) and net adverse clinical events (6.3% vs 15.3%; HR, 0.39 [95% CI, 0.21-0.70]; P = .002) were also significantly lower in the complete revascularization group, while there were no significant differences in the remaining secondary outcomes. FFR-guided complete revascularization during the index procedure resulted in a significant reduction in the composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. This was mainly driven by reduced repeat revascularization. ClinicalTrials.gov Identifier: NCT03562572.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The benefits of fractional flow reserve (FFR)-guided complete coronary revascularization in patients with non-ST-segment elevation myocardial infarction (NSTEMI) and multivessel disease remain unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare FFR-guided complete revascularization of nonculprit lesions vs culprit-only revascularization in patients with NSTEMI and multivessel disease."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This prospective, investigator-initiated, multicenter, international randomized clinical trial was conducted at 9 hospitals in Europe. Patients with NSTEMI and multivessel disease who had successful revascularization of the culprit lesion were enrolled between June 2018 and July 2024, and final follow-up was completed on July 21, 2025. The analysis was conducted on July 28, 2025. Eligibility criteria included the presence of at least 1 stenosis of at least 50% in a nonculprit lesion amendable for revascularization."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomized to receive either FFR-guided complete or culprit-only revascularization during the index procedure. Staged revascularization within 6 weeks after the index procedure was allowed in the culprit-only group."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. Key secondary outcomes included individual components of the primary outcome, net adverse clinical events, all-cause death or nonfatal myocardial infarction, cardiac rehospitalization, and bleeding events."
        },
        {
          "label": "RESULTS",
          "text": "Among 478 randomized patients (mean [SD] age, 65.9 [10.6] years; 347 [72.9%] males), 240 were randomized to receive FFR-guided complete revascularization and 238 were randomized to receive culprit-only revascularization, with crossover occurring in 7 patients in the culprit-only group. The primary outcome occurred in 13 patients (5.5%) in the FFR-guided complete revascularization group vs 32 patients (13.6%) in the culprit-only group (hazard ratio [HR], 0.38 [95% CI, 0.20-0.72]; P = .003). Rates of any revascularization (3.0% vs 11.5%; HR, 0.24 [95% CI, 0.11-0.56]; P < .001) and net adverse clinical events (6.3% vs 15.3%; HR, 0.39 [95% CI, 0.21-0.70]; P = .002) were also significantly lower in the complete revascularization group, while there were no significant differences in the remaining secondary outcomes."
        },
        {
          "label": "CONCLUSION AND RELEVANCE",
          "text": "FFR-guided complete revascularization during the index procedure resulted in a significant reduction in the composite of all-cause death, nonfatal myocardial infarction, any revascularization, and stroke at 1 year. This was mainly driven by reduced repeat revascularization."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03562572."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886310/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1001/jama.2025.16189",
      "dateReceived": "2025-10-02T23:21:47.732Z",
      "isNew": false,
      "summary": "FFR-guided complete revascularization during the initial procedure significantly lowered the risk of death, heart attack, repeat procedures, and stroke within a year, primarily due to fewer repeat revascularizations."
    },
    {
      "id": "b3a281a349a3",
      "title": "Efficacy and Safety of Ammoxetine in Major Depressive Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117745",
      "abstract": "Major depressive disorder (MDD) is among the most prevalent mental health disorders, causing substantial disability and economic burden. Although several first-line treatments exist with mild adverse effects, up to 50% to 60% of patients do not tolerate or respond to them. Ammoxetine, a novel selective serotonin and norepinephrine reuptake inhibitor, has been found to reduce adverse effects and hepatotoxicity and more potent inhibition of serotonin and norepinephrine transporters, making it more tolerable and effective. To evaluate the efficacy and safety of ammoxetine in treating adults with MDD. This phase 2 randomized clinical trial was a multicenter, double-masked, placebo-controlled, parallel-group, fixed-dose study of ammoxetine treatment in patients with MDD in China. Patients aged 18 to 65 years from 15 study centers were randomized into daily ammoxetine or placebo groups between March 27, 2023, and June 13, 2024, and followed up for 10 weeks. Participants were randomized 1:1:1 to 3 treatment groups: ammoxetine 40 mg/d, ammoxetine 60 mg/d, and placebo. The primary outcome was change in Montgomery-Åsberg Depression Rating Scale (MADRS) total score from baseline to 8 weeks. Efficacy analyses were performed on both the full-analysis and per-protocol sets using least-squares (LS) mean differences. The safety set analysis was performed using descriptive statistics. Among 239 enrolled patients (mean [SD] age, 30.4 [10.0] years, 158 female [66.1%]), 80 were randomized to the ammoxetine 60 mg/d group, 80 to the ammoxetine 40 mg/d group, and 79 to the placebo group. In the full-analysis set, both ammoxetine doses led to statistically significant improvements in MADRS total scores at week 8 compared with placebo. The LS mean changes (SE) from baseline were -16.7 (1.3) for ammoxetine 40 mg/d, -16.6 (1.3) for ammoxetine 60 mg/d, and -13.5 (1.3) for placebo. The differences vs placebo were -3.3 (97.3 CI, -6.3 to -0.3) for ammoxetine 40 mg/d and -3.1 (97.3% CI, -6.2 to 0.0) for ammoxetine 60 mg/d. Consistent results were observed in the per-protocol set analysis at week 8 for ammoxetine 40 mg/d (LS mean change, -3.2; 97.3% CI, -6.2 to -0.2) and ammoxetine 60 mg/d (LS mean change, -3.18; 97.3% CI, -6.2 to -0.2), both superior to placebo. Treatment-emergent adverse events were reported in 68 participants (85.0%) receiving ammoxetine 60 mg/d, 63 (78.8%) receiving ammoxetine 40 mg/d, and 48 (60.8%) receiving placebo; most were mild to moderate in severity. This randomized clinical trial demonstrated superiority over placebo of ammoxetine treatment at both 40 mg/d and 60 mg/d in patients with MDD. In addition, all doses of ammoxetine were generally well tolerated. ClinicalTrials.gov Identifier: NCT05762458.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Major depressive disorder (MDD) is among the most prevalent mental health disorders, causing substantial disability and economic burden. Although several first-line treatments exist with mild adverse effects, up to 50% to 60% of patients do not tolerate or respond to them. Ammoxetine, a novel selective serotonin and norepinephrine reuptake inhibitor, has been found to reduce adverse effects and hepatotoxicity and more potent inhibition of serotonin and norepinephrine transporters, making it more tolerable and effective."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the efficacy and safety of ammoxetine in treating adults with MDD."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This phase 2 randomized clinical trial was a multicenter, double-masked, placebo-controlled, parallel-group, fixed-dose study of ammoxetine treatment in patients with MDD in China. Patients aged 18 to 65 years from 15 study centers were randomized into daily ammoxetine or placebo groups between March 27, 2023, and June 13, 2024, and followed up for 10 weeks."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1:1 to 3 treatment groups: ammoxetine 40 mg/d, ammoxetine 60 mg/d, and placebo."
        },
        {
          "label": "MAIN OUTCOME AND MEASURES",
          "text": "The primary outcome was change in Montgomery-Åsberg Depression Rating Scale (MADRS) total score from baseline to 8 weeks. Efficacy analyses were performed on both the full-analysis and per-protocol sets using least-squares (LS) mean differences. The safety set analysis was performed using descriptive statistics."
        },
        {
          "label": "RESULTS",
          "text": "Among 239 enrolled patients (mean [SD] age, 30.4 [10.0] years, 158 female [66.1%]), 80 were randomized to the ammoxetine 60 mg/d group, 80 to the ammoxetine 40 mg/d group, and 79 to the placebo group. In the full-analysis set, both ammoxetine doses led to statistically significant improvements in MADRS total scores at week 8 compared with placebo. The LS mean changes (SE) from baseline were -16.7 (1.3) for ammoxetine 40 mg/d, -16.6 (1.3) for ammoxetine 60 mg/d, and -13.5 (1.3) for placebo. The differences vs placebo were -3.3 (97.3 CI, -6.3 to -0.3) for ammoxetine 40 mg/d and -3.1 (97.3% CI, -6.2 to 0.0) for ammoxetine 60 mg/d. Consistent results were observed in the per-protocol set analysis at week 8 for ammoxetine 40 mg/d (LS mean change, -3.2; 97.3% CI, -6.2 to -0.2) and ammoxetine 60 mg/d (LS mean change, -3.18; 97.3% CI, -6.2 to -0.2), both superior to placebo. Treatment-emergent adverse events were reported in 68 participants (85.0%) receiving ammoxetine 60 mg/d, 63 (78.8%) receiving ammoxetine 40 mg/d, and 48 (60.8%) receiving placebo; most were mild to moderate in severity."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial demonstrated superiority over placebo of ammoxetine treatment at both 40 mg/d and 60 mg/d in patients with MDD. In addition, all doses of ammoxetine were generally well tolerated."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05762458."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982284/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamanetworkopen.2025.32650",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "Ammoxetine at both 40 mg/d and 60 mg/d was more effective than placebo in treating major depressive disorder and was generally well tolerated."
    },
    {
      "id": "310bf1b1a5cd",
      "title": "Candesartan versus placebo for migraine prevention in patients with episodic migraine: a randomised, triple-blind, placebo-controlled, phase 2 trial.",
      "journal": "Lancet Neurol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Neurology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117730",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false
    },
    {
      "id": "c5d2271c977c",
      "title": "Cognitive Behavioral Therapy for Insomnia in People With Chronic Disease: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117727",
      "abstract": "Insomnia is highly prevalent among individuals with chronic disease (eg, chronic pain, cardiovascular disease, and cancer) and results in poorer disease outcomes and quality of life. Cognitive behavioral therapy for insomnia (CBT-I) is recommended as first-line treatment for insomnia. However, concerns remain about its applicability and efficacy in people with chronic disease. To evaluate the nature, efficacy, and acceptability of CBT-I in adults with chronic disease, and to identify moderators of treatment outcomes. Systematic searches were conducted in PsycINFO, Medline, Embase, and CENTRAL from database inception to June 5, 2025. Additional records were identified from reference lists of relevant reviews and studies. Eligible studies were randomized clinical trials (RCTs) involving adults (aged ≥18 years) with chronic disease and insomnia. Studies using CBT-I with measured sleep outcomes were included. Two assessors extracted data from RCTs. Hedges g was used to calculate effect sizes, and random effects meta-analyses were conducted. Heterogeneity was assessed via I2. Subgroup analyses examined whether outcomes varied by delivery format, chronic condition type, or control group. Primary outcomes included insomnia severity, sleep efficiency, and sleep onset latency. Secondary outcomes included treatment acceptability and adverse effects. Sixty-seven RCTs (5232 participants) met inclusion criteria, including chronic diseases such as cancer, chronic pain, irritable bowel syndrome, and stroke. CBT-I was associated with significantly improved outcomes for insomnia severity (g = 0.98; 95% CI, 0.81-1.16) and moderate effect sizes regarding sleep efficiency (g = 0.77; 95% CI, 0.63-0.91) and sleep onset latency (g = 0.64; 95% CI, 0.50-0.78). Subgroup analyses revealed some sample, treatment, and methodological moderators (eg, longer treatment yielded better outcomes for sleep efficiency and sleep onset latency). Satisfaction with CBT-I was high, with a mean dropout rate of 13.3%. Treatment-related adverse effects were rare. This systematic review and meta-analysis showed that CBT-I demonstrated strong efficacy and acceptability in chronic disease populations, with moderate to large effect sizes that appear comparable to those in non-chronic disease populations. Efficacy of CBT-I was similar across a range of disease subgroups. Future research should explore the role and nature of treatment adaptations for specific populations and increase access to CBT-I in medical settings.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Insomnia is highly prevalent among individuals with chronic disease (eg, chronic pain, cardiovascular disease, and cancer) and results in poorer disease outcomes and quality of life. Cognitive behavioral therapy for insomnia (CBT-I) is recommended as first-line treatment for insomnia. However, concerns remain about its applicability and efficacy in people with chronic disease."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the nature, efficacy, and acceptability of CBT-I in adults with chronic disease, and to identify moderators of treatment outcomes."
        },
        {
          "label": "DATA SOURCES",
          "text": "Systematic searches were conducted in PsycINFO, Medline, Embase, and CENTRAL from database inception to June 5, 2025. Additional records were identified from reference lists of relevant reviews and studies."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Eligible studies were randomized clinical trials (RCTs) involving adults (aged ≥18 years) with chronic disease and insomnia. Studies using CBT-I with measured sleep outcomes were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two assessors extracted data from RCTs. Hedges g was used to calculate effect sizes, and random effects meta-analyses were conducted. Heterogeneity was assessed via I2. Subgroup analyses examined whether outcomes varied by delivery format, chronic condition type, or control group."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Primary outcomes included insomnia severity, sleep efficiency, and sleep onset latency. Secondary outcomes included treatment acceptability and adverse effects."
        },
        {
          "label": "RESULTS",
          "text": "Sixty-seven RCTs (5232 participants) met inclusion criteria, including chronic diseases such as cancer, chronic pain, irritable bowel syndrome, and stroke. CBT-I was associated with significantly improved outcomes for insomnia severity (g = 0.98; 95% CI, 0.81-1.16) and moderate effect sizes regarding sleep efficiency (g = 0.77; 95% CI, 0.63-0.91) and sleep onset latency (g = 0.64; 95% CI, 0.50-0.78). Subgroup analyses revealed some sample, treatment, and methodological moderators (eg, longer treatment yielded better outcomes for sleep efficiency and sleep onset latency). Satisfaction with CBT-I was high, with a mean dropout rate of 13.3%. Treatment-related adverse effects were rare."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review and meta-analysis showed that CBT-I demonstrated strong efficacy and acceptability in chronic disease populations, with moderate to large effect sizes that appear comparable to those in non-chronic disease populations. Efficacy of CBT-I was similar across a range of disease subgroups. Future research should explore the role and nature of treatment adaptations for specific populations and increase access to CBT-I in medical settings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982264/",
      "pubDate": "2025 Sep 22",
      "doi": "10.1001/jamainternmed.2025.4610",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "Cognitive Behavioral Therapy for Insomnia (CBT-I) is an effective and well-tolerated treatment for insomnia in people with chronic diseases, showing similar effectiveness to those without chronic diseases."
    },
    {
      "id": "0059b4e592ed",
      "title": "Permethrin-Treated Baby Wraps for the Prevention of Malaria.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117718",
      "abstract": "Malaria remains a major cause of childhood death in sub-Saharan Africa. We leveraged the traditional practice of mothers carrying children on their backs in cloth wraps to assess whether treating the wraps with an insect repellent might provide a layer of protection against malaria. In a double-blind, randomized, placebo-controlled trial conducted in Uganda, we enrolled adult women with a child who was 6 to 18 months of age. The mother-child pairs were randomly assigned in a 1:1 ratio to use permethrin-treated wraps (intervention group) or sham-treated wraps (control group). The wraps underwent retreatment every 4 weeks. All the participants received a new, pyrethroid-only long-lasting insecticide-treated bed net. The participants visited the trial clinics every 2 weeks for 24 weeks and made unscheduled visits in the case of febrile illness in the children. The primary outcome was clinical malaria in the children, as defined by fever and a positive malaria rapid diagnostic test. From June 2022 through April 2024, a total of 419 mother-child pairs were screened, and 400 underwent randomization; 200 pairs were assigned to the intervention group and 200 to the control group. Clinic attendance was high (5194 of 5200 planned visits [99.9%] were attended), and no participants were lost to follow-up. The incidence rate of clinical malaria was 0.73 cases per 100 person-weeks (95% confidence interval [CI], 0.51 to 1.02) in the intervention group and 2.14 cases per 100 person-weeks (95% CI, 1.73 to 2.62) in the control group (incidence rate ratio, 0.34; 95% CI, 0.23 to 0.51; P<0.001). Rash was reported more often in the intervention group than in the control group (8.5% vs. 6.0% of participants). Among mother-child pairs who had access to bed nets, maternal use of permethrin-treated baby wraps significantly reduced the incidence of clinical malaria in the children. (Funded by the Doris Duke Foundation and others; ClinicalTrials.gov number, NCT05391230.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Malaria remains a major cause of childhood death in sub-Saharan Africa. We leveraged the traditional practice of mothers carrying children on their backs in cloth wraps to assess whether treating the wraps with an insect repellent might provide a layer of protection against malaria."
        },
        {
          "label": "METHODS",
          "text": "In a double-blind, randomized, placebo-controlled trial conducted in Uganda, we enrolled adult women with a child who was 6 to 18 months of age. The mother-child pairs were randomly assigned in a 1:1 ratio to use permethrin-treated wraps (intervention group) or sham-treated wraps (control group). The wraps underwent retreatment every 4 weeks. All the participants received a new, pyrethroid-only long-lasting insecticide-treated bed net. The participants visited the trial clinics every 2 weeks for 24 weeks and made unscheduled visits in the case of febrile illness in the children. The primary outcome was clinical malaria in the children, as defined by fever and a positive malaria rapid diagnostic test."
        },
        {
          "label": "RESULTS",
          "text": "From June 2022 through April 2024, a total of 419 mother-child pairs were screened, and 400 underwent randomization; 200 pairs were assigned to the intervention group and 200 to the control group. Clinic attendance was high (5194 of 5200 planned visits [99.9%] were attended), and no participants were lost to follow-up. The incidence rate of clinical malaria was 0.73 cases per 100 person-weeks (95% confidence interval [CI], 0.51 to 1.02) in the intervention group and 2.14 cases per 100 person-weeks (95% CI, 1.73 to 2.62) in the control group (incidence rate ratio, 0.34; 95% CI, 0.23 to 0.51; P<0.001). Rash was reported more often in the intervention group than in the control group (8.5% vs. 6.0% of participants)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among mother-child pairs who had access to bed nets, maternal use of permethrin-treated baby wraps significantly reduced the incidence of clinical malaria in the children. (Funded by the Doris Duke Foundation and others; ClinicalTrials.gov number, NCT05391230.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40991921/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1056/NEJMoa2501628",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "In mother-child pairs with bed net access, using permethrin-treated baby wraps by the mothers decreased the occurrence of malaria in their children."
    },
    {
      "id": "f2b87f1d9f81",
      "title": "Computed Tomography Angiography or Standard Care After Left Main PCI?.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117654",
      "abstract": "The clinical benefit of routine coronary computed tomography angiography (CCTA) after percutaneous coronary intervention (PCI) for unprotected left main (LM) disease is uncertain. The authors evaluated whether CCTA-guided follow-up improves clinical outcomes vs symptoms- or ischemia-driven care after LM PCI. PULSE was a prospective, multicenter, open-label randomized trial. A total of 606 patients treated with second-generation drug-eluting stents were enrolled (October 2019 to September 2024) and randomized 1:1 to CCTA at 6 months (experimental) or standard care (control). The primary endpoint was a composite of all-cause death, spontaneous myocardial infarction (MI), unstable angina, or definite or probable stent thrombosis at 18 months. Secondary endpoints included target-lesion revascularization (TLR) and each primary endpoint component. CCTA was completed in 272/303 experimental patients (89.8%) after a median of 200 days (IQR: 181-270 days). The primary endpoint occurred in 36/303 experimental patients vs 38/303 control patients (11.9% vs 12.5%; HR: 0.97; 95% CI: 0.76-1.23; P = 0.80). Compared with the control arm, the CCTA arm showed a reduced risk of spontaneous MI (0.9% vs 4.9%; HR: 0.26; 95% CI: 0.07-0.91; P = 0.004) and an increased risk of imaging-triggered TLR (4.9% vs 0.3%; HR: 7.7; 95% CI: 1.70-33.7; P = 0.001), whereas clinically driven TLR rates were similar (5.3% vs 7.2%; HR: 0.74; 95% CI: 0.38-1.41; P = 0.32). Routine CCTA after LM PCI did not reduce the composite primary endpoint, but was associated with fewer spontaneous MIs and more imaging-triggered revascularizations. Future trials to clarify its value in complex anatomic subsets appear to be warranted. (Angiographic Control vs Ischemia-Driven Management of Patients Treated With PCI on Left Main With Drug-Eluting Stents [PULSE; NCT04144881]).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The clinical benefit of routine coronary computed tomography angiography (CCTA) after percutaneous coronary intervention (PCI) for unprotected left main (LM) disease is uncertain."
        },
        {
          "label": "OBJECTIVES",
          "text": "The authors evaluated whether CCTA-guided follow-up improves clinical outcomes vs symptoms- or ischemia-driven care after LM PCI."
        },
        {
          "label": "METHODS",
          "text": "PULSE was a prospective, multicenter, open-label randomized trial. A total of 606 patients treated with second-generation drug-eluting stents were enrolled (October 2019 to September 2024) and randomized 1:1 to CCTA at 6 months (experimental) or standard care (control). The primary endpoint was a composite of all-cause death, spontaneous myocardial infarction (MI), unstable angina, or definite or probable stent thrombosis at 18 months. Secondary endpoints included target-lesion revascularization (TLR) and each primary endpoint component."
        },
        {
          "label": "RESULTS",
          "text": "CCTA was completed in 272/303 experimental patients (89.8%) after a median of 200 days (IQR: 181-270 days). The primary endpoint occurred in 36/303 experimental patients vs 38/303 control patients (11.9% vs 12.5%; HR: 0.97; 95% CI: 0.76-1.23; P = 0.80). Compared with the control arm, the CCTA arm showed a reduced risk of spontaneous MI (0.9% vs 4.9%; HR: 0.26; 95% CI: 0.07-0.91; P = 0.004) and an increased risk of imaging-triggered TLR (4.9% vs 0.3%; HR: 7.7; 95% CI: 1.70-33.7; P = 0.001), whereas clinically driven TLR rates were similar (5.3% vs 7.2%; HR: 0.74; 95% CI: 0.38-1.41; P = 0.32)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Routine CCTA after LM PCI did not reduce the composite primary endpoint, but was associated with fewer spontaneous MIs and more imaging-triggered revascularizations. Future trials to clarify its value in complex anatomic subsets appear to be warranted. (Angiographic Control vs Ischemia-Driven Management of Patients Treated With PCI on Left Main With Drug-Eluting Stents [PULSE; NCT04144881])."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886174/",
      "pubDate": "2025 Aug 26",
      "doi": "10.1016/j.jacc.2025.07.060",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "Routine CCTA after left main PCI did not improve the primary outcome but led to fewer spontaneous heart attacks and more revascularizations prompted by imaging."
    },
    {
      "id": "ad5cfed2eb2f",
      "title": "Evidence for improved glucose metrics and perinatal outcomes with continuous glucose monitoring compared to self-monitoring in diabetes during pregnancy.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117644",
      "abstract": "Continuous glucose monitoring is recommended for pregnant women with type 1 diabetes, due to associations with decreased hemoglobin A1c and large for gestational age. However, its benefit in type 2 diabetes and gestational diabetes is not established. This systematic review and meta-analysis compared usage of continuous glucose monitoring to self-monitoring of blood glucose both across and within diabetes in pregnancy and determined which glucose metrics are associated with perinatal outcomes, to potentially inform treatment targets in diabetes in pregnancy. We searched Medline, Embase, CENTRAL, CINAHL, and Scopus, from January 2003 to August 2024. Randomized controlled trials and quasi-experimental studies comparing continuous glucose monitoring with self-monitoring of blood glucose in diabetes in pregnancy were included. Randomized controlled trials and quasi-experimental studies were analyzed separately. Data were extracted on continuous glucose monitoring metrics, hemoglobin A1c, rates of cesarean delivery, large for gestational age, small for gestational age, neonatal hypoglycemia, and neonatal intensive care unit admission, summarized as mean differences or odds ratios with 95% confidence intervals and 95% prediction intervals. Prespecified subgroup analyses were undertaken by diabetes in pregnancy subtype, including duration of continuous glucose monitoring use (continuous vs intermittent) for large for gestational age. Certainty of evidence was assessed using the Grading of Recommendations, Assessment, Development, and Evaluations framework. Across diabetes in pregnancy, continuous glucose monitoring (vs self-monitoring of blood glucose) decreased hemoglobin A1c (mean difference, -0.22% [95% confidence interval, -0.37, -0.08]) (7 randomized controlled trials, moderate-certainty evidence). Within diabetes in pregnancy, continuous glucose monitoring use (vs self-monitoring of blood glucose) showed similar but stronger benefits in both type 1 diabetes when used throughout pregnancy (hemoglobin A1c mean difference, -0.18% [95% confidence interval, -0.36, 0.00]; large for gestational age odds ratio, 0.51 [0.28, 0.90]) (1 randomized controlled trial, high-certainty evidence), and gestational diabetes when used intermittently (hemoglobin A1c mean difference, -0.18 [95% confidence interval, -0.33, -0.02]) (5 randomized controlled trials, moderate-certainty evidence) and large for gestational age (odds ratio, 0.46 [0.26, 0.81]) (1 quasi-experimental study, low-certainty evidence), with insufficient data for continuous glucose monitoring benefit in type 2 diabetes. Increased pregnancy %time-in-range (type 1 diabetes) and decreased mean sensor glucose (type 1 diabetes/gestational diabetes) were associated with decreased large for gestational age. Usage of continuous glucose monitoring (vs self-monitoring of blood glucose) reduces hemoglobin A1c and possibly large for gestational age across diabetes in pregnancy. Greatest benefit was evidenced in type 1 diabetes, followed by gestational diabetes, although continuous glucose monitoring duration differed. Mean sensor glucose and pregnancy %time-in-range are important continuous glucose monitoring metrics for reducing large for gestational age.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Continuous glucose monitoring is recommended for pregnant women with type 1 diabetes, due to associations with decreased hemoglobin A1c and large for gestational age. However, its benefit in type 2 diabetes and gestational diabetes is not established. This systematic review and meta-analysis compared usage of continuous glucose monitoring to self-monitoring of blood glucose both across and within diabetes in pregnancy and determined which glucose metrics are associated with perinatal outcomes, to potentially inform treatment targets in diabetes in pregnancy."
        },
        {
          "label": "DATA SOURCES",
          "text": "We searched Medline, Embase, CENTRAL, CINAHL, and Scopus, from January 2003 to August 2024."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Randomized controlled trials and quasi-experimental studies comparing continuous glucose monitoring with self-monitoring of blood glucose in diabetes in pregnancy were included."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Randomized controlled trials and quasi-experimental studies were analyzed separately. Data were extracted on continuous glucose monitoring metrics, hemoglobin A1c, rates of cesarean delivery, large for gestational age, small for gestational age, neonatal hypoglycemia, and neonatal intensive care unit admission, summarized as mean differences or odds ratios with 95% confidence intervals and 95% prediction intervals. Prespecified subgroup analyses were undertaken by diabetes in pregnancy subtype, including duration of continuous glucose monitoring use (continuous vs intermittent) for large for gestational age. Certainty of evidence was assessed using the Grading of Recommendations, Assessment, Development, and Evaluations framework."
        },
        {
          "label": "RESULTS",
          "text": "Across diabetes in pregnancy, continuous glucose monitoring (vs self-monitoring of blood glucose) decreased hemoglobin A1c (mean difference, -0.22% [95% confidence interval, -0.37, -0.08]) (7 randomized controlled trials, moderate-certainty evidence). Within diabetes in pregnancy, continuous glucose monitoring use (vs self-monitoring of blood glucose) showed similar but stronger benefits in both type 1 diabetes when used throughout pregnancy (hemoglobin A1c mean difference, -0.18% [95% confidence interval, -0.36, 0.00]; large for gestational age odds ratio, 0.51 [0.28, 0.90]) (1 randomized controlled trial, high-certainty evidence), and gestational diabetes when used intermittently (hemoglobin A1c mean difference, -0.18 [95% confidence interval, -0.33, -0.02]) (5 randomized controlled trials, moderate-certainty evidence) and large for gestational age (odds ratio, 0.46 [0.26, 0.81]) (1 quasi-experimental study, low-certainty evidence), with insufficient data for continuous glucose monitoring benefit in type 2 diabetes. Increased pregnancy %time-in-range (type 1 diabetes) and decreased mean sensor glucose (type 1 diabetes/gestational diabetes) were associated with decreased large for gestational age."
        },
        {
          "label": "CONCLUSION",
          "text": "Usage of continuous glucose monitoring (vs self-monitoring of blood glucose) reduces hemoglobin A1c and possibly large for gestational age across diabetes in pregnancy. Greatest benefit was evidenced in type 1 diabetes, followed by gestational diabetes, although continuous glucose monitoring duration differed. Mean sensor glucose and pregnancy %time-in-range are important continuous glucose monitoring metrics for reducing large for gestational age."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40216177/",
      "pubDate": "2025 Sep",
      "doi": "10.1016/j.ajog.2025.04.010",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "Continuous glucose monitoring improves glycemic control and may reduce large for gestational age infants in pregnant individuals with diabetes, with the greatest benefit seen in type 1 diabetes."
    },
    {
      "id": "4c06bf84a5fd",
      "title": "High-Dose vs Standard-Dose Influenza Vaccine and Cardiovascular Outcomes in Older Adults: A Prespecified Secondary Analysis of the DANFLU-2 Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117638",
      "abstract": "The high-dose inactivated influenza vaccine (HD-IIV) has demonstrated superior protection against laboratory-confirmed influenza infection vs standard-dose IIV (SD-IIV); however, data regarding its effectiveness against cardiovascular (CV) outcomes are mainly from observational studies or specific high-risk groups. To investigate the relative vaccine effectiveness (rVE) of HD-IIV vs SD-IIV against CV outcomes in the general older adult population in Denmark. This was a prespecified secondary analysis of DANFLU-2, a pragmatic, open-label, individually randomized clinical trial (RCT) using nationwide administrative health registries in Denmark during the 2022/2023 to 2024/2025 influenza seasons. Older adults (age ≥65 years) were eligible for inclusion regardless of comorbidity. The trial design specified that if the primary end point was neutral, no hypothesis testing would be performed for secondary or exploratory end points. Data were analyzed from June 29 to August 12, 2025. Individual-level 1:1 randomization to HD-IIV or SD-IIV. Participants re-enrolling in additional seasons were rerandomized. Severe CV outcomes were prespecified secondary and exploratory end points in the trial, occurring from 14 days after vaccination through May 31 the following year. A total of 332 438 participants (170 900 [51.4%] male; mean [SD] age, 73.7 [5.8] years) were randomized (166 218 to HD-IIV and 166 220 to SD-IIV), of whom 91 026 (27.4%) had a history of CV disease. HD-IIV did not significantly reduce the trial's primary end point of hospitalization for influenza or pneumonia. The incidence of hospitalization for any cardiorespiratory disease was lower in the HD-IIV group than the SD-IIV group (rVE, 5.7% [95% CI, 1.4% to 9.9%]; absolute difference, -0.13 [95% CI, -0.24 to -0.03] percentage points), and rVE did not differ by history of CV disease compared with no CV disease at baseline. Hospitalization for any CV disease occurred in fewer participants in the HD-IIV group than the SD-IIV group (rVE, 7.5% [95% CI, 1.5% to 12.5%]; absolute difference, -0.10 [95% CI, -0.18 to -0.02] percentage points) as did hospitalization for heart failure (rVE, 19.5% [95% CI, 3.3% to 33.1%]; absolute difference, -0.03 [95% CI, -0.06 to -0.01] percentage points). This study found reduced incidence of cardiorespiratory hospitalization among those who received HD-IIV vs SD-IIV, driven by a lower incidence of CV hospitalizations, and particularly heart failure hospitalizations. These differences should be interpreted as exploratory findings in the setting of a large RCT with a neutral primary outcome. ClinicalTrials.gov Identifier: NCT05517174.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The high-dose inactivated influenza vaccine (HD-IIV) has demonstrated superior protection against laboratory-confirmed influenza infection vs standard-dose IIV (SD-IIV); however, data regarding its effectiveness against cardiovascular (CV) outcomes are mainly from observational studies or specific high-risk groups."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate the relative vaccine effectiveness (rVE) of HD-IIV vs SD-IIV against CV outcomes in the general older adult population in Denmark."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a prespecified secondary analysis of DANFLU-2, a pragmatic, open-label, individually randomized clinical trial (RCT) using nationwide administrative health registries in Denmark during the 2022/2023 to 2024/2025 influenza seasons. Older adults (age ≥65 years) were eligible for inclusion regardless of comorbidity. The trial design specified that if the primary end point was neutral, no hypothesis testing would be performed for secondary or exploratory end points. Data were analyzed from June 29 to August 12, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Individual-level 1:1 randomization to HD-IIV or SD-IIV. Participants re-enrolling in additional seasons were rerandomized."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Severe CV outcomes were prespecified secondary and exploratory end points in the trial, occurring from 14 days after vaccination through May 31 the following year."
        },
        {
          "label": "RESULTS",
          "text": "A total of 332 438 participants (170 900 [51.4%] male; mean [SD] age, 73.7 [5.8] years) were randomized (166 218 to HD-IIV and 166 220 to SD-IIV), of whom 91 026 (27.4%) had a history of CV disease. HD-IIV did not significantly reduce the trial's primary end point of hospitalization for influenza or pneumonia. The incidence of hospitalization for any cardiorespiratory disease was lower in the HD-IIV group than the SD-IIV group (rVE, 5.7% [95% CI, 1.4% to 9.9%]; absolute difference, -0.13 [95% CI, -0.24 to -0.03] percentage points), and rVE did not differ by history of CV disease compared with no CV disease at baseline. Hospitalization for any CV disease occurred in fewer participants in the HD-IIV group than the SD-IIV group (rVE, 7.5% [95% CI, 1.5% to 12.5%]; absolute difference, -0.10 [95% CI, -0.18 to -0.02] percentage points) as did hospitalization for heart failure (rVE, 19.5% [95% CI, 3.3% to 33.1%]; absolute difference, -0.03 [95% CI, -0.06 to -0.01] percentage points)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This study found reduced incidence of cardiorespiratory hospitalization among those who received HD-IIV vs SD-IIV, driven by a lower incidence of CV hospitalizations, and particularly heart failure hospitalizations. These differences should be interpreted as exploratory findings in the setting of a large RCT with a neutral primary outcome."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05517174."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884442/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1001/jamacardio.2025.3460",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "High-dose influenza vaccine (HD-IIV) was associated with fewer cardiorespiratory hospitalizations, especially for heart failure, compared to standard-dose influenza vaccine (SD-IIV)."
    },
    {
      "id": "5d0ee66703e7",
      "title": "Automated Insulin Delivery Systems and Glucose Management in Children and Adolescents With Type 1 Diabetes: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Pediatr",
      "score": "5/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117622",
      "abstract": "Youth living with type 1 diabetes (T1D) are increasingly choosing automated insulin delivery (AID) systems to manage their blood glucose. Few systematic reviews meta-analyzing results from randomized clinical trials (RCTs) are available to guide decision-making. To study the association of prolonged AID system use in an outpatient setting with measures of glucose management and quality of life in youth with T1D. MEDLINE, Embase, CINAHL, and Cochrane Central were searched from January 2017 to March 2025 to identify eligible RCTs. Two reviewers independently performed literature screening, data extraction, and quality assessment. Included in the analysis were RCTs of youth aged 6 to 18 years with T1D that assessed the efficacy of AID systems in outpatient settings longer than 48 hours compared with any other insulin regimen. Two reviewers performed data extraction and quality assessment independently and reported using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) and PRISMA literature search extension guidelines. Random-effects meta-analysis models were used to estimate the pooled measures of efficacy as a mean difference (MD) with 95% CIs for outcomes measures. The 2 primary outcome measures were time in range (TIR) and glycated hemoglobin (HbA1c). Of 2363 citations retrieved, 11 RCTs (n = 901 participants) with measures of HbA1c and 10 RCTs (n = 786 participants) with measures of TIR were included. RCTs tested interventions lasting a mean (SD) of 31 (26) weeks on youth with a median age of 12 years (range, 10.8-15.9 years); 51% were female, mean (SD) HbA1c level was 8.4% (1.1%), and mean (SD) TIR was 51% (9%). Random-effects models revealed that, compared with any insulin regimen, HbA1c level was reduced -0.41% (95% CI, -0.58% to -0.25%; I2 = 39%), whereas TIR increased 11.5% (95% CI, 9.3%-13.7%; I2 = 23%) with nighttime TIR increasing 19.7% (95% CI, 17.0%-22.4%; I2 = 36%). Random-effects models also revealed that AID use was associated with reduced time spent in hypoglycemia (<3.9 mml/L; MD = -0.32%; 95% CI, -0.60% to -0.03%; I2 = 18%) and hyperglycemia (>10 mmol/L; MD = -10.8%; 95% CI, -14.4% to -7.2%; I2 = 55%), particularly during the night (MD = -14.4%; 95% CI, -19.9% to -8.9%; I2 = 79%) compared with any insulin regimen. There were no differences in adverse events between study arms. Only 2 studies reported changes in QOL. This systematic review and meta-analysis found that compared with any other insulin regimen, use of AID systems by youth with T1D was associated with clinically meaningful improvements in multiple measures of glucose management, including the risk of both hyperglycemia and hypoglycemia, without increasing the risk of adverse events. More data are needed on the efficacy of AID systems on patient report outcomes.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Youth living with type 1 diabetes (T1D) are increasingly choosing automated insulin delivery (AID) systems to manage their blood glucose. Few systematic reviews meta-analyzing results from randomized clinical trials (RCTs) are available to guide decision-making."
        },
        {
          "label": "OBJECTIVE",
          "text": "To study the association of prolonged AID system use in an outpatient setting with measures of glucose management and quality of life in youth with T1D."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, CINAHL, and Cochrane Central were searched from January 2017 to March 2025 to identify eligible RCTs."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Two reviewers independently performed literature screening, data extraction, and quality assessment. Included in the analysis were RCTs of youth aged 6 to 18 years with T1D that assessed the efficacy of AID systems in outpatient settings longer than 48 hours compared with any other insulin regimen."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers performed data extraction and quality assessment independently and reported using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) and PRISMA literature search extension guidelines. Random-effects meta-analysis models were used to estimate the pooled measures of efficacy as a mean difference (MD) with 95% CIs for outcomes measures."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The 2 primary outcome measures were time in range (TIR) and glycated hemoglobin (HbA1c)."
        },
        {
          "label": "RESULTS",
          "text": "Of 2363 citations retrieved, 11 RCTs (n = 901 participants) with measures of HbA1c and 10 RCTs (n = 786 participants) with measures of TIR were included. RCTs tested interventions lasting a mean (SD) of 31 (26) weeks on youth with a median age of 12 years (range, 10.8-15.9 years); 51% were female, mean (SD) HbA1c level was 8.4% (1.1%), and mean (SD) TIR was 51% (9%). Random-effects models revealed that, compared with any insulin regimen, HbA1c level was reduced -0.41% (95% CI, -0.58% to -0.25%; I2 = 39%), whereas TIR increased 11.5% (95% CI, 9.3%-13.7%; I2 = 23%) with nighttime TIR increasing 19.7% (95% CI, 17.0%-22.4%; I2 = 36%). Random-effects models also revealed that AID use was associated with reduced time spent in hypoglycemia (<3.9 mml/L; MD = -0.32%; 95% CI, -0.60% to -0.03%; I2 = 18%) and hyperglycemia (>10 mmol/L; MD = -10.8%; 95% CI, -14.4% to -7.2%; I2 = 55%), particularly during the night (MD = -14.4%; 95% CI, -19.9% to -8.9%; I2 = 79%) compared with any insulin regimen. There were no differences in adverse events between study arms. Only 2 studies reported changes in QOL."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This systematic review and meta-analysis found that compared with any other insulin regimen, use of AID systems by youth with T1D was associated with clinically meaningful improvements in multiple measures of glucose management, including the risk of both hyperglycemia and hypoglycemia, without increasing the risk of adverse events. More data are needed on the efficacy of AID systems on patient report outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40920375/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1001/jamapediatrics.2025.2740",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false,
      "summary": "Automated insulin delivery (AID) systems in youth with type 1 diabetes improved glucose management, including reducing hyperglycemia and hypoglycemia, without increasing adverse events."
    },
    {
      "id": "90b39ded809a",
      "title": "Efficacy of pulsed radiofrequency treatment duration to the lumbar dorsal root ganglion in lumbar radicular pain: a double-blind randomized controlled trial.",
      "journal": "Reg Anesth Pain Med",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48351289/117621",
      "dateReceived": "2025-10-02T23:21:47.731Z",
      "isNew": false
    },
    {
      "id": "9761e06ff1c6",
      "title": "Effect of hyperangulated videolaryngoscopy on first-attempt success in tracheal intubations: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117697",
      "abstract": "To determine whether hyperangulated videolaryngoscopy (HAVL) improves first-attempt success (FAS) in adult orotracheal intubations compared to standard-geometry videolaryngoscopy (SGVL), with a focus on emergency settings. We conducted a systematic review and meta-analysis of randomized controlled trials (RCTs) and comparative observational studies evaluating HAVL versus SGVL in adult tracheal intubations. Comprehensive searches were performed in Ovid MEDLINE, Embase, Cochrane, Scopus, and web of science from inception through November 2024. Risk of bias was assessed using RoB2 and Newcastle-Ottawa tools, and certainty of evidence was rated using GRADE. Both emergency and operating room intubations were included; most emergency data derived from large cohort studies. Of 4445 screened records, 25 studies (17 RCTs, 8 observational; 38,597 patients) were included. HAVL was associated with lower FAS overall (87.2 % vs 91.0 %; pooled RR 0.96, 95 % CI 0.94-0.99; p = 0.002). In emergency intubations (8 studies; n = 34,927), HAVL yielded reduced FAS (RR 0.97, 95 % CI 0.95-0.99; p = 0.003). There was no significant difference in difficult airways (RR 0.98, 95 % CI 0.92-1.05; p = 0.57). HAVL was linked to higher rates of airway trauma (7.5 % vs 2.9 %; RR 1.88, 95 % CI 1.01-3.49; p = 0.046) and numerically more adverse events. Certainty of evidence was low due to risk of bias and heterogeneity. In emergency intubations, HAVL was associated with lower first-attempt success and increased airway trauma compared to SGVL. These findings support prioritizing SGVL for emergency airway management, with careful operator training if HAVL is used.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To determine whether hyperangulated videolaryngoscopy (HAVL) improves first-attempt success (FAS) in adult orotracheal intubations compared to standard-geometry videolaryngoscopy (SGVL), with a focus on emergency settings."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review and meta-analysis of randomized controlled trials (RCTs) and comparative observational studies evaluating HAVL versus SGVL in adult tracheal intubations. Comprehensive searches were performed in Ovid MEDLINE, Embase, Cochrane, Scopus, and web of science from inception through November 2024. Risk of bias was assessed using RoB2 and Newcastle-Ottawa tools, and certainty of evidence was rated using GRADE. Both emergency and operating room intubations were included; most emergency data derived from large cohort studies."
        },
        {
          "label": "RESULTS",
          "text": "Of 4445 screened records, 25 studies (17 RCTs, 8 observational; 38,597 patients) were included. HAVL was associated with lower FAS overall (87.2 % vs 91.0 %; pooled RR 0.96, 95 % CI 0.94-0.99; p = 0.002). In emergency intubations (8 studies; n = 34,927), HAVL yielded reduced FAS (RR 0.97, 95 % CI 0.95-0.99; p = 0.003). There was no significant difference in difficult airways (RR 0.98, 95 % CI 0.92-1.05; p = 0.57). HAVL was linked to higher rates of airway trauma (7.5 % vs 2.9 %; RR 1.88, 95 % CI 1.01-3.49; p = 0.046) and numerically more adverse events. Certainty of evidence was low due to risk of bias and heterogeneity."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In emergency intubations, HAVL was associated with lower first-attempt success and increased airway trauma compared to SGVL. These findings support prioritizing SGVL for emergency airway management, with careful operator training if HAVL is used."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40939241/",
      "pubDate": "2025 Aug 28",
      "doi": "10.1016/j.ajem.2025.08.044",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Supraglottic video laryngoscopy (SGVL) is preferred over hyperangulated video laryngoscopy (HAVL) for emergency intubations due to higher first-attempt success and less airway trauma."
    },
    {
      "id": "64fd3e16cc0a",
      "title": "Comparative efficacy and safety of Glucagon-like pepetide-1 receptor agonists with metformin in Asian versus non-Asian patients with type 2 diabetes: A systematic review and meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117670",
      "abstract": "In type 2 diabetes, glucagon-like peptide-1 receptor agonists (GLP-1RAs) in combination with metformin show better efficacy than metformin alone. Nevertheless, the reactions of different ethnic groups, especially Asian and non-Asian populations, are still controversial. To give clinical medication usage an evidence-based foundation, this meta-analysis examined GLP-1RAs' safety and efficacy when combined with metformin in the treatment of type 2 diabetes mellitus. Up to January 2025, systematic searches for randomised controlled trials were carried out in PubMed, Embase, the Cochrane Library, SinoMed and Wanfang comparing GLP-1RA/metformin combination versus metformin alone in type 2 diabetes, with subgroup analyses for Asian versus non-Asian cohorts. RevMan version 5.3 was used for analyses, and the Cochrane tools for risk of bias were used for quality assessment. This meta-analysis comprised 11 papers in total (6 Asian trials: 750 people; 5 non-Asian trials: 1096 people). After treatment of GLP-1RAs combined with metformin, the Asian group showed greater improvement in glycosylated haemoglobin (HbA1c) (weighted mean differences [WMD], -1.09; 95% confidence intervals [CI], -1.48 to -0.71; subgroup heterogeneity: I = 77.7%, p < 0.05) and weight (WMD, -4.16; 95% CI -6.11 to -2.22; subgroup heterogeneity: I = 89.5%, p < 0.05) with a lower gastrointestinal (GI) events risk (relative risks, 0.76; 95% CI, 0.47 to 1.22; subgroup heterogeneity: I = 93.7%, p < 0.00001). There were no racial variations in fasting glucose levels (p = 0.78) or hypoglycaemia (p = 0.16). This meta-analysis suggested potential ethnic variations in the treatment combining GLP-1RAs with metformin, with Asian populations achieving superior HbA1c reduction and weight loss alongside better GI tolerance.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "In type 2 diabetes, glucagon-like peptide-1 receptor agonists (GLP-1RAs) in combination with metformin show better efficacy than metformin alone. Nevertheless, the reactions of different ethnic groups, especially Asian and non-Asian populations, are still controversial. To give clinical medication usage an evidence-based foundation, this meta-analysis examined GLP-1RAs' safety and efficacy when combined with metformin in the treatment of type 2 diabetes mellitus."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "Up to January 2025, systematic searches for randomised controlled trials were carried out in PubMed, Embase, the Cochrane Library, SinoMed and Wanfang comparing GLP-1RA/metformin combination versus metformin alone in type 2 diabetes, with subgroup analyses for Asian versus non-Asian cohorts. RevMan version 5.3 was used for analyses, and the Cochrane tools for risk of bias were used for quality assessment."
        },
        {
          "label": "RESULTS",
          "text": "This meta-analysis comprised 11 papers in total (6 Asian trials: 750 people; 5 non-Asian trials: 1096 people). After treatment of GLP-1RAs combined with metformin, the Asian group showed greater improvement in glycosylated haemoglobin (HbA1c) (weighted mean differences [WMD], -1.09; 95% confidence intervals [CI], -1.48 to -0.71; subgroup heterogeneity: I = 77.7%, p < 0.05) and weight (WMD, -4.16; 95% CI -6.11 to -2.22; subgroup heterogeneity: I = 89.5%, p < 0.05) with a lower gastrointestinal (GI) events risk (relative risks, 0.76; 95% CI, 0.47 to 1.22; subgroup heterogeneity: I = 93.7%, p < 0.00001). There were no racial variations in fasting glucose levels (p = 0.78) or hypoglycaemia (p = 0.16)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This meta-analysis suggested potential ethnic variations in the treatment combining GLP-1RAs with metformin, with Asian populations achieving superior HbA1c reduction and weight loss alongside better GI tolerance."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40936218/",
      "pubDate": "2025 Sep 11",
      "doi": "10.1111/dom.70084",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Asian populations may experience greater HbA1c reduction, weight loss, and improved gastrointestinal tolerance when treated with GLP-1RAs and metformin compared to other ethnicities."
    },
    {
      "id": "410ace1e105e",
      "title": "Efficacy and Safety of GLP-1 RAs in Children and Adolescents With Obesity or Type 2 Diabetes: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117667",
      "abstract": "Obesity affects 1 in 5 children and adolescents, increasing the risk of type 2 diabetes (T2D). Glucagon-like peptide-1 receptor agonists (GLP-1 RAs) are among the few pharmacotherapy options available for this population, necessitating a comprehensive evaluation of efficacy and safety. To assess the efficacy and safety of GLP-1 RAs in children and adolescents (<18 years) with obesity, prediabetes, or T2D. A systematic search was conducted in PubMed, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) for randomized clinical trials (RCTs) published from inception until February 28, 2025. Data analysis was completed from January 2025 to April 2025. RCTs comparing GLP-1 RAs to placebo in children and adolescents with obesity, overweight, prediabetes, or T2D with reported safety and efficacy data were included. Two reviewers independently extracted data on sample size, population, interventions, follow-up, and outcomes. Risk of bias was assessed using version 2 of the Cochrane risk of bias tool (RoB2). Efficacy outcomes (except lipids) were analyzed as estimated treatment differences, lipids as estimated treatment ratios, and safety via rate ratios. A random-effects inverse variance model was used for all outcomes. The primary efficacy outcomes were change in hemoglobin A1c (HbA1c) (in percentage points), fasting glucose (in milligrams per deciliter), body weight (in kilograms), body mass index (BMI, calculated as weight in kilograms divided by height in meters squared), BMI z scores or percentiles, BMI standard deviation score (SDS), lipid outcomes, and blood pressure. Exploratory efficacy outcomes included obstructive sleep apnea and metabolic dysfunction-associated steatohepatitis or metabolic dysfunction-associated steatotic liver disease. Safety outcomes included gastrointestinal adverse effects (GI AEs), infections, hepatobiliary disorders, suicidal ideation or behaviors, depression, hypoglycemia, and adverse event discontinuations. A total of 18 RCTs (11 in obesity, 6 in T2D, and 1 in prediabetes) with 1402 participants (838 GLP-1 RA users and 564 placebo) were included (mean [range] age, 13.7 [6-17] years; 831 female participants (59.3%); median [IQR] treatment duration, 0.51 [0.25-1.00] years). GLP-1 RAs significantly reduced HbA1c (-0.44%; 95% CI, -0.68% to -0.21%), fasting glucose (-9.92 mg/dL; 95% CI, -16.20 to -3.64), body weight (-3.02 kg; 95% CI, -4.98 to -1.06), BMI (-1.45; 95% CI, -2.40 to -0.49), BMI SDS (-0.20; 95% CI, -0.36 to -0.05), BMI percentile (-7.24%; 95% CI, -12.97% to -1.51%), and systolic blood pressure (-2.73 mm Hg; 95% CI, -4.04 to -1.43) and increased GI AE (log[rate ratio] [RR], 0.75). Other AEs, including suicidal ideation or behaviors, showed no significant differences. In this systematic review and meta-analysis of 18 trials, GLP-1 RAs significantly improved glycemic, weight, and cardiometabolic outcomes in children and adolescents with T2D or obesity. Available data over a relatively short follow-up suggested suicidal ideation or behaviors were not significantly different, although GI AEs warrant attention in long-term management.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Obesity affects 1 in 5 children and adolescents, increasing the risk of type 2 diabetes (T2D). Glucagon-like peptide-1 receptor agonists (GLP-1 RAs) are among the few pharmacotherapy options available for this population, necessitating a comprehensive evaluation of efficacy and safety."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of GLP-1 RAs in children and adolescents (<18 years) with obesity, prediabetes, or T2D."
        },
        {
          "label": "DATA SOURCES",
          "text": "A systematic search was conducted in PubMed, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) for randomized clinical trials (RCTs) published from inception until February 28, 2025. Data analysis was completed from January 2025 to April 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "RCTs comparing GLP-1 RAs to placebo in children and adolescents with obesity, overweight, prediabetes, or T2D with reported safety and efficacy data were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers independently extracted data on sample size, population, interventions, follow-up, and outcomes. Risk of bias was assessed using version 2 of the Cochrane risk of bias tool (RoB2). Efficacy outcomes (except lipids) were analyzed as estimated treatment differences, lipids as estimated treatment ratios, and safety via rate ratios. A random-effects inverse variance model was used for all outcomes."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcomes were change in hemoglobin A1c (HbA1c) (in percentage points), fasting glucose (in milligrams per deciliter), body weight (in kilograms), body mass index (BMI, calculated as weight in kilograms divided by height in meters squared), BMI z scores or percentiles, BMI standard deviation score (SDS), lipid outcomes, and blood pressure. Exploratory efficacy outcomes included obstructive sleep apnea and metabolic dysfunction-associated steatohepatitis or metabolic dysfunction-associated steatotic liver disease. Safety outcomes included gastrointestinal adverse effects (GI AEs), infections, hepatobiliary disorders, suicidal ideation or behaviors, depression, hypoglycemia, and adverse event discontinuations."
        },
        {
          "label": "RESULTS",
          "text": "A total of 18 RCTs (11 in obesity, 6 in T2D, and 1 in prediabetes) with 1402 participants (838 GLP-1 RA users and 564 placebo) were included (mean [range] age, 13.7 [6-17] years; 831 female participants (59.3%); median [IQR] treatment duration, 0.51 [0.25-1.00] years). GLP-1 RAs significantly reduced HbA1c (-0.44%; 95% CI, -0.68% to -0.21%), fasting glucose (-9.92 mg/dL; 95% CI, -16.20 to -3.64), body weight (-3.02 kg; 95% CI, -4.98 to -1.06), BMI (-1.45; 95% CI, -2.40 to -0.49), BMI SDS (-0.20; 95% CI, -0.36 to -0.05), BMI percentile (-7.24%; 95% CI, -12.97% to -1.51%), and systolic blood pressure (-2.73 mm Hg; 95% CI, -4.04 to -1.43) and increased GI AE (log[rate ratio] [RR], 0.75). Other AEs, including suicidal ideation or behaviors, showed no significant differences."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis of 18 trials, GLP-1 RAs significantly improved glycemic, weight, and cardiometabolic outcomes in children and adolescents with T2D or obesity. Available data over a relatively short follow-up suggested suicidal ideation or behaviors were not significantly different, although GI AEs warrant attention in long-term management."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40952752/",
      "pubDate": "2025 Sep 15",
      "doi": "10.1001/jamapediatrics.2025.3243",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists improved glycemic control, weight, and cardiometabolic health in children and adolescents with type 2 diabetes or obesity, but gastrointestinal side effects require monitoring."
    },
    {
      "id": "b157065df74e",
      "title": "Efficacy and safety of survodutide on glycemic control and weight loss in adults: A systematic review and meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117651",
      "abstract": "This meta-analysis aimed to evaluate the efficacy and safety of survodutide on glycemic control and weight loss in adults. We systematically searched PubMed, Embase, the Cochrane Library, Scopus, Web of Science, and ClinicalTrials.gov for randomized controlled trials (RCTs) evaluating the efficacy and safety of survodutide up to 12 July 2025. The primary outcomes were changes in glycated haemoglobin (HbA1c), fasting glucagon levels, body weight, waist circumference, along with the incidence of adverse events (AEs). Secondary outcomes included body mass index (BMI), lipid profiles, and blood pressure. Six RCTs involving 1272 participants were included in this meta-analysis. Compared with placebo, survodutide significantly reduced HbA1c (weighted mean difference [WMD]: -0.66%, 95% confidence interval [CI] [-1.08, -0.23], p = 0.002) and fasting glucagon levels (WMD: -7 pmol/L, 95% CI [-10.3, -3.69], p = 0.016). Greater reductions were observed in the subgroup receiving a total weekly dose of >2.4 mg compared with the subgroup receiving ≤2.4 mg weekly. Survodutide also significantly decreased body weight (WMD: -6.7 kg, 95% CI [-10.0, -3.4], p < 0.001) and waist circumference (WMD: -7.09 cm, 95% CI [-9.44, -4.47], p < 0.001), with enhanced effects observed at higher total weekly doses (>2.4 mg) and longer treatment durations (>16 weeks). Additionally, significant reductions were observed in BMI, and modest reductions were noted in total cholesterol, triglycerides, and blood pressure. However, survodutide was associated with a higher risk of treatment discontinuation due to AEs, with gastrointestinal AEs being the most common, although there was no significant increase in the incidence of serious AEs. Survodutide significantly reduced HbA1c, body weight, and waist circumference. A greater reduction in HbA1c was specifically associated with a higher total weekly dose (>2.4 mg), while more pronounced effects on body weight and waist circumference were observed with both higher doses and longer treatment durations (>16 weeks). However, it is crucial to highlight the significant increase in gastrointestinal AEs and the associated risk of treatment discontinuation. Further large-scale, multicentre, long-term, and high-quality RCTs are necessary to validate these results in diverse populations.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "This meta-analysis aimed to evaluate the efficacy and safety of survodutide on glycemic control and weight loss in adults."
        },
        {
          "label": "METHODS",
          "text": "We systematically searched PubMed, Embase, the Cochrane Library, Scopus, Web of Science, and ClinicalTrials.gov for randomized controlled trials (RCTs) evaluating the efficacy and safety of survodutide up to 12 July 2025. The primary outcomes were changes in glycated haemoglobin (HbA1c), fasting glucagon levels, body weight, waist circumference, along with the incidence of adverse events (AEs). Secondary outcomes included body mass index (BMI), lipid profiles, and blood pressure."
        },
        {
          "label": "RESULTS",
          "text": "Six RCTs involving 1272 participants were included in this meta-analysis. Compared with placebo, survodutide significantly reduced HbA1c (weighted mean difference [WMD]: -0.66%, 95% confidence interval [CI] [-1.08, -0.23], p = 0.002) and fasting glucagon levels (WMD: -7 pmol/L, 95% CI [-10.3, -3.69], p = 0.016). Greater reductions were observed in the subgroup receiving a total weekly dose of >2.4 mg compared with the subgroup receiving ≤2.4 mg weekly. Survodutide also significantly decreased body weight (WMD: -6.7 kg, 95% CI [-10.0, -3.4], p < 0.001) and waist circumference (WMD: -7.09 cm, 95% CI [-9.44, -4.47], p < 0.001), with enhanced effects observed at higher total weekly doses (>2.4 mg) and longer treatment durations (>16 weeks). Additionally, significant reductions were observed in BMI, and modest reductions were noted in total cholesterol, triglycerides, and blood pressure. However, survodutide was associated with a higher risk of treatment discontinuation due to AEs, with gastrointestinal AEs being the most common, although there was no significant increase in the incidence of serious AEs."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Survodutide significantly reduced HbA1c, body weight, and waist circumference. A greater reduction in HbA1c was specifically associated with a higher total weekly dose (>2.4 mg), while more pronounced effects on body weight and waist circumference were observed with both higher doses and longer treatment durations (>16 weeks). However, it is crucial to highlight the significant increase in gastrointestinal AEs and the associated risk of treatment discontinuation. Further large-scale, multicentre, long-term, and high-quality RCTs are necessary to validate these results in diverse populations."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40922121/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1111/dom.70105",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Survodutide effectively lowered HbA1c, weight, and waist circumference, with higher doses and longer treatment leading to greater reductions, but increased gastrointestinal side effects and treatment discontinuation were observed."
    },
    {
      "id": "21b0718f6879",
      "title": "Orforglipron, an Oral Small-Molecule GLP-1 Receptor Agonist for Obesity Treatment.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117633",
      "abstract": "Orforglipron, a small-molecule, nonpeptide oral glucagon-like peptide-1 (GLP-1) receptor agonist, is being investigated as a treatment for obesity. In this phase 3, multinational, randomized, double-blind trial, we examined the safety and efficacy of once-daily orforglipron at doses of 6 mg, 12 mg, or 36 mg, as compared with placebo (assigned in a 3:3:3:4 ratio) as an adjunct to healthy diet and physical activity for 72 weeks. All the patients had obesity without diabetes mellitus. The primary end point was the percent change in body weight from baseline to week 72, as assessed according to the treatment-regimen estimand in the intention-to-treat population. A total of 3127 patients underwent randomization. The mean change in body weight from baseline to week 72 was -7.5% (95% confidence interval [CI], -8.2 to -6.8) with 6 mg of orforglipron, -8.4% (95% CI, -9.1 to -7.7) with 12 mg of orforglipron, and -11.2% (95% CI, -12.0 to -10.4) with 36 mg of orforglipron, as compared with -2.1% (95% CI, -2.8 to -1.4) with placebo (P<0.001 for all comparisons with placebo). Among the patients in the orforglipron 36-mg group, 54.6% had a reduction of 10% or more, 36.0% had a reduction of 15% or more, and 18.4% had a reduction of 20% or more, as compared with 12.9%, 5.9%, and 2.8% of the patients, respectively, in the placebo group. Waist circumference, systolic blood pressure, triglyceride levels, and non-HDL cholesterol levels significantly improved with orforglipron treatment as compared with placebo. Adverse events resulted in treatment discontinuation in 5.3 to 10.3% of the patients in the orforglipron groups and in 2.7% of those in the placebo group. The most common adverse events with orforglipron were gastrointestinal effects, which were mostly mild to moderate. In adults with obesity, 72-week treatment with orforglipron led to significantly greater reductions in body weight than placebo; the adverse-event profile was consistent with that of other GLP-1 receptor agonists. (Funded by Eli Lilly; ATTAIN-1 ClinicalTrials.gov number, NCT05869903.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Orforglipron, a small-molecule, nonpeptide oral glucagon-like peptide-1 (GLP-1) receptor agonist, is being investigated as a treatment for obesity."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3, multinational, randomized, double-blind trial, we examined the safety and efficacy of once-daily orforglipron at doses of 6 mg, 12 mg, or 36 mg, as compared with placebo (assigned in a 3:3:3:4 ratio) as an adjunct to healthy diet and physical activity for 72 weeks. All the patients had obesity without diabetes mellitus. The primary end point was the percent change in body weight from baseline to week 72, as assessed according to the treatment-regimen estimand in the intention-to-treat population."
        },
        {
          "label": "RESULTS",
          "text": "A total of 3127 patients underwent randomization. The mean change in body weight from baseline to week 72 was -7.5% (95% confidence interval [CI], -8.2 to -6.8) with 6 mg of orforglipron, -8.4% (95% CI, -9.1 to -7.7) with 12 mg of orforglipron, and -11.2% (95% CI, -12.0 to -10.4) with 36 mg of orforglipron, as compared with -2.1% (95% CI, -2.8 to -1.4) with placebo (P<0.001 for all comparisons with placebo). Among the patients in the orforglipron 36-mg group, 54.6% had a reduction of 10% or more, 36.0% had a reduction of 15% or more, and 18.4% had a reduction of 20% or more, as compared with 12.9%, 5.9%, and 2.8% of the patients, respectively, in the placebo group. Waist circumference, systolic blood pressure, triglyceride levels, and non-HDL cholesterol levels significantly improved with orforglipron treatment as compared with placebo. Adverse events resulted in treatment discontinuation in 5.3 to 10.3% of the patients in the orforglipron groups and in 2.7% of those in the placebo group. The most common adverse events with orforglipron were gastrointestinal effects, which were mostly mild to moderate."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In adults with obesity, 72-week treatment with orforglipron led to significantly greater reductions in body weight than placebo; the adverse-event profile was consistent with that of other GLP-1 receptor agonists. (Funded by Eli Lilly; ATTAIN-1 ClinicalTrials.gov number, NCT05869903.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40960239/",
      "pubDate": "2025 Sep 16",
      "doi": "10.1056/NEJMoa2511774",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Orforglipron resulted in significantly more weight loss compared to placebo in obese adults over 72 weeks, with side effects similar to other GLP-1 receptor agonists."
    },
    {
      "id": "14c4a891695e",
      "title": "Simvastatin Addition to Standard of Care Improves Long-Term Survival in Patients With Cirrhosis After Variceal Bleed: An Open Label Randomized Controlled Trial.",
      "journal": "Am J Gastroenterol",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117606",
      "abstract": "There is limited evidence about efficacy and safety of simvastatin in decompensated cirrhosis. We assessed whether addition of simvastatin to standard of care improves long-term survival in patients with cirrhosis after variceal bleeding. This was a single-center open label randomized controlled trial with superiority design. Patients with cirrhosis (Child-Pugh score 5-12) were randomly assigned to receive either simvastatin (20 mg once-daily) (n = 130) or no drug (n = 138) in addition to standard therapy (carvedilol and band ligation) at day 5 of variceal bleeding episode. Primary outcome was all-cause mortality over 24-month follow-up. Secondary outcomes included individual complications of cirrhosis with death before decompensation as a competing event. Baseline characteristics were similar in both groups with a mean age of 45.0 ± 11.5 years and alcohol (48%) being the predominant etiology. Most patients were of Child-Pugh A (34%) and B (50%) stage. Twenty-four patients (18%) on simvastatin and 44 (31%) on standard therapy died over follow-up (hazard ratio [HR] for simvastatin: 0.48 [95% confidence interval 0.29-0.81]; P = 0.006) with similar results on intention to treat and on per-protocol analysis (excluding 17 patients who stopped simvastatin). Incidence of ascites (subdistributional HR [sHR]) 0.60 (0.39-0.92) and spontaneous bacterial peritonitis (sHR 0.30 [0.11-0.81]) was lower in the simvastatin arm. All cause decompensation (sHR 0.74 [0.52-1.05]), rebleeding (sHR 0.87 [0.57-1.34]), hepatic encephalopathy (sHR 0.71 [0.42-1.19]), and acute-on-chronic liver failure (sHR 0.65 [0.39-1.10]) were comparable in both arms. No heterogeneity of treatment effect was demonstrated across Child-Turcotte-Pugh class ( P = 0.105) or etiology ( P = 0.39). Incidence of serious adverse events was similar (43% in simvastatin and 52% in standard therapy, absolute risk difference: 9.1% [-2.9% to 21.0%]). Simvastatin may be associated with improved survival in selected patients with cirrhosis after variceal bleed and reduced incidence of new onset/refractory ascites and its complications (CTRI/2022/07/044263).",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "There is limited evidence about efficacy and safety of simvastatin in decompensated cirrhosis. We assessed whether addition of simvastatin to standard of care improves long-term survival in patients with cirrhosis after variceal bleeding."
        },
        {
          "label": "METHODS",
          "text": "This was a single-center open label randomized controlled trial with superiority design. Patients with cirrhosis (Child-Pugh score 5-12) were randomly assigned to receive either simvastatin (20 mg once-daily) (n = 130) or no drug (n = 138) in addition to standard therapy (carvedilol and band ligation) at day 5 of variceal bleeding episode. Primary outcome was all-cause mortality over 24-month follow-up. Secondary outcomes included individual complications of cirrhosis with death before decompensation as a competing event."
        },
        {
          "label": "RESULTS",
          "text": "Baseline characteristics were similar in both groups with a mean age of 45.0 ± 11.5 years and alcohol (48%) being the predominant etiology. Most patients were of Child-Pugh A (34%) and B (50%) stage. Twenty-four patients (18%) on simvastatin and 44 (31%) on standard therapy died over follow-up (hazard ratio [HR] for simvastatin: 0.48 [95% confidence interval 0.29-0.81]; P = 0.006) with similar results on intention to treat and on per-protocol analysis (excluding 17 patients who stopped simvastatin). Incidence of ascites (subdistributional HR [sHR]) 0.60 (0.39-0.92) and spontaneous bacterial peritonitis (sHR 0.30 [0.11-0.81]) was lower in the simvastatin arm. All cause decompensation (sHR 0.74 [0.52-1.05]), rebleeding (sHR 0.87 [0.57-1.34]), hepatic encephalopathy (sHR 0.71 [0.42-1.19]), and acute-on-chronic liver failure (sHR 0.65 [0.39-1.10]) were comparable in both arms. No heterogeneity of treatment effect was demonstrated across Child-Turcotte-Pugh class ( P = 0.105) or etiology ( P = 0.39). Incidence of serious adverse events was similar (43% in simvastatin and 52% in standard therapy, absolute risk difference: 9.1% [-2.9% to 21.0%])."
        },
        {
          "label": "DISCUSSION",
          "text": "Simvastatin may be associated with improved survival in selected patients with cirrhosis after variceal bleed and reduced incidence of new onset/refractory ascites and its complications (CTRI/2022/07/044263)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40736696/",
      "pubDate": "2025 Jul 31",
      "doi": "10.14309/ajg.0000000000003689",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Simvastatin, when added to standard care, improved long-term survival and reduced ascites and spontaneous bacterial peritonitis in patients with cirrhosis after variceal bleeding."
    },
    {
      "id": "841fd1d73fbe",
      "title": "Home-Based Care for Hypertension in Rural South Africa.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48243185/117614",
      "abstract": "Poorly controlled hypertension is a common problem worldwide, particularly in low-resource settings. We conducted an open-label, randomized, controlled trial of a home-based model of hypertension care in South Africa. Adults with hypertension were assigned to receive home-based care, which consisted of patient monitoring of blood pressure, home visits from a community health worker (CHW) for data collection and medication delivery, and remote nurse-led decision making supported by a mobile application (CHW group); enhanced home-based care, which consisted of the same intervention but with blood-pressure machines transmitting readings automatically (enhanced CHW group); or standard care with clinic-based management (standard-care group). The primary outcome was the systolic blood pressure at 6 months. Secondary outcomes were the systolic blood pressure at 12 months and hypertension control at 6 and 12 months. Safety outcomes included adverse events, deaths, and retention in care. A total of 774 adults underwent randomization. The mean age was 62 years; 76.0% of the participants were women, 13.6% had diabetes mellitus, and 46.5% had human immunodeficiency virus infection. The mean systolic blood pressure at 6 months was lower in the CHW group than in the standard-care group (difference, -7.9 mm Hg; 95% confidence interval [CI], -10.5 to -5.3; P<0.001) and was also lower in the enhanced CHW group than in the standard-care group (difference, -9.1 mm Hg; 95% CI, -11.7 to -6.4; P<0.001). The percentage of participants with hypertension control at 6 months was 57.6% in the standard-care group, as compared with 76.9% in the CHW group (relative risk, 1.33; 95% CI, 1.18 to 1.51) and 82.8% in the enhanced CHW group (relative risk, 1.44; 95% CI, 1.28 to 1.62). The improvements in systolic blood pressure and hypertension control with home-based care appeared to persist at 12 months. Severe adverse events and deaths occurred in 2.7% and 1.0% of the participants, respectively, and occurred in a similar percentage of participants across trial groups. Retention in care was observed in more than 95% of the participants in the CHW and enhanced CHW groups. In South Africa, home-based hypertension care led to a significantly lower mean systolic blood pressure at 6 months than standard, clinic-based care. (Supported by the National Institutes of Health and others; IMPACT-BP ClinicalTrials.gov number, NCT05492955; South African National Clinical Trials Register number, DOH-27-112022-4895.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Poorly controlled hypertension is a common problem worldwide, particularly in low-resource settings."
        },
        {
          "label": "METHODS",
          "text": "We conducted an open-label, randomized, controlled trial of a home-based model of hypertension care in South Africa. Adults with hypertension were assigned to receive home-based care, which consisted of patient monitoring of blood pressure, home visits from a community health worker (CHW) for data collection and medication delivery, and remote nurse-led decision making supported by a mobile application (CHW group); enhanced home-based care, which consisted of the same intervention but with blood-pressure machines transmitting readings automatically (enhanced CHW group); or standard care with clinic-based management (standard-care group). The primary outcome was the systolic blood pressure at 6 months. Secondary outcomes were the systolic blood pressure at 12 months and hypertension control at 6 and 12 months. Safety outcomes included adverse events, deaths, and retention in care."
        },
        {
          "label": "RESULTS",
          "text": "A total of 774 adults underwent randomization. The mean age was 62 years; 76.0% of the participants were women, 13.6% had diabetes mellitus, and 46.5% had human immunodeficiency virus infection. The mean systolic blood pressure at 6 months was lower in the CHW group than in the standard-care group (difference, -7.9 mm Hg; 95% confidence interval [CI], -10.5 to -5.3; P<0.001) and was also lower in the enhanced CHW group than in the standard-care group (difference, -9.1 mm Hg; 95% CI, -11.7 to -6.4; P<0.001). The percentage of participants with hypertension control at 6 months was 57.6% in the standard-care group, as compared with 76.9% in the CHW group (relative risk, 1.33; 95% CI, 1.18 to 1.51) and 82.8% in the enhanced CHW group (relative risk, 1.44; 95% CI, 1.28 to 1.62). The improvements in systolic blood pressure and hypertension control with home-based care appeared to persist at 12 months. Severe adverse events and deaths occurred in 2.7% and 1.0% of the participants, respectively, and occurred in a similar percentage of participants across trial groups. Retention in care was observed in more than 95% of the participants in the CHW and enhanced CHW groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In South Africa, home-based hypertension care led to a significantly lower mean systolic blood pressure at 6 months than standard, clinic-based care. (Supported by the National Institutes of Health and others; IMPACT-BP ClinicalTrials.gov number, NCT05492955; South African National Clinical Trials Register number, DOH-27-112022-4895.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888742/",
      "pubDate": "2025 Sep 01",
      "doi": "10.1056/NEJMoa2509958",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Home-based hypertension care in South Africa resulted in a statistically significant reduction in systolic blood pressure compared to standard clinic-based care after six months."
    },
    {
      "id": "2d53b8f40906",
      "title": "Parent-focused behavioural interventions for the prevention of early childhood obesity (TOPCHILD): a systematic review and individual participant data meta-analysis.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48243185/117602",
      "abstract": "Childhood obesity is a global public health issue, which has prompted governments to invest in prevention programmes. We aimed to investigate the effectiveness of parent-focused early childhood obesity prevention interventions globally. We did a systematic review and individual participant data meta-analysis. We searched databases and trial registries (MEDLINE, Embase, CENTRAL, CINAHL, PsycInfo, ClinicalTrials.gov, and WHO International Clinical Trials Registry Platform) from inception until Sept 30, 2024, for randomised controlled trials commencing before 12 months of age examining parent-focused behavioural interventions to prevent obesity in children, compared with usual care, no intervention, or attention control. Individual participant data were checked, harmonised, and assessed for integrity and risk of bias. We excluded trials that were quasi-randomised, investigated pregnancy-only interventions, or did not collect any child weight-related outcomes. The primary outcome was BMI Z score at age 24 months (±6 months). We did an intention-to-treat, two-stage, random effects meta-analysis to examine effects overall and for prespecified subgroups. We assessed certainty of evidence using Grading of Recommendations Assessment, Development, and Evaluation. This study is registered with PROSPERO, CRD42020177408. Of 19 990 identified records, 47 (0·24%) trials were completed and eligible. Of these, 18 (38%) assessed our primary outcome, BMI Z score. We obtained individual participant data for 17 (94%; n=9128) of these 18 trials (n=9383), representing 97% of eligible participants. Of these 9128 participants, 4549 (50%) were boys, 4415 (48%) were girls, and 164 (2%) had unknown sex. We found no evidence of an effect of interventions on BMI Z score at age 24 months (±6 months; mean difference -0·01 [95% CI -0·08 to 0·05]; high certainty evidence, τ=0·01; n=6505; 2623 missing). Findings were robust to prespecified sensitivity analyses (eg, different analysis methods and missing data), and we found no evidence of differential intervention effects for prespecified subgroups including priority populations and trial-level factors. These findings indicate that examined parent-focused behavioural interventions are insufficient to prevent obesity at age 24 months (±6 months). This evidence highlights a need to re-think childhood obesity prevention approaches. Australian National Health and Medical Research Council.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Childhood obesity is a global public health issue, which has prompted governments to invest in prevention programmes. We aimed to investigate the effectiveness of parent-focused early childhood obesity prevention interventions globally."
        },
        {
          "label": "METHODS",
          "text": "We did a systematic review and individual participant data meta-analysis. We searched databases and trial registries (MEDLINE, Embase, CENTRAL, CINAHL, PsycInfo, ClinicalTrials.gov, and WHO International Clinical Trials Registry Platform) from inception until Sept 30, 2024, for randomised controlled trials commencing before 12 months of age examining parent-focused behavioural interventions to prevent obesity in children, compared with usual care, no intervention, or attention control. Individual participant data were checked, harmonised, and assessed for integrity and risk of bias. We excluded trials that were quasi-randomised, investigated pregnancy-only interventions, or did not collect any child weight-related outcomes. The primary outcome was BMI Z score at age 24 months (±6 months). We did an intention-to-treat, two-stage, random effects meta-analysis to examine effects overall and for prespecified subgroups. We assessed certainty of evidence using Grading of Recommendations Assessment, Development, and Evaluation. This study is registered with PROSPERO, CRD42020177408."
        },
        {
          "label": "FINDINGS",
          "text": "Of 19 990 identified records, 47 (0·24%) trials were completed and eligible. Of these, 18 (38%) assessed our primary outcome, BMI Z score. We obtained individual participant data for 17 (94%; n=9128) of these 18 trials (n=9383), representing 97% of eligible participants. Of these 9128 participants, 4549 (50%) were boys, 4415 (48%) were girls, and 164 (2%) had unknown sex. We found no evidence of an effect of interventions on BMI Z score at age 24 months (±6 months; mean difference -0·01 [95% CI -0·08 to 0·05]; high certainty evidence, τ=0·01; n=6505; 2623 missing). Findings were robust to prespecified sensitivity analyses (eg, different analysis methods and missing data), and we found no evidence of differential intervention effects for prespecified subgroups including priority populations and trial-level factors."
        },
        {
          "label": "INTERPRETATION",
          "text": "These findings indicate that examined parent-focused behavioural interventions are insufficient to prevent obesity at age 24 months (±6 months). This evidence highlights a need to re-think childhood obesity prevention approaches."
        },
        {
          "label": "FUNDING",
          "text": "Australian National Health and Medical Research Council."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40945528/",
      "pubDate": "2025 Sep 20",
      "doi": "10.1016/S0140-6736(25)01144-4",
      "dateReceived": "2025-09-30T23:22:14.067Z",
      "isNew": false,
      "summary": "Parent-focused behavioral interventions to prevent childhood obesity showed no significant impact on BMI Z score at 24 months."
    },
    {
      "id": "80684722cf9c",
      "title": "Cardiovascular risk reduction with glucagon-like peptide-1 receptor agonists is proportional to HbA1c lowering in type 2 diabetes: An updated meta-regression analysis incorporating FLOW and SOUL trials.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48332840/117705",
      "abstract": "To evaluate relationships of cardiovascular and kidney outcomes with glycemic or bodyweight reductions in randomised placebo-controlled trials of glucagon-like peptide-1 receptor agonists (GLP-1RAs), incorporating data from FLOW and SOUL trials. PubMed and EMBASE were searched up to 22 August 2025 for placebo-controlled randomized trials of oral or bolus-type, subcutaneous GLP-1RAs reporting major adverse cardiovascular events (MACE; a composite of cardiovascular death, myocardial infarction, and stroke) in adults with type 2 diabetes. The primary outcome was MACE; secondary outcomes included heart failure (HF) and kidney outcomes. Random-effects meta-analyses were followed by meta-regression evaluating associations with HbA1c and bodyweight reduction. A total of 73 263 individuals were included from 10 trials (ELIXA, LEADER, SUSTAIN-6, EXSCEL, Harmony Outcomes, PIONEER 6, REWIND, AMPLITUDE-O, FLOW, and SOUL). GLP-1RAs reduced MACE by 14% (hazard ratio: 0.86; 95% CI: 0.82 to 0.91; p <0.001), as well as hospitalisation for HF and the composite kidney outcome (both p <0.001). Meta-regression showed that every 1% extra reduction in HbA1c corresponded to a 27% lower HR for MACE (p = 0.015; R = 0.61). While HbA1c reduction was not significantly associated with secondary outcomes, the directionality was consistent with MACE. Bodyweight change was not associated with any of the analysed endpoints, including MACE (p = 0.13; R = 0.21). HbA1c reduction, not bodyweight change, was significantly and proportionally associated with MACE risk reduction. HbA1c lowering may serve as a useful surrogate for the cardiovascular improvements associated with GLP-1RAs in type 2 diabetes.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To evaluate relationships of cardiovascular and kidney outcomes with glycemic or bodyweight reductions in randomised placebo-controlled trials of glucagon-like peptide-1 receptor agonists (GLP-1RAs), incorporating data from FLOW and SOUL trials."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "PubMed and EMBASE were searched up to 22 August 2025 for placebo-controlled randomized trials of oral or bolus-type, subcutaneous GLP-1RAs reporting major adverse cardiovascular events (MACE; a composite of cardiovascular death, myocardial infarction, and stroke) in adults with type 2 diabetes. The primary outcome was MACE; secondary outcomes included heart failure (HF) and kidney outcomes. Random-effects meta-analyses were followed by meta-regression evaluating associations with HbA1c and bodyweight reduction."
        },
        {
          "label": "RESULTS",
          "text": "A total of 73 263 individuals were included from 10 trials (ELIXA, LEADER, SUSTAIN-6, EXSCEL, Harmony Outcomes, PIONEER 6, REWIND, AMPLITUDE-O, FLOW, and SOUL). GLP-1RAs reduced MACE by 14% (hazard ratio: 0.86; 95% CI: 0.82 to 0.91; p <0.001), as well as hospitalisation for HF and the composite kidney outcome (both p <0.001). Meta-regression showed that every 1% extra reduction in HbA1c corresponded to a 27% lower HR for MACE (p = 0.015; R = 0.61). While HbA1c reduction was not significantly associated with secondary outcomes, the directionality was consistent with MACE. Bodyweight change was not associated with any of the analysed endpoints, including MACE (p = 0.13; R = 0.21)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "HbA1c reduction, not bodyweight change, was significantly and proportionally associated with MACE risk reduction. HbA1c lowering may serve as a useful surrogate for the cardiovascular improvements associated with GLP-1RAs in type 2 diabetes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40926380/",
      "pubDate": "2025 Sep 09",
      "doi": "10.1111/dom.70121",
      "dateReceived": "2025-09-30T23:22:14.066Z",
      "isNew": false,
      "summary": "Lowering HbA1c, rather than weight loss, is directly linked to a reduced risk of major adverse cardiovascular events in people with type 2 diabetes."
    },
    {
      "id": "dadf80776ded",
      "title": "Personalized High-Definition Transcranial Direct Current Stimulation for the Treatment of Depression: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48324380/117599",
      "abstract": "Transcranial direct current stimulation (tDCS) shows promise for treating depression. The precision and focality of stimulation may influence therapeutic outcomes; thus, investigation of personalized focal high-definition (HD) tDCS for treating depression is needed. To determine whether HD-tDCS therapy can improve mood in patients with moderate to severe depression. This randomized clinical trial used a double-blind, sham-controlled, parallel study design. The trial was conducted from December 1, 2020, to March 7, 2024, at UCLA. Each participant received a 4-week follow-up. Participants were required to meet diagnostic criteria for a current major depressive episode (evaluated using the Mini International Neuropsychiatric Interview), present moderate to severe depressive symptoms (ie, have a 17-item Hamilton Depression Rating Scale [HAMD] score ≥14 and <24), be either treatment naive or receiving a stable standard antidepressant regimen, and be 18 to 65 years of age. Key exclusion criteria included treatment-resistant depression, bipolar disorder, or schizophrenia. Of 560 volunteers screened, 71 were found to be eligible for participation. Participants received 20 minutes of active or sham HD-tDCS each day for 12 consecutive working days. Structural magnetic resonance imaging and frameless stereotaxic neuronavigation were used to personalize the HD-tDCS configuration to each participant. Pretreatment to posttreatment change in the HAMD score. Seventy-one participants (44 female [62.0%]; mean [SD] age, 34.3 [10.4] years) were randomized to receive active (n = 40) or sham (n = 31) HD-tDCS therapy. The primary outcome measure, mean (SD) pretreatment to posttreatment change in HAMD score, differed significantly between treatment groups (group difference, -2.2 [4.3]; P = .04; Cohen d, -0.50 [95% CI, -0.99 to -0.01]). Post hoc 2-sample t tests revealed significant decreases in HAMD scores within both groups, with (significantly) greater decreases in the active treatment group (active HD-tDCS group, -7.8 [4.2]; sham HD-tDCS group, -5.6 [4.4]). HD-tDCS was well-tolerated, with mild to no adverse effects. Exploratory analyses indicated a significant active treatment-related improvement in the anxiety dimension of the primary outcome measure (group difference, -0.68 [1.42]; P = .049; Cohen d, -0.48 [95% CI, -0.96 to -0.004]). In this randomized clinical trial of HD-tDCS in participants with moderate to severe depression, the 12-day HD-tDCS therapy was observed to significantly improve mood with a moderate effect size. Similar effect sizes in pharmacotherapy, psychotherapy, and conventional tDCS-based therapy have been observed to occur substantially later, highlighting the clinical potential of more precise and focal tDCS in depression. Follow-up studies with appropriate maintenance treatments are needed to clarify the persistence of antidepressant effects, as well as possible therapy optimizations. Exploratory analyses indicated that HD-tDCS therapy also may be salient for treating anxiety disorders. ClinicalTrials.gov Identifier: NCT04507243.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Transcranial direct current stimulation (tDCS) shows promise for treating depression. The precision and focality of stimulation may influence therapeutic outcomes; thus, investigation of personalized focal high-definition (HD) tDCS for treating depression is needed."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether HD-tDCS therapy can improve mood in patients with moderate to severe depression."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial used a double-blind, sham-controlled, parallel study design. The trial was conducted from December 1, 2020, to March 7, 2024, at UCLA. Each participant received a 4-week follow-up. Participants were required to meet diagnostic criteria for a current major depressive episode (evaluated using the Mini International Neuropsychiatric Interview), present moderate to severe depressive symptoms (ie, have a 17-item Hamilton Depression Rating Scale [HAMD] score ≥14 and <24), be either treatment naive or receiving a stable standard antidepressant regimen, and be 18 to 65 years of age. Key exclusion criteria included treatment-resistant depression, bipolar disorder, or schizophrenia. Of 560 volunteers screened, 71 were found to be eligible for participation."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants received 20 minutes of active or sham HD-tDCS each day for 12 consecutive working days. Structural magnetic resonance imaging and frameless stereotaxic neuronavigation were used to personalize the HD-tDCS configuration to each participant."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Pretreatment to posttreatment change in the HAMD score."
        },
        {
          "label": "RESULTS",
          "text": "Seventy-one participants (44 female [62.0%]; mean [SD] age, 34.3 [10.4] years) were randomized to receive active (n = 40) or sham (n = 31) HD-tDCS therapy. The primary outcome measure, mean (SD) pretreatment to posttreatment change in HAMD score, differed significantly between treatment groups (group difference, -2.2 [4.3]; P = .04; Cohen d, -0.50 [95% CI, -0.99 to -0.01]). Post hoc 2-sample t tests revealed significant decreases in HAMD scores within both groups, with (significantly) greater decreases in the active treatment group (active HD-tDCS group, -7.8 [4.2]; sham HD-tDCS group, -5.6 [4.4]). HD-tDCS was well-tolerated, with mild to no adverse effects. Exploratory analyses indicated a significant active treatment-related improvement in the anxiety dimension of the primary outcome measure (group difference, -0.68 [1.42]; P = .049; Cohen d, -0.48 [95% CI, -0.96 to -0.004])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial of HD-tDCS in participants with moderate to severe depression, the 12-day HD-tDCS therapy was observed to significantly improve mood with a moderate effect size. Similar effect sizes in pharmacotherapy, psychotherapy, and conventional tDCS-based therapy have been observed to occur substantially later, highlighting the clinical potential of more precise and focal tDCS in depression. Follow-up studies with appropriate maintenance treatments are needed to clarify the persistence of antidepressant effects, as well as possible therapy optimizations. Exploratory analyses indicated that HD-tDCS therapy also may be salient for treating anxiety disorders."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04507243."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40932717/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamanetworkopen.2025.31189",
      "dateReceived": "2025-09-29T23:22:34.258Z",
      "isNew": false,
      "summary": "High-definition transcranial direct current stimulation (HD-tDCS) significantly improved mood in participants with moderate to severe depression, demonstrating a moderate effect size and potential for treating anxiety disorders."
    },
    {
      "id": "bb3dc46942bf",
      "title": "Personalized or Standard Duration of Dual Antiplatelet Therapy after Percutaneous Coronary Intervention: PARTHENOPE Randomized Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48296583/117707",
      "abstract": "The role of anticoagulant therapy in the management of pulmonary arterial hypertension (PAH) remains uncertain, as existing epidemiologic studies have produced conflicting results. The goal of this study was to examine the association between anticoagulant therapy and survival in PAH. A propensity score-based analysis was conducted using data from the national French Pulmonary Hypertension Registry. The findings were then incorporated into an updated meta-analysis of nationwide data sets. Among the 1,597 patients diagnosed with PAH between 2009 and 2020, a total of 380 received anticoagulants at diagnosis. Median survival was 5.62 years (95% CI: 4.76-6.58) for patients receiving anticoagulants and 5.37 years (95% CI: 4.96-5.82) for those not receiving anticoagulants (HR: 0.997; 95% CI: 0.84-1.18; log-rank test, P = 0.97). Findings were consistent across all PAH subgroups within the registry. The updated meta-analysis yielded similar results, with no statistically significant association between anticoagulant use and survival in the overall PAH population (HR: 0.98; 95% CI: 0.78-1.23), as well as in 2 predefined subgroups: 1) idiopathic/heritable PAH or PAH associated with anorexigens (HR: 0.99; 95% CI: 0.79-1.25); and 2) PAH associated with connective tissue disease (HR: 0.86; 95% CI: 0.52-1.42). Anticoagulant use in PAH was not associated with overall survival in the nationwide registry. These results were supported by an updated meta-analysis. Randomized controlled trials remain the most reliable approach to definitively assess the therapeutic value of anticoagulation in this population.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The role of anticoagulant therapy in the management of pulmonary arterial hypertension (PAH) remains uncertain, as existing epidemiologic studies have produced conflicting results."
        },
        {
          "label": "OBJECTIVES",
          "text": "The goal of this study was to examine the association between anticoagulant therapy and survival in PAH."
        },
        {
          "label": "METHODS",
          "text": "A propensity score-based analysis was conducted using data from the national French Pulmonary Hypertension Registry. The findings were then incorporated into an updated meta-analysis of nationwide data sets."
        },
        {
          "label": "RESULTS",
          "text": "Among the 1,597 patients diagnosed with PAH between 2009 and 2020, a total of 380 received anticoagulants at diagnosis. Median survival was 5.62 years (95% CI: 4.76-6.58) for patients receiving anticoagulants and 5.37 years (95% CI: 4.96-5.82) for those not receiving anticoagulants (HR: 0.997; 95% CI: 0.84-1.18; log-rank test, P = 0.97). Findings were consistent across all PAH subgroups within the registry. The updated meta-analysis yielded similar results, with no statistically significant association between anticoagulant use and survival in the overall PAH population (HR: 0.98; 95% CI: 0.78-1.23), as well as in 2 predefined subgroups: 1) idiopathic/heritable PAH or PAH associated with anorexigens (HR: 0.99; 95% CI: 0.79-1.25); and 2) PAH associated with connective tissue disease (HR: 0.86; 95% CI: 0.52-1.42)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Anticoagulant use in PAH was not associated with overall survival in the nationwide registry. These results were supported by an updated meta-analysis. Randomized controlled trials remain the most reliable approach to definitively assess the therapeutic value of anticoagulation in this population."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40992823/",
      "pubDate": "2025 Sep 30",
      "doi": "10.1016/j.jacc.2025.07.026",
      "dateReceived": "2025-09-27T23:22:14.236Z",
      "isNew": false,
      "summary": "Anticoagulant use did not improve survival in pulmonary arterial hypertension patients, a finding supported by a meta-analysis, but further research is needed."
    },
    {
      "id": "d120b6e457c2",
      "title": "Oral antihypertensive treatment during pregnancy: a systematic review and network meta-analysis.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48287095/117645",
      "abstract": "Considering safety and effectiveness of oral antihypertensive agents when treating hypertensive disorders of pregnancy, no preference can be stated between the 3 agents currently available. Therefore, this systematic review and network meta-analysis aims to determine the effects of antenatal treatment with methyldopa, labetalol, or nifedipine for hypertensive disorders of pregnancy regarding maternal or fetal/neonatal morbidity and mortality. On August 25, 2023, an electronic search in PubMed/Medline, Embase, and CENTRAL was performed. Randomized controlled trials reporting on perinatal outcomes in hypertensive pregnancies treated with oral antihypertensive agents of interest (methyldopa, labetalol, or nifedipine) or placebo/no treatment were identified. Quality assessment was performed using the Cochrane Risk of Bias tool for randomized controlled trials and trustworthiness was assessed with the Trustworthiness in RAndomised Controlled Trials Checklist. Data on our predefined outcomes were extracted and relative risks were calculated in network estimates if possible. Twenty three trials (3989 women) were included in our network meta-analysis with an overall low-to-moderate quality. Compared to placebo/no treatment, labetalol and methyldopa significantly reduced the incidence of severe hypertension (including 8 studies, relative risk 0.20 [95% confidence interval 0.09-0.48] and 0.44 [0.20-0.99], respectively). In the network meta-analysis, labetalol vs nifedipine was associated with a reduction in preeclampsia (relative risk, 0.50 [0.28-0.87]; 15 studies) and preterm birth (relative risk, 0.68 [0.52-0.90]; 14 studies). No significant differences could be detected for any of the other outcomes of interest. When comparing the oral antihypertensive agents currently available head-to-head, no significant differences in the primary outcome, severe hypertension, could be detected as well as on most of the secondary outcomes of interest. Considering the preference of labetalol over nifedipine regarding the outcomes preeclampsia and preterm birth, a modest favor for labetalol could be stated. Included studies however were of low overall quality warranting caution when interpreting results.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Considering safety and effectiveness of oral antihypertensive agents when treating hypertensive disorders of pregnancy, no preference can be stated between the 3 agents currently available. Therefore, this systematic review and network meta-analysis aims to determine the effects of antenatal treatment with methyldopa, labetalol, or nifedipine for hypertensive disorders of pregnancy regarding maternal or fetal/neonatal morbidity and mortality."
        },
        {
          "label": "DATA SOURCES",
          "text": "On August 25, 2023, an electronic search in PubMed/Medline, Embase, and CENTRAL was performed."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Randomized controlled trials reporting on perinatal outcomes in hypertensive pregnancies treated with oral antihypertensive agents of interest (methyldopa, labetalol, or nifedipine) or placebo/no treatment were identified."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Quality assessment was performed using the Cochrane Risk of Bias tool for randomized controlled trials and trustworthiness was assessed with the Trustworthiness in RAndomised Controlled Trials Checklist. Data on our predefined outcomes were extracted and relative risks were calculated in network estimates if possible."
        },
        {
          "label": "RESULTS",
          "text": "Twenty three trials (3989 women) were included in our network meta-analysis with an overall low-to-moderate quality. Compared to placebo/no treatment, labetalol and methyldopa significantly reduced the incidence of severe hypertension (including 8 studies, relative risk 0.20 [95% confidence interval 0.09-0.48] and 0.44 [0.20-0.99], respectively). In the network meta-analysis, labetalol vs nifedipine was associated with a reduction in preeclampsia (relative risk, 0.50 [0.28-0.87]; 15 studies) and preterm birth (relative risk, 0.68 [0.52-0.90]; 14 studies). No significant differences could be detected for any of the other outcomes of interest."
        },
        {
          "label": "CONCLUSION",
          "text": "When comparing the oral antihypertensive agents currently available head-to-head, no significant differences in the primary outcome, severe hypertension, could be detected as well as on most of the secondary outcomes of interest. Considering the preference of labetalol over nifedipine regarding the outcomes preeclampsia and preterm birth, a modest favor for labetalol could be stated. Included studies however were of low overall quality warranting caution when interpreting results."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40216176/",
      "pubDate": "2025 Oct",
      "doi": "10.1016/j.ajog.2025.04.011",
      "dateReceived": "2025-09-26T23:22:04.330Z",
      "isNew": false,
      "summary": "Labetalol may be modestly favored over nifedipine for preeclampsia and preterm birth, but overall, no significant differences were found between oral antihypertensive agents for severe hypertension or most other outcomes, though the evidence quality is low."
    },
    {
      "id": "4adff7493c8b",
      "title": "Physiology-Guided Complete Revascularization in Older Patients With Myocardial Infarction: Three-Year Outcomes of a Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48287095/117635",
      "abstract": "Complete revascularization in older patients with myocardial infarction (MI) and multivessel disease has been shown to reduce cardiovascular death and MI at 1 year. However, the durability of this benefit over longer follow-up periods has been questioned by recent studies. To determine whether the benefit of physiology-guided complete treatment, compared with culprit-only treatment, is sustained at 3 years in older patients with MI and multivessel disease. This randomized clinical trial, Functional Assessment in Elderly MI Patients With Multivessel Disease (FIRE), was an investigator-initiated, multicenter, prospective, superiority trial conducted at 34 centers across 3 countries from July 18, 2019, to October 25, 2021. Participants were patients with MI (either ST segment or non-ST segment elevated) and multivessel disease who were hospitalized after successful treatment of the culprit lesion. Major exclusion criteria included a nonculprit lesion in the left main coronary artery and unclear identification of the culprit lesion. Data analysis was performed from March to May 2025. Culprit-only treatment or physiology-guided complete revascularization of nonculprit lesions. The primary outcome was a patient-oriented composite end point of death, MI, stroke, or ischemia-driven revascularization. Secondary end points included a composite of cardiovascular death or MI and rate of heart failure hospitalizations. Among 1445 patients enrolled in the trial, the median (IQR) age was 80 (77-84) years; 917 patients were male (63.5%) and 528 female (36.5%). At 3 years, the primary outcome occurred in 165 patients (22.9%) in the physiology-guided complete revascularization group and 216 patients (29.8%) in the culprit-only group (hazard ratio [HR], 0.72; 95% CI, 0.58-0.88; P = .002). The key secondary outcome of cardiovascular death or MI occurred in a significantly lower number of patients in the physiology-guided complete revascularization group (92 patients [12.8%]) compared with the culprit-only group (132 patients [18.2%]; HR, 0.66; 95% CI, 0.50-0.88; P = .004). Hospitalizations for heart failure were more frequent in the culprit-only group compared with the physiology-guided complete group (143 [19.7%] vs 103 [14.3%]; HR, 0.73; 95% CI, 0.54-0.97; P = .03). In patients 75 years or older with MI and multivessel disease, the benefit of physiology-guided complete revascularization over culprit-lesion-only treatment was sustained at 3 years. ClinicalTrials.gov Identifier: NCT03772743.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Complete revascularization in older patients with myocardial infarction (MI) and multivessel disease has been shown to reduce cardiovascular death and MI at 1 year. However, the durability of this benefit over longer follow-up periods has been questioned by recent studies."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether the benefit of physiology-guided complete treatment, compared with culprit-only treatment, is sustained at 3 years in older patients with MI and multivessel disease."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial, Functional Assessment in Elderly MI Patients With Multivessel Disease (FIRE), was an investigator-initiated, multicenter, prospective, superiority trial conducted at 34 centers across 3 countries from July 18, 2019, to October 25, 2021. Participants were patients with MI (either ST segment or non-ST segment elevated) and multivessel disease who were hospitalized after successful treatment of the culprit lesion. Major exclusion criteria included a nonculprit lesion in the left main coronary artery and unclear identification of the culprit lesion. Data analysis was performed from March to May 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Culprit-only treatment or physiology-guided complete revascularization of nonculprit lesions."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a patient-oriented composite end point of death, MI, stroke, or ischemia-driven revascularization. Secondary end points included a composite of cardiovascular death or MI and rate of heart failure hospitalizations."
        },
        {
          "label": "RESULTS",
          "text": "Among 1445 patients enrolled in the trial, the median (IQR) age was 80 (77-84) years; 917 patients were male (63.5%) and 528 female (36.5%). At 3 years, the primary outcome occurred in 165 patients (22.9%) in the physiology-guided complete revascularization group and 216 patients (29.8%) in the culprit-only group (hazard ratio [HR], 0.72; 95% CI, 0.58-0.88; P = .002). The key secondary outcome of cardiovascular death or MI occurred in a significantly lower number of patients in the physiology-guided complete revascularization group (92 patients [12.8%]) compared with the culprit-only group (132 patients [18.2%]; HR, 0.66; 95% CI, 0.50-0.88; P = .004). Hospitalizations for heart failure were more frequent in the culprit-only group compared with the physiology-guided complete group (143 [19.7%] vs 103 [14.3%]; HR, 0.73; 95% CI, 0.54-0.97; P = .03)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In patients 75 years or older with MI and multivessel disease, the benefit of physiology-guided complete revascularization over culprit-lesion-only treatment was sustained at 3 years."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03772743."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40879426/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1001/jamacardio.2025.3099",
      "dateReceived": "2025-09-26T23:22:04.330Z",
      "isNew": false,
      "summary": "In elderly patients with heart attack and multiple blocked arteries, treating all blockages guided by physiology provided lasting benefits compared to treating only the main blockage."
    },
    {
      "id": "62def2d2915f",
      "title": "Effect of Aficamten Compared With Metoprolol on Echocardiographic Measures in Symptomatic Obstructive Hypertrophic Cardiomyopathy: MAPLE-HCM.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48287095/117629",
      "abstract": "Beta-blockers have formed the mainstay of first-line therapy for symptomatic obstructive hypertrophic cardiomyopathy (HCM) for decades. Aficamten, compared with placebo, lowered left ventricular outflow tract gradients (LVOT-G), improved measures of left ventricular (LV) diastolic function, and showed evidence of favorable remodeling when added to standard of care medical therapy in SEQUOIA-HCM. The comparative effectiveness of monotherapy with aficamten vs metoprolol was investigated in MAPLE-HCM. This study evaluated the effect of monotherapy with aficamten compared with metoprolol on cardiac structure and function in participants enrolled in the MAPLE-HCM study. Serial echocardiograms and other clinical measures were collected over 24 weeks in participants receiving escalating doses of aficamten 5 to 20 mg or metoprolol 50 to 200 mg. The study enrolled 175 participants (mean age 58 ± 13 years, 42% women, 80% White, 14% Asian). Mean left ventricular ejection fraction (LVEF) was 68% ± 4% with resting and Valsalva LVOT-G of 47 ± 29 mm Hg and 74 ± 33 mm Hg, respectively. Compared with metoprolol, aficamten decreased resting LVOT-G (-30 mm Hg [95% CI: -37 to -23 mm Hg]; P < 0.001) and Valsalva LVOT-G (-35 mm Hg [95% CI: -44 to -26 mm Hg]; P < 0.001); reduced left atrial volume index (left atrial volume index -7.0 mL/m [95% CI: -9.1 to -4.8 mL/m]; P < 0.001); and improved E/e' (lateral E/e' -2.8 [95% CI: -4.0 to -1.6]; P < 0.001; septal E/e' -3.1 [95% CI: -4.5 to -1.7]; P < 0.001). Maximal wall thickness decreased (-1.0 mm [95% CI: -1.8 to -0.2 mm]; P = 0.02). LVEF, absolute LV global longitudinal strain, and absolute global circumferential strain decreased (LVEF -4% [95% CI: -5% to -3%]; global longitudinal strain -1.2% [95% CI: -1.8% to -0.5%]; global circumferential strain -2.5% [95% CI: -3.7% to -1.3%]; all P < 0.001) with no significant change in resting cardiac output between groups. Mitral valve systolic anterior motion and mitral regurgitation significantly decreased with aficamten at week 24. In addition to lowering Valsalva LVOT-G and left atrial volume index, treatment with aficamten compared with metoprolol over 24 weeks led to improvement in measures of LV diastolic function, mitral valve systolic anterior motion, and mitral regurgitation. Aficamten therapy resulted in modest reduction in LVEF compared with metoprolol. These exploratory findings further support the overall superiority of therapy with aficamten over metoprolol demonstrated in MAPLE-HCM with evidence of favorable changes in multiple echocardiographic measures of cardiac structure and function in patients with symptomatic obstructive HCM. (Metoprolol vs Aficamten in Patients with LVOT Obstruction on Exercise Capacity in HCM [MAPLE-HCM]; NCT05767346).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Beta-blockers have formed the mainstay of first-line therapy for symptomatic obstructive hypertrophic cardiomyopathy (HCM) for decades. Aficamten, compared with placebo, lowered left ventricular outflow tract gradients (LVOT-G), improved measures of left ventricular (LV) diastolic function, and showed evidence of favorable remodeling when added to standard of care medical therapy in SEQUOIA-HCM. The comparative effectiveness of monotherapy with aficamten vs metoprolol was investigated in MAPLE-HCM."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study evaluated the effect of monotherapy with aficamten compared with metoprolol on cardiac structure and function in participants enrolled in the MAPLE-HCM study."
        },
        {
          "label": "METHODS",
          "text": "Serial echocardiograms and other clinical measures were collected over 24 weeks in participants receiving escalating doses of aficamten 5 to 20 mg or metoprolol 50 to 200 mg."
        },
        {
          "label": "RESULTS",
          "text": "The study enrolled 175 participants (mean age 58 ± 13 years, 42% women, 80% White, 14% Asian). Mean left ventricular ejection fraction (LVEF) was 68% ± 4% with resting and Valsalva LVOT-G of 47 ± 29 mm Hg and 74 ± 33 mm Hg, respectively. Compared with metoprolol, aficamten decreased resting LVOT-G (-30 mm Hg [95% CI: -37 to -23 mm Hg]; P < 0.001) and Valsalva LVOT-G (-35 mm Hg [95% CI: -44 to -26 mm Hg]; P < 0.001); reduced left atrial volume index (left atrial volume index -7.0 mL/m [95% CI: -9.1 to -4.8 mL/m]; P < 0.001); and improved E/e' (lateral E/e' -2.8 [95% CI: -4.0 to -1.6]; P < 0.001; septal E/e' -3.1 [95% CI: -4.5 to -1.7]; P < 0.001). Maximal wall thickness decreased (-1.0 mm [95% CI: -1.8 to -0.2 mm]; P = 0.02). LVEF, absolute LV global longitudinal strain, and absolute global circumferential strain decreased (LVEF -4% [95% CI: -5% to -3%]; global longitudinal strain -1.2% [95% CI: -1.8% to -0.5%]; global circumferential strain -2.5% [95% CI: -3.7% to -1.3%]; all P < 0.001) with no significant change in resting cardiac output between groups. Mitral valve systolic anterior motion and mitral regurgitation significantly decreased with aficamten at week 24."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In addition to lowering Valsalva LVOT-G and left atrial volume index, treatment with aficamten compared with metoprolol over 24 weeks led to improvement in measures of LV diastolic function, mitral valve systolic anterior motion, and mitral regurgitation. Aficamten therapy resulted in modest reduction in LVEF compared with metoprolol. These exploratory findings further support the overall superiority of therapy with aficamten over metoprolol demonstrated in MAPLE-HCM with evidence of favorable changes in multiple echocardiographic measures of cardiac structure and function in patients with symptomatic obstructive HCM. (Metoprolol vs Aficamten in Patients with LVOT Obstruction on Exercise Capacity in HCM [MAPLE-HCM]; NCT05767346)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40932433/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.022",
      "dateReceived": "2025-09-26T23:22:04.330Z",
      "isNew": false,
      "summary": "Aficamten treatment improved diastolic function, mitral valve dynamics, and mitral regurgitation compared to metoprolol, with a slight reduction in left ventricular ejection fraction."
    },
    {
      "id": "25766c146228",
      "title": "Efficacy of GLP-1 receptor agonists in patients with obesity and heart failure with preserved ejection fraction: A systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48287095/117672",
      "abstract": "Obesity increases the risk of heart failure with preserved ejection fraction (HFpEF). Glucagon-like-peptide-1 receptor agonists (GLP-1 RAs) appear to improve cardiovascular outcomes in these patients; however, this benefit remains uncertain. We performed a meta-analysis of randomised controlled trials (RCTs) assessing GLP-1 RAs in obese patients with HFpEF. Outcomes included all-cause and cardiovascular mortality, heart failure events, and quality of life. Embase, PubMed, and Cochrane were systematically searched. A random-effects model calculated risk ratios (RRs) or mean differences (MD) with 95% confidence intervals (CIs). Three RCTs with a total of 1876 patients were included, of whom 50% (937) were randomised to GLP-1 RA and followed for a mean of 69.3 weeks. There was no difference between groups regarding cardiovascular mortality (RR: 0.79; 95% CI: 0.22-2.88; p = 0.72), all-cause mortality (RR: 0.98; 95% CI: 0.58-1.64; p = 0.93), or serious adverse events (RR: 0.66; 95% CI: 0.40-1.09; p = 0.10). However, compared to placebo, GLP-1 RAs significantly reduced heart failure events (RR: 0.40; 95% CI: 0.22-0.73; p = 0.003), improved quality of life (KCCQ-CSS mean difference [MD]: 7.23 points; 95% CI: 4.89-9.56), decreased body weight (MD: -9.76 kg; 95% CI: -13.50 to -6.01), and enhanced functional capacity (6MWD MD: 16.54 m; 95% CI: 10.18-22.91). Nonetheless, GLP-1 RAs increased the risk of drug discontinuation due to adverse events (RR: 2.36; 95% CI: 1.16-4.79; p = 0.02), primarily gastrointestinal (RR: 4.01; 95% CI: 2.15-7.45; p < 0.01). GLP-1 RAs significantly reduced heart failure events, improved KCCQ-CSS score, reduced body weight, and improved 6MWD compared to placebo.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Obesity increases the risk of heart failure with preserved ejection fraction (HFpEF). Glucagon-like-peptide-1 receptor agonists (GLP-1 RAs) appear to improve cardiovascular outcomes in these patients; however, this benefit remains uncertain."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We performed a meta-analysis of randomised controlled trials (RCTs) assessing GLP-1 RAs in obese patients with HFpEF. Outcomes included all-cause and cardiovascular mortality, heart failure events, and quality of life. Embase, PubMed, and Cochrane were systematically searched. A random-effects model calculated risk ratios (RRs) or mean differences (MD) with 95% confidence intervals (CIs)."
        },
        {
          "label": "RESULTS",
          "text": "Three RCTs with a total of 1876 patients were included, of whom 50% (937) were randomised to GLP-1 RA and followed for a mean of 69.3 weeks. There was no difference between groups regarding cardiovascular mortality (RR: 0.79; 95% CI: 0.22-2.88; p = 0.72), all-cause mortality (RR: 0.98; 95% CI: 0.58-1.64; p = 0.93), or serious adverse events (RR: 0.66; 95% CI: 0.40-1.09; p = 0.10). However, compared to placebo, GLP-1 RAs significantly reduced heart failure events (RR: 0.40; 95% CI: 0.22-0.73; p = 0.003), improved quality of life (KCCQ-CSS mean difference [MD]: 7.23 points; 95% CI: 4.89-9.56), decreased body weight (MD: -9.76 kg; 95% CI: -13.50 to -6.01), and enhanced functional capacity (6MWD MD: 16.54 m; 95% CI: 10.18-22.91). Nonetheless, GLP-1 RAs increased the risk of drug discontinuation due to adverse events (RR: 2.36; 95% CI: 1.16-4.79; p = 0.02), primarily gastrointestinal (RR: 4.01; 95% CI: 2.15-7.45; p < 0.01)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1 RAs significantly reduced heart failure events, improved KCCQ-CSS score, reduced body weight, and improved 6MWD compared to placebo."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40937512/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1111/dom.70102",
      "dateReceived": "2025-09-26T23:22:04.329Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists decreased heart failure events, enhanced quality of life, reduced weight, and improved exercise capacity."
    }
  ]
}