{
  "updated_at": "2025-12-24T23:26:38.993Z",
  "articles": [
    {
      "id": "ebc96532ec7b",
      "title": "Safety and efficiency of diagnostic strategies for ruling out pulmonary embolism in patients with chronic lung disease: an individual-patient data meta-analysis.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49460464/118446",
      "abstract": "The optimal diagnostic management of patients with chronic lung disease (CLD) and suspected pulmonary embolism (PE) is unclear. The aim of this study was to evaluate the performance of PE diagnostic strategies in patients with and without CLD. This is a secondary analysis of an individual-patient data meta-analysis (PROSPERO CRD42018089366) of prospective or cross-sectional studies evaluating conventional (Wells or revised Geneva score with fixed or age-adjusted D-dimer) and newer (YEARS and the Pulmonary Embolism Graduated D-dimer Study algorithms) diagnostic strategies. Main outcomes were safety and efficiency. Safety was defined by the failure rate (proportion of patients diagnosed with venous thromboembolism during initial workup or follow-up among those in whom PE was considered ruled out at baseline without imaging). Efficiency was defined as the proportion of patients in whom PE was considered excluded without the need for imaging among all patients. Twelve studies, representing 16 990 patients (2201 patients with CLD) were included. The safety of each strategy was comparable in patients with and without CLD, whereas efficiency of the strategies was lower in patients with CLD. In patients with CLD, the predicted failure rate varied between 0.58% (95% CI, 0.10%-3.20%) and 1.06% (95% CI, 0.44%-2.53%), and between 2.54% (95% CI, 1.45%-4.39%) and 3.12% (95% CI, 2.04%-4.74%) for conventional and newer diagnostic strategies, respectively. The predicted efficiency was 19.0% to 33.2% and 35.8% to 43.9% for conventional and newer diagnostic strategies, respectively. In patients with CLD, diagnostic failure rate seemed slightly lower with conventional diagnostic strategies, but more patients would need imaging to rule out PE, compared with newer diagnostic strategies.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The optimal diagnostic management of patients with chronic lung disease (CLD) and suspected pulmonary embolism (PE) is unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this study was to evaluate the performance of PE diagnostic strategies in patients with and without CLD."
        },
        {
          "label": "METHODS",
          "text": "This is a secondary analysis of an individual-patient data meta-analysis (PROSPERO CRD42018089366) of prospective or cross-sectional studies evaluating conventional (Wells or revised Geneva score with fixed or age-adjusted D-dimer) and newer (YEARS and the Pulmonary Embolism Graduated D-dimer Study algorithms) diagnostic strategies. Main outcomes were safety and efficiency. Safety was defined by the failure rate (proportion of patients diagnosed with venous thromboembolism during initial workup or follow-up among those in whom PE was considered ruled out at baseline without imaging). Efficiency was defined as the proportion of patients in whom PE was considered excluded without the need for imaging among all patients."
        },
        {
          "label": "RESULTS",
          "text": "Twelve studies, representing 16 990 patients (2201 patients with CLD) were included. The safety of each strategy was comparable in patients with and without CLD, whereas efficiency of the strategies was lower in patients with CLD. In patients with CLD, the predicted failure rate varied between 0.58% (95% CI, 0.10%-3.20%) and 1.06% (95% CI, 0.44%-2.53%), and between 2.54% (95% CI, 1.45%-4.39%) and 3.12% (95% CI, 2.04%-4.74%) for conventional and newer diagnostic strategies, respectively. The predicted efficiency was 19.0% to 33.2% and 35.8% to 43.9% for conventional and newer diagnostic strategies, respectively."
        },
        {
          "label": "CONCLUSION",
          "text": "In patients with CLD, diagnostic failure rate seemed slightly lower with conventional diagnostic strategies, but more patients would need imaging to rule out PE, compared with newer diagnostic strategies."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161416/",
      "pubDate": "2025 Oct 27",
      "doi": "10.1016/j.jtha.2025.10.004",
      "dateReceived": "2025-12-24T23:26:37.339Z",
      "isNew": true
    },
    {
      "id": "782bc104d390",
      "title": "Therapeutic Exercise Progression in Patients with Nonspecific Low Back Pain: A Systematic Review.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49460464/118361",
      "abstract": "This systematic review aimed to identify and synthesize the objective and subjective criteria currently used to guide the progression of therapeutic exercise during the rehabilitation of adults with nonspecific low back pain (NSLBP). A secondary objective was to determine whether the use of those progression criteria enhances the effectiveness of exercise interventions compared to protocols without specific criteria. A comprehensive search was performed across three electronic databases and supplemented by a manual reference screening. Eligible studies were randomized controlled trials (RCTs) including adults (>18 years) with NSLBP where at least one group received therapeutic exercise with defined progression criteria. Study selection and full-text screening were followed by risk of bias assessment using the Cochrane Risk of Bias 2 tool. A total of 47 RCTs met the inclusion criteria. Due to the heterogeneity of included studies, a qualitative synthesis was conducted. Progression criteria were found to be both subjective and objective. Overall, intervention groups using predefined progression criteria showed greater short- and medium-term improvements than controls. However, only a subset of low-risk-of-bias studies confirmed these effects, and long-term benefits were rarely reported. Exercise progression based on specific criteria appears to offer promising benefits, particularly in the short-term reduction of pain and improvement in function. However, limitations persist regarding the direct applicability of these findings to clinical practice. Future research should aim to further standardize methodologies and establish measurable, clearly defined progression criteria for exercise-based interventions in patients with NSLBP.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This systematic review aimed to identify and synthesize the objective and subjective criteria currently used to guide the progression of therapeutic exercise during the rehabilitation of adults with nonspecific low back pain (NSLBP). A secondary objective was to determine whether the use of those progression criteria enhances the effectiveness of exercise interventions compared to protocols without specific criteria."
        },
        {
          "label": "METHODS",
          "text": "A comprehensive search was performed across three electronic databases and supplemented by a manual reference screening. Eligible studies were randomized controlled trials (RCTs) including adults (>18 years) with NSLBP where at least one group received therapeutic exercise with defined progression criteria. Study selection and full-text screening were followed by risk of bias assessment using the Cochrane Risk of Bias 2 tool."
        },
        {
          "label": "RESULTS",
          "text": "A total of 47 RCTs met the inclusion criteria. Due to the heterogeneity of included studies, a qualitative synthesis was conducted. Progression criteria were found to be both subjective and objective. Overall, intervention groups using predefined progression criteria showed greater short- and medium-term improvements than controls. However, only a subset of low-risk-of-bias studies confirmed these effects, and long-term benefits were rarely reported."
        },
        {
          "label": "CONCLUSION",
          "text": "Exercise progression based on specific criteria appears to offer promising benefits, particularly in the short-term reduction of pain and improvement in function. However, limitations persist regarding the direct applicability of these findings to clinical practice. Future research should aim to further standardize methodologies and establish measurable, clearly defined progression criteria for exercise-based interventions in patients with NSLBP."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41356704/",
      "pubDate": "2025",
      "doi": "10.2147/JPR.S539160",
      "dateReceived": "2025-12-24T23:26:37.339Z",
      "isNew": true
    },
    {
      "id": "d8cf0bbfa8b9",
      "title": "Rapid, point-of-care antigen tests for diagnosis of SARS-CoV-2 infection.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49460464/118357",
      "abstract": "Accurate rapid diagnostic tests for SARS-CoV-2 infection could help manage the COVID-19 pandemic by potentially increasing access to testing and speed detection of infection, as well as informing clinical and public health management decisions to reduce transmission. Previous iterations of this review provided clear and conclusive evidence of superior test performance in those experiencing possible signs and symptoms of Covid-19. However, test performance in asymptomatic individuals and sensitivity by setting and indication for testing remains unclear. This is the fourth iteration of this review, first published in 2020. To assess the diagnostic accuracy of rapid, point-of-care antigen tests (Ag-RDTs) for diagnosis of SARS-CoV-2 infection in asymptomatic population groups. We searched the COVID-19 Open Access Project living evidence database from the University of Bern (which includes daily updates from MEDLINE and Embase and preprints from medRxiv and bioRxiv) on 17 February 2022. We included independent evaluations from national reference laboratories, FIND and the Diagnostics Global Health website. We did not apply language restrictions. We included test accuracy studies of any design that evaluated commercially produced, rapid antigen tests in asymptomatic people tested because of known or suspected contact with SARS-CoV-2 infection, known SARS-CoV-2 infection or known absence of infection, or those who were being screened for infection. We included evaluations of single applications of a test (one test result reported per person). Reference standards for presence or absence of infection were any laboratory-based molecular test (primarily reverse transcription polymerase chain reaction (RT-PCR)). We used standard screening procedures with three reviewers. Two reviewers independently carried out quality assessment (using the QUADAS-2 tool) and extracted study results. Other study characteristics were extracted by one review author and checked by a second. We present sensitivity and specificity with 95% confidence intervals (CIs) for each test, and pooled data using the bivariate model. We investigated heterogeneity by including indicator variables in the random-effects logistic regression models. We tabulated results by test manufacturer and compliance with manufacturer instructions for use and according to symptom status. We included 146 study cohorts (described in 130 study reports). The main results relate to 164 evaluations of single test applications including 144,250 unique samples (7104 with confirmed SARS-CoV-2) obtained from asymptomatic or mainly asymptomatic populations. Studies were mainly conducted in Europe (85/146, 58%), and evaluated 41 different commercial antigen assays (test kit). Only six studies compared two or more brands of test. Nearly all studies (96%) used RT-PCR alone to define presence or absence of infection. Risk of bias was high because of participant selection (13, 9%); interpretation of the index test (3, 2%); weaknesses in the reference standard for absence of infection (3, 2%); and participant flow and timing (46, 32%). Characteristics of participants (11, 8%) and index test delivery (117, 80%) differed from the way in which and in whom the test was intended to be used. Estimates of sensitivity varied considerably between studies, with consistently high specificities. Average sensitivity was 55.0% (95% CI 50.9%, 59.0%) and average specificity was 99.5% (95% CI 99.5%, 99.6%) across the 147 evaluations of Ag-RDTs reporting both sensitivity and specificity (149,251 samples, 7636 cases). Average sensitivity was higher when epidemiological exposure to SARS-CoV-2 was suspected (58.6%, 95% CI 51.4% to 65.5%; 43 evaluations; 15,516 samples, 1483 cases) compared to where COVID-19 testing was reported to be widely available to anyone on presentation for testing (53.0%, 95% CI 48.4% to 57.5%; 103 evaluations; 129,032 samples, 5660 cases); however CIs overlapped, limiting the inference that can be drawn from these data. Average specificity was similarly high for both groups (99.4% and 99.6%). Sensitivity was generally lower when used in a screening context (summary values from 40.6% to 42.1% for three of four screening settings) compared to testing asymptomatic individuals at Covid-19 test centres (56.7%) or emergency departments (54.7%). We observed a decline in summary sensitivities as measures of sample viral load decreased. Sensitivity varied between brands. When tests were used according to manufacturer instructions, average sensitivities by brand ranged from 36.3% to 78.8% in asymptomatic participants (14 assays with sufficient data for pooling). None of the assays met the WHO acceptable performance standard for sensitivity (of 80%) based on meta-analysis; however, sensitivities from individual studies (where meta-analysis was not possible) exceeded 80% for three assays. The WHO acceptable performance criterion of 97% specificity was met by all but four assays (based on individual studies or meta-analysis) when tests were used according to manufacturer instructions. At 0.5% prevalence using summary data for asymptomatic people, where testing was widely available and where epidemiological exposure to COVID-19 was suspected, resulting PPVs would be 40% and 33%, meaning that 3 in 5 or 2 in 3 positive results will be false positives, and between 1 in 2 and 2 in 5 cases will be missed. Evidence for antigen testing in asymptomatic cohorts has increased considerably since the publication of the previous update of this review. Average sensitivities remain lower for testing of asymptomatic when compared to symptomatic individuals; however, there is an indication that sensitivities may be higher where epidemiological exposure to SARS-CoV-2 is suspected compared to testing any asymptomatic individual regardless of indication. Sensitivities were particularly low when antigen tests were used in screening settings. Assays from different manufacturers also vary in sensitivity, indicating the need for appropriate clinical validation of a particular antigen test in a given intended use setting prior to more widespread deployment. Further research is needed to evaluate the effectiveness of screening programmes at reducing transmission of infection, whether mass screening or targeted approaches, including schools, healthcare setting and traveller screening. This paper presents independent research supported by the NIHR Birmingham Biomedical Research Centre, University Hospitals Birmingham NHS Foundation Trust, and the University of Birmingham. The views expressed are those of the author(s) and not necessarily those of the NHS, the NIHR or the Department of Health and Social Care. Protocol (2020) doi: 10.1002/14651858.CD013596.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Accurate rapid diagnostic tests for SARS-CoV-2 infection could help manage the COVID-19 pandemic by potentially increasing access to testing and speed detection of infection, as well as informing clinical and public health management decisions to reduce transmission. Previous iterations of this review provided clear and conclusive evidence of superior test performance in those experiencing possible signs and symptoms of Covid-19. However, test performance in asymptomatic individuals and sensitivity by setting and indication for testing remains unclear. This is the fourth iteration of this review, first published in 2020."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the diagnostic accuracy of rapid, point-of-care antigen tests (Ag-RDTs) for diagnosis of SARS-CoV-2 infection in asymptomatic population groups."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the COVID-19 Open Access Project living evidence database from the University of Bern (which includes daily updates from MEDLINE and Embase and preprints from medRxiv and bioRxiv) on 17 February 2022. We included independent evaluations from national reference laboratories, FIND and the Diagnostics Global Health website. We did not apply language restrictions."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included test accuracy studies of any design that evaluated commercially produced, rapid antigen tests in asymptomatic people tested because of known or suspected contact with SARS-CoV-2 infection, known SARS-CoV-2 infection or known absence of infection, or those who were being screened for infection. We included evaluations of single applications of a test (one test result reported per person). Reference standards for presence or absence of infection were any laboratory-based molecular test (primarily reverse transcription polymerase chain reaction (RT-PCR))."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We used standard screening procedures with three reviewers. Two reviewers independently carried out quality assessment (using the QUADAS-2 tool) and extracted study results. Other study characteristics were extracted by one review author and checked by a second. We present sensitivity and specificity with 95% confidence intervals (CIs) for each test, and pooled data using the bivariate model. We investigated heterogeneity by including indicator variables in the random-effects logistic regression models. We tabulated results by test manufacturer and compliance with manufacturer instructions for use and according to symptom status."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 146 study cohorts (described in 130 study reports). The main results relate to 164 evaluations of single test applications including 144,250 unique samples (7104 with confirmed SARS-CoV-2) obtained from asymptomatic or mainly asymptomatic populations. Studies were mainly conducted in Europe (85/146, 58%), and evaluated 41 different commercial antigen assays (test kit). Only six studies compared two or more brands of test. Nearly all studies (96%) used RT-PCR alone to define presence or absence of infection. Risk of bias was high because of participant selection (13, 9%); interpretation of the index test (3, 2%); weaknesses in the reference standard for absence of infection (3, 2%); and participant flow and timing (46, 32%). Characteristics of participants (11, 8%) and index test delivery (117, 80%) differed from the way in which and in whom the test was intended to be used. Estimates of sensitivity varied considerably between studies, with consistently high specificities. Average sensitivity was 55.0% (95% CI 50.9%, 59.0%) and average specificity was 99.5% (95% CI 99.5%, 99.6%) across the 147 evaluations of Ag-RDTs reporting both sensitivity and specificity (149,251 samples, 7636 cases). Average sensitivity was higher when epidemiological exposure to SARS-CoV-2 was suspected (58.6%, 95% CI 51.4% to 65.5%; 43 evaluations; 15,516 samples, 1483 cases) compared to where COVID-19 testing was reported to be widely available to anyone on presentation for testing (53.0%, 95% CI 48.4% to 57.5%; 103 evaluations; 129,032 samples, 5660 cases); however CIs overlapped, limiting the inference that can be drawn from these data. Average specificity was similarly high for both groups (99.4% and 99.6%). Sensitivity was generally lower when used in a screening context (summary values from 40.6% to 42.1% for three of four screening settings) compared to testing asymptomatic individuals at Covid-19 test centres (56.7%) or emergency departments (54.7%). We observed a decline in summary sensitivities as measures of sample viral load decreased. Sensitivity varied between brands. When tests were used according to manufacturer instructions, average sensitivities by brand ranged from 36.3% to 78.8% in asymptomatic participants (14 assays with sufficient data for pooling). None of the assays met the WHO acceptable performance standard for sensitivity (of 80%) based on meta-analysis; however, sensitivities from individual studies (where meta-analysis was not possible) exceeded 80% for three assays. The WHO acceptable performance criterion of 97% specificity was met by all but four assays (based on individual studies or meta-analysis) when tests were used according to manufacturer instructions. At 0.5% prevalence using summary data for asymptomatic people, where testing was widely available and where epidemiological exposure to COVID-19 was suspected, resulting PPVs would be 40% and 33%, meaning that 3 in 5 or 2 in 3 positive results will be false positives, and between 1 in 2 and 2 in 5 cases will be missed."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Evidence for antigen testing in asymptomatic cohorts has increased considerably since the publication of the previous update of this review. Average sensitivities remain lower for testing of asymptomatic when compared to symptomatic individuals; however, there is an indication that sensitivities may be higher where epidemiological exposure to SARS-CoV-2 is suspected compared to testing any asymptomatic individual regardless of indication. Sensitivities were particularly low when antigen tests were used in screening settings. Assays from different manufacturers also vary in sensitivity, indicating the need for appropriate clinical validation of a particular antigen test in a given intended use setting prior to more widespread deployment. Further research is needed to evaluate the effectiveness of screening programmes at reducing transmission of infection, whether mass screening or targeted approaches, including schools, healthcare setting and traveller screening."
        },
        {
          "label": "FUNDING",
          "text": "This paper presents independent research supported by the NIHR Birmingham Biomedical Research Centre, University Hospitals Birmingham NHS Foundation Trust, and the University of Birmingham. The views expressed are those of the author(s) and not necessarily those of the NHS, the NIHR or the Department of Health and Social Care."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2020) doi: 10.1002/14651858.CD013596."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41312797/",
      "pubDate": "2025 Nov 28",
      "doi": "10.1002/14651858.CD013705.pub4",
      "dateReceived": "2025-12-24T23:26:37.339Z",
      "isNew": true
    },
    {
      "id": "3c5eeaf305a8",
      "title": "Targeting IL-22RA1 with temtokibart: A novel approach in atopic dermatitis: Phase 2a monotherapy study results.",
      "journal": "J Allergy Clin Immunol",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Dermatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118415",
      "abstract": "Atopic dermatitis (AD) is a chronic inflammatory skin disease in which increased IL-22 expression contributes to epidermal hyperplasia and barrier defects. Temtokibart is a monoclonal antibody targeting IL-22RA1 (IL-22 receptor subunit alpha-1), blocking the signaling of IL-22 and potentially also of IL-20 and IL-24. We evaluated the efficacy and safety of temtokibart in adults with moderate-to-severe AD. In this phase 2a study (NCT04922021), 58 adults were randomized 1:1 to subcutaneous temtokibart 450 mg or placebo every 2 weeks for 16 weeks, with an additional dose (450 mg) at week 1, followed by additional 16 weeks of safety follow-up. The primary end point was change in Eczema Area Severity Index (EASI) from baseline to week 16. Biomarkers in serum, including IL-22, were analyzed as an exploratory end point. Mean change in EASI from baseline to week 16 was significantly greater for temtokibart compared to placebo (-15.3 vs -3.5; P = .003), corresponding to 65.4% and 19.7% improvement for temtokibart and placebo groups, respectively. At week 16, greater proportions of patients receiving temtokibart relative to placebo obtained EASI-75 (41.6% vs 13.7%; P = .011), EASI-90 (30.8% vs 3.5%; P = .003), and EASI-100 (20.9% vs 0%; P = .006). Treatment with temtokibart was well tolerated, and no safety signals were observed. Further, temtokibart treatment was associated with a general reduction of systemic inflammatory proteins. This proof-of-concept study demonstrates that targeting the IL-22 pathway with temtokibart is clinically effective with a favorable safety profile.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Atopic dermatitis (AD) is a chronic inflammatory skin disease in which increased IL-22 expression contributes to epidermal hyperplasia and barrier defects. Temtokibart is a monoclonal antibody targeting IL-22RA1 (IL-22 receptor subunit alpha-1), blocking the signaling of IL-22 and potentially also of IL-20 and IL-24."
        },
        {
          "label": "OBJECTIVE",
          "text": "We evaluated the efficacy and safety of temtokibart in adults with moderate-to-severe AD."
        },
        {
          "label": "METHODS",
          "text": "In this phase 2a study (NCT04922021), 58 adults were randomized 1:1 to subcutaneous temtokibart 450 mg or placebo every 2 weeks for 16 weeks, with an additional dose (450 mg) at week 1, followed by additional 16 weeks of safety follow-up. The primary end point was change in Eczema Area Severity Index (EASI) from baseline to week 16. Biomarkers in serum, including IL-22, were analyzed as an exploratory end point."
        },
        {
          "label": "RESULTS",
          "text": "Mean change in EASI from baseline to week 16 was significantly greater for temtokibart compared to placebo (-15.3 vs -3.5; P = .003), corresponding to 65.4% and 19.7% improvement for temtokibart and placebo groups, respectively. At week 16, greater proportions of patients receiving temtokibart relative to placebo obtained EASI-75 (41.6% vs 13.7%; P = .011), EASI-90 (30.8% vs 3.5%; P = .003), and EASI-100 (20.9% vs 0%; P = .006). Treatment with temtokibart was well tolerated, and no safety signals were observed. Further, temtokibart treatment was associated with a general reduction of systemic inflammatory proteins."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This proof-of-concept study demonstrates that targeting the IL-22 pathway with temtokibart is clinically effective with a favorable safety profile."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41232575/",
      "pubDate": "2025 Nov 11",
      "doi": "10.1016/j.jaci.2025.08.034",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "cd29e2bb7bd7",
      "title": "Potent P2Y(12) Inhibitor Monotherapy vs DAPT After PCI in Patients With and Without STEMI: The NEO-MINDSET Substudy.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118407",
      "abstract": "The effects of very early aspirin withdrawal with potent P2Y inhibitor monotherapy after percutaneous coronary intervention may differ based on acute coronary syndrome (ACS) presentation. This prespecified analysis from the NEO-MINDSET trial evaluated whether treatment effects of early aspirin discontinuation differ between ST-segment elevation myocardial infarction (STEMI) and non-ST-segment elevation ACS (NSTE-ACS; defined as unstable angina or non-ST-segment elevation myocardial infarction). NEO-MINDSET randomized ACS patients to potent P2Y inhibitor monotherapy initiated within 4 days of hospitalization vs standard dual antiplatelet therapy (DAPT) with aspirin and a potent P2Y inhibitor for 12 months. Co-primary outcomes were: 1) the composite of all-cause death, myocardial infarction, stroke, and urgent target vessel revascularization (ischemic outcome); and 2) Bleeding Academic Research Consortium types 2, 3, or 5 bleeding (bleeding outcome). Of the 3,410 participants included, 2,119 (62.1%) presented with STEMI and 1,291 (37.9%) with NSTE-ACS. Among STEMI patients, an early aspirin-free strategy was associated with a higher rate of the co-primary ischemic composite outcome compared with DAPT at 1 year (8.2% vs 5.2%, respectively; HR: 1.60; 95% CI: 1.14-2.24), whereas among those with NSTE-ACS, ischemic event rates were similar between monotherapy and DAPT (5.1% vs 6.0%, respectively; HR: 0.84; 95% CI: 0.53-1.35; P for interaction = 0.030). The co-primary bleeding outcome was lower with monotherapy than with DAPT in both STEMI (HR: 0.37; 95% CI: 0.22-0.61) and NSTE-ACS (HR: 0.45; 95% CI: 0.23-0.86) populations (P for interaction = 0.650). In patients with STEMI treated with percutaneous coronary intervention, early aspirin withdrawal may be harmful, because it increases the risk of ischemic events. Conversely, in NSTE-ACS, potent P2Y inhibitor monotherapy may be a viable therapeutic option: Ischemic event rates were similar and bleeding was reduced compared with DAPT. (Percutaneous Coronary Intervention Followed by Antiplatelet Monotherapy in the Setting of Acute Coronary Syndromes [NEOMINDSET]; NCT04360720).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The effects of very early aspirin withdrawal with potent P2Y inhibitor monotherapy after percutaneous coronary intervention may differ based on acute coronary syndrome (ACS) presentation."
        },
        {
          "label": "OBJECTIVES",
          "text": "This prespecified analysis from the NEO-MINDSET trial evaluated whether treatment effects of early aspirin discontinuation differ between ST-segment elevation myocardial infarction (STEMI) and non-ST-segment elevation ACS (NSTE-ACS; defined as unstable angina or non-ST-segment elevation myocardial infarction)."
        },
        {
          "label": "METHODS",
          "text": "NEO-MINDSET randomized ACS patients to potent P2Y inhibitor monotherapy initiated within 4 days of hospitalization vs standard dual antiplatelet therapy (DAPT) with aspirin and a potent P2Y inhibitor for 12 months. Co-primary outcomes were: 1) the composite of all-cause death, myocardial infarction, stroke, and urgent target vessel revascularization (ischemic outcome); and 2) Bleeding Academic Research Consortium types 2, 3, or 5 bleeding (bleeding outcome)."
        },
        {
          "label": "RESULTS",
          "text": "Of the 3,410 participants included, 2,119 (62.1%) presented with STEMI and 1,291 (37.9%) with NSTE-ACS. Among STEMI patients, an early aspirin-free strategy was associated with a higher rate of the co-primary ischemic composite outcome compared with DAPT at 1 year (8.2% vs 5.2%, respectively; HR: 1.60; 95% CI: 1.14-2.24), whereas among those with NSTE-ACS, ischemic event rates were similar between monotherapy and DAPT (5.1% vs 6.0%, respectively; HR: 0.84; 95% CI: 0.53-1.35; P for interaction = 0.030). The co-primary bleeding outcome was lower with monotherapy than with DAPT in both STEMI (HR: 0.37; 95% CI: 0.22-0.61) and NSTE-ACS (HR: 0.45; 95% CI: 0.23-0.86) populations (P for interaction = 0.650)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with STEMI treated with percutaneous coronary intervention, early aspirin withdrawal may be harmful, because it increases the risk of ischemic events. Conversely, in NSTE-ACS, potent P2Y inhibitor monotherapy may be a viable therapeutic option: Ischemic event rates were similar and bleeding was reduced compared with DAPT. (Percutaneous Coronary Intervention Followed by Antiplatelet Monotherapy in the Setting of Acute Coronary Syndromes [NEOMINDSET]; NCT04360720)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41384891/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.058",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "3bb6615da412",
      "title": "Switching From Aspirin Monotherapy After Noncardioembolic Stroke: A Systematic Review and Network Meta-Analysis.",
      "journal": "Stroke",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118381",
      "abstract": "Patients who experience an ischemic stroke while on aspirin therapy present a clinical dilemma about optimal long-term secondary prevention. While switching to an alternative antithrombotic agent is often considered, the effectiveness of switching remains uncertain. We conducted a systematic review and network meta-analysis of randomized controlled trials reporting outcomes among patients with ischemic stroke while on aspirin and were either continued on aspirin or switched to an alternative antithrombotic therapy. Alternative antithrombotics included 2 trials of vitamin K antagonists (n=478), 3 trials of dual antiplatelet therapy (n=2229), 3 trials of direct oral anticoagulant (n=2660) monotherapy, and 1 trial of low-dose direct oral anticoagulant added onto aspirin (n=92). We excluded trials of patients with only short-term outcomes of 90 days or fewer, or those with cardioembolic sources of stroke requiring anticoagulation. Our primary outcome was recurrent ischemic stroke; the secondary outcome was a composite of ischemic stroke, myocardial infarction, and vascular death (or all-cause mortality). Outcomes reflect recurrent events measured over a median of ≈19 months (range 11-42 months). In the network portion of this meta-analysis, surface under the cumulative ranking curve rankings and pairwise meta-analyses were used to evaluate and compare the relative efficacy of alternative antithrombotic medications. Data were available from 9 studies (total N=5459 patients) for the outcome of recurrent ischemic stroke. Switching to another therapy was associated with a pooled relative risk of recurrent stroke of 0.88 (95% CI, 0.76-1.03) compared with continuing aspirin, with minimal heterogeneity (=0.93; ²=0). For the composite secondary outcome, 6 studies contributed data, yielding a pooled relative risk of 0.89 (95% CI, 0.72-1.10). In the network meta-analysis, dabigatran, apixaban, and aspirin+low-dose rivaroxaban ranked the highest among antithrombotic alternatives to aspirin, though none were significantly better than continuing aspirin. Rankings were similar when based on posterior estimates from the clinical trials and when using predictive distributions that incorporate between-study variance (ie, expected performance in future settings). Among patients experiencing ischemic stroke while taking aspirin, switching to an alternative antithrombotic therapy was not conclusively associated with a reduction in recurrent stroke and composite cardiovascular events. Trials are needed to determine whether specific antithrombotic strategies meaningfully improve outcomes in this high-risk population.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients who experience an ischemic stroke while on aspirin therapy present a clinical dilemma about optimal long-term secondary prevention. While switching to an alternative antithrombotic agent is often considered, the effectiveness of switching remains uncertain."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review and network meta-analysis of randomized controlled trials reporting outcomes among patients with ischemic stroke while on aspirin and were either continued on aspirin or switched to an alternative antithrombotic therapy. Alternative antithrombotics included 2 trials of vitamin K antagonists (n=478), 3 trials of dual antiplatelet therapy (n=2229), 3 trials of direct oral anticoagulant (n=2660) monotherapy, and 1 trial of low-dose direct oral anticoagulant added onto aspirin (n=92). We excluded trials of patients with only short-term outcomes of 90 days or fewer, or those with cardioembolic sources of stroke requiring anticoagulation. Our primary outcome was recurrent ischemic stroke; the secondary outcome was a composite of ischemic stroke, myocardial infarction, and vascular death (or all-cause mortality). Outcomes reflect recurrent events measured over a median of ≈19 months (range 11-42 months). In the network portion of this meta-analysis, surface under the cumulative ranking curve rankings and pairwise meta-analyses were used to evaluate and compare the relative efficacy of alternative antithrombotic medications."
        },
        {
          "label": "RESULTS",
          "text": "Data were available from 9 studies (total N=5459 patients) for the outcome of recurrent ischemic stroke. Switching to another therapy was associated with a pooled relative risk of recurrent stroke of 0.88 (95% CI, 0.76-1.03) compared with continuing aspirin, with minimal heterogeneity (=0.93; ²=0). For the composite secondary outcome, 6 studies contributed data, yielding a pooled relative risk of 0.89 (95% CI, 0.72-1.10). In the network meta-analysis, dabigatran, apixaban, and aspirin+low-dose rivaroxaban ranked the highest among antithrombotic alternatives to aspirin, though none were significantly better than continuing aspirin. Rankings were similar when based on posterior estimates from the clinical trials and when using predictive distributions that incorporate between-study variance (ie, expected performance in future settings)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients experiencing ischemic stroke while taking aspirin, switching to an alternative antithrombotic therapy was not conclusively associated with a reduction in recurrent stroke and composite cardiovascular events. Trials are needed to determine whether specific antithrombotic strategies meaningfully improve outcomes in this high-risk population."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41347302/",
      "pubDate": "2025 Dec 05",
      "doi": "10.1161/STROKEAHA.125.053030",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "4b061449431d",
      "title": "Scheduled birth at term for the prevention of pre-eclampsia (PREVENT-PE): an open-label randomised controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118348",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "faecf553f3ec",
      "title": "Lifestyle Interventions Addressing Blood Pressure in Children: A Systematic Review.",
      "journal": "JAMA Pediatr",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118313",
      "abstract": "The prevalence of high blood pressure in children is increasing, with health consequences reaching into adulthood. Individual-level interventions may help address the burden of high blood pressure at a population level, but there is less evidence from pediatric settings. To assess the effectiveness of school- or community-based lifestyle interventions to reduce high blood pressure in children (aged 3-18 years) and identify components that support effectiveness. Ovid MEDLINE, Embase, and PubMed were searched for studies from June 2013 to March 2024. Randomized clinical trials and quasi-experimental studies were assessed using the following strict inclusion criteria: longer than 6-month intervention duration, participants aged 3 to 18 years, major aim to modify cardiometabolic risk, and measurement of blood pressure before and after the intervention. Interventions aimed at specific patient groups were excluded. Quality assessment was performed using the Joanna Briggs Institute critical appraisal tools. Blood pressure before and after the intervention was extracted, with the mean difference in blood pressure recorded. Data analysis was performed from June 2023 to July 2024. A total of 27 studies were included, of which 13 reported a beneficial effect on blood pressure; 24 studies targeted physical activity, 15 targeted nutrition, 16 targeted education, and 11 included family involvement. Of 14 multicomponent studies, 9 reported a beneficial effect on blood pressure. In this systematic review, results indicate that lifestyle interventions can have a beneficial effect on blood pressure in the pediatric population, with multicomponent designs targeting both physical activity and nutrition showing the most promise. Future research should aim to further clarify intervention design and physical activity dosage, feasibility, and scalability, along with the long-term success of interventions that promote healthy blood pressure in children.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The prevalence of high blood pressure in children is increasing, with health consequences reaching into adulthood. Individual-level interventions may help address the burden of high blood pressure at a population level, but there is less evidence from pediatric settings."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the effectiveness of school- or community-based lifestyle interventions to reduce high blood pressure in children (aged 3-18 years) and identify components that support effectiveness."
        },
        {
          "label": "EVIDENCE REVIEW",
          "text": "Ovid MEDLINE, Embase, and PubMed were searched for studies from June 2013 to March 2024. Randomized clinical trials and quasi-experimental studies were assessed using the following strict inclusion criteria: longer than 6-month intervention duration, participants aged 3 to 18 years, major aim to modify cardiometabolic risk, and measurement of blood pressure before and after the intervention. Interventions aimed at specific patient groups were excluded. Quality assessment was performed using the Joanna Briggs Institute critical appraisal tools. Blood pressure before and after the intervention was extracted, with the mean difference in blood pressure recorded. Data analysis was performed from June 2023 to July 2024."
        },
        {
          "label": "FINDINGS",
          "text": "A total of 27 studies were included, of which 13 reported a beneficial effect on blood pressure; 24 studies targeted physical activity, 15 targeted nutrition, 16 targeted education, and 11 included family involvement. Of 14 multicomponent studies, 9 reported a beneficial effect on blood pressure."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review, results indicate that lifestyle interventions can have a beneficial effect on blood pressure in the pediatric population, with multicomponent designs targeting both physical activity and nutrition showing the most promise. Future research should aim to further clarify intervention design and physical activity dosage, feasibility, and scalability, along with the long-term success of interventions that promote healthy blood pressure in children."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324936/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamapediatrics.2025.4943",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "54a83d10ebd7",
      "title": "Trajectories of type 2 diabetes and cancer in 330 000 individuals with prediabetes: 20-year observational study in England.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118271",
      "abstract": "Higher than normal glucose concentrations have been linked to an increased risk of cancer. We aimed to describe the disease trajectories from prediabetes to cancer, accounting for the possible conversion to type 2 diabetes and risk of death. We used the Clinical Practice Research Datalink primary care records linked to hospital and mortality records to identify individuals aged 18-100 years with newly diagnosed prediabetes between Jan 1, 1998, and Nov 30, 2018, in England. Individuals were followed from the diagnosis of prediabetes until death or Nov 30, 2018, with two intermediate outcomes: type 2 diabetes and cancer. In a multistate model, we estimated state occupancy probabilities and lengths of stay (sojourn times) across eight states and seven transitions (eg, one transition from the prediabetes state to the cancer state; or three transitions from the prediabetes state to the type 2 diabetes, cancer, and death state). During a median follow-up of 7·7 years, 163 782 transitions occurred in 328 049 individuals. In both women and men, cancer incidence rates were greater in older individuals (aged ≥75 years at prediabetes diagnosis) and only marginally higher in those who developed type 2 diabetes versus those with prediabetes (over 10 years, the largest differences were 4·1 more cases per 1000 person-years in women and 4·8 more cases per 1000 person-years in men). 10 years after the diagnosis of prediabetes, the probability of remaining in the prediabetes state ranged from 23·2% (men aged ≥75 years at diagnosis) to 72·1% (men aged <55 years), the probability of death following prediabetes ranged from 1·2% (women aged <55 years) to 38·7% (women aged ≥75 years), the probability of developing type 2 diabetes and remaining in this state ranged from 7·9% (men aged ≥75 years) to 24·0% (women aged <55 years), and the probability of developing cancer and remaining in this state ranged from 1·9% (men aged <55 years) to 7·8% (men aged ≥65 to <75 years) in men and women. During the 10 years following the diagnosis of prediabetes, individuals spent between 5·34 years (men aged ≥75 years at diagnosis) to 8·34 years (men aged <55 years) in the prediabetes state. BMI, smoking, socioeconomic status, and ethnicity were associated with occupancy probabilities and sojourn times. The trajectories of type 2 diabetes and cancer following a diagnosis of prediabetes varied substantially by age at prediabetes diagnosis and, to a lesser extent, other sociodemographic and lifestyle factors, with most younger individuals (aged <55 years) remaining in the prediabetes state. Strategies to improve the prevention and early identification of type 2 diabetes and cancer in individuals with prediabetes should be tailored to the age at which prediabetes is diagnosed. National Institute for Health and Care Research (NIHR) Applied Research Collaboration, East Midlands, NIHR Leicester British Retail Consortium, Hope Against Cancer.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Higher than normal glucose concentrations have been linked to an increased risk of cancer. We aimed to describe the disease trajectories from prediabetes to cancer, accounting for the possible conversion to type 2 diabetes and risk of death."
        },
        {
          "label": "METHODS",
          "text": "We used the Clinical Practice Research Datalink primary care records linked to hospital and mortality records to identify individuals aged 18-100 years with newly diagnosed prediabetes between Jan 1, 1998, and Nov 30, 2018, in England. Individuals were followed from the diagnosis of prediabetes until death or Nov 30, 2018, with two intermediate outcomes: type 2 diabetes and cancer. In a multistate model, we estimated state occupancy probabilities and lengths of stay (sojourn times) across eight states and seven transitions (eg, one transition from the prediabetes state to the cancer state; or three transitions from the prediabetes state to the type 2 diabetes, cancer, and death state)."
        },
        {
          "label": "FINDINGS",
          "text": "During a median follow-up of 7·7 years, 163 782 transitions occurred in 328 049 individuals. In both women and men, cancer incidence rates were greater in older individuals (aged ≥75 years at prediabetes diagnosis) and only marginally higher in those who developed type 2 diabetes versus those with prediabetes (over 10 years, the largest differences were 4·1 more cases per 1000 person-years in women and 4·8 more cases per 1000 person-years in men). 10 years after the diagnosis of prediabetes, the probability of remaining in the prediabetes state ranged from 23·2% (men aged ≥75 years at diagnosis) to 72·1% (men aged <55 years), the probability of death following prediabetes ranged from 1·2% (women aged <55 years) to 38·7% (women aged ≥75 years), the probability of developing type 2 diabetes and remaining in this state ranged from 7·9% (men aged ≥75 years) to 24·0% (women aged <55 years), and the probability of developing cancer and remaining in this state ranged from 1·9% (men aged <55 years) to 7·8% (men aged ≥65 to <75 years) in men and women. During the 10 years following the diagnosis of prediabetes, individuals spent between 5·34 years (men aged ≥75 years at diagnosis) to 8·34 years (men aged <55 years) in the prediabetes state. BMI, smoking, socioeconomic status, and ethnicity were associated with occupancy probabilities and sojourn times."
        },
        {
          "label": "INTERPRETATION",
          "text": "The trajectories of type 2 diabetes and cancer following a diagnosis of prediabetes varied substantially by age at prediabetes diagnosis and, to a lesser extent, other sociodemographic and lifestyle factors, with most younger individuals (aged <55 years) remaining in the prediabetes state. Strategies to improve the prevention and early identification of type 2 diabetes and cancer in individuals with prediabetes should be tailored to the age at which prediabetes is diagnosed."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health and Care Research (NIHR) Applied Research Collaboration, East Midlands, NIHR Leicester British Retail Consortium, Hope Against Cancer."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41274303/",
      "pubDate": "2026 Jan",
      "doi": "10.1016/S2213-8587(25)00285-2",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "0ebe70754b74",
      "title": "Hospital-Level Care at Home for Adults Living in Rural Settings: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49330045/118312",
      "abstract": "Home hospital provides hospital-level care at home for patients with acute illness who would traditionally be cared for in a brick-and-mortar (BAM) hospital. While most home hospital programs have been implemented in urban areas, its feasibility in rural areas, where access to care is a major challenge, is unknown. To compare home hospital care with BAM hospital care for patients residing in rural areas. This randomized clinical trial took place from 2022 to 2023 with a 30-day follow-up in 3 rural areas in the US and Canada. Participants were adults recruited in the emergency department who required hospital-level care for select acute conditions (infections, heart failure, chronic obstructive pulmonary disease or asthma, and other diagnoses). Patients in the home hospital group received acute care at home, including in-home nurse and/or paramedic visits, remote physician care, intravenous medications, remote monitoring, video communication, and point-of-care testing. Patients in the BAM group received services at a rural BAM hospital. The primary outcome was the relative change in the acute care episode's direct cost. Secondary outcomes were 30-day readmission, days at home within 30 days of discharge, and physical activity. Exploratory outcomes included the Picker Experience Score and Net Promoter Score. A total of 161 patients (79 home; 82 BAM) with mean (SD) age of 64.4 (17.2) years (home) and 64.9 (14.1) years (control) were included. Most were female (home, 52 [65.8%]; BAM, 50 [61.0%]). The adjusted mean cost of the acute episode was not significantly different (home vs BAM, 14% greater; 95% CI, -6% to 39%; P = .19). There were no significant differences in 30-day readmission (home vs BAM: 8 [10.1%] vs 14 [17.1%]) or mean (SD) days at home within 30 days of discharge (home vs BAM: 28.6 [3.4] vs 28.4 [3.4] days). Patients in the home hospital group were less sedentary, according to accelerometer measurements, than those in the BAM group (mean [SD], 78.0% [10.4%] vs 86.0% [7.2%] of the day sedentary; mean difference, -8.0%; 95% CI, -12.8% to -3.3%; P < .001) and had more mean (SD) steps daily (834.1 [1219.6] vs 120.4 [206.0] steps; mean difference, 713.7 steps; 95% CI, 290.2 to 1137.2 steps; P < .001). Total mean (SD) length of stay (ie, BAM and home hospital days for intervention patients and BAM days for control patients) was not significantly different (home vs BAM: 6.7 [5.0] days vs 5.4 [4.4] days), although patients receiving care at home transferred late in their course (mean [SD] day of transfer, 4.2 [4.3] of 6.7 days). Patients in the home hospital group reported better experiences than those in the BAM hospital group: the mean (SD) Picker experience score was 13.4 (2.6) vs 11.0 (3.8) (mean difference, 2.4; 95% CI, 1.0 to 3.8; P < .001), and the mean (SD) net-promoter score was 88.4 (32.3) vs 45.5 (69.9) (mean difference, 43.0; 95% CI, 17.5 to 68.5; P < .001). Safety events occurred in 11 (14.1%) home patients vs 10 (12.4%) BAM patients (mean difference, 1.8%; 95% CI, -8.1% to 11.6%; P = .74). In this randomized clinical trial of home hospital care in rural settings, cost and readmission were unchanged while patient activity and experience improved. Late transfer home likely attenuated the intervention's effect. ClinicalTrials.gov Identifier: NCT05256303.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Home hospital provides hospital-level care at home for patients with acute illness who would traditionally be cared for in a brick-and-mortar (BAM) hospital. While most home hospital programs have been implemented in urban areas, its feasibility in rural areas, where access to care is a major challenge, is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare home hospital care with BAM hospital care for patients residing in rural areas."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial took place from 2022 to 2023 with a 30-day follow-up in 3 rural areas in the US and Canada. Participants were adults recruited in the emergency department who required hospital-level care for select acute conditions (infections, heart failure, chronic obstructive pulmonary disease or asthma, and other diagnoses)."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients in the home hospital group received acute care at home, including in-home nurse and/or paramedic visits, remote physician care, intravenous medications, remote monitoring, video communication, and point-of-care testing. Patients in the BAM group received services at a rural BAM hospital."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the relative change in the acute care episode's direct cost. Secondary outcomes were 30-day readmission, days at home within 30 days of discharge, and physical activity. Exploratory outcomes included the Picker Experience Score and Net Promoter Score."
        },
        {
          "label": "RESULTS",
          "text": "A total of 161 patients (79 home; 82 BAM) with mean (SD) age of 64.4 (17.2) years (home) and 64.9 (14.1) years (control) were included. Most were female (home, 52 [65.8%]; BAM, 50 [61.0%]). The adjusted mean cost of the acute episode was not significantly different (home vs BAM, 14% greater; 95% CI, -6% to 39%; P = .19). There were no significant differences in 30-day readmission (home vs BAM: 8 [10.1%] vs 14 [17.1%]) or mean (SD) days at home within 30 days of discharge (home vs BAM: 28.6 [3.4] vs 28.4 [3.4] days). Patients in the home hospital group were less sedentary, according to accelerometer measurements, than those in the BAM group (mean [SD], 78.0% [10.4%] vs 86.0% [7.2%] of the day sedentary; mean difference, -8.0%; 95% CI, -12.8% to -3.3%; P < .001) and had more mean (SD) steps daily (834.1 [1219.6] vs 120.4 [206.0] steps; mean difference, 713.7 steps; 95% CI, 290.2 to 1137.2 steps; P < .001). Total mean (SD) length of stay (ie, BAM and home hospital days for intervention patients and BAM days for control patients) was not significantly different (home vs BAM: 6.7 [5.0] days vs 5.4 [4.4] days), although patients receiving care at home transferred late in their course (mean [SD] day of transfer, 4.2 [4.3] of 6.7 days). Patients in the home hospital group reported better experiences than those in the BAM hospital group: the mean (SD) Picker experience score was 13.4 (2.6) vs 11.0 (3.8) (mean difference, 2.4; 95% CI, 1.0 to 3.8; P < .001), and the mean (SD) net-promoter score was 88.4 (32.3) vs 45.5 (69.9) (mean difference, 43.0; 95% CI, 17.5 to 68.5; P < .001). Safety events occurred in 11 (14.1%) home patients vs 10 (12.4%) BAM patients (mean difference, 1.8%; 95% CI, -8.1% to 11.6%; P = .74)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial of home hospital care in rural settings, cost and readmission were unchanged while patient activity and experience improved. Late transfer home likely attenuated the intervention's effect."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05256303."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324962/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamanetworkopen.2025.45712",
      "dateReceived": "2025-12-23T23:26:30.901Z",
      "isNew": false
    },
    {
      "id": "508d30b3bca5",
      "title": "Systematic review and meta-analyses of nonpharmacological interventions for co-occurring chronic pain and posttraumatic stress disorder.",
      "journal": "Pain",
      "score": "5/7",
      "tags": [
        "Psychiatry",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118423",
      "abstract": "Chronic pain and posttraumatic stress disorder (PTSD) frequently co-occur; however, evidence for effective nonpharmacological treatments is limited, resulting in a guidance gap for clinicians. The aim of this systematic review with meta-analysis was to synthesize and analyze the evidence base for nonpharmacological interventions for chronic pain and posttraumatic stress symptoms. MEDLINE, Embase, PsycINFO, and the PTSD Repository were searched for randomized controlled trials of noninvasive, nonpharmacological interventions in adults with chronic pain, PTSD, or both published from January 1, 1988 to August 31, 2024. Studies reporting assessments of both pain intensity and PTSD symptoms were included, and the primary outcomes were change in pain intensity and PTSD symptom severity. Meta-analyses calculated standardized mean differences (SMDs) in change scores for PTSD symptom severity and pain intensity from pre- to posttreatment. Confidence in the evidence was assessed using Grading of Recommendations, Assessment, Development and Evaluation (GRADE). The study is registered with PROSPERO, CRD42024507881. We identified 30 eligible trials (N = 3245 participants). We found evidence (low quality) that trauma-focused treatments may improve both PTSD symptom severity (a medium effect; SMD -0·75, 95% CI -1·37 to -0·12) and pain intensity (a small effect; SMD -0·34, 95% CI -0·56 to -0·11). We found no significant effects for cognitive-behavioral therapies, mind-body therapies, or peripheral modulation interventions for either outcome. Most studies were methodologically weak. Our findings suggest that treatments targeting chronic pain and PTSD should, at minimum, include a trauma-focused therapy component. However, further research is required to develop effective treatments for co-occurring chronic pain and PTSD.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41380098/",
      "pubDate": "2025 Dec 03",
      "doi": "10.1097/j.pain.0000000000003880",
      "dateReceived": "2025-12-23T23:26:30.900Z",
      "isNew": false
    },
    {
      "id": "2ce86323d9dd",
      "title": "Awake Prone Positioning in Patients With COVID-19 Respiratory Failure: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49439656/118420",
      "abstract": "Awake prone positioning (APP) has shown inconstant associations with improved clinical outcomes in nonintubated patients with COVID-19 developing severe pneumonia. To evaluate the effects of APP on the need for intubation or incidence of death among patients with COVID-19-related hypoxemic respiratory failure. This randomized clinical trial was conducted at 20 hospitals in France and 1 hospital in Mexico between July 2020 and August 2021. The study included patients from wards and intensive care units. Adult patients (18 years or older) who were not intubated and required at least 3 L/min of oxygen flow due to COVID-19 infection were included and randomly assigned in a 1:1 ratio to either APP or standard care. Intention-to-treat statistical analysis was performed from September to December 2024. Patients randomly assigned to the APP group were offered the intervention lasting at least 6 hours a day. Patients randomly assigned to standard care had no positioning constraint, including no contraindication to spontaneous APP. The primary outcome was a composite criterion of intubation and/or death in the first 28 days of randomization. Prespecified secondary outcomes at 28 days of enrollment were days alive outside the intensive care unit (ICU), days alive outside the hospital, proportion of patients admitted to ICU (for patients not in ICU at baseline), and days alive and free from mechanical ventilation. A bayesian approach was used to provide insights into the complete distribution of the effect estimates. A total of 445 patients were included in the final analysis (mean [SD] age, 60 [11] years; 329 males [74%]; median [IQR] SpO2 to FIO2 [peripheral oxygen saturation to fraction of inspired oxygen] ratio, 150 [114-194] and 155 [109-221] in the standard care and APP groups, respectively). With a noninformative prior distribution, the posterior probability that APP decreased intubation and/or death compared with standard care was 93.8% (mean odds ratio [OR], 0.74; 95% credible interval [CrI], 0.48-1.09). For secondary outcomes, between the APP and standard care groups, the mean difference in the number of days alive and free from mechanical ventilation was 0.33 (95% CrI, -1.37 to 2.03) days; in the number of days alive outside the ICU was 1.28 (95% CrI, -0.78 to 3.34) days; and in the number of days alive outside the hospital was 1.55 (95% CrI, -0.22 to 3.32) days. In this randomized clinical trial of nonintubated patients with COVID-19 and hypoxemic respiratory failure, daily APP of 6 hours showed a high probability of reduced endotracheal intubation and/or death over a wide range of prior distributions. These results support APP's use in patients with hypoxemic pneumonia due to COVID-19 infection. ClinicalTrials.gov Identifier: NCT04366856.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Awake prone positioning (APP) has shown inconstant associations with improved clinical outcomes in nonintubated patients with COVID-19 developing severe pneumonia."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effects of APP on the need for intubation or incidence of death among patients with COVID-19-related hypoxemic respiratory failure."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was conducted at 20 hospitals in France and 1 hospital in Mexico between July 2020 and August 2021. The study included patients from wards and intensive care units. Adult patients (18 years or older) who were not intubated and required at least 3 L/min of oxygen flow due to COVID-19 infection were included and randomly assigned in a 1:1 ratio to either APP or standard care. Intention-to-treat statistical analysis was performed from September to December 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients randomly assigned to the APP group were offered the intervention lasting at least 6 hours a day. Patients randomly assigned to standard care had no positioning constraint, including no contraindication to spontaneous APP."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite criterion of intubation and/or death in the first 28 days of randomization. Prespecified secondary outcomes at 28 days of enrollment were days alive outside the intensive care unit (ICU), days alive outside the hospital, proportion of patients admitted to ICU (for patients not in ICU at baseline), and days alive and free from mechanical ventilation. A bayesian approach was used to provide insights into the complete distribution of the effect estimates."
        },
        {
          "label": "RESULTS",
          "text": "A total of 445 patients were included in the final analysis (mean [SD] age, 60 [11] years; 329 males [74%]; median [IQR] SpO2 to FIO2 [peripheral oxygen saturation to fraction of inspired oxygen] ratio, 150 [114-194] and 155 [109-221] in the standard care and APP groups, respectively). With a noninformative prior distribution, the posterior probability that APP decreased intubation and/or death compared with standard care was 93.8% (mean odds ratio [OR], 0.74; 95% credible interval [CrI], 0.48-1.09). For secondary outcomes, between the APP and standard care groups, the mean difference in the number of days alive and free from mechanical ventilation was 0.33 (95% CrI, -1.37 to 2.03) days; in the number of days alive outside the ICU was 1.28 (95% CrI, -0.78 to 3.34) days; and in the number of days alive outside the hospital was 1.55 (95% CrI, -0.22 to 3.32) days."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial of nonintubated patients with COVID-19 and hypoxemic respiratory failure, daily APP of 6 hours showed a high probability of reduced endotracheal intubation and/or death over a wide range of prior distributions. These results support APP's use in patients with hypoxemic pneumonia due to COVID-19 infection."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04366856."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41370078/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamanetworkopen.2025.48201",
      "dateReceived": "2025-12-23T23:26:30.900Z",
      "isNew": false
    },
    {
      "id": "ebcabd3104c0",
      "title": "Blood pressure lowering in isolated diastolic hypertension and cardiovascular risk: an individual patient data meta-analysis.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49427975/118408",
      "abstract": "Blood pressure (BP) lowering reduces cardiovascular disease (CVD) risk; however, the benefits of treating patients with normal systolic BP but elevated diastolic BP remain uncertain. Data from 51 randomized controlled trials were pooled to compare BP-lowering effects in participants with and without isolated diastolic hypertension (IDH), defined as systolic BP < 130 mmHg and diastolic BP ≥ 80 mmHg. Treatment effects were stratified across baseline diastolic BP categories (range < 60 to ≥90 mmHg) among individuals with baseline systolic BP < 130 mmHg. Fixed-effect one-stage individual participant data meta-analyses were used, and Cox proportional hazard models, stratified by trial, were applied to analyse the data. Among 358 325 participants, 15 845 (4.4%) had IDH. At a median follow-up of 4.2 years, a 5 mmHg reduction in systolic BP reduced the risk of major cardiovascular events similarly in individuals with IDH [hazard ratio 0.91; 95% confidence interval (CI) 0.82-1.01] and those without IDH (hazard ratio 0.90; 95% CI 0.89-0.92; P for interaction = 1.00). Analyses by baseline diastolic BP showed no evidence of heterogeneity in treatment effects among individuals with baseline systolic BP < 130 mmHg (P for interaction = .26). Relative treatment effects were not statistically different by CVD history, age, prior medication use, and BP measurement methods. The study found no evidence to suggest that pharmacological BP-lowering therapy in individuals with IDH is less or more effective than in those without IDH. Relative risk reductions also did not diminish in those with lower diastolic BP, down to <60 mmHg at baseline. No meaningful differences across various clinical phenotypes were detected.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Blood pressure (BP) lowering reduces cardiovascular disease (CVD) risk; however, the benefits of treating patients with normal systolic BP but elevated diastolic BP remain uncertain."
        },
        {
          "label": "METHODS",
          "text": "Data from 51 randomized controlled trials were pooled to compare BP-lowering effects in participants with and without isolated diastolic hypertension (IDH), defined as systolic BP < 130 mmHg and diastolic BP ≥ 80 mmHg. Treatment effects were stratified across baseline diastolic BP categories (range < 60 to ≥90 mmHg) among individuals with baseline systolic BP < 130 mmHg. Fixed-effect one-stage individual participant data meta-analyses were used, and Cox proportional hazard models, stratified by trial, were applied to analyse the data."
        },
        {
          "label": "RESULTS",
          "text": "Among 358 325 participants, 15 845 (4.4%) had IDH. At a median follow-up of 4.2 years, a 5 mmHg reduction in systolic BP reduced the risk of major cardiovascular events similarly in individuals with IDH [hazard ratio 0.91; 95% confidence interval (CI) 0.82-1.01] and those without IDH (hazard ratio 0.90; 95% CI 0.89-0.92; P for interaction = 1.00). Analyses by baseline diastolic BP showed no evidence of heterogeneity in treatment effects among individuals with baseline systolic BP < 130 mmHg (P for interaction = .26). Relative treatment effects were not statistically different by CVD history, age, prior medication use, and BP measurement methods."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The study found no evidence to suggest that pharmacological BP-lowering therapy in individuals with IDH is less or more effective than in those without IDH. Relative risk reductions also did not diminish in those with lower diastolic BP, down to <60 mmHg at baseline. No meaningful differences across various clinical phenotypes were detected."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41384429/",
      "pubDate": "2025 Dec 12",
      "doi": "10.1093/eurheartj/ehaf962",
      "dateReceived": "2025-12-22T23:27:00.896Z",
      "isNew": false
    },
    {
      "id": "e0a748e62afa",
      "title": "Interventions for quitting vaping.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49306501/118325",
      "abstract": "There is limited guidance on how to stop using nicotine-containing vapes (otherwise known as e-cigarettes) and ensure long-term abstinence, whilst minimising the risk of tobacco smoking and other unintended consequences. Treatments could include pharmacological interventions, behavioural interventions, or both. To conduct a living systematic review assessing the benefits and harms of interventions to help people stop vaping compared to each other, placebo or no intervention. To assess how these interventions affect the use of combustible tobacco, and whether effects vary based on participant characteristics. We searched CENTRAL, MEDLINE, Embase, PsycINFO, ClinicalTrials.gov and WHO International Clinical Trials Registry Platform from 1 January 2004 to 1 July 2025. We also searched the references of eligible studies and abstracts from the Society for Research on Nicotine and Tobacco conferences, and contacted study authors. We included randomised controlled trials (RCTs) recruiting people of any age using nicotine-containing vapes, regardless of tobacco smoking status. Studies had to test an intervention designed to support people to quit vaping, and plan to measure at least one of our outcomes. Critical outcomes: vaping cessation at six months or longer; change in combustible tobacco use at six months or longer; number of participants reporting serious adverse events (SAEs) at one week or longer. We used Cochrane's RoB 1 tool to assess risk of bias in the included studies. We followed standard Cochrane methods. We grouped studies by comparisons and outcomes, and calculated individual study and pooled effects, as appropriate. We used random-effects Mantel-Haenszel methods to calculate risk ratios (RRs) with 95% confidence intervals (CIs) and random-effects inverse variance methods to calculate mean differences (MDs) and 95% CIs. We used GRADE to assess the certainty of evidence for our critical outcomes. Fifteen studies (six new to this updated version) involving 5800 participants are included. Fourteen studies included some participants who had previously smoked tobacco; in seven studies, participants were not smoking at baseline. Twelve studies only included participants aged 18 or older (five exclusively included people between 18 and 29); two included some participants under 18 years; and one included 13- to 17-year-olds only. Fourteen studies were conducted in the USA and one in Italy. We judged five studies at low, six at high, and four at unclear risk of bias. Pharmacological interventions Studies assessed our critical outcomes in relation to combination nicotine replacement therapy (NRT), cytisine, and varenicline compared to placebo or no/minimal support. For combination NRT versus no/minimal support, there was no clear evidence of benefit for vaping cessation rates at six months or longer, with the CI incorporating the possibility of reduced and increased cessation rates (very low-certainty evidence due to imprecision and risk of bias; RR 0.96, 95% CI 0.73 to 1.25; I² = 0%; 2 studies, 214 participants). One study investigating cytisine versus placebo did not report vaping cessation at six months or longer. When compared to placebo, varenicline increased vaping cessation rates at six months, but evidence was of low certainty due to imprecision (RR 2.71, 95% CI 1.33 to 5.49; I = 48%; 2 studies, 315 participants). One study comparing combination NRT versus no/minimal support reported combustible tobacco cessation. There was no clear evidence of higher tobacco cessation in either arm, and CIs were imprecise. The evidence was of very low certainty due to imprecision and risk of bias (RR 0.99, 95% CI 0.71 to 1.37; 198 participants). Zero participants reported SAEs in the two studies investigating combination NRT versus no/minimal support (706 participants; very low-certainty evidence due to risk of bias and imprecision) and in the one study investigating cytisine versus placebo (159 participants; low-certainty evidence due to imprecision). Four studies evaluating varenicline versus placebo measured SAEs, with zero events reported in two studies. Thus, our effect estimate was based on two studies (RR 2.82, 95% CI 0.45 to 17.59; 304 participants; low-certainty evidence due to imprecision). Behavioural interventions Studies assessed our critical outcomes in relation to reducing nicotine/vaping behaviour and text message-based interventions compared to no/minimal support. There was no clear evidence that nicotine/vaping reduction increased vaping cessation at six months compared to minimal support (RR 3.38, 95% CI 0.43 to 26.30; 1 study, 17 participants; very low-certainty evidence due to imprecision and risk of bias). There was low-certainty evidence (due to indirectness) that text message-based interventions may increase vaping cessation rates compared to no/minimal support in 13- to 24-year-olds specifically (RR 1.32, 95% CI 1.19 to 1.47; I = 0%; 2 studies, 4091 participants). There was very low-certainty evidence (due to indirectness and imprecision) that text message-based interventions for vaping cessation may result in little to no difference in smoking uptake (RR 1.04, 95% CI 0.81 to 1.33; 1 study, 1036 participants) or cessation (RR 1.03, 95% CI 0.90 to 1.19; 1 study, 793 participants) compared to no/minimal support. The one study investigating nicotine/vaping behaviour reduction versus minimal support did not report SAEs. Three studies investigating text message-based interventions reported SAEs; however, zero events were reported (2082 participants; low-certainty evidence due to imprecision). Low-certainty evidence suggests that text message-based interventions to help people stop nicotine vaping may help more youths and young adults to successfully stop compared to no/minimal support, with very uncertain evidence regarding their effect on smoking behaviours. Low-certainty evidence suggests that varenicline may help people quit vaping. Data exploring the effectiveness of combination NRT, cytisine, and nicotine/vaping behaviour reduction are inconclusive due to risk of bias and imprecision. Most studies that measured SAEs reported that none had occurred; however, more data are needed to draw clear conclusions. Studies that have investigated these interventions for quitting smoking have not demonstrated serious concerns about SAEs. It is important that future studies measure combustible tobacco outcomes so the complete risk profile of relevant interventions can be considered. Further RCTs are underway. To ensure this review continues to provide up-to-date information to decision-makers, we will maintain it as a living systematic review by running searches monthly and updating the review when relevant new evidence that will strengthen or change our conclusions emerges. Cancer Research UK (PICCTR-2024/100012); National Institute for Health and Care Research (NIHR206123). Protocol (2024) DOI: 10.1002/14651858.CD016058 Original review (2025) DOI: 10.1002/14651858.CD016058.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "There is limited guidance on how to stop using nicotine-containing vapes (otherwise known as e-cigarettes) and ensure long-term abstinence, whilst minimising the risk of tobacco smoking and other unintended consequences. Treatments could include pharmacological interventions, behavioural interventions, or both."
        },
        {
          "label": "OBJECTIVES",
          "text": "To conduct a living systematic review assessing the benefits and harms of interventions to help people stop vaping compared to each other, placebo or no intervention. To assess how these interventions affect the use of combustible tobacco, and whether effects vary based on participant characteristics."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, PsycINFO, ClinicalTrials.gov and WHO International Clinical Trials Registry Platform from 1 January 2004 to 1 July 2025. We also searched the references of eligible studies and abstracts from the Society for Research on Nicotine and Tobacco conferences, and contacted study authors."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) recruiting people of any age using nicotine-containing vapes, regardless of tobacco smoking status. Studies had to test an intervention designed to support people to quit vaping, and plan to measure at least one of our outcomes."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes: vaping cessation at six months or longer; change in combustible tobacco use at six months or longer; number of participants reporting serious adverse events (SAEs) at one week or longer."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used Cochrane's RoB 1 tool to assess risk of bias in the included studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We followed standard Cochrane methods. We grouped studies by comparisons and outcomes, and calculated individual study and pooled effects, as appropriate. We used random-effects Mantel-Haenszel methods to calculate risk ratios (RRs) with 95% confidence intervals (CIs) and random-effects inverse variance methods to calculate mean differences (MDs) and 95% CIs. We used GRADE to assess the certainty of evidence for our critical outcomes."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Fifteen studies (six new to this updated version) involving 5800 participants are included. Fourteen studies included some participants who had previously smoked tobacco; in seven studies, participants were not smoking at baseline. Twelve studies only included participants aged 18 or older (five exclusively included people between 18 and 29); two included some participants under 18 years; and one included 13- to 17-year-olds only. Fourteen studies were conducted in the USA and one in Italy. We judged five studies at low, six at high, and four at unclear risk of bias."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Pharmacological interventions Studies assessed our critical outcomes in relation to combination nicotine replacement therapy (NRT), cytisine, and varenicline compared to placebo or no/minimal support. For combination NRT versus no/minimal support, there was no clear evidence of benefit for vaping cessation rates at six months or longer, with the CI incorporating the possibility of reduced and increased cessation rates (very low-certainty evidence due to imprecision and risk of bias; RR 0.96, 95% CI 0.73 to 1.25; I² = 0%; 2 studies, 214 participants). One study investigating cytisine versus placebo did not report vaping cessation at six months or longer. When compared to placebo, varenicline increased vaping cessation rates at six months, but evidence was of low certainty due to imprecision (RR 2.71, 95% CI 1.33 to 5.49; I = 48%; 2 studies, 315 participants). One study comparing combination NRT versus no/minimal support reported combustible tobacco cessation. There was no clear evidence of higher tobacco cessation in either arm, and CIs were imprecise. The evidence was of very low certainty due to imprecision and risk of bias (RR 0.99, 95% CI 0.71 to 1.37; 198 participants). Zero participants reported SAEs in the two studies investigating combination NRT versus no/minimal support (706 participants; very low-certainty evidence due to risk of bias and imprecision) and in the one study investigating cytisine versus placebo (159 participants; low-certainty evidence due to imprecision). Four studies evaluating varenicline versus placebo measured SAEs, with zero events reported in two studies. Thus, our effect estimate was based on two studies (RR 2.82, 95% CI 0.45 to 17.59; 304 participants; low-certainty evidence due to imprecision). Behavioural interventions Studies assessed our critical outcomes in relation to reducing nicotine/vaping behaviour and text message-based interventions compared to no/minimal support. There was no clear evidence that nicotine/vaping reduction increased vaping cessation at six months compared to minimal support (RR 3.38, 95% CI 0.43 to 26.30; 1 study, 17 participants; very low-certainty evidence due to imprecision and risk of bias). There was low-certainty evidence (due to indirectness) that text message-based interventions may increase vaping cessation rates compared to no/minimal support in 13- to 24-year-olds specifically (RR 1.32, 95% CI 1.19 to 1.47; I = 0%; 2 studies, 4091 participants). There was very low-certainty evidence (due to indirectness and imprecision) that text message-based interventions for vaping cessation may result in little to no difference in smoking uptake (RR 1.04, 95% CI 0.81 to 1.33; 1 study, 1036 participants) or cessation (RR 1.03, 95% CI 0.90 to 1.19; 1 study, 793 participants) compared to no/minimal support. The one study investigating nicotine/vaping behaviour reduction versus minimal support did not report SAEs. Three studies investigating text message-based interventions reported SAEs; however, zero events were reported (2082 participants; low-certainty evidence due to imprecision)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Low-certainty evidence suggests that text message-based interventions to help people stop nicotine vaping may help more youths and young adults to successfully stop compared to no/minimal support, with very uncertain evidence regarding their effect on smoking behaviours. Low-certainty evidence suggests that varenicline may help people quit vaping. Data exploring the effectiveness of combination NRT, cytisine, and nicotine/vaping behaviour reduction are inconclusive due to risk of bias and imprecision. Most studies that measured SAEs reported that none had occurred; however, more data are needed to draw clear conclusions. Studies that have investigated these interventions for quitting smoking have not demonstrated serious concerns about SAEs. It is important that future studies measure combustible tobacco outcomes so the complete risk profile of relevant interventions can be considered. Further RCTs are underway. To ensure this review continues to provide up-to-date information to decision-makers, we will maintain it as a living systematic review by running searches monthly and updating the review when relevant new evidence that will strengthen or change our conclusions emerges."
        },
        {
          "label": "FUNDING",
          "text": "Cancer Research UK (PICCTR-2024/100012); National Institute for Health and Care Research (NIHR206123)."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2024) DOI: 10.1002/14651858.CD016058 Original review (2025) DOI: 10.1002/14651858.CD016058.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41288132/",
      "pubDate": "2025 Nov 25",
      "doi": "10.1002/14651858.CD016058.pub3",
      "dateReceived": "2025-12-21T23:25:44.338Z",
      "isNew": false
    },
    {
      "id": "9a8e43f8c100",
      "title": "Canadian guideline on HIV pre- and postexposure prophylaxis: 2025 update.",
      "journal": "CMAJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49306501/118286",
      "abstract": "New HIV infections occur annually in Canada, highlighting the need for pre- and postexposure prophylaxis (PrEP and PEP). Through the Canadian Institutes of Health Research (CIHR) Pan-Canadian Network for HIV/AIDS and STBBI (sexually transmitted and blood-borne infections) Clinical Trials Research, we have updated the 2017 guideline on clinical indications and drug regimens for PrEP and PEP in Canada. Drawing on meetings with community-based organizations representing key populations affected by HIV in Canada, along with evidence from 3 systematic reviews on PrEP, PEP, and HIV risk assessment tools (searches to June 2024), our diverse panel of 19 experts formulated recommendations on PrEP and PEP. We used a formal evidence-to-decision-making framework and the Grading of Recommendations, Assessment, Development, and Evaluation system. We followed the Guidelines International Network principles for managing competing interests. Our guideline development and reporting adhere with Appraisal of Guidelines for Research and Evaluation II. This guideline contains 31 recommendations and 10 good practice statements. Although it is appropriate to prescribe PrEP to adults and adolescents who request it, clinicians are also encouraged to assess HIV risk during routine health visits to identify people who would benefit from PrEP. Clinicians should elicit information about patients' anatomy and sexual partners in a culturally sensitive and affirming manner to determine which PrEP regimens - daily oral tenofovir disoproxil fumarate/emtricitabine (TDF/FTC), on-demand TDF/FTC, daily oral tenofovir alafenamide/emtricitabine, or long-acting injectable cabotegravir - are suitable options. When assessing whether PEP is needed, clinicians should consider the likelihood that the source person has transmissible HIV, as well as the biological risk of HIV transmission based on exposure type. Preferred PEP regimens are dolutegravir plus TDF/FTC, or bictegravir/tenofovir alafenamide/emtricitabine. Multiple safe, effective PrEP and PEP regimens are now available in Canada, making it increasingly possible to find suitable options for all who could benefit. Implementation of this guideline should expand access to biomedical HIV prevention interventions for those at risk and decrease the incidence of HIV in Canada.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "New HIV infections occur annually in Canada, highlighting the need for pre- and postexposure prophylaxis (PrEP and PEP). Through the Canadian Institutes of Health Research (CIHR) Pan-Canadian Network for HIV/AIDS and STBBI (sexually transmitted and blood-borne infections) Clinical Trials Research, we have updated the 2017 guideline on clinical indications and drug regimens for PrEP and PEP in Canada."
        },
        {
          "label": "METHODS",
          "text": "Drawing on meetings with community-based organizations representing key populations affected by HIV in Canada, along with evidence from 3 systematic reviews on PrEP, PEP, and HIV risk assessment tools (searches to June 2024), our diverse panel of 19 experts formulated recommendations on PrEP and PEP. We used a formal evidence-to-decision-making framework and the Grading of Recommendations, Assessment, Development, and Evaluation system. We followed the Guidelines International Network principles for managing competing interests. Our guideline development and reporting adhere with Appraisal of Guidelines for Research and Evaluation II."
        },
        {
          "label": "RECOMMENDATIONS",
          "text": "This guideline contains 31 recommendations and 10 good practice statements. Although it is appropriate to prescribe PrEP to adults and adolescents who request it, clinicians are also encouraged to assess HIV risk during routine health visits to identify people who would benefit from PrEP. Clinicians should elicit information about patients' anatomy and sexual partners in a culturally sensitive and affirming manner to determine which PrEP regimens - daily oral tenofovir disoproxil fumarate/emtricitabine (TDF/FTC), on-demand TDF/FTC, daily oral tenofovir alafenamide/emtricitabine, or long-acting injectable cabotegravir - are suitable options. When assessing whether PEP is needed, clinicians should consider the likelihood that the source person has transmissible HIV, as well as the biological risk of HIV transmission based on exposure type. Preferred PEP regimens are dolutegravir plus TDF/FTC, or bictegravir/tenofovir alafenamide/emtricitabine."
        },
        {
          "label": "INTERPRETATION",
          "text": "Multiple safe, effective PrEP and PEP regimens are now available in Canada, making it increasingly possible to find suitable options for all who could benefit. Implementation of this guideline should expand access to biomedical HIV prevention interventions for those at risk and decrease the incidence of HIV in Canada."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41326046/",
      "pubDate": "2025 Nov 30",
      "doi": "10.1503/cmaj.250511",
      "dateReceived": "2025-12-21T23:25:44.338Z",
      "isNew": false
    },
    {
      "id": "5314aa20e841",
      "title": "Comorbidities and mortality in subgroups of adults with diabetes with up to 14 years follow-up: a prospective cohort study in Sweden.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "7/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49306501/118246",
      "dateReceived": "2025-12-21T23:25:44.338Z",
      "isNew": false
    },
    {
      "id": "bf6f367806a7",
      "title": "Digital Cognitive Behavioral Treatment for Generalized Anxiety Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49407092/118421",
      "abstract": "Generalized anxiety disorder (GAD) is a chronic and disabling condition. Although cognitive behavioral therapy (CBT) is a first-line treatment for GAD, access to this treatment is limited; digital CBT (DCBT) programs may have the potential to overcome barriers to effective treatment and expand therapist reach and impact. To evaluate the effectiveness of smartphone-delivered DCBT compared with an active psychoeducation control condition for the treatment of GAD. This single-blind, parallel-group, decentralized randomized clinical trial with 1:1 allocation was conducted between March 8, 2023, and February 28, 2024. Procedures for this fully remote national study were conducted through Boston University. Participants were adults aged 22 years or older who scored 15 or higher on the 7-item Generalized Anxiety Disorder (GAD-7) scale and met diagnostic criteria for current GAD. A self-directed, tailored DCBT for GAD designed to be used flexibly for efficient learning of CBT techniques via smartphone. The control condition was an online psychoeducation intervention. Primary outcomes were remission status as determined by a blinded independent evaluator (assessed with the Clinical Global Impressions-Improvement [CGI-I] scale) and self-reported anxiety symptom severity (assessed with the GAD-7), evaluated at the primary end point at 10 weeks and the secondary end point at 24 weeks. A total of 351 adults were randomized (175 DCBT, 176 psychoeducation; mean [SD] age, 40.6 [10.9] years; 259 [73.8%] women). Significantly lower GAD-7 scores were found for DCBT (Cohen d, 1.09 [95% CI, 0.81-1.37] at week 10 and 0.96 [95% CI, 0.67-1.24] at week 24). Additionally, 103 of 145 DCBT participants (71.0%) met remission status (assessed by the CGI-I) at 10 weeks compared with 54 of 156 psychoeducation participants (34.6%) (odds ratio [OR], 4.63; 95% CI, 2.85-7.54; P < .001); remission occurred in 115 of 148 participants (77.7%) for DCBT and 78 of 150 (52.0%) for psychoeducation at 24 weeks (OR, 3.22; 95% CI, 1.95-5.32; P < .001). In this randomized clinical trial, DCBT provided significant and sustained benefits to adults with GAD. Given the limitations in access to empirically supported CBT, an efficacious DCBT program has clear potential for public health benefit. ClinicalTrials.gov Identifier: NCT05748652.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Generalized anxiety disorder (GAD) is a chronic and disabling condition. Although cognitive behavioral therapy (CBT) is a first-line treatment for GAD, access to this treatment is limited; digital CBT (DCBT) programs may have the potential to overcome barriers to effective treatment and expand therapist reach and impact."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effectiveness of smartphone-delivered DCBT compared with an active psychoeducation control condition for the treatment of GAD."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This single-blind, parallel-group, decentralized randomized clinical trial with 1:1 allocation was conducted between March 8, 2023, and February 28, 2024. Procedures for this fully remote national study were conducted through Boston University. Participants were adults aged 22 years or older who scored 15 or higher on the 7-item Generalized Anxiety Disorder (GAD-7) scale and met diagnostic criteria for current GAD."
        },
        {
          "label": "INTERVENTION",
          "text": "A self-directed, tailored DCBT for GAD designed to be used flexibly for efficient learning of CBT techniques via smartphone. The control condition was an online psychoeducation intervention."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Primary outcomes were remission status as determined by a blinded independent evaluator (assessed with the Clinical Global Impressions-Improvement [CGI-I] scale) and self-reported anxiety symptom severity (assessed with the GAD-7), evaluated at the primary end point at 10 weeks and the secondary end point at 24 weeks."
        },
        {
          "label": "RESULTS",
          "text": "A total of 351 adults were randomized (175 DCBT, 176 psychoeducation; mean [SD] age, 40.6 [10.9] years; 259 [73.8%] women). Significantly lower GAD-7 scores were found for DCBT (Cohen d, 1.09 [95% CI, 0.81-1.37] at week 10 and 0.96 [95% CI, 0.67-1.24] at week 24). Additionally, 103 of 145 DCBT participants (71.0%) met remission status (assessed by the CGI-I) at 10 weeks compared with 54 of 156 psychoeducation participants (34.6%) (odds ratio [OR], 4.63; 95% CI, 2.85-7.54; P < .001); remission occurred in 115 of 148 participants (77.7%) for DCBT and 78 of 150 (52.0%) for psychoeducation at 24 weeks (OR, 3.22; 95% CI, 1.95-5.32; P < .001)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, DCBT provided significant and sustained benefits to adults with GAD. Given the limitations in access to empirically supported CBT, an efficacious DCBT program has clear potential for public health benefit."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05748652."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41396602/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamanetworkopen.2025.48884",
      "dateReceived": "2025-12-21T23:25:44.337Z",
      "isNew": false
    },
    {
      "id": "f07391d85c23",
      "title": "Methylphenidate for children and adolescents with attention deficit hyperactivity disorder (ADHD).",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49407092/118401",
      "abstract": "Attention deficit hyperactivity disorder (ADHD) is one of the most commonly diagnosed and treated psychiatric disorders in childhood. Typically, children and adolescents with ADHD find it difficult to pay attention and they are hyperactive and impulsive. Methylphenidate is the psychostimulant most often prescribed, but the evidence on benefits and harms is uncertain. This is an update of our comprehensive systematic review on benefits and harms published in 2015. To assess the beneficial and harmful effects of methylphenidate for children and adolescents with ADHD. We searched CENTRAL, MEDLINE, Embase, three other databases and two trials registers up to March 2022. In addition, we checked reference lists and requested published and unpublished data from manufacturers of methylphenidate. We included all randomised clinical trials (RCTs) comparing methylphenidate versus placebo or no intervention in children and adolescents aged 18 years and younger with a diagnosis of ADHD. The search was not limited by publication year or language, but trial inclusion required that 75% or more of participants had a normal intellectual quotient (IQ > 70). We assessed two primary outcomes, ADHD symptoms and serious adverse events, and three secondary outcomes, adverse events considered non-serious, general behaviour, and quality of life. Two review authors independently conducted data extraction and risk of bias assessment for each trial. Six review authors including two review authors from the original publication participated in the update in 2022. We used standard Cochrane methodological procedures. Data from parallel-group trials and first-period data from cross-over trials formed the basis of our primary analyses. We undertook separate analyses using end-of-last period data from cross-over trials. We used Trial Sequential Analyses (TSA) to control for type I (5%) and type II (20%) errors, and we assessed and downgraded evidence according to the GRADE approach. We included 212 trials (16,302 participants randomised); 55 parallel-group trials (8104 participants randomised), and 156 cross-over trials (8033 participants randomised) as well as one trial with a parallel phase (114 participants randomised) and a cross-over phase (165 participants randomised). The mean age of participants was 9.8 years ranging from 3 to 18 years (two trials from 3 to 21 years). The male-female ratio was 3:1. Most trials were carried out in high-income countries, and 86/212 included trials (41%) were funded or partly funded by the pharmaceutical industry. Methylphenidate treatment duration ranged from 1 to 425 days, with a mean duration of 28.8 days. Trials compared methylphenidate with placebo (200 trials) and with no intervention (12 trials). Only 165/212 trials included usable data on one or more outcomes from 14,271 participants. Of the 212 trials, we assessed 191 at high risk of bias and 21 at low risk of bias. If, however, deblinding of methylphenidate due to typical adverse events is considered, then all 212 trials were at high risk of bias. methylphenidate versus placebo or no intervention may improve teacher-rated ADHD symptoms (standardised mean difference (SMD) -0.74, 95% confidence interval (CI) -0.88 to -0.61; I² = 38%; 21 trials; 1728 participants; very low-certainty evidence). This corresponds to a mean difference (MD) of -10.58 (95% CI -12.58 to -8.72) on the ADHD Rating Scale (ADHD-RS; range 0 to 72 points). The minimal clinically relevant difference is considered to be a change of 6.6 points on the ADHD-RS. Methylphenidate may not affect serious adverse events (risk ratio (RR) 0.80, 95% CI 0.39 to 1.67; I² = 0%; 26 trials, 3673 participants; very low-certainty evidence). The TSA-adjusted intervention effect was RR 0.91 (CI 0.31 to 2.68). methylphenidate may cause more adverse events considered non-serious versus placebo or no intervention (RR 1.23, 95% CI 1.11 to 1.37; I² = 72%; 35 trials 5342 participants; very low-certainty evidence). The TSA-adjusted intervention effect was RR 1.22 (CI 1.08 to 1.43). Methylphenidate may improve teacher-rated general behaviour versus placebo (SMD -0.62, 95% CI -0.91 to -0.33; I² = 68%; 7 trials 792 participants; very low-certainty evidence), but may not affect quality of life (SMD 0.40, 95% CI -0.03 to 0.83; I² = 81%; 4 trials, 608 participants; very low-certainty evidence). The majority of our conclusions from the 2015 version of this review still apply. Our updated meta-analyses suggest that methylphenidate versus placebo or no-intervention may improve teacher-rated ADHD symptoms and general behaviour in children and adolescents with ADHD. There may be no effects on serious adverse events and quality of life. Methylphenidate may be associated with an increased risk of adverse events considered non-serious, such as sleep problems and decreased appetite. However, the certainty of the evidence for all outcomes is very low and therefore the true magnitude of effects remain unclear. Due to the frequency of non-serious adverse events associated with methylphenidate, the blinding of participants and outcome assessors is particularly challenging. To accommodate this challenge, an active placebo should be sought and utilised. It may be difficult to find such a drug, but identifying a substance that could mimic the easily recognised adverse effects of methylphenidate would avert the unblinding that detrimentally affects current randomised trials. Future systematic reviews should investigate the subgroups of patients with ADHD that may benefit most and least from methylphenidate. This could be done with individual participant data to investigate predictors and modifiers like age, comorbidity, and ADHD subtypes.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Attention deficit hyperactivity disorder (ADHD) is one of the most commonly diagnosed and treated psychiatric disorders in childhood. Typically, children and adolescents with ADHD find it difficult to pay attention and they are hyperactive and impulsive. Methylphenidate is the psychostimulant most often prescribed, but the evidence on benefits and harms is uncertain. This is an update of our comprehensive systematic review on benefits and harms published in 2015."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the beneficial and harmful effects of methylphenidate for children and adolescents with ADHD."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, three other databases and two trials registers up to March 2022. In addition, we checked reference lists and requested published and unpublished data from manufacturers of methylphenidate."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included all randomised clinical trials (RCTs) comparing methylphenidate versus placebo or no intervention in children and adolescents aged 18 years and younger with a diagnosis of ADHD. The search was not limited by publication year or language, but trial inclusion required that 75% or more of participants had a normal intellectual quotient (IQ > 70). We assessed two primary outcomes, ADHD symptoms and serious adverse events, and three secondary outcomes, adverse events considered non-serious, general behaviour, and quality of life."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Two review authors independently conducted data extraction and risk of bias assessment for each trial. Six review authors including two review authors from the original publication participated in the update in 2022. We used standard Cochrane methodological procedures. Data from parallel-group trials and first-period data from cross-over trials formed the basis of our primary analyses. We undertook separate analyses using end-of-last period data from cross-over trials. We used Trial Sequential Analyses (TSA) to control for type I (5%) and type II (20%) errors, and we assessed and downgraded evidence according to the GRADE approach."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 212 trials (16,302 participants randomised); 55 parallel-group trials (8104 participants randomised), and 156 cross-over trials (8033 participants randomised) as well as one trial with a parallel phase (114 participants randomised) and a cross-over phase (165 participants randomised). The mean age of participants was 9.8 years ranging from 3 to 18 years (two trials from 3 to 21 years). The male-female ratio was 3:1. Most trials were carried out in high-income countries, and 86/212 included trials (41%) were funded or partly funded by the pharmaceutical industry. Methylphenidate treatment duration ranged from 1 to 425 days, with a mean duration of 28.8 days. Trials compared methylphenidate with placebo (200 trials) and with no intervention (12 trials). Only 165/212 trials included usable data on one or more outcomes from 14,271 participants. Of the 212 trials, we assessed 191 at high risk of bias and 21 at low risk of bias. If, however, deblinding of methylphenidate due to typical adverse events is considered, then all 212 trials were at high risk of bias."
        },
        {
          "label": "PRIMARY OUTCOMES",
          "text": "methylphenidate versus placebo or no intervention may improve teacher-rated ADHD symptoms (standardised mean difference (SMD) -0.74, 95% confidence interval (CI) -0.88 to -0.61; I² = 38%; 21 trials; 1728 participants; very low-certainty evidence). This corresponds to a mean difference (MD) of -10.58 (95% CI -12.58 to -8.72) on the ADHD Rating Scale (ADHD-RS; range 0 to 72 points). The minimal clinically relevant difference is considered to be a change of 6.6 points on the ADHD-RS. Methylphenidate may not affect serious adverse events (risk ratio (RR) 0.80, 95% CI 0.39 to 1.67; I² = 0%; 26 trials, 3673 participants; very low-certainty evidence). The TSA-adjusted intervention effect was RR 0.91 (CI 0.31 to 2.68)."
        },
        {
          "label": "SECONDARY OUTCOMES",
          "text": "methylphenidate may cause more adverse events considered non-serious versus placebo or no intervention (RR 1.23, 95% CI 1.11 to 1.37; I² = 72%; 35 trials 5342 participants; very low-certainty evidence). The TSA-adjusted intervention effect was RR 1.22 (CI 1.08 to 1.43). Methylphenidate may improve teacher-rated general behaviour versus placebo (SMD -0.62, 95% CI -0.91 to -0.33; I² = 68%; 7 trials 792 participants; very low-certainty evidence), but may not affect quality of life (SMD 0.40, 95% CI -0.03 to 0.83; I² = 81%; 4 trials, 608 participants; very low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "The majority of our conclusions from the 2015 version of this review still apply. Our updated meta-analyses suggest that methylphenidate versus placebo or no-intervention may improve teacher-rated ADHD symptoms and general behaviour in children and adolescents with ADHD. There may be no effects on serious adverse events and quality of life. Methylphenidate may be associated with an increased risk of adverse events considered non-serious, such as sleep problems and decreased appetite. However, the certainty of the evidence for all outcomes is very low and therefore the true magnitude of effects remain unclear. Due to the frequency of non-serious adverse events associated with methylphenidate, the blinding of participants and outcome assessors is particularly challenging. To accommodate this challenge, an active placebo should be sought and utilised. It may be difficult to find such a drug, but identifying a substance that could mimic the easily recognised adverse effects of methylphenidate would avert the unblinding that detrimentally affects current randomised trials. Future systematic reviews should investigate the subgroups of patients with ADHD that may benefit most and least from methylphenidate. This could be done with individual participant data to investigate predictors and modifiers like age, comorbidity, and ADHD subtypes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41342306/",
      "pubDate": "2025 Dec 04",
      "doi": "10.1002/14651858.CD009885.pub4",
      "dateReceived": "2025-12-21T23:25:44.337Z",
      "isNew": false
    },
    {
      "id": "223911a6a05d",
      "title": "Precision Immunotherapy to Improve Sepsis Outcomes: The ImmunoSep Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118342",
      "abstract": "Sepsis is heterogeneous, and the optimal strategy for tailoring immunotherapy is uncertain. To investigate whether precision immunotherapy guided by the presence of macrophage activation-like syndrome or sepsis-induced immunoparalysis improves organ dysfunction by day 9. A randomized, double-blind, double-dummy, placebo-controlled clinical trial conducted in 6 countries. Patients with sepsis, defined by Sepsis-3, were included if they had community-acquired or hospital-acquired pneumonia or ventilator-associated pneumonia or bacteremia and sepsis and had displayed either macrophage activation-like syndrome (blood ferritin >4420 ng/mL) or sepsis-induced immunoparalysis (blood ferritin ≤4420 ng/mL and <5000 human leukocyte antigen DR receptors on CD45/CD14 monocytes). The first patient was enrolled August 5, 2021, and the last follow-up, April 29, 2024. Eligible patients were randomized to receive standard care and precision immunotherapy or standard care and placebo. Those in the precision immunotherapy group with macrophage activation-like syndrome received anakinra intravenously (IV) and placebo subcutaneously, and those with sepsis-induced immunoparalysis received subcutaneous recombinant human interferon gamma and IV placebo. Those in the placebo group received both IV and subcutaneous placebo. Treatment was administered for up to 15 days. The primary end point was a decrease of at least 1.4 points in the mean Sequential Organ Failure Assessment (SOFA) score from baseline by day 9. The SOFA score evaluates 6 organ systems, ranging from 0, no dysfunction, to 4, failure, and the total score ranges from 0, normal, to 24, most severe form of multiorgan failure. Key secondary outcomes included 28-day mortality. Of 672 patients assessed for eligibility, 281 were randomized and 276 were included in the primary analysis population (mean [SD] age, 70 [13] years; 93 females [33.7%]; median baseline SOFA score, 9 [IQR, 7-11]). The SOFA decrease end point was attained by 46 of 131 patients (35.1%) in the precision immunotherapy group and by 26 of 145 patients (17.9%) in the placebo group (difference, 17.2% [95% CI, 6.8% to 27.2%]; P = .002). Mortality at 28 days was not statistically significantly different between groups. A total of 1069 serious treatment-emergent adverse events (88.8%) were reported; increased incidence of anemia was noted in the anakinra group; and hemorrhage in the recombinant human interferon gamma group. Among patients with sepsis, precision immunotherapy targeting macrophage activation-like syndrome and sepsis-induced immunoparalysis improved organ dysfunction by day 9 compared with placebo. ClinicalTrials.gov Identifier: NCT04990232.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Sepsis is heterogeneous, and the optimal strategy for tailoring immunotherapy is uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To investigate whether precision immunotherapy guided by the presence of macrophage activation-like syndrome or sepsis-induced immunoparalysis improves organ dysfunction by day 9."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "A randomized, double-blind, double-dummy, placebo-controlled clinical trial conducted in 6 countries. Patients with sepsis, defined by Sepsis-3, were included if they had community-acquired or hospital-acquired pneumonia or ventilator-associated pneumonia or bacteremia and sepsis and had displayed either macrophage activation-like syndrome (blood ferritin >4420 ng/mL) or sepsis-induced immunoparalysis (blood ferritin ≤4420 ng/mL and <5000 human leukocyte antigen DR receptors on CD45/CD14 monocytes). The first patient was enrolled August 5, 2021, and the last follow-up, April 29, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Eligible patients were randomized to receive standard care and precision immunotherapy or standard care and placebo. Those in the precision immunotherapy group with macrophage activation-like syndrome received anakinra intravenously (IV) and placebo subcutaneously, and those with sepsis-induced immunoparalysis received subcutaneous recombinant human interferon gamma and IV placebo. Those in the placebo group received both IV and subcutaneous placebo. Treatment was administered for up to 15 days."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary end point was a decrease of at least 1.4 points in the mean Sequential Organ Failure Assessment (SOFA) score from baseline by day 9. The SOFA score evaluates 6 organ systems, ranging from 0, no dysfunction, to 4, failure, and the total score ranges from 0, normal, to 24, most severe form of multiorgan failure. Key secondary outcomes included 28-day mortality."
        },
        {
          "label": "RESULTS",
          "text": "Of 672 patients assessed for eligibility, 281 were randomized and 276 were included in the primary analysis population (mean [SD] age, 70 [13] years; 93 females [33.7%]; median baseline SOFA score, 9 [IQR, 7-11]). The SOFA decrease end point was attained by 46 of 131 patients (35.1%) in the precision immunotherapy group and by 26 of 145 patients (17.9%) in the placebo group (difference, 17.2% [95% CI, 6.8% to 27.2%]; P = .002). Mortality at 28 days was not statistically significantly different between groups. A total of 1069 serious treatment-emergent adverse events (88.8%) were reported; increased incidence of anemia was noted in the anakinra group; and hemorrhage in the recombinant human interferon gamma group."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with sepsis, precision immunotherapy targeting macrophage activation-like syndrome and sepsis-induced immunoparalysis improved organ dysfunction by day 9 compared with placebo."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04990232."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41359996/",
      "pubDate": "2025 Dec 08",
      "doi": "10.1001/jama.2025.24175",
      "dateReceived": "2025-12-20T23:25:34.873Z",
      "isNew": false
    },
    {
      "id": "b82605debfe5",
      "title": "Decongestants and antihistamines for acute otitis media in children.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118330",
      "abstract": "Acute otitis media (AOM) is one of the most common bacterial infections in children worldwide, and the most common reason for prescribing antibiotics. Although serious complications (e.g. mastoiditis or meningitis) are rare, the infection causes acute pain and can lead to hearing impairment. Since AOM often resolves spontaneously, current treatment guidelines recommend an approach of watchful waiting (no initial antibiotics). However, decongestants and antihistamines, administered orally or nasally, might reduce inflammation and mucosal oedema in the middle ear and help resolve AOM in children. To assess the benefits and harms of decongestants and antihistamines in treating acute otitis media in children. We searched CENTRAL, MEDLINE, Embase, CINAHL, the World Health Organization (WHO) trials portal, and ClinicalTrials.gov in February 2025. We checked reference lists of relevant articles for additional studies. We included randomised controlled trials (RCTs) with children (from any setting) with AOM. Eligible comparisons were decongestants versus no intervention or placebo, antihistamines versus no intervention or placebo, decongestants plus antihistamines versus no intervention or placebo, decongestants versus antihistamines, one decongestant versus another, and one antihistamine versus another. The route of administration could be oral or nasal. Our critical outcomes were presence of AOM within seven days from starting treatment, severe complications (e.g. mastoiditis, meningitis, sinus thrombosis, facial paralysis, labyrinthitis), any adverse events (e.g. drowsiness), otalgia (yes/no) within seven days from starting treatment, and otalgia (score) within seven days from starting treatment. Our important outcomes included the presence of otitis media with effusion (OME) within 10 to 14 days from starting treatment. Two review authors used the Cochrane risk of bias tool (RoB 2) to independently assess risk of bias. We used standard Cochrane methods. We evaluated the benefits and harms using a random-effects model, calculating risk ratios (RRs) and risk differences (RDs) with 95% confidence intervals (CIs) for dichotomous outcomes, and mean differences (MDs) or standardised mean differences (SMDs) for continuous outcomes. Where the results could not be pooled due to the nature of the data, we described them narratively. We assessed the certainty of evidence using the GRADE approach. We identified 15 studies (3066 participants) conducted in the USA (11 studies), Denmark (2 studies), Canada (1 study), and the UK (1 study), and published between 1965 and 2003. In 12 studies, the children's ages ranged from three months to 15 years. One study also included a few adults aged up to 40 years, and one study may have also included adults aged 18 years. Participants received concomitant antibiotics in 12 studies. Four studies evaluated decongestants versus placebo or no intervention. Four studies evaluated antihistamines versus placebo or no intervention. Two studies contained three parallel treatment arms (decongestants versus antihistamines versus placebo). Three studies compared combinations of decongestants and antihistamines to placebo or no intervention. Two studies contained four parallel treatment arms (combinations of decongestants and antihistamines versus decongestants versus antihistamines versus placebo). Decongestants versus placebo or no intervention 1. No studies reported the presence of AOM within seven days. 2. Evidence from one study suggests that decongestants may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of decongestants on any adverse events compared to placebo (RR 3.60, 95% CI 0.16 to 83.28; I² = 71%; 3 studies, 296 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of decongestants on otalgia within seven days compared to placebo (RR 3.24, 95% CI 0.14 to 75.91; 1 study, 50 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. The evidence is very uncertain about the effect of decongestants on the presence of OME within 10 to 14 days compared to placebo (RR 0.83, 95% CI 0.53 to 1.29; I² = 0%; 2 studies, 239 participants; very low-certainty evidence). Another study, excluded from the meta-analysis, reported OME at 14 days after starting treatment, with 46/101 events in the decongestant group and 34/94 events in the placebo group. The certainty of evidence was low to very low mainly due to study limitations (risk of bias), inconsistency, and imprecision. Antihistamines versus placebo or no intervention 1. The evidence is very uncertain about the effect of antihistamines on the presence of AOM within seven days compared to placebo (RR 1.05, 95% CI 0.32 to 3.36; 1 study, 90 participants; very low-certainty evidence). 2. Evidence from one study suggests that antihistamines may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of antihistamines on any adverse events compared to placebo (RR 7.00, 95% CI 0.37 to 133.12; I² = not applicable; 2 studies, 192 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of antihistamines on otalgia within seven days compared to placebo (RR 3.52, 95% CI 0.15 to 82.34; 1 study, 48 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. Antihistamines may result in little to no difference in the presence of OME within 10 to 14 days compared to placebo (RR 1.13, 95% CI 0.89 to 1.45, I² = 0%; 3 studies, 439 participants; low-certainty evidence). The certainty of evidence was low to very low, mainly due to study limitations (risk of bias) and imprecision. The evidence is very uncertain about the benefits and harms of oral or nasal decongestants or antihistamines for children with AOM. No relevant trials have been published since 2003. No studies are ongoing. This Cochrane review received no dedicated funding. Protocol (2023): doi.org/10.1002/14651858.CD015839.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Acute otitis media (AOM) is one of the most common bacterial infections in children worldwide, and the most common reason for prescribing antibiotics. Although serious complications (e.g. mastoiditis or meningitis) are rare, the infection causes acute pain and can lead to hearing impairment. Since AOM often resolves spontaneously, current treatment guidelines recommend an approach of watchful waiting (no initial antibiotics). However, decongestants and antihistamines, administered orally or nasally, might reduce inflammation and mucosal oedema in the middle ear and help resolve AOM in children."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of decongestants and antihistamines in treating acute otitis media in children."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, CINAHL, the World Health Organization (WHO) trials portal, and ClinicalTrials.gov in February 2025. We checked reference lists of relevant articles for additional studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) with children (from any setting) with AOM. Eligible comparisons were decongestants versus no intervention or placebo, antihistamines versus no intervention or placebo, decongestants plus antihistamines versus no intervention or placebo, decongestants versus antihistamines, one decongestant versus another, and one antihistamine versus another. The route of administration could be oral or nasal."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were presence of AOM within seven days from starting treatment, severe complications (e.g. mastoiditis, meningitis, sinus thrombosis, facial paralysis, labyrinthitis), any adverse events (e.g. drowsiness), otalgia (yes/no) within seven days from starting treatment, and otalgia (score) within seven days from starting treatment. Our important outcomes included the presence of otitis media with effusion (OME) within 10 to 14 days from starting treatment."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors used the Cochrane risk of bias tool (RoB 2) to independently assess risk of bias."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We used standard Cochrane methods. We evaluated the benefits and harms using a random-effects model, calculating risk ratios (RRs) and risk differences (RDs) with 95% confidence intervals (CIs) for dichotomous outcomes, and mean differences (MDs) or standardised mean differences (SMDs) for continuous outcomes. Where the results could not be pooled due to the nature of the data, we described them narratively. We assessed the certainty of evidence using the GRADE approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We identified 15 studies (3066 participants) conducted in the USA (11 studies), Denmark (2 studies), Canada (1 study), and the UK (1 study), and published between 1965 and 2003. In 12 studies, the children's ages ranged from three months to 15 years. One study also included a few adults aged up to 40 years, and one study may have also included adults aged 18 years. Participants received concomitant antibiotics in 12 studies. Four studies evaluated decongestants versus placebo or no intervention. Four studies evaluated antihistamines versus placebo or no intervention. Two studies contained three parallel treatment arms (decongestants versus antihistamines versus placebo). Three studies compared combinations of decongestants and antihistamines to placebo or no intervention. Two studies contained four parallel treatment arms (combinations of decongestants and antihistamines versus decongestants versus antihistamines versus placebo)."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Decongestants versus placebo or no intervention 1. No studies reported the presence of AOM within seven days. 2. Evidence from one study suggests that decongestants may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of decongestants on any adverse events compared to placebo (RR 3.60, 95% CI 0.16 to 83.28; I² = 71%; 3 studies, 296 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of decongestants on otalgia within seven days compared to placebo (RR 3.24, 95% CI 0.14 to 75.91; 1 study, 50 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. The evidence is very uncertain about the effect of decongestants on the presence of OME within 10 to 14 days compared to placebo (RR 0.83, 95% CI 0.53 to 1.29; I² = 0%; 2 studies, 239 participants; very low-certainty evidence). Another study, excluded from the meta-analysis, reported OME at 14 days after starting treatment, with 46/101 events in the decongestant group and 34/94 events in the placebo group. The certainty of evidence was low to very low mainly due to study limitations (risk of bias), inconsistency, and imprecision. Antihistamines versus placebo or no intervention 1. The evidence is very uncertain about the effect of antihistamines on the presence of AOM within seven days compared to placebo (RR 1.05, 95% CI 0.32 to 3.36; 1 study, 90 participants; very low-certainty evidence). 2. Evidence from one study suggests that antihistamines may result in little to no difference in severe complications compared to no intervention (no events; low-certainty evidence). 3. The evidence is very uncertain about the effect of antihistamines on any adverse events compared to placebo (RR 7.00, 95% CI 0.37 to 133.12; I² = not applicable; 2 studies, 192 participants; very low-certainty evidence). 4. The evidence is very uncertain about the effect of antihistamines on otalgia within seven days compared to placebo (RR 3.52, 95% CI 0.15 to 82.34; 1 study, 48 participants; very low-certainty evidence). 5. No studies reported an otalgia score within seven days. 6. Antihistamines may result in little to no difference in the presence of OME within 10 to 14 days compared to placebo (RR 1.13, 95% CI 0.89 to 1.45, I² = 0%; 3 studies, 439 participants; low-certainty evidence). The certainty of evidence was low to very low, mainly due to study limitations (risk of bias) and imprecision."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "The evidence is very uncertain about the benefits and harms of oral or nasal decongestants or antihistamines for children with AOM. No relevant trials have been published since 2003. No studies are ongoing."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review received no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2023): doi.org/10.1002/14651858.CD015839."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41307300/",
      "pubDate": "2025 Nov 27",
      "doi": "10.1002/14651858.CD015839.pub2",
      "dateReceived": "2025-12-20T23:25:34.873Z",
      "isNew": false
    },
    {
      "id": "61982d7f4281",
      "title": "Management of Chronic Post-Herniorrhaphy Pain: A Systematic Review.",
      "journal": "Pain Physician",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118326",
      "dateReceived": "2025-12-20T23:25:34.873Z",
      "isNew": false
    },
    {
      "id": "3732aea626ae",
      "title": "Comparison of the Efficacy of Conventional Radiofrequency to Intraarticular Steroid Injections for Advanced Hip Osteoarthritis: A Randomized Trial.",
      "journal": "Pain Physician",
      "score": "5/7",
      "tags": [
        "Rheumatology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118320",
      "abstract": "Osteoarthritis (OA) is characterized by the destruction of the articular cartilage and narrowing of the joint space and bone formations around the joint due to mechanical, genetic, and inflammatory causes. The hip joints are some of the most commonly affected in OA. Hip OA is also known as coxarthrosis. This study aimed to compare the effects of conventional radiofrequency (RF) to those of intraarticular steroid treatment methods on pain, limitations, and quality of life in patients who had advanced OA of the hip and could not undergo surgery for any reason. The study was designed as a randomized, prospective single-center study. A total of 40 patients with advanced primary hip OA who met the inclusion criteria were included in the study. Patients were randomized into 2 groups, each of which included 20 individuals. One group received conventional (thermal) radiofrequency ablation (RFA) to the femoral and obturator sensory branches of the hip, while the other group received intraarticular steroid injections in their hips. Scores on the Visual Analog Scale (VAS) and the physical-function component of the Medical Outcomes Study Short Form Health Survey (SF-36) were completed before, one month after, and 3 months after the procedure. The VAS was recorded both at rest and during activity. Each patient's gender, body mass index (BMI), affected hip side, duration of pain, and previous treatments for the hip were recorded, as were the procedure-related complications each patient experienced. Forty patients were followed up on for 3 months. The analysis revealed that at both one month and 3 months after treatment, the 2 groups of patients showed a significant improvement in their scores on the resting VAS, activity VAS, and physical-function component of the SF-36 from the pre-procedure values (P < 0.05). As for resting VAS scores in the hip intraarticular steroid injection (HIASI) group and activity VAS scores in the thermal radiofrequency ablation (TRFA) group, there was a statistically significant difference between the groups at one month and 3 months after the procedure, respectively (P < 0.05). This study found a statistically significant correlation between hip stage and age, but no significant correlation was found for gender and weight. No difference between the groups appeared in the complications related to the procedure at the 3-month follow-up. The follow-up period was relatively short. The sample size was small, and to avoid neuritis, a half dose of triamcinolone acetonide was given to the patients in the TRFA group. Conventional RF is more effective at treating the symptoms of advanced coxarthrosis than are intraarticular steroids, based on observations of the activity in the 3-month follow-up of patients with the condition.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Osteoarthritis (OA) is characterized by the destruction of the articular cartilage and narrowing of the joint space and bone formations around the joint due to mechanical, genetic, and inflammatory causes. The hip joints are some of the most commonly affected in OA. Hip OA is also known as coxarthrosis."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study aimed to compare the effects of conventional radiofrequency (RF) to those of intraarticular steroid treatment methods on pain, limitations, and quality of life in patients who had advanced OA of the hip and could not undergo surgery for any reason."
        },
        {
          "label": "STUDY DESIGN",
          "text": "The study was designed as a randomized, prospective single-center study."
        },
        {
          "label": "SETTING",
          "text": "A total of 40 patients with advanced primary hip OA who met the inclusion criteria were included in the study."
        },
        {
          "label": "METHODS",
          "text": "Patients were randomized into 2 groups, each of which included 20 individuals. One group received conventional (thermal) radiofrequency ablation (RFA) to the femoral and obturator sensory branches of the hip, while the other group received intraarticular steroid injections in their hips. Scores on the Visual Analog Scale (VAS) and the physical-function component of the Medical Outcomes Study Short Form Health Survey (SF-36) were completed before, one month after, and 3 months after the procedure. The VAS was recorded both at rest and during activity. Each patient's gender, body mass index (BMI), affected hip side, duration of pain, and previous treatments for the hip were recorded, as were the procedure-related complications each patient experienced."
        },
        {
          "label": "RESULTS",
          "text": "Forty patients were followed up on for 3 months. The analysis revealed that at both one month and 3 months after treatment, the 2 groups of patients showed a significant improvement in their scores on the resting VAS, activity VAS, and physical-function component of the SF-36 from the pre-procedure values (P < 0.05). As for resting VAS scores in the hip intraarticular steroid injection (HIASI) group and activity VAS scores in the thermal radiofrequency ablation (TRFA) group, there was a statistically significant difference between the groups at one month and 3 months after the procedure, respectively (P < 0.05). This study found a statistically significant correlation between hip stage and age, but no significant correlation was found for gender and weight. No difference between the groups appeared in the complications related to the procedure at the 3-month follow-up."
        },
        {
          "label": "LIMITATIONS",
          "text": "The follow-up period was relatively short. The sample size was small, and to avoid neuritis, a half dose of triamcinolone acetonide was given to the patients in the TRFA group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Conventional RF is more effective at treating the symptoms of advanced coxarthrosis than are intraarticular steroids, based on observations of the activity in the 3-month follow-up of patients with the condition."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41337764/",
      "pubDate": "2025 Nov",
      "doi": "",
      "dateReceived": "2025-12-20T23:25:34.873Z",
      "isNew": false
    },
    {
      "id": "b3a138abd0e7",
      "title": "Exercise training in hypertrophic cardiomyopathy: a meta-analysis of randomised trials with trial sequential analysis.",
      "journal": "Heart",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49286407/118284",
      "abstract": "Hypertrophic cardiomyopathy (HCM) is a leading cause of sudden cardiac death (SCD) among young individuals and athletes. Despite increasing evidence supporting exercise, uncertainty remains about its safety and efficacy in this population. We systematically reviewed randomised controlled trials (RCTs) comparing structured exercise interventions with usual care in patients with HCM. The primary outcome was peak oxygen consumption (pVO₂). Random-effects meta-analysis and trial sequential analysis (TSA) were applied to assess efficacy and robustness of evidence. Four RCTs (n=290) were included, enrolling predominantly low-risk, non-obstructive HCM patients with mild functional limitation (mean left ventricular ejection fraction (LVEF) 66%). Exercise improved pVO₂ (mean difference (MD) 1.81 mL/kg/min; 95% CI 1.01 to 2.61; p<0.01), confirmed by TSA. Exercise also reduced left ventricular wall thickness (MD -0.56 mm; 95% CI -0.97 to -0.16) and body mass index (MD -0.65 kg/m²; 95% CI -1.05 to -0.25) without significant changes in LVEF or left ventricular outflow gradients. No increase was observed in arrhythmias, syncope, SCD or other adverse events. However, the total number of RCTs and participants was small, and all studies primarily involved mild, non-obstructive phenotypes, limiting generalisability. In patients with mild, non-obstructive HCM, structured exercise appears safe and improves functional capacity and cardiometabolic parameters without adverse ventricular effects. Larger multicentre RCTs including higher-risk phenotypes are warranted to confirm safety and define optimal training strategies. CRD420251012232.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Hypertrophic cardiomyopathy (HCM) is a leading cause of sudden cardiac death (SCD) among young individuals and athletes. Despite increasing evidence supporting exercise, uncertainty remains about its safety and efficacy in this population."
        },
        {
          "label": "METHODS",
          "text": "We systematically reviewed randomised controlled trials (RCTs) comparing structured exercise interventions with usual care in patients with HCM. The primary outcome was peak oxygen consumption (pVO₂). Random-effects meta-analysis and trial sequential analysis (TSA) were applied to assess efficacy and robustness of evidence."
        },
        {
          "label": "RESULTS",
          "text": "Four RCTs (n=290) were included, enrolling predominantly low-risk, non-obstructive HCM patients with mild functional limitation (mean left ventricular ejection fraction (LVEF) 66%). Exercise improved pVO₂ (mean difference (MD) 1.81 mL/kg/min; 95% CI 1.01 to 2.61; p<0.01), confirmed by TSA. Exercise also reduced left ventricular wall thickness (MD -0.56 mm; 95% CI -0.97 to -0.16) and body mass index (MD -0.65 kg/m²; 95% CI -1.05 to -0.25) without significant changes in LVEF or left ventricular outflow gradients. No increase was observed in arrhythmias, syncope, SCD or other adverse events. However, the total number of RCTs and participants was small, and all studies primarily involved mild, non-obstructive phenotypes, limiting generalisability."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with mild, non-obstructive HCM, structured exercise appears safe and improves functional capacity and cardiometabolic parameters without adverse ventricular effects. Larger multicentre RCTs including higher-risk phenotypes are warranted to confirm safety and define optimal training strategies."
        },
        {
          "label": "PROSPERO REGISTRATION NUMBER",
          "text": "CRD420251012232."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41320293/",
      "pubDate": "2025 Nov 30",
      "doi": "10.1136/heartjnl-2025-326377",
      "dateReceived": "2025-12-20T23:25:34.873Z",
      "isNew": false
    },
    {
      "id": "1b823cf04882",
      "title": "Ketamine or Etomidate for Tracheal Intubation of Critically Ill Adults.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49395633/118366",
      "abstract": "For critically ill adults undergoing tracheal intubation, observational studies suggest that the use of etomidate to induce anesthesia may increase the risk of death. Whether the use of ketamine rather than etomidate decreases the risk of death is uncertain. In a randomized trial conducted in 14 emergency departments and intensive care units in the United States, we randomly assigned critically ill adults who were undergoing tracheal intubation to receive ketamine or etomidate for the induction of anesthesia. The primary outcome was in-hospital death from any cause by day 28. The secondary outcome was cardiovascular collapse during intubation, defined by the occurrence of a systolic blood pressure below 65 mm Hg, receipt of a new or increased dose of vasopressors, or cardiac arrest. A total of 2365 patients underwent randomization and were included in the trial population; 1176 were assigned to the ketamine group and 1189 to the etomidate group. In-hospital death by day 28 occurred in 330 of 1173 patients (28.1%) in the ketamine group and in 345 of 1186 patients (29.1%) in the etomidate group (risk difference adjusted for trial site, -0.8 percentage points; 95% confidence interval [CI], -4.5 to 2.9; P = 0.65). Cardiovascular collapse during intubation occurred in 260 of 1176 patients (22.1%) in the ketamine group and in 202 of 1189 patients (17.0%) in the etomidate group (risk difference, 5.1 percentage points; 95% CI, 1.9 to 8.3). Prespecified safety outcomes were similar in the two groups. Among critically ill adults undergoing tracheal intubation, the use of ketamine to induce anesthesia did not result in a significantly lower incidence of in-hospital death by day 28 than etomidate. (Funded by the Patient-Centered Outcomes Research Institute and others; RSI ClinicalTrials.gov number, NCT05277896.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "For critically ill adults undergoing tracheal intubation, observational studies suggest that the use of etomidate to induce anesthesia may increase the risk of death. Whether the use of ketamine rather than etomidate decreases the risk of death is uncertain."
        },
        {
          "label": "METHODS",
          "text": "In a randomized trial conducted in 14 emergency departments and intensive care units in the United States, we randomly assigned critically ill adults who were undergoing tracheal intubation to receive ketamine or etomidate for the induction of anesthesia. The primary outcome was in-hospital death from any cause by day 28. The secondary outcome was cardiovascular collapse during intubation, defined by the occurrence of a systolic blood pressure below 65 mm Hg, receipt of a new or increased dose of vasopressors, or cardiac arrest."
        },
        {
          "label": "RESULTS",
          "text": "A total of 2365 patients underwent randomization and were included in the trial population; 1176 were assigned to the ketamine group and 1189 to the etomidate group. In-hospital death by day 28 occurred in 330 of 1173 patients (28.1%) in the ketamine group and in 345 of 1186 patients (29.1%) in the etomidate group (risk difference adjusted for trial site, -0.8 percentage points; 95% confidence interval [CI], -4.5 to 2.9; P = 0.65). Cardiovascular collapse during intubation occurred in 260 of 1176 patients (22.1%) in the ketamine group and in 202 of 1189 patients (17.0%) in the etomidate group (risk difference, 5.1 percentage points; 95% CI, 1.9 to 8.3). Prespecified safety outcomes were similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among critically ill adults undergoing tracheal intubation, the use of ketamine to induce anesthesia did not result in a significantly lower incidence of in-hospital death by day 28 than etomidate. (Funded by the Patient-Centered Outcomes Research Institute and others; RSI ClinicalTrials.gov number, NCT05277896.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41369227/",
      "pubDate": "2025 Dec 09",
      "doi": "10.1056/NEJMoa2511420",
      "dateReceived": "2025-12-20T23:25:34.872Z",
      "isNew": false
    },
    {
      "id": "68de4eb8cedb",
      "title": "Impact of Oral Semaglutide on Kidney Outcomes in People With Type 2 Diabetes: Results From the SOUL Randomized Trial.",
      "journal": "Diabetes Care",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49384343/118387",
      "abstract": "To examine the effects of oral semaglutide on kidney outcomes in people with type 2 diabetes (T2D) and atherosclerotic cardiovascular disease (ASCVD) and/or chronic kidney disease (CKD). SOUL (NCT03914326), a double-blind randomized controlled trial, compared oral semaglutide with placebo in people with T2D, ASCVD, and/or CKD, showing a 14% reduction in risk of major adverse cardiovascular (CV) events. Prespecified kidney outcomes included a five-point composite (≥50% decrease in estimated glomerular filtration rate [eGFR], persistent eGFR <15 mL/min/1.73 m2, initiation of chronic kidney replacement therapy, or death from kidney or CV causes); a four-point composite (excluding CV death); and eGFR decline. Prespecified subgroups were also assessed, including those with eGFR <60 mL/min/1.73 m2 at baseline. Among 9,650 participants, mean eGFR was 73.8 mL/min/1.73 m2, and follow-up was 47.5 months. The five-point outcome occurred in 403 (8.4%) and 435 (9.0%) participants taking oral semaglutide versus placebo, respectively (hazard ratio [HR] 0.91; 95% CI 0.80, 1.05; P = 0.19). The four-point outcome occurred in 112 (2.3%) and 129 (2.7%) participants, respectively (HR 0.86; 95% CI 0.66, 1.10; P = 0.22). Mean annual eGFR decline was less with oral semaglutide than placebo (-1.67 vs. -2.06 mL/min/1.73 m2; estimated treatment difference 0.40 [95% CI 0.27, 0.53; P < 0.0001). These effects were similar across most subgroups, including those with eGFR <60 mL/min/1.73 m2. Serious adverse events occurred at similar rates in both groups. In people with T2D and ASCVD and/or CKD but with overall mostly preserved eGFR, orally administered semaglutide, compared with placebo, did not significantly reduce adverse kidney outcomes but did slow the decline in eGFR.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To examine the effects of oral semaglutide on kidney outcomes in people with type 2 diabetes (T2D) and atherosclerotic cardiovascular disease (ASCVD) and/or chronic kidney disease (CKD)."
        },
        {
          "label": "RESEARCH DESIGN AND METHODS",
          "text": "SOUL (NCT03914326), a double-blind randomized controlled trial, compared oral semaglutide with placebo in people with T2D, ASCVD, and/or CKD, showing a 14% reduction in risk of major adverse cardiovascular (CV) events. Prespecified kidney outcomes included a five-point composite (≥50% decrease in estimated glomerular filtration rate [eGFR], persistent eGFR <15 mL/min/1.73 m2, initiation of chronic kidney replacement therapy, or death from kidney or CV causes); a four-point composite (excluding CV death); and eGFR decline. Prespecified subgroups were also assessed, including those with eGFR <60 mL/min/1.73 m2 at baseline."
        },
        {
          "label": "RESULTS",
          "text": "Among 9,650 participants, mean eGFR was 73.8 mL/min/1.73 m2, and follow-up was 47.5 months. The five-point outcome occurred in 403 (8.4%) and 435 (9.0%) participants taking oral semaglutide versus placebo, respectively (hazard ratio [HR] 0.91; 95% CI 0.80, 1.05; P = 0.19). The four-point outcome occurred in 112 (2.3%) and 129 (2.7%) participants, respectively (HR 0.86; 95% CI 0.66, 1.10; P = 0.22). Mean annual eGFR decline was less with oral semaglutide than placebo (-1.67 vs. -2.06 mL/min/1.73 m2; estimated treatment difference 0.40 [95% CI 0.27, 0.53; P < 0.0001). These effects were similar across most subgroups, including those with eGFR <60 mL/min/1.73 m2. Serious adverse events occurred at similar rates in both groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In people with T2D and ASCVD and/or CKD but with overall mostly preserved eGFR, orally administered semaglutide, compared with placebo, did not significantly reduce adverse kidney outcomes but did slow the decline in eGFR."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41380027/",
      "pubDate": "2025 Dec 04",
      "doi": "10.2337/dc25-1080",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "feeb25012e06",
      "title": "Physical and Occupational Therapist Evaluations for Fall Prevention in the Emergency Department: A Geriatric ED Guidelines 2.0 Systematic Review.",
      "journal": "Acad Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49384343/118386",
      "abstract": "Older adults are at high risk for severe injuries and death from falls. Physical therapist (PT) and occupational therapist (OT) evaluations have been introduced into Emergency Department (ED) care to assist with fall risk evaluation and fall prevention care. An evaluation of current evidence was undertaken to inform the Geriatric ED Guidelines 2.0. Systematic review of physical and/or occupational therapy evaluation for fall prevention in the ED. The intervention was evaluation by a rehabilitation therapist (PT, OT, or both) for fall prevention, fall assessment, or mitigation of fall risk factors. Studies that did not perform the evaluation during the ED or ED Observation Unit visit were excluded, such as referrals for home consultation. The published literature was searched using strategies created by a medical librarian and was implemented in Embase and PubMed in March 2025. Covidence was used for article collation and review. Risk of bias was assessed using the Cochrane Risk of Bias v2 and the Ottawa-Newcastle scale. The search resulted in 387 articles with 52 duplicates, for 335 unique citations. Ten articles on 6 datasets were included (4 abstracts and 6 published manuscripts). One article was at high risk of bias as very few intervention patients received therapist evaluation. The remaining 5 datasets had varied co-interventions in addition to PT and/or OT evaluations. PT or OT evaluation in the ED was associated with reduced ED revisits at 1, 2, and 6 months. Evaluations in the ED were not associated with increased hospital admission rates or ED length of stay. A meta-analysis was infeasible due to varied outcome timeframes. PT and/or OT evaluations for fall prevention were associated with reduced subsequent ED revisits for older adults. However, the impact of co-interventions and heterogeneity limits strong conclusions.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Older adults are at high risk for severe injuries and death from falls. Physical therapist (PT) and occupational therapist (OT) evaluations have been introduced into Emergency Department (ED) care to assist with fall risk evaluation and fall prevention care. An evaluation of current evidence was undertaken to inform the Geriatric ED Guidelines 2.0."
        },
        {
          "label": "METHODS",
          "text": "Systematic review of physical and/or occupational therapy evaluation for fall prevention in the ED. The intervention was evaluation by a rehabilitation therapist (PT, OT, or both) for fall prevention, fall assessment, or mitigation of fall risk factors. Studies that did not perform the evaluation during the ED or ED Observation Unit visit were excluded, such as referrals for home consultation. The published literature was searched using strategies created by a medical librarian and was implemented in Embase and PubMed in March 2025. Covidence was used for article collation and review. Risk of bias was assessed using the Cochrane Risk of Bias v2 and the Ottawa-Newcastle scale."
        },
        {
          "label": "RESULTS",
          "text": "The search resulted in 387 articles with 52 duplicates, for 335 unique citations. Ten articles on 6 datasets were included (4 abstracts and 6 published manuscripts). One article was at high risk of bias as very few intervention patients received therapist evaluation. The remaining 5 datasets had varied co-interventions in addition to PT and/or OT evaluations. PT or OT evaluation in the ED was associated with reduced ED revisits at 1, 2, and 6 months. Evaluations in the ED were not associated with increased hospital admission rates or ED length of stay. A meta-analysis was infeasible due to varied outcome timeframes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "PT and/or OT evaluations for fall prevention were associated with reduced subsequent ED revisits for older adults. However, the impact of co-interventions and heterogeneity limits strong conclusions."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41354970/",
      "pubDate": "2025 Dec 07",
      "doi": "10.1111/acem.70201",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "ff3b068ea696",
      "title": "Management of Functional Seizures Practice Guideline Executive Summary: Report of the AAN Guidelines Subcommittee.",
      "journal": "Neurology",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49384343/118385",
      "abstract": "This guideline provides evidence-based recommendations for clinicians, patients, and other stakeholders on the management of functional seizures. Following a National Academy of Medicine-compliant process, a multidisciplinary panel conducted a systematic review and integrated the findings with the authors' clinical experience to develop recommendations. A systematic review of the available evidence from first published articles to February 25, 2025, identified 12 Class II-III studies. The review found that psychological interventions are possibly effective in increasing the likelihood of achieving freedom from functional seizures, decreasing the frequency of functional seizures, decreasing anxiety, and improving health-related quality of life and psychosocial functioning for individuals with functional seizures. Key recommendations state that, when evaluating patients with seizure-like episodes, clinicians should seek historical and semiological information (including smartphone videos) from both patients and witnesses and may obtain video-EEG of all typical seizure-like episodes where feasible. Clinicians should evaluate patients diagnosed with functional seizures for co-occurring psychiatric disorders and co-occurring epilepsy. Clinicians should adhere to universal standards of care for patients, including speaking respectfully, refraining from unnecessary harm, and avoiding stigmatizing behavior. Clinicians should provide a specific diagnostic label and rationale for the diagnosis, should engage in shared decision making regarding the treatment plan, and should provide continuity of care to individuals diagnosed with functional seizures. When psychological interventions for functional seizures are indicated, clinicians should counsel patients regarding the potential benefits and risks of these interventions and should refer interested and appropriate patients to these interventions for the treatment of functional seizures. Clinicians should involve family, caregivers, or others in the social support network in the psychological treatment of individuals with functional seizures. Clinicians should not prescribe benzodiazepines or antiseizure medications for patients with functional seizures without co-occurring epilepsy or another indication for these medications and should counsel patients regarding the potential risks and lack of evidence of benefit for using these medications for functional seizures. Clinicians should taper off antiseizure medications for patients with functional seizures and without another indication for these medications. The guideline also identifies gaps in the available evidence and outlines potentially clinically impactful avenues for future research.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41370742/",
      "pubDate": "2026 Jan 13",
      "doi": "10.1212/WNL.0000000000214466",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "be422c645bd7",
      "title": "Glucagon-like peptide-1 receptor agonist treatment reduces body weight and improves glycaemic outcomes in patients with concurrent overweight/obesity and type 1 diabetes: A systematic review and meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49384343/118372",
      "abstract": "This systematic review and meta-analysis evaluated the long-term efficacy and safety of glucagon-like peptide-1 receptor agonists (GLP-1RAs) as adjunctive therapies for individuals with type 1 diabetes (T1D) and overweight or obesity. A literature search was conducted in June 2023 and updated in June 2025. Eligible studies included adults with T1D, body mass index ≥25 kg/m, and GLP-1RA treatment alongside insulin for ≥12 weeks. Changes in body weight, HbA1c, and insulin dose were expressed as mean differences (MDs) with 95% confidence intervals (CIs). Safety outcomes were assessed using odds ratios (ORs) with 95% CIs. Data were pooled using random-effects models. Exactly 13 studies met the inclusion criteria. GLP-1RA treatment was associated with a body weight reduction of 4.31 kg (95% CI: 3.61-5.00 kg) and a HbA1c reduction of 0.25% (95% CI: 0.18-0.32%). Across all studies, insulin dosage was reduced by 9.24 U/day (95% CI: 7.04-11.45 U/day). Subgroup analysis identified that semaglutide achieved the greatest reductions in all outcome measures. Hypoglycaemic episodes were increased (OR = 1.34; 95% CI: 1.02-1.76), while hyperglycaemic episodes decreased (OR: 0.69, 95% CI: 0.56-0.87). Gastrointestinal adverse events, including nausea and vomiting, were significantly more frequent with GLP-1RA treatment, though no increase in serious adverse events was observed. GLP-1RAs are effective for body weight reduction and glycaemic improvement in individuals with T1D and overweight/obesity, with acceptable safety profiles. These findings provide evidence that GLP-1RAs can be effectively and safely used as adjunctive therapy to insulin in people with T1D, but additional robust randomised clinical trials are needed.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "This systematic review and meta-analysis evaluated the long-term efficacy and safety of glucagon-like peptide-1 receptor agonists (GLP-1RAs) as adjunctive therapies for individuals with type 1 diabetes (T1D) and overweight or obesity."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "A literature search was conducted in June 2023 and updated in June 2025. Eligible studies included adults with T1D, body mass index ≥25 kg/m, and GLP-1RA treatment alongside insulin for ≥12 weeks. Changes in body weight, HbA1c, and insulin dose were expressed as mean differences (MDs) with 95% confidence intervals (CIs). Safety outcomes were assessed using odds ratios (ORs) with 95% CIs. Data were pooled using random-effects models."
        },
        {
          "label": "RESULTS",
          "text": "Exactly 13 studies met the inclusion criteria. GLP-1RA treatment was associated with a body weight reduction of 4.31 kg (95% CI: 3.61-5.00 kg) and a HbA1c reduction of 0.25% (95% CI: 0.18-0.32%). Across all studies, insulin dosage was reduced by 9.24 U/day (95% CI: 7.04-11.45 U/day). Subgroup analysis identified that semaglutide achieved the greatest reductions in all outcome measures. Hypoglycaemic episodes were increased (OR = 1.34; 95% CI: 1.02-1.76), while hyperglycaemic episodes decreased (OR: 0.69, 95% CI: 0.56-0.87). Gastrointestinal adverse events, including nausea and vomiting, were significantly more frequent with GLP-1RA treatment, though no increase in serious adverse events was observed."
        },
        {
          "label": "CONCLUSIONS",
          "text": "GLP-1RAs are effective for body weight reduction and glycaemic improvement in individuals with T1D and overweight/obesity, with acceptable safety profiles. These findings provide evidence that GLP-1RAs can be effectively and safely used as adjunctive therapy to insulin in people with T1D, but additional robust randomised clinical trials are needed."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41334580/",
      "pubDate": "2026 Jan",
      "doi": "10.1111/dom.70188",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "77ebaf042d33",
      "title": "Integrase versus protease inhibitor therapy in advanced HIV disease (LAPTOP): a multicountry, randomised, open-label, non-inferiority trial.",
      "journal": "Lancet Infect Dis",
      "score": "5/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49384343/118355",
      "abstract": "To date, clinical trials have been underpowered to assess which antiretrovirals perform best in people with advanced HIV disease. We aimed to investigate the efficacy and safety of an integrase inhibitor-containing versus a boosted protease inhibitor-containing regimen for this population. In this open-label, multicentre, non-inferiority trial in seven European countries (Spain, France, Italy, Germany, Belgium, Ireland, and the UK), therapy-naive adults with advanced HIV disease were randomly allocated (1:1) to receive either bictegravir, emtricitabine, and tenofovir alafenamide (integrase inhibitor group) or darunavir, cobicistat, emtricitabine, and tenofovir alafenamide (boosted protease inhibitor group) for 48 weeks. Randomisation was computer generated in permuted blocks within strata with block sizes of four and stratified by country and baseline CD4 cell count. The primary composite outcome (time to first occurrence of specified virological or clinical events) and its components were evaluated by Kaplan-Meier and Cox regression analyses in both modified intention-to-treat (mITT) and per-protocol populations. The mITT population included all randomly allocated participants who received at least one dose of the study drug, whereas the per-protocol population excluded those who received incorrect treatment. Non-inferiority of the integrase inhibitor-based regimen versus the boosted protease inhibitor-containing regimen was declared if the upper limit of the 95% CI of the hazard ratio (HR) for the primary composite endpoint was less than 1·606, corresponding to a 12% difference in the cumulative probability of the composite primary endpoint. Adverse events, a secondary endpoint, were recorded at eight visits in all participants. This trial is registered with ClinicalTrials.gov, NCT03696160, and is completed. Between May 13, 2019, and June 26, 2023, 222 people were randomly assigned to the integrase inhibitor group and 225 to the boosted protease inhibitor group. Of these 447 recruited participants, 442 (99%) participants with a median CD4 count of 41 cells per μL (IQR 17-79) received at least one dose. 358 (81%) of the 442 treated participants self-reported as male and 84 (19%) female, and 276 (62%) were of White ethnicity, 83 (19%) Black, and 83 (19%) other. In the mITT analysis, the 48-week composite primary outcome event occurred in 49 (22%) of 220 participants in the integrase inhibitor group versus 70 (32%) of 222 participants in the boosted protease inhibitor group (adjusted HR 0·70 [95% CI 0·48-1·00]; non-inferiority shown). The per-protocol analysis gave a similar estimated adjusted HR of 0·69 (0·48-1·00; non-inferiority shown). By mITT, drug-related adverse events (grade ≥2) occurred in 16 (7%) of 220 participants in the integrase inhibitor group versus 32 (14%) of 222 in the boosted protease inhibitor group (p=0·043). The rates of serious adverse events or adverse events leading to study discontinuation did not differ between groups. 12 deaths occurred during the study (nine in the integrase inhibitor group and three in the boosted protease inhibitor group), not related to the study drugs. In people with advanced HIV disease, bictegravir, emtricitabine, and tenofovir alafenamide was shown to be non-inferior to darunavir, cobicistat, emtricitabine, and tenofovir alafenamide and resulted in fewer adverse events, supporting its use as a preferred first-line antiretroviral regimen in this vulnerable population. Gilead Sciences and Janssen Pharmaceuticals.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "To date, clinical trials have been underpowered to assess which antiretrovirals perform best in people with advanced HIV disease. We aimed to investigate the efficacy and safety of an integrase inhibitor-containing versus a boosted protease inhibitor-containing regimen for this population."
        },
        {
          "label": "METHODS",
          "text": "In this open-label, multicentre, non-inferiority trial in seven European countries (Spain, France, Italy, Germany, Belgium, Ireland, and the UK), therapy-naive adults with advanced HIV disease were randomly allocated (1:1) to receive either bictegravir, emtricitabine, and tenofovir alafenamide (integrase inhibitor group) or darunavir, cobicistat, emtricitabine, and tenofovir alafenamide (boosted protease inhibitor group) for 48 weeks. Randomisation was computer generated in permuted blocks within strata with block sizes of four and stratified by country and baseline CD4 cell count. The primary composite outcome (time to first occurrence of specified virological or clinical events) and its components were evaluated by Kaplan-Meier and Cox regression analyses in both modified intention-to-treat (mITT) and per-protocol populations. The mITT population included all randomly allocated participants who received at least one dose of the study drug, whereas the per-protocol population excluded those who received incorrect treatment. Non-inferiority of the integrase inhibitor-based regimen versus the boosted protease inhibitor-containing regimen was declared if the upper limit of the 95% CI of the hazard ratio (HR) for the primary composite endpoint was less than 1·606, corresponding to a 12% difference in the cumulative probability of the composite primary endpoint. Adverse events, a secondary endpoint, were recorded at eight visits in all participants. This trial is registered with ClinicalTrials.gov, NCT03696160, and is completed."
        },
        {
          "label": "FINDINGS",
          "text": "Between May 13, 2019, and June 26, 2023, 222 people were randomly assigned to the integrase inhibitor group and 225 to the boosted protease inhibitor group. Of these 447 recruited participants, 442 (99%) participants with a median CD4 count of 41 cells per μL (IQR 17-79) received at least one dose. 358 (81%) of the 442 treated participants self-reported as male and 84 (19%) female, and 276 (62%) were of White ethnicity, 83 (19%) Black, and 83 (19%) other. In the mITT analysis, the 48-week composite primary outcome event occurred in 49 (22%) of 220 participants in the integrase inhibitor group versus 70 (32%) of 222 participants in the boosted protease inhibitor group (adjusted HR 0·70 [95% CI 0·48-1·00]; non-inferiority shown). The per-protocol analysis gave a similar estimated adjusted HR of 0·69 (0·48-1·00; non-inferiority shown). By mITT, drug-related adverse events (grade ≥2) occurred in 16 (7%) of 220 participants in the integrase inhibitor group versus 32 (14%) of 222 in the boosted protease inhibitor group (p=0·043). The rates of serious adverse events or adverse events leading to study discontinuation did not differ between groups. 12 deaths occurred during the study (nine in the integrase inhibitor group and three in the boosted protease inhibitor group), not related to the study drugs."
        },
        {
          "label": "INTERPRETATION",
          "text": "In people with advanced HIV disease, bictegravir, emtricitabine, and tenofovir alafenamide was shown to be non-inferior to darunavir, cobicistat, emtricitabine, and tenofovir alafenamide and resulted in fewer adverse events, supporting its use as a preferred first-line antiretroviral regimen in this vulnerable population."
        },
        {
          "label": "FUNDING",
          "text": "Gilead Sciences and Janssen Pharmaceuticals."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41344354/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1016/S1473-3099(25)00681-4",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "a5aebe2c4eab",
      "title": "Aficamten in Obstructive Hypertrophic Cardiomyopathy: A Multidomain, Patient-Level Analysis of the MAPLE-HCM Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118328",
      "abstract": "For >60 years, beta-blockers have been first-line therapy for symptomatic obstructive hypertrophic cardiomyopathy (oHCM), although limited data support this recommendation. The MAPLE-HCM trial showed greater improvement in exercise capacity and secondary endpoints for aficamten monotherapy vs metoprolol monotherapy. The purpose of this study was to evaluate the effects of aficamten vs metoprolol across multiple clinically relevant and patient-centric measures of disease burden in oHCM. Patients with oHCM and left ventricular outflow tract gradient (LVOT-G) ≥30 mm Hg at rest and/or ≥50 mm Hg with Valsalva were randomly assigned to aficamten (n = 88) or metoprolol (n = 87). Dose titration was based on vital signs and echocardiograms. Assessment of clinical response by treatment arm was based on improvement in multiple parameters reflecting oHCM disease burden: LVOT-G <30 mm Hg at rest and <50 mm Hg with Valsalva; ≥1 class improvement in NYHA functional class and/or ≥10-point improvement in Kansas City Cardiomyopathy Questionnaire-Clinical Summary Score (KCCQ-CSS); ≥50% reduction in N-terminal pro-B-type natriuretic peptide; ≥1.0 mL/kg/min increase in peak oxygen consumption (pVO); and ≥10% reduction in left atrial volume index. Clinical response was classified by number of efficacy outcomes achieved: nonresponder (none), limited (1 or 2), positive (3 or 4), or complete (all 5). Baseline characteristics were similar for both treatment groups. For the overall cohort, mean age was 58 ± 13.2 years; 73 (42%) were women, 103 (70%) were in NYHA functional class II and 52 (30%) in class III, mean pVO was 19.9 ± 5.1 mL/kg/min, and mean KCCQ-CSS score was 66 ± 16. At 24 weeks, aficamten treatment was associated with greater benefits in all efficacy outcome measures, with numbers needed to treat ranging from 1.5 to 5.0 relative to metoprolol treatment. Patients treated with aficamten were more likely to be either positive or complete responders compared with patients treated with metoprolol (78% vs 3%, respectively; P < 0.001). In patients with symptomatic oHCM, aficamten monotherapy led to superior and rapid treatment benefits across several clinically relevant outcome measures of disease burden compared with metoprolol. These observations support the emerging role of aficamten as monotherapy for oHCM. (Phase 3 Trial to Evaluate the Efficacy and Safety of Aficamten Compared to Metoprolol Succinate in Adults With Symptomatic oHCM [MAPLE-HCM]; NCT05767346).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "For >60 years, beta-blockers have been first-line therapy for symptomatic obstructive hypertrophic cardiomyopathy (oHCM), although limited data support this recommendation. The MAPLE-HCM trial showed greater improvement in exercise capacity and secondary endpoints for aficamten monotherapy vs metoprolol monotherapy."
        },
        {
          "label": "OBJECTIVES",
          "text": "The purpose of this study was to evaluate the effects of aficamten vs metoprolol across multiple clinically relevant and patient-centric measures of disease burden in oHCM."
        },
        {
          "label": "METHODS",
          "text": "Patients with oHCM and left ventricular outflow tract gradient (LVOT-G) ≥30 mm Hg at rest and/or ≥50 mm Hg with Valsalva were randomly assigned to aficamten (n = 88) or metoprolol (n = 87). Dose titration was based on vital signs and echocardiograms. Assessment of clinical response by treatment arm was based on improvement in multiple parameters reflecting oHCM disease burden: LVOT-G <30 mm Hg at rest and <50 mm Hg with Valsalva; ≥1 class improvement in NYHA functional class and/or ≥10-point improvement in Kansas City Cardiomyopathy Questionnaire-Clinical Summary Score (KCCQ-CSS); ≥50% reduction in N-terminal pro-B-type natriuretic peptide; ≥1.0 mL/kg/min increase in peak oxygen consumption (pVO); and ≥10% reduction in left atrial volume index. Clinical response was classified by number of efficacy outcomes achieved: nonresponder (none), limited (1 or 2), positive (3 or 4), or complete (all 5)."
        },
        {
          "label": "RESULTS",
          "text": "Baseline characteristics were similar for both treatment groups. For the overall cohort, mean age was 58 ± 13.2 years; 73 (42%) were women, 103 (70%) were in NYHA functional class II and 52 (30%) in class III, mean pVO was 19.9 ± 5.1 mL/kg/min, and mean KCCQ-CSS score was 66 ± 16. At 24 weeks, aficamten treatment was associated with greater benefits in all efficacy outcome measures, with numbers needed to treat ranging from 1.5 to 5.0 relative to metoprolol treatment. Patients treated with aficamten were more likely to be either positive or complete responders compared with patients treated with metoprolol (78% vs 3%, respectively; P < 0.001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with symptomatic oHCM, aficamten monotherapy led to superior and rapid treatment benefits across several clinically relevant outcome measures of disease burden compared with metoprolol. These observations support the emerging role of aficamten as monotherapy for oHCM. (Phase 3 Trial to Evaluate the Efficacy and Safety of Aficamten Compared to Metoprolol Succinate in Adults With Symptomatic oHCM [MAPLE-HCM]; NCT05767346)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41348072/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.057",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "80a8f0143f95",
      "title": "Umbrella Review and Meta-Analysis: Screening Tools for the Identification of Developmental Delay in Early Childhood.",
      "journal": "J Am Acad Child Adolesc Psychiatry",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118318",
      "abstract": "This systematic review and meta-analysis aimed to identify the range of developmental screening tools used globally, and to assess their pooled accuracy in identifying developmental delay among children aged 0 to 6 years. PubMed, MEDLINE, PsycINFO, and Google Scholar were searched up to March 2025, with no language restrictions. Systematic or scoping reviews published within the last 10 years were included if they reported any information on the accuracy of a screening tool designed to identify delay in ≥2 domains. Meta-analyses were conducted to pool estimates of sensitivity, specificity, and area under the curve (AUC). Certainty of evidence for each tool was assessed using the Grading of Recommendations, Assessment, Development, and Evaluation (GRADE) approach. Quality was assessed using A MeaSurement Tool to Assess systematic Reviews (AMSTAR 2) tool. Thirteen reviews reporting on 38 distinct tools were identified. Nine tools had sufficient data for meta-analysis, of which only the Ages and Stages Questionnaire (ASQ), Parents' Evaluations of Developmental Status (PEDS), and Denver Developmental Screening Test (DDST) were informed by more than 2 independent samples. Although most tools demonstrated good discriminative ability (AUC 0.66-0.89), the majority failed to meet minimal accepted thresholds for both sensitivity (0.8) and specificity (0.8). Wide confidence intervals and high heterogeneity were observed for most tools across both estimates. None of the currently available screening tools demonstrate sufficient accuracy for clinical use or population screening, underscoring the need for more nuanced implementation strategies that account for the known limitations of accuracy. Screening tools for the identification of developmental delay in early childhood: an umbrella review; https://www.crd.york.ac.uk/PROSPERO/view/CRD42024577375.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This systematic review and meta-analysis aimed to identify the range of developmental screening tools used globally, and to assess their pooled accuracy in identifying developmental delay among children aged 0 to 6 years."
        },
        {
          "label": "METHOD",
          "text": "PubMed, MEDLINE, PsycINFO, and Google Scholar were searched up to March 2025, with no language restrictions. Systematic or scoping reviews published within the last 10 years were included if they reported any information on the accuracy of a screening tool designed to identify delay in ≥2 domains. Meta-analyses were conducted to pool estimates of sensitivity, specificity, and area under the curve (AUC). Certainty of evidence for each tool was assessed using the Grading of Recommendations, Assessment, Development, and Evaluation (GRADE) approach. Quality was assessed using A MeaSurement Tool to Assess systematic Reviews (AMSTAR 2) tool."
        },
        {
          "label": "RESULTS",
          "text": "Thirteen reviews reporting on 38 distinct tools were identified. Nine tools had sufficient data for meta-analysis, of which only the Ages and Stages Questionnaire (ASQ), Parents' Evaluations of Developmental Status (PEDS), and Denver Developmental Screening Test (DDST) were informed by more than 2 independent samples. Although most tools demonstrated good discriminative ability (AUC 0.66-0.89), the majority failed to meet minimal accepted thresholds for both sensitivity (0.8) and specificity (0.8). Wide confidence intervals and high heterogeneity were observed for most tools across both estimates."
        },
        {
          "label": "CONCLUSION",
          "text": "None of the currently available screening tools demonstrate sufficient accuracy for clinical use or population screening, underscoring the need for more nuanced implementation strategies that account for the known limitations of accuracy."
        },
        {
          "label": "STUDY REGISTRATION INFORMATION",
          "text": "Screening tools for the identification of developmental delay in early childhood: an umbrella review; https://www.crd.york.ac.uk/PROSPERO/view/CRD42024577375."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40975434/",
      "pubDate": "2025 Sep 18",
      "doi": "10.1016/j.jaac.2025.09.011",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "26cfb2978adb",
      "title": "Trial of Pegcetacoplan in C3 Glomerulopathy and Immune-Complex MPGN.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118303",
      "abstract": "C3 glomerulopathy and primary immune-complex membranoproliferative glomerulonephritis (MPGN) generally result in glomerular C3 deposition and irreversible kidney damage. The efficacy and safety of pegcetacoplan, a C3 and C3b inhibitor, in persons with C3 glomerulopathy or primary immune-complex MPGN are unclear. We conducted a phase 3, double-blind, placebo-controlled trial involving adolescents and adults with C3 glomerulopathy or primary immune-complex MPGN, including those with native kidney disease and those with disease recurrence after transplantation. Patients were randomly assigned in a 1:1 ratio to receive pegcetacoplan or placebo. The primary end point was the log-transformed ratio of the urinary protein-to-creatinine ratio at week 26 as compared with baseline. A total of 124 patients underwent randomization. The change in proteinuria (as measured by the log-transformed ratio to baseline in the urinary protein-to-creatinine ratio) was significantly greater with pegcetacoplan than with placebo (geometric mean of the urinary protein-to-creatinine ratio, -67.2% [95% confidence interval {CI}, -74.9 to -57.2] vs. 2.9% [95% CI, -8.6 to 15.9]). The difference represents a relative reduction of 68.1% (95% CI, 57.3 to 76.2) as compared with placebo. In hierarchical testing of five secondary end points, significantly higher percentages of patients in the pegcetacoplan group than in the placebo group met the composite renal end-point criteria (stabilization of estimated glomerular filtration rate [eGFR] and ≥50% reduction in urinary protein-to-creatinine ratio) (49% vs. 3%) and had at least a 50% reduction in the protein-to-creatinine ratio (60% vs. 5%). Among 69 patients with evaluable kidney-biopsy samples, the change in the activity score of the C3 glomerulopathy histologic index did not differ significantly between the two groups; subsequent end points (decrease in C3 staining and change in eGFR) were not formally tested. Pegcetacoplan was not associated with more adverse events than placebo. No serious infections from encapsulated bacteria occurred; 1 patient receiving pegcetacoplan died from coronavirus disease 2019 pneumonia. No allograft rejection or loss occurred. Pegcetacoplan resulted in a significantly greater reduction in proteinuria than placebo among patients with C3 glomerulopathy or primary immune-complex MPGN. (Funded by Apellis Pharmaceuticals and Sobi [Swedish Orphan Biovitrum]; VALIANT ClinicalTrials.gov number, NCT05067127.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "C3 glomerulopathy and primary immune-complex membranoproliferative glomerulonephritis (MPGN) generally result in glomerular C3 deposition and irreversible kidney damage. The efficacy and safety of pegcetacoplan, a C3 and C3b inhibitor, in persons with C3 glomerulopathy or primary immune-complex MPGN are unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted a phase 3, double-blind, placebo-controlled trial involving adolescents and adults with C3 glomerulopathy or primary immune-complex MPGN, including those with native kidney disease and those with disease recurrence after transplantation. Patients were randomly assigned in a 1:1 ratio to receive pegcetacoplan or placebo. The primary end point was the log-transformed ratio of the urinary protein-to-creatinine ratio at week 26 as compared with baseline."
        },
        {
          "label": "RESULTS",
          "text": "A total of 124 patients underwent randomization. The change in proteinuria (as measured by the log-transformed ratio to baseline in the urinary protein-to-creatinine ratio) was significantly greater with pegcetacoplan than with placebo (geometric mean of the urinary protein-to-creatinine ratio, -67.2% [95% confidence interval {CI}, -74.9 to -57.2] vs. 2.9% [95% CI, -8.6 to 15.9]). The difference represents a relative reduction of 68.1% (95% CI, 57.3 to 76.2) as compared with placebo. In hierarchical testing of five secondary end points, significantly higher percentages of patients in the pegcetacoplan group than in the placebo group met the composite renal end-point criteria (stabilization of estimated glomerular filtration rate [eGFR] and ≥50% reduction in urinary protein-to-creatinine ratio) (49% vs. 3%) and had at least a 50% reduction in the protein-to-creatinine ratio (60% vs. 5%). Among 69 patients with evaluable kidney-biopsy samples, the change in the activity score of the C3 glomerulopathy histologic index did not differ significantly between the two groups; subsequent end points (decrease in C3 staining and change in eGFR) were not formally tested. Pegcetacoplan was not associated with more adverse events than placebo. No serious infections from encapsulated bacteria occurred; 1 patient receiving pegcetacoplan died from coronavirus disease 2019 pneumonia. No allograft rejection or loss occurred."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Pegcetacoplan resulted in a significantly greater reduction in proteinuria than placebo among patients with C3 glomerulopathy or primary immune-complex MPGN. (Funded by Apellis Pharmaceuticals and Sobi [Swedish Orphan Biovitrum]; VALIANT ClinicalTrials.gov number, NCT05067127.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41337715/",
      "pubDate": "2025 Dec 04",
      "doi": "10.1056/NEJMoa2501510",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "c2701efcf0cd",
      "title": "Oral Corticosteroid Use During Pregnancy and the Risk of Gestational Diabetes.",
      "journal": "JAMA Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118285",
      "abstract": "Oral corticosteroids (OCSs) are increasingly used during pregnancy for various conditions due to their immunosuppressive and anti-inflammatory properties. However, OCSs may induce insulin resistance, potentially contributing to gestational diabetes, and limited studies have examined this association. To assess the risk of gestational diabetes associated with OCS use during pregnancy. This nationwide, population-based cohort study included pregnancies resulting in live births in Korea from 2010 through 2021. A sequential landmark analysis was conducted, with OCS exposure assessed in 3-week intervals between 1 and 27 weeks' gestation. Data were analyzed from June 26, 2024, to September 19, 2025. Pregnancies among women who were exposed to OCSs were compared with pregnancies among women who were not exposed to OCSs within each 3-week interval and in pooled analyses. Gestational diabetes was assessed from 20 weeks plus 1 day of gestation until delivery using a previously validated algorithm. Propensity score-based overlap weighting was applied to adjust for comorbidities, medication use, and health care utilization. Risk ratios (RRs) and 95% CIs were estimated using bootstrapping with 200 replications. Subgroup analyses by age, indication, duration of action, dose, timing, and duration of exposures were performed. Among 3 848 270 pregnancies, 1 325 940 were eligible for analysis, of which 79 710 (6.0%) were exposed to OCSs between 1 and 27 weeks' gestation. OCS exposure was not associated with an increased risk of gestational diabetes in most intervals, except between 4 and 6 weeks' gestation (weighted RR, 1.10; 95% CI, 1.03-1.17). In the pooled analysis, gestational diabetes occurred in 9.50% (95% CI, 9.26%-9.74%) of pregnancies among women in the exposed group vs 7.36% (95% CI, 7.31%-7.43%) of pregnancies among those in the unexposed group (weighted RR, 1.01; 95% CI, 0.99-1.03). Subgroup analyses showed no significant effect modification by maternal age, indication, duration of action, dosage, timing, or duration of exposure. In this cohort study, OCS exposure during pregnancy was not associated with an increased risk of gestational diabetes, except for a modest increase in risk among women exposed to OCSs between 4 and 6 weeks' gestation, supporting the use of OCSs when clinically indicated.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Oral corticosteroids (OCSs) are increasingly used during pregnancy for various conditions due to their immunosuppressive and anti-inflammatory properties. However, OCSs may induce insulin resistance, potentially contributing to gestational diabetes, and limited studies have examined this association."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the risk of gestational diabetes associated with OCS use during pregnancy."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This nationwide, population-based cohort study included pregnancies resulting in live births in Korea from 2010 through 2021. A sequential landmark analysis was conducted, with OCS exposure assessed in 3-week intervals between 1 and 27 weeks' gestation. Data were analyzed from June 26, 2024, to September 19, 2025."
        },
        {
          "label": "EXPOSURE",
          "text": "Pregnancies among women who were exposed to OCSs were compared with pregnancies among women who were not exposed to OCSs within each 3-week interval and in pooled analyses."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Gestational diabetes was assessed from 20 weeks plus 1 day of gestation until delivery using a previously validated algorithm. Propensity score-based overlap weighting was applied to adjust for comorbidities, medication use, and health care utilization. Risk ratios (RRs) and 95% CIs were estimated using bootstrapping with 200 replications. Subgroup analyses by age, indication, duration of action, dose, timing, and duration of exposures were performed."
        },
        {
          "label": "RESULTS",
          "text": "Among 3 848 270 pregnancies, 1 325 940 were eligible for analysis, of which 79 710 (6.0%) were exposed to OCSs between 1 and 27 weeks' gestation. OCS exposure was not associated with an increased risk of gestational diabetes in most intervals, except between 4 and 6 weeks' gestation (weighted RR, 1.10; 95% CI, 1.03-1.17). In the pooled analysis, gestational diabetes occurred in 9.50% (95% CI, 9.26%-9.74%) of pregnancies among women in the exposed group vs 7.36% (95% CI, 7.31%-7.43%) of pregnancies among those in the unexposed group (weighted RR, 1.01; 95% CI, 0.99-1.03). Subgroup analyses showed no significant effect modification by maternal age, indication, duration of action, dosage, timing, or duration of exposure."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this cohort study, OCS exposure during pregnancy was not associated with an increased risk of gestational diabetes, except for a modest increase in risk among women exposed to OCSs between 4 and 6 weeks' gestation, supporting the use of OCSs when clinically indicated."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324930/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jamainternmed.2025.6367",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "8edf1174d12a",
      "title": "Dipeptidyl peptidase 4 (DPP-4) inhibitors for people with chronic kidney disease and diabetes.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118267",
      "abstract": "Diabetes is a critical risk factor for cardiovascular disease and chronic kidney disease (CKD). Type 2 diabetes increases all-cause and cardiovascular death and impairs health-related quality of life. More than a third of people with type 2 diabetes develop kidney failure, requiring treatment with dialysis or kidney transplantation. People with CKD and type 2 diabetes have a substantially higher risk of premature cardiovascular complications. Dipeptidyl peptidase 4 (DPP-4) inhibitors are glucose-lowering agents that achieve glucose control in people with type 2 diabetes and may prevent poor kidney and cardiovascular outcomes for people with CKD and type 2 diabetes. However, new trials are emerging rapidly, and continuous evidence synthesis is essential to summarising cumulative evidence. This review aims to assess the benefits and harms of DPP-4 inhibitors in people with CKD and type 2 diabetes. We searched the Cochrane Kidney and Transplant Register of Studies up to 25 March 2025 using a search strategy designed by an Information Specialist. Studies in the Register are continually identified through regular searches of CENTRAL, MEDLINE, Embase, conference proceedings, the International Clinical Trials Register (ICTRP) Search Portal and ClinicalTrials.gov. Randomised controlled studies (RCTs) were eligible if they compared treatment with a DPP-4 inhibitor against placebo, standard medical care (including usual other glucose-lowering agents or no treatment), or another glucose-lowering agent in people with CKD and type 2 diabetes. We included all CKD categories (from 1 to 5), including people treated with dialysis. People with type 1 diabetes and kidney transplant recipients were excluded. The critical review outcomes were cardiovascular death and hypoglycaemia requiring third-party assistance. The key important outcomes included 3- and 4-point major cardiovascular events (MACE), nonfatal myocardial infarction, nonfatal stroke, and kidney failure. The risk of bias version 2 tool was used to assess the studies. Three review authors independently extracted data and assessed the study risk of bias. Treatment estimates were summarised using random effects meta-analysis and expressed as relative risk (RR) or mean difference (MD), with corresponding 95% confidence interval (CI). Evidence certainty was assessed using the Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach. Fifty-nine studies involving 27,893 participants were included. DPP-4 inhibitors with or without other background treatments were compared to placebo, standard medical care, sodium-glucose cotransport 2 inhibitors, glucagon-like peptide-1 receptor agonists, sulfonylurea, other DPP-4 inhibitors, insulin, or alpha-glucosidase inhibitors. There were no studies evaluating treatment in children. We contacted 10 authors from primary studies to retrieve additional information, but no further data were added to this review. Compared to placebo or standard medical care, DPP-4 inhibitors may have little or no effect on the risk of cardiovascular death (RR 0.96, 95% CI 0.82 to 1.14; 6 studies, 7568 participants; low-certainty evidence) and hypoglycaemia requiring third-party assistance in people with all CKD categories (RR 0.97, 95% CI 0.76 to 1.25; I² = 0%; 10 studies, 8994 participants; low-certainty evidence). DPP-4 inhibitors probably have little or no effect on 3-point MACE compared with placebo (RR 1.03, 95% CI 0.91 to 1.17; 1 study, 6979 participants; moderate-certainty evidence). DPP-4 inhibitors had uncertain effects on the risk of 4-point MACE compared with placebo (RR 0.74, 95% CI 0.29 to 1.88; 1 study, 133 participants; very low-certainty evidence), nonfatal myocardial infarction compared with placebo in people with CKD categories 3-5, including those on dialysis (RR 1.91, 95% CI 0.36 to 10.08; 1 study, 133 participants; very-low-certainty evidence), or nonfatal stroke compared with placebo (RR 0.96, 95% CI 0.06 to 14.97; 1 study, 133 participants; very-low-certainty evidence). Compared to placebo or standard medical care, DPP-4 inhibitors probably have little or no effect on kidney failure in people with all CKD categories (RR 1.09, 95% CI 0.78 to 1.53; I² = 0%; 3 studies, 7472 participants; moderate-certainty evidence). The effects of DPP-4 inhibitors compared to other glucose-lowering agents were uncertain. No studies evaluated treatment on the clinical outcomes of life participation, lactic acidosis, blindness, diabetic ketoacidosis, peritoneal dialysis infection, or peritoneal dialysis failure. The overall risk of bias was assessed as low or very low for most included studies. DPP-4 inhibitors had an uncertain effect on the risks of cardiovascular death and hypoglycaemia requiring third-party assistance in people with CKD and type 2 diabetes when compared with placebo or standard medical care, whilst the effects on other glucose-lowering agents were uncertain. Despite the large number of studies, there is little evidence that DPP-4 inhibitors prevent key adverse clinical outcomes for people who have CKD and type 2 diabetes. Future well-designed and adequately powered RCTs can provide better information about the effects of DPP-4 inhibitors on key patient-reported outcomes and cost to better inform decision-making and clinical practice in this setting. This Cochrane Review had no dedicated funding. Protocol available via DOI: 10.1002/14651858.CD015906.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Diabetes is a critical risk factor for cardiovascular disease and chronic kidney disease (CKD). Type 2 diabetes increases all-cause and cardiovascular death and impairs health-related quality of life. More than a third of people with type 2 diabetes develop kidney failure, requiring treatment with dialysis or kidney transplantation. People with CKD and type 2 diabetes have a substantially higher risk of premature cardiovascular complications. Dipeptidyl peptidase 4 (DPP-4) inhibitors are glucose-lowering agents that achieve glucose control in people with type 2 diabetes and may prevent poor kidney and cardiovascular outcomes for people with CKD and type 2 diabetes. However, new trials are emerging rapidly, and continuous evidence synthesis is essential to summarising cumulative evidence."
        },
        {
          "label": "OBJECTIVES",
          "text": "This review aims to assess the benefits and harms of DPP-4 inhibitors in people with CKD and type 2 diabetes."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Kidney and Transplant Register of Studies up to 25 March 2025 using a search strategy designed by an Information Specialist. Studies in the Register are continually identified through regular searches of CENTRAL, MEDLINE, Embase, conference proceedings, the International Clinical Trials Register (ICTRP) Search Portal and ClinicalTrials.gov."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled studies (RCTs) were eligible if they compared treatment with a DPP-4 inhibitor against placebo, standard medical care (including usual other glucose-lowering agents or no treatment), or another glucose-lowering agent in people with CKD and type 2 diabetes. We included all CKD categories (from 1 to 5), including people treated with dialysis. People with type 1 diabetes and kidney transplant recipients were excluded."
        },
        {
          "label": "OUTCOMES",
          "text": "The critical review outcomes were cardiovascular death and hypoglycaemia requiring third-party assistance. The key important outcomes included 3- and 4-point major cardiovascular events (MACE), nonfatal myocardial infarction, nonfatal stroke, and kidney failure."
        },
        {
          "label": "RISK OF BIAS",
          "text": "The risk of bias version 2 tool was used to assess the studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Three review authors independently extracted data and assessed the study risk of bias. Treatment estimates were summarised using random effects meta-analysis and expressed as relative risk (RR) or mean difference (MD), with corresponding 95% confidence interval (CI). Evidence certainty was assessed using the Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Fifty-nine studies involving 27,893 participants were included. DPP-4 inhibitors with or without other background treatments were compared to placebo, standard medical care, sodium-glucose cotransport 2 inhibitors, glucagon-like peptide-1 receptor agonists, sulfonylurea, other DPP-4 inhibitors, insulin, or alpha-glucosidase inhibitors. There were no studies evaluating treatment in children. We contacted 10 authors from primary studies to retrieve additional information, but no further data were added to this review."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Compared to placebo or standard medical care, DPP-4 inhibitors may have little or no effect on the risk of cardiovascular death (RR 0.96, 95% CI 0.82 to 1.14; 6 studies, 7568 participants; low-certainty evidence) and hypoglycaemia requiring third-party assistance in people with all CKD categories (RR 0.97, 95% CI 0.76 to 1.25; I² = 0%; 10 studies, 8994 participants; low-certainty evidence). DPP-4 inhibitors probably have little or no effect on 3-point MACE compared with placebo (RR 1.03, 95% CI 0.91 to 1.17; 1 study, 6979 participants; moderate-certainty evidence). DPP-4 inhibitors had uncertain effects on the risk of 4-point MACE compared with placebo (RR 0.74, 95% CI 0.29 to 1.88; 1 study, 133 participants; very low-certainty evidence), nonfatal myocardial infarction compared with placebo in people with CKD categories 3-5, including those on dialysis (RR 1.91, 95% CI 0.36 to 10.08; 1 study, 133 participants; very-low-certainty evidence), or nonfatal stroke compared with placebo (RR 0.96, 95% CI 0.06 to 14.97; 1 study, 133 participants; very-low-certainty evidence). Compared to placebo or standard medical care, DPP-4 inhibitors probably have little or no effect on kidney failure in people with all CKD categories (RR 1.09, 95% CI 0.78 to 1.53; I² = 0%; 3 studies, 7472 participants; moderate-certainty evidence). The effects of DPP-4 inhibitors compared to other glucose-lowering agents were uncertain. No studies evaluated treatment on the clinical outcomes of life participation, lactic acidosis, blindness, diabetic ketoacidosis, peritoneal dialysis infection, or peritoneal dialysis failure. The overall risk of bias was assessed as low or very low for most included studies."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "DPP-4 inhibitors had an uncertain effect on the risks of cardiovascular death and hypoglycaemia requiring third-party assistance in people with CKD and type 2 diabetes when compared with placebo or standard medical care, whilst the effects on other glucose-lowering agents were uncertain. Despite the large number of studies, there is little evidence that DPP-4 inhibitors prevent key adverse clinical outcomes for people who have CKD and type 2 diabetes. Future well-designed and adequately powered RCTs can provide better information about the effects of DPP-4 inhibitors on key patient-reported outcomes and cost to better inform decision-making and clinical practice in this setting."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane Review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via DOI: 10.1002/14651858.CD015906."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41263251/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1002/14651858.CD015906.pub2",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "e24a970bffc4",
      "title": "Neurological Events Associated With Acute Dengue Infection.",
      "journal": "JAMA Neurol",
      "score": "5/7",
      "tags": [
        "Neurology",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118264",
      "abstract": "With increasing global incidence of acute dengue virus (DENV) infection, more accurate estimates of the burden of neurological events following infection are required; however, population-based estimates are lacking. To evaluate the risk and excess burden of neurological events in a cohort of DENV-infected adults in the acute postinfectious period vs population-based comparators without DENV infection. This was a retrospective, population-based cohort study in Singapore. National registries were used to construct a cohort of all adults (aged ≥18 years) infected with DENV from January 1, 2017, through December 31, 2023, for whom the index date (time 0 [T0]) was taken as the date of notification, and a cohort of uninfected population-based comparators, for whom T0 was randomly assigned to match T0 distribution in DENV-infected cases. As the period overlapped with the COVID-19 pandemic, individuals infected with SARS-CoV-2 within 30 days of T0 were additionally excluded, as were individuals who died before T0 and uninfected comparators with no prior health care contact. Data analysis was performed from January 1, 2017, through March 30, 2024. DENV infection recorded in the national registry. New-incident neurological events, including any neurological event, memory loss, movement disorders, and other neurological disorders (eg, fatigue or malaise, encephalitis or encephalopathy), following DENV infection were identified using national health care claims records, and risk was assessed over the acute follow-up period. Odds of new-incident neurological events in DENV-infected cases vs uninfected comparators were estimated using overlap-weighted logistic regression at 30 to 90 days after T0. A total of 65 207 confirmed DENV-infected cases (mean [SD] age, 48.4 [17.8] years; 34 876 [53.5%] male) were compared against 1 616 865 uninfected comparators (mean [SD] age, 54.8 [18.3] years; 730 702 [45.2%] male). At 30 days following DENV infection, individuals with DENV infection, compared with uninfected individuals, had elevated odds of any new-incident neurological event (adjusted odds ratio [aOR], 9.69; 95% CI, 6.59-14.90), memory loss (aOR, 3.19; 95% CI, 1.36-8.69), movement disorders (aOR, 7.10; 95% CI, 2.49-29.18), and other neurological events (aOR, 14.32; 95% CI, 8.61-26.04); risk trajectories diverged up to 90 days after infection. However, the overall excess burden was modest, with less than 1 excess event per 100 cases. The DENV-infected cases, compared with uninfected individuals, had increased odds of memory loss (aOR, 2.99; 95% CI, 1.30-7.87) and movement disorders (aOR, 6.38; 95% CI, 2.23-25.96) only among those aged 60 years or older and in cases infected during DENV serotype 3 transmission. DENV infection was associated with significantly higher odds of acute new-incident neurological events following infection, although the excess burden was modest. Older adults should be monitored for a wider spectrum of potential neurological complications following DENV infection.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "With increasing global incidence of acute dengue virus (DENV) infection, more accurate estimates of the burden of neurological events following infection are required; however, population-based estimates are lacking."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the risk and excess burden of neurological events in a cohort of DENV-infected adults in the acute postinfectious period vs population-based comparators without DENV infection."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a retrospective, population-based cohort study in Singapore. National registries were used to construct a cohort of all adults (aged ≥18 years) infected with DENV from January 1, 2017, through December 31, 2023, for whom the index date (time 0 [T0]) was taken as the date of notification, and a cohort of uninfected population-based comparators, for whom T0 was randomly assigned to match T0 distribution in DENV-infected cases. As the period overlapped with the COVID-19 pandemic, individuals infected with SARS-CoV-2 within 30 days of T0 were additionally excluded, as were individuals who died before T0 and uninfected comparators with no prior health care contact. Data analysis was performed from January 1, 2017, through March 30, 2024."
        },
        {
          "label": "EXPOSURE",
          "text": "DENV infection recorded in the national registry."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "New-incident neurological events, including any neurological event, memory loss, movement disorders, and other neurological disorders (eg, fatigue or malaise, encephalitis or encephalopathy), following DENV infection were identified using national health care claims records, and risk was assessed over the acute follow-up period. Odds of new-incident neurological events in DENV-infected cases vs uninfected comparators were estimated using overlap-weighted logistic regression at 30 to 90 days after T0."
        },
        {
          "label": "RESULTS",
          "text": "A total of 65 207 confirmed DENV-infected cases (mean [SD] age, 48.4 [17.8] years; 34 876 [53.5%] male) were compared against 1 616 865 uninfected comparators (mean [SD] age, 54.8 [18.3] years; 730 702 [45.2%] male). At 30 days following DENV infection, individuals with DENV infection, compared with uninfected individuals, had elevated odds of any new-incident neurological event (adjusted odds ratio [aOR], 9.69; 95% CI, 6.59-14.90), memory loss (aOR, 3.19; 95% CI, 1.36-8.69), movement disorders (aOR, 7.10; 95% CI, 2.49-29.18), and other neurological events (aOR, 14.32; 95% CI, 8.61-26.04); risk trajectories diverged up to 90 days after infection. However, the overall excess burden was modest, with less than 1 excess event per 100 cases. The DENV-infected cases, compared with uninfected individuals, had increased odds of memory loss (aOR, 2.99; 95% CI, 1.30-7.87) and movement disorders (aOR, 6.38; 95% CI, 2.23-25.96) only among those aged 60 years or older and in cases infected during DENV serotype 3 transmission."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "DENV infection was associated with significantly higher odds of acute new-incident neurological events following infection, although the excess burden was modest. Older adults should be monitored for a wider spectrum of potential neurological complications following DENV infection."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41284268/",
      "pubDate": "2025 Nov 24",
      "doi": "10.1001/jamaneurol.2025.4608",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "7f9db8ce7138",
      "title": "Clinical Efficacy and Safety of Auricular Acupuncture for Migraine: A Systematic Review and Meta-Analysis of Randomized Controlled Trials.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118242",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "4ee74fa721ee",
      "title": "Topical immunosuppressants for blepharitis in adults.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49271974/118236",
      "abstract": "Blepharitis is a common ocular condition characterized by inflammation of the eyelid margins, which can cause irritating symptoms and ocular surface damage. Conventional treatment of blepharitis consists of eyelid hygiene and artificial tears. To suppress inflammation, topical corticosteroids, with or without antibiotics, are frequently prescribed. However, long-term use is limited by side effects such as increased intraocular pressure, glaucoma and/or cataract formation. Newer steroid-sparing topical immunosuppressants have emerged as alternative treatments. To assess the benefits and harms of topical immunosuppressants for blepharitis in adults. We searched CENTRAL, MEDLINE, Embase, and three trial registries from inception to 6 April 2025. We searched the reference lists of included studies for any additional studies not identified by the electronic searches. There were no date or language restrictions on the selection of eligible studies. We included randomized controlled trials (RCTs) comparing topical immunosuppressants (corticosteroids, cyclosporine, or tacrolimus) of different doses or carrier, with placebo, no treatment, conventional treatment (lid hygiene, artificial tears) or other topical immunosuppressants in adults with blepharitis. We excluded paired-eye studies and highly specific blepharitis subtypes. Our outcomes were: (1) change from baseline in composite (or total) symptom score; (2) change from baseline in tear film breakup time; (3) change from baseline in corneal staining scores; (4) proportion of individuals experiencing symptomatic improvement; (5) reduction in number of or eradication of colonies of positive cultures of bacteria; (6) quality of life measures; (7) economic costs of different topical immunosuppressants; and (8) adverse effects. We used Cochrane's risk of bias (RoB) 2 tool for all outcomes reported in the summary of findings tables. Two review authors independently selected trials, extracted data, and assessed risk of bias. We used fixed-effect meta-analysis to combine data and forest plots to assess heterogeneity, effect size, and direction. We used GRADE to assess the certainty of evidence for each outcome. When meta-analysis was not possible, we used narrative synthesis. We included 12 RCTs with 2752 participants (2802 eyes) in total. Six of the trials were conducted in the USA. Topical corticosteroid was the most frequently studied immunosuppressant, followed by cyclosporine and tacrolimus. The point of assessment and duration of treatment ranged from two to 12 weeks. No study measured the proportion of individuals experiencing symptomatic improvement. We report outcomes of interest for three key comparisons below at four to 12 weeks. No study assessed reduction or eradication of colonies of positive cultures of bacteria, quality of life or economic costs. Topical corticosteroids (with or without antibiotics) versus placebo The evidence is very uncertain about the effects of topical corticosteroids on composite symptom scores (corticosteroids with antibiotics: standard mean difference [SMD] 0.87, 95% confidence interval [CI] 0.31 to 1.44; 2 studies, 57 participants; corticosteroids alone: SMD -0.05, 95% CI -0.31 to 0.20; 2 studies, 232 participants; very low-certainty evidence). No study reported tear breakup time. The evidence is very uncertain about the effects of topical corticosteroids on corneal staining scores (corticosteroids with antibiotics: MD 0.70, 95% CI -1.05 to 2.45; 1 study, 27 participants; corticosteroids alone: MD 0.50, 95% CI -1.22 to 2.22; 1 study, 27 participants); both, very low-certainty evidence. The adverse event of irritation of the ocular surface was reported narratively and was similar between the two groups. The adverse event of ocular hypertension was reported narratively and not detected in either group in one study where it was reported. Topical corticosteroids (with or without antibiotics) versus antibiotics The evidence for topical corticosteroids was inconclusive. One study found that topical corticosteroid with antibiotic treatment may reduce symptom scores more than antibiotics alone (MD -11.34, 95% CI -13.13 to -9.55; 1 study, 148 participants), whereas the other found that it may have little to no effect (MD 0.40, 95% CI -0.11 to 0.91; 1 study, 201 participants); both, low-certainty evidence. Topical corticosteroids plus antibiotics probably result in greater reduction in corneal staining scores compared with antibiotics alone (MD -1.26, 95% CI -1.56 to -0.96; 1 study, 148 participants; moderate-certainty evidence). However, this effect was not observed for tear breakup time when antibiotics alone are likely to perform better (MD -1.10, 95% CI -1.39 to -0.81; 1 study, 148 participants; moderate-certainty evidence). The adverse event of irritation of the ocular surface was reported narratively, and was similar between the two groups. The adverse event of ocular hypertension was reported narratively, and was higher in the corticosteroid (with or without antibiotics) group. Topical cyclosporine versus placebo Topical cyclosporine may have little to no effect on the composite symptom score compared with placebo, but the evidence is very uncertain (SMD 0.15, 95% CI -0.27 to 0.57; 2 studies, 90 participants; very low-certainty evidence). The evidence is very uncertain about the effect of topical cyclosporine on tear breakup time compared with placebo (invasive time: MD 4.70, 95% CI -0.24 to 9.64; 1 study, 26 participants, although for non-invasive time, it may provide a potential benefit: MD 1.59, 95% CI 1.48 to 1.70; 1 study, 64 participants; both very low-certainty evidence). Topical cyclosporine may improve corneal staining compared with placebo, but the evidence is very uncertain (MD 2.60, 95% CI 0.68 to 4.52; 1 study, 26 participants; very low-certainty evidence). No study reported adverse events. Topical corticosteroids, with or without antibiotics, including cyclosporine may make little to no difference in reducing signs and symptoms of blepharitis at four to 12 weeks, compared with placebo or antibiotics alone. Topical corticosteroids are generally well tolerated and associated with minimal risk of ocular surface irritation. Topical corticosteroids plus antibiotics probably improve corneal staining compared to antibiotics alone. When managing patients with blepharitis, clinicians should consider the limited quantity and very low certainty of evidence for topical corticosteroids. Conventional lid hygiene and warm compress remain valid therapeutic options. This Cochrane Review was funded (in part) by the National Eye Institute, National Institutes of Health, USA, the National Institute for Health Research, UK, and the Public Health Agency, UK. Protocol available via doi.org/10.1002/14651858.CD013550.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Blepharitis is a common ocular condition characterized by inflammation of the eyelid margins, which can cause irritating symptoms and ocular surface damage. Conventional treatment of blepharitis consists of eyelid hygiene and artificial tears. To suppress inflammation, topical corticosteroids, with or without antibiotics, are frequently prescribed. However, long-term use is limited by side effects such as increased intraocular pressure, glaucoma and/or cataract formation. Newer steroid-sparing topical immunosuppressants have emerged as alternative treatments."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of topical immunosuppressants for blepharitis in adults."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, and three trial registries from inception to 6 April 2025. We searched the reference lists of included studies for any additional studies not identified by the electronic searches. There were no date or language restrictions on the selection of eligible studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) comparing topical immunosuppressants (corticosteroids, cyclosporine, or tacrolimus) of different doses or carrier, with placebo, no treatment, conventional treatment (lid hygiene, artificial tears) or other topical immunosuppressants in adults with blepharitis. We excluded paired-eye studies and highly specific blepharitis subtypes."
        },
        {
          "label": "OUTCOMES",
          "text": "Our outcomes were: (1) change from baseline in composite (or total) symptom score; (2) change from baseline in tear film breakup time; (3) change from baseline in corneal staining scores; (4) proportion of individuals experiencing symptomatic improvement; (5) reduction in number of or eradication of colonies of positive cultures of bacteria; (6) quality of life measures; (7) economic costs of different topical immunosuppressants; and (8) adverse effects."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used Cochrane's risk of bias (RoB) 2 tool for all outcomes reported in the summary of findings tables."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently selected trials, extracted data, and assessed risk of bias. We used fixed-effect meta-analysis to combine data and forest plots to assess heterogeneity, effect size, and direction. We used GRADE to assess the certainty of evidence for each outcome. When meta-analysis was not possible, we used narrative synthesis."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 12 RCTs with 2752 participants (2802 eyes) in total. Six of the trials were conducted in the USA. Topical corticosteroid was the most frequently studied immunosuppressant, followed by cyclosporine and tacrolimus. The point of assessment and duration of treatment ranged from two to 12 weeks. No study measured the proportion of individuals experiencing symptomatic improvement."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We report outcomes of interest for three key comparisons below at four to 12 weeks. No study assessed reduction or eradication of colonies of positive cultures of bacteria, quality of life or economic costs. Topical corticosteroids (with or without antibiotics) versus placebo The evidence is very uncertain about the effects of topical corticosteroids on composite symptom scores (corticosteroids with antibiotics: standard mean difference [SMD] 0.87, 95% confidence interval [CI] 0.31 to 1.44; 2 studies, 57 participants; corticosteroids alone: SMD -0.05, 95% CI -0.31 to 0.20; 2 studies, 232 participants; very low-certainty evidence). No study reported tear breakup time. The evidence is very uncertain about the effects of topical corticosteroids on corneal staining scores (corticosteroids with antibiotics: MD 0.70, 95% CI -1.05 to 2.45; 1 study, 27 participants; corticosteroids alone: MD 0.50, 95% CI -1.22 to 2.22; 1 study, 27 participants); both, very low-certainty evidence. The adverse event of irritation of the ocular surface was reported narratively and was similar between the two groups. The adverse event of ocular hypertension was reported narratively and not detected in either group in one study where it was reported. Topical corticosteroids (with or without antibiotics) versus antibiotics The evidence for topical corticosteroids was inconclusive. One study found that topical corticosteroid with antibiotic treatment may reduce symptom scores more than antibiotics alone (MD -11.34, 95% CI -13.13 to -9.55; 1 study, 148 participants), whereas the other found that it may have little to no effect (MD 0.40, 95% CI -0.11 to 0.91; 1 study, 201 participants); both, low-certainty evidence. Topical corticosteroids plus antibiotics probably result in greater reduction in corneal staining scores compared with antibiotics alone (MD -1.26, 95% CI -1.56 to -0.96; 1 study, 148 participants; moderate-certainty evidence). However, this effect was not observed for tear breakup time when antibiotics alone are likely to perform better (MD -1.10, 95% CI -1.39 to -0.81; 1 study, 148 participants; moderate-certainty evidence). The adverse event of irritation of the ocular surface was reported narratively, and was similar between the two groups. The adverse event of ocular hypertension was reported narratively, and was higher in the corticosteroid (with or without antibiotics) group. Topical cyclosporine versus placebo Topical cyclosporine may have little to no effect on the composite symptom score compared with placebo, but the evidence is very uncertain (SMD 0.15, 95% CI -0.27 to 0.57; 2 studies, 90 participants; very low-certainty evidence). The evidence is very uncertain about the effect of topical cyclosporine on tear breakup time compared with placebo (invasive time: MD 4.70, 95% CI -0.24 to 9.64; 1 study, 26 participants, although for non-invasive time, it may provide a potential benefit: MD 1.59, 95% CI 1.48 to 1.70; 1 study, 64 participants; both very low-certainty evidence). Topical cyclosporine may improve corneal staining compared with placebo, but the evidence is very uncertain (MD 2.60, 95% CI 0.68 to 4.52; 1 study, 26 participants; very low-certainty evidence). No study reported adverse events."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Topical corticosteroids, with or without antibiotics, including cyclosporine may make little to no difference in reducing signs and symptoms of blepharitis at four to 12 weeks, compared with placebo or antibiotics alone. Topical corticosteroids are generally well tolerated and associated with minimal risk of ocular surface irritation. Topical corticosteroids plus antibiotics probably improve corneal staining compared to antibiotics alone. When managing patients with blepharitis, clinicians should consider the limited quantity and very low certainty of evidence for topical corticosteroids. Conventional lid hygiene and warm compress remain valid therapeutic options."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane Review was funded (in part) by the National Eye Institute, National Institutes of Health, USA, the National Institute for Health Research, UK, and the Public Health Agency, UK."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via doi.org/10.1002/14651858.CD013550."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41263273/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1002/14651858.CD013550.pub2",
      "dateReceived": "2025-12-19T23:26:22.029Z",
      "isNew": false
    },
    {
      "id": "258bce3b419f",
      "title": "Ianalumab plus Eltrombopag in Immune Thrombocytopenia.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49371995/118347",
      "abstract": "Current second-line treatments for immune thrombocytopenia (ITP) require long-term administration. Ianalumab, a monoclonal antibody targeting B cells, is being assessed as a short-course second-line therapy in ITP. In this phase 3, randomized, double-blind trial, we assigned, in a 1:1:1 ratio, adults with primary ITP and an insufficient response or a relapse after first-line glucocorticoid therapy to receive ianalumab at a dose of 9 mg or 3 mg per kilogram of body weight or placebo once monthly for 4 months. Eltrombopag, an oral thrombopoietin-receptor agonist, was administered once daily in each group according to local prescribing information; the dose was tapered until discontinuation by the end of week 24 in eligible patients. The primary end point was freedom from treatment failure, as determined in a time-to-event analysis, with treatment failure defined by a platelet count of less than 30×10 per liter more than 8 weeks after randomization, initiation of rescue therapy more than 8 weeks after randomization, initiation of new ITP therapy, inability to taper or discontinue eltrombopag because of an inadequate platelet count, or death from any cause, whichever occurred first. The key secondary end point was a stable response at 6 months, defined by a platelet count of at least 50×10 per liter in at least 75% of the measurements between weeks 19 and 25 without use of rescue therapy or new ITP therapy. Safety was assessed. A total of 152 patients underwent randomization: 50 to the 9-mg ianalumab group, 51 to the 3-mg ianalumab group, and 51 to the placebo group. The estimated probability of being free from treatment failure at 12 months was 54% (95% confidence interval [CI], 39 to 67) in the 9-mg group, 51% (95% CI, 36 to 64) in the 3-mg group, and 30% (95% CI, 18 to 43) in the placebo group. The time to treatment failure was significantly longer with ianalumab plus eltrombopag than with placebo plus eltrombopag; the estimated hazard ratio for treatment failure (ianalumab vs. placebo) was 0.55 (P = 0.04) in the 9-mg group and 0.58 (P = 0.045) in the 3-mg group. The percentage of patients with a stable response at 6 months was significantly higher in the 9-mg group than in the placebo group (62% vs. 39%; P = 0.045). The overall frequency of adverse events during the treatment period was generally similar in the three groups. The frequency of serious adverse events was 16% in the 9-mg group, 6% in the 3-mg group, and 4% in the placebo group. Ianalumab plus eltrombopag led to a longer time to treatment failure than placebo plus eltrombopag. (Funded by Novartis; VAYHIT2 ClinicalTrials.gov number, NCT05653219.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Current second-line treatments for immune thrombocytopenia (ITP) require long-term administration. Ianalumab, a monoclonal antibody targeting B cells, is being assessed as a short-course second-line therapy in ITP."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3, randomized, double-blind trial, we assigned, in a 1:1:1 ratio, adults with primary ITP and an insufficient response or a relapse after first-line glucocorticoid therapy to receive ianalumab at a dose of 9 mg or 3 mg per kilogram of body weight or placebo once monthly for 4 months. Eltrombopag, an oral thrombopoietin-receptor agonist, was administered once daily in each group according to local prescribing information; the dose was tapered until discontinuation by the end of week 24 in eligible patients. The primary end point was freedom from treatment failure, as determined in a time-to-event analysis, with treatment failure defined by a platelet count of less than 30×10 per liter more than 8 weeks after randomization, initiation of rescue therapy more than 8 weeks after randomization, initiation of new ITP therapy, inability to taper or discontinue eltrombopag because of an inadequate platelet count, or death from any cause, whichever occurred first. The key secondary end point was a stable response at 6 months, defined by a platelet count of at least 50×10 per liter in at least 75% of the measurements between weeks 19 and 25 without use of rescue therapy or new ITP therapy. Safety was assessed."
        },
        {
          "label": "RESULTS",
          "text": "A total of 152 patients underwent randomization: 50 to the 9-mg ianalumab group, 51 to the 3-mg ianalumab group, and 51 to the placebo group. The estimated probability of being free from treatment failure at 12 months was 54% (95% confidence interval [CI], 39 to 67) in the 9-mg group, 51% (95% CI, 36 to 64) in the 3-mg group, and 30% (95% CI, 18 to 43) in the placebo group. The time to treatment failure was significantly longer with ianalumab plus eltrombopag than with placebo plus eltrombopag; the estimated hazard ratio for treatment failure (ianalumab vs. placebo) was 0.55 (P = 0.04) in the 9-mg group and 0.58 (P = 0.045) in the 3-mg group. The percentage of patients with a stable response at 6 months was significantly higher in the 9-mg group than in the placebo group (62% vs. 39%; P = 0.045). The overall frequency of adverse events during the treatment period was generally similar in the three groups. The frequency of serious adverse events was 16% in the 9-mg group, 6% in the 3-mg group, and 4% in the placebo group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ianalumab plus eltrombopag led to a longer time to treatment failure than placebo plus eltrombopag. (Funded by Novartis; VAYHIT2 ClinicalTrials.gov number, NCT05653219.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41363800/",
      "pubDate": "2025 Dec 09",
      "doi": "10.1056/NEJMoa2515168",
      "dateReceived": "2025-12-18T23:26:52.191Z",
      "isNew": false
    },
    {
      "id": "aa3f7d272bfc",
      "title": "Tenecteplase vs Alteplase in Mechanical Prosthetic Heart Valve Thrombosis: The TENET Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49371995/118304",
      "abstract": "For patients presenting with symptomatic prosthetic valve thrombosis (PVT) after mechanical heart valve replacement, thrombolytic therapy with alteplase is accepted as a first-line therapeutic alternative. The utility of tenecteplase compared with conventional regimens remains unstudied, to the authors' knowledge, in this patient population. To assess the relative safety and efficacy of tenecteplase compared with standard infusions of alteplase in patients with PVT. This was an open-label, parallel-group, non-inferiority randomized clinical trial among consecutive adult patients presenting with obstructive PVT of a mechanical prosthetic valve over the study period from October 2022 to August 2024 to a single tertiary care center in India. Patients received thrombolytic therapy with a low-dose slow infusion alteplase or weight-based bolus doses of tenecteplase. The primary outcomes were to determine the rates of complete thrombolytic success and the incidence of major complications. A total of 83 patients (mean [SD] age, 39.6 [12.4] years, 42 male [50.6%]) were randomized to receive alteplase (n = 43) or tenecteplase (n = 40). The rates of the primary efficacy end point (complete thrombolytic success) were significantly higher (risk ratio, 1.18; 95% CI, 1.03-1.39; P = .02 for noninferiority) in the tenecteplase group (39 patients [97.5%]) compared with the alteplase group (35 patients [81.5%]). Additionally, patients treated with tenecteplase had higher rates of complete success with the first administered dose and a shorter duration of hospital stay (median [IQR], 4.1 [3.2-5.1] days vs 6.5 [4.3-9.2] days; P < .001). The rates of major and minor adverse events were similar. Tenecteplase may be a safe and effective alternative to alteplase in patients presenting with obstructive PVT. Patients treated with tenecteplase in our study had higher rates of complete thrombolytic success and a shorter duration of hospital stay. Furthermore, the relative ease of drug administration with tenecteplase may translate to greater clinical benefit in a real-world setting. Clinical Trials Registry of India: CTRI/2022/10/046127.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "For patients presenting with symptomatic prosthetic valve thrombosis (PVT) after mechanical heart valve replacement, thrombolytic therapy with alteplase is accepted as a first-line therapeutic alternative. The utility of tenecteplase compared with conventional regimens remains unstudied, to the authors' knowledge, in this patient population."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the relative safety and efficacy of tenecteplase compared with standard infusions of alteplase in patients with PVT."
        },
        {
          "label": "DESIGN, SETTING AND PARTICIPANTS",
          "text": "This was an open-label, parallel-group, non-inferiority randomized clinical trial among consecutive adult patients presenting with obstructive PVT of a mechanical prosthetic valve over the study period from October 2022 to August 2024 to a single tertiary care center in India."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients received thrombolytic therapy with a low-dose slow infusion alteplase or weight-based bolus doses of tenecteplase."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were to determine the rates of complete thrombolytic success and the incidence of major complications."
        },
        {
          "label": "RESULTS",
          "text": "A total of 83 patients (mean [SD] age, 39.6 [12.4] years, 42 male [50.6%]) were randomized to receive alteplase (n = 43) or tenecteplase (n = 40). The rates of the primary efficacy end point (complete thrombolytic success) were significantly higher (risk ratio, 1.18; 95% CI, 1.03-1.39; P = .02 for noninferiority) in the tenecteplase group (39 patients [97.5%]) compared with the alteplase group (35 patients [81.5%]). Additionally, patients treated with tenecteplase had higher rates of complete success with the first administered dose and a shorter duration of hospital stay (median [IQR], 4.1 [3.2-5.1] days vs 6.5 [4.3-9.2] days; P < .001). The rates of major and minor adverse events were similar."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Tenecteplase may be a safe and effective alternative to alteplase in patients presenting with obstructive PVT. Patients treated with tenecteplase in our study had higher rates of complete thrombolytic success and a shorter duration of hospital stay. Furthermore, the relative ease of drug administration with tenecteplase may translate to greater clinical benefit in a real-world setting."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Clinical Trials Registry of India: CTRI/2022/10/046127."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41335456/",
      "pubDate": "2025 Dec 03",
      "doi": "10.1001/jamacardio.2025.4369",
      "dateReceived": "2025-12-18T23:26:52.191Z",
      "isNew": false
    },
    {
      "id": "90b7d05f73f7",
      "title": "Obicetrapib for dyslipidemia with or without cardiovascular risk: A GRADE-assessed meta-analysis of randomized trials with trial sequential evidence.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49371995/118272",
      "abstract": "Obicetrapib, an oral cholesteryl ester transfer protein (CETP) inhibitor, has demonstrated potent LDL-C lowering in recent phase 2/3 trials. We evaluated Obicetrapib (1, 2.5, 5, and 10 mg) efficacy and safety in adults with dyslipidemia, with or without atherosclerotic cardiovascular disease (ASCVD) risk. We performed a meta-analysis of randomized controlled trials (RCTs) identified through PubMed, Cochrane, Scopus, and Web of Science up to June 2025. Dichotomous outcomes were analyzed as risk ratios (RRs) and continuous outcomes as mean differences (MDs), both with 95% confidence intervals (CIs). CRD420251107076. Six RCTs including 3399 patients were analysed. Compared with placebo, Obicetrapib significantly reduced LDL-C at 8-12 weeks (MD -27.66 mg/dL (-26.96%); 95% CI -33.62 to -21.70; p < 0.0001) and non-HDL-C (MD -35.41 mg/dL (-28.08%); 95% CI -39.42 to -31.39; p < 0.0001). It also increased HDL-C (MD 70.85 mg/dL (141.7%); 95% CI 62.56-79.15; p < 0.0001) and improved achievement of LDL-C targets: <55 mg/dL (RR 6.42; 95% CI 5.15-8.01), <70 mg/dL (RR 2.56; p < 0.0001), and < 100 mg/dL (RR 1.34; p < 0.0001). No significant differences were found in total adverse events (p = 0.41) or serious adverse events (p = 0.37). Obicetrapib provides substantial improvements in lipid parameters with a favourable short-term adverse events rate. These results support its role as a potential adjunctive lipid-lowering agent irrespective of ASCVD risk. Longer-term trials are warranted to confirm its durability, cardiovascular outcomes, and safety.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Obicetrapib, an oral cholesteryl ester transfer protein (CETP) inhibitor, has demonstrated potent LDL-C lowering in recent phase 2/3 trials. We evaluated Obicetrapib (1, 2.5, 5, and 10 mg) efficacy and safety in adults with dyslipidemia, with or without atherosclerotic cardiovascular disease (ASCVD) risk."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We performed a meta-analysis of randomized controlled trials (RCTs) identified through PubMed, Cochrane, Scopus, and Web of Science up to June 2025. Dichotomous outcomes were analyzed as risk ratios (RRs) and continuous outcomes as mean differences (MDs), both with 95% confidence intervals (CIs)."
        },
        {
          "label": "PROSPERO ID",
          "text": "CRD420251107076."
        },
        {
          "label": "RESULTS",
          "text": "Six RCTs including 3399 patients were analysed. Compared with placebo, Obicetrapib significantly reduced LDL-C at 8-12 weeks (MD -27.66 mg/dL (-26.96%); 95% CI -33.62 to -21.70; p < 0.0001) and non-HDL-C (MD -35.41 mg/dL (-28.08%); 95% CI -39.42 to -31.39; p < 0.0001). It also increased HDL-C (MD 70.85 mg/dL (141.7%); 95% CI 62.56-79.15; p < 0.0001) and improved achievement of LDL-C targets: <55 mg/dL (RR 6.42; 95% CI 5.15-8.01), <70 mg/dL (RR 2.56; p < 0.0001), and < 100 mg/dL (RR 1.34; p < 0.0001). No significant differences were found in total adverse events (p = 0.41) or serious adverse events (p = 0.37)."
        },
        {
          "label": "CONCLUSION",
          "text": "Obicetrapib provides substantial improvements in lipid parameters with a favourable short-term adverse events rate. These results support its role as a potential adjunctive lipid-lowering agent irrespective of ASCVD risk. Longer-term trials are warranted to confirm its durability, cardiovascular outcomes, and safety."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41287560/",
      "pubDate": "2025 Nov 25",
      "doi": "10.1111/dom.70316",
      "dateReceived": "2025-12-18T23:26:52.191Z",
      "isNew": false
    },
    {
      "id": "3bb408f8ba0a",
      "title": "Cyproterone acetate for hirsutism.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Endocrine",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49261930/118295",
      "abstract": "Hirsutism (excessive and unwanted hair growth) is a distressing and relatively common endocrine problem in women that may prove difficult to manage. Cyproterone acetate (CPA), an antiandrogen, is frequently used to treat hirsutism, usually in combination with ethinylestradiol. This is an update of a Cochrane review first published in 2003. To assess the benefits and harms of cyproterone acetate (CPA) alone, or in combination with ethinylestradiol, and other medication in reducing hair growth and improving the endocrine profile in women with hirsutism secondary to ovarian hyperandrogenism as well as idiopathic hirsutism. We searched the Cochrane Gynaecology and Fertility specialised register, CENTRAL, MEDLINE, Embase, PsycINFO and CINAHL to 20 December 2022. We also searched the reference lists of relevant papers and clinical trial registries. We included randomised controlled trials (RCT) examining women of reproductive age with either idiopathic hirsutism or hirsutism secondary to ovarian hyperandrogenism. Hirsutism was defined as a Ferriman Gallwey (FG) score greater than 7. We included 23 studies. Only one study had more than 100 women included in the analysis. The primary outcomes were the objective and subjective assessment of clinical parameters (FG scores, linear hair growth and hair shaft diameter, women's feedback and frequency of hair removal). Secondary outcomes included endocrine parameters, side effects and withdrawals during therapy. Cyproterone acetate greater than 2 mg plus ethinylestradiol compared to cyproterone acetate 2 mg or less plus ethinylestradiol (dose comparison) After six months of treatment, we are uncertain of any difference in effect on FG scores (mean difference (MD) 0.63, 95% confidence interval (CI) -1.02 to 2.28; I = 0%; 2 RCTs, 145 women; very low-certainty evidence). There was likely little to no difference in free testosterone (MD 0.35 pmol/L, 95% CI -0.61 to 1.31; 1 RCT, 113 women; moderate-certainty evidence). Cyproterone acetate alone (no ethinylestradiol) compared to other interventions alone (no ethinylestradiol) There was little or no difference for CPA compared with gonadotropin-releasing hormone (GnRH) analogues on total testosterone at three months (MD 0.17 nmol/L, 95% CI -0.15 to 0.49). There was little or no evidence of an effect for CPA compared with GnRH agonist on androstenedione at three months (MD 0.66 nmol/L, 95% CI -0.44 to 1.76). Both results from one RCT (20 women; very low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions alone (no ethinylestradiol) There was little to no difference in effect for CPA plus ethinylestradiol on FG scores at six months compared with finasteride (MD 4.70, 95% CI -1.86 to 11.26; 1 RCT, 27 women; low-certainty evidence), spironolactone (MD 0.90, 95% CI -2.86 to 4.66; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD 0.70, 95% CI -0.84 to 2.24; 1 RCT, 81 women; moderate-certainty evidence), or pioglitazone plus flutamide plus metformin (Pio-Flu-Met) (MD 0.90, 95% CI -0.79 to 2.59; 1 RCT, 34 women; low-certainty evidence). CPA plus ethinylestradiol may improve hirsutism slightly compared with flutamide (MD 4.00, 95% CI 0.10 to 7.90; 1 RCT, 28 women). CPA plus ethinylestradiol likely results in little to no difference in total testosterone at six months compared with spironolactone (MD -0.06 nmol/L, 95% CI -1.25 to 1.13; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD -0.02 nmol/L, 95% CI -0.37 to 0.33; 1 RCT, 81 women; moderate-certainty evidence), or Pio-Flu-Met (MD -0.39 nmol/L, 95% CI -0.82 to 0.04; 1 RCT, 81 women; low-certainty evidence). CPA plus ethinylestradiol may be more effective than finasteride at six months (MD -1.60 nmol/L, 95% CI -2.39 to -0.81; 1 RCT, 27 women; low-certainty evidence). CPA plus ethinylestradiol may lower free testosterone slightly at six months compared to finasteride (MD -9.02 nmol/L, 95% CI -12.44 to -5.60; 1 RCT, 27 women; low-certainty evidence) or flutamide (MD -4.16 nmol/L, 95% CI -6.62 to -1.70; 1 RCT, 28 women; low-certainty evidence). There was little to no difference between CPA plus ethinylestradiol and spironolactone (MD 0.35 nmol/L, 95% CI -0.62 to 1.32; 1 RCT, 77 women; low-certainty evidence). CPA plus ethinylestradiol may be less effective than ketoconazole (MD 1.39 nmol/L, 95% CI 0.43 to 2.35; 1 RCT, 81 women; low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions plus ethinylestradiol CPA plus ethinylestradiol likely results in little to no difference in effect on FG scores at six months compared with finasteride plus ethinylestradiol (MD -0.91, 95% CI -1.82 to 0; 1 RCT, 26 women; moderate-certainty evidence) or spironolactone plus drospirenone plus ethinylestradiol (MD 0.69, 95% CI -0.80 to 2.18; 1 RCT, 89 women; high-certainty evidence). However, CPA plus ethinylestradiol may lower FG scores compared to spironolactone plus ethinylestradiol, but the evidence is very uncertain (MD -0.93, 95% CI -1.68 to -0.19; 3 RCTs, 103 women; very low-certainty evidence). There was probably little to no difference in effect for CPA plus ethinylestradiol on total testosterone at six months compared with spironolactone plus ethinylestradiol (MD -0.20 nmol/L, 95% CI -0.64 to 0.24; 1 RCT, 45 women; moderate-certainty evidence), and likely results in little to no difference compared with drospirenone plus ethinylestradiol (MD 0.15 nmol/L, 95% CI 0.08 to 0.22; 1 RCT, 91 women; moderate-certainty evidence). Six months of CPA plus ethinylestradiol treatment likely lowered free testosterone levels compared to drospirenone plus ethinylestradiol (MD -0.31 pmol/L, 95% CI -0.53 to -0.09; 1 RCT, 91 women; moderate-certainty evidence). Data were lacking for all other outcomes in our main review comparisons. There were some differences in clinical outcome between CPA and spironolactone, CPA and flutamide, and CPA and finasteride. There were no clinical differences between CPA and the other medical therapies, possibly because of small study size, lack of standardised assessment and objective determinants of improvement in many studies. There are insufficient data presented to compare the adverse effects of all the treatment options. Larger, carefully designed studies are needed to compare efficacy and safety profiles between the therapeutic options available.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Hirsutism (excessive and unwanted hair growth) is a distressing and relatively common endocrine problem in women that may prove difficult to manage. Cyproterone acetate (CPA), an antiandrogen, is frequently used to treat hirsutism, usually in combination with ethinylestradiol. This is an update of a Cochrane review first published in 2003."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of cyproterone acetate (CPA) alone, or in combination with ethinylestradiol, and other medication in reducing hair growth and improving the endocrine profile in women with hirsutism secondary to ovarian hyperandrogenism as well as idiopathic hirsutism."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Gynaecology and Fertility specialised register, CENTRAL, MEDLINE, Embase, PsycINFO and CINAHL to 20 December 2022. We also searched the reference lists of relevant papers and clinical trial registries."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCT) examining women of reproductive age with either idiopathic hirsutism or hirsutism secondary to ovarian hyperandrogenism. Hirsutism was defined as a Ferriman Gallwey (FG) score greater than 7."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We included 23 studies. Only one study had more than 100 women included in the analysis. The primary outcomes were the objective and subjective assessment of clinical parameters (FG scores, linear hair growth and hair shaft diameter, women's feedback and frequency of hair removal). Secondary outcomes included endocrine parameters, side effects and withdrawals during therapy."
        },
        {
          "label": "MAIN RESULTS",
          "text": "Cyproterone acetate greater than 2 mg plus ethinylestradiol compared to cyproterone acetate 2 mg or less plus ethinylestradiol (dose comparison) After six months of treatment, we are uncertain of any difference in effect on FG scores (mean difference (MD) 0.63, 95% confidence interval (CI) -1.02 to 2.28; I = 0%; 2 RCTs, 145 women; very low-certainty evidence). There was likely little to no difference in free testosterone (MD 0.35 pmol/L, 95% CI -0.61 to 1.31; 1 RCT, 113 women; moderate-certainty evidence). Cyproterone acetate alone (no ethinylestradiol) compared to other interventions alone (no ethinylestradiol) There was little or no difference for CPA compared with gonadotropin-releasing hormone (GnRH) analogues on total testosterone at three months (MD 0.17 nmol/L, 95% CI -0.15 to 0.49). There was little or no evidence of an effect for CPA compared with GnRH agonist on androstenedione at three months (MD 0.66 nmol/L, 95% CI -0.44 to 1.76). Both results from one RCT (20 women; very low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions alone (no ethinylestradiol) There was little to no difference in effect for CPA plus ethinylestradiol on FG scores at six months compared with finasteride (MD 4.70, 95% CI -1.86 to 11.26; 1 RCT, 27 women; low-certainty evidence), spironolactone (MD 0.90, 95% CI -2.86 to 4.66; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD 0.70, 95% CI -0.84 to 2.24; 1 RCT, 81 women; moderate-certainty evidence), or pioglitazone plus flutamide plus metformin (Pio-Flu-Met) (MD 0.90, 95% CI -0.79 to 2.59; 1 RCT, 34 women; low-certainty evidence). CPA plus ethinylestradiol may improve hirsutism slightly compared with flutamide (MD 4.00, 95% CI 0.10 to 7.90; 1 RCT, 28 women). CPA plus ethinylestradiol likely results in little to no difference in total testosterone at six months compared with spironolactone (MD -0.06 nmol/L, 95% CI -1.25 to 1.13; 1 RCT, 77 women; moderate-certainty evidence), ketoconazole (MD -0.02 nmol/L, 95% CI -0.37 to 0.33; 1 RCT, 81 women; moderate-certainty evidence), or Pio-Flu-Met (MD -0.39 nmol/L, 95% CI -0.82 to 0.04; 1 RCT, 81 women; low-certainty evidence). CPA plus ethinylestradiol may be more effective than finasteride at six months (MD -1.60 nmol/L, 95% CI -2.39 to -0.81; 1 RCT, 27 women; low-certainty evidence). CPA plus ethinylestradiol may lower free testosterone slightly at six months compared to finasteride (MD -9.02 nmol/L, 95% CI -12.44 to -5.60; 1 RCT, 27 women; low-certainty evidence) or flutamide (MD -4.16 nmol/L, 95% CI -6.62 to -1.70; 1 RCT, 28 women; low-certainty evidence). There was little to no difference between CPA plus ethinylestradiol and spironolactone (MD 0.35 nmol/L, 95% CI -0.62 to 1.32; 1 RCT, 77 women; low-certainty evidence). CPA plus ethinylestradiol may be less effective than ketoconazole (MD 1.39 nmol/L, 95% CI 0.43 to 2.35; 1 RCT, 81 women; low-certainty evidence). Cyproterone acetate plus ethinylestradiol compared to other interventions plus ethinylestradiol CPA plus ethinylestradiol likely results in little to no difference in effect on FG scores at six months compared with finasteride plus ethinylestradiol (MD -0.91, 95% CI -1.82 to 0; 1 RCT, 26 women; moderate-certainty evidence) or spironolactone plus drospirenone plus ethinylestradiol (MD 0.69, 95% CI -0.80 to 2.18; 1 RCT, 89 women; high-certainty evidence). However, CPA plus ethinylestradiol may lower FG scores compared to spironolactone plus ethinylestradiol, but the evidence is very uncertain (MD -0.93, 95% CI -1.68 to -0.19; 3 RCTs, 103 women; very low-certainty evidence). There was probably little to no difference in effect for CPA plus ethinylestradiol on total testosterone at six months compared with spironolactone plus ethinylestradiol (MD -0.20 nmol/L, 95% CI -0.64 to 0.24; 1 RCT, 45 women; moderate-certainty evidence), and likely results in little to no difference compared with drospirenone plus ethinylestradiol (MD 0.15 nmol/L, 95% CI 0.08 to 0.22; 1 RCT, 91 women; moderate-certainty evidence). Six months of CPA plus ethinylestradiol treatment likely lowered free testosterone levels compared to drospirenone plus ethinylestradiol (MD -0.31 pmol/L, 95% CI -0.53 to -0.09; 1 RCT, 91 women; moderate-certainty evidence). Data were lacking for all other outcomes in our main review comparisons."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There were some differences in clinical outcome between CPA and spironolactone, CPA and flutamide, and CPA and finasteride. There were no clinical differences between CPA and the other medical therapies, possibly because of small study size, lack of standardised assessment and objective determinants of improvement in many studies. There are insufficient data presented to compare the adverse effects of all the treatment options. Larger, carefully designed studies are needed to compare efficacy and safety profiles between the therapeutic options available."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41288141/",
      "pubDate": "2025 Nov 25",
      "doi": "10.1002/14651858.CD001125.pub2",
      "dateReceived": "2025-12-17T23:27:02.891Z",
      "isNew": false
    },
    {
      "id": "a3c3602b9b1e",
      "title": "Comparison of 162 mg and 81 mg Aspirin for Prevention of Preeclampsia: A Randomized Controlled Trial.",
      "journal": "Obstet Gynecol",
      "score": "7/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49261930/118255",
      "abstract": "To compare the efficacy of 162 mg vs 81 mg aspirin daily for the prevention of preterm preeclampsia (less than 37 weeks of gestation) or preeclampsia with severe features among pregnant people at high risk. We conducted a pragmatic, randomized, open-label, blinded endpoint clinical trial. Pregnant people at high risk for preeclampsia were randomized to treatment with either 162 mg or 81 mg aspirin daily beginning before 16 weeks of gestation until term and followed up until 6 weeks postpartum. The primary composite outcome of either preterm preeclampsia or preeclampsia with severe features was adjudicated by independent researchers blinded to treatment group. Secondary outcomes were the components of the composite, adherence to therapy, and maternal and neonatal complications. The anticipated incidence of the primary composite outcome in the 81-mg group was 8.6%. We calculated that enrollment of 394 participants (197 for each group) would have 80% power to detect a 7.1% reduction in the primary outcome with 162 mg aspirin compared with 81 mg, assuming a two-sided α of 0.05. Of 400 participants randomized, 365 had delivery data available and were included in the intention-to-treat analysis, with 184 participants in the 162-mg group and 181 in the 81-mg group. The incidence of preterm preeclampsia or preeclampsia with severe features was 26 of 184 (14.1%) in the 162-mg group compared with 31 of 181 (17.1%) in the 81-mg group (relative risk 0.83, 95% CI, 0.51-1.33, P=.4). Individual outcomes of preterm preeclampsia and term preeclampsia with severe features were similar between aspirin groups. Adherence rates ranged from 88% to 91% and 89% to 92% for the 162-mg group compared with the 81-mg group, respectively, across study visits. Singleton birth weight was slightly lower in the 162-mg group (2.9 kg vs 3.2 kg, P=.005). There were eight cases of placental abruption in participants randomized to 162 mg compared with 0 in those randomized to 81 mg (P=.013). Among people at increased risk for preeclampsia, the rates of preterm preeclampsia or preeclampsia with severe features were similar to rates in those randomized to treatment with either 81 mg or 162 mg aspirin at less than 16 weeks of gestation. ClinicalTrials.gov, NCT04070573.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To compare the efficacy of 162 mg vs 81 mg aspirin daily for the prevention of preterm preeclampsia (less than 37 weeks of gestation) or preeclampsia with severe features among pregnant people at high risk."
        },
        {
          "label": "METHODS",
          "text": "We conducted a pragmatic, randomized, open-label, blinded endpoint clinical trial. Pregnant people at high risk for preeclampsia were randomized to treatment with either 162 mg or 81 mg aspirin daily beginning before 16 weeks of gestation until term and followed up until 6 weeks postpartum. The primary composite outcome of either preterm preeclampsia or preeclampsia with severe features was adjudicated by independent researchers blinded to treatment group. Secondary outcomes were the components of the composite, adherence to therapy, and maternal and neonatal complications. The anticipated incidence of the primary composite outcome in the 81-mg group was 8.6%. We calculated that enrollment of 394 participants (197 for each group) would have 80% power to detect a 7.1% reduction in the primary outcome with 162 mg aspirin compared with 81 mg, assuming a two-sided α of 0.05."
        },
        {
          "label": "RESULTS",
          "text": "Of 400 participants randomized, 365 had delivery data available and were included in the intention-to-treat analysis, with 184 participants in the 162-mg group and 181 in the 81-mg group. The incidence of preterm preeclampsia or preeclampsia with severe features was 26 of 184 (14.1%) in the 162-mg group compared with 31 of 181 (17.1%) in the 81-mg group (relative risk 0.83, 95% CI, 0.51-1.33, P=.4). Individual outcomes of preterm preeclampsia and term preeclampsia with severe features were similar between aspirin groups. Adherence rates ranged from 88% to 91% and 89% to 92% for the 162-mg group compared with the 81-mg group, respectively, across study visits. Singleton birth weight was slightly lower in the 162-mg group (2.9 kg vs 3.2 kg, P=.005). There were eight cases of placental abruption in participants randomized to 162 mg compared with 0 in those randomized to 81 mg (P=.013)."
        },
        {
          "label": "CONCLUSION",
          "text": "Among people at increased risk for preeclampsia, the rates of preterm preeclampsia or preeclampsia with severe features were similar to rates in those randomized to treatment with either 81 mg or 162 mg aspirin at less than 16 weeks of gestation."
        },
        {
          "label": "CLINICAL TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov, NCT04070573."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41296512/",
      "pubDate": "2025 Oct 24",
      "doi": "10.1097/AOG.0000000000006100",
      "dateReceived": "2025-12-17T23:27:02.891Z",
      "isNew": false
    },
    {
      "id": "880c3a104390",
      "title": "Three-Year Follow-Up of the NOTION-2 Trial: TAVR Versus SAVR to Treat Younger Low-Risk Patients With Tricuspid or Bicuspid Aortic Stenosis.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49247839/118266",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40920842/",
      "pubDate": "2025 Sep 09",
      "doi": "10.1161/CIRCULATIONAHA.125.075818",
      "dateReceived": "2025-12-17T23:27:02.891Z",
      "isNew": false
    },
    {
      "id": "0bbca486d594",
      "title": "Efficacy and safety of bi-weekly cofrogliptin treatment replacing daily dipeptidyl peptidase-4 inhibitors in Chinese patients with type 2 diabetes mellitus: A multicenter, open-label, randomized controlled phase 2 trial.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49247839/118249",
      "abstract": "This study aimed to investigate the efficacy and safety of bi-weekly cofrogliptin treatment as a replacement for daily dipeptidyl peptidase-4 inhibitors (DPP-4is) in Chinese patients with type 2 diabetes mellitus (T2DM). This multicenter, open-label, randomized controlled study assigned participants in a 1:1 ratio to either the daily DPP-4i group or the 10 mg cofrogliptin group. The DPP-4i group continued their original daily DPP-4i regimen for 24 weeks, whereas the cofrogliptin group discontinued the daily DPP-4i and received the investigational drug orally once every 2 weeks. All participants underwent 14-day continuous glucose monitoring at weeks 10-12 and 22-24 during the treatment period. The main endpoint was the change in glucose time in range (TIR; 3.9-10.0 mmol/L) from baseline to week 24. Additionally, the Diabetes Treatment Satisfaction Questionnaire scores, adverse events, and hypoglycaemic events were compared between groups. The enrolment period was from 31 January 2024 to 20 November 2024. A total of 64 participants were randomized to receive either cofrogliptin (n = 31) or a daily DPP-4i (n = 33). The least squares (LS) mean (standard error) change in TIR from baseline after 24 weeks was 0.037% ± 2.506% in the cofrogliptin group compared to -9.891% ± 2.435% in the daily DPP-4i group. The LS mean difference was 9.929% (95% confidence interval: 3.064%-16.793%), which was statistically significant (p = 0.0046). The incidence, classification, and severity of adverse events were similar between the two groups. Bi-weekly cofrogliptin treatment, instead of daily DPP-4i, could effectively control blood glucose levels in a 24-week treatment period and their fluctuations and was well tolerated in Chinese patients with T2DM.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "This study aimed to investigate the efficacy and safety of bi-weekly cofrogliptin treatment as a replacement for daily dipeptidyl peptidase-4 inhibitors (DPP-4is) in Chinese patients with type 2 diabetes mellitus (T2DM)."
        },
        {
          "label": "METHODS",
          "text": "This multicenter, open-label, randomized controlled study assigned participants in a 1:1 ratio to either the daily DPP-4i group or the 10 mg cofrogliptin group. The DPP-4i group continued their original daily DPP-4i regimen for 24 weeks, whereas the cofrogliptin group discontinued the daily DPP-4i and received the investigational drug orally once every 2 weeks. All participants underwent 14-day continuous glucose monitoring at weeks 10-12 and 22-24 during the treatment period. The main endpoint was the change in glucose time in range (TIR; 3.9-10.0 mmol/L) from baseline to week 24. Additionally, the Diabetes Treatment Satisfaction Questionnaire scores, adverse events, and hypoglycaemic events were compared between groups."
        },
        {
          "label": "RESULTS",
          "text": "The enrolment period was from 31 January 2024 to 20 November 2024. A total of 64 participants were randomized to receive either cofrogliptin (n = 31) or a daily DPP-4i (n = 33). The least squares (LS) mean (standard error) change in TIR from baseline after 24 weeks was 0.037% ± 2.506% in the cofrogliptin group compared to -9.891% ± 2.435% in the daily DPP-4i group. The LS mean difference was 9.929% (95% confidence interval: 3.064%-16.793%), which was statistically significant (p = 0.0046). The incidence, classification, and severity of adverse events were similar between the two groups."
        },
        {
          "label": "CONCLUSION",
          "text": "Bi-weekly cofrogliptin treatment, instead of daily DPP-4i, could effectively control blood glucose levels in a 24-week treatment period and their fluctuations and was well tolerated in Chinese patients with T2DM."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41267147/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1111/dom.70305",
      "dateReceived": "2025-12-17T23:27:02.891Z",
      "isNew": false
    },
    {
      "id": "39bdfd92d5ff",
      "title": "AGA Living Clinical Practice Guideline on the Pharmacologic Management of Moderate-to-Severe Crohn's Disease.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49247839/118233",
      "abstract": "This American Gastroenterological Association (AGA) living guideline is intended to support practitioners in the pharmacologic management of moderate-to-severely active Crohn's disease (CD). A multidisciplinary panel of clinical experts and methodologists used the Grading of Recommendations Assessment, Development and Evaluation (GRADE) framework to prioritize clinical questions, identify patient-centered outcomes, conduct an evidence synthesis, and develop recommendations. The guideline panel agreed on 16 recommendations, of which 1 is a strong recommendation, 9 are conditional recommendations, and 6 were identified as knowledge gaps. In adult patients with moderate-to-severely active CD, the AGA recommends the use of infliximab, adalimumab, ustekinumab, risankizumab, mirikizumab, guselkumab, or upadacitinib over no treatment, and suggests the use of certolizumab pegol or vedolizumab over no treatment. In individuals who are naïve to advanced therapies, the AGA suggests using a higher efficacy medication (infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, or guselkumab) rather than a lower-efficacy medication (certolizumab pegol or upadacitinib). In individuals who have previously been exposed to 1 or more advanced therapies, the AGA suggests using a higher efficacy medication (adalimumab, risankizumab, guselkumab, or upadacitinib) or intermediate efficacy medication (ustekinumab or mirikizumab) rather than a lower efficacy medication (vedolizumab or certolizumab pegol). In adult outpatients with moderate-to-severely active CD, the AGA suggests against using thiopurine monotherapy for induction of remission, but suggests using thiopurine monotherapy over no treatment for maintenance of (typically corticosteroid-induced) remission. The AGA suggests using subcutaneous methotrexate for induction and maintenance of remission, but suggests against using oral methotrexate. The AGA suggests using combination therapy with infliximab and thiopurines over infliximab monotherapy, particularly in those naïve to thiopurines. The AGA also suggests using initial advanced therapy over step therapy involving corticosteroids and/or immunomodulators in patients with moderate-to-severely active CD. The panel also proposed key implementation considerations for optimal use of these medications, identified several knowledge gaps, and areas for future research. This guideline provides a comprehensive, patient-centered, evidence-based approach to the pharmacologic management of patients with moderate-to-severely active CD.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "This American Gastroenterological Association (AGA) living guideline is intended to support practitioners in the pharmacologic management of moderate-to-severely active Crohn's disease (CD)."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary panel of clinical experts and methodologists used the Grading of Recommendations Assessment, Development and Evaluation (GRADE) framework to prioritize clinical questions, identify patient-centered outcomes, conduct an evidence synthesis, and develop recommendations."
        },
        {
          "label": "RESULTS",
          "text": "The guideline panel agreed on 16 recommendations, of which 1 is a strong recommendation, 9 are conditional recommendations, and 6 were identified as knowledge gaps. In adult patients with moderate-to-severely active CD, the AGA recommends the use of infliximab, adalimumab, ustekinumab, risankizumab, mirikizumab, guselkumab, or upadacitinib over no treatment, and suggests the use of certolizumab pegol or vedolizumab over no treatment. In individuals who are naïve to advanced therapies, the AGA suggests using a higher efficacy medication (infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, or guselkumab) rather than a lower-efficacy medication (certolizumab pegol or upadacitinib). In individuals who have previously been exposed to 1 or more advanced therapies, the AGA suggests using a higher efficacy medication (adalimumab, risankizumab, guselkumab, or upadacitinib) or intermediate efficacy medication (ustekinumab or mirikizumab) rather than a lower efficacy medication (vedolizumab or certolizumab pegol). In adult outpatients with moderate-to-severely active CD, the AGA suggests against using thiopurine monotherapy for induction of remission, but suggests using thiopurine monotherapy over no treatment for maintenance of (typically corticosteroid-induced) remission. The AGA suggests using subcutaneous methotrexate for induction and maintenance of remission, but suggests against using oral methotrexate. The AGA suggests using combination therapy with infliximab and thiopurines over infliximab monotherapy, particularly in those naïve to thiopurines. The AGA also suggests using initial advanced therapy over step therapy involving corticosteroids and/or immunomodulators in patients with moderate-to-severely active CD. The panel also proposed key implementation considerations for optimal use of these medications, identified several knowledge gaps, and areas for future research."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This guideline provides a comprehensive, patient-centered, evidence-based approach to the pharmacologic management of patients with moderate-to-severely active CD."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41274746/",
      "pubDate": "2025 Dec",
      "doi": "10.1053/j.gastro.2025.09.038",
      "dateReceived": "2025-12-17T23:27:02.891Z",
      "isNew": false
    },
    {
      "id": "62438cb2c9a3",
      "title": "Glycaemic control and pregnancy outcomes with real-time continuous glucose monitoring in gestational diabetes (GRACE): an open-label, multicentre, multinational, randomised controlled trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49359512/118331",
      "dateReceived": "2025-12-17T23:27:02.890Z",
      "isNew": false
    },
    {
      "id": "d4bb48031b71",
      "title": "A randomized controlled trial investigating feasibility, acceptability and effects of dry needling for provoked vestibulodynia.",
      "journal": "J Pain",
      "score": "5/7",
      "tags": [
        "Gynecology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49359512/118309",
      "abstract": "This study aimed to investigate the feasibility, acceptability, and effects of dry needling in women with provoked vestibulodynia. Forty-six women diagnosed with provoked vestibulodynia were randomized to receive six weekly sessions of either real or sham dry needling (DN). Participants, investigators and data analysts were blinded. Feasibility outcomes (adherence to treatment, questionnaire completion and dropout rate) and side effects were measured throughout the study. Pain intensity during intercourse (0-10 numeric rating scale) was measured at baseline and posttreatment, and acceptability (questionnaire) was assessed at posttreatment. Women in the realDN group attended 99% of the planned treatment sessions, compared to 91% in the shamDN group. Additionally, 100% of the questionnaires were completed in the realDN group, compared to 93% in the shamDN group. All participants in the realDN group completed the study. In contrast, two participants in the shamDN group withdrew. For the main side effects, 96% of the participants in the realDN group and 52% in the shamDN group experienced muscle aches (p<.001). Moreover, 35% experienced autonomic reactions in the realDN group, while these were not observed in the shamDN group (p<.001). All participants reported high levels of acceptability across all dimensions, with no significant difference between groups. The realDN group showed a significant decrease in pain intensity compared to the shamDN group (mean difference between groups 2.4; 95%CI 1.4-3.3; p<.001). Our findings support the feasibility and acceptability of dry needling to treat women with provoked vestibulodynia and showed a significant effect in reducing pain. PERSPECTIVE: This article presents the results of a novel study examining the feasibility and acceptability of using dry needling to treat women suffering from provoked vestibulodynia and lays the groundwork to inform a future randomized controlled trial.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41207407/",
      "pubDate": "2025 Nov 07",
      "doi": "10.1016/j.jpain.2025.105596",
      "dateReceived": "2025-12-17T23:27:02.890Z",
      "isNew": false
    }
  ]
}