{
  "updated_at": "2025-11-07T23:24:19.000Z",
  "articles": [
    {
      "id": "d0773fdb2b5e",
      "title": "Effectiveness of Exercise in Older Adults Discharged From the ER After Minor Injuries: The CEDeComS Stepped-Wedge Trial.",
      "journal": "J Am Geriatr Soc",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48734199/117995",
      "abstract": "Older adults consulting Emergency Departments (EDs) for minor injuries are at risk for new functional impairments in the 6 months following their injuries. To compare the effects of exercise programs versus usual ED practices on functional status and physical performance at 3-6 months in at-risk older adults with minor injuries. Stepped-wedge randomized trial in six Canadian EDs from 2017 to 2020. Participants aged ≥ 65 years were screened for low, moderate, or high risk of functional decline and assessed three times: baseline at ED, 3 and 6 months. Multicomponent (flexibility, balance, strengthening, aerobic) and risk-level adapted exercise programs targeting moderate- and high-risk patients, 3×/week for 12 weeks, at home or in community groups. Usual ED care. Functional decline was defined as a 2/28-point loss from baseline on the Older Americans Resources and Services (OARS) scale. Basic physical performance (leg strength, balance, walking speed) was measured using the Short Physical Performance Battery (SPPB) test. Generalized linear mixed log-binomial regressions were used to examine the effects of the intervention on outcomes compared to usual ED care, stratified by risk level. The intervention and control phases included 277 and 205 moderate-risk individuals, and 249 and 128 high-risk individuals, respectively. Among moderate-risk individuals, functional loss in intervention participants at 3 months was half that of controls: 12% [95% CI: 8%-17%] vs. 25% [95% CI: 18%-34%], RR: 0.48 [0.26, 0.90]. 12-week multicomponent exercises implemented early after minor injuries are associated with lower proportions of functional decline at 3 months in moderate-risk seniors and may help those at high risk recover some physical performance. ClinicalTrials.gov, ID Cedecoms NCT03991598.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Older adults consulting Emergency Departments (EDs) for minor injuries are at risk for new functional impairments in the 6 months following their injuries."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the effects of exercise programs versus usual ED practices on functional status and physical performance at 3-6 months in at-risk older adults with minor injuries."
        },
        {
          "label": "DESIGN AND SETTINGS",
          "text": "Stepped-wedge randomized trial in six Canadian EDs from 2017 to 2020. Participants aged ≥ 65 years were screened for low, moderate, or high risk of functional decline and assessed three times: baseline at ED, 3 and 6 months."
        },
        {
          "label": "INTERVENTION AND MEASURES",
          "text": "Multicomponent (flexibility, balance, strengthening, aerobic) and risk-level adapted exercise programs targeting moderate- and high-risk patients, 3×/week for 12 weeks, at home or in community groups."
        },
        {
          "label": "CONTROL",
          "text": "Usual ED care."
        },
        {
          "label": "MEASURES",
          "text": "Functional decline was defined as a 2/28-point loss from baseline on the Older Americans Resources and Services (OARS) scale. Basic physical performance (leg strength, balance, walking speed) was measured using the Short Physical Performance Battery (SPPB) test. Generalized linear mixed log-binomial regressions were used to examine the effects of the intervention on outcomes compared to usual ED care, stratified by risk level."
        },
        {
          "label": "RESULTS",
          "text": "The intervention and control phases included 277 and 205 moderate-risk individuals, and 249 and 128 high-risk individuals, respectively. Among moderate-risk individuals, functional loss in intervention participants at 3 months was half that of controls: 12% [95% CI: 8%-17%] vs. 25% [95% CI: 18%-34%], RR: 0.48 [0.26, 0.90]."
        },
        {
          "label": "CONCLUSION",
          "text": "12-week multicomponent exercises implemented early after minor injuries are associated with lower proportions of functional decline at 3 months in moderate-risk seniors and may help those at high risk recover some physical performance."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov, ID Cedecoms NCT03991598."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41116303/",
      "pubDate": "2025 Oct 20",
      "doi": "10.1111/jgs.70166",
      "dateReceived": "2025-11-07T23:23:17.138Z",
      "isNew": true,
      "summary": "Early multicomponent exercise after minor injuries in moderate-risk seniors reduces functional decline at 3 months, and may improve physical performance in high-risk seniors."
    },
    {
      "id": "0b974bcdcf37",
      "title": "Comparative Efficacy of Advanced Therapies for Management of Moderate-to-Severe Crohn`s Disease: 2025 AGA Evidence Synthesis.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/118015",
      "abstract": "We performed an updated systematic review and network meta-analysis to inform the 2025 American Gastroenterological Association Clinical Guidelines on the management of moderate-to-severe Crohn's disease (CD). We searched multiple electronic databases from inception through August 14, 2024, to identify randomized controlled trials in adults with moderate-to-severe CD, comparing advanced therapies (eg, tumor necrosis factor antagonists, vedolizumab, interleukin 12/23, or interleukin 23p19 antagonists, and/or Janus kinase inhibitors) with placebo or another active comparator. Our primary outcomes were induction and maintenance of clinical remission; analyses were stratified by biologic therapy exposure status. We performed a network meta-analysis using a frequentist approach and applied the Grading of Recommendations, Assessment, Development and Evaluation to appraise certainty of evidence. We identified 28 trials of induction therapy and 22 trials of maintenance therapy of advanced therapies in patients with moderate-to-severe CD. In biologic-naïve patients, moderate-to-high certainty evidence supported the use of infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, and guselkumab, and low certainty evidence supported the use of certolizumab pegol and upadacitinib over no treatment for inducing remission. Among active comparators, moderate-to-high certainty evidence supported the use of adalimumab and ustekinumab compared with certolizumab pegol and upadacitinib. Among patients with prior exposure to biologics, moderate-to-high certainty evidence supported the use of adalimumab, ustekinumab, risankizumab, guselkumab, and upadacitinib, and low certainty evidence supported the use of vedolizumab and mirikizumab, over no treatment, for inducing remission. Among active comparators, moderate certainty evidence supported the use of risankizumab and guselkumab compared with vedolizumab and ustekinumab. Using Grading of Recommendations, Assessment, Development and Evaluation to appraise quality of evidence, this updated network meta-analysis can inform positioning of advanced therapies for the treatment of biologic-naïve and biologic-exposed patients with moderate-to-severe CD.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "We performed an updated systematic review and network meta-analysis to inform the 2025 American Gastroenterological Association Clinical Guidelines on the management of moderate-to-severe Crohn's disease (CD)."
        },
        {
          "label": "METHODS",
          "text": "We searched multiple electronic databases from inception through August 14, 2024, to identify randomized controlled trials in adults with moderate-to-severe CD, comparing advanced therapies (eg, tumor necrosis factor antagonists, vedolizumab, interleukin 12/23, or interleukin 23p19 antagonists, and/or Janus kinase inhibitors) with placebo or another active comparator. Our primary outcomes were induction and maintenance of clinical remission; analyses were stratified by biologic therapy exposure status. We performed a network meta-analysis using a frequentist approach and applied the Grading of Recommendations, Assessment, Development and Evaluation to appraise certainty of evidence."
        },
        {
          "label": "RESULTS",
          "text": "We identified 28 trials of induction therapy and 22 trials of maintenance therapy of advanced therapies in patients with moderate-to-severe CD. In biologic-naïve patients, moderate-to-high certainty evidence supported the use of infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, and guselkumab, and low certainty evidence supported the use of certolizumab pegol and upadacitinib over no treatment for inducing remission. Among active comparators, moderate-to-high certainty evidence supported the use of adalimumab and ustekinumab compared with certolizumab pegol and upadacitinib. Among patients with prior exposure to biologics, moderate-to-high certainty evidence supported the use of adalimumab, ustekinumab, risankizumab, guselkumab, and upadacitinib, and low certainty evidence supported the use of vedolizumab and mirikizumab, over no treatment, for inducing remission. Among active comparators, moderate certainty evidence supported the use of risankizumab and guselkumab compared with vedolizumab and ustekinumab."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Using Grading of Recommendations, Assessment, Development and Evaluation to appraise quality of evidence, this updated network meta-analysis can inform positioning of advanced therapies for the treatment of biologic-naïve and biologic-exposed patients with moderate-to-severe CD."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41114682/",
      "pubDate": "2025 Oct 20",
      "doi": "10.1053/j.gastro.2025.08.032",
      "dateReceived": "2025-11-06T23:24:40.067Z",
      "isNew": true
    },
    {
      "id": "1b7cde5dd7c9",
      "title": "Eltrombopag for Newly Diagnosed Pediatric Immune Thrombocytopenia Requiring Treatment: The PINES Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/117950",
      "abstract": "Eltrombopag, a thrombopoietin receptor agonist, is approved by the US Food and Drug Administration for children with chronic immune thrombocytopenia. Efficacy of eltrombopag during the newly diagnosed phase of pediatric immune thrombocytopenia is unknown. To determine if the proportion of patients with a platelet response is significantly greater in patients with newly diagnosed immune thrombocytopenia treated with eltrombopag than in those treated with standard therapy (first-line treatments). This phase 3, randomized clinical trial enrolled patients (aged 1-<18 years) with newly diagnosed primary immune thrombocytopenia (platelet count <30 × 109/L who required pharmacological treatment but did not have severe bleeding or need a rapid increase in platelet count) from May 7, 2019, to January 25, 2024, at 23 centers participating in the Pediatric ITP Consortium of North America. Final follow-up occurred on February 26, 2025. Eltrombopag was administered orally based on a standard dosing schedule (n = 78) vs standard therapy (investigator choice of glucocorticoids, intravenous immunoglobulin, or anti-D immunoglobulin) (n = 40). The primary outcome was a sustained platelet response defined as 3 or more of 4 platelet counts greater than 50 × 109/L during weeks 6 to 12 without rescue treatment. The secondary outcomes included bleeding scores, change in health-related quality of life, and serious adverse events. Of 118 pediatric patients (median age, 8 years [IQR, 4-12 years]; 49% were male), 63% experienced an initial treatment failure after observation or medical therapy. Enrollment ended after a planned interim analysis met a prespecified threshold for efficacy. Of 71 patients in the eltrombopag group, 46 (65% [95% CI, 54%-76%]) had a sustained platelet response compared with 13 of 37 patients (35% [95% CI, 20%-51%]) in the standard therapy group (between-group difference, 30% [95% CI, 11%-49%]; P = .002), which crossed the monitoring boundary for efficacy. Overall, there was no between-group difference in the number and type of adverse events. In pediatric patients with newly diagnosed immune thrombocytopenia requiring pharmacological treatment, eltrombopag resulted in a higher rate of sustained platelet response compared with standard therapy. Eltrombopag may be an effective option for pediatric patients with newly diagnosed immune thrombocytopenia with nonsevere bleeding who warrant medical intervention. ClinicalTrials.gov Identifier: NCT03939637.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Eltrombopag, a thrombopoietin receptor agonist, is approved by the US Food and Drug Administration for children with chronic immune thrombocytopenia. Efficacy of eltrombopag during the newly diagnosed phase of pediatric immune thrombocytopenia is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine if the proportion of patients with a platelet response is significantly greater in patients with newly diagnosed immune thrombocytopenia treated with eltrombopag than in those treated with standard therapy (first-line treatments)."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This phase 3, randomized clinical trial enrolled patients (aged 1-<18 years) with newly diagnosed primary immune thrombocytopenia (platelet count <30 × 109/L who required pharmacological treatment but did not have severe bleeding or need a rapid increase in platelet count) from May 7, 2019, to January 25, 2024, at 23 centers participating in the Pediatric ITP Consortium of North America. Final follow-up occurred on February 26, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Eltrombopag was administered orally based on a standard dosing schedule (n = 78) vs standard therapy (investigator choice of glucocorticoids, intravenous immunoglobulin, or anti-D immunoglobulin) (n = 40)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a sustained platelet response defined as 3 or more of 4 platelet counts greater than 50 × 109/L during weeks 6 to 12 without rescue treatment. The secondary outcomes included bleeding scores, change in health-related quality of life, and serious adverse events."
        },
        {
          "label": "RESULTS",
          "text": "Of 118 pediatric patients (median age, 8 years [IQR, 4-12 years]; 49% were male), 63% experienced an initial treatment failure after observation or medical therapy. Enrollment ended after a planned interim analysis met a prespecified threshold for efficacy. Of 71 patients in the eltrombopag group, 46 (65% [95% CI, 54%-76%]) had a sustained platelet response compared with 13 of 37 patients (35% [95% CI, 20%-51%]) in the standard therapy group (between-group difference, 30% [95% CI, 11%-49%]; P = .002), which crossed the monitoring boundary for efficacy. Overall, there was no between-group difference in the number and type of adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In pediatric patients with newly diagnosed immune thrombocytopenia requiring pharmacological treatment, eltrombopag resulted in a higher rate of sustained platelet response compared with standard therapy. Eltrombopag may be an effective option for pediatric patients with newly diagnosed immune thrombocytopenia with nonsevere bleeding who warrant medical intervention."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03939637."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123939/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1001/jama.2025.18168",
      "dateReceived": "2025-11-06T23:24:40.067Z",
      "isNew": true
    },
    {
      "id": "8ff2fd4cb947",
      "title": "ERS/EULAR clinical practice guidelines for connective tissue diseases associated interstitial lung disease.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/117943",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41077478/",
      "pubDate": "2025 Oct 11",
      "doi": "10.1016/j.ard.2025.09.006",
      "dateReceived": "2025-11-06T23:24:40.067Z",
      "isNew": true
    },
    {
      "id": "a009e18069a6",
      "title": "Anti-CD38 monoclonal antibody CM313 for primary immune thrombocytopenia: multicentre, randomised, placebo controlled, phase 2 trial.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/117937",
      "abstract": "To assess the efficacy and safety of CM313, an anti-CD38 monoclonal antibody, in adults with persistent or chronic primary immune thrombocytopenia. Multicentre, randomised, placebo controlled, phase 2 trial. Five hospitals in China, 16 January to 11 June 2024. 45 patients aged ≥18 years with persistent or chronic immune thrombocytopenia who failed to respond to, or relapsed after, glucocorticoid treatment but had previously responded to standard first line treatment. Patients were randomised to receive intravenous CM313 (16 mg/kg) or placebo weekly for eight weeks. The primary outcome was overall response rate (at least two consecutive platelet counts ≥30×10/L, a minimum doubling from baseline, and no bleeding) at week 8. A secondary outcome was time to the first two consecutive platelet counts ≥50×10/L. Of 56 patients screened, 45 were randomised to receive CM313 (n=30) or placebo (n=15). At week 8, the overall response rate was higher in the CM313 group (83%; 25/30) compared with placebo group (20%; 3/15): difference 63.3% (95% confidence interval 33.7% to 81.3%; P<0.001). The median time to a platelet count of ≥50×10/L was one week in the CM313 group but was not reached in the placebo group (P<0.001). The median cumulative response duration for platelet counts ≥50×10/L was 18 weeks in the CM313 group versus three weeks in the placebo group (P=0.004). Treatment emergent adverse events occurred in 87% (26/30) of patients in the CM313 group and 80% (12/15) in the placebo group, with infusion related reactions and petechiae being the most common. CM313 showed a favourable safety profile and encouraging efficacy in adults with persistent or chronic primary immune thrombocytopenia, characterised by rapid increase in platelet count, sustained platelet responses, and manageable adverse events. ClinicalTrials.gov NCT06199089.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of CM313, an anti-CD38 monoclonal antibody, in adults with persistent or chronic primary immune thrombocytopenia."
        },
        {
          "label": "DESIGN",
          "text": "Multicentre, randomised, placebo controlled, phase 2 trial."
        },
        {
          "label": "SETTING",
          "text": "Five hospitals in China, 16 January to 11 June 2024."
        },
        {
          "label": "PARTICIPANTS",
          "text": "45 patients aged ≥18 years with persistent or chronic immune thrombocytopenia who failed to respond to, or relapsed after, glucocorticoid treatment but had previously responded to standard first line treatment."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomised to receive intravenous CM313 (16 mg/kg) or placebo weekly for eight weeks."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary outcome was overall response rate (at least two consecutive platelet counts ≥30×10/L, a minimum doubling from baseline, and no bleeding) at week 8. A secondary outcome was time to the first two consecutive platelet counts ≥50×10/L."
        },
        {
          "label": "RESULTS",
          "text": "Of 56 patients screened, 45 were randomised to receive CM313 (n=30) or placebo (n=15). At week 8, the overall response rate was higher in the CM313 group (83%; 25/30) compared with placebo group (20%; 3/15): difference 63.3% (95% confidence interval 33.7% to 81.3%; P<0.001). The median time to a platelet count of ≥50×10/L was one week in the CM313 group but was not reached in the placebo group (P<0.001). The median cumulative response duration for platelet counts ≥50×10/L was 18 weeks in the CM313 group versus three weeks in the placebo group (P=0.004). Treatment emergent adverse events occurred in 87% (26/30) of patients in the CM313 group and 80% (12/15) in the placebo group, with infusion related reactions and petechiae being the most common."
        },
        {
          "label": "CONCLUSION",
          "text": "CM313 showed a favourable safety profile and encouraging efficacy in adults with persistent or chronic primary immune thrombocytopenia, characterised by rapid increase in platelet count, sustained platelet responses, and manageable adverse events."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov NCT06199089."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41120215/",
      "pubDate": "2025 Oct 21",
      "doi": "10.1136/bmj-2025-084314",
      "dateReceived": "2025-11-06T23:24:40.067Z",
      "isNew": true
    },
    {
      "id": "9907f25425a5",
      "title": "Aggressive Risk Factor Reduction Study for Atrial Fibrillation Implications for Ablation Outcomes: The ARREST-AF Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48816420/118041",
      "dateReceived": "2025-11-06T23:24:40.066Z",
      "isNew": true
    },
    {
      "id": "3ea9f95c5d86",
      "title": "Pyronaridine-artesunate for treating uncomplicated Plasmodium falciparum malaria.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48816420/118004",
      "abstract": "The World Health Organization (WHO) recommends artemisinin-based combination therapies (ACTs) to treat uncomplicated Plasmodium falciparum malaria. Concerns about artemisinin resistance have led to global initiatives to develop new partner drugs to protect artemisinin derivatives in ACT. Pyronaridine-artesunate (PY-AS) is a novel ACT first recommended by the WHO in 2022. To evaluate the benefits of pyronaridine-artesunate compared to alternative ACTs for treating people with uncomplicated P falciparum malaria, and to evaluate the harms of pyronaridine-artesunate and other pyronaridine treatments compared to alternative treatments. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and LILACS. We also searched ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, and the ISRCTN registry for ongoing or recently completed trials. The date of the last search was 31 July 2024. For the efficacy analysis, we included randomized controlled trials (RCTs) of pyronaridine-artesunate for treating adults and children with uncomplicated P falciparum malaria compared to any other WHO-recommended ACT. For the safety analysis, we included RCTs that used pyronaridine alone or in combination with any other antimalarials. Our primary outcomes were treatment failure at days 28 and 42 (PCR-adjusted and -unadjusted), serious adverse events, adverse events leading to withdrawal from treatment, and elevated liver function tests. Secondary outcomes included early treatment failure, other adverse events, cost-effectiveness, feasibility, and acceptability. We used the Cochrane RoB 1 tool to assess bias in the RCTs. Two review authors independently extracted all data and assessed the certainty of the evidence. We meta-analyzed data to calculate risk ratios (RRs) for treatment failures between comparisons, and for safety outcomes between and across comparisons. We included 15 studies (14 RCTs reporting safety and efficacy, 1 quasi-experimental study reporting acceptability and feasibility) with 7295 participants. For a separate safety analysis, we included 10 non-randomized studies (NRS) with 11,783 participants. Efficacy analysis (RCTs) We evaluated pyronaridine-artesunate versus the following. - Artemether-lumefantrine. Pyronaridine-artesunate probably performs better for PCR-adjusted failures at day 28 (RR 0.40, 95% confidence interval (CI) 0.19 to 0.85; 5 RCTs, 3213 participants; moderate-certainty evidence); for unadjusted failures at day 28 (RR 0.27, 95% CI 0.14 to 0.52; 5 RCTs, 3314 participants; moderate-certainty evidence); and for unadjusted failures at day 42 (RR 0.61, 95% CI 0.46 to 0.82; 4 RCTs, 3080 participants; moderate-certainty evidence). For PCR-adjusted failures at day 42, there is probably little or no difference between groups (RR 0.86, 95% CI 0.49 to 1.51; 4 RCTs, 2575 participants; moderate-certainty evidence). - Artesunate-amodiaquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.55, 95% CI 0.11 to 2.77; 1 RCT, 1245 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.49, 95% CI 0.30 to 0.81; 1 RCT, 1257 participants; moderate-certainty evidence); may make little or no difference for PCR-adjusted failures at day 42 (RR 0.98, 95% CI 0.20 to 4.83; 1 RCT, 1091 participants; low-certainty evidence); and probably makes little or no difference for unadjusted failures at day 42 (RR 0.98, 95% CI 0.78 to 1.23; 1 RCT, 1235 participants; moderate-certainty evidence). - Artesunate-mefloquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.37, 95% CI 0.13 to 1.05; 1 RCT, 1117 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.36, 95% CI 0.17 to 0.78; 1 RCT, 1120 participants; moderate-certainty evidence); may make little or no difference for unadjusted failures at day 42 (RR 0.84, 95% CI 0.54 to 1.31; 1 RCT, 1059 participants; low-certainty evidence); but may lead to higher PCR-adjusted failures at day 42 (RR 1.80, 95% CI 0.90 to 3.57; 1 RCT, 1037 participants; low-certainty evidence). Safety analysis in adults and children (RCTs) Pyronaridine-artesunate was associated with raised liver enzymes compared to other antimalarials: alanine aminotransferase (ALT) (RR 3.59, 95% CI 1.76 to 7.33; 8 RCTs, 6669 participants; high-certainty evidence) and aspartate transaminase (AST) (RR 2.22, 95% CI 1.12 to 4.41; 8 RCTs, 6669 participants; high-certainty evidence). There was no such effect with bilirubin (RR 1.03, 95% CI 0.49 to 2.18; 7 RCTs, 6384 participants; moderate-certainty evidence). There was one reported case in which raised ALT occurred with raised bilirubin. No study reported severe drug-induced liver injury. Safety analysis in pregnant women (RCTs) We do not know if malaria testing and treatment with pyronaridine-artesunate for positive cases resulted in any difference in serious adverse effects for pregnant women compared to intermittent preventive treatment with sulfadoxine-pyrimethamine (RR 0.57, 95% CI 0.28 to 1.15; 1 RCT, 250 participants; very-low certainty evidence). Acceptability and feasibility One study determined that the adherence rate to a three-day treatment with pyronaridine-artesunate in children aged under five years was 85.3%. Limited qualitative data suggests pyronaridine-artesunate is acceptable to patients and their carers. Certainty of the evidence and limitations The studies included in this review ranged between very low-certainty and high-certainty evidence, largely due to imprecision of the effect estimate with wide CIs, and indirectness, given that children under five years were under-represented (especially in Asia). We did not identify any evidence of cost-effectiveness. Pyronaridine-artesunate was efficacious against uncomplicated P falciparum malaria; achieved a PCR-adjusted treatment failure rate of less than 8% at days 28 and 42; and may be at least as good as artesunate-amodiaquine and artesunate-mefloquine (based on 1 RCT per drug) and may be at least as good as, or better than, artemether-lumefantrine. Pyronaridine-artesunate increases the risk of episodes of abnormally raised ALT and AST compared to other studied therapeutics. Tilly Fox and the Cochrane Infectious Diseases Group editorial base were funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104, ended 31 December 2024). The views expressed do not necessarily reflect the UK Government's official policies. Protocol and previous versions available via doi.org/10.1002/14651858.CD006404, doi.org/10.1002/14651858.CD006404.pub2, doi.org/10.1002/14651858.CD006404.pub3, doi.org/10.1002/14651858.CD006404.pub4.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "The World Health Organization (WHO) recommends artemisinin-based combination therapies (ACTs) to treat uncomplicated Plasmodium falciparum malaria. Concerns about artemisinin resistance have led to global initiatives to develop new partner drugs to protect artemisinin derivatives in ACT. Pyronaridine-artesunate (PY-AS) is a novel ACT first recommended by the WHO in 2022."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the benefits of pyronaridine-artesunate compared to alternative ACTs for treating people with uncomplicated P falciparum malaria, and to evaluate the harms of pyronaridine-artesunate and other pyronaridine treatments compared to alternative treatments."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and LILACS. We also searched ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, and the ISRCTN registry for ongoing or recently completed trials. The date of the last search was 31 July 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "For the efficacy analysis, we included randomized controlled trials (RCTs) of pyronaridine-artesunate for treating adults and children with uncomplicated P falciparum malaria compared to any other WHO-recommended ACT. For the safety analysis, we included RCTs that used pyronaridine alone or in combination with any other antimalarials."
        },
        {
          "label": "OUTCOMES",
          "text": "Our primary outcomes were treatment failure at days 28 and 42 (PCR-adjusted and -unadjusted), serious adverse events, adverse events leading to withdrawal from treatment, and elevated liver function tests. Secondary outcomes included early treatment failure, other adverse events, cost-effectiveness, feasibility, and acceptability."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane RoB 1 tool to assess bias in the RCTs."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently extracted all data and assessed the certainty of the evidence. We meta-analyzed data to calculate risk ratios (RRs) for treatment failures between comparisons, and for safety outcomes between and across comparisons."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 15 studies (14 RCTs reporting safety and efficacy, 1 quasi-experimental study reporting acceptability and feasibility) with 7295 participants. For a separate safety analysis, we included 10 non-randomized studies (NRS) with 11,783 participants."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Efficacy analysis (RCTs) We evaluated pyronaridine-artesunate versus the following. - Artemether-lumefantrine. Pyronaridine-artesunate probably performs better for PCR-adjusted failures at day 28 (RR 0.40, 95% confidence interval (CI) 0.19 to 0.85; 5 RCTs, 3213 participants; moderate-certainty evidence); for unadjusted failures at day 28 (RR 0.27, 95% CI 0.14 to 0.52; 5 RCTs, 3314 participants; moderate-certainty evidence); and for unadjusted failures at day 42 (RR 0.61, 95% CI 0.46 to 0.82; 4 RCTs, 3080 participants; moderate-certainty evidence). For PCR-adjusted failures at day 42, there is probably little or no difference between groups (RR 0.86, 95% CI 0.49 to 1.51; 4 RCTs, 2575 participants; moderate-certainty evidence). - Artesunate-amodiaquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.55, 95% CI 0.11 to 2.77; 1 RCT, 1245 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.49, 95% CI 0.30 to 0.81; 1 RCT, 1257 participants; moderate-certainty evidence); may make little or no difference for PCR-adjusted failures at day 42 (RR 0.98, 95% CI 0.20 to 4.83; 1 RCT, 1091 participants; low-certainty evidence); and probably makes little or no difference for unadjusted failures at day 42 (RR 0.98, 95% CI 0.78 to 1.23; 1 RCT, 1235 participants; moderate-certainty evidence). - Artesunate-mefloquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.37, 95% CI 0.13 to 1.05; 1 RCT, 1117 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.36, 95% CI 0.17 to 0.78; 1 RCT, 1120 participants; moderate-certainty evidence); may make little or no difference for unadjusted failures at day 42 (RR 0.84, 95% CI 0.54 to 1.31; 1 RCT, 1059 participants; low-certainty evidence); but may lead to higher PCR-adjusted failures at day 42 (RR 1.80, 95% CI 0.90 to 3.57; 1 RCT, 1037 participants; low-certainty evidence). Safety analysis in adults and children (RCTs) Pyronaridine-artesunate was associated with raised liver enzymes compared to other antimalarials: alanine aminotransferase (ALT) (RR 3.59, 95% CI 1.76 to 7.33; 8 RCTs, 6669 participants; high-certainty evidence) and aspartate transaminase (AST) (RR 2.22, 95% CI 1.12 to 4.41; 8 RCTs, 6669 participants; high-certainty evidence). There was no such effect with bilirubin (RR 1.03, 95% CI 0.49 to 2.18; 7 RCTs, 6384 participants; moderate-certainty evidence). There was one reported case in which raised ALT occurred with raised bilirubin. No study reported severe drug-induced liver injury. Safety analysis in pregnant women (RCTs) We do not know if malaria testing and treatment with pyronaridine-artesunate for positive cases resulted in any difference in serious adverse effects for pregnant women compared to intermittent preventive treatment with sulfadoxine-pyrimethamine (RR 0.57, 95% CI 0.28 to 1.15; 1 RCT, 250 participants; very-low certainty evidence). Acceptability and feasibility One study determined that the adherence rate to a three-day treatment with pyronaridine-artesunate in children aged under five years was 85.3%. Limited qualitative data suggests pyronaridine-artesunate is acceptable to patients and their carers. Certainty of the evidence and limitations The studies included in this review ranged between very low-certainty and high-certainty evidence, largely due to imprecision of the effect estimate with wide CIs, and indirectness, given that children under five years were under-represented (especially in Asia). We did not identify any evidence of cost-effectiveness."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Pyronaridine-artesunate was efficacious against uncomplicated P falciparum malaria; achieved a PCR-adjusted treatment failure rate of less than 8% at days 28 and 42; and may be at least as good as artesunate-amodiaquine and artesunate-mefloquine (based on 1 RCT per drug) and may be at least as good as, or better than, artemether-lumefantrine. Pyronaridine-artesunate increases the risk of episodes of abnormally raised ALT and AST compared to other studied therapeutics."
        },
        {
          "label": "FUNDING",
          "text": "Tilly Fox and the Cochrane Infectious Diseases Group editorial base were funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104, ended 31 December 2024). The views expressed do not necessarily reflect the UK Government's official policies."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol and previous versions available via doi.org/10.1002/14651858.CD006404, doi.org/10.1002/14651858.CD006404.pub2, doi.org/10.1002/14651858.CD006404.pub3, doi.org/10.1002/14651858.CD006404.pub4."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41085194/",
      "pubDate": "2025 Oct 14",
      "doi": "10.1002/14651858.CD006404.pub5",
      "dateReceived": "2025-11-06T23:24:40.066Z",
      "isNew": true
    },
    {
      "id": "6359263251cf",
      "title": "Intracranial Hemorrhage With Direct Oral Anticoagulants vs Low-Molecular-Weight Heparin in Brain Tumors: A Review and Meta-Analysis.",
      "journal": "Neurology",
      "score": "5/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118045",
      "abstract": "Patients with brain tumors face an increased risk of arterial and venous thromboembolic events. However, owing to risk of intracranial hemorrhage (ICH), clinician practice patterns vary on preference for anticoagulation treatment. This meta-analysis evaluates the safety of direct oral anticoagulants (DOACs) vs low-molecular-weight heparin (LMWH) on the development of ICH in patients with brain tumor. We searched MEDLINE, Embase, Web of Science, and Cochrane Central Register of Controlled Trials (January 2010-June 2025) for randomized-controlled trials or cohort studies enrolling adults (age ≥18 years) with primary or metastatic brain tumors receiving therapeutic DOACs (apixaban, rivaroxaban, edoxaban, betrixaban, and dabigatran) vs LMWH (enoxaparin, dalteparin, nadroparin, and tinzaparin). Studies limited to prophylactic dosing or non-brain tumor patients were excluded. Pooled risk ratios (RRs) with 95% CIs were calculated using a restricted random-effects model. Heterogeneity () and bias were evaluated, with prespecified subgroups (tumor type, follow-up duration, and study quality) and sensitivity analyses. The study protocol was registered on PROSPERO (CRD42025635334). Among 762 publications identified, 10 retrospective cohort studies (1,572 patients: 645 DOAC, 895 LMWH) were included. Patients' mean or median age ranged 60.4-67 years (DOAC) vs 53-64 years (LMWH), with follow-up durations ranging from 3 to 12 months. Patients with primary or metastatic brain tumors receiving DOACs had a statistically significantly lower risk of any ICH compared with LMWH (RR = 0.50, 95% CI 0.29-0.87;  = 0.01,  = 49.50%). Reduction was more pronounced in 3 studies with three-month follow-up (RR = 0.23, 95% CI 0.09-0.57;  < 0.01,  < 0.01%). Stratified analyses showed reduced ICH risk with DOACs in primary brain tumors (5 studies, RR = 0.20, 95% CI 0.08-0.54;  < 0.01,  < 0.01%) but not in metastatic brain tumors (5 studies, RR = 0.86, 95% CI 0.44-1.68;  = 0.66,  = 36.04%). Leave-one-out analyses confirmed robustness, and cumulative meta-analysis demonstrated stable estimates with narrowing CIs. Egger ( = 0.19) and Begg ( = 0.59) tests showed no statistical evidence of publication bias. In the current meta-analysis, DOACs were associated with significantly lower ICH risk than LMWH in patients with anticoagulated brain tumor, particularly those with primary brain tumors. Findings support DOACs as a safe anticoagulant in arterial and venous thromboembolism. Given observational designs with inherent confounding, findings warrant cautious interpretation.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND OBJECTIVES",
          "text": "Patients with brain tumors face an increased risk of arterial and venous thromboembolic events. However, owing to risk of intracranial hemorrhage (ICH), clinician practice patterns vary on preference for anticoagulation treatment. This meta-analysis evaluates the safety of direct oral anticoagulants (DOACs) vs low-molecular-weight heparin (LMWH) on the development of ICH in patients with brain tumor."
        },
        {
          "label": "METHODS",
          "text": "We searched MEDLINE, Embase, Web of Science, and Cochrane Central Register of Controlled Trials (January 2010-June 2025) for randomized-controlled trials or cohort studies enrolling adults (age ≥18 years) with primary or metastatic brain tumors receiving therapeutic DOACs (apixaban, rivaroxaban, edoxaban, betrixaban, and dabigatran) vs LMWH (enoxaparin, dalteparin, nadroparin, and tinzaparin). Studies limited to prophylactic dosing or non-brain tumor patients were excluded. Pooled risk ratios (RRs) with 95% CIs were calculated using a restricted random-effects model. Heterogeneity () and bias were evaluated, with prespecified subgroups (tumor type, follow-up duration, and study quality) and sensitivity analyses. The study protocol was registered on PROSPERO (CRD42025635334)."
        },
        {
          "label": "RESULTS",
          "text": "Among 762 publications identified, 10 retrospective cohort studies (1,572 patients: 645 DOAC, 895 LMWH) were included. Patients' mean or median age ranged 60.4-67 years (DOAC) vs 53-64 years (LMWH), with follow-up durations ranging from 3 to 12 months. Patients with primary or metastatic brain tumors receiving DOACs had a statistically significantly lower risk of any ICH compared with LMWH (RR = 0.50, 95% CI 0.29-0.87;  = 0.01,  = 49.50%). Reduction was more pronounced in 3 studies with three-month follow-up (RR = 0.23, 95% CI 0.09-0.57;  < 0.01,  < 0.01%). Stratified analyses showed reduced ICH risk with DOACs in primary brain tumors (5 studies, RR = 0.20, 95% CI 0.08-0.54;  < 0.01,  < 0.01%) but not in metastatic brain tumors (5 studies, RR = 0.86, 95% CI 0.44-1.68;  = 0.66,  = 36.04%). Leave-one-out analyses confirmed robustness, and cumulative meta-analysis demonstrated stable estimates with narrowing CIs. Egger ( = 0.19) and Begg ( = 0.59) tests showed no statistical evidence of publication bias."
        },
        {
          "label": "DISCUSSION",
          "text": "In the current meta-analysis, DOACs were associated with significantly lower ICH risk than LMWH in patients with anticoagulated brain tumor, particularly those with primary brain tumors. Findings support DOACs as a safe anticoagulant in arterial and venous thromboembolism. Given observational designs with inherent confounding, findings warrant cautious interpretation."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40953341/",
      "pubDate": "2025 Oct 21",
      "doi": "10.1212/WNL.0000000000214140",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "651bdaf9295c",
      "title": "Immediate or Deferred Nonculprit-Lesion PCI in Myocardial Infarction.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118038",
      "abstract": "The preferred timing of treatment of nonculprit lesions in patients with ST-segment elevation myocardial infarction (STEMI) remains uncertain. A comparison of immediate percutaneous coronary intervention (PCI) guided by instantaneous wave-free ratio (iFR) and deferred PCI guided by cardiac stress magnetic resonance imaging (MRI) in patients with STEMI and multivessel disease is warranted. In this international, investigator-initiated, open-label, randomized, controlled trial, patients with STEMI and at least one nonculprit lesion who had undergone successful primary PCI were randomly assigned in a 1:1 ratio to immediate iFR-guided PCI (in lesions with >50% stenosis and an iFR of ≤0.89 [normal value, >0.89]) or deferred cardiac stress MRI-guided PCI within 6 weeks after randomization. The primary end point was a composite of death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3-year follow-up. The trial included 1146 patients (558 in the iFR group and 588 in the MRI group) with a mean (±SD) age of 63±11 years; 78% were men. A total of 237 of 556 patients (42.6%) in the iFR group and 110 of 587 patients (18.7%) in the MRI group underwent nonculprit-lesion coronary-artery PCI. A primary-end-point event occurred in 50 patients (9.3%) in the iFR group and in 55 patients (9.8%) in the MRI group (hazard ratio, 0.95; 95% confidence interval, 0.65 to 1.40; P = 0.81). Serious adverse events occurred in 145 patients in the iFR group and in 181 in the MRI group. Among patients with STEMI who have undergone successful primary PCI, immediate iFR-guided PCI was not superior to deferred cardiac stress MRI-guided PCI of nonculprit coronary-artery lesions with respect to death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3 years. (Funded by Philips Volcano and others; iMODERN ClinicalTrials.gov number, NCT03298659.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The preferred timing of treatment of nonculprit lesions in patients with ST-segment elevation myocardial infarction (STEMI) remains uncertain. A comparison of immediate percutaneous coronary intervention (PCI) guided by instantaneous wave-free ratio (iFR) and deferred PCI guided by cardiac stress magnetic resonance imaging (MRI) in patients with STEMI and multivessel disease is warranted."
        },
        {
          "label": "METHODS",
          "text": "In this international, investigator-initiated, open-label, randomized, controlled trial, patients with STEMI and at least one nonculprit lesion who had undergone successful primary PCI were randomly assigned in a 1:1 ratio to immediate iFR-guided PCI (in lesions with >50% stenosis and an iFR of ≤0.89 [normal value, >0.89]) or deferred cardiac stress MRI-guided PCI within 6 weeks after randomization. The primary end point was a composite of death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3-year follow-up."
        },
        {
          "label": "RESULTS",
          "text": "The trial included 1146 patients (558 in the iFR group and 588 in the MRI group) with a mean (±SD) age of 63±11 years; 78% were men. A total of 237 of 556 patients (42.6%) in the iFR group and 110 of 587 patients (18.7%) in the MRI group underwent nonculprit-lesion coronary-artery PCI. A primary-end-point event occurred in 50 patients (9.3%) in the iFR group and in 55 patients (9.8%) in the MRI group (hazard ratio, 0.95; 95% confidence interval, 0.65 to 1.40; P = 0.81). Serious adverse events occurred in 145 patients in the iFR group and in 181 in the MRI group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with STEMI who have undergone successful primary PCI, immediate iFR-guided PCI was not superior to deferred cardiac stress MRI-guided PCI of nonculprit coronary-artery lesions with respect to death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3 years. (Funded by Philips Volcano and others; iMODERN ClinicalTrials.gov number, NCT03298659.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159879/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1056/NEJMoa2512918",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false,
      "summary": "In STEMI patients with successful primary PCI, immediate iFR-guided PCI of nonculprit lesions did not improve outcomes compared to deferred cardiac stress MRI-guided PCI at 3 years."
    },
    {
      "id": "efc10e58bc50",
      "title": "Sodium Bicarbonate for Severe Metabolic Acidemia and Acute Kidney Injury: The BICARICU-2 Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Intensivist/Critical Care",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118032",
      "abstract": "The effect of sodium bicarbonate infusion on outcome in patients with severe metabolic acidemia and moderate to severe acute kidney injury is unknown. To determine whether sodium bicarbonate infusion is associated with day 90 all-cause mortality in patients with severe metabolic acidemia and moderate to severe acute kidney injury. Randomized, open-label, clinical trial conducted with 640 patients in 43 French intensive care units from October 6, 2019, to December 19, 2023, with 90-day follow-up. The last date of follow-up was June 17, 2024. Adults with severe metabolic acidemia (defined as pH ≤7.20) and moderate to severe acute kidney injury were enrolled. Patients were randomized 1:1 to receive either intravenous sodium bicarbonate infusion or no sodium bicarbonate to target an arterial pH of 7.30 or higher. The primary outcome was day 90 all-cause mortality. Secondary outcomes included day 28 and day 180 all-cause mortality; use of organ support therapy, vasopressors, or invasive mechanical ventilation; intensive care unit and hospital length of stay; intensive care unit-acquired infections; fluid balance; day-7 Sequential [Sepsis-related] Organ Failure Assessment score (6 organ systems' function is evaluated and scored from 0 [no dysfunction] to 4 [failure]; total score ranges from 0 [normal] to 24 [maximum failure]); and major adverse kidney events on day 90. Among 640 randomly assigned patients, 627 were analyzed (313 in the control group and 314 in the bicarbonate group). The median age was 67 years (IQR, 59-74 years); 194 of 314 patients (62%) in the bicarbonate group and 185 of 313 controls (59%) were male. In the primary analysis, day 90 all-cause mortality was 195 of 314 patients (62.1%) in the bicarbonate group and 193 of 313 (61.7%) in the control group (absolute difference, 0.4; 95% CI, -7.2 to 8.0; P = .91). There was no evidence of a group effect on day 28 or day 180 all-cause mortality. Among 18 secondary outcomes, kidney replacement therapy was used in 109 of 314 (35%) bicarbonate group patients and 157 of 313 (50%) controls (absolute difference, -15.5; 95% CI, -23.1 to -7.8). No evidence of a group effect was found on other secondary outcomes, including adverse events. For patients with severe metabolic acidemia and moderate to severe acute kidney injury, intravenous sodium bicarbonate did not affect mortality. ClinicalTrials.gov Identifier: NCT04010630.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The effect of sodium bicarbonate infusion on outcome in patients with severe metabolic acidemia and moderate to severe acute kidney injury is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether sodium bicarbonate infusion is associated with day 90 all-cause mortality in patients with severe metabolic acidemia and moderate to severe acute kidney injury."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Randomized, open-label, clinical trial conducted with 640 patients in 43 French intensive care units from October 6, 2019, to December 19, 2023, with 90-day follow-up. The last date of follow-up was June 17, 2024. Adults with severe metabolic acidemia (defined as pH ≤7.20) and moderate to severe acute kidney injury were enrolled."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomized 1:1 to receive either intravenous sodium bicarbonate infusion or no sodium bicarbonate to target an arterial pH of 7.30 or higher."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was day 90 all-cause mortality. Secondary outcomes included day 28 and day 180 all-cause mortality; use of organ support therapy, vasopressors, or invasive mechanical ventilation; intensive care unit and hospital length of stay; intensive care unit-acquired infections; fluid balance; day-7 Sequential [Sepsis-related] Organ Failure Assessment score (6 organ systems' function is evaluated and scored from 0 [no dysfunction] to 4 [failure]; total score ranges from 0 [normal] to 24 [maximum failure]); and major adverse kidney events on day 90."
        },
        {
          "label": "RESULTS",
          "text": "Among 640 randomly assigned patients, 627 were analyzed (313 in the control group and 314 in the bicarbonate group). The median age was 67 years (IQR, 59-74 years); 194 of 314 patients (62%) in the bicarbonate group and 185 of 313 controls (59%) were male. In the primary analysis, day 90 all-cause mortality was 195 of 314 patients (62.1%) in the bicarbonate group and 193 of 313 (61.7%) in the control group (absolute difference, 0.4; 95% CI, -7.2 to 8.0; P = .91). There was no evidence of a group effect on day 28 or day 180 all-cause mortality. Among 18 secondary outcomes, kidney replacement therapy was used in 109 of 314 (35%) bicarbonate group patients and 157 of 313 (50%) controls (absolute difference, -15.5; 95% CI, -23.1 to -7.8). No evidence of a group effect was found on other secondary outcomes, including adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "For patients with severe metabolic acidemia and moderate to severe acute kidney injury, intravenous sodium bicarbonate did not affect mortality."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04010630."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159812/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1001/jama.2025.20231",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "4d4eb51e03ee",
      "title": "EULAR recommendations for the management of systemic lupus erythematosus with kidney involvement: 2025 update.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Nephrology",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118018",
      "abstract": "The objective of this study was to update the 2019 European Alliance of Associations for Rheumatology (EULAR)/ European Renal Association/European Dialysis Transplantation Association (ERA-EDTA) recommendations for the management of systemic lupus erythematosus (SLE) with kidney involvement, taking into consideration emerging evidence and recent developments in the field. We recruited an international Task Force of experts and followed the EULAR standard operating procedures. We performed systematic literature research (period January 2019 to March 2024), followed by the modified Delphi method, to form questions, elicit expert opinions, and reach consensus. The new evidence was examined, taking into consideration previous updates. The Task Force agreed on 4 overarching principles and 13 recommendations, which were also evaluated for their feasibility and impact on clinical care. These concern the use of kidney biopsy for diagnosis; targets of therapy and treatment milestones; immunomodulatory therapy with antimalarials, glucocorticoids, immunosuppressives (mycophenolate, cyclophosphamide, and calcineurin inhibitors), and biologics (belimumab, obinutuzumab, and rituximab); nonimmune therapy (kidney protection, vaccinations, cardiovascular, and bone protection); family planning; and management of kidney failure. Guidance on single-agent or early combination immune therapy, glucocorticoid tapering and withdrawal, duration of immune therapy, and treatment of refractory disease is provided. The updated EULAR recommendations provide evidence- and expert-based consensus on the management of SLE with kidney involvement, adjusted for severity, and taking into consideration long-term efficacy, safety, cost, and local availability of drugs.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "The objective of this study was to update the 2019 European Alliance of Associations for Rheumatology (EULAR)/ European Renal Association/European Dialysis Transplantation Association (ERA-EDTA) recommendations for the management of systemic lupus erythematosus (SLE) with kidney involvement, taking into consideration emerging evidence and recent developments in the field."
        },
        {
          "label": "METHODS",
          "text": "We recruited an international Task Force of experts and followed the EULAR standard operating procedures. We performed systematic literature research (period January 2019 to March 2024), followed by the modified Delphi method, to form questions, elicit expert opinions, and reach consensus. The new evidence was examined, taking into consideration previous updates."
        },
        {
          "label": "RESULTS",
          "text": "The Task Force agreed on 4 overarching principles and 13 recommendations, which were also evaluated for their feasibility and impact on clinical care. These concern the use of kidney biopsy for diagnosis; targets of therapy and treatment milestones; immunomodulatory therapy with antimalarials, glucocorticoids, immunosuppressives (mycophenolate, cyclophosphamide, and calcineurin inhibitors), and biologics (belimumab, obinutuzumab, and rituximab); nonimmune therapy (kidney protection, vaccinations, cardiovascular, and bone protection); family planning; and management of kidney failure. Guidance on single-agent or early combination immune therapy, glucocorticoid tapering and withdrawal, duration of immune therapy, and treatment of refractory disease is provided."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The updated EULAR recommendations provide evidence- and expert-based consensus on the management of SLE with kidney involvement, adjusted for severity, and taking into consideration long-term efficacy, safety, cost, and local availability of drugs."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41107121/",
      "pubDate": "2025 Oct 16",
      "doi": "10.1016/j.ard.2025.09.007",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "6797d3997953",
      "title": "Weight-reducing treatments are associated with an improvement in depression, functional health status, and quality of life: A meta-analysis of randomized controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118017",
      "abstract": "To assess whether there is a beneficial or detrimental effect of weight reduction on mental health. Meta-analysis of randomized trials performed for weight loss, in which weight loss at endpoint was greater than 5% in the intervention arm and smaller than 5% in the control arm, obtained with any surgical, endoscopic, or EMA-approved pharmacological intervention. The endpoints were the incidence of overall and specific psychiatric adverse events. Weight loss was associated with a reduced risk of major depression (MH-OR 0.45 95% CI [0.21, 0.94], I = 0), and overall depression (MH-OR 0.72 [0.54, 0.97]); in subgroup analyses, a weight loss greater than 10% was associated with a lower incidence of depression than smaller weight loss (p = 0.04), whereas no difference was found between different interventions. No difference was detected in the incidence of anxiety (MH-OR 1.04 [0.78, 1.39]), of serious (M-H, OR CI 1.07 [0.78, 1.47]) and overall (MH-OR 1.09 [0.89, 1.34]) psychiatric adverse events, suicidal ideation (M-H, OR 0.87 [0.44, 1.70]), or suicide (M-H, OR 0.87 [0.44, 1.70]). An improvement in functional health status was detected, either as SF-36 Mental (SMD-IV 0.45 [0.37, 0.52]) or SF-36 Physical function (SMD-IV 0.29 [0.14, 0.44]) or IWQOL Lite Physical function (MD-IV 3.96 [1.60, 6.32]). Weight-reducing treatments were associated with a beneficial effect on quality of life and functional health status and a reduced risk of depression, without any safety signal for serious or non-serious psychiatric adverse events.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "To assess whether there is a beneficial or detrimental effect of weight reduction on mental health."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "Meta-analysis of randomized trials performed for weight loss, in which weight loss at endpoint was greater than 5% in the intervention arm and smaller than 5% in the control arm, obtained with any surgical, endoscopic, or EMA-approved pharmacological intervention. The endpoints were the incidence of overall and specific psychiatric adverse events."
        },
        {
          "label": "RESULTS",
          "text": "Weight loss was associated with a reduced risk of major depression (MH-OR 0.45 95% CI [0.21, 0.94], I = 0), and overall depression (MH-OR 0.72 [0.54, 0.97]); in subgroup analyses, a weight loss greater than 10% was associated with a lower incidence of depression than smaller weight loss (p = 0.04), whereas no difference was found between different interventions. No difference was detected in the incidence of anxiety (MH-OR 1.04 [0.78, 1.39]), of serious (M-H, OR CI 1.07 [0.78, 1.47]) and overall (MH-OR 1.09 [0.89, 1.34]) psychiatric adverse events, suicidal ideation (M-H, OR 0.87 [0.44, 1.70]), or suicide (M-H, OR 0.87 [0.44, 1.70]). An improvement in functional health status was detected, either as SF-36 Mental (SMD-IV 0.45 [0.37, 0.52]) or SF-36 Physical function (SMD-IV 0.29 [0.14, 0.44]) or IWQOL Lite Physical function (MD-IV 3.96 [1.60, 6.32])."
        },
        {
          "label": "CONCLUSION",
          "text": "Weight-reducing treatments were associated with a beneficial effect on quality of life and functional health status and a reduced risk of depression, without any safety signal for serious or non-serious psychiatric adverse events."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41131966/",
      "pubDate": "2025 Oct 23",
      "doi": "10.1111/dom.70202",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "2c0b78dfcf9a",
      "title": "Recommendation on screening adults for depression using a screening tool.",
      "journal": "CMAJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117996",
      "abstract": "Depression negatively affects how a person feels, thinks, or behaves; is associated with impaired functioning in social and work settings; and can be associated with thoughts of suicide. This update of the 2013 Canadian Task Force on Preventive Health Care guideline provides an evidence-based recommendation about instrument-based screening for depression. For this update, we commissioned a systematic review on benefits and harms of instrument-based screening (i.e., using a screening tool) for depression among adults. The systematic review covered relevant literature from October 2018 to May 2020, updated to January 2025 for trials, and to March 2025 for trial registries. We examined patient values and preferences via patient engagement surveys and focus groups; we engaged content experts and other interest holders at key points throughout the project. We used the Grading of Recommendations, Assessment, Development and Evaluation approach to determine the certainty of evidence for each outcome and strength of the recommendation; adhered to the Guidelines International Network principles of managing competing interests; and followed Appraisal of Guidelines for Research and Evaluation, and Guidance for Reporting Involvement of Patients and the Public reporting guidance. We recommend against screening all adults aged 18 years and older for depression using questionnaires (strong recommendation, very low-certainty evidence), based on evidence suggesting that depression screening using a screening tool has little to no effect on health. This recommendation does not apply to adults with a personal history, current diagnosis, or clinical suspicion of a diagnosis of depression or another mental health disorder. It does apply to those who may be at an elevated risk of depression. The recommendation against screening adults for depression using a screening tool emphasizes the importance of good clinical care, where clinicians ask about their patients' well-being and remain vigilant for symptoms and signs of depression.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Depression negatively affects how a person feels, thinks, or behaves; is associated with impaired functioning in social and work settings; and can be associated with thoughts of suicide. This update of the 2013 Canadian Task Force on Preventive Health Care guideline provides an evidence-based recommendation about instrument-based screening for depression."
        },
        {
          "label": "METHODS",
          "text": "For this update, we commissioned a systematic review on benefits and harms of instrument-based screening (i.e., using a screening tool) for depression among adults. The systematic review covered relevant literature from October 2018 to May 2020, updated to January 2025 for trials, and to March 2025 for trial registries. We examined patient values and preferences via patient engagement surveys and focus groups; we engaged content experts and other interest holders at key points throughout the project. We used the Grading of Recommendations, Assessment, Development and Evaluation approach to determine the certainty of evidence for each outcome and strength of the recommendation; adhered to the Guidelines International Network principles of managing competing interests; and followed Appraisal of Guidelines for Research and Evaluation, and Guidance for Reporting Involvement of Patients and the Public reporting guidance."
        },
        {
          "label": "RECOMMENDATIONS",
          "text": "We recommend against screening all adults aged 18 years and older for depression using questionnaires (strong recommendation, very low-certainty evidence), based on evidence suggesting that depression screening using a screening tool has little to no effect on health. This recommendation does not apply to adults with a personal history, current diagnosis, or clinical suspicion of a diagnosis of depression or another mental health disorder. It does apply to those who may be at an elevated risk of depression."
        },
        {
          "label": "INTERPRETATION",
          "text": "The recommendation against screening adults for depression using a screening tool emphasizes the importance of good clinical care, where clinicians ask about their patients' well-being and remain vigilant for symptoms and signs of depression."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41115725/",
      "pubDate": "2025 Oct 19",
      "doi": "10.1503/cmaj.250237",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false,
      "summary": "Routine screening of all adults aged 18 and older for depression using questionnaires is not recommended due to limited evidence of benefit."
    },
    {
      "id": "c302cc2ab9ca",
      "title": "Development of a Novel Frailty Trigger for Use at Triage in the Emergency Department.",
      "journal": "Acad Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117990",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41178120/",
      "pubDate": "2025 Nov 02",
      "doi": "10.1111/acem.70188",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "23fb1fe15f21",
      "title": "Semaglutide and cardiovascular outcomes by baseline and changes in adiposity measurements: a prespecified analysis of the SELECT trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117986",
      "abstract": "The SELECT trial found semaglutide reduced major adverse cardiovascular events (MACE) in patients with overweight or obesity with cardiovascular disease but without diabetes. We report a prespecified analysis of the SELECT trial on the relationships between baseline adiposity measures, treatment-induced adiposity changes, and subsequent MACE risk. Patients aged at least 45 years, with a BMI of at least 27 kg/m were enrolled in 41 countries (804 sites) and randomised 1:1 to once-weekly semaglutide 2·4 mg or placebo. The primary outcome was time to first MACE (composite of cardiovascular death, non-fatal myocardial infarction, or non-fatal stroke). Adiposity measures included weight and waist circumference. In this analysis, risk of MACE occurring after 20 weeks was assessed between patients by adiposity changes in the first 20 weeks and, in a separate analysis, all in-trial MACE were assessed between patients by adiposity changes over 104 weeks. This trial is registered with ClinicalTrials.gov, NCT03574597. Semaglutide significantly reduced MACE incidence compared with placebo among 17 604 patients enrolled in SELECT, with consistent benefits across all baseline weight and waist circumference categories. In the semaglutide group, analyses for linear trends showed lower baseline bodyweight and waist circumference were associated with lower incidence of MACE-an average 4% reduction in risk per 5 kg lower bodyweight (hazard ratio [HR] 0·96 [95% CI 0·94-0·99]; p=0·001) and per 5 cm smaller waist circumference (0·96 [0·93-0·99]; p=0·004). In the placebo group, lower baseline waist circumference (0·96 [0·94-0·99]; p=0·007), but not bodyweight (0·99 [0·97-1·01]; p=0·28), was associated with a lower MACE risk and weight loss was paradoxically associated with increased MACE risk. In those receiving semaglutide there was no linear trend linking weight loss at week 20 to subsequent MACE risk, but greater waist circumference reduction at week 20 was associated with lower subsequent MACE risk, and waist circumference reduction by week 104 was associated with lower in-trial risk of MACE. An estimated 33% of the observed benefit on MACE was mediated through waist circumference reduction (HR 0·86 [95% CI 0·77-0·97] after adjustment for time-varying changes in waist circumference). The cardioprotective effects of semaglutide were independent of baseline adiposity and weight loss and had only a small association with waist circumference, suggesting some mechanisms for benefit beyond adiposity reduction. Novo Nordisk.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The SELECT trial found semaglutide reduced major adverse cardiovascular events (MACE) in patients with overweight or obesity with cardiovascular disease but without diabetes. We report a prespecified analysis of the SELECT trial on the relationships between baseline adiposity measures, treatment-induced adiposity changes, and subsequent MACE risk."
        },
        {
          "label": "METHODS",
          "text": "Patients aged at least 45 years, with a BMI of at least 27 kg/m were enrolled in 41 countries (804 sites) and randomised 1:1 to once-weekly semaglutide 2·4 mg or placebo. The primary outcome was time to first MACE (composite of cardiovascular death, non-fatal myocardial infarction, or non-fatal stroke). Adiposity measures included weight and waist circumference. In this analysis, risk of MACE occurring after 20 weeks was assessed between patients by adiposity changes in the first 20 weeks and, in a separate analysis, all in-trial MACE were assessed between patients by adiposity changes over 104 weeks. This trial is registered with ClinicalTrials.gov, NCT03574597."
        },
        {
          "label": "FINDINGS",
          "text": "Semaglutide significantly reduced MACE incidence compared with placebo among 17 604 patients enrolled in SELECT, with consistent benefits across all baseline weight and waist circumference categories. In the semaglutide group, analyses for linear trends showed lower baseline bodyweight and waist circumference were associated with lower incidence of MACE-an average 4% reduction in risk per 5 kg lower bodyweight (hazard ratio [HR] 0·96 [95% CI 0·94-0·99]; p=0·001) and per 5 cm smaller waist circumference (0·96 [0·93-0·99]; p=0·004). In the placebo group, lower baseline waist circumference (0·96 [0·94-0·99]; p=0·007), but not bodyweight (0·99 [0·97-1·01]; p=0·28), was associated with a lower MACE risk and weight loss was paradoxically associated with increased MACE risk. In those receiving semaglutide there was no linear trend linking weight loss at week 20 to subsequent MACE risk, but greater waist circumference reduction at week 20 was associated with lower subsequent MACE risk, and waist circumference reduction by week 104 was associated with lower in-trial risk of MACE. An estimated 33% of the observed benefit on MACE was mediated through waist circumference reduction (HR 0·86 [95% CI 0·77-0·97] after adjustment for time-varying changes in waist circumference)."
        },
        {
          "label": "INTERPRETATION",
          "text": "The cardioprotective effects of semaglutide were independent of baseline adiposity and weight loss and had only a small association with waist circumference, suggesting some mechanisms for benefit beyond adiposity reduction."
        },
        {
          "label": "FUNDING",
          "text": "Novo Nordisk."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41138739/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1016/S0140-6736(25)01375-3",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "c0b4d59a6330",
      "title": "Closed-Loop Insulin Delivery in Type 1 Diabetes in Pregnancy: The CIRCUIT Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117983",
      "abstract": "Hyperglycemia-related pregnancy complications occur in 50% of pregnant women with type 1 diabetes. Closed-loop insulin systems improve glycemia outside of pregnancy but have had limited testing in pregnancy. To assess the efficacy of a closed-loop system in pregnancy. Open-label trial enrolling pregnant women with type 1 diabetes at 14 clinical centers in Canada and Australia before 14 weeks' gestation with follow-up until 6 weeks postpartum. Enrollment occurred between June 2021 and July 2024 and follow-up was completed in March 2025. Participants were randomized 1:1 to closed-loop therapy (n = 46) or standard care (insulin pump or multiple daily insulin injections) (n = 45) with continuous glucose monitoring. The primary outcome was the percentage of time spent in the pregnancy-specific glucose range (63-140 mg/dL), measured by continuous glucose monitoring from 16 to 34 weeks' gestation. Among 94 enrolled participants, 3 experienced pregnancy loss prior to randomization, 91 were randomized (mean age, 31.7 [SD, 5.2] years; early pregnancy hemoglobin A1c, 7.4% [SD, 1.0%]), and 88 were included in the primary analysis. The mean percentage of time spent in the pregnancy-specific glucose range from 16 to 34 weeks' gestation was 65.4% in the closed-loop group and 50.3% in the standard care group (mean adjusted difference, 12.5 [95% CI, 9.5-15.6] percentage points; P < .001). There was 1 episode of severe hypoglycemia in the closed-loop group, and there were 2 episodes of diabetic ketoacidosis in the closed-loop group and 1 in the standard care group. Pregnant women with type 1 diabetes using a closed-loop system spent significantly more time in the pregnancy-specific glucose range than those receiving standard care. These findings support the use of this closed-loop system in pregnant women with type 1 diabetes. ClinicalTrials.gov Identifier: NCT04902378.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Hyperglycemia-related pregnancy complications occur in 50% of pregnant women with type 1 diabetes. Closed-loop insulin systems improve glycemia outside of pregnancy but have had limited testing in pregnancy."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy of a closed-loop system in pregnancy."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Open-label trial enrolling pregnant women with type 1 diabetes at 14 clinical centers in Canada and Australia before 14 weeks' gestation with follow-up until 6 weeks postpartum. Enrollment occurred between June 2021 and July 2024 and follow-up was completed in March 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1 to closed-loop therapy (n = 46) or standard care (insulin pump or multiple daily insulin injections) (n = 45) with continuous glucose monitoring."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the percentage of time spent in the pregnancy-specific glucose range (63-140 mg/dL), measured by continuous glucose monitoring from 16 to 34 weeks' gestation."
        },
        {
          "label": "RESULTS",
          "text": "Among 94 enrolled participants, 3 experienced pregnancy loss prior to randomization, 91 were randomized (mean age, 31.7 [SD, 5.2] years; early pregnancy hemoglobin A1c, 7.4% [SD, 1.0%]), and 88 were included in the primary analysis. The mean percentage of time spent in the pregnancy-specific glucose range from 16 to 34 weeks' gestation was 65.4% in the closed-loop group and 50.3% in the standard care group (mean adjusted difference, 12.5 [95% CI, 9.5-15.6] percentage points; P < .001). There was 1 episode of severe hypoglycemia in the closed-loop group, and there were 2 episodes of diabetic ketoacidosis in the closed-loop group and 1 in the standard care group."
        },
        {
          "label": "CONCLUSION AND RELEVANCE",
          "text": "Pregnant women with type 1 diabetes using a closed-loop system spent significantly more time in the pregnancy-specific glucose range than those receiving standard care. These findings support the use of this closed-loop system in pregnant women with type 1 diabetes."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04902378."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41134589/",
      "pubDate": "2025 Oct 24",
      "doi": "10.1001/jama.2025.19578",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "9b6d7dd01329",
      "title": "Long-Term Effect of ICDs in Nonischemic Heart Failure With Reduced Ejection Fraction: Extended Follow-Up Analysis of DANISH.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48705294/117959",
      "abstract": "The most common causes of death may change over time in heart failure with reduced ejection fraction (HFrEF). These shifts can influence the risk-benefit balance of interventions such as implantable cardioverter-defibrillators (ICDs), which are designed to prevent sudden cardiac death. Long-term follow-up is therefore essential to determine whether early benefits are sustained, attenuated, or lost over time. This study sought to examine the long-term effect of primary prevention ICD implantation, compared with usual clinical care, in patients with nonischemic HFrEF enrolled in the DANISH (Danish Study To Assess the Efficacy of ICDs in Patients With Nonischemic Systolic Heart Failure on Mortality) trial. The DANISH trial enrolled 1,116 patients with nonischemic HFrEF, left ventricular ejection fraction ≤35%, NYHA functional class II-III (class IV if cardiac resynchronization therapy was planned), and elevated natriuretic peptide levels. The primary outcome was all-cause death, and secondary outcomes were cardiovascular death and sudden cardiovascular death. In this study with extended follow-up, patients were followed until death or January 31, 2024, whichever came first. During a median follow-up of 13.2 years (Q1-Q3: 11.6-14.6 years), 294 patients (52.9%) in the ICD group and 299 (53.4%) in the control group died. Compared with usual clinical care, ICD implantation did not significantly reduce the long-term rate of all-cause death (HR: 0.96; 95% CI: 0.82-1.13), but it did reduce the long-term rate of sudden cardiovascular death (HR: 0.54; 95% CI: 0.36-0.80). The effect of ICD implantation on all-cause death was consistent regardless of age (P = 0.89). However, age significantly modified the effect of ICD implantation on sudden cardiovascular death, such that ICD implantation reduced the rate of this outcome in patients ≤70 years (HR: 0.38; 95% CI: 0.23-0.62), but not in those >70 years (HR: 1.27; 95% CI: 0.56-2.89; P = 0.01). Similar trends were observed when age was analyzed as a continuous variable. The effect of ICD implantation was generally consistent across other key subgroups, including cardiac resynchronization therapy use at baseline. In patients with nonischemic HFrEF, during a median follow-up of 13.2 years, primary prevention ICD implantation did not reduce all-cause death, but it did reduce sudden cardiovascular death, and younger individuals appeared to derive a greater benefit. (Danish ICD Study in Patients With Dilated Cardiomyopathy [DANISH]; NCT00542945).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The most common causes of death may change over time in heart failure with reduced ejection fraction (HFrEF). These shifts can influence the risk-benefit balance of interventions such as implantable cardioverter-defibrillators (ICDs), which are designed to prevent sudden cardiac death. Long-term follow-up is therefore essential to determine whether early benefits are sustained, attenuated, or lost over time."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study sought to examine the long-term effect of primary prevention ICD implantation, compared with usual clinical care, in patients with nonischemic HFrEF enrolled in the DANISH (Danish Study To Assess the Efficacy of ICDs in Patients With Nonischemic Systolic Heart Failure on Mortality) trial."
        },
        {
          "label": "METHODS",
          "text": "The DANISH trial enrolled 1,116 patients with nonischemic HFrEF, left ventricular ejection fraction ≤35%, NYHA functional class II-III (class IV if cardiac resynchronization therapy was planned), and elevated natriuretic peptide levels. The primary outcome was all-cause death, and secondary outcomes were cardiovascular death and sudden cardiovascular death. In this study with extended follow-up, patients were followed until death or January 31, 2024, whichever came first."
        },
        {
          "label": "RESULTS",
          "text": "During a median follow-up of 13.2 years (Q1-Q3: 11.6-14.6 years), 294 patients (52.9%) in the ICD group and 299 (53.4%) in the control group died. Compared with usual clinical care, ICD implantation did not significantly reduce the long-term rate of all-cause death (HR: 0.96; 95% CI: 0.82-1.13), but it did reduce the long-term rate of sudden cardiovascular death (HR: 0.54; 95% CI: 0.36-0.80). The effect of ICD implantation on all-cause death was consistent regardless of age (P = 0.89). However, age significantly modified the effect of ICD implantation on sudden cardiovascular death, such that ICD implantation reduced the rate of this outcome in patients ≤70 years (HR: 0.38; 95% CI: 0.23-0.62), but not in those >70 years (HR: 1.27; 95% CI: 0.56-2.89; P = 0.01). Similar trends were observed when age was analyzed as a continuous variable. The effect of ICD implantation was generally consistent across other key subgroups, including cardiac resynchronization therapy use at baseline."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with nonischemic HFrEF, during a median follow-up of 13.2 years, primary prevention ICD implantation did not reduce all-cause death, but it did reduce sudden cardiovascular death, and younger individuals appeared to derive a greater benefit. (Danish ICD Study in Patients With Dilated Cardiomyopathy [DANISH]; NCT00542945)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123523/",
      "pubDate": "2025 Oct 11",
      "doi": "10.1016/j.jacc.2025.08.089",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false,
      "summary": "In patients with nonischemic HFrEF, primary prevention ICD implantation reduced sudden cardiovascular death but did not reduce all-cause death, with potentially greater benefit in younger individuals."
    },
    {
      "id": "64dd5a83f176",
      "title": "Efficacy of vaginal mussel adhesive protein for treating postmenopausal vulvovaginal atrophy.",
      "journal": "Age Ageing",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48705294/117925",
      "abstract": "To compare the efficacy and safety of the vaginal mussel adhesive protein (MAP) hydrogel with the promestriene or the placebo hydrogel for treating moderate-to-severe postmenopausal vulvovaginal atrophy (VVA) symptoms. This 12-week randomised clinical trial enrolled postmenopausal women with moderate-to-severe VVA to receive treatment with MAP, promestriene or placebo hydrogel. The primary outcome was the decrease in severity of most bothersome symptom (MBS) between baseline and 12 weeks. Additional measures included a composite vaginal symptom index, vaginal health index, female sexual function index (FSFI) score, vaginal pH, vaginal maturation value, vaginal microecology, treatment satisfaction, meaningful benefit and treatment safety. We recruited 105 participants, and 96 provided data for the study analysis. Three treatments had similar mean reductions in MBS severity over 12 weeks: MAP, -1.72 (95% CI, -1.91 to -1.53); promestriene, -1.55 (95% CI, -1.86 to -1.24) and placebo, -1.71 (95% CI, -1.95 to -1.48). Compared to the placebo, the MAP significantly improved the Satisfaction (P = .003) of the FSFI. In addition, the MAP and promestriene improved the vaginal microecology significantly. Adjusted for age and year after menopause, the mean reductions in MBS and the mean improvements in FSFI of MAP were comparable with promestriene (MBS, P = .410; FSFI, P = .233) but greater than the placebo (MBS, P = .028; FSFI, P = .046). After adjusting for age and year after menopause, MAP demonstrates comparable efficacy to promestriene but superior effectiveness to placebo in alleviating postmenopausal vulvovaginal symptoms.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To compare the efficacy and safety of the vaginal mussel adhesive protein (MAP) hydrogel with the promestriene or the placebo hydrogel for treating moderate-to-severe postmenopausal vulvovaginal atrophy (VVA) symptoms."
        },
        {
          "label": "METHODS",
          "text": "This 12-week randomised clinical trial enrolled postmenopausal women with moderate-to-severe VVA to receive treatment with MAP, promestriene or placebo hydrogel. The primary outcome was the decrease in severity of most bothersome symptom (MBS) between baseline and 12 weeks. Additional measures included a composite vaginal symptom index, vaginal health index, female sexual function index (FSFI) score, vaginal pH, vaginal maturation value, vaginal microecology, treatment satisfaction, meaningful benefit and treatment safety."
        },
        {
          "label": "RESULTS",
          "text": "We recruited 105 participants, and 96 provided data for the study analysis. Three treatments had similar mean reductions in MBS severity over 12 weeks: MAP, -1.72 (95% CI, -1.91 to -1.53); promestriene, -1.55 (95% CI, -1.86 to -1.24) and placebo, -1.71 (95% CI, -1.95 to -1.48). Compared to the placebo, the MAP significantly improved the Satisfaction (P = .003) of the FSFI. In addition, the MAP and promestriene improved the vaginal microecology significantly. Adjusted for age and year after menopause, the mean reductions in MBS and the mean improvements in FSFI of MAP were comparable with promestriene (MBS, P = .410; FSFI, P = .233) but greater than the placebo (MBS, P = .028; FSFI, P = .046)."
        },
        {
          "label": "CONCLUSION",
          "text": "After adjusting for age and year after menopause, MAP demonstrates comparable efficacy to promestriene but superior effectiveness to placebo in alleviating postmenopausal vulvovaginal symptoms."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41066676/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf288",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "fbbfa11049e7",
      "title": "Mycophenolate Mofetil versus Cyclophosphamide for Initial Therapy in Childhood-Onset Proliferative Lupus Nephritis: A Prospective, Multicenter, Randomized Trial.",
      "journal": "J Am Soc Nephrol",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48705294/117891",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40938672/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1681/ASN.0000000866",
      "dateReceived": "2025-11-05T23:25:39.361Z",
      "isNew": false
    },
    {
      "id": "f291bb9fa61a",
      "title": "Transfusion thresholds and other strategies for guiding red blood cell transfusion.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Gastroenterology",
        "Hematology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118056",
      "abstract": "The optimal haemoglobin threshold for use of red blood cell (RBC) transfusions in anaemic patients remains an active area of research. Blood is a limited resource, and there are concerns about risks, including transmitted infections. If a liberal transfusion strategy does not improve clinical outcomes, or if it is equivalent, then adopting a more restrictive approach should be recognised as the standard of care. The aim of this review update was to compare 30-day mortality and other clinical outcomes for participants randomised to restrictive versus liberal red blood cell (RBC) transfusion thresholds (triggers) for all clinical conditions. The restrictive transfusion threshold uses a lower haemoglobin concentration as a threshold for transfusion (most commonly, 7.0 g/dL to 8.0 g/dL), and the liberal transfusion threshold uses a higher haemoglobin concentration to direct transfusion (most commonly, 9.0 g/dL to 10.0 g/dL). Increasingly, investigators are considering other strategies including physiological triggers (i.e. central venous oxygen saturation), alone or in combination with such thresholds, to determine when a transfusion is indicated, so it is important to assess this growing body of evidence in tandem. We searched CENTRAL, MEDLINE, Embase, Transfusion Evidence Library, Web of Science Conference Proceedings Citation Index, trial registries and PubMed on 14 October 2024. We checked reference lists of published reviews and papers for additional trials. We included randomised trials of surgical or medical participants that recruited adults or children. We excluded studies that focused on preterm neonates. Eligible trials assigned intervention groups based on different transfusion strategies or thresholds, usually defined by a haemoglobin concentration below which a RBC transfusion would be administered. We included trials in which investigators had allocated participants to higher thresholds or more liberal transfusion strategies compared to more restrictive ones, which might include no transfusion. We used standard Cochrane methods. We pooled risk ratios across trials using a random-effects model. We assessed risk of bias using the Cochrane RoB 1 tool, and assessed the certainty of evidence using GRADE. We defined participants randomly allocated to the lower transfusion threshold as being in the 'restrictive transfusion' group and those randomly allocated to the higher transfusion threshold as being in the 'liberal transfusion' group. Adult threshold comparison We included 61 trials (27,639 participants), across a range of clinical contexts: orthopaedic, cardiac or vascular surgery; critical care; neurocritical care; gastrointestinal bleeding; trauma; acute myocardial infarction; haematological malignancies and postpartum haemorrhage. The haemoglobin concentration used to define the restrictive transfusion group in most trials was between 7.0 g/dL and 8.0 g/dL. The main outcomes were exposure to blood transfusion, 30-day mortality, neurologic function, myocardial infarction, congestive heart failure, cerebral vascular accident, infection and thromboembolism. Studies were generally at low risk of bias. Restrictive transfusion strategies reduced the risk of receiving at least one RBC transfusion by 42% when combining all clinical contexts (risk ratio (RR) 0.58, 95% confidence interval (CI) 0.52 to 0.65; high-certainty evidence), with a large amount of heterogeneity between trials (I² = 97%), reflecting diversity in the strength of estimates, not the efficacy of the policy. When combining all clinical contexts, restrictive transfusion strategies did not modify the risk of 30-day mortality compared with liberal transfusion strategies (RR 1.01, 95% CI 0.90 to 1.14; 44 studies, 22,575 participants; high-certainty evidence) or any of the other outcomes assessed including myocardial infarction, stroke, thromboembolism or infection (moderate to high-certainty evidence). There were two exceptions in clinical populations. In gastrointestinal bleeding, 30-day mortality was lower with a restrictive transfusion strategy (RR 0.63, 95% CI 0.42 to 0.95; 4 studies, 1574 participants). In critically ill patients with brain injury, unfavourable neurological outcome at 6 to 12 months was lower with a liberal transfusion strategy (RR 1.14, 95% CI 1.05 to 1.22; 4 studies, 2297 participants) (moderate-certainty evidence). Transfusion-specific reactions are uncommon, but occurred more frequently with the liberal strategy (Peto odds ratio 0.47, 95% CI 0.36 to 0.62; 18 studies, 11,505 participants). Paediatric threshold comparison We included eight trials (2764 participants), across a limited range of clinical contexts (critical care, cardiac surgery, haematological malignancies and severe malarial anaemia). The haemoglobin concentration used to define the restrictive group in critical care and haematological malignancies trials was between 6.5 g/dL and 8.0 g/dL, and between 7.0 g/dL and 9 g/dL in cardiac surgery trials, depending on the cardiac abnormality and stage of repair. Studies were generally at low risk of bias. There was no clear difference in 30-day mortality between restrictive and liberal transfusion strategies, although confidence intervals were wide (RR 1.22, 95% CI 0.72 to 2.08; 7 studies, 2571 participants; low-certainty evidence). There was moderate-certainty evidence of no clear difference between threshold strategies for infection; very low-certainty evidence of little to no difference for thrombosis and very low-certainty evidence of little to no difference for the outcomes multiple organ dysfunction and cerebrovascular accident. Physiological triggers Nine trials in adults (3818 participants) and one trial in children (100 participants) were identified. These tested different interventions and measures of physiological parameters in diverse clinical populations. The risk of bias was variable. Meta-analysis was not appropriate due to heterogeneity. A restrictive transfusion strategy significantly decreased the proportion of adults and children exposed to RBC transfusion. In most clinical contexts, there was no evidence of harm from a restrictive compared with a liberal transfusion strategy. Neurocritically ill patients, however, have better neurological outcomes at 6 to 12 months with a liberal transfusion strategy. Further work is needed to improve our understanding of outcomes beyond mortality, and to what degree the optimal strategies for transfusion should be modified in some patient populations, including different types of acute bleeding, cancers and subgroups of patients with myocardial infarction and other neurological injuries. New studies need to recognise the clinical context and the limitations of the adoption of a single threshold of haemoglobin, and to consider evaluating the use of physiological parameters to modify transfusion.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The optimal haemoglobin threshold for use of red blood cell (RBC) transfusions in anaemic patients remains an active area of research. Blood is a limited resource, and there are concerns about risks, including transmitted infections. If a liberal transfusion strategy does not improve clinical outcomes, or if it is equivalent, then adopting a more restrictive approach should be recognised as the standard of care."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this review update was to compare 30-day mortality and other clinical outcomes for participants randomised to restrictive versus liberal red blood cell (RBC) transfusion thresholds (triggers) for all clinical conditions. The restrictive transfusion threshold uses a lower haemoglobin concentration as a threshold for transfusion (most commonly, 7.0 g/dL to 8.0 g/dL), and the liberal transfusion threshold uses a higher haemoglobin concentration to direct transfusion (most commonly, 9.0 g/dL to 10.0 g/dL). Increasingly, investigators are considering other strategies including physiological triggers (i.e. central venous oxygen saturation), alone or in combination with such thresholds, to determine when a transfusion is indicated, so it is important to assess this growing body of evidence in tandem."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, Transfusion Evidence Library, Web of Science Conference Proceedings Citation Index, trial registries and PubMed on 14 October 2024. We checked reference lists of published reviews and papers for additional trials."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised trials of surgical or medical participants that recruited adults or children. We excluded studies that focused on preterm neonates. Eligible trials assigned intervention groups based on different transfusion strategies or thresholds, usually defined by a haemoglobin concentration below which a RBC transfusion would be administered. We included trials in which investigators had allocated participants to higher thresholds or more liberal transfusion strategies compared to more restrictive ones, which might include no transfusion."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We used standard Cochrane methods. We pooled risk ratios across trials using a random-effects model. We assessed risk of bias using the Cochrane RoB 1 tool, and assessed the certainty of evidence using GRADE. We defined participants randomly allocated to the lower transfusion threshold as being in the 'restrictive transfusion' group and those randomly allocated to the higher transfusion threshold as being in the 'liberal transfusion' group."
        },
        {
          "label": "MAIN RESULTS",
          "text": "Adult threshold comparison We included 61 trials (27,639 participants), across a range of clinical contexts: orthopaedic, cardiac or vascular surgery; critical care; neurocritical care; gastrointestinal bleeding; trauma; acute myocardial infarction; haematological malignancies and postpartum haemorrhage. The haemoglobin concentration used to define the restrictive transfusion group in most trials was between 7.0 g/dL and 8.0 g/dL. The main outcomes were exposure to blood transfusion, 30-day mortality, neurologic function, myocardial infarction, congestive heart failure, cerebral vascular accident, infection and thromboembolism. Studies were generally at low risk of bias. Restrictive transfusion strategies reduced the risk of receiving at least one RBC transfusion by 42% when combining all clinical contexts (risk ratio (RR) 0.58, 95% confidence interval (CI) 0.52 to 0.65; high-certainty evidence), with a large amount of heterogeneity between trials (I² = 97%), reflecting diversity in the strength of estimates, not the efficacy of the policy. When combining all clinical contexts, restrictive transfusion strategies did not modify the risk of 30-day mortality compared with liberal transfusion strategies (RR 1.01, 95% CI 0.90 to 1.14; 44 studies, 22,575 participants; high-certainty evidence) or any of the other outcomes assessed including myocardial infarction, stroke, thromboembolism or infection (moderate to high-certainty evidence). There were two exceptions in clinical populations. In gastrointestinal bleeding, 30-day mortality was lower with a restrictive transfusion strategy (RR 0.63, 95% CI 0.42 to 0.95; 4 studies, 1574 participants). In critically ill patients with brain injury, unfavourable neurological outcome at 6 to 12 months was lower with a liberal transfusion strategy (RR 1.14, 95% CI 1.05 to 1.22; 4 studies, 2297 participants) (moderate-certainty evidence). Transfusion-specific reactions are uncommon, but occurred more frequently with the liberal strategy (Peto odds ratio 0.47, 95% CI 0.36 to 0.62; 18 studies, 11,505 participants). Paediatric threshold comparison We included eight trials (2764 participants), across a limited range of clinical contexts (critical care, cardiac surgery, haematological malignancies and severe malarial anaemia). The haemoglobin concentration used to define the restrictive group in critical care and haematological malignancies trials was between 6.5 g/dL and 8.0 g/dL, and between 7.0 g/dL and 9 g/dL in cardiac surgery trials, depending on the cardiac abnormality and stage of repair. Studies were generally at low risk of bias. There was no clear difference in 30-day mortality between restrictive and liberal transfusion strategies, although confidence intervals were wide (RR 1.22, 95% CI 0.72 to 2.08; 7 studies, 2571 participants; low-certainty evidence). There was moderate-certainty evidence of no clear difference between threshold strategies for infection; very low-certainty evidence of little to no difference for thrombosis and very low-certainty evidence of little to no difference for the outcomes multiple organ dysfunction and cerebrovascular accident. Physiological triggers Nine trials in adults (3818 participants) and one trial in children (100 participants) were identified. These tested different interventions and measures of physiological parameters in diverse clinical populations. The risk of bias was variable. Meta-analysis was not appropriate due to heterogeneity."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "A restrictive transfusion strategy significantly decreased the proportion of adults and children exposed to RBC transfusion. In most clinical contexts, there was no evidence of harm from a restrictive compared with a liberal transfusion strategy. Neurocritically ill patients, however, have better neurological outcomes at 6 to 12 months with a liberal transfusion strategy. Further work is needed to improve our understanding of outcomes beyond mortality, and to what degree the optimal strategies for transfusion should be modified in some patient populations, including different types of acute bleeding, cancers and subgroups of patients with myocardial infarction and other neurological injuries. New studies need to recognise the clinical context and the limitations of the adoption of a single threshold of haemoglobin, and to consider evaluating the use of physiological parameters to modify transfusion."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41114449/",
      "pubDate": "2025 Oct 20",
      "doi": "10.1002/14651858.CD002042.pub6",
      "dateReceived": "2025-11-05T23:25:39.360Z",
      "isNew": false
    },
    {
      "id": "e05d33588c47",
      "title": "Antidiabetic agents and dementia risk in type 2 diabetes: A systematic review and network meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/118007",
      "abstract": "Certain antidiabetic agents may prevent dementia in patients with type 2 diabetes mellitus (T2DM). The purpose of this study is to elucidate the relative effect of antidiabetic agents on reducing dementia risk in patients with T2DM. PubMed, Cochrane Library and Igaku Chuo Zasshi-Web from inception to 31 December 2023 were searched. Trials reported in English or Japanese language that assessed the effects of glucose-lowering drugs on dementia were selected. Overall, 67 trials (4 088 683 individuals) assessing nine antidiabetic agent classes were included. Studies comprised monotherapies versus control (no use of antidiabetic agents or placebo) (three trials), monotherapies versus add-on therapies (one trial) and real-world database studies (63 trials). The analysis showed that the risk of dementia decreased with sodium-glucose cotransporter 2 inhibitors (SGLT2i), glucagon-like peptide-1 receptor agonists (GLP1-RA), thiazolidinediones (TZD) and dipeptidyl peptidase-4 inhibitors (DPP4i) compared with the reference (placebo, no use of antidiabetic agents or other antidiabetic agents). Conversely, insulin was associated with an increased risk of dementia, whereas no significant association was found with the use of metformin, sulfonylureas, glinides and α-glucosidase inhibitors. Analyses of treatment rankings further revealed the relative effect on reducing dementia risk in the following order: SGLT2i > GLP1-RA > TZD > DPP4i; insulin ranked the lowest. The most effective antidiabetic agent in reducing dementia risk in T2DM is SGLT2i, followed by GLP1-RA, TZD and DPP4i, whereas insulin is associated with an elevated risk of dementia.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Certain antidiabetic agents may prevent dementia in patients with type 2 diabetes mellitus (T2DM). The purpose of this study is to elucidate the relative effect of antidiabetic agents on reducing dementia risk in patients with T2DM."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "PubMed, Cochrane Library and Igaku Chuo Zasshi-Web from inception to 31 December 2023 were searched. Trials reported in English or Japanese language that assessed the effects of glucose-lowering drugs on dementia were selected."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 67 trials (4 088 683 individuals) assessing nine antidiabetic agent classes were included. Studies comprised monotherapies versus control (no use of antidiabetic agents or placebo) (three trials), monotherapies versus add-on therapies (one trial) and real-world database studies (63 trials). The analysis showed that the risk of dementia decreased with sodium-glucose cotransporter 2 inhibitors (SGLT2i), glucagon-like peptide-1 receptor agonists (GLP1-RA), thiazolidinediones (TZD) and dipeptidyl peptidase-4 inhibitors (DPP4i) compared with the reference (placebo, no use of antidiabetic agents or other antidiabetic agents). Conversely, insulin was associated with an increased risk of dementia, whereas no significant association was found with the use of metformin, sulfonylureas, glinides and α-glucosidase inhibitors. Analyses of treatment rankings further revealed the relative effect on reducing dementia risk in the following order: SGLT2i > GLP1-RA > TZD > DPP4i; insulin ranked the lowest."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The most effective antidiabetic agent in reducing dementia risk in T2DM is SGLT2i, followed by GLP1-RA, TZD and DPP4i, whereas insulin is associated with an elevated risk of dementia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41126557/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1111/dom.70182",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "SGLT2 inhibitors are the most effective antidiabetic medications for reducing dementia risk in type 2 diabetes, while insulin use is associated with increased risk."
    },
    {
      "id": "61bd51f1c861",
      "title": "The effects of antidepressants on cardiometabolic and other physiological parameters: a systematic review and network meta-analysis.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117975",
      "abstract": "Antidepressants induce physiological alterations; however, the degree to which these occur in treatment with various antidepressants is unclear. We aimed to compare and rank antidepressants based on physiological side-effects by synthesising data from randomised controlled trials (RCTs). We searched MEDLINE, EMBASE, PsycINFO, ClinicalTrials.gov, and the US Food and Drug Administration (FDA) website from database inception to April 21, 2025. We included single-blinded and double-blinded RCTs comparing antidepressants and placebo in acute monotherapy of any psychiatric disorder. We did frequentist random-effects network meta-analyses to investigate treatment-induced changes in weight; total cholesterol; glucose; heart rate; systolic and diastolic blood pressure; corrected QT interval (QTc); sodium; potassium; aspartate transferase (AST); alanine transaminase (ALT); alkaline phosphatase (ALP); bilirubin; urea; and creatinine. We did meta-regressions to examine study-level associations between physiological change and age, sex, and baseline weight. We estimated the correlation between depressive symptom severity change and metabolic parameter change. Of 26 252 citations, 151 studies and 17 FDA reports met inclusion criteria. The overall sample included 58 534 participants, comparing 30 antidepressants with placebo. Median treatment duration was 8 weeks (IQR 6·0-8·5). We observed clinically significant differences between antidepressants in terms of metabolic and haemodynamic effects, including an approximate 4 kg difference in weight-change between agomelatine and maprotiline, over 21 beats-per-minute difference in heart rate change between fluvoxamine and nortriptyline, and over 11 mmHg difference in systolic blood pressure between nortriptyline and doxepin. Paroxetine, duloxetine, desvenlafaxine, and venlafaxine were associated with increases in total cholesterol and, for duloxetine, glucose concentrations, despite all drugs reducing bodyweight. There was strong evidence of duloxetine, desvenlafaxine, and levomilnacipran increasing AST, ALT, and ALP concentrations, although the magnitudes of these alterations were not considered clinically significant. We did not find strong evidence of any antidepressant affecting QTc, or concentrations of sodium, potassium, urea, and creatinine to a clinically significant extent. Higher baseline bodyweight was associated with larger antidepressant-induced increases in systolic blood pressure, ALT, and AST, and higher baseline age was associated with larger antidepressant-induced increases in glucose. We did not observe an association between changes in depressive symptoms and metabolic disturbance. We found strong evidence that antidepressants differ markedly in their physiological effects, particularly for cardiometabolic parameters. Treatment guidelines should be updated to reflect differences in physiological risk, but choice of antidepressant should be made on an individual basis, considering clinical presentation and preferences of patients, carers, and clinicians. National Institute for Health Research, Maudsley Charity, Wellcome Trust, Medical Research Council.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Antidepressants induce physiological alterations; however, the degree to which these occur in treatment with various antidepressants is unclear. We aimed to compare and rank antidepressants based on physiological side-effects by synthesising data from randomised controlled trials (RCTs)."
        },
        {
          "label": "METHODS",
          "text": "We searched MEDLINE, EMBASE, PsycINFO, ClinicalTrials.gov, and the US Food and Drug Administration (FDA) website from database inception to April 21, 2025. We included single-blinded and double-blinded RCTs comparing antidepressants and placebo in acute monotherapy of any psychiatric disorder. We did frequentist random-effects network meta-analyses to investigate treatment-induced changes in weight; total cholesterol; glucose; heart rate; systolic and diastolic blood pressure; corrected QT interval (QTc); sodium; potassium; aspartate transferase (AST); alanine transaminase (ALT); alkaline phosphatase (ALP); bilirubin; urea; and creatinine. We did meta-regressions to examine study-level associations between physiological change and age, sex, and baseline weight. We estimated the correlation between depressive symptom severity change and metabolic parameter change."
        },
        {
          "label": "FINDINGS",
          "text": "Of 26 252 citations, 151 studies and 17 FDA reports met inclusion criteria. The overall sample included 58 534 participants, comparing 30 antidepressants with placebo. Median treatment duration was 8 weeks (IQR 6·0-8·5). We observed clinically significant differences between antidepressants in terms of metabolic and haemodynamic effects, including an approximate 4 kg difference in weight-change between agomelatine and maprotiline, over 21 beats-per-minute difference in heart rate change between fluvoxamine and nortriptyline, and over 11 mmHg difference in systolic blood pressure between nortriptyline and doxepin. Paroxetine, duloxetine, desvenlafaxine, and venlafaxine were associated with increases in total cholesterol and, for duloxetine, glucose concentrations, despite all drugs reducing bodyweight. There was strong evidence of duloxetine, desvenlafaxine, and levomilnacipran increasing AST, ALT, and ALP concentrations, although the magnitudes of these alterations were not considered clinically significant. We did not find strong evidence of any antidepressant affecting QTc, or concentrations of sodium, potassium, urea, and creatinine to a clinically significant extent. Higher baseline bodyweight was associated with larger antidepressant-induced increases in systolic blood pressure, ALT, and AST, and higher baseline age was associated with larger antidepressant-induced increases in glucose. We did not observe an association between changes in depressive symptoms and metabolic disturbance."
        },
        {
          "label": "INTERPRETATION",
          "text": "We found strong evidence that antidepressants differ markedly in their physiological effects, particularly for cardiometabolic parameters. Treatment guidelines should be updated to reflect differences in physiological risk, but choice of antidepressant should be made on an individual basis, considering clinical presentation and preferences of patients, carers, and clinicians."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health Research, Maudsley Charity, Wellcome Trust, Medical Research Council."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41135546/",
      "pubDate": "2025 Nov 01",
      "doi": "10.1016/S0140-6736(25)01293-0",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Different antidepressants have clinically significant variations in their metabolic and cardiovascular side effects."
    },
    {
      "id": "20c2c59f2e7d",
      "title": "Serial Ketamine Infusions as Adjunctive Therapy to Inpatient Care for Depression: The KARMA-Dep 2 Randomized Clinical Trial.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117971",
      "abstract": "Serial ketamine infusions are being increasingly adopted as off-label treatment for major depression in routine clinical practice, yet robust psychoactive placebo-controlled trial evidence for short- and long-term efficacy and safety remains limited. To assess antidepressant efficacy, safety, tolerability, cost-effectiveness, and quality of life during and after serial ketamine infusions compared with midazolam as an adjunct to usual inpatient care. The KARMA-Dep 2 trial was an investigator-led, double-blind, randomized, midazolam-controlled, pragmatic trial conducted at an academic center in Ireland between September 2021 and August 2024. Participants included adults (≥18 years) hospitalized with a DSM-5 major depressive episode (unipolar or bipolar) and baseline Montgomery-Åsberg Depression Rating Scale (MADRS) score ≥20. Participants were randomized 1:1 to receive up to 8 twice-weekly intravenous infusions of either ketamine (0.5 mg/kg) or midazolam (0.045 mg/kg) as an adjunct to usual-care pharmacotherapy and other aspects of routine inpatient psychiatric care. Participants were followed up for 6 months. The primary outcome was change in depression symptom severity measured by the observer-rated MADRS score from baseline to end of treatment. Secondary outcomes included self-reported depression severity, safety, tolerability, health care costs, and quality of life. Of 65 randomized participants (mean [SD] age, 53.5 [18.6] years; 37 [59.7%] male), 62 were included in the final analysis. In the analysis of primary outcome, end-of-treatment MADRS scores did not significantly differ between the ketamine and midazolam groups (adjusted mean difference, -3.16 points, 95% CI, -8.54 to 2.22; P = .25; Cohen d, -0.29). Similarly, there was no significant between-group difference between Quick Inventory of Depressive Symptoms, Self-Report, scores (adjusted mean difference, -0.002; 95% CI, -2.71 to 2.71; P > .99; Cohen d, -0.0004). There were no significant between-group differences on other secondary outcomes, including cognition, cost-effectiveness, or quality of life. Most patients and raters accurately guessed treatment allocation. Serial adjunctive ketamine infusions were not more effective than serial midazolam infusions in reducing depressive symptoms in inpatients receiving usual psychiatric care. ClinicalTrials.gov Identifier: NCT04939649.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Serial ketamine infusions are being increasingly adopted as off-label treatment for major depression in routine clinical practice, yet robust psychoactive placebo-controlled trial evidence for short- and long-term efficacy and safety remains limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess antidepressant efficacy, safety, tolerability, cost-effectiveness, and quality of life during and after serial ketamine infusions compared with midazolam as an adjunct to usual inpatient care."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The KARMA-Dep 2 trial was an investigator-led, double-blind, randomized, midazolam-controlled, pragmatic trial conducted at an academic center in Ireland between September 2021 and August 2024. Participants included adults (≥18 years) hospitalized with a DSM-5 major depressive episode (unipolar or bipolar) and baseline Montgomery-Åsberg Depression Rating Scale (MADRS) score ≥20."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1 to receive up to 8 twice-weekly intravenous infusions of either ketamine (0.5 mg/kg) or midazolam (0.045 mg/kg) as an adjunct to usual-care pharmacotherapy and other aspects of routine inpatient psychiatric care. Participants were followed up for 6 months."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was change in depression symptom severity measured by the observer-rated MADRS score from baseline to end of treatment. Secondary outcomes included self-reported depression severity, safety, tolerability, health care costs, and quality of life."
        },
        {
          "label": "RESULTS",
          "text": "Of 65 randomized participants (mean [SD] age, 53.5 [18.6] years; 37 [59.7%] male), 62 were included in the final analysis. In the analysis of primary outcome, end-of-treatment MADRS scores did not significantly differ between the ketamine and midazolam groups (adjusted mean difference, -3.16 points, 95% CI, -8.54 to 2.22; P = .25; Cohen d, -0.29). Similarly, there was no significant between-group difference between Quick Inventory of Depressive Symptoms, Self-Report, scores (adjusted mean difference, -0.002; 95% CI, -2.71 to 2.71; P > .99; Cohen d, -0.0004). There were no significant between-group differences on other secondary outcomes, including cognition, cost-effectiveness, or quality of life. Most patients and raters accurately guessed treatment allocation."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Serial adjunctive ketamine infusions were not more effective than serial midazolam infusions in reducing depressive symptoms in inpatients receiving usual psychiatric care."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04939649."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123905/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1001/jamapsychiatry.2025.3019",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Ketamine infusions did not outperform midazolam infusions in alleviating depressive symptoms in hospitalized psychiatric patients."
    },
    {
      "id": "3758ce7ed7b9",
      "title": "Twice-Daily Clopidogrel vs Ticagrelor to Reduce Short-Term Major Adverse Cardiovascular Events After Primary Percutaneous Coronary Intervention: The TADCLOT Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117957",
      "abstract": "The first month postprimary percutaneous coronary intervention (PCI) for ST-segment elevation myocardial infarction (STEMI) is the highest risk period for major adverse cardiovascular events (MACEs), including stent thrombosis. Ticagrelor and double-dose clopidogrel are effective antiplatelet therapies, but no head-to-head comparison exists in this setting. The authors sought to evaluate the efficacy of ticagrelor over twice-daily clopidogrel in reducing MACE events within the first 1 month postprimary PCI. TADCLOT (Twice-A-Day CLOpidogrel vs Ticagrelor), a double-blind, randomized superiority trial at the National Institute of Cardiovascular Diseases, Karachi, Pakistan (February 19, 2024 to January 30, 2025), randomized 2,201 patients with STEMI within 24 hours of primary PCI 1:1 to ticagrelor (180-mg loading dose, 90 mg twice a day) or twice-daily clopidogrel (600-mg loading dose, 75 mg twice a day) for 1 month. The primary endpoint was MACEs (death, myocardial infarction, stent thrombosis, stroke, or target lesion revascularization) at 1 month, analyzed by intention to treat. Secondary endpoints were individual MACE components and clinically significant bleeding (Bleeding Academic Research Consortium [BARC] type 2, 3, or 5). Among 2,201 randomized patients, MACEs occurred in 24 (2.2%) ticagrelor patients vs 32 (2.9%) in twice-daily clopidogrel patients (HR: 0.75; 95% CI: 0.44-1.27; P = 0.28; absolute risk difference: -0.7%; 95% CI: -2.05 to 0.60). Cardiovascular death or definite stent thrombosis occurred in 21 (1.9%) vs 27 (2.5%) patients (HR: 0.77; 95% CI: 0.44-1.37). Clinically significant bleeding (BARC type 2, 3, or 5) occurred in 6 patients (0.5%) with ticagrelor vs 4 (0.4%) with clopidogrel (HR: 1.50; 95% CI: 0.42-5.31). Major bleeding (BARC type 3 or 5) was infrequent and similar between the groups: 3 patients (0.3%) in the ticagrelor arm and 2 (0.2%) in the clopidogrel arm (HR: 1.50; 95% CI: 0.25-8.97). At both 7 (HR: 0.15; 95% CI: 0.04-0.5; P = 0.002) and 14 days (HR: 0.46; 95% CI: 0.23-0.91; P = 0.02), MACEs were significantly lower with ticagrelor compared with twice-daily clopidogrel, although these differences were no longer statistically significant at 30 days. Ticagrelor was not superior to twice-daily clopidogrel in reducing MACEs at 1 month after primary PCI, and bleeding rates were similar. However, event rates were lower than anticipated, and ticagrelor significantly reduced MACEs within the first 2 weeks compared with twice-daily clopidogrel. (TADCLOT-a Double Blind Randomized Controlled Trial [TADCLOT]; NCT06318481).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The first month postprimary percutaneous coronary intervention (PCI) for ST-segment elevation myocardial infarction (STEMI) is the highest risk period for major adverse cardiovascular events (MACEs), including stent thrombosis. Ticagrelor and double-dose clopidogrel are effective antiplatelet therapies, but no head-to-head comparison exists in this setting."
        },
        {
          "label": "OBJECTIVES",
          "text": "The authors sought to evaluate the efficacy of ticagrelor over twice-daily clopidogrel in reducing MACE events within the first 1 month postprimary PCI."
        },
        {
          "label": "METHODS",
          "text": "TADCLOT (Twice-A-Day CLOpidogrel vs Ticagrelor), a double-blind, randomized superiority trial at the National Institute of Cardiovascular Diseases, Karachi, Pakistan (February 19, 2024 to January 30, 2025), randomized 2,201 patients with STEMI within 24 hours of primary PCI 1:1 to ticagrelor (180-mg loading dose, 90 mg twice a day) or twice-daily clopidogrel (600-mg loading dose, 75 mg twice a day) for 1 month. The primary endpoint was MACEs (death, myocardial infarction, stent thrombosis, stroke, or target lesion revascularization) at 1 month, analyzed by intention to treat. Secondary endpoints were individual MACE components and clinically significant bleeding (Bleeding Academic Research Consortium [BARC] type 2, 3, or 5)."
        },
        {
          "label": "RESULTS",
          "text": "Among 2,201 randomized patients, MACEs occurred in 24 (2.2%) ticagrelor patients vs 32 (2.9%) in twice-daily clopidogrel patients (HR: 0.75; 95% CI: 0.44-1.27; P = 0.28; absolute risk difference: -0.7%; 95% CI: -2.05 to 0.60). Cardiovascular death or definite stent thrombosis occurred in 21 (1.9%) vs 27 (2.5%) patients (HR: 0.77; 95% CI: 0.44-1.37). Clinically significant bleeding (BARC type 2, 3, or 5) occurred in 6 patients (0.5%) with ticagrelor vs 4 (0.4%) with clopidogrel (HR: 1.50; 95% CI: 0.42-5.31). Major bleeding (BARC type 3 or 5) was infrequent and similar between the groups: 3 patients (0.3%) in the ticagrelor arm and 2 (0.2%) in the clopidogrel arm (HR: 1.50; 95% CI: 0.25-8.97). At both 7 (HR: 0.15; 95% CI: 0.04-0.5; P = 0.002) and 14 days (HR: 0.46; 95% CI: 0.23-0.91; P = 0.02), MACEs were significantly lower with ticagrelor compared with twice-daily clopidogrel, although these differences were no longer statistically significant at 30 days."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ticagrelor was not superior to twice-daily clopidogrel in reducing MACEs at 1 month after primary PCI, and bleeding rates were similar. However, event rates were lower than anticipated, and ticagrelor significantly reduced MACEs within the first 2 weeks compared with twice-daily clopidogrel. (TADCLOT-a Double Blind Randomized Controlled Trial [TADCLOT]; NCT06318481)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892606/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1016/j.jacc.2025.08.041",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Ticagrelor did not outperform twice-daily clopidogrel in reducing major adverse cardiovascular events (MACEs) at one month, though it showed early benefit within the first two weeks."
    },
    {
      "id": "3a4f1670ead2",
      "title": "Effects of empagliflozin on conventional and exploratory acute and chronic kidney outcomes: an individual participant-level meta-analysis.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117954",
      "abstract": "Uncertainty remains about effects of sodium-glucose co-transporter-2 (SGLT2) inhibition on kidney outcomes in individuals with slowly progressive chronic kidney disease (eg, low albuminuria) and those at risk of large acute estimated glomerular filtration rate (eGFR) dips on initiation of such treatment. We aimed to explore the effects of empagliflozin on a range of kidney outcomes in these population subtypes. In this meta-analysis, we used individual-level data from 23 340 participants in four large placebo-controlled trials (EMPA-REG OUTCOME, EMPEROR-Reduced, EMPEROR-Preserved, and EMPA-KIDNEY) to assess the effects of empagliflozin on conventional and exploratory acute and chronic kidney outcomes. We then assessed whether effects varied by predicted size of the acute eGFR dip on treatment initiation or among other key population subtypes using tests for heterogeneity and trend. The individual-level data were requested from Boehringer Ingelheim (Ingelheim, Germany). Compared with placebo, allocation to empagliflozin reduced the risk of a marker of acute kidney injury (a ≥50% increase in serum creatinine in consecutive follow-up samples) by 20% (hazard ratio 0·80 [95% CI 0·72-0·88]; 1573 outcomes), acute kidney injury adverse events by 27% (0·73 [0·63-0·85]; 694 outcomes), a categorical chronic kidney disease progression outcome by 30% (0·70 [0·63-0·78]; 1403 outcomes), and kidney failure by 34% (0·66 [0·55-0·79]; 490 outcomes). Empagliflozin slowed a chronic annual rate of eGFR decline by 64% (95% CI 59-69) and off-treatment dip-free slope-a post-hoc outcome using randomisation and off-treatment eGFR values available in a subset of 10 630 participants-by 64% (54-73). These kidney benefits were similar in subgroups divided by predicted size of acute eGFR dip, and were present irrespective of diabetes or heart failure status, level of kidney function, or albuminuria. SGLT2 inhibition reduces risk of acute and chronic kidney outcomes irrespective of the size of the acute dip in eGFR. Kidney benefits are evident irrespective of diabetes status, heart failure status, primary cause of kidney disease, and markers of severity of these diseases. None.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Uncertainty remains about effects of sodium-glucose co-transporter-2 (SGLT2) inhibition on kidney outcomes in individuals with slowly progressive chronic kidney disease (eg, low albuminuria) and those at risk of large acute estimated glomerular filtration rate (eGFR) dips on initiation of such treatment. We aimed to explore the effects of empagliflozin on a range of kidney outcomes in these population subtypes."
        },
        {
          "label": "METHODS",
          "text": "In this meta-analysis, we used individual-level data from 23 340 participants in four large placebo-controlled trials (EMPA-REG OUTCOME, EMPEROR-Reduced, EMPEROR-Preserved, and EMPA-KIDNEY) to assess the effects of empagliflozin on conventional and exploratory acute and chronic kidney outcomes. We then assessed whether effects varied by predicted size of the acute eGFR dip on treatment initiation or among other key population subtypes using tests for heterogeneity and trend. The individual-level data were requested from Boehringer Ingelheim (Ingelheim, Germany)."
        },
        {
          "label": "FINDINGS",
          "text": "Compared with placebo, allocation to empagliflozin reduced the risk of a marker of acute kidney injury (a ≥50% increase in serum creatinine in consecutive follow-up samples) by 20% (hazard ratio 0·80 [95% CI 0·72-0·88]; 1573 outcomes), acute kidney injury adverse events by 27% (0·73 [0·63-0·85]; 694 outcomes), a categorical chronic kidney disease progression outcome by 30% (0·70 [0·63-0·78]; 1403 outcomes), and kidney failure by 34% (0·66 [0·55-0·79]; 490 outcomes). Empagliflozin slowed a chronic annual rate of eGFR decline by 64% (95% CI 59-69) and off-treatment dip-free slope-a post-hoc outcome using randomisation and off-treatment eGFR values available in a subset of 10 630 participants-by 64% (54-73). These kidney benefits were similar in subgroups divided by predicted size of acute eGFR dip, and were present irrespective of diabetes or heart failure status, level of kidney function, or albuminuria."
        },
        {
          "label": "INTERPRETATION",
          "text": "SGLT2 inhibition reduces risk of acute and chronic kidney outcomes irrespective of the size of the acute dip in eGFR. Kidney benefits are evident irrespective of diabetes status, heart failure status, primary cause of kidney disease, and markers of severity of these diseases."
        },
        {
          "label": "FUNDING",
          "text": "None."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41082889/",
      "pubDate": "2025 Oct 10",
      "doi": "10.1016/S2213-8587(25)00222-0",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Empagliflozin, an SGLT2 inhibitor, significantly reduced the risk of acute kidney injury, chronic kidney disease progression, and kidney failure, and slowed the decline of kidney function, regardless of the predicted size of the initial eGFR dip."
    },
    {
      "id": "3b356947d2e0",
      "title": "Supervised exercise and pelvic floor muscle training eases current pelvic and genital pain but not worst pelvic and genital pain in women with endometriosis: a randomised trial.",
      "journal": "J Physiother",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117793",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false
    },
    {
      "id": "49535c2e8177",
      "title": "Pragmatic Comparative Effectiveness of Primary Care Treatments for Posttraumatic Stress Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117961",
      "abstract": "There have only been 3 efficacy trials reporting head-to-head comparisons of pharmacotherapy and trauma-focused psychotherapy for posttraumatic stress disorder (PTSD), and none were conducted in primary care. In addition, few trials have examined treatment sequences for patients not responding to an initial treatment. To test the hypothesis that (1) brief trauma-focused psychotherapy (written exposure therapy [WET]) is more effective than a choice of 3 selective serotonin reuptake inhibitors (SSRIs; ie, sertraline, fluoxetine, or paroxetine) and (2) WET augmentation is more effective than switching to the serotonin-norepinephrine reuptake inhibitor (SNRI) venlafaxine for those not responding to an SSRI. This was a pragmatic comparative effectiveness trial conducted from April 2021 to June 2024 that randomized primary care patients to 1 of 3 treatment sequences: (1) SSRI followed by WET augmentation, (2) SSRI followed by switch to SNRI, or (3) WET followed by SSRI. Effectiveness in this pragmatic trial depends on treatment engagement and treatment fidelity. The study included patients meeting clinical criteria for PTSD from primary care clinics of 7 federally qualified health centers and 8 Department of Veterans Affairs medical centers. SSRI followed by WET augmentation, SSRI followed by switch to SNRI, or WET followed by SSRI. PTSD symptom severity, as measured by the DSM-5 PTSD Checklist (PCL-5). A total of 700 patients (mean [SD] age, 45.1 [15.4] years; 368 men [62.1%]). The mean (SD) baseline PCL-5 score was 52.8 (11.1), indicating considerable symptom severity. At 4 months, 144 of 278 patients (51.8%) randomized to an SSRI were adherent and reported a 14.0-point PCL-5 decrease, whereas 11 of 352 patients (31.5%) randomized to WET completed all sessions and reported a 12.1-point decrease. There was no significant between-group difference (adjusted mean difference [MD], 1.79; 95% CI, -0.76 to 4.34; P = .17). For the 122 of 295 patients (41.4%) randomized to an SSRI who did not respond to treatment, those randomized to switch to the SNRI reported a 9.2-point PCL-5 decrease compared with a 2.3-point decrease for those randomized to WET augmentation, which was a statistically significant between-group difference (adjusted MD, 10.19; 95% CI, 4.97-15.41; P < .001). Study results showed that treatment of PTSD in primary care with either SSRIs or WET was feasible and effective. For patients not responding to an SSRI, switching to an SNRI may be more effective than WET augmentation. ClinicalTrials.gov Identifier: NCT04597190.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There have only been 3 efficacy trials reporting head-to-head comparisons of pharmacotherapy and trauma-focused psychotherapy for posttraumatic stress disorder (PTSD), and none were conducted in primary care. In addition, few trials have examined treatment sequences for patients not responding to an initial treatment."
        },
        {
          "label": "OBJECTIVE",
          "text": "To test the hypothesis that (1) brief trauma-focused psychotherapy (written exposure therapy [WET]) is more effective than a choice of 3 selective serotonin reuptake inhibitors (SSRIs; ie, sertraline, fluoxetine, or paroxetine) and (2) WET augmentation is more effective than switching to the serotonin-norepinephrine reuptake inhibitor (SNRI) venlafaxine for those not responding to an SSRI."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a pragmatic comparative effectiveness trial conducted from April 2021 to June 2024 that randomized primary care patients to 1 of 3 treatment sequences: (1) SSRI followed by WET augmentation, (2) SSRI followed by switch to SNRI, or (3) WET followed by SSRI. Effectiveness in this pragmatic trial depends on treatment engagement and treatment fidelity. The study included patients meeting clinical criteria for PTSD from primary care clinics of 7 federally qualified health centers and 8 Department of Veterans Affairs medical centers."
        },
        {
          "label": "INTERVENTIONS",
          "text": "SSRI followed by WET augmentation, SSRI followed by switch to SNRI, or WET followed by SSRI."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "PTSD symptom severity, as measured by the DSM-5 PTSD Checklist (PCL-5)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 700 patients (mean [SD] age, 45.1 [15.4] years; 368 men [62.1%]). The mean (SD) baseline PCL-5 score was 52.8 (11.1), indicating considerable symptom severity. At 4 months, 144 of 278 patients (51.8%) randomized to an SSRI were adherent and reported a 14.0-point PCL-5 decrease, whereas 11 of 352 patients (31.5%) randomized to WET completed all sessions and reported a 12.1-point decrease. There was no significant between-group difference (adjusted mean difference [MD], 1.79; 95% CI, -0.76 to 4.34; P = .17). For the 122 of 295 patients (41.4%) randomized to an SSRI who did not respond to treatment, those randomized to switch to the SNRI reported a 9.2-point PCL-5 decrease compared with a 2.3-point decrease for those randomized to WET augmentation, which was a statistically significant between-group difference (adjusted MD, 10.19; 95% CI, 4.97-15.41; P < .001)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Study results showed that treatment of PTSD in primary care with either SSRIs or WET was feasible and effective. For patients not responding to an SSRI, switching to an SNRI may be more effective than WET augmentation."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04597190."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41091477/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1001/jamapsychiatry.2025.2962",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Both SSRIs and WET are viable treatments for PTSD in primary care, and switching to an SNRI may be more effective than adding WET for those who don't respond to an SSRI."
    },
    {
      "id": "da9abad01010",
      "title": "Histological efficacy of anti-diabetic agents in MASH and the mediating role of weight loss: A network meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117924",
      "abstract": "Metabolic dysfunction-associated steatohepatitis (MASH) is a progressive liver disease with rising global prevalence, closely linked to type 2 diabetes. While several anti-diabetic agents show promise, a comprehensive analysis comparing their efficacy on biopsy-confirmed histological outcomes, including dose-dependent effects and the mediating role of weight loss, remains unexplored. A frequentist random-effects network meta-analysis (NMA) was conducted to explore histological efficacy of anti-diabetic agents in biopsy-confirmed MASH without cirrhosis. The primary outcome was fibrosis improvement (≥1 stage) without worsening steatohepatitis; the secondary outcome was MASH resolution without fibrosis worsening. Incretin-based agents were dose-stratified. Treatment ranking used surface-under the cumulative-ranking curve (SUCRA). Meta-regression investigated the impact of percentage weight loss and baseline covariates on the proportion of individuals achieving histological end-points. Data from five RCTs (N = 1667) were included. All active treatments, including Dapagliflozin 10 mg, Survodutide (2.4 mg/wk, 4.8-6 mg/wk), Tirzepatide (5 mg/wk, 10-15 mg/wk), and Semaglutide (0.7-1.4 mg/wk, 2.4 or 2.8 mg/wk), improved fibrosis versus placebo (I = 0%). For MASH resolution, dose-dependent effects led to significant heterogeneity (I = 73%), with lower-dose Semaglutide demonstrating no benefits and Dapagliflozin showing benefits in the F2-F3 subgroup only on sensitivity analysis. Survodutide exhibited the highest ranking (SUCRA = 0.822-0.849), followed by Tirzepatide (SUCRA = 0.622-0.681) and higher-dose Semaglutide (SUCRA = 0.327) for MASH resolution. Meta-regression using data from 16 interventions, including placebo arms, showed that weight loss significantly explained heterogeneity in treatment effects on fibrosis improvement (R = 54.26%) and MASH resolution (R = 78.16%). SGLT2 inhibitor and incretin-based agents improved fibrosis in MASH, with weight loss being a significant mediator. Targeting multiple incretin pathways, especially involving glucagon receptors, may offer greater MASH resolution. Dose-dependent effects were more prominent for MASH resolution than fibrosis improvement, indicating potential weight-loss-independent anti-fibrotic pathways.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Metabolic dysfunction-associated steatohepatitis (MASH) is a progressive liver disease with rising global prevalence, closely linked to type 2 diabetes. While several anti-diabetic agents show promise, a comprehensive analysis comparing their efficacy on biopsy-confirmed histological outcomes, including dose-dependent effects and the mediating role of weight loss, remains unexplored."
        },
        {
          "label": "METHODS",
          "text": "A frequentist random-effects network meta-analysis (NMA) was conducted to explore histological efficacy of anti-diabetic agents in biopsy-confirmed MASH without cirrhosis. The primary outcome was fibrosis improvement (≥1 stage) without worsening steatohepatitis; the secondary outcome was MASH resolution without fibrosis worsening. Incretin-based agents were dose-stratified. Treatment ranking used surface-under the cumulative-ranking curve (SUCRA). Meta-regression investigated the impact of percentage weight loss and baseline covariates on the proportion of individuals achieving histological end-points."
        },
        {
          "label": "RESULTS",
          "text": "Data from five RCTs (N = 1667) were included. All active treatments, including Dapagliflozin 10 mg, Survodutide (2.4 mg/wk, 4.8-6 mg/wk), Tirzepatide (5 mg/wk, 10-15 mg/wk), and Semaglutide (0.7-1.4 mg/wk, 2.4 or 2.8 mg/wk), improved fibrosis versus placebo (I = 0%). For MASH resolution, dose-dependent effects led to significant heterogeneity (I = 73%), with lower-dose Semaglutide demonstrating no benefits and Dapagliflozin showing benefits in the F2-F3 subgroup only on sensitivity analysis. Survodutide exhibited the highest ranking (SUCRA = 0.822-0.849), followed by Tirzepatide (SUCRA = 0.622-0.681) and higher-dose Semaglutide (SUCRA = 0.327) for MASH resolution. Meta-regression using data from 16 interventions, including placebo arms, showed that weight loss significantly explained heterogeneity in treatment effects on fibrosis improvement (R = 54.26%) and MASH resolution (R = 78.16%)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "SGLT2 inhibitor and incretin-based agents improved fibrosis in MASH, with weight loss being a significant mediator. Targeting multiple incretin pathways, especially involving glucagon receptors, may offer greater MASH resolution. Dose-dependent effects were more prominent for MASH resolution than fibrosis improvement, indicating potential weight-loss-independent anti-fibrotic pathways."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41063381/",
      "pubDate": "2025 Oct 08",
      "doi": "10.1111/dom.70187",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "SGLT2 inhibitors and incretin-based therapies improved liver fibrosis in metabolic-associated steatohepatitis (MASH), with weight loss playing a key role, and targeting multiple incretin pathways, particularly glucagon receptors, may enhance disease resolution."
    },
    {
      "id": "da937bd8fe43",
      "title": "Anthropometric Measures, Cardiovascular Outcomes, and Treatment Effects of Finerenone in Cardiovascular-Kidney-Metabolic Disease: Pooled Participant-Level Analysis of 3 Global Trials.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117919",
      "abstract": "Obesity is a core pathophysiologic contributor to cardiovascular, kidney, and metabolic (CKM) conditions. However, the association between different adiposity-related anthropometrics and cardiovascular outcomes in persons with CKM conditions has not been rigorously explored. In this study, the authors sought to examine cardiovascular outcomes and treatment effects of finerenone according to different adiposity-related anthropometrics. In this prespecified participant-level pooled analysis of FIDELIO-DKD, FIGARO-DKD, and FINEARTS-HF (FINE-HEART), cardiovascular outcomes and treatment effects of finerenone according to baseline body mass index (BMI), waist circumference (WC), waist-height ratio (WHtR), and waist-hip ratio (WHR) were evaluated with the use of multivariable-adjusted Cox proportional hazards regression and Poisson regression. Of 18,759 participants with available data for all anthropometrics, 52% had a BMI ≥30 kg/m and 98% had any excess adiposity. Among those with BMI <30 kg/m, 95% had increased abdominal adiposity, especially women and older individuals. Higher BMI, WC, WHtR, and WHR were each significantly associated with a wide range of cardiovascular outcomes, including cardiovascular death or heart failure (HF) hospitalization and its individual components, major adverse cardiovascular events, new-onset atrial fibrillation, and incident HF hospitalization. BMI-adjusted WHtR and WHtR-adjusted BMI were each associated with a higher rate of cardiovascular death or HF hospitalization, and participants with elevated BMI and WHtR experienced a higher rate of cardiovascular death or HF hospitalization compared with those with elevated BMI or WHtR alone (P < 0.001). Benefits of finerenone on cardiovascular death or HF hospitalization were consistent regardless of baseline BMI (P = 0.27) or WHtR (P = 0.26), and absolute benefits appeared to be greater among participants with higher adiposity. Serious adverse events were less common with finerenone vs placebo, regardless of baseline BMI category (P = 0.08). These findings suggest that assessment of anthropometrics capturing abdominal adiposity, in addition to BMI, may enhance obesity identification and risk stratification among individuals with CKM conditions. Finerenone consistently reduced adverse cardiovascular outcomes across a wide range of adiposity. (FINE-HEART: An Integrated Pooled Analysis of Finerenone Across 3 Phase III Trials of Heart Failure and Chronic Kidney Disease and Type 2 Diabetes; CRD42024570467).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Obesity is a core pathophysiologic contributor to cardiovascular, kidney, and metabolic (CKM) conditions. However, the association between different adiposity-related anthropometrics and cardiovascular outcomes in persons with CKM conditions has not been rigorously explored."
        },
        {
          "label": "OBJECTIVES",
          "text": "In this study, the authors sought to examine cardiovascular outcomes and treatment effects of finerenone according to different adiposity-related anthropometrics."
        },
        {
          "label": "METHODS",
          "text": "In this prespecified participant-level pooled analysis of FIDELIO-DKD, FIGARO-DKD, and FINEARTS-HF (FINE-HEART), cardiovascular outcomes and treatment effects of finerenone according to baseline body mass index (BMI), waist circumference (WC), waist-height ratio (WHtR), and waist-hip ratio (WHR) were evaluated with the use of multivariable-adjusted Cox proportional hazards regression and Poisson regression."
        },
        {
          "label": "RESULTS",
          "text": "Of 18,759 participants with available data for all anthropometrics, 52% had a BMI ≥30 kg/m and 98% had any excess adiposity. Among those with BMI <30 kg/m, 95% had increased abdominal adiposity, especially women and older individuals. Higher BMI, WC, WHtR, and WHR were each significantly associated with a wide range of cardiovascular outcomes, including cardiovascular death or heart failure (HF) hospitalization and its individual components, major adverse cardiovascular events, new-onset atrial fibrillation, and incident HF hospitalization. BMI-adjusted WHtR and WHtR-adjusted BMI were each associated with a higher rate of cardiovascular death or HF hospitalization, and participants with elevated BMI and WHtR experienced a higher rate of cardiovascular death or HF hospitalization compared with those with elevated BMI or WHtR alone (P < 0.001). Benefits of finerenone on cardiovascular death or HF hospitalization were consistent regardless of baseline BMI (P = 0.27) or WHtR (P = 0.26), and absolute benefits appeared to be greater among participants with higher adiposity. Serious adverse events were less common with finerenone vs placebo, regardless of baseline BMI category (P = 0.08)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "These findings suggest that assessment of anthropometrics capturing abdominal adiposity, in addition to BMI, may enhance obesity identification and risk stratification among individuals with CKM conditions. Finerenone consistently reduced adverse cardiovascular outcomes across a wide range of adiposity. (FINE-HEART: An Integrated Pooled Analysis of Finerenone Across 3 Phase III Trials of Heart Failure and Chronic Kidney Disease and Type 2 Diabetes; CRD42024570467)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892605/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.039",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Assessing abdominal fat alongside BMI improves obesity detection and risk assessment in people with cardiorenal metabolic (CKM) conditions, and finerenone reduces cardiovascular risks regardless of adiposity."
    },
    {
      "id": "1ccf9e4ffbe3",
      "title": "Spinal cord stimulation plus conventional medical management versus conventional medical management alone for severe, non-surgical, refractory back pain: a randomized clinical trial followed by crossover.",
      "journal": "Reg Anesth Pain Med",
      "score": "5/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117869",
      "abstract": "Chronic low back pain is a major contributor to long-term disability. Many patients lack a clearly identifiable source for their pain on physical examination or imaging or present with multiple pain generators. This subset of patients, who do not have surgical pathology, relies on conservative medical management (CMM) in the absence of effective and lasting treatment alternatives. For those who fail to respond to CMM, spinal cord stimulation (SCS) should be considered as an effective adjunctive therapy for improving pain, disability and health-related quality of life. SOLIS is a prospective, multicenter trial that randomized patients with non-surgical, refractory back pain (with or without leg pain) to receive either SCS combined with CMM or CMM alone. The primary endpoint at 3 months compared the proportion of patients with ≥50% overall pain relief without an increase in mean daily opioid use between the SCS+CMM and CMM groups. Three months after treatment activation, patients initially randomized to receive CMM alone had the option to cross over and add SCS to their pain management regimen. Patients in both randomized groups underwent 12-month follow-up visits to assess long-term effects on pain relief, disability, health-related quality of life, global impression of change, and treatment satisfaction. 147 patients were randomized to SCS+CMM (n=79) or CMM alone (n=68). At the 3-month follow-up, 89.5% of patients who received SCS+CMM (including subperception and paresthesia-based programming modalities) and 8.1% who received CMM alone were classified as study responders (≥50% pain relief without an increase in mean daily opioid use; modified intention-to-treat analysis, p<0.0001). The level of disability due to low back pain improved significantly: the Oswestry Disability Index score decreased by -27.5±15.9 points in the SCS+CMM group versus -7.2±9.9 points in the CMM alone group (p<0.0001). Health-related quality of life also improved at 3 months: the EuroQol 5 Dimension 5 Level questionnaire index score increased by 0.247±0.164 points in the SCS+CMM group versus 0.031±0.151 points in the CMM alone group (p<0.0001). The benefits of SCS were sustained until the 12-month visit. Seven patients experienced serious adverse events related to SCS, including 5 (3.6%) implant site infections resulting in explant. SCS relieved pain and resulted in clinically significant improvements in functional disability and health-related quality of life in patients with non-surgical, refractory back pain with or without accompanying leg pain. NCT04676022.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Chronic low back pain is a major contributor to long-term disability. Many patients lack a clearly identifiable source for their pain on physical examination or imaging or present with multiple pain generators. This subset of patients, who do not have surgical pathology, relies on conservative medical management (CMM) in the absence of effective and lasting treatment alternatives. For those who fail to respond to CMM, spinal cord stimulation (SCS) should be considered as an effective adjunctive therapy for improving pain, disability and health-related quality of life."
        },
        {
          "label": "METHODS",
          "text": "SOLIS is a prospective, multicenter trial that randomized patients with non-surgical, refractory back pain (with or without leg pain) to receive either SCS combined with CMM or CMM alone. The primary endpoint at 3 months compared the proportion of patients with ≥50% overall pain relief without an increase in mean daily opioid use between the SCS+CMM and CMM groups. Three months after treatment activation, patients initially randomized to receive CMM alone had the option to cross over and add SCS to their pain management regimen. Patients in both randomized groups underwent 12-month follow-up visits to assess long-term effects on pain relief, disability, health-related quality of life, global impression of change, and treatment satisfaction."
        },
        {
          "label": "RESULTS",
          "text": "147 patients were randomized to SCS+CMM (n=79) or CMM alone (n=68). At the 3-month follow-up, 89.5% of patients who received SCS+CMM (including subperception and paresthesia-based programming modalities) and 8.1% who received CMM alone were classified as study responders (≥50% pain relief without an increase in mean daily opioid use; modified intention-to-treat analysis, p<0.0001). The level of disability due to low back pain improved significantly: the Oswestry Disability Index score decreased by -27.5±15.9 points in the SCS+CMM group versus -7.2±9.9 points in the CMM alone group (p<0.0001). Health-related quality of life also improved at 3 months: the EuroQol 5 Dimension 5 Level questionnaire index score increased by 0.247±0.164 points in the SCS+CMM group versus 0.031±0.151 points in the CMM alone group (p<0.0001). The benefits of SCS were sustained until the 12-month visit. Seven patients experienced serious adverse events related to SCS, including 5 (3.6%) implant site infections resulting in explant."
        },
        {
          "label": "CONCLUSION",
          "text": "SCS relieved pain and resulted in clinically significant improvements in functional disability and health-related quality of life in patients with non-surgical, refractory back pain with or without accompanying leg pain."
        },
        {
          "label": "TRIAL REGISTRATION NUMBER",
          "text": "NCT04676022."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41047246/",
      "pubDate": "2025 Oct 05",
      "doi": "10.1136/rapm-2024-106335",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Spinal cord stimulation (SCS) effectively reduced pain and improved function and quality of life in patients with chronic back pain that didn't respond to other treatments."
    },
    {
      "id": "a24dcadc34d1",
      "title": "Effectiveness and safety of assisted vaginal birth and second-stage cesarean section: a systematic review and meta-analysis of real-world contemporary data.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117858",
      "abstract": "To synthesize evidence on the effectiveness of different instruments for assisted vaginal birth and to assess the prevalence of maternal and neonatal adverse outcomes associated with assisted vaginal birth and second-stage cesarean section. A comprehensive search was conducted in Cochrane, Embase, and MEDLINE to identify randomized controlled trials and cross-sectional and cohort studies published between January 2001 and December 2023. Studies published in English, Spanish, French, or Italian with >30 participants, conducted in any type of healthcare facility, and reporting operative procedures in the second stage of labor were eligible if they included at least one outcome of interest for women undergoing assisted vaginal birth and/or second-stage cesarean section. Two independent reviewers conducted study selection, data extraction, and quality assessment. Meta-analyses of proportions were performed using random-effects models, and heterogeneity was assessed using the I statistic. A total of 241 studies, involving 751,242 participants, were included, of which 231 were observational and 10 randomized controlled trials. Prevalence estimates for assisted vaginal birth failure and adverse outcomes varied widely. Vacuum extraction had a significantly higher failure rate than forceps (7.60% vs 3.26%, P<.01), but a lower prevalence of obstetric anal sphincter injury (4.73% vs 7.99%, P<.01). Spatula use was associated with a lower prevalence of neonatal cephalohematoma compared to vacuum extraction (0.73% vs 5.45%, P<.01) and forceps (0.73% vs 3.54%, P<.01), but a higher prevalence of postpartum hemorrhage compared to vacuum extraction (10.77% vs 5.46%, P<.0001). Compared to assisted vaginal birth, second-stage cesarean section was associated with significantly higher rates of neonatal intensive care unit admission (17.18% vs 6.64% forceps, 6.07% vacuum extraction, P<.001), low Apgar scores (6.01% vs 2.43% forceps, 2.05% vacuum extraction, P<.01), skull fractures (1.54% vs 0.27% for both, P<.05), and neonatal death (1.95% vs 0.31% for both, P<.01). Contemporary data reveal wide variability in the prevalence of failed assisted vaginal birth and adverse maternal and neonatal outcomes following operative delivery in the second stage of labor. While assisted vaginal birth carries specific risks, it may offer advantages over emergency second-stage cesarean section, particularly regarding neonatal outcomes.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To synthesize evidence on the effectiveness of different instruments for assisted vaginal birth and to assess the prevalence of maternal and neonatal adverse outcomes associated with assisted vaginal birth and second-stage cesarean section."
        },
        {
          "label": "DATA SOURCES",
          "text": "A comprehensive search was conducted in Cochrane, Embase, and MEDLINE to identify randomized controlled trials and cross-sectional and cohort studies published between January 2001 and December 2023."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Studies published in English, Spanish, French, or Italian with >30 participants, conducted in any type of healthcare facility, and reporting operative procedures in the second stage of labor were eligible if they included at least one outcome of interest for women undergoing assisted vaginal birth and/or second-stage cesarean section."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Two independent reviewers conducted study selection, data extraction, and quality assessment. Meta-analyses of proportions were performed using random-effects models, and heterogeneity was assessed using the I statistic."
        },
        {
          "label": "RESULTS",
          "text": "A total of 241 studies, involving 751,242 participants, were included, of which 231 were observational and 10 randomized controlled trials. Prevalence estimates for assisted vaginal birth failure and adverse outcomes varied widely. Vacuum extraction had a significantly higher failure rate than forceps (7.60% vs 3.26%, P<.01), but a lower prevalence of obstetric anal sphincter injury (4.73% vs 7.99%, P<.01). Spatula use was associated with a lower prevalence of neonatal cephalohematoma compared to vacuum extraction (0.73% vs 5.45%, P<.01) and forceps (0.73% vs 3.54%, P<.01), but a higher prevalence of postpartum hemorrhage compared to vacuum extraction (10.77% vs 5.46%, P<.0001). Compared to assisted vaginal birth, second-stage cesarean section was associated with significantly higher rates of neonatal intensive care unit admission (17.18% vs 6.64% forceps, 6.07% vacuum extraction, P<.001), low Apgar scores (6.01% vs 2.43% forceps, 2.05% vacuum extraction, P<.01), skull fractures (1.54% vs 0.27% for both, P<.05), and neonatal death (1.95% vs 0.31% for both, P<.01)."
        },
        {
          "label": "CONCLUSION",
          "text": "Contemporary data reveal wide variability in the prevalence of failed assisted vaginal birth and adverse maternal and neonatal outcomes following operative delivery in the second stage of labor. While assisted vaginal birth carries specific risks, it may offer advantages over emergency second-stage cesarean section, particularly regarding neonatal outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40947089/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1016/j.ajog.2025.09.022",
      "dateReceived": "2025-11-04T23:24:49.235Z",
      "isNew": false,
      "summary": "Assisted vaginal birth has variable failure rates and risks, but may lead to better neonatal outcomes compared to emergency cesarean section in the second stage of labor."
    },
    {
      "id": "9ff97cc77277",
      "title": "European Study of Prostate Cancer Screening - 23-Year Follow-up.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/118037",
      "abstract": "The European Randomized Study of Screening for Prostate Cancer (ERSPC) was initiated in 1993 to assess the effect of prostate-specific antigen (PSA) testing on prostate cancer mortality. Because deaths from prostate cancer are expected to rise worldwide owing to increased life expectancy and population growth, a final analysis of the long-term outcomes of prostate cancer screening is essential to understanding the benefits and harms of PSA testing. We updated the findings from ERSPC, a multicenter, randomized study conducted across eight European countries with a focus on a predefined core age group of 162,236 men who were 55 to 69 years of age at the time of randomization. Participants were randomly assigned to the screening group and offered repeated PSA testing or to the control group and not invited for screening. The primary outcome was prostate cancer mortality. After a median follow-up of 23 years, prostate cancer mortality was 13% lower in the screening group (rate ratio, 0.87; 95% confidence interval [CI], 0.80 to 0.95), and the absolute risk reduction was 0.22% (95% CI, 0.10 to 0.34). The cumulative incidence of prostate cancer was higher in the screening group than in the control group (rate ratio, 1.30; 95% CI, 1.26 to 1.33). At a median of 23 years of follow-up, one death from prostate cancer was prevented for every 456 men (95% CI, 306 to 943) who were invited for screening, and one death from prostate cancer was averted for every 12 men (95% CI, 8 to 26) in whom prostate cancer was diagnosed, as compared with one death from prostate cancer prevented for every 628 men (95% CI, 419 to 1481) and one death averted for every 18 men (95% CI, 12 to 45) at 16 years of follow-up. Long-term follow-up confirms a sustained reduction in deaths from prostate cancer with PSA testing, alongside an improved harm-benefit ratio. Future screening strategies should adopt risk-based approaches to minimize overdiagnosis while maintaining clinical benefits. (Funded by the Dutch Cancer Society and others; ERSPC ISRCTN registry number, ISRCTN49127736.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The European Randomized Study of Screening for Prostate Cancer (ERSPC) was initiated in 1993 to assess the effect of prostate-specific antigen (PSA) testing on prostate cancer mortality. Because deaths from prostate cancer are expected to rise worldwide owing to increased life expectancy and population growth, a final analysis of the long-term outcomes of prostate cancer screening is essential to understanding the benefits and harms of PSA testing."
        },
        {
          "label": "METHODS",
          "text": "We updated the findings from ERSPC, a multicenter, randomized study conducted across eight European countries with a focus on a predefined core age group of 162,236 men who were 55 to 69 years of age at the time of randomization. Participants were randomly assigned to the screening group and offered repeated PSA testing or to the control group and not invited for screening. The primary outcome was prostate cancer mortality."
        },
        {
          "label": "RESULTS",
          "text": "After a median follow-up of 23 years, prostate cancer mortality was 13% lower in the screening group (rate ratio, 0.87; 95% confidence interval [CI], 0.80 to 0.95), and the absolute risk reduction was 0.22% (95% CI, 0.10 to 0.34). The cumulative incidence of prostate cancer was higher in the screening group than in the control group (rate ratio, 1.30; 95% CI, 1.26 to 1.33). At a median of 23 years of follow-up, one death from prostate cancer was prevented for every 456 men (95% CI, 306 to 943) who were invited for screening, and one death from prostate cancer was averted for every 12 men (95% CI, 8 to 26) in whom prostate cancer was diagnosed, as compared with one death from prostate cancer prevented for every 628 men (95% CI, 419 to 1481) and one death averted for every 18 men (95% CI, 12 to 45) at 16 years of follow-up."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Long-term follow-up confirms a sustained reduction in deaths from prostate cancer with PSA testing, alongside an improved harm-benefit ratio. Future screening strategies should adopt risk-based approaches to minimize overdiagnosis while maintaining clinical benefits. (Funded by the Dutch Cancer Society and others; ERSPC ISRCTN registry number, ISRCTN49127736.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160819/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1056/NEJMoa2503223",
      "dateReceived": "2025-11-03T23:24:38.982Z",
      "isNew": false,
      "summary": "Long-term prostate-specific antigen (PSA) testing continues to reduce prostate cancer deaths with a favorable balance of benefits and harms, supporting risk-stratified screening approaches."
    },
    {
      "id": "92b781b2f32f",
      "title": "Extracorporeal Membrane Oxygenation Complications Are Not Causal for Mortality in Patients With Infarct-Related Cardiogenic Shock: A Mediation Analysis of the Extracorporeal Life Support in Infarct-Related Cardiogenic Shock (ECLS-SHOCK) Trial.",
      "journal": "Crit Care Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/118005",
      "abstract": "Recently published randomized controlled trials and an individual patient data meta-analysis showed that the routine use of venoarterial extracorporeal membrane oxygenation (VA-ECMO) did not reduce mortality compared with medical therapy alone in patients with acute myocardial infarction complicated by cardiogenic shock (AMI-CS). The objective of this study was to investigate whether possible VA-ECMO-related medical complications are associated with increased mortality risk, which might explain the observed equipoise among mortality outcomes between VA-ECMO and usual care. Sub-analysis of the randomized Extracorporeal Life Support in Infarct-Related Cardiogenic Shock (ECLS-SHOCK) trial. Multicenter, international randomized controlled trial across 44 centers specialized in treating AMI-CS. Adults patients with AMI-CS. Patients received either routine VA-ECMO support or medical therapy. The rate of complications and mortality as well as causes of death within 30 days. In total, 417 patients were included in this analysis. Moderate and severe bleeding as well as peripheral vascular complications requiring intervention were classified as possible VA-ECMO-related complications. A total of 88 patients (21.1%) developed possible VA-ECMO-related complications, which mostly occurred within five days after randomization and more frequently in the VA-ECMO group than in the control group: 49 (23.4%) vs. 20 (9.6%) patients, p < 0.001 for bleeding and 23 (11.0%) vs. 8 (3.8%) patients, p equals to 0.008 for peripheral vascular complications, respectively. Only four patients died from bleeding as the primary cause of death. Causal mediation analyses revealed no significant mediation effect of possible VA-ECMO-related complications on 30-day mortality. Logistic regression analyses of possible VA-ECMO-related complications confirmed no significant associations between the frequency of VA-ECMO-related complications and mortality. VA-ECMO use in patients with AMI-CS was associated with increased frequencies of moderate to severe bleeding as well as vascular complications warranting intervention. However, these possible VA-ECMO-related complications did not mediate an increased mortality risk. ClinicalTrials.gov, protocol: NCT03637205; August 2018.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Recently published randomized controlled trials and an individual patient data meta-analysis showed that the routine use of venoarterial extracorporeal membrane oxygenation (VA-ECMO) did not reduce mortality compared with medical therapy alone in patients with acute myocardial infarction complicated by cardiogenic shock (AMI-CS). The objective of this study was to investigate whether possible VA-ECMO-related medical complications are associated with increased mortality risk, which might explain the observed equipoise among mortality outcomes between VA-ECMO and usual care."
        },
        {
          "label": "DESIGN",
          "text": "Sub-analysis of the randomized Extracorporeal Life Support in Infarct-Related Cardiogenic Shock (ECLS-SHOCK) trial."
        },
        {
          "label": "SETTING",
          "text": "Multicenter, international randomized controlled trial across 44 centers specialized in treating AMI-CS."
        },
        {
          "label": "PATIENTS",
          "text": "Adults patients with AMI-CS."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients received either routine VA-ECMO support or medical therapy."
        },
        {
          "label": "MEASUREMENTS AND MAIN RESULTS",
          "text": "The rate of complications and mortality as well as causes of death within 30 days. In total, 417 patients were included in this analysis. Moderate and severe bleeding as well as peripheral vascular complications requiring intervention were classified as possible VA-ECMO-related complications. A total of 88 patients (21.1%) developed possible VA-ECMO-related complications, which mostly occurred within five days after randomization and more frequently in the VA-ECMO group than in the control group: 49 (23.4%) vs. 20 (9.6%) patients, p < 0.001 for bleeding and 23 (11.0%) vs. 8 (3.8%) patients, p equals to 0.008 for peripheral vascular complications, respectively. Only four patients died from bleeding as the primary cause of death. Causal mediation analyses revealed no significant mediation effect of possible VA-ECMO-related complications on 30-day mortality. Logistic regression analyses of possible VA-ECMO-related complications confirmed no significant associations between the frequency of VA-ECMO-related complications and mortality."
        },
        {
          "label": "CONCLUSIONS",
          "text": "VA-ECMO use in patients with AMI-CS was associated with increased frequencies of moderate to severe bleeding as well as vascular complications warranting intervention. However, these possible VA-ECMO-related complications did not mediate an increased mortality risk."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov, protocol: NCT03637205; August 2018."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41114622/",
      "pubDate": "2025 Oct 17",
      "doi": "10.1097/CCM.0000000000006893",
      "dateReceived": "2025-11-03T23:24:38.982Z",
      "isNew": false,
      "summary": "VA-ECMO in patients with AMI-CS increased bleeding and vascular complications requiring intervention, but did not increase the risk of death."
    },
    {
      "id": "f97d2469abaa",
      "title": "Optimal Antithrombotics for Ischemic Stroke and Concurrent Atrial Fibrillation and Atherosclerosis: A Randomized Clinical Trial.",
      "journal": "JAMA Neurol",
      "score": "6/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/117994",
      "abstract": "Patients with ischemic stroke and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease are at an elevated risk of recurrent ischemic events. Although combined anticoagulant and antiplatelet therapy may reduce ischemic risk, it also increases bleeding, and the optimal antithrombotic strategy remains uncertain. To determine whether adding an antiplatelet agent to anticoagulant therapy influences the net clinical benefit in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease. This multicenter, open-label randomized clinical trial was conducted at 41 sites across Japan from November 2016 to March 2025. Eligible patients had an ischemic stroke or transient ischemic attack within 8 to 360 days of onset, nonvalvular atrial fibrillation, and at least 1 manifestation of atherosclerotic cardiovascular disease (carotid or intracranial artery stenosis, noncardioembolic stroke, ischemic heart disease, or peripheral artery disease). Data were analyzed from April 16, 2024, to October 14, 2024. Patients were randomized to receive combination therapy (anticoagulant plus antiplatelet) or anticoagulant monotherapy. The primary outcome was a composite of ischemic cardiovascular events and major bleeding within 2 years. Secondary outcomes included ischemic cardiovascular events; safety outcomes included major and clinically relevant nonmajor bleeding. In total, 316 patients were randomized to combination therapy (n = 159) or monotherapy (n = 157) (mean [SD] age, 77.2 [7.4] years; 90 female patients [28.5%]). The trial was terminated on July 18, 2023, after an interim analysis for futility. The cumulative incidence of the primary outcome was 17.8% in the combination therapy group and 19.6% in the monotherapy group (hazard ratio [HR], 0.91; 95% CI, 0.53-1.55; P = .64). Ischemic cardiovascular events occurred in 11.1% and 14.2% (HR, 0.76; 95% CI, 0.39-1.48; P = .41), and major and clinically relevant nonmajor bleeding occurred in 19.5% and 8.6% (HR, 2.42; 95% CI, 1.23-4.76; P = .008) of combination therapy and monotherapy groups, respectively. In this randomized clinical trial, in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease, adding an antiplatelet agent to anticoagulant therapy provided no net clinical benefit over anticoagulant monotherapy, with higher bleeding risk. ClinicalTrials.gov Identifier: NCT03062319.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Patients with ischemic stroke and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease are at an elevated risk of recurrent ischemic events. Although combined anticoagulant and antiplatelet therapy may reduce ischemic risk, it also increases bleeding, and the optimal antithrombotic strategy remains uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether adding an antiplatelet agent to anticoagulant therapy influences the net clinical benefit in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This multicenter, open-label randomized clinical trial was conducted at 41 sites across Japan from November 2016 to March 2025. Eligible patients had an ischemic stroke or transient ischemic attack within 8 to 360 days of onset, nonvalvular atrial fibrillation, and at least 1 manifestation of atherosclerotic cardiovascular disease (carotid or intracranial artery stenosis, noncardioembolic stroke, ischemic heart disease, or peripheral artery disease). Data were analyzed from April 16, 2024, to October 14, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomized to receive combination therapy (anticoagulant plus antiplatelet) or anticoagulant monotherapy."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite of ischemic cardiovascular events and major bleeding within 2 years. Secondary outcomes included ischemic cardiovascular events; safety outcomes included major and clinically relevant nonmajor bleeding."
        },
        {
          "label": "RESULTS",
          "text": "In total, 316 patients were randomized to combination therapy (n = 159) or monotherapy (n = 157) (mean [SD] age, 77.2 [7.4] years; 90 female patients [28.5%]). The trial was terminated on July 18, 2023, after an interim analysis for futility. The cumulative incidence of the primary outcome was 17.8% in the combination therapy group and 19.6% in the monotherapy group (hazard ratio [HR], 0.91; 95% CI, 0.53-1.55; P = .64). Ischemic cardiovascular events occurred in 11.1% and 14.2% (HR, 0.76; 95% CI, 0.39-1.48; P = .41), and major and clinically relevant nonmajor bleeding occurred in 19.5% and 8.6% (HR, 2.42; 95% CI, 1.23-4.76; P = .008) of combination therapy and monotherapy groups, respectively."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease, adding an antiplatelet agent to anticoagulant therapy provided no net clinical benefit over anticoagulant monotherapy, with higher bleeding risk."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03062319."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41051787/",
      "pubDate": "2025 Oct 06",
      "doi": "10.1001/jamaneurol.2025.3662",
      "dateReceived": "2025-11-03T23:24:38.982Z",
      "isNew": false,
      "summary": "Adding an antiplatelet agent to anticoagulation for ischemic stroke or TIA patients with atrial fibrillation and atherosclerotic cardiovascular disease did not improve outcomes and increased bleeding risk."
    },
    {
      "id": "7332b591bd33",
      "title": "Sacubitril/Valsartan and Prevention of Cardiac Dysfunction During Adjuvant Breast Cancer Therapy: The PRADA II Randomized Clinical Trial.",
      "journal": "Circulation",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/117912",
      "abstract": "Anthracycline- and trastuzumab-associated cardiotoxicity may lead to cardiac dysfunction and dose reduction or halt of potentially life-saving adjuvant cancer therapy. Whether angiotensin receptor/neprilysin inhibitors can prevent cancer therapy-related cardiac dysfunction and injury remains to be established. PRADA II (Prevention of Cardiac Dysfunction During Adjuvant Breast Cancer Therapy) was a randomized, parallel-group, placebo-controlled, double-blind, multicenter trial conducted at 4 academic medical centers in Norway that evaluated the cardioprotective effect of sacubitril/valsartan versus placebo administered concomitantly with anthracycline-containing breast cancer therapy and continued for 18 months. The target dose was 97/103 mg BID. The primary outcome was change in left ventricular ejection fraction by cardiovascular magnetic resonance from prior to initiation of chemotherapy to 18 months thereafter. Secondary outcomes included change in echocardiographic global longitudinal strain, circulating cardiac troponins, and NT-proBNP (N-terminal pro-B-type natriuretic peptide). In total, 138 women (mean±SD age: 54.0±9.4 years) were randomized. The overall decline in left ventricular ejection fraction from baseline to 18 months was 2.2 percentage points (95% CI, 1.1 to 3.3) in the placebo group and 1.1 percentage points (95% CI, -0.01 to 2.2) in the sacubitril/valsartan group. The between-group difference was 1.1 percentage points (95% CI, -0.4 to 2.7; =0.16). Left ventricular global longitudinal strain was normal and remained stable in the sacubitril/valsartan group throughout the study (change from baseline to 18 months, -0.3 [95% CI, -0.80 to 0.2]). In contrast, there was a progressive decline in the placebo group (change from baseline to 18 months, 0.5 [95% CI, 0.05 to 1.0]). The between-group difference was -0.9 (95% CI, -1.5 to -0.2). The mean increases in NT-proBNP and cardiac troponin I concentrations from baseline to 18 months were greater in the placebo group than in the sacubitril/valsartan group (log difference, 0.3 [95% CI, 0.05 to 0.6] for NT-proBNP and 0.5 [95% CI, 0.1to 1.0] for cardiac troponin I). Anthracycline-based treatment for early breast cancer was associated with a reduction in left ventricular ejection fraction that was not significantly attenuated by sacubitril/valsartan. URL: https://www.clinicaltrials.gov; Unique identifier: NCT03760588.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Anthracycline- and trastuzumab-associated cardiotoxicity may lead to cardiac dysfunction and dose reduction or halt of potentially life-saving adjuvant cancer therapy. Whether angiotensin receptor/neprilysin inhibitors can prevent cancer therapy-related cardiac dysfunction and injury remains to be established."
        },
        {
          "label": "METHODS",
          "text": "PRADA II (Prevention of Cardiac Dysfunction During Adjuvant Breast Cancer Therapy) was a randomized, parallel-group, placebo-controlled, double-blind, multicenter trial conducted at 4 academic medical centers in Norway that evaluated the cardioprotective effect of sacubitril/valsartan versus placebo administered concomitantly with anthracycline-containing breast cancer therapy and continued for 18 months. The target dose was 97/103 mg BID. The primary outcome was change in left ventricular ejection fraction by cardiovascular magnetic resonance from prior to initiation of chemotherapy to 18 months thereafter. Secondary outcomes included change in echocardiographic global longitudinal strain, circulating cardiac troponins, and NT-proBNP (N-terminal pro-B-type natriuretic peptide)."
        },
        {
          "label": "RESULTS",
          "text": "In total, 138 women (mean±SD age: 54.0±9.4 years) were randomized. The overall decline in left ventricular ejection fraction from baseline to 18 months was 2.2 percentage points (95% CI, 1.1 to 3.3) in the placebo group and 1.1 percentage points (95% CI, -0.01 to 2.2) in the sacubitril/valsartan group. The between-group difference was 1.1 percentage points (95% CI, -0.4 to 2.7; =0.16). Left ventricular global longitudinal strain was normal and remained stable in the sacubitril/valsartan group throughout the study (change from baseline to 18 months, -0.3 [95% CI, -0.80 to 0.2]). In contrast, there was a progressive decline in the placebo group (change from baseline to 18 months, 0.5 [95% CI, 0.05 to 1.0]). The between-group difference was -0.9 (95% CI, -1.5 to -0.2). The mean increases in NT-proBNP and cardiac troponin I concentrations from baseline to 18 months were greater in the placebo group than in the sacubitril/valsartan group (log difference, 0.3 [95% CI, 0.05 to 0.6] for NT-proBNP and 0.5 [95% CI, 0.1to 1.0] for cardiac troponin I)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Anthracycline-based treatment for early breast cancer was associated with a reduction in left ventricular ejection fraction that was not significantly attenuated by sacubitril/valsartan."
        },
        {
          "label": "REGISTRATION",
          "text": "URL: https://www.clinicaltrials.gov; Unique identifier: NCT03760588."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884047/",
      "pubDate": "2025 Oct 21",
      "doi": "10.1161/CIRCULATIONAHA.125.076616",
      "dateReceived": "2025-11-03T23:24:38.982Z",
      "isNew": false,
      "summary": "Anthracycline chemotherapy for early breast cancer caused a decrease in heart pumping function that was not improved by sacubitril/valsartan."
    },
    {
      "id": "3345597cf6f2",
      "title": "Updated Evidence for Covid-19, RSV, and Influenza Vaccines for 2025-2026.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/118039",
      "abstract": "Changes in the vaccine advisory process in the United States have disrupted immunization guidance, which reinforces the need for independent evidence review to inform decisions regarding immunization for respiratory viruses during the 2025-2026 season. We conducted a systematic review of U.S.-licensed immunizations against coronavirus disease 2019 (Covid-19), respiratory syncytial virus (RSV), and influenza. We searched databases on PubMed/MEDLINE, Embase, and Web of Science for updates of the most recent review by the Advisory Committee on Immunization Practices (ACIP) Evidence-to-Recommendations for each disease, which was performed during the 2023-2024 period. Outcomes included vaccine efficacy and effectiveness against hospitalization, other clinical end points, and safety. Of 17,263 identified references, 511 studies met the inclusion criteria. Covid-19 mRNA vaccines against the XBB.1.5 subvariant had pooled vaccine effectiveness against hospitalization of 46% (95% confidence interval [CI], 34 to 55; from cohort studies) and 50% (95% CI, 43 to 57; from case-control studies) among adults and 37% (95% CI, 29 to 44) among immunocompromised adults. In a case-control study, vaccines against the KP.2 subvariant showed an effectiveness of 68% (95% CI, 42 to 82). Maternal RSV vaccination (for infant protection), nirsevimab for infants, and RSV vaccines in adults who were 60 years of age or older showed vaccine effectiveness of 68% or more against hospitalization. Influenza vaccination had a pooled vaccine effectiveness of 48% (95% CI, 39 to 55) in adults between the ages of 18 and 64 years and 67% (95% CI, 58 to 75) in children against hospitalization. Safety profiles were consistent with previous evaluations. The diagnosis of myocarditis associated with Covid-19 vaccines occurred at rates of 1.3 to 3.1 per 100,000 doses in male adolescents, with lower risk associated with longer dosing intervals. The RSVPreF vaccine was associated with 18.2 excess cases of Guillain-Barré syndrome per million doses in older adults; a significant association with preterm birth was not observed when the vaccine was administered at 32 to 36 weeks' gestation. Ongoing peer-reviewed evidence supports the safety and effectiveness of immunizations against Covid-19, RSV, and influenza during the 2025-2026 season. (Funded by the Center for Infectious Disease Research and Policy and the Alumbra Innovations Foundation.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Changes in the vaccine advisory process in the United States have disrupted immunization guidance, which reinforces the need for independent evidence review to inform decisions regarding immunization for respiratory viruses during the 2025-2026 season."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review of U.S.-licensed immunizations against coronavirus disease 2019 (Covid-19), respiratory syncytial virus (RSV), and influenza. We searched databases on PubMed/MEDLINE, Embase, and Web of Science for updates of the most recent review by the Advisory Committee on Immunization Practices (ACIP) Evidence-to-Recommendations for each disease, which was performed during the 2023-2024 period. Outcomes included vaccine efficacy and effectiveness against hospitalization, other clinical end points, and safety."
        },
        {
          "label": "RESULTS",
          "text": "Of 17,263 identified references, 511 studies met the inclusion criteria. Covid-19 mRNA vaccines against the XBB.1.5 subvariant had pooled vaccine effectiveness against hospitalization of 46% (95% confidence interval [CI], 34 to 55; from cohort studies) and 50% (95% CI, 43 to 57; from case-control studies) among adults and 37% (95% CI, 29 to 44) among immunocompromised adults. In a case-control study, vaccines against the KP.2 subvariant showed an effectiveness of 68% (95% CI, 42 to 82). Maternal RSV vaccination (for infant protection), nirsevimab for infants, and RSV vaccines in adults who were 60 years of age or older showed vaccine effectiveness of 68% or more against hospitalization. Influenza vaccination had a pooled vaccine effectiveness of 48% (95% CI, 39 to 55) in adults between the ages of 18 and 64 years and 67% (95% CI, 58 to 75) in children against hospitalization. Safety profiles were consistent with previous evaluations. The diagnosis of myocarditis associated with Covid-19 vaccines occurred at rates of 1.3 to 3.1 per 100,000 doses in male adolescents, with lower risk associated with longer dosing intervals. The RSVPreF vaccine was associated with 18.2 excess cases of Guillain-Barré syndrome per million doses in older adults; a significant association with preterm birth was not observed when the vaccine was administered at 32 to 36 weeks' gestation."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ongoing peer-reviewed evidence supports the safety and effectiveness of immunizations against Covid-19, RSV, and influenza during the 2025-2026 season. (Funded by the Center for Infectious Disease Research and Policy and the Alumbra Innovations Foundation.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160817/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1056/NEJMsa2514268",
      "dateReceived": "2025-11-03T23:24:38.981Z",
      "isNew": false,
      "summary": "Immunizations against COVID-19, RSV, and influenza are safe and effective for the 2025-2026 season."
    },
    {
      "id": "30e627f7a05d",
      "title": "Antiviral efficacy of oral ensitrelvir versus oral ritonavir-boosted nirmatrelvir in COVID-19 (PLATCOV): an open-label, phase 2, randomised, controlled, adaptive trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48672768/117929",
      "abstract": "Ensitrelvir is an oral antiviral treatment for COVID-19 with the same molecular target (the main protease) as ritonavir-boosted nirmatrelvir-the current oral first-line treatment. We aimed to compare the clinical antiviral effects of the two drugs. In an open-label, phase 2, randomised, controlled, adaptive pharmacometric platform trial, low-risk adult outpatients aged 18-60 years with early symptomatic COVID-19 (<4 days of symptoms) were recruited from hospital acute respiratory infection clinics in Thailand and Laos. Patients were randomly assigned in blocks (block sizes depended on the number of interventions available) to one of eight treatment groups, including oral ensitrelvir and oral ritonavir-boosted nirmatrelvir at standard doses, both given for 5 days, and no study drug. The primary endpoint was the oropharyngeal SARS-CoV-2 viral clearance rate assessed between day 0 and day 5 in the modified intention-to-treat population (defined as patients with at least 2 days of follow-up). Patients had four oropharyngeal swabs taken on day 0 and two swabs taken daily from days 1 to 7, then on days 10 and 14. Viral clearance rates were derived under a Bayesian hierarchical linear model fitted to log viral densities in standardised paired oropharyngeal swab eluates taken daily over the 5 days (14 samples). An individual patient data meta-analysis of all small molecule drugs evaluated in this platform trial using published results was also performed, adjusting for temporal trends in viral clearance. This trial is registered at ClinicalTrials.gov, NCT05041907. Between March 17, 2023, and April 21, 2024, 604 of 903 patients enrolled were concurrently assigned to the three treatment groups (ensitrelvir n=202; ritonavir-boosted nirmatrelvir n=207; no study drug n=195). Median estimated SARS-CoV-2 clearance half-lives were 5·9 h (IQR 4·0-8·6) with ensitrelvir, 5·2 h (3·8-6·6) with nirmatrelvir, and 11·6 h (8·1-14·5) with no study drug. Viral clearance following ensitrelvir was 82% faster (95% credible interval 61-104) than no study drug and 16% slower (5-25) than ritonavir-boosted nirmatrelvir. In the meta-analysis of all unblinded small molecule drugs evaluated in the platform trial, nirmatrelvir and ensitrelvir had the largest antiviral effects (1157 patients). Viral rebound occurred in 15 (7%) of 207 patients in the nirmatrelvir group and 10 (5%) of 202 in the ensitrelvir group (p=0·45). Both ensitrelvir and nirmatrelvir accelerate oropharyngeal SARS-CoV-2 viral clearance. Ensitrelvir is an effective alternative to currently available antivirals in treating COVID-19. Although COVID-19 is now generally a mild disease, it still causes substantial morbidity, particularly in vulnerable groups, and new variants or other coronaviruses could still emerge with pandemic potential. Safe effective and affordable antivirals are needed, and these are best assessed initially in pharmacometric platform trials assessing viral clearance. Wellcome Trust through the COVID-19 Therapeutics Accelerator.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Ensitrelvir is an oral antiviral treatment for COVID-19 with the same molecular target (the main protease) as ritonavir-boosted nirmatrelvir-the current oral first-line treatment. We aimed to compare the clinical antiviral effects of the two drugs."
        },
        {
          "label": "METHODS",
          "text": "In an open-label, phase 2, randomised, controlled, adaptive pharmacometric platform trial, low-risk adult outpatients aged 18-60 years with early symptomatic COVID-19 (<4 days of symptoms) were recruited from hospital acute respiratory infection clinics in Thailand and Laos. Patients were randomly assigned in blocks (block sizes depended on the number of interventions available) to one of eight treatment groups, including oral ensitrelvir and oral ritonavir-boosted nirmatrelvir at standard doses, both given for 5 days, and no study drug. The primary endpoint was the oropharyngeal SARS-CoV-2 viral clearance rate assessed between day 0 and day 5 in the modified intention-to-treat population (defined as patients with at least 2 days of follow-up). Patients had four oropharyngeal swabs taken on day 0 and two swabs taken daily from days 1 to 7, then on days 10 and 14. Viral clearance rates were derived under a Bayesian hierarchical linear model fitted to log viral densities in standardised paired oropharyngeal swab eluates taken daily over the 5 days (14 samples). An individual patient data meta-analysis of all small molecule drugs evaluated in this platform trial using published results was also performed, adjusting for temporal trends in viral clearance. This trial is registered at ClinicalTrials.gov, NCT05041907."
        },
        {
          "label": "FINDINGS",
          "text": "Between March 17, 2023, and April 21, 2024, 604 of 903 patients enrolled were concurrently assigned to the three treatment groups (ensitrelvir n=202; ritonavir-boosted nirmatrelvir n=207; no study drug n=195). Median estimated SARS-CoV-2 clearance half-lives were 5·9 h (IQR 4·0-8·6) with ensitrelvir, 5·2 h (3·8-6·6) with nirmatrelvir, and 11·6 h (8·1-14·5) with no study drug. Viral clearance following ensitrelvir was 82% faster (95% credible interval 61-104) than no study drug and 16% slower (5-25) than ritonavir-boosted nirmatrelvir. In the meta-analysis of all unblinded small molecule drugs evaluated in the platform trial, nirmatrelvir and ensitrelvir had the largest antiviral effects (1157 patients). Viral rebound occurred in 15 (7%) of 207 patients in the nirmatrelvir group and 10 (5%) of 202 in the ensitrelvir group (p=0·45)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Both ensitrelvir and nirmatrelvir accelerate oropharyngeal SARS-CoV-2 viral clearance. Ensitrelvir is an effective alternative to currently available antivirals in treating COVID-19. Although COVID-19 is now generally a mild disease, it still causes substantial morbidity, particularly in vulnerable groups, and new variants or other coronaviruses could still emerge with pandemic potential. Safe effective and affordable antivirals are needed, and these are best assessed initially in pharmacometric platform trials assessing viral clearance."
        },
        {
          "label": "FUNDING",
          "text": "Wellcome Trust through the COVID-19 Therapeutics Accelerator."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41082886/",
      "pubDate": "2025 Oct 10",
      "doi": "10.1016/S1473-3099(25)00482-7",
      "dateReceived": "2025-11-02T23:22:55.757Z",
      "isNew": false
    },
    {
      "id": "88b62bbfbf92",
      "title": "Outcomes of cardiovascular screening in men aged 60-64 years: the DANCAVAS II trial.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48672768/117914",
      "abstract": "Limited data suggest a benefit of population-based screening for cardiovascular disease (CVD) with respect to mortality. A population-based, parallel-randomized controlled trial of Danish men aged 60-64 years randomized 1:4 to invitation to screening for subclinical CVD or no invitation (control group) were performed. Allocation was based on computer-generated random numbers and stratified on municipality. Only the control group was blinded. The screening included coronary artery calcification score, aneurysms, atrial fibrillation, peripheral arterial disease, hypertension, diabetes mellitus and hypercholesterolemia. Intervention included statin, aspirin and surveillance. The primary outcome was all-cause mortality. 31,268 participants were randomized; 25,322 men in the control arm and 5,946 in the invited arm, of whom 3,720 attended and were screened (62·6%). In intention-to-treat analyses, after a median follow-up of 7·0 years, 555 (9.3%) men in the intervention group and 2,509 (9·9%) men in the control group had died; hazard ratio (HR) = 0.94 (95% CI: 0·86;1·03), p=0·169.Major adverse cardiovascular events (MACE) were registered in 606 (10·2%) versus 2,682 (10·6%) (HR=0·96 [95% CI 0·88;1.04]; p=0·319).Severe bleedings were significantly more common in the invited-to-screening group (6·0% versus 5·1%; HR=1·18 [95% CI 1·05;1·32]; p=0·007). This included intracranial (HR=1·23 (95% CI 0·96;1·58); p=0·097) and gastrointestinal bleedings (HR=1·18; (95% CI 1·03;1·34) p=0·014), respectively. Invitation to a comprehensive CT-based screening for subclinical CVD did not decrease death over 7 years among men aged 60-64 years but did increase severe bleeding. Because the trial was powered for events over 10 years, further follow-up is needed. Clinicaltrials.gov number: NCT03946410.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Limited data suggest a benefit of population-based screening for cardiovascular disease (CVD) with respect to mortality."
        },
        {
          "label": "METHODS",
          "text": "A population-based, parallel-randomized controlled trial of Danish men aged 60-64 years randomized 1:4 to invitation to screening for subclinical CVD or no invitation (control group) were performed. Allocation was based on computer-generated random numbers and stratified on municipality. Only the control group was blinded. The screening included coronary artery calcification score, aneurysms, atrial fibrillation, peripheral arterial disease, hypertension, diabetes mellitus and hypercholesterolemia. Intervention included statin, aspirin and surveillance. The primary outcome was all-cause mortality."
        },
        {
          "label": "RESULTS",
          "text": "31,268 participants were randomized; 25,322 men in the control arm and 5,946 in the invited arm, of whom 3,720 attended and were screened (62·6%). In intention-to-treat analyses, after a median follow-up of 7·0 years, 555 (9.3%) men in the intervention group and 2,509 (9·9%) men in the control group had died; hazard ratio (HR) = 0.94 (95% CI: 0·86;1·03), p=0·169.Major adverse cardiovascular events (MACE) were registered in 606 (10·2%) versus 2,682 (10·6%) (HR=0·96 [95% CI 0·88;1.04]; p=0·319).Severe bleedings were significantly more common in the invited-to-screening group (6·0% versus 5·1%; HR=1·18 [95% CI 1·05;1·32]; p=0·007). This included intracranial (HR=1·23 (95% CI 0·96;1·58); p=0·097) and gastrointestinal bleedings (HR=1·18; (95% CI 1·03;1·34) p=0·014), respectively."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Invitation to a comprehensive CT-based screening for subclinical CVD did not decrease death over 7 years among men aged 60-64 years but did increase severe bleeding. Because the trial was powered for events over 10 years, further follow-up is needed. Clinicaltrials.gov number: NCT03946410."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884758/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1093/eurheartj/ehaf704",
      "dateReceived": "2025-11-02T23:22:55.757Z",
      "isNew": false,
      "summary": "CT-based screening for subclinical cardiovascular disease in men aged 60-64 did not reduce mortality at 7 years and increased severe bleeding."
    },
    {
      "id": "d4640150a647",
      "title": "A Pragmatic Trial of Glucocorticoids for Community-Acquired Pneumonia.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48744612/118033",
      "abstract": "Adjunctive glucocorticoids may reduce mortality among patients with severe community-acquired pneumonia (CAP) in well-resourced settings. Whether these drugs are beneficial in low-resource settings with limited diagnostic and treatment facilities is unclear. In this pragmatic, open-label, randomized, controlled trial conducted in 18 public hospitals in Kenya, we assigned adult patients who had received a diagnosis of CAP and who did not have a clear indication for glucocorticoids to receive either standard care for CAP or oral low-dose glucocorticoids for 10 days in addition to standard care. The primary outcome was death from any cause at 30 days after enrollment. A total of 2180 patients underwent randomization (1089 assigned to the glucocorticoid group and 1091 to the standard-care group). The median age of the patients was 53 years (interquartile range, 38 to 72); 46% were women. At day 30, deaths were reported in 530 patients (24.3%): 246 patients (22.6%) in the glucocorticoid group and 284 patients (26.0%) in the standard-care group (hazard ratio, 0.84; 95% confidence interval, 0.73 to 0.97; P = 0.02). The frequencies of adverse events and serious adverse events were similar in the two trial groups. Serious adverse events that were considered to be related to glucocorticoid administration occurred in 5 patients (0.5%). In patients with CAP in a low-resource setting, adjunctive glucocorticoid therapy was associated with a lower risk of death than standard care. (Funded by Wellcome Trust and others; SONIA PACTR number, PACTR202111481740832; ISRCTN number, ISRCTN36138594.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Adjunctive glucocorticoids may reduce mortality among patients with severe community-acquired pneumonia (CAP) in well-resourced settings. Whether these drugs are beneficial in low-resource settings with limited diagnostic and treatment facilities is unclear."
        },
        {
          "label": "METHODS",
          "text": "In this pragmatic, open-label, randomized, controlled trial conducted in 18 public hospitals in Kenya, we assigned adult patients who had received a diagnosis of CAP and who did not have a clear indication for glucocorticoids to receive either standard care for CAP or oral low-dose glucocorticoids for 10 days in addition to standard care. The primary outcome was death from any cause at 30 days after enrollment."
        },
        {
          "label": "RESULTS",
          "text": "A total of 2180 patients underwent randomization (1089 assigned to the glucocorticoid group and 1091 to the standard-care group). The median age of the patients was 53 years (interquartile range, 38 to 72); 46% were women. At day 30, deaths were reported in 530 patients (24.3%): 246 patients (22.6%) in the glucocorticoid group and 284 patients (26.0%) in the standard-care group (hazard ratio, 0.84; 95% confidence interval, 0.73 to 0.97; P = 0.02). The frequencies of adverse events and serious adverse events were similar in the two trial groups. Serious adverse events that were considered to be related to glucocorticoid administration occurred in 5 patients (0.5%)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with CAP in a low-resource setting, adjunctive glucocorticoid therapy was associated with a lower risk of death than standard care. (Funded by Wellcome Trust and others; SONIA PACTR number, PACTR202111481740832; ISRCTN number, ISRCTN36138594.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159889/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1056/NEJMoa2507100",
      "dateReceived": "2025-11-02T23:22:55.756Z",
      "isNew": false
    },
    {
      "id": "4788b27b264a",
      "title": "Personalized Hemodynamic Resuscitation Targeting Capillary Refill Time in Early Septic Shock: The ANDROMEDA-SHOCK-2 Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48744612/118031",
      "abstract": "The optimal strategy for hemodynamic resuscitation in early septic shock remains uncertain. To determine the effect of a personalized hemodynamic resuscitation protocol targeting capillary refill time (CRT-PHR) on a hierarchical composite outcome of mortality, duration of vital support, and length of hospital stay. This randomized clinical trial was conducted in 86 centers in 19 countries. Patients within the first 4 hours of septic shock were included between March 2022 and April 2025, with last follow-up in July 2025. Patients were randomized to undergo CRT-PHR (n = 720), including assessment of pulse pressure, diastolic arterial pressure, fluid responsiveness, and bedside echocardiography, to tailor fluids, vasopressors, and inotropes, vs usual care (n = 747). The primary outcome was a hierarchical composite of mortality, duration of vital support (vasoactives, mechanical ventilation, and kidney replacement therapy), and length of hospital stay assessed at 28 days. A win ratio was calculated for the primary outcome by comparing all possible patient pairs, starting with the first event in the hierarchy and stratified by median APACHE (Acute Physiology and Chronic Health Evaluation) II score at admission. Secondary outcomes were mortality, vital support-free days, and length of hospital stay at 28 days. From 1501 randomized patients, 1467 were included in the primary analysis (mean age, 66 [17] years; 43.3% female). There were 131 131 wins (48.9%) in the CRT-PHR group vs 112 787 (42.1%) in the usual care group for the hierarchical composite primary outcome, with a win ratio of 1.16 (95% CI, 1.02-1.33; P = .04). Individual wins for death were 19.1% vs 17.8%; duration of vital support, 26.4% vs 21.1%; and length of hospital stay, 3.4% vs 3.2% in the intervention vs usual care groups, respectively. Among patients with early septic shock, a personalized hemodynamic resuscitation protocol targeting capillary refill time was superior to usual care for the primary composite outcome, primarily due to a lower duration of vital support. ClinicalTrials.gov Identifier: NCT05057611.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The optimal strategy for hemodynamic resuscitation in early septic shock remains uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the effect of a personalized hemodynamic resuscitation protocol targeting capillary refill time (CRT-PHR) on a hierarchical composite outcome of mortality, duration of vital support, and length of hospital stay."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was conducted in 86 centers in 19 countries. Patients within the first 4 hours of septic shock were included between March 2022 and April 2025, with last follow-up in July 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomized to undergo CRT-PHR (n = 720), including assessment of pulse pressure, diastolic arterial pressure, fluid responsiveness, and bedside echocardiography, to tailor fluids, vasopressors, and inotropes, vs usual care (n = 747)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a hierarchical composite of mortality, duration of vital support (vasoactives, mechanical ventilation, and kidney replacement therapy), and length of hospital stay assessed at 28 days. A win ratio was calculated for the primary outcome by comparing all possible patient pairs, starting with the first event in the hierarchy and stratified by median APACHE (Acute Physiology and Chronic Health Evaluation) II score at admission. Secondary outcomes were mortality, vital support-free days, and length of hospital stay at 28 days."
        },
        {
          "label": "RESULTS",
          "text": "From 1501 randomized patients, 1467 were included in the primary analysis (mean age, 66 [17] years; 43.3% female). There were 131 131 wins (48.9%) in the CRT-PHR group vs 112 787 (42.1%) in the usual care group for the hierarchical composite primary outcome, with a win ratio of 1.16 (95% CI, 1.02-1.33; P = .04). Individual wins for death were 19.1% vs 17.8%; duration of vital support, 26.4% vs 21.1%; and length of hospital stay, 3.4% vs 3.2% in the intervention vs usual care groups, respectively."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with early septic shock, a personalized hemodynamic resuscitation protocol targeting capillary refill time was superior to usual care for the primary composite outcome, primarily due to a lower duration of vital support."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05057611."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159835/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1001/jama.2025.20402",
      "dateReceived": "2025-11-02T23:22:55.756Z",
      "isNew": false,
      "summary": "In early septic shock, a capillary refill time-guided resuscitation protocol led to better outcomes, mainly because patients needed less time on life support."
    },
    {
      "id": "61890e699a5f",
      "title": "An AI-Powered Lifestyle Intervention vs Human Coaching in the Diabetes Prevention Program: A Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48744612/118016",
      "dateReceived": "2025-11-02T23:22:55.756Z",
      "isNew": false
    },
    {
      "id": "d08d27b0a83e",
      "title": "Intravenous alteplase versus oral aspirin for acute central retinal artery occlusion within 4.5 h of severe vision loss (THEIA): a multicentre, double-dummy, patient-blinded and assessor-blinded, randomised, controlled, phase 3 trial.",
      "journal": "Lancet Neurol",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48744612/118010",
      "dateReceived": "2025-11-02T23:22:55.756Z",
      "isNew": false
    },
    {
      "id": "f34663e96151",
      "title": "Effects of GLP-1 receptor agonists on cognitive function in patients with type 2 diabetes: A systematic review and meta-analysis based on randomized controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48744612/117988",
      "abstract": "Patients with type 2 diabetes mellitus (T2DM) have a significantly increased risk of cognitive impairment, and the protective effects of traditional hypoglycaemic drugs on cognitive function remain unclear. This study systematically evaluated the neuroprotective effects of GLP-1 receptor agonists (GLP-1RAs) based on randomized controlled trial (RCT) evidence, aiming to provide key evidence-based insights for optimizing diabetes management strategies. A comprehensive literature search was conducted across PubMed, Embase, Cochrane Library, Web of Science, CNKI, Wanfang, and ClinicalTrials.gov databases to identify studies investigating the impact of GLP-1RAs on cognitive function in T2DM patients, with the search timeframe extending up to July 2025. The analysis focused on RCTs comparing the effects of GLP-1RAs versus placebo (or conventional therapy) on neurocognitive function in T2DM patients. Based on the inclusion criteria, 18 RCTs involving 11 114 participants were included in the primary meta-analysis. Pooled results demonstrated that, compared to the placebo group, GLP-1RA treatment significantly increased Mini-Mental State Examination (MMSE) scores by a weighted mean difference (WMD) of 1.33 (95% CI: 0.67-1.99; I = 82%) and Montreal Cognitive Assessment (MoCA) scores by a WMD of 1.70 (95% CI: 0.83-2.56; I = 96%). The effect size on MMSE was significantly greater with long-term GLP-1RA use (≥24 weeks) compared to short-term use (<24 weeks) (mean difference = 3.74; t = 6.52, df = 269, p < 0.0001; Cohen's d = 0.79). Sensitivity analyses yielded results closely aligned with the primary analysis, indicating robust stability. Jadad scale assessment confirmed that all included studies achieved a score ≥3. Current evidence indicates that GLP-1 RA-based therapy may improve cognitive function in patients with type 2 diabetes mellitus compared with placebo. Furthermore, long-term administration or early initiation of GLP-1 RA treatment may offer greater cognitive benefits.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Patients with type 2 diabetes mellitus (T2DM) have a significantly increased risk of cognitive impairment, and the protective effects of traditional hypoglycaemic drugs on cognitive function remain unclear. This study systematically evaluated the neuroprotective effects of GLP-1 receptor agonists (GLP-1RAs) based on randomized controlled trial (RCT) evidence, aiming to provide key evidence-based insights for optimizing diabetes management strategies."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "A comprehensive literature search was conducted across PubMed, Embase, Cochrane Library, Web of Science, CNKI, Wanfang, and ClinicalTrials.gov databases to identify studies investigating the impact of GLP-1RAs on cognitive function in T2DM patients, with the search timeframe extending up to July 2025. The analysis focused on RCTs comparing the effects of GLP-1RAs versus placebo (or conventional therapy) on neurocognitive function in T2DM patients."
        },
        {
          "label": "RESULTS",
          "text": "Based on the inclusion criteria, 18 RCTs involving 11 114 participants were included in the primary meta-analysis. Pooled results demonstrated that, compared to the placebo group, GLP-1RA treatment significantly increased Mini-Mental State Examination (MMSE) scores by a weighted mean difference (WMD) of 1.33 (95% CI: 0.67-1.99; I = 82%) and Montreal Cognitive Assessment (MoCA) scores by a WMD of 1.70 (95% CI: 0.83-2.56; I = 96%). The effect size on MMSE was significantly greater with long-term GLP-1RA use (≥24 weeks) compared to short-term use (<24 weeks) (mean difference = 3.74; t = 6.52, df = 269, p < 0.0001; Cohen's d = 0.79). Sensitivity analyses yielded results closely aligned with the primary analysis, indicating robust stability. Jadad scale assessment confirmed that all included studies achieved a score ≥3."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Current evidence indicates that GLP-1 RA-based therapy may improve cognitive function in patients with type 2 diabetes mellitus compared with placebo. Furthermore, long-term administration or early initiation of GLP-1 RA treatment may offer greater cognitive benefits."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41104525/",
      "pubDate": "2025 Oct 17",
      "doi": "10.1111/dom.70201",
      "dateReceived": "2025-11-02T23:22:55.756Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists may enhance cognitive function in type 2 diabetes patients, with potentially greater benefits from long-term or early use."
    },
    {
      "id": "8b1557647e86",
      "title": "Progestagens for pain symptoms associated with endometriosis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gynecology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117932",
      "abstract": "Endometriosis is a hormone-sensitive inflammatory condition affecting between 5% and 10% of reproductive-aged women and an unknown number of gender-diverse individuals. It is often associated with debilitating pelvic pain symptoms. Various formulations of progestagens (e.g. oral, depot, implantable) have been studied as potential treatments for endometriosis because they induce atrophy of endometrial tissue. To determine the benefits and harms of progestagens in the treatment of endometriosis-associated pain symptoms. We searched CENTRAL, MEDLINE, Embase, and PsycINFO on 29 October 2024 without language restrictions. We included randomised controlled trials (RCTs) comparing progestagens for symptomatic endometriosis against placebo, other medications, or different doses of progestagens. Studies assessing the levonorgestrel-releasing intrauterine device were ineligible, as a separate Cochrane review covers this intervention. Participants were of reproductive age with a laparoscopic diagnosis of endometriosis and associated pain symptoms. Primary outcomes included endometriosis-associated pain symptoms (overall pain, pelvic pain, and dysmenorrhoea). Secondary outcomes included quality of life, patient satisfaction, and adverse effects. At least two review authors independently selected studies, extracted data, and assessed risk of bias. We reported dichotomous outcomes as risk ratios (RRs) and continuous outcomes as mean differences (MDs), each with its corresponding 95% confidence interval (CI). The meta-analysis employed a fixed-effect model, and we assessed statistical heterogeneity using the I statistic. We used GRADE to assess evidence certainty. We included 33 RCTs involving 5059 participants with symptomatic, laparoscopically diagnosed endometriosis. We judged 13 studies at overall low risk of bias. The following comparisons are limited by the small number of studies reporting each outcome. Pain outcomes, quality of life, and patient satisfaction were measured at six months unless otherwise specified. Oral progestagens versus placebo or no treatment (8 studies) Oral progestagens compared with placebo probably reduce overall pain measured on a visual analogue scale (VAS; MD -2.58, 95% CI -3.13 to -2.03; moderate certainty), and probably reduce dysmenorrhoea at three months (RR 0.21, 95% CI 0.07 to 0.70, moderate certainty), but may have little to no effect on pelvic pain at three months (RR 0.7, 95% CI 0.29 to 1.69; low certainty). Oral progestagens improve quality of life (SF-36 score; MD 4.11, 95% CI 2.41 to 5.82, high certainty). There is probably little to no difference between the interventions in study withdrawal due to adverse effects (RR 2.36, CI 0.74 to 7.52, moderate certainty) and cumulative side effects (RR 1.18, 95% CI 0.94 to 1.46, moderate certainty). Oral progestagens versus oral contraceptives (4 studies) Oral progestagens compared with oral contraceptives probably have little to no effect on pelvic pain measured on a VAS (MD 0.38, 95% CI -0.46 to 1.22, moderate certainty). There was very low-certainty evidence about their effect on dysmenorrhoea at 12 months (MD -0.57, 95% CI -1.29 to 0.15), quality of life (SF-36 general health perception; MD 5.2, 95% CI -1.3 to 11.70), and patient satisfaction (RR 1.18, 95% CI 0.88 to 1.57). Oral progestagens may lead to better quality of life (SF-36 pain score; MD 11.5, 95% CI 2.35 to 20.65, low certainty). There may be little to no difference between oral progestagens and oral contraceptives in study withdrawal due to adverse effects (RR 0.75, 95% CI 0.27 to 2.07, low certainty), and there is probably little to no difference in cumulative side effects (RR 1.13, 95% CI 0.8 to 1.60, moderate certainty). Oral progestagens versus gonadotropin-releasing hormone (GnRH) agonists (10 studies) Oral progestagens compared with GnRH agonists may have little to no effect on overall pain measured on a VAS (MD -0.01, 95% CI -0.30 to 0.28), risk of pelvic pain (RR 1.12, 95% CI 0.80 to 1.59), dysmenorrhoea (RR 1.45, 95% CI 0.71 to 3.00), SF-36 physical health score (MD 0.40, 95% CI -1.58 to 2.38), SF-36 mental health score (MD -0.50, 95% CI -3.75 to 2.75), patient satisfaction (RR 1.08, 95% CI 0.92 to 1.26), and study withdrawal due to adverse effects (RR 0.9, 95% CI 0.34 to 2.43). All these outcomes had low-certainty evidence. The risk of cumulative side effects was probably higher with oral progestagens (RR 1.44, 95% CI 1.11 to 1.86, moderate certainty). Depot progestagens versus GnRH agonists (2 studies) Depot progestagens compared with GnRH agonists reduce dysmenorrhoea risk slightly (RR 0.93, 95% CI 0.89 to 0.97, high certainty) but may have little to no effect on pelvic pain (RR 0.96, 95% CI 0.87 to 1.07, low certainty). The interventions may be similar in study withdrawal due to adverse effects (RR 1.41, 95% CI 0.24 to 8.32, low certainty), but the risk of cumulative side effects is probably lower with depot progestagens (RR 0.03, 95% CI 0.01 to 0.11, moderate certainty). Depot progestagens versus GnRH antagonist (1 study) Depot progestagens compared with GNRH agonists may have little to no effect on pelvic pain (RR 0.85, 95% CI 0.7 to 1.03, low certainty), dysmenorrhoea (RR 0.85, 95% CI 0.7 to 1.03, low certainty), and cumulative adverse effects (RR 1.04, 0.95 to 1.14, low certainty). Study withdrawal due to side effects is likely higher with depot progestagens (RR 2.02, 95% CI 1.04 to 3.94, moderate certainty). Depot progestagens versus the etonogestrel implant (1 study) There was very low-certainty evidence about the effect of depot progestagens versus the etonogestrel implant on overall pain measured on a VAS (MD 0.80, 95% CI - 0.42 to 2.02), patient satisfaction (RR 0.96, 95% CI 0.56 to 1.66), and study withdrawal due to adverse effects (RR 1.84, 95% CI 0.63 to 5.33). In individuals with endometriosis, oral progestagens compared with placebo likely reduce overall pain and dysmenorrhoea and may reduce pelvic pain. Compared with other hormonal suppression strategies, the evidence is less certain due to the small number of studies for each comparison and outcome. Despite such limitations, this update provides a comprehensive overview and valuable insights on progestagen treatment for endometriosis, emphasising the nuanced balance between efficacy, adverse effects, and patient satisfaction.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Endometriosis is a hormone-sensitive inflammatory condition affecting between 5% and 10% of reproductive-aged women and an unknown number of gender-diverse individuals. It is often associated with debilitating pelvic pain symptoms. Various formulations of progestagens (e.g. oral, depot, implantable) have been studied as potential treatments for endometriosis because they induce atrophy of endometrial tissue."
        },
        {
          "label": "OBJECTIVES",
          "text": "To determine the benefits and harms of progestagens in the treatment of endometriosis-associated pain symptoms."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, and PsycINFO on 29 October 2024 without language restrictions."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCTs) comparing progestagens for symptomatic endometriosis against placebo, other medications, or different doses of progestagens. Studies assessing the levonorgestrel-releasing intrauterine device were ineligible, as a separate Cochrane review covers this intervention. Participants were of reproductive age with a laparoscopic diagnosis of endometriosis and associated pain symptoms. Primary outcomes included endometriosis-associated pain symptoms (overall pain, pelvic pain, and dysmenorrhoea). Secondary outcomes included quality of life, patient satisfaction, and adverse effects."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "At least two review authors independently selected studies, extracted data, and assessed risk of bias. We reported dichotomous outcomes as risk ratios (RRs) and continuous outcomes as mean differences (MDs), each with its corresponding 95% confidence interval (CI). The meta-analysis employed a fixed-effect model, and we assessed statistical heterogeneity using the I statistic. We used GRADE to assess evidence certainty."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 33 RCTs involving 5059 participants with symptomatic, laparoscopically diagnosed endometriosis. We judged 13 studies at overall low risk of bias. The following comparisons are limited by the small number of studies reporting each outcome. Pain outcomes, quality of life, and patient satisfaction were measured at six months unless otherwise specified. Oral progestagens versus placebo or no treatment (8 studies) Oral progestagens compared with placebo probably reduce overall pain measured on a visual analogue scale (VAS; MD -2.58, 95% CI -3.13 to -2.03; moderate certainty), and probably reduce dysmenorrhoea at three months (RR 0.21, 95% CI 0.07 to 0.70, moderate certainty), but may have little to no effect on pelvic pain at three months (RR 0.7, 95% CI 0.29 to 1.69; low certainty). Oral progestagens improve quality of life (SF-36 score; MD 4.11, 95% CI 2.41 to 5.82, high certainty). There is probably little to no difference between the interventions in study withdrawal due to adverse effects (RR 2.36, CI 0.74 to 7.52, moderate certainty) and cumulative side effects (RR 1.18, 95% CI 0.94 to 1.46, moderate certainty). Oral progestagens versus oral contraceptives (4 studies) Oral progestagens compared with oral contraceptives probably have little to no effect on pelvic pain measured on a VAS (MD 0.38, 95% CI -0.46 to 1.22, moderate certainty). There was very low-certainty evidence about their effect on dysmenorrhoea at 12 months (MD -0.57, 95% CI -1.29 to 0.15), quality of life (SF-36 general health perception; MD 5.2, 95% CI -1.3 to 11.70), and patient satisfaction (RR 1.18, 95% CI 0.88 to 1.57). Oral progestagens may lead to better quality of life (SF-36 pain score; MD 11.5, 95% CI 2.35 to 20.65, low certainty). There may be little to no difference between oral progestagens and oral contraceptives in study withdrawal due to adverse effects (RR 0.75, 95% CI 0.27 to 2.07, low certainty), and there is probably little to no difference in cumulative side effects (RR 1.13, 95% CI 0.8 to 1.60, moderate certainty). Oral progestagens versus gonadotropin-releasing hormone (GnRH) agonists (10 studies) Oral progestagens compared with GnRH agonists may have little to no effect on overall pain measured on a VAS (MD -0.01, 95% CI -0.30 to 0.28), risk of pelvic pain (RR 1.12, 95% CI 0.80 to 1.59), dysmenorrhoea (RR 1.45, 95% CI 0.71 to 3.00), SF-36 physical health score (MD 0.40, 95% CI -1.58 to 2.38), SF-36 mental health score (MD -0.50, 95% CI -3.75 to 2.75), patient satisfaction (RR 1.08, 95% CI 0.92 to 1.26), and study withdrawal due to adverse effects (RR 0.9, 95% CI 0.34 to 2.43). All these outcomes had low-certainty evidence. The risk of cumulative side effects was probably higher with oral progestagens (RR 1.44, 95% CI 1.11 to 1.86, moderate certainty). Depot progestagens versus GnRH agonists (2 studies) Depot progestagens compared with GnRH agonists reduce dysmenorrhoea risk slightly (RR 0.93, 95% CI 0.89 to 0.97, high certainty) but may have little to no effect on pelvic pain (RR 0.96, 95% CI 0.87 to 1.07, low certainty). The interventions may be similar in study withdrawal due to adverse effects (RR 1.41, 95% CI 0.24 to 8.32, low certainty), but the risk of cumulative side effects is probably lower with depot progestagens (RR 0.03, 95% CI 0.01 to 0.11, moderate certainty). Depot progestagens versus GnRH antagonist (1 study) Depot progestagens compared with GNRH agonists may have little to no effect on pelvic pain (RR 0.85, 95% CI 0.7 to 1.03, low certainty), dysmenorrhoea (RR 0.85, 95% CI 0.7 to 1.03, low certainty), and cumulative adverse effects (RR 1.04, 0.95 to 1.14, low certainty). Study withdrawal due to side effects is likely higher with depot progestagens (RR 2.02, 95% CI 1.04 to 3.94, moderate certainty). Depot progestagens versus the etonogestrel implant (1 study) There was very low-certainty evidence about the effect of depot progestagens versus the etonogestrel implant on overall pain measured on a VAS (MD 0.80, 95% CI - 0.42 to 2.02), patient satisfaction (RR 0.96, 95% CI 0.56 to 1.66), and study withdrawal due to adverse effects (RR 1.84, 95% CI 0.63 to 5.33)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In individuals with endometriosis, oral progestagens compared with placebo likely reduce overall pain and dysmenorrhoea and may reduce pelvic pain. Compared with other hormonal suppression strategies, the evidence is less certain due to the small number of studies for each comparison and outcome. Despite such limitations, this update provides a comprehensive overview and valuable insights on progestagen treatment for endometriosis, emphasising the nuanced balance between efficacy, adverse effects, and patient satisfaction."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41065045/",
      "pubDate": "2025 Oct 09",
      "doi": "10.1002/14651858.CD002122.pub3",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": false,
      "summary": "Oral progestagens likely alleviate pain and dysmenorrhea in individuals with endometriosis."
    },
    {
      "id": "d0e02f3ef0db",
      "title": "Ruxolitinib Versus Best Available Therapy in Patients With Steroid-Refractory Acute Graft-Versus-Host Disease: Final Analysis From the Randomized Phase III REACH2 Trial.",
      "journal": "J Clin Oncol",
      "score": "5/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117911",
      "abstract": "Approximately 30%-50% of patients develop acute graft-versus-host disease (aGVHD) after allogeneic hematopoietic cell transplantation (Allo-HCT), representing a major limitation of this treatment. Although corticosteroids remain the standard first-line therapy for aGVHD, up to 50% of patients become steroid-refractory (SR). REACH2 is a phase III study of ruxolitinib versus best available therapy (BAT) in patients age 12 years and older with SR-aGVHD after Allo-HCT. We present the final efficacy and safety outcomes from REACH2 after 24 months of treatment. Cumulative median (range) duration of response was 167 (22-677) days with ruxolitinib and 106 (10-526) days with BAT. Median overall survival and event-free survival were 10.7 and 8.3 months for ruxolitinib, compared with 5.8 and 4.2 months, respectively, with BAT. Median failure-free survival was significantly longer with ruxolitinib than with BAT (4.86  1.02 months,  < .001). Similar numbers of nonrelapse mortality events were observed with ruxolitinib and BAT (72  71), and malignancy relapse/progression events remained low across both groups. Numerically higher chronic GVHD rates were noted with ruxolitinib than with BAT from 12 months; however, 95% confidence intervals overlapped. Safety observations were consistent with the primary analysis results. Ruxolitinib provided efficacy advantages over BAT in patients with SR-aGVHD over 24 months.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41092247/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1200/JCO-25-00809",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": false,
      "summary": "Ruxolitinib demonstrated improved efficacy, including longer duration of response, overall survival, and event-free survival, compared to best available therapy in patients with steroid-refractory acute graft-versus-host disease after allogeneic hematopoietic cell transplantation over a 24-month period."
    },
    {
      "id": "eaf17738892f",
      "title": "Effect of Intravenous, Inhalational, or Combined Anesthesia Maintenance on Postoperative Respiratory Adverse Events in Children Undergoing Adenotonsillectomy (AmPRAEC): A Multicenter Randomized Clinical Trial.",
      "journal": "Anesthesiology",
      "score": "5/7",
      "tags": [
        "Surgery - Ear Nose Throat"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117889",
      "abstract": "General anesthetic drugs may affect the risk of postoperative respiratory adverse events (PRAEs) in children, but the effect of anesthesia maintenance strategies on these events has not yet been widely validated. This study tested the hypothesis that anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone would lead to a progressive reduction in the incidence of PRAEs. This multicenter randomized clinical trial (AmPRAEC study) enrolled 760 children aged 0 to 12 yr who underwent adenotonsillectomy at 12 hospitals in China. Patients were randomly assigned to the intravenous anesthesia maintenance (IV group), the combined intravenous-inhalation anesthesia maintenance (IVIH group), or the inhalation anesthesia maintenance (IH group). Tracheal tubes were used for airway management, with all children undergoing awake extubation. The primary outcome was PRAE incidence in the postanesthesia care unit. A total of 760 children (median [interquartile range] age, 6 [4 to 7] years; 460 boys [60.5%]) were randomized, and 729 total samples were available for modified intention-to-treat analysis. The IV group had the lowest incidence of PRAEs (45 of 239 [18.8%]), followed by the IVIH group (70 of 246 [28.5%]) and the IH group (106 of 244 [43.4%]). Compared to the IH group, the IVIH group had a significantly lower risk of PRAEs (adjusted odds ratio [aOR], 0.44; 95% confidence interval [CI], 0.29 to 0.65; number needed to treat, 7). The IV group had significantly lower risk compared to both the IVIH group (aOR, 0.57; 95% CI, 0.36 to 0.90; number needed to treat, 6) and the IH group (aOR, 0.25; 95% CI, 0.16 to 0.39; number needed to treat, 3). Anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone resulted in a progressive reduction in the incidence of PRAEs. Propofol intravenous anesthesia maintenance should be considered for children undergoing adenotonsillectomy.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "General anesthetic drugs may affect the risk of postoperative respiratory adverse events (PRAEs) in children, but the effect of anesthesia maintenance strategies on these events has not yet been widely validated. This study tested the hypothesis that anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone would lead to a progressive reduction in the incidence of PRAEs."
        },
        {
          "label": "METHODS",
          "text": "This multicenter randomized clinical trial (AmPRAEC study) enrolled 760 children aged 0 to 12 yr who underwent adenotonsillectomy at 12 hospitals in China. Patients were randomly assigned to the intravenous anesthesia maintenance (IV group), the combined intravenous-inhalation anesthesia maintenance (IVIH group), or the inhalation anesthesia maintenance (IH group). Tracheal tubes were used for airway management, with all children undergoing awake extubation. The primary outcome was PRAE incidence in the postanesthesia care unit."
        },
        {
          "label": "RESULTS",
          "text": "A total of 760 children (median [interquartile range] age, 6 [4 to 7] years; 460 boys [60.5%]) were randomized, and 729 total samples were available for modified intention-to-treat analysis. The IV group had the lowest incidence of PRAEs (45 of 239 [18.8%]), followed by the IVIH group (70 of 246 [28.5%]) and the IH group (106 of 244 [43.4%]). Compared to the IH group, the IVIH group had a significantly lower risk of PRAEs (adjusted odds ratio [aOR], 0.44; 95% confidence interval [CI], 0.29 to 0.65; number needed to treat, 7). The IV group had significantly lower risk compared to both the IVIH group (aOR, 0.57; 95% CI, 0.36 to 0.90; number needed to treat, 6) and the IH group (aOR, 0.25; 95% CI, 0.16 to 0.39; number needed to treat, 3)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone resulted in a progressive reduction in the incidence of PRAEs. Propofol intravenous anesthesia maintenance should be considered for children undergoing adenotonsillectomy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40768554/",
      "pubDate": "2025 Oct 14",
      "doi": "10.1097/ALN.0000000000005707",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": false,
      "summary": "Propofol infusion during adenotonsillectomy reduces the occurrence of postoperative respiratory adverse events (PRAEs) in children."
    },
    {
      "id": "7ce77c84d5ff",
      "title": "Transcatheter Closure of Patent Foramen Ovale With a Novel Biodegradable Device: A Prospective, Multicenter, Randomized Controlled Clinical Trial.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117876",
      "abstract": "Novel biodegradable patent foramen ovale (PFO) closure devices offer a promising therapeutic option. The efficacy and safety of the novel biodegradable devices compared with nitinol devices have not yet been investigated in a randomized clinical trial. This multicenter, randomized, noninferiority trial examined whether the novel biodegradable PFO closure device achieves comparable closure success rates as traditional nitinol devices while demonstrating disappearance of the protruding parts of the device on echocardiography. A total of 190 patients with PFO were enrolled and randomly assigned to receive either the biodegradable device (n=96) or the nitinol device (n=94). The primary efficacy end point was PFO closure success rate at 6 months postprocedure as demonstrated by contrast echocardiography. We continued to evaluate device-related complications, device disappearance on echocardiography, and closure success rates over a 24-month follow-up period. Successful PFO closure was achieved in 87 patients (90.63%) in the biodegradable device group and 86 patients (91.49%) in the nitinol device control group. The lower limit of the 95% CI of absolute difference was -8.98%, greater than the predefined noninferiority margin of -10%, confirming that the biodegradable device was not inferior to the nitinol device in terms of closure success. One patient in the trial group required surgical device removal because of intraprocedural deformation. No deaths, embolism, thrombus on the device, or erosion were observed in either group throughout the entire study period. Transthoracic echocardiography revealed that the hyperechoic area corresponding to the biodegradable device began decreasing within the first year after implantation and disappeared on echocardiography by 24 months after implantation. The novel biodegradable PFO closure device, which disappears on echocardiography within 24 months after implantation, demonstrates noninferiority to the traditional nitinol device in both efficacy and safety.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Novel biodegradable patent foramen ovale (PFO) closure devices offer a promising therapeutic option. The efficacy and safety of the novel biodegradable devices compared with nitinol devices have not yet been investigated in a randomized clinical trial."
        },
        {
          "label": "METHODS",
          "text": "This multicenter, randomized, noninferiority trial examined whether the novel biodegradable PFO closure device achieves comparable closure success rates as traditional nitinol devices while demonstrating disappearance of the protruding parts of the device on echocardiography. A total of 190 patients with PFO were enrolled and randomly assigned to receive either the biodegradable device (n=96) or the nitinol device (n=94). The primary efficacy end point was PFO closure success rate at 6 months postprocedure as demonstrated by contrast echocardiography. We continued to evaluate device-related complications, device disappearance on echocardiography, and closure success rates over a 24-month follow-up period."
        },
        {
          "label": "RESULTS",
          "text": "Successful PFO closure was achieved in 87 patients (90.63%) in the biodegradable device group and 86 patients (91.49%) in the nitinol device control group. The lower limit of the 95% CI of absolute difference was -8.98%, greater than the predefined noninferiority margin of -10%, confirming that the biodegradable device was not inferior to the nitinol device in terms of closure success. One patient in the trial group required surgical device removal because of intraprocedural deformation. No deaths, embolism, thrombus on the device, or erosion were observed in either group throughout the entire study period. Transthoracic echocardiography revealed that the hyperechoic area corresponding to the biodegradable device began decreasing within the first year after implantation and disappeared on echocardiography by 24 months after implantation."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The novel biodegradable PFO closure device, which disappears on echocardiography within 24 months after implantation, demonstrates noninferiority to the traditional nitinol device in both efficacy and safety."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41078120/",
      "pubDate": "2025 Oct 13",
      "doi": "10.1161/CIRCULATIONAHA.125.074609",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": false,
      "summary": "A biodegradable PFO closure device is as effective and safe as a traditional nitinol device."
    }
  ]
}