{
  "updated_at": "2025-09-08T23:24:21.457Z",
  "articles": [
    {
      "id": "4f69fb2f081d",
      "title": "Interventions for preventing falls in older people in care facilities.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48076287/117537",
      "abstract": "Falls in care facilities are common events, causing considerable morbidity and mortality for older people. This is an update of a review on interventions in care facilities and hospitals first published in 2010 and updated in 2012 and 2018 on interventions in care facilities and hospitals. This review has now been split into separate reviews for each setting. To assess the benefits and harms of interventions designed to reduce the incidence of falls in older people in care facilities. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, CINAHL, and two trial registers to 10 May 2024 and used reference checking, citation searching, and contact with authors to identify eligible trials and records. We included randomised controlled trials (RCTs) of any intervention for preventing falls in older people (aged over 65 years) in care facilities with any comparator. We excluded trials conducted in places of residence that do not provide residential health-related care or rehabilitative services. We excluded trials where falls were recorded as adverse events of the intervention and those recruiting participants post-stroke or living with Parkinson's disease. Critical outcomes were rate of falls (number of falls per unit time) and number of fallers (risk of experiencing one or more falls). Important outcomes were risk of fracture, adverse events, and economic outcomes. We assessed risk of bias in the included studies against nine items (seven items from Cochrane's RoB 1 tool, plus method of ascertaining falls and baseline imbalance). Two review authors independently performed study selection and data analysis. We calculated rate ratios (RaR) with 95% confidence intervals (CIs) for rate of falls and risk ratios (RRs) with 95% CIs for outcomes of risk of falling (number of people falling) and risk of fracture. We adjusted for clustering if not undertaken by trial authors. We grouped the results of trials with comparable interventions and participant characteristics, and pooled results where appropriate using the generic inverse variance method in RevMan. We conducted subgroup analyses according to intervention type, cognitive status, and informed by a qualitative comparative analysis where more than 10 trials were pooled and heterogeneity was high. Where pooling was precluded by the nature of the data, we presented trial data in tables for illustrative purposes or reported these in the text, or both. We used GRADE to assess the certainty of evidence. GRADE ratings of risk of bias were based on sensitivity analyses excluding trials at high risk of bias. We included 104 trials, 56 individually randomised and 48 cluster-randomised trials, with 68,964 participants. Thirty-three trials (27,492 participants) were added in this update. We assessed most of the included trials as at high risk of bias, often related to lack of blinding, which was rarely feasible for many intervention types. The certainty of evidence for the critical outcomes of falls ranged from high to very low. We have reported the critical outcomes for the main comparisons here. Regarding our important outcomes, adverse events were poorly reported, and the certainty of evidence was very low for all interventions; we have not reported these data here. The important outcomes of risk of fracture and cost-effectiveness are only reported here when the certainty of the evidence was stronger than very low. Multifactorial interventions. Overall, multifactorial interventions (i.e. two or more categories of intervention delivered based on individual risk profile) probably have little or no effect on the rate of falls (RaR 0.87, 95% CI 0.68 to 1.12; I² = 89%; 12 trials; 4843 participants; moderate-certainty evidence), but probably reduce the risk of falling (RR 0.91, 95% CI 0.83 to 1.00; I² = 19%; 11 trials; 4557 participants; moderate-certainty evidence). Multifactorial interventions may be cost-effective in reducing falls (GBP 20,889 per quality-adjusted life year, UK health and social care perspective; 1 trial; 1657 participants; low-certainty evidence). A subgroup analysis informed by qualitative comparative analysis indicated that multifactorial interventions delivered in a tailored manner according to resident individual circumstances (e.g. living with dementia) with facility staff engagement have greater effects (P < 0.001) than those not delivered in this manner, and probably result in a large reduction in rate of falls (RaR 0.61, 95% CI 0.54 to 0.69; I² = 0%; 7 trials; 3553 participants; moderate-certainty evidence) and risk of falling (RR 0.81, 95% CI 0.71 to 0.92; I² = 0%; 5 trials; 2993 participants; moderate-certainty evidence). All trials included assessment of environmental and personal risk factors (including medication optimisation and assessment of need for assistive aids) and exercise interventions. Exercise. As a single intervention, exercise was compared with usual care in 28 trials. At the end of the intervention period, active exercise probably reduces the rate of falls (RaR 0.68, 95% CI 0.51 to 0.91; I²= 84%; 14 trials; 2215 participants; moderate-certainty evidence) and risk of falling (RR 0.86, 95% CI 0.75 to 1.00; I² = 37%; 13 trials; 2408 participants; moderate-certainty evidence), but may have little or no effect on risk of any fracture (RR 1.01, 95% CI 0.58 to 1.78; 3 trials; 927 participants; low-certainty evidence). After a period of post-intervention follow-up, if active exercise is not sustained there is no effect on rate of falls (RaR 1.02, 95% CI 0.78 to 1.32; I² = 64%; 7 trials; 1354 participants; high-certainty evidence) and probably no effect on risk of falling (RR 1.06, 95% CI 0.92 to 1.23; I² = 17%; 7 trials; 1443 participants; moderate-certainty evidence). Active exercise may be cost-effective in reducing falls (AUD 18 per fall avoided, Australian health service perspective; 1 trial; 221 participants; low-certainty evidence). A subgroup analysis based on level of cognition indicated that active exercise may reduce the risk of falling in residents with cognitive impairment (RR 0.72, 95% CI 0.57 to 0.91; 4 trials; 451 participants; low-certainty evidence). Medication optimisation. As a single intervention, medication optimisation interventions were diverse, but overall may make little or no difference to rate of falls (RaR 0.92, 95% CI 0.75 to 1.13; I² = 86%; 13 trials; 4314 participants; low-certainty evidence) and probably make little or no difference to risk of falling (RR 0.96, 95% CI 0.89 to 1.03; I² = 0%; 12 trials; 6209 participants; moderate-certainty evidence). We are uncertain of the impact of medication review/deprescribing on falls outcomes (RaR 0.94, 95% CI 0.76 to 1.18; I² = 86%; 12 trials; 4125 participants; very low-certainty evidence; RR 0.90, 95% CI 0.80 to 1.01; I² = 0%; 9 trials; 1934 participants; very low-certainty evidence). Medication review/deprescribing as a single intervention may not be cost-effective (intervention had higher costs and falls, UK National Health Service and care home perspective; 1 trial; 826 participants; low-certainty evidence). Vitamin D supplementation. Vitamin D supplementation (with or without calcium supplementation, alone or within a multivitamin) probably reduces the rate of falls (RaR 0.63, 95% CI 0.46 to 0.86; I² = 72%; 5 trials; 4603 participants; moderate-certainty evidence) but probably makes little or no difference to the risk of falling (RR 0.99, 95% CI 0.90 to 1.08; I² = 12%; 6 trials; 5186 participants; moderate-certainty evidence). The population in these trials had low vitamin D levels. Nutrition: dairy food supplementation. Increasing servings of dairy to residents through dietitian assistance with menu design to enhance protein and calcium through provision of dairy foods may decrease the risk of falling and fractures from falls (RR 0.89, 95% CI 0.79 to 1.00; RR fracture 0.67, 95% CI 0.48 to 0.93; 1 trial; 7195 participants; low-certainty evidence). Multifactorial interventions implemented with facility staff engagement and tailored intervention delivery according to individual residents' circumstances probably reduce the rate of falls and risk of falling and may be cost-effective. Regarding single interventions, exercise probably reduces the rate of falls and the risk of falling, but if exercise is not sustained it has no ongoing effect on the rate of falls and probably no effect on the risk of falling. Active exercise may reduce the risk of falling in residents with cognitive impairment and may be cost-effective. Medication optimisation interventions were diverse overall and may make little or no difference to the rate of falls and probably little or no difference to the risk of falling. We are very uncertain of the effectiveness of medication review/deprescribing as a single intervention at reducing falls. Vitamin D supplementation probably reduces the rate of falls but probably makes little or no difference to the risk of falling. Addressing nutrition, increasing servings of dairy through dietitian assistance with menu design may decrease the risk of falling and risk of fractures. The Australian National Health and Medical Research Council provides salary support for authors through the Centre of Research Excellence for Prevention of Falls Injuries (Dyer, Suen, and Kwok) and Medical Research Future Fund (Dyer and Suen). Dylan Kneale is supported in part by ARC North Thames and the National Institute for Health Care Research ARC North Thames. Protocol (2023): Open Science Framework osf.io/y2nra Original review (2010): doi: 10.1002/14651858.CD005465.pub2 Review update (2012): doi: 10.1002/14651858.CD005465.pub3 Review update (2018): doi: 10.1002/14651858.CD005465.pub4.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Falls in care facilities are common events, causing considerable morbidity and mortality for older people. This is an update of a review on interventions in care facilities and hospitals first published in 2010 and updated in 2012 and 2018 on interventions in care facilities and hospitals. This review has now been split into separate reviews for each setting."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of interventions designed to reduce the incidence of falls in older people in care facilities."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, CINAHL, and two trial registers to 10 May 2024 and used reference checking, citation searching, and contact with authors to identify eligible trials and records."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) of any intervention for preventing falls in older people (aged over 65 years) in care facilities with any comparator. We excluded trials conducted in places of residence that do not provide residential health-related care or rehabilitative services. We excluded trials where falls were recorded as adverse events of the intervention and those recruiting participants post-stroke or living with Parkinson's disease."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were rate of falls (number of falls per unit time) and number of fallers (risk of experiencing one or more falls). Important outcomes were risk of fracture, adverse events, and economic outcomes."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed risk of bias in the included studies against nine items (seven items from Cochrane's RoB 1 tool, plus method of ascertaining falls and baseline imbalance)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently performed study selection and data analysis. We calculated rate ratios (RaR) with 95% confidence intervals (CIs) for rate of falls and risk ratios (RRs) with 95% CIs for outcomes of risk of falling (number of people falling) and risk of fracture. We adjusted for clustering if not undertaken by trial authors. We grouped the results of trials with comparable interventions and participant characteristics, and pooled results where appropriate using the generic inverse variance method in RevMan. We conducted subgroup analyses according to intervention type, cognitive status, and informed by a qualitative comparative analysis where more than 10 trials were pooled and heterogeneity was high. Where pooling was precluded by the nature of the data, we presented trial data in tables for illustrative purposes or reported these in the text, or both. We used GRADE to assess the certainty of evidence. GRADE ratings of risk of bias were based on sensitivity analyses excluding trials at high risk of bias."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 104 trials, 56 individually randomised and 48 cluster-randomised trials, with 68,964 participants. Thirty-three trials (27,492 participants) were added in this update. We assessed most of the included trials as at high risk of bias, often related to lack of blinding, which was rarely feasible for many intervention types. The certainty of evidence for the critical outcomes of falls ranged from high to very low. We have reported the critical outcomes for the main comparisons here. Regarding our important outcomes, adverse events were poorly reported, and the certainty of evidence was very low for all interventions; we have not reported these data here. The important outcomes of risk of fracture and cost-effectiveness are only reported here when the certainty of the evidence was stronger than very low."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Multifactorial interventions. Overall, multifactorial interventions (i.e. two or more categories of intervention delivered based on individual risk profile) probably have little or no effect on the rate of falls (RaR 0.87, 95% CI 0.68 to 1.12; I² = 89%; 12 trials; 4843 participants; moderate-certainty evidence), but probably reduce the risk of falling (RR 0.91, 95% CI 0.83 to 1.00; I² = 19%; 11 trials; 4557 participants; moderate-certainty evidence). Multifactorial interventions may be cost-effective in reducing falls (GBP 20,889 per quality-adjusted life year, UK health and social care perspective; 1 trial; 1657 participants; low-certainty evidence). A subgroup analysis informed by qualitative comparative analysis indicated that multifactorial interventions delivered in a tailored manner according to resident individual circumstances (e.g. living with dementia) with facility staff engagement have greater effects (P < 0.001) than those not delivered in this manner, and probably result in a large reduction in rate of falls (RaR 0.61, 95% CI 0.54 to 0.69; I² = 0%; 7 trials; 3553 participants; moderate-certainty evidence) and risk of falling (RR 0.81, 95% CI 0.71 to 0.92; I² = 0%; 5 trials; 2993 participants; moderate-certainty evidence). All trials included assessment of environmental and personal risk factors (including medication optimisation and assessment of need for assistive aids) and exercise interventions. Exercise. As a single intervention, exercise was compared with usual care in 28 trials. At the end of the intervention period, active exercise probably reduces the rate of falls (RaR 0.68, 95% CI 0.51 to 0.91; I²= 84%; 14 trials; 2215 participants; moderate-certainty evidence) and risk of falling (RR 0.86, 95% CI 0.75 to 1.00; I² = 37%; 13 trials; 2408 participants; moderate-certainty evidence), but may have little or no effect on risk of any fracture (RR 1.01, 95% CI 0.58 to 1.78; 3 trials; 927 participants; low-certainty evidence). After a period of post-intervention follow-up, if active exercise is not sustained there is no effect on rate of falls (RaR 1.02, 95% CI 0.78 to 1.32; I² = 64%; 7 trials; 1354 participants; high-certainty evidence) and probably no effect on risk of falling (RR 1.06, 95% CI 0.92 to 1.23; I² = 17%; 7 trials; 1443 participants; moderate-certainty evidence). Active exercise may be cost-effective in reducing falls (AUD 18 per fall avoided, Australian health service perspective; 1 trial; 221 participants; low-certainty evidence). A subgroup analysis based on level of cognition indicated that active exercise may reduce the risk of falling in residents with cognitive impairment (RR 0.72, 95% CI 0.57 to 0.91; 4 trials; 451 participants; low-certainty evidence). Medication optimisation. As a single intervention, medication optimisation interventions were diverse, but overall may make little or no difference to rate of falls (RaR 0.92, 95% CI 0.75 to 1.13; I² = 86%; 13 trials; 4314 participants; low-certainty evidence) and probably make little or no difference to risk of falling (RR 0.96, 95% CI 0.89 to 1.03; I² = 0%; 12 trials; 6209 participants; moderate-certainty evidence). We are uncertain of the impact of medication review/deprescribing on falls outcomes (RaR 0.94, 95% CI 0.76 to 1.18; I² = 86%; 12 trials; 4125 participants; very low-certainty evidence; RR 0.90, 95% CI 0.80 to 1.01; I² = 0%; 9 trials; 1934 participants; very low-certainty evidence). Medication review/deprescribing as a single intervention may not be cost-effective (intervention had higher costs and falls, UK National Health Service and care home perspective; 1 trial; 826 participants; low-certainty evidence). Vitamin D supplementation. Vitamin D supplementation (with or without calcium supplementation, alone or within a multivitamin) probably reduces the rate of falls (RaR 0.63, 95% CI 0.46 to 0.86; I² = 72%; 5 trials; 4603 participants; moderate-certainty evidence) but probably makes little or no difference to the risk of falling (RR 0.99, 95% CI 0.90 to 1.08; I² = 12%; 6 trials; 5186 participants; moderate-certainty evidence). The population in these trials had low vitamin D levels. Nutrition: dairy food supplementation. Increasing servings of dairy to residents through dietitian assistance with menu design to enhance protein and calcium through provision of dairy foods may decrease the risk of falling and fractures from falls (RR 0.89, 95% CI 0.79 to 1.00; RR fracture 0.67, 95% CI 0.48 to 0.93; 1 trial; 7195 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Multifactorial interventions implemented with facility staff engagement and tailored intervention delivery according to individual residents' circumstances probably reduce the rate of falls and risk of falling and may be cost-effective. Regarding single interventions, exercise probably reduces the rate of falls and the risk of falling, but if exercise is not sustained it has no ongoing effect on the rate of falls and probably no effect on the risk of falling. Active exercise may reduce the risk of falling in residents with cognitive impairment and may be cost-effective. Medication optimisation interventions were diverse overall and may make little or no difference to the rate of falls and probably little or no difference to the risk of falling. We are very uncertain of the effectiveness of medication review/deprescribing as a single intervention at reducing falls. Vitamin D supplementation probably reduces the rate of falls but probably makes little or no difference to the risk of falling. Addressing nutrition, increasing servings of dairy through dietitian assistance with menu design may decrease the risk of falling and risk of fractures."
        },
        {
          "label": "FUNDING",
          "text": "The Australian National Health and Medical Research Council provides salary support for authors through the Centre of Research Excellence for Prevention of Falls Injuries (Dyer, Suen, and Kwok) and Medical Research Future Fund (Dyer and Suen). Dylan Kneale is supported in part by ARC North Thames and the National Institute for Health Care Research ARC North Thames."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2023): Open Science Framework osf.io/y2nra Original review (2010): doi: 10.1002/14651858.CD005465.pub2 Review update (2012): doi: 10.1002/14651858.CD005465.pub3 Review update (2018): doi: 10.1002/14651858.CD005465.pub4."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40832852/",
      "pubDate": "2025 Aug 20",
      "doi": "10.1002/14651858.CD016064",
      "dateReceived": "2025-09-08T23:23:37.912Z",
      "isNew": true,
      "summary": "Multifactorial interventions and exercise likely reduce falls and fall risk, while medication optimization and vitamin D supplementation may have limited effects, and nutrition interventions may decrease fall and fracture risk."
    },
    {
      "id": "b1cc3c7828cf",
      "title": "Mycophenolate mofetil plus methotrexate versus cyclophosphamide with sequential azathioprine for treatment of Takayasu arteritis.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48076287/117512",
      "abstract": "Study the efficacy and safety of mycophenolate mofetil (MMF) combined with methotrexate (MTX) compared to cyclophosphamide (CYC) followed by azathioprine (AZA) to treat active Takayasu arteritis (TAK). Adults with active TAK were randomised in a 2:1 ratio to receive oral MMF plus MTX or intravenous CYC followed by oral AZA. All subjects also received high-dose oral glucocorticoids with a predefined taper. The primary endpoint was overall response rate at week 52, defined as achieving a complete response (CR) or partial response (PR). Secondary endpoints included rates of CR and PR at weeks 28 and 52. A total of 111 patients with TAK were enrolled: 74 in the MMF+MTX group and 37 in the CYC/AZA group, with comparable baseline demographic and clinical features. The overall response rates at 28 and 52 weeks were 58.1% and 55.4% in the MMF+MTX group, respectively, higher than 32.4% at both time points in the CYC/AZA group (P = .011 and .022). CR and PR rates at 28 and 52 weeks were also higher in the MMF+MTX group. Relapse occurred in 4 patients in the MMF+MTX group and 2 in the CYC/AZA group. One serious adverse event, neutropenia with fever, occurred in 1 patient in the CYC/AZA group. Treatment of active TAK with MMF+MTX has more favourable efficacy compared to CYC/AZA. These findings provide evidence to use the combination of MTX and MMF, 2 generally well-tolerated and inexpensive therapies, to treat TAK.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "Study the efficacy and safety of mycophenolate mofetil (MMF) combined with methotrexate (MTX) compared to cyclophosphamide (CYC) followed by azathioprine (AZA) to treat active Takayasu arteritis (TAK)."
        },
        {
          "label": "METHODS",
          "text": "Adults with active TAK were randomised in a 2:1 ratio to receive oral MMF plus MTX or intravenous CYC followed by oral AZA. All subjects also received high-dose oral glucocorticoids with a predefined taper. The primary endpoint was overall response rate at week 52, defined as achieving a complete response (CR) or partial response (PR). Secondary endpoints included rates of CR and PR at weeks 28 and 52."
        },
        {
          "label": "RESULTS",
          "text": "A total of 111 patients with TAK were enrolled: 74 in the MMF+MTX group and 37 in the CYC/AZA group, with comparable baseline demographic and clinical features. The overall response rates at 28 and 52 weeks were 58.1% and 55.4% in the MMF+MTX group, respectively, higher than 32.4% at both time points in the CYC/AZA group (P = .011 and .022). CR and PR rates at 28 and 52 weeks were also higher in the MMF+MTX group. Relapse occurred in 4 patients in the MMF+MTX group and 2 in the CYC/AZA group. One serious adverse event, neutropenia with fever, occurred in 1 patient in the CYC/AZA group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Treatment of active TAK with MMF+MTX has more favourable efficacy compared to CYC/AZA. These findings provide evidence to use the combination of MTX and MMF, 2 generally well-tolerated and inexpensive therapies, to treat TAK."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40849269/",
      "pubDate": "2025 Aug 22",
      "doi": "10.1016/j.ard.2025.07.018",
      "dateReceived": "2025-09-08T23:23:37.912Z",
      "isNew": true,
      "summary": "The combination of mycophenolate mofetil (MMF) and methotrexate (MTX) is a more effective treatment for active Takayasu arteritis (TAK) than cyclophosphamide (CYC) or azathioprine (AZA)."
    },
    {
      "id": "339b70a2b01a",
      "title": "Efficacy and safety of cAMP-biased GLP-1 receptor agonist ecnoglutide versus dulaglutide in patients with type 2 diabetes and elevated glucose concentrations on metformin monotherapy (EECOH-2): a 52-week, multicentre, open-label, non-inferiority, randomised, phase 3 trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48076287/117511",
      "abstract": "Ecnoglutide is a novel biased GLP-1 receptor agonist that preferentially activates the cAMP pathway over β-arrestin recruitment. We aimed to assess both non-inferiority and superiority of ecnoglutide versus dulaglutide, also a GLP-1 receptor agonist, in patients with type 2 diabetes. We conducted a 52-week, open-label, active-controlled, phase 3 trial at 52 hospitals in China. Adults aged 18-75 years with a BMI of 20-35 kg/m, a diagnosis of type 2 diabetes, and elevated glucose concentrations on metformin monotherapy were included. Participants were randomly assigned (1:1:1) to receive subcutaneous ecnoglutide (0·6 mg or 1·2 mg) or dulaglutide (1·5 mg) once weekly. The primary endpoint was mean change from baseline in HbA at week 32 (non-inferiority for ecnoglutide 0·6 mg and 1·2 mg, with a 0·4% non-inferiority margin; superiority for ecnoglutide 1·2 mg) and was assessed in all randomly assigned participants who received at least one dose of study treatment (full analysis set). Safety was assessed in all randomly assigned participants who received at least one dose of study drug and had at least one safety evaluation after starting treatment. This trial is registered with ClinicalTrials.gov (NCT05680129) and has ended. Between Jan 10 and May 30, 2023, 623 participants were randomly assigned, of whom 621 comprised the full analysis set (mean age 53·9 years [SD 10·1], 347 [56%] males, 274 [44%] females, and mean HbA 8·40% [SD 0·78]; 68·28 mmol/mol [8·56]; 206 in the ecnoglutide 0·6 mg group, 208 in the ecnoglutide 1·2 mg group, and 207 in the dulaglutide 1·5 mg group). At week 32, mean HbA reductions were 1·91% (SE 0·05; -20·86 mmol/mol [0·53]) with ecnoglutide 0·6 mg, 1·89% (0·05; -20·69 mmol/mol [0·54]) with ecnoglutide 1·2 mg, and 1·65% (0·05; -18·02 mmol/mol [0·53]) with dulaglutide. Estimated treatment differences versus dulaglutide were -0·26% (95% CI -0·39 to -0·13; -2·84 mmol/mol [-4·29 to -1·38]) with ecnoglutide 0·6 mg and -0·24% (-0·38 to -0·11; -2·67 mmol/mol [-4·14 to -1·20]; p=0·0002 for superiority) with ecnoglutide 1·2 mg. HbA reductions were sustained to week 52. During the 52 weeks, six (3%) of 206 patients in the ecnoglutide 0·6 mg group, eight (4%) of 208 patients in the ecnoglutide 1·2 mg group, and six (3%) of 207 patients in the dulaglutide group discontinued treatment due to adverse events. Once-weekly ecnoglutide 0·6 mg and 1·2 mg were non-inferior to dulaglutide 1·5 mg in reducing HbA in adults with type 2 diabetes and elevated glucose concentrations on metformin monotherapy. Although the 1·2 mg dose showed statistically significantly greater reductions in HbA from baseline to week 32 than dulaglutide 1·5 mg, the difference was not considered clinically relevant. Both doses of ecnoglutide were well tolerated. These results suggest that ecnoglutide might offer a new treatment option for type 2 diabetes. Hangzhou Sciwind Biosciences.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Ecnoglutide is a novel biased GLP-1 receptor agonist that preferentially activates the cAMP pathway over β-arrestin recruitment. We aimed to assess both non-inferiority and superiority of ecnoglutide versus dulaglutide, also a GLP-1 receptor agonist, in patients with type 2 diabetes."
        },
        {
          "label": "METHODS",
          "text": "We conducted a 52-week, open-label, active-controlled, phase 3 trial at 52 hospitals in China. Adults aged 18-75 years with a BMI of 20-35 kg/m, a diagnosis of type 2 diabetes, and elevated glucose concentrations on metformin monotherapy were included. Participants were randomly assigned (1:1:1) to receive subcutaneous ecnoglutide (0·6 mg or 1·2 mg) or dulaglutide (1·5 mg) once weekly. The primary endpoint was mean change from baseline in HbA at week 32 (non-inferiority for ecnoglutide 0·6 mg and 1·2 mg, with a 0·4% non-inferiority margin; superiority for ecnoglutide 1·2 mg) and was assessed in all randomly assigned participants who received at least one dose of study treatment (full analysis set). Safety was assessed in all randomly assigned participants who received at least one dose of study drug and had at least one safety evaluation after starting treatment. This trial is registered with ClinicalTrials.gov (NCT05680129) and has ended."
        },
        {
          "label": "FINDINGS",
          "text": "Between Jan 10 and May 30, 2023, 623 participants were randomly assigned, of whom 621 comprised the full analysis set (mean age 53·9 years [SD 10·1], 347 [56%] males, 274 [44%] females, and mean HbA 8·40% [SD 0·78]; 68·28 mmol/mol [8·56]; 206 in the ecnoglutide 0·6 mg group, 208 in the ecnoglutide 1·2 mg group, and 207 in the dulaglutide 1·5 mg group). At week 32, mean HbA reductions were 1·91% (SE 0·05; -20·86 mmol/mol [0·53]) with ecnoglutide 0·6 mg, 1·89% (0·05; -20·69 mmol/mol [0·54]) with ecnoglutide 1·2 mg, and 1·65% (0·05; -18·02 mmol/mol [0·53]) with dulaglutide. Estimated treatment differences versus dulaglutide were -0·26% (95% CI -0·39 to -0·13; -2·84 mmol/mol [-4·29 to -1·38]) with ecnoglutide 0·6 mg and -0·24% (-0·38 to -0·11; -2·67 mmol/mol [-4·14 to -1·20]; p=0·0002 for superiority) with ecnoglutide 1·2 mg. HbA reductions were sustained to week 52. During the 52 weeks, six (3%) of 206 patients in the ecnoglutide 0·6 mg group, eight (4%) of 208 patients in the ecnoglutide 1·2 mg group, and six (3%) of 207 patients in the dulaglutide group discontinued treatment due to adverse events."
        },
        {
          "label": "INTERPRETATION",
          "text": "Once-weekly ecnoglutide 0·6 mg and 1·2 mg were non-inferior to dulaglutide 1·5 mg in reducing HbA in adults with type 2 diabetes and elevated glucose concentrations on metformin monotherapy. Although the 1·2 mg dose showed statistically significantly greater reductions in HbA from baseline to week 32 than dulaglutide 1·5 mg, the difference was not considered clinically relevant. Both doses of ecnoglutide were well tolerated. These results suggest that ecnoglutide might offer a new treatment option for type 2 diabetes."
        },
        {
          "label": "FUNDING",
          "text": "Hangzhou Sciwind Biosciences."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40854315/",
      "pubDate": "2025 Aug 21",
      "doi": "10.1016/S2213-8587(25)00196-2",
      "dateReceived": "2025-09-08T23:23:37.912Z",
      "isNew": true,
      "summary": "Ecnoglutide (0.6 mg and 1.2 mg) demonstrated non-inferiority and superiority in HbA1c reduction compared to dulaglutide (1.5 mg) in adults with type 2 diabetes."
    },
    {
      "id": "5367f97e5770",
      "title": "Expedited transfer from the scene for refractory out-of-hospital cardiac arrest in Australia: a prospective, multicentre, parallel, open label, randomised clinical trial.",
      "journal": "Lancet Respir Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48065394/117507",
      "dateReceived": "2025-09-07T23:21:54.350Z",
      "isNew": false
    },
    {
      "id": "b1f71727ade2",
      "title": "Low-complexity automated nucleic acid amplification tests for extrapulmonary tuberculosis and rifampicin resistance in adults and adolescents.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47959919/117348",
      "abstract": "Low-complexity automated nucleic acid amplification tests (LC-aNAATs) are molecular World Health Organization (WHO)-recommended rapid diagnostic tests widely used for simultaneous detection of Mycobacterium tuberculosis complex and rifampicin resistance in sputum. To extend our previous review on extrapulmonary tuberculosis, we performed this update to inform a WHO policy update. To estimate the diagnostic accuracy of LC-aNAATs for extrapulmonary tuberculosis and rifampicin resistance in adults and adolescents with presumptive extrapulmonary tuberculosis. We searched the Cochrane Central Register of Controlled Trials, MEDLINE, Embase, Science Citation Index, Latin American Caribbean Health Sciences Literature, Scopus, ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, the International Standard Randomized Controlled Trial Number Registry, and ProQuest, up to 11 October 2023, without language restriction. A WHO public call for data was made between 30th November 2023 and 15th February 2024 to identify unpublished studies. We included cross-sectional and cohort studies using non-respiratory specimens and eight forms of extrapulmonary tuberculosis: tuberculous meningitis and pleural, lymph node, bone or joint, genitourinary, peritoneal, pericardial, and disseminated tuberculosis. Reference standards were culture and a study-defined composite reference standard (tuberculosis detection); and phenotypic drug susceptibility testing with or without genotypic drug susceptibility testing (rifampicin resistance detection). Index tests included Xpert Ultra, Truenat assays, STANDARD M10, and Iron qPCR. Two review authors independently extracted data and assessed the risk of bias and applicability using the QUADAS-2 tool. For tuberculosis detection, we performed separate analyses by specimen type and reference standard using the bivariate model to estimate summary sensitivity and specificity with 95% confidence intervals (CIs). Based on a pre-defined condition, based on sample sizes and type of technology for performing class-based analysis, data for Truenat MTB Plus were not included in the meta-analyses for LC-aNAATs. Hence, we present results for Xpert Ultra and Truenat MTB Plus separately. We assessed the certainty of evidence using the GRADE approach. We included 37 unique studies where 36 studies evaluated Xpert Ultra and three studies evaluated Truenat MTB plus. We found no eligible studies for the other index tests. Overall, the risk of bias was low for patient selection, index test, and flow and timing domains. For the reference standard, the risk of bias for included studies was low (75%) or unclear (25%). Applicability for the patient selection domain was unclear for most studies because we were unsure of the clinical settings, and the applicability concern was low for most studies for the reference standard domain. Cerebrospinal fluid Xpert Ultra (16 studies) Xpert Ultra summary sensitivity and specificity (95% CI) against a microbiological reference standard were 88.2% (83.7 to 91.6) (287 participants; high-certainty evidence) and 96.0% (86.8 to 98.9) (1397 participants; moderate-certainty evidence). Truenat MTB Plus (2 studies) There were not enough data to meta-analyze, and we have provided descriptive results for Truenat MTB Plus. The sensitivities in these two studies ranged from 95% to 100% while the specificities ranged from 55% to 100% against a microbiological reference standard. The sensitivity was 78.7% (70 to 86) and the specificity was 100% (91 to 100) against a composite reference standard from a single study. Pleural fluid Xpert Ultra (13 studies) Xpert Ultra summary sensitivity and specificity against a microbiological reference standard were 74.0% (60.8 to 83.9; 264 participants; low-certainty evidence) and 88.1% (78.8 to 93.6; 777 participants; very low-certainty evidence). Truenat MTB Plus (1 study) The sensitivity was 100% (2.5 to 100) and specificity was 100% (95.3 to 100) against a microbiological reference standard. Lymph node aspirate Xpert Ultra (6 studies) Xpert Ultra summary sensitivity and specificity (95% CI) against a composite reference standard were 71.3% (64.3 to 77.4) (243 participants; moderate-certainty evidence) and 97.4% (82.3 to 99.7) (218 participants; very low-certainty evidence). Truenat MTB Plus (1 study) The sensitivity and specificity were 77.1% (66 to 86) and 100% (88 to 100), respectively, against a microbiological reference standard. The sensitivity was 100% (81 to 100) and specificity was 56% (45 to 67) against a composite reference standard. Rifampicin resistance Xpert Ultra (13 studies) Xpert Ultra summary sensitivity and specificity were 100.0% (93.4 to 100.0; 54 participants; high-certainty evidence) and 99.4% (92.1 to 100.0; 392 participants; high-certainty evidence). LC-aNAATs are helpful in diagnosing extrapulmonary tuberculosis. Sensitivity varies across different extrapulmonary specimens, while for most specimens specificity is high, the tests rarely yielding a positive result for people without tuberculosis. For tuberculous meningitis, Xpert Ultra had high sensitivity against culture. Xpert Ultra also had high sensitivity and specificity for rifampicin resistance. Future research should acknowledge the concern associated with culture as a reference standard in paucibacillary specimens and consider ways to address this limitation. Additionally, there is a critical need for robust evidence on other technologies within the LC-aNAAT class. Funded by the WHO Global Tuberculosis Program. This is an update to the published review \"Xpert MTB/RIF Ultra and Xpert MTB/RIF assays for extrapulmonary tuberculosis and rifampicin resistance in adults\" via doi: 10.1002/14651858.CD012768.pub3.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Low-complexity automated nucleic acid amplification tests (LC-aNAATs) are molecular World Health Organization (WHO)-recommended rapid diagnostic tests widely used for simultaneous detection of Mycobacterium tuberculosis complex and rifampicin resistance in sputum. To extend our previous review on extrapulmonary tuberculosis, we performed this update to inform a WHO policy update."
        },
        {
          "label": "OBJECTIVES",
          "text": "To estimate the diagnostic accuracy of LC-aNAATs for extrapulmonary tuberculosis and rifampicin resistance in adults and adolescents with presumptive extrapulmonary tuberculosis."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials, MEDLINE, Embase, Science Citation Index, Latin American Caribbean Health Sciences Literature, Scopus, ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, the International Standard Randomized Controlled Trial Number Registry, and ProQuest, up to 11 October 2023, without language restriction. A WHO public call for data was made between 30th November 2023 and 15th February 2024 to identify unpublished studies."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included cross-sectional and cohort studies using non-respiratory specimens and eight forms of extrapulmonary tuberculosis: tuberculous meningitis and pleural, lymph node, bone or joint, genitourinary, peritoneal, pericardial, and disseminated tuberculosis. Reference standards were culture and a study-defined composite reference standard (tuberculosis detection); and phenotypic drug susceptibility testing with or without genotypic drug susceptibility testing (rifampicin resistance detection). Index tests included Xpert Ultra, Truenat assays, STANDARD M10, and Iron qPCR."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Two review authors independently extracted data and assessed the risk of bias and applicability using the QUADAS-2 tool. For tuberculosis detection, we performed separate analyses by specimen type and reference standard using the bivariate model to estimate summary sensitivity and specificity with 95% confidence intervals (CIs). Based on a pre-defined condition, based on sample sizes and type of technology for performing class-based analysis, data for Truenat MTB Plus were not included in the meta-analyses for LC-aNAATs. Hence, we present results for Xpert Ultra and Truenat MTB Plus separately. We assessed the certainty of evidence using the GRADE approach."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 37 unique studies where 36 studies evaluated Xpert Ultra and three studies evaluated Truenat MTB plus. We found no eligible studies for the other index tests. Overall, the risk of bias was low for patient selection, index test, and flow and timing domains. For the reference standard, the risk of bias for included studies was low (75%) or unclear (25%). Applicability for the patient selection domain was unclear for most studies because we were unsure of the clinical settings, and the applicability concern was low for most studies for the reference standard domain. Cerebrospinal fluid Xpert Ultra (16 studies) Xpert Ultra summary sensitivity and specificity (95% CI) against a microbiological reference standard were 88.2% (83.7 to 91.6) (287 participants; high-certainty evidence) and 96.0% (86.8 to 98.9) (1397 participants; moderate-certainty evidence). Truenat MTB Plus (2 studies) There were not enough data to meta-analyze, and we have provided descriptive results for Truenat MTB Plus. The sensitivities in these two studies ranged from 95% to 100% while the specificities ranged from 55% to 100% against a microbiological reference standard. The sensitivity was 78.7% (70 to 86) and the specificity was 100% (91 to 100) against a composite reference standard from a single study. Pleural fluid Xpert Ultra (13 studies) Xpert Ultra summary sensitivity and specificity against a microbiological reference standard were 74.0% (60.8 to 83.9; 264 participants; low-certainty evidence) and 88.1% (78.8 to 93.6; 777 participants; very low-certainty evidence). Truenat MTB Plus (1 study) The sensitivity was 100% (2.5 to 100) and specificity was 100% (95.3 to 100) against a microbiological reference standard. Lymph node aspirate Xpert Ultra (6 studies) Xpert Ultra summary sensitivity and specificity (95% CI) against a composite reference standard were 71.3% (64.3 to 77.4) (243 participants; moderate-certainty evidence) and 97.4% (82.3 to 99.7) (218 participants; very low-certainty evidence). Truenat MTB Plus (1 study) The sensitivity and specificity were 77.1% (66 to 86) and 100% (88 to 100), respectively, against a microbiological reference standard. The sensitivity was 100% (81 to 100) and specificity was 56% (45 to 67) against a composite reference standard. Rifampicin resistance Xpert Ultra (13 studies) Xpert Ultra summary sensitivity and specificity were 100.0% (93.4 to 100.0; 54 participants; high-certainty evidence) and 99.4% (92.1 to 100.0; 392 participants; high-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "LC-aNAATs are helpful in diagnosing extrapulmonary tuberculosis. Sensitivity varies across different extrapulmonary specimens, while for most specimens specificity is high, the tests rarely yielding a positive result for people without tuberculosis. For tuberculous meningitis, Xpert Ultra had high sensitivity against culture. Xpert Ultra also had high sensitivity and specificity for rifampicin resistance. Future research should acknowledge the concern associated with culture as a reference standard in paucibacillary specimens and consider ways to address this limitation. Additionally, there is a critical need for robust evidence on other technologies within the LC-aNAAT class."
        },
        {
          "label": "FUNDING",
          "text": "Funded by the WHO Global Tuberculosis Program."
        },
        {
          "label": "REGISTRATION",
          "text": "This is an update to the published review \"Xpert MTB/RIF Ultra and Xpert MTB/RIF assays for extrapulmonary tuberculosis and rifampicin resistance in adults\" via doi: 10.1002/14651858.CD012768.pub3."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40757508/",
      "pubDate": "2025 Aug 04",
      "doi": "10.1002/14651858.CD012768.pub4",
      "dateReceived": "2025-09-07T23:21:54.350Z",
      "isNew": false,
      "summary": "LC-aNAATs are useful for diagnosing extrapulmonary tuberculosis, with varying sensitivity depending on the specimen type, and Xpert Ultra is particularly effective for tuberculous meningitis and rifampicin resistance detection."
    },
    {
      "id": "f577d95fd46f",
      "title": "Measurement-Based Care to Enhance Antidepressant Treatment Outcomes in Major Depressive Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48065394/117544",
      "abstract": "Measurement-based care (MBC) guides clinical decisions through structured monitoring of symptoms and adverse effects. Although MBC has been associated with improved outcomes in major depressive disorder (MDD), its effectiveness in low- and middle-income countries (LMICs) remains understudied. To assess whether MBC accelerates the resolution of depressive symptoms compared with standard care among adults with MDD in Pakistan. This multicenter, assessor-blinded, parallel-arm randomized clinical trial was conducted in Pakistan from September 2022 to January 2024, with 24 weeks of follow-up. Adults diagnosed with nonpsychotic MDD were recruited from psychiatric hospitals and primary care centers in 7 Pakistani cities (Karachi, Lahore, Rawalpindi, Hyderabad, Peshawar, Multan, and Quetta). Participants were randomized 1:1 to MBC or standard care. Intention-to-treat analyses were conducted. By design, pharmacotherapy was limited to paroxetine or mirtazapine in both MBC or standard care groups. The MBC group completed the 16-item Quick Inventory of Depressive Symptomatology-Self-Report and the Frequency, Intensity, and Burden of Side Effects Rating Scale at each visit (baseline and weeks 2, 4, 8, 12, and 24). Scores from these instruments informed antidepressant dose adjustments or switch. The standard care group received treatment based on clinician judgment and did not undergo repeated clinical measurements. Primary outcomes were time to response (defined as ≥50% reduction in the 17-item Hamilton Depression Rating Scale [HDRS-17]; range: 0-52, with the highest score indicating severe depression) and time to remission (defined as HDRS-17 score of ≤7) within the 24-week follow-up period. Secondary outcomes included changes in HDRS-17 scores and rates of adverse effects or treatment discontinuation. A total of 154 adults (mean [SD] age, 34.5 [10.5] years; 105 females [68.2%]) were randomized. Median (IQR) time to response was faster with MBC than with standard care (2 [2-4] weeks vs 4 [2-12] weeks); similarly, median (IQR) time to remission was faster for MBC vs standard care (4 [4-8] weeks vs 8 weeks [2 weeks to no remission] weeks). At week 24, there were no significant differences in rates of response or remission between groups. After week 24, reduction in mean HDRS-17 scores was significantly but modestly greater in the MBC group than in the standard care group (-18.1 [95% CI, 16.4-19.6] points vs -17.0 [95% CI, 15.6-18.5] points; t129 = 0.71; P < .001). No differences were observed in other secondary outcomes. This trial of adults with MDD found that MBC led to faster time to response and time to remission than standard care in low-resource settings. Future studies need to confirm the clinical effectiveness of MBC and assess its cost-effectiveness in LMICs. ClinicalTrials.gov Identifier: NCT05431374.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Measurement-based care (MBC) guides clinical decisions through structured monitoring of symptoms and adverse effects. Although MBC has been associated with improved outcomes in major depressive disorder (MDD), its effectiveness in low- and middle-income countries (LMICs) remains understudied."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess whether MBC accelerates the resolution of depressive symptoms compared with standard care among adults with MDD in Pakistan."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This multicenter, assessor-blinded, parallel-arm randomized clinical trial was conducted in Pakistan from September 2022 to January 2024, with 24 weeks of follow-up. Adults diagnosed with nonpsychotic MDD were recruited from psychiatric hospitals and primary care centers in 7 Pakistani cities (Karachi, Lahore, Rawalpindi, Hyderabad, Peshawar, Multan, and Quetta). Participants were randomized 1:1 to MBC or standard care. Intention-to-treat analyses were conducted."
        },
        {
          "label": "INTERVENTIONS",
          "text": "By design, pharmacotherapy was limited to paroxetine or mirtazapine in both MBC or standard care groups. The MBC group completed the 16-item Quick Inventory of Depressive Symptomatology-Self-Report and the Frequency, Intensity, and Burden of Side Effects Rating Scale at each visit (baseline and weeks 2, 4, 8, 12, and 24). Scores from these instruments informed antidepressant dose adjustments or switch. The standard care group received treatment based on clinician judgment and did not undergo repeated clinical measurements."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Primary outcomes were time to response (defined as ≥50% reduction in the 17-item Hamilton Depression Rating Scale [HDRS-17]; range: 0-52, with the highest score indicating severe depression) and time to remission (defined as HDRS-17 score of ≤7) within the 24-week follow-up period. Secondary outcomes included changes in HDRS-17 scores and rates of adverse effects or treatment discontinuation."
        },
        {
          "label": "RESULTS",
          "text": "A total of 154 adults (mean [SD] age, 34.5 [10.5] years; 105 females [68.2%]) were randomized. Median (IQR) time to response was faster with MBC than with standard care (2 [2-4] weeks vs 4 [2-12] weeks); similarly, median (IQR) time to remission was faster for MBC vs standard care (4 [4-8] weeks vs 8 weeks [2 weeks to no remission] weeks). At week 24, there were no significant differences in rates of response or remission between groups. After week 24, reduction in mean HDRS-17 scores was significantly but modestly greater in the MBC group than in the standard care group (-18.1 [95% CI, 16.4-19.6] points vs -17.0 [95% CI, 15.6-18.5] points; t129 = 0.71; P < .001). No differences were observed in other secondary outcomes."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This trial of adults with MDD found that MBC led to faster time to response and time to remission than standard care in low-resource settings. Future studies need to confirm the clinical effectiveness of MBC and assess its cost-effectiveness in LMICs."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05431374."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892412/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamanetworkopen.2025.29427",
      "dateReceived": "2025-09-07T23:21:54.349Z",
      "isNew": false,
      "summary": "MBC resulted in quicker responses and remission compared to standard care for adults with MDD in low-resource settings."
    },
    {
      "id": "4f805830aa77",
      "title": "Digitoxin in Patients with Heart Failure and Reduced Ejection Fraction.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48065394/117510",
      "abstract": "The therapeutic efficacy of the cardiac glycoside digitoxin in patients with heart failure and reduced ejection fraction is not established. In this international, double-blind, placebo-controlled trial, we randomly assigned patients with chronic heart failure who had a left ventricular ejection fraction of 40% or less and a New York Heart Association (NYHA) functional class of III or IV or a left ventricular ejection fraction of 30% or less and an NYHA functional class of II in a 1:1 ratio to receive digitoxin (at a starting dose of 0.07 mg once daily) or matching placebo in addition to guideline-directed medical therapy. The primary outcome was a composite of death from any cause or hospital admission for worsening heart failure, whichever occurred first. Among 1240 patients who underwent randomization, 1212 fulfilled the criteria for inclusion in the modified intention-to-treat population: 613 patients in the digitoxin group and 599 in the placebo group. Over a median follow-up of 36 months, a primary-outcome event occurred in 242 patients (39.5%) in the digitoxin group and 264 (44.1%) in the placebo group (hazard ratio for death or first hospital admission for worsening heart failure, 0.82; 95% confidence interval [CI], 0.69 to 0.98; P = 0.03). Death from any cause occurred in 167 patients (27.2%) in the digitoxin group and 177 (29.5%) in the placebo group (hazard ratio, 0.86; 95% CI, 0.69 to 1.07). A first hospital admission for worsening heart failure occurred in 172 patients (28.1%) in the digitoxin group and 182 (30.4%) in the placebo group (hazard ratio, 0.85; 95% CI, 0.69 to 1.05). At least one serious adverse event occurred in 29 patients (4.7%) in the digitoxin group and 17 (2.8%) in the placebo group. Treatment with digitoxin led to a lower combined risk of death from any cause or hospital admission for worsening heart failure than placebo among patients with heart failure and reduced ejection fraction who received guideline-directed medical therapy. (Funded by the German Federal Ministry of Research, Technology, and Space and others; DIGIT-HF EudraCT number, 2013-005326-38.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The therapeutic efficacy of the cardiac glycoside digitoxin in patients with heart failure and reduced ejection fraction is not established."
        },
        {
          "label": "METHODS",
          "text": "In this international, double-blind, placebo-controlled trial, we randomly assigned patients with chronic heart failure who had a left ventricular ejection fraction of 40% or less and a New York Heart Association (NYHA) functional class of III or IV or a left ventricular ejection fraction of 30% or less and an NYHA functional class of II in a 1:1 ratio to receive digitoxin (at a starting dose of 0.07 mg once daily) or matching placebo in addition to guideline-directed medical therapy. The primary outcome was a composite of death from any cause or hospital admission for worsening heart failure, whichever occurred first."
        },
        {
          "label": "RESULTS",
          "text": "Among 1240 patients who underwent randomization, 1212 fulfilled the criteria for inclusion in the modified intention-to-treat population: 613 patients in the digitoxin group and 599 in the placebo group. Over a median follow-up of 36 months, a primary-outcome event occurred in 242 patients (39.5%) in the digitoxin group and 264 (44.1%) in the placebo group (hazard ratio for death or first hospital admission for worsening heart failure, 0.82; 95% confidence interval [CI], 0.69 to 0.98; P = 0.03). Death from any cause occurred in 167 patients (27.2%) in the digitoxin group and 177 (29.5%) in the placebo group (hazard ratio, 0.86; 95% CI, 0.69 to 1.07). A first hospital admission for worsening heart failure occurred in 172 patients (28.1%) in the digitoxin group and 182 (30.4%) in the placebo group (hazard ratio, 0.85; 95% CI, 0.69 to 1.05). At least one serious adverse event occurred in 29 patients (4.7%) in the digitoxin group and 17 (2.8%) in the placebo group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Treatment with digitoxin led to a lower combined risk of death from any cause or hospital admission for worsening heart failure than placebo among patients with heart failure and reduced ejection fraction who received guideline-directed medical therapy. (Funded by the German Federal Ministry of Research, Technology, and Space and others; DIGIT-HF EudraCT number, 2013-005326-38.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40879434/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1056/NEJMoa2415471",
      "dateReceived": "2025-09-07T23:21:54.349Z",
      "isNew": false,
      "summary": "Digitoxin reduced the combined risk of death and heart failure hospitalization compared to placebo in heart failure patients with reduced ejection fraction receiving standard medical care."
    },
    {
      "id": "f2e4c3097aa9",
      "title": "Cannabidiol versus placebo in patients with fibromyalgia: a randomised, double-blind, placebo-controlled, parallel-group, single-centre trial.",
      "journal": "Ann Rheum Dis",
      "score": "5/7",
      "tags": [
        "Rheumatology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48065394/117509",
      "abstract": "Cannabidiol (CBD) is used to alleviate fibromyalgia pain despite limited evidence for efficacy. This study assessed the efficacy and safety of CBD vs placebo in patients with fibromyalgia, hypothesising that CBD would be superior to placebo in reducing pain. In this single-centre, double-blind, randomised, placebo-controlled trial, patients diagnosed with fibromyalgia were recruited from a specialised outpatient clinic in Denmark. Eligible participants were randomised 1:1 and stratified by sex, defined as biological sex assigned at birth based on physical anatomy. Age (<45 vs ≥45), and pain level (<7 vs ≥7) on a 0 to 10 numeric rating scale (NRS) to receive 50 mg plant-derived CBD or placebo tablets. The primary outcome was change in pain intensity at week 24, assessed on the NRS pain subitem in the revised Fibromyalgia Impact Questionnaire in the intention-to-treat population. Adverse events were monitored throughout the study in the safety population. Of 273 participants screened for eligibility, 200 were included and randomised to receive CBD (n = 100) or placebo (n = 100). At week 24, mean change in pain intensity was -0.4 points (95% CI: -0.82 to 0.08) in the CBD group and -1.1 points (95% CI: -1.53 to -0.63) in the placebo group, corresponding to a between-group difference of -0.7 points (95% CI: -1.2 to -0.25; P = .0028) favouring placebo. Adverse events were generally mild and evenly distributed between groups. The findings do not support CBD 50 mg daily as an analgesic supplement for patients with fibromyalgia. gov number: NCT04729179.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "Cannabidiol (CBD) is used to alleviate fibromyalgia pain despite limited evidence for efficacy. This study assessed the efficacy and safety of CBD vs placebo in patients with fibromyalgia, hypothesising that CBD would be superior to placebo in reducing pain."
        },
        {
          "label": "METHODS",
          "text": "In this single-centre, double-blind, randomised, placebo-controlled trial, patients diagnosed with fibromyalgia were recruited from a specialised outpatient clinic in Denmark. Eligible participants were randomised 1:1 and stratified by sex, defined as biological sex assigned at birth based on physical anatomy. Age (<45 vs ≥45), and pain level (<7 vs ≥7) on a 0 to 10 numeric rating scale (NRS) to receive 50 mg plant-derived CBD or placebo tablets. The primary outcome was change in pain intensity at week 24, assessed on the NRS pain subitem in the revised Fibromyalgia Impact Questionnaire in the intention-to-treat population. Adverse events were monitored throughout the study in the safety population."
        },
        {
          "label": "RESULTS",
          "text": "Of 273 participants screened for eligibility, 200 were included and randomised to receive CBD (n = 100) or placebo (n = 100). At week 24, mean change in pain intensity was -0.4 points (95% CI: -0.82 to 0.08) in the CBD group and -1.1 points (95% CI: -1.53 to -0.63) in the placebo group, corresponding to a between-group difference of -0.7 points (95% CI: -1.2 to -0.25; P = .0028) favouring placebo. Adverse events were generally mild and evenly distributed between groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The findings do not support CBD 50 mg daily as an analgesic supplement for patients with fibromyalgia."
        },
        {
          "label": "CLINICALTRIALS",
          "text": "gov number: NCT04729179."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40846590/",
      "pubDate": "2025 Aug 21",
      "doi": "10.1016/j.ard.2025.07.008",
      "dateReceived": "2025-09-07T23:21:54.349Z",
      "isNew": false,
      "summary": "CBD 50 mg daily did not alleviate pain in fibromyalgia patients."
    },
    {
      "id": "908144686325",
      "title": "Early Withdrawal of Aspirin after PCI in Acute Coronary Syndromes.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48045231/117526",
      "abstract": "Whether potent P2Y12 inhibitor monotherapy without aspirin initiated shortly after successful percutaneous coronary intervention (PCI) is effective and safe for patients with acute coronary syndromes is unclear. We conducted a multicenter, open-label, randomized trial in Brazil involving patients with acute coronary syndromes who had undergone successful PCI. Patients were assigned in a 1:1 ratio within the first 4 days of hospitalization to stop treatment with aspirin and receive potent P2Y12 inhibitor monotherapy (ticagrelor or prasugrel) or to receive dual antiplatelet therapy (aspirin and a potent P2Y12 inhibitor) for 12 months. The two ranked primary outcomes, assessed through 12 months, were a composite of death from any cause, myocardial infarction, stroke, or urgent target-vessel revascularization (tested for noninferiority, with a noninferiority margin of 2.5 percentage points) and major or clinically relevant nonmajor bleeding (tested for superiority). A total of 3410 patients were included in the intention-to-treat population (1712 in the monotherapy group and 1698 in the dual antiplatelet therapy group). At 12 months, death from any cause, myocardial infarction, stroke, or urgent revascularization had occurred in 119 patients (Kaplan-Meier estimate, 7.0%) in the monotherapy group and in 93 patients (Kaplan-Meier estimate, 5.5%) in the dual antiplatelet therapy group (absolute risk difference, 1.47 percentage points; 95% confidence interval [CI], -0.16 to 3.10; P = 0.11 for noninferiority). Major or clinically relevant nonmajor bleeding had occurred in 33 patients (Kaplan-Meier estimate, 2.0%) in the monotherapy group and in 82 patients (Kaplan-Meier estimate, 4.9%) in the dual antiplatelet therapy group (absolute risk difference, -2.97 percentage points; 95% CI, -4.20 to -1.73). Stent thrombosis occurred in 12 patients in the monotherapy group and in 4 in the dual antiplatelet therapy group. Among patients who had undergone successful PCI for acute coronary syndromes, potent P2Y12 inhibitor monotherapy was not found to be noninferior to dual antiplatelet therapy with respect to a composite of death or ischemic events at 12 months. (Funded by the Brazilian Ministry of Health; NEO-MINDSET ClinicalTrials.gov number, NCT04360720.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Whether potent P2Y12 inhibitor monotherapy without aspirin initiated shortly after successful percutaneous coronary intervention (PCI) is effective and safe for patients with acute coronary syndromes is unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted a multicenter, open-label, randomized trial in Brazil involving patients with acute coronary syndromes who had undergone successful PCI. Patients were assigned in a 1:1 ratio within the first 4 days of hospitalization to stop treatment with aspirin and receive potent P2Y12 inhibitor monotherapy (ticagrelor or prasugrel) or to receive dual antiplatelet therapy (aspirin and a potent P2Y12 inhibitor) for 12 months. The two ranked primary outcomes, assessed through 12 months, were a composite of death from any cause, myocardial infarction, stroke, or urgent target-vessel revascularization (tested for noninferiority, with a noninferiority margin of 2.5 percentage points) and major or clinically relevant nonmajor bleeding (tested for superiority)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 3410 patients were included in the intention-to-treat population (1712 in the monotherapy group and 1698 in the dual antiplatelet therapy group). At 12 months, death from any cause, myocardial infarction, stroke, or urgent revascularization had occurred in 119 patients (Kaplan-Meier estimate, 7.0%) in the monotherapy group and in 93 patients (Kaplan-Meier estimate, 5.5%) in the dual antiplatelet therapy group (absolute risk difference, 1.47 percentage points; 95% confidence interval [CI], -0.16 to 3.10; P = 0.11 for noninferiority). Major or clinically relevant nonmajor bleeding had occurred in 33 patients (Kaplan-Meier estimate, 2.0%) in the monotherapy group and in 82 patients (Kaplan-Meier estimate, 4.9%) in the dual antiplatelet therapy group (absolute risk difference, -2.97 percentage points; 95% CI, -4.20 to -1.73). Stent thrombosis occurred in 12 patients in the monotherapy group and in 4 in the dual antiplatelet therapy group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients who had undergone successful PCI for acute coronary syndromes, potent P2Y12 inhibitor monotherapy was not found to be noninferior to dual antiplatelet therapy with respect to a composite of death or ischemic events at 12 months. (Funded by the Brazilian Ministry of Health; NEO-MINDSET ClinicalTrials.gov number, NCT04360720.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888723/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1056/NEJMoa2507980",
      "dateReceived": "2025-09-06T23:21:07.069Z",
      "isNew": false,
      "summary": "In patients with successful PCI for acute coronary syndromes, potent P2Y12 inhibitor monotherapy was not as effective as dual antiplatelet therapy in preventing death or ischemic events at 12 months."
    },
    {
      "id": "6a54078c3326",
      "title": "Increasing the Potassium Level in Patients at High Risk for Ventricular Arrhythmias.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48045231/117513",
      "abstract": "Hypokalemia and even low-normal plasma potassium levels increase the risk of ventricular arrhythmias among patients with cardiovascular disease. An assessment of a strategy of actively increasing plasma potassium levels to the high-normal range is needed. In this multicenter, open-label, event-driven, randomized superiority trial conducted in Denmark, we enrolled participants at high risk for ventricular arrhythmias (defined as those with an implantable cardioverter-defibrillator [ICD]) and with a baseline plasma potassium level of 4.3 mmol per liter or lower. Participants were randomly assigned, in a 1:1 ratio, to a treatment regimen aimed at increasing the plasma potassium level to a high-normal level (4.5 to 5.0 mmol per liter) by means of potassium supplementation, a mineralocorticoid receptor antagonist, or both plus dietary guidance and standard care (high-normal potassium group) or to standard care only (standard-care group). The primary end point was a composite of documented sustained ventricular tachycardia or appropriate ICD therapy, unplanned hospitalization (>24 hours) for arrhythmia or heart failure, or death from any cause, assessed in a time-to-first-event analysis. Among the 1200 participants who underwent randomization (600 assigned to each group), the median duration of follow-up was 39.6 months (interquartile range, 26.4 to 49.3). A primary end-point event occurred in 136 participants (22.7%; 7.3 events per 100 person-years) in the high-normal potassium group, as compared with 175 participants (29.2%; 9.6 events per 100 person-years) in the standard-care group (hazard ratio, 0.76; 95% confidence interval, 0.61 to 0.95; P = 0.01). The incidence of hospitalization for hyperkalemia or hypokalemia was similar in the two groups. Among participants with any cardiovascular disease who had an ICD and were at high risk for ventricular arrhythmias, a treatment-induced increase in plasma potassium levels led to a significantly lower risk of appropriate ICD therapy, unplanned hospitalization for arrhythmia or heart failure, or death from any cause than standard care. (Funded by the Independent Research Fund Denmark and others; POTCAST ClinicalTrials.gov number, NCT03833089.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Hypokalemia and even low-normal plasma potassium levels increase the risk of ventricular arrhythmias among patients with cardiovascular disease. An assessment of a strategy of actively increasing plasma potassium levels to the high-normal range is needed."
        },
        {
          "label": "METHODS",
          "text": "In this multicenter, open-label, event-driven, randomized superiority trial conducted in Denmark, we enrolled participants at high risk for ventricular arrhythmias (defined as those with an implantable cardioverter-defibrillator [ICD]) and with a baseline plasma potassium level of 4.3 mmol per liter or lower. Participants were randomly assigned, in a 1:1 ratio, to a treatment regimen aimed at increasing the plasma potassium level to a high-normal level (4.5 to 5.0 mmol per liter) by means of potassium supplementation, a mineralocorticoid receptor antagonist, or both plus dietary guidance and standard care (high-normal potassium group) or to standard care only (standard-care group). The primary end point was a composite of documented sustained ventricular tachycardia or appropriate ICD therapy, unplanned hospitalization (>24 hours) for arrhythmia or heart failure, or death from any cause, assessed in a time-to-first-event analysis."
        },
        {
          "label": "RESULTS",
          "text": "Among the 1200 participants who underwent randomization (600 assigned to each group), the median duration of follow-up was 39.6 months (interquartile range, 26.4 to 49.3). A primary end-point event occurred in 136 participants (22.7%; 7.3 events per 100 person-years) in the high-normal potassium group, as compared with 175 participants (29.2%; 9.6 events per 100 person-years) in the standard-care group (hazard ratio, 0.76; 95% confidence interval, 0.61 to 0.95; P = 0.01). The incidence of hospitalization for hyperkalemia or hypokalemia was similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among participants with any cardiovascular disease who had an ICD and were at high risk for ventricular arrhythmias, a treatment-induced increase in plasma potassium levels led to a significantly lower risk of appropriate ICD therapy, unplanned hospitalization for arrhythmia or heart failure, or death from any cause than standard care. (Funded by the Independent Research Fund Denmark and others; POTCAST ClinicalTrials.gov number, NCT03833089.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40879429/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1056/NEJMoa2509542",
      "dateReceived": "2025-09-06T23:21:07.069Z",
      "isNew": false,
      "summary": "In patients with cardiovascular disease, an increase in plasma potassium levels reduced the risk of adverse cardiac events in those with implantable cardioverter-defibrillators and at high risk for ventricular arrhythmias."
    },
    {
      "id": "f64abd5a3ccf",
      "title": "Safety and efficacy of apitegromab in nonambulatory type 2 or type 3 spinal muscular atrophy (SAPPHIRE): a phase 3, double-blind, randomised, placebo-controlled trial.",
      "journal": "Lancet Neurol",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48045231/117501",
      "abstract": "Approved spinal muscular atrophy therapies greatly improve clinical outcomes; however, substantial motor function deficits persist. Apitegromab, a fully human monoclonal antibody, selectively inhibits myostatin activation, improving muscle function. We aimed to assess the safety and efficacy of apitegromab in patients with nonambulatory type 2 or type 3 spinal muscular atrophy receiving nusinersen or risdiplam. SAPPHIRE, a double-blind, placebo-controlled, phase 3 trial, was done in 48 hospitals in Belgium, France, Germany, Italy, Poland, Spain, the Netherlands, the UK, and the USA. Eligible participants were aged 2-21 years, had genetically documented SMN-deficient nonambulatory type 2 or type 3 spinal muscular atrophy, an estimated life expectancy greater than 2 years, Hammersmith Functional Motor Scale-Expanded (HFMSE) scores 10-45, and had received at least 10 months' nusinersen or at least 6 months' risdiplam therapy at screening. Participants aged 2-12 years were randomly assigned 1:1:1 to receive apitegromab 20 mg/kg, apitegromab 10 mg/kg, or placebo every 4 weeks; participants aged 13-21 years were randomly assigned 2:1 to receive apitegromab 20 mg/kg or placebo every 4 weeks. All participants, parents or caregivers, investigators, and site personnel were unaware of the treatment assignment. The primary endpoint, change from baseline in HFMSE at 12 months, was assessed in participants aged 2-12 years who received at least one dose of apitegromab or placebo and had at least one post-baseline evaluable HFMSE assessment (modified intention-to-treat set). Comparisons of the combined apitegromab dose (20 mg/kg and 10 mg/kg) versus placebo and the 20 mg/kg dose versus placebo were done with a mixed-effects model with repeated measurement. Safety was analysed in all participants who received at least one dose of apitegromab or placebo through evaluation of adverse events, physical examinations, vital signs and cardiac assessments, laboratory evaluations, and concomitant medications. SAPPHIRE is registered with ClinicalTrials.gov, NCT05156320, and is completed. From March 28, 2022, to Sept 4, 2024, we enrolled 188 patients (156 in the population aged 2-12 years and 32 in the population aged 13-21 years); of whom 128 participants received apitegromab and 60 participants received placebo. At 12 months, least squares mean difference in HFMSE change from baseline was 1·8 (95% CI 0·30 to 3·32, p=0·019) points for participants aged 2-12 years receiving apitegromab versus placebo (least squares mean 0·6 vs -1·2). Least squares mean difference in HFMSE change from baseline was 1·4 (95% CI -0·34 to 3·13; p=0·11) for apitegromab 20 mg/kg versus placebo (least squares mean 0·2 vs -1·2). The incidence and severity of adverse events were similar between apitegromab and placebo, and consistent with spinal muscular atrophy and background spinal muscular atrophy therapy. The most frequently reported adverse events were pyrexia (apitegromab, 33 [26%] of 128 vs placebo, 17 [28%] of 60), nasopharyngitis (32 [25%] vs 14 [23%]), cough (30 [23%] vs 12 [20%]), vomiting (29 [23%] vs ten [17%]), upper respiratory tract infection (28 [22%] vs 18 [30%]), and headache (27 [21%] vs 12 [20%]). No patients discontinued due to adverse events. Participants in the apitegromab treatment groups (combined 20 mg/kg and 10 mg/kg dose) achieved statistically significant improvements in motor function compared with placebo; however, the least squares mean difference was not significant between apitegromab 20 mg/kg and placebo. Overall, SAPPHIRE results build on findings from the phase 2 TOPAZ trial, showing improved motor function with a generally well tolerated safety profile, supporting the use of muscle-targeting therapy for spinal muscular atrophy. Scholar Rock.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Approved spinal muscular atrophy therapies greatly improve clinical outcomes; however, substantial motor function deficits persist. Apitegromab, a fully human monoclonal antibody, selectively inhibits myostatin activation, improving muscle function. We aimed to assess the safety and efficacy of apitegromab in patients with nonambulatory type 2 or type 3 spinal muscular atrophy receiving nusinersen or risdiplam."
        },
        {
          "label": "METHODS",
          "text": "SAPPHIRE, a double-blind, placebo-controlled, phase 3 trial, was done in 48 hospitals in Belgium, France, Germany, Italy, Poland, Spain, the Netherlands, the UK, and the USA. Eligible participants were aged 2-21 years, had genetically documented SMN-deficient nonambulatory type 2 or type 3 spinal muscular atrophy, an estimated life expectancy greater than 2 years, Hammersmith Functional Motor Scale-Expanded (HFMSE) scores 10-45, and had received at least 10 months' nusinersen or at least 6 months' risdiplam therapy at screening. Participants aged 2-12 years were randomly assigned 1:1:1 to receive apitegromab 20 mg/kg, apitegromab 10 mg/kg, or placebo every 4 weeks; participants aged 13-21 years were randomly assigned 2:1 to receive apitegromab 20 mg/kg or placebo every 4 weeks. All participants, parents or caregivers, investigators, and site personnel were unaware of the treatment assignment. The primary endpoint, change from baseline in HFMSE at 12 months, was assessed in participants aged 2-12 years who received at least one dose of apitegromab or placebo and had at least one post-baseline evaluable HFMSE assessment (modified intention-to-treat set). Comparisons of the combined apitegromab dose (20 mg/kg and 10 mg/kg) versus placebo and the 20 mg/kg dose versus placebo were done with a mixed-effects model with repeated measurement. Safety was analysed in all participants who received at least one dose of apitegromab or placebo through evaluation of adverse events, physical examinations, vital signs and cardiac assessments, laboratory evaluations, and concomitant medications. SAPPHIRE is registered with ClinicalTrials.gov, NCT05156320, and is completed."
        },
        {
          "label": "FINDINGS",
          "text": "From March 28, 2022, to Sept 4, 2024, we enrolled 188 patients (156 in the population aged 2-12 years and 32 in the population aged 13-21 years); of whom 128 participants received apitegromab and 60 participants received placebo. At 12 months, least squares mean difference in HFMSE change from baseline was 1·8 (95% CI 0·30 to 3·32, p=0·019) points for participants aged 2-12 years receiving apitegromab versus placebo (least squares mean 0·6 vs -1·2). Least squares mean difference in HFMSE change from baseline was 1·4 (95% CI -0·34 to 3·13; p=0·11) for apitegromab 20 mg/kg versus placebo (least squares mean 0·2 vs -1·2). The incidence and severity of adverse events were similar between apitegromab and placebo, and consistent with spinal muscular atrophy and background spinal muscular atrophy therapy. The most frequently reported adverse events were pyrexia (apitegromab, 33 [26%] of 128 vs placebo, 17 [28%] of 60), nasopharyngitis (32 [25%] vs 14 [23%]), cough (30 [23%] vs 12 [20%]), vomiting (29 [23%] vs ten [17%]), upper respiratory tract infection (28 [22%] vs 18 [30%]), and headache (27 [21%] vs 12 [20%]). No patients discontinued due to adverse events."
        },
        {
          "label": "INTERPRETATION",
          "text": "Participants in the apitegromab treatment groups (combined 20 mg/kg and 10 mg/kg dose) achieved statistically significant improvements in motor function compared with placebo; however, the least squares mean difference was not significant between apitegromab 20 mg/kg and placebo. Overall, SAPPHIRE results build on findings from the phase 2 TOPAZ trial, showing improved motor function with a generally well tolerated safety profile, supporting the use of muscle-targeting therapy for spinal muscular atrophy."
        },
        {
          "label": "FUNDING",
          "text": "Scholar Rock."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40818473/",
      "pubDate": "2025 Sep",
      "doi": "10.1016/S1474-4422(25)00225-X",
      "dateReceived": "2025-09-06T23:21:07.069Z",
      "isNew": false,
      "summary": "Apitegromab, an anti-myostatin antibody, was evaluated in a phase 3 trial for its safety and efficacy in improving motor function in nonambulatory spinal muscular atrophy patients already receiving nusinersen or risdiplam."
    },
    {
      "id": "6c482758e29d",
      "title": "Barrett`s Oesophagus Surveillance Versus Endoscopy at Need Study (BOSS): A Randomized Controlled Trial.",
      "journal": "Gastroenterology",
      "score": "7/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48045231/117444",
      "dateReceived": "2025-09-06T23:21:07.069Z",
      "isNew": false
    },
    {
      "id": "4e4a1460e766",
      "title": "Long-Term Anticoagulation Discontinuation After Catheter Ablation for Atrial Fibrillation: The ALONE-AF Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117528",
      "abstract": "Data from randomized clinical trials on a long-term anticoagulation strategy for patients after catheter-based ablation for atrial fibrillation (AF) are lacking. To evaluate whether discontinuing oral anticoagulant therapy provides superior clinical outcomes compared with continuing oral anticoagulant therapy in patients without documented atrial arrhythmia recurrence after catheter ablation for AF. A randomized clinical trial including 840 adult patients (aged 19-80 years) who were enrolled and randomized from July 28, 2020, to March 9, 2023, at 18 hospitals in South Korea. Enrolled patients had at least 1 non-sex-related stroke risk factor (determined using the CHA2DS2-VASc score [range, 0-9]) and no documented recurrence of atrial arrhythmia for at least 1 year after catheter ablation for AF. The CHA2DS2-VASc score is used as an assessment of stroke risk among patients with AF (calculated using point values for congestive heart failure, hypertension, ≥75 years of age, diabetes, stroke or transient ischemic attack, vascular disease, between 65 and 74 years of age, and sex category). The date of final follow-up was June 4, 2025. The patients were randomly assigned in a 1:1 ratio to discontinue oral anticoagulant therapy (n = 417) or continue oral anticoagulant therapy (with direct oral anticoagulants; n = 423). The primary outcome was the first occurrence of a composite of stroke, systemic embolism, and major bleeding at 2 years. Individual components of the primary outcome (such as ischemic stroke and major bleeding) were assessed as secondary outcomes. Of the 840 adults randomized, the mean age was 64 (SD, 8) years, 24.9% were women, the mean CHA2DS2-VASc score was 2.1 (SD, 1.0), and 67.6% had paroxysmal AF. At 2 years, the primary outcome occurred in 1 patient (0.3%) in the discontinue oral anticoagulant therapy group vs 8 patients (2.2%) in the continue oral anticoagulant therapy group (absolute difference, -1.9 percentage points [95% CI, -3.5 to -0.3]; P = .02). The 2-year cumulative incidence of ischemic stroke was 0.3% in the discontinue oral anticoagulant therapy group vs 0.8% in the continue oral anticoagulant therapy group (absolute difference, -0.5 percentage points [95% CI, -1.6 to 0.6]). Major bleeding occurred in 0 patients in the discontinue oral anticoagulant therapy group vs 5 patients (1.4%) in the continue oral anticoagulant therapy group (absolute difference, -1.4 percentage points [95% CI, -2.6 to -0.2]). Among patients without documented atrial arrhythmia recurrence after catheter ablation for AF, discontinuing oral anticoagulant therapy resulted in a lower risk for the composite outcome of stroke, systemic embolism, and major bleeding vs continuing direct oral anticoagulant therapy. ClinicalTrials.gov Identifier: NCT04432220.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Data from randomized clinical trials on a long-term anticoagulation strategy for patients after catheter-based ablation for atrial fibrillation (AF) are lacking."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether discontinuing oral anticoagulant therapy provides superior clinical outcomes compared with continuing oral anticoagulant therapy in patients without documented atrial arrhythmia recurrence after catheter ablation for AF."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "A randomized clinical trial including 840 adult patients (aged 19-80 years) who were enrolled and randomized from July 28, 2020, to March 9, 2023, at 18 hospitals in South Korea. Enrolled patients had at least 1 non-sex-related stroke risk factor (determined using the CHA2DS2-VASc score [range, 0-9]) and no documented recurrence of atrial arrhythmia for at least 1 year after catheter ablation for AF. The CHA2DS2-VASc score is used as an assessment of stroke risk among patients with AF (calculated using point values for congestive heart failure, hypertension, ≥75 years of age, diabetes, stroke or transient ischemic attack, vascular disease, between 65 and 74 years of age, and sex category). The date of final follow-up was June 4, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "The patients were randomly assigned in a 1:1 ratio to discontinue oral anticoagulant therapy (n = 417) or continue oral anticoagulant therapy (with direct oral anticoagulants; n = 423)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the first occurrence of a composite of stroke, systemic embolism, and major bleeding at 2 years. Individual components of the primary outcome (such as ischemic stroke and major bleeding) were assessed as secondary outcomes."
        },
        {
          "label": "RESULTS",
          "text": "Of the 840 adults randomized, the mean age was 64 (SD, 8) years, 24.9% were women, the mean CHA2DS2-VASc score was 2.1 (SD, 1.0), and 67.6% had paroxysmal AF. At 2 years, the primary outcome occurred in 1 patient (0.3%) in the discontinue oral anticoagulant therapy group vs 8 patients (2.2%) in the continue oral anticoagulant therapy group (absolute difference, -1.9 percentage points [95% CI, -3.5 to -0.3]; P = .02). The 2-year cumulative incidence of ischemic stroke was 0.3% in the discontinue oral anticoagulant therapy group vs 0.8% in the continue oral anticoagulant therapy group (absolute difference, -0.5 percentage points [95% CI, -1.6 to 0.6]). Major bleeding occurred in 0 patients in the discontinue oral anticoagulant therapy group vs 5 patients (1.4%) in the continue oral anticoagulant therapy group (absolute difference, -1.4 percentage points [95% CI, -2.6 to -0.2])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients without documented atrial arrhythmia recurrence after catheter ablation for AF, discontinuing oral anticoagulant therapy resulted in a lower risk for the composite outcome of stroke, systemic embolism, and major bleeding vs continuing direct oral anticoagulant therapy."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04432220."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40886309/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1001/jama.2025.14679",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "Discontinuing oral anticoagulants after successful AF ablation in patients without arrhythmia recurrence led to a lower risk of stroke, systemic embolism, and major bleeding compared to continuing them."
    },
    {
      "id": "55c7daa8c143",
      "title": "Early Discontinuation of Aspirin after PCI in Low-Risk Acute Myocardial Infarction.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117525",
      "abstract": "An appropriate duration of dual antiplatelet therapy after percutaneous coronary intervention for acute myocardial infarction that has been treated with guideline-recommended complete revascularization and a contemporary drug-eluting stent remains unclear. We conducted a multicenter, open-label, randomized trial at 40 European sites. Adults with acute myocardial infarction who had undergone successful complete revascularization within 7 days after the infarction and had subsequently completed 1 month of dual antiplatelet therapy with no ischemic or major bleeding events were randomly assigned to transition to a P2Y12 inhibitor as monotherapy or to continue dual antiplatelet therapy for an additional 11 months. The primary outcome was a composite of death from any cause, myocardial infarction, stent thrombosis, stroke, or major bleeding (defined by the Bleeding Academic Research Consortium [BARC] as a bleeding event of type 3 or 5) at 11 months after randomization (tested for noninferiority with a margin of 1.25 percentage points). The main secondary outcome was BARC type 2, 3, or 5 bleeding (clinically relevant bleeding) at 11 months after randomization (tested for superiority). Among the 2246 enrolled patients, 1942 underwent randomization: 961 to receive P2Y12-inhibitor monotherapy and 981 to continue dual antiplatelet therapy. A primary-outcome event occurred in 20 patients (2.1%) in the P2Y12-inhibitor monotherapy group and in 21 patients (2.2%) in the dual antiplatelet therapy group (difference, -0.09 percentage points; 95% confidence interval [CI], -1.39 to 1.20; P = 0.02 for noninferiority). BARC type 2, 3, or 5 bleeding occurred in 2.6% of the patients in the P2Y12-inhibitor monotherapy group and in 5.6% of those in the dual antiplatelet therapy group (hazard ratio, 0.46; 95% CI, 0.29 to 0.75; P = 0.002 for superiority). Stent thrombosis was infrequent, and the incidence was similar in the two groups. The incidence of serious adverse events appeared to be similar in the two groups. Among low-risk patients with acute myocardial infarction who had undergone early complete revascularization and had completed 1 month of dual antiplatelet therapy without complications, P2Y12-inhibitor monotherapy was noninferior to continued dual antiplatelet therapy with respect to the occurrence of adverse cardiovascular and cerebrovascular events and resulted in a lower incidence of bleeding events. (Funded by MicroPort [France]; TARGET-FIRST ClinicalTrials.gov number, NCT04753749.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "An appropriate duration of dual antiplatelet therapy after percutaneous coronary intervention for acute myocardial infarction that has been treated with guideline-recommended complete revascularization and a contemporary drug-eluting stent remains unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted a multicenter, open-label, randomized trial at 40 European sites. Adults with acute myocardial infarction who had undergone successful complete revascularization within 7 days after the infarction and had subsequently completed 1 month of dual antiplatelet therapy with no ischemic or major bleeding events were randomly assigned to transition to a P2Y12 inhibitor as monotherapy or to continue dual antiplatelet therapy for an additional 11 months. The primary outcome was a composite of death from any cause, myocardial infarction, stent thrombosis, stroke, or major bleeding (defined by the Bleeding Academic Research Consortium [BARC] as a bleeding event of type 3 or 5) at 11 months after randomization (tested for noninferiority with a margin of 1.25 percentage points). The main secondary outcome was BARC type 2, 3, or 5 bleeding (clinically relevant bleeding) at 11 months after randomization (tested for superiority)."
        },
        {
          "label": "RESULTS",
          "text": "Among the 2246 enrolled patients, 1942 underwent randomization: 961 to receive P2Y12-inhibitor monotherapy and 981 to continue dual antiplatelet therapy. A primary-outcome event occurred in 20 patients (2.1%) in the P2Y12-inhibitor monotherapy group and in 21 patients (2.2%) in the dual antiplatelet therapy group (difference, -0.09 percentage points; 95% confidence interval [CI], -1.39 to 1.20; P = 0.02 for noninferiority). BARC type 2, 3, or 5 bleeding occurred in 2.6% of the patients in the P2Y12-inhibitor monotherapy group and in 5.6% of those in the dual antiplatelet therapy group (hazard ratio, 0.46; 95% CI, 0.29 to 0.75; P = 0.002 for superiority). Stent thrombosis was infrequent, and the incidence was similar in the two groups. The incidence of serious adverse events appeared to be similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among low-risk patients with acute myocardial infarction who had undergone early complete revascularization and had completed 1 month of dual antiplatelet therapy without complications, P2Y12-inhibitor monotherapy was noninferior to continued dual antiplatelet therapy with respect to the occurrence of adverse cardiovascular and cerebrovascular events and resulted in a lower incidence of bleeding events. (Funded by MicroPort [France]; TARGET-FIRST ClinicalTrials.gov number, NCT04753749.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888726/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1056/NEJMoa2508808",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "In low-risk acute myocardial infarction patients after early complete revascularization and one month of dual antiplatelet therapy, P2Y12-inhibitor monotherapy was as effective as continued dual antiplatelet therapy for preventing adverse cardiovascular and cerebrovascular events, while also reducing bleeding."
    },
    {
      "id": "22a0322b106e",
      "title": "Aspirin in Patients with Chronic Coronary Syndrome Receiving Oral Anticoagulation.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117524",
      "abstract": "The appropriate antithrombotic regimen for patients with chronic coronary syndrome who are at high atherothrombotic risk and receiving long-term oral anticoagulation remains unknown. We conducted a multicenter, double-blind, randomized, placebo-controlled trial in France involving patients with chronic coronary syndrome who had undergone a previous stent implantation (>6 months before enrollment) and were at high atherothrombotic risk and currently receiving long-term oral anticoagulation. The patients were randomly assigned in a 1:1 ratio to receive aspirin (100 mg once daily) or placebo; all the patients continued to receive their current oral anticoagulation therapy. The primary efficacy outcome was a composite of cardiovascular death, myocardial infarction, stroke, systemic embolism, coronary revascularization, or acute limb ischemia. The key safety outcome was major bleeding. A total of 872 patients underwent randomization; 433 were assigned to the aspirin group, and 439 to the placebo group. The trial was stopped early at the advice of the independent data and safety monitoring board after a median follow-up of 2.2 years because of an excess of deaths from any cause in the aspirin group. A primary efficacy outcome event occurred in 73 patients (16.9%) in the aspirin group and in 53 patients (12.1%) in the placebo group (adjusted hazard ratio, 1.53; 95% confidence interval [CI], 1.07 to 2.18; P = 0.02). Death from any cause occurred in 58 patients (13.4%) in the aspirin group and in 37 (8.4%) in the placebo group (adjusted hazard ratio, 1.72; 95% CI, 1.14 to 2.58; P = 0.01). Major bleeding occurred in 44 patients (10.2%) in the aspirin group and in 15 patients (3.4%) in the placebo group (adjusted hazard ratio, 3.35; 95% CI, 1.87 to 6.00; P<0.001). A total of 467 and 395 serious adverse events were reported in the aspirin group and placebo group, respectively. Among patients with chronic coronary syndrome at high atherothrombotic risk who were receiving an oral anticoagulant, the addition of aspirin led to a higher risk of cardiovascular death, myocardial infarction, stroke, systemic embolism, coronary revascularization, or acute limb ischemia than placebo, as well as higher risks of death from any cause and major bleeding. (Funded by the French Ministry of Health and Bayer Healthcare; ClinicalTrials.gov number, NCT04217447.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The appropriate antithrombotic regimen for patients with chronic coronary syndrome who are at high atherothrombotic risk and receiving long-term oral anticoagulation remains unknown."
        },
        {
          "label": "METHODS",
          "text": "We conducted a multicenter, double-blind, randomized, placebo-controlled trial in France involving patients with chronic coronary syndrome who had undergone a previous stent implantation (>6 months before enrollment) and were at high atherothrombotic risk and currently receiving long-term oral anticoagulation. The patients were randomly assigned in a 1:1 ratio to receive aspirin (100 mg once daily) or placebo; all the patients continued to receive their current oral anticoagulation therapy. The primary efficacy outcome was a composite of cardiovascular death, myocardial infarction, stroke, systemic embolism, coronary revascularization, or acute limb ischemia. The key safety outcome was major bleeding."
        },
        {
          "label": "RESULTS",
          "text": "A total of 872 patients underwent randomization; 433 were assigned to the aspirin group, and 439 to the placebo group. The trial was stopped early at the advice of the independent data and safety monitoring board after a median follow-up of 2.2 years because of an excess of deaths from any cause in the aspirin group. A primary efficacy outcome event occurred in 73 patients (16.9%) in the aspirin group and in 53 patients (12.1%) in the placebo group (adjusted hazard ratio, 1.53; 95% confidence interval [CI], 1.07 to 2.18; P = 0.02). Death from any cause occurred in 58 patients (13.4%) in the aspirin group and in 37 (8.4%) in the placebo group (adjusted hazard ratio, 1.72; 95% CI, 1.14 to 2.58; P = 0.01). Major bleeding occurred in 44 patients (10.2%) in the aspirin group and in 15 patients (3.4%) in the placebo group (adjusted hazard ratio, 3.35; 95% CI, 1.87 to 6.00; P<0.001). A total of 467 and 395 serious adverse events were reported in the aspirin group and placebo group, respectively."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with chronic coronary syndrome at high atherothrombotic risk who were receiving an oral anticoagulant, the addition of aspirin led to a higher risk of cardiovascular death, myocardial infarction, stroke, systemic embolism, coronary revascularization, or acute limb ischemia than placebo, as well as higher risks of death from any cause and major bleeding. (Funded by the French Ministry of Health and Bayer Healthcare; ClinicalTrials.gov number, NCT04217447.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888725/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1056/NEJMoa2507532",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "Adding aspirin to oral anticoagulation in high-risk chronic coronary syndrome patients increased the risk of adverse cardiovascular events, death, and major bleeding compared to placebo."
    },
    {
      "id": "78ae89328617",
      "title": "Beta-Blockers after Myocardial Infarction without Reduced Ejection Fraction.",
      "journal": "N Engl J Med",
      "score": "7/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117522",
      "abstract": "Current guideline recommendations for the use of beta-blockers after myocardial infarction without reduced ejection fraction are based on trials conducted before routine reperfusion, invasive care, complete revascularization, and contemporary pharmacologic therapies became standard practice. We conducted an open-label, randomized trial in Spain and Italy to evaluate the effect of beta-blocker therapy, as compared with no beta-blocker therapy, in patients with acute myocardial infarction (with or without ST-segment elevation) and a left ventricular ejection fraction above 40%. The primary outcome was a composite of death from any cause, reinfarction, or hospitalization for heart failure. In total, 4243 patients were randomly assigned to receive beta-blocker therapy and 4262 to receive no beta-blocker therapy; after exclusions, 8438 patients were included in the main analysis. During a median follow-up of 3.7 years, a primary-outcome event occurred in 316 patients (22.5 events per 1000 patient-years) in the beta-blocker group and in 307 patients (21.7 events per 1000 patient-years) in the no-beta-blocker group (hazard ratio, 1.04; 95% confidence interval [CI], 0.89 to 1.22; P = 0.63). Death from any cause occurred in 161 patients and 153 patients, respectively (11.2 vs. 10.5 events per 1000 patient-years; hazard ratio, 1.06; 95% CI, 0.85 to 1.33); reinfarction in 143 patients and 143 patients (10.2 vs. 10.1 events per 1000 patient-years; hazard ratio, 1.01; 95% CI, 0.80 to 1.27); and hospitalization for heart failure in 39 patients and 44 patients (2.7 vs. 3.0 events per 1000 patient-years; hazard ratio, 0.89; 95% CI, 0.58 to 1.38). No apparent between-group differences in safety outcomes were noted. Among patients discharged after invasive care for a myocardial infarction with a left ventricular ejection fraction above 40%, beta-blocker therapy appeared to have no effect on the incidence of death from any cause, reinfarction, or hospitalization for heart failure. (Funded by Centro Nacional de Investigaciones Cardiovasculares Carlos III and others; ClinicalTrials.gov number, NCT03596385; EudraCT number, 2017-002485-40.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Current guideline recommendations for the use of beta-blockers after myocardial infarction without reduced ejection fraction are based on trials conducted before routine reperfusion, invasive care, complete revascularization, and contemporary pharmacologic therapies became standard practice."
        },
        {
          "label": "METHODS",
          "text": "We conducted an open-label, randomized trial in Spain and Italy to evaluate the effect of beta-blocker therapy, as compared with no beta-blocker therapy, in patients with acute myocardial infarction (with or without ST-segment elevation) and a left ventricular ejection fraction above 40%. The primary outcome was a composite of death from any cause, reinfarction, or hospitalization for heart failure."
        },
        {
          "label": "RESULTS",
          "text": "In total, 4243 patients were randomly assigned to receive beta-blocker therapy and 4262 to receive no beta-blocker therapy; after exclusions, 8438 patients were included in the main analysis. During a median follow-up of 3.7 years, a primary-outcome event occurred in 316 patients (22.5 events per 1000 patient-years) in the beta-blocker group and in 307 patients (21.7 events per 1000 patient-years) in the no-beta-blocker group (hazard ratio, 1.04; 95% confidence interval [CI], 0.89 to 1.22; P = 0.63). Death from any cause occurred in 161 patients and 153 patients, respectively (11.2 vs. 10.5 events per 1000 patient-years; hazard ratio, 1.06; 95% CI, 0.85 to 1.33); reinfarction in 143 patients and 143 patients (10.2 vs. 10.1 events per 1000 patient-years; hazard ratio, 1.01; 95% CI, 0.80 to 1.27); and hospitalization for heart failure in 39 patients and 44 patients (2.7 vs. 3.0 events per 1000 patient-years; hazard ratio, 0.89; 95% CI, 0.58 to 1.38). No apparent between-group differences in safety outcomes were noted."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients discharged after invasive care for a myocardial infarction with a left ventricular ejection fraction above 40%, beta-blocker therapy appeared to have no effect on the incidence of death from any cause, reinfarction, or hospitalization for heart failure. (Funded by Centro Nacional de Investigaciones Cardiovasculares Carlos III and others; ClinicalTrials.gov number, NCT03596385; EudraCT number, 2017-002485-40.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888702/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1056/NEJMoa2504735",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "In patients with a left ventricular ejection fraction over 40% after invasive care for a myocardial infarction, beta-blocker therapy did not impact the rates of death, reinfarction, or heart failure hospitalization."
    },
    {
      "id": "5451bb4f39bf",
      "title": "Ticagrelor and Aspirin or Aspirin Alone after Coronary Surgery for Acute Coronary Syndrome.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117516",
      "abstract": "Patients benefit from antiplatelet therapy after coronary-artery bypass grafting (CABG) for an acute coronary syndrome. Whether the addition of ticagrelor to aspirin, as compared with aspirin alone, further reduces the risk of adverse cardiovascular outcomes is unclear. In this open-label, registry-based, clinical trial conducted at 22 Nordic cardiothoracic surgery centers, we randomly assigned patients in a 1:1 ratio to receive either ticagrelor plus aspirin or aspirin alone for 1 year after CABG for an acute coronary syndrome. The primary outcome was a composite of death, myocardial infarction, stroke, or repeat revascularization, evaluated at 1 year. A key secondary outcome was net adverse clinical events, defined as a primary-outcome event or major bleeding. A total of 2201 patients were randomly assigned to receive ticagrelor plus aspirin (1104 patients) or aspirin alone (1097 patients). The mean age of the patients was 66 years, and 14.4% were women. A primary-outcome event occurred in 53 patients (4.8%) in the ticagrelor-plus-aspirin group and 50 (4.6%) in the aspirin-alone group (hazard ratio, 1.06; 95% confidence interval [CI], 0.72 to 1.56; P = 0.77). Net adverse clinical events occurred in 9.1% of patients in the ticagrelor-plus-aspirin group and 6.4% in the aspirin-alone group (hazard ratio, 1.45; 95% CI, 1.07 to 1.97). Major bleeding occurred in 4.9% of patients in the ticagrelor-plus-aspirin group and 2.0% in the aspirin-alone group (hazard ratio, 2.50; 95% CI, 1.52 to 4.11). Among patients who underwent CABG for an acute coronary syndrome, ticagrelor plus aspirin did not result in a lower incidence of death, myocardial infarction, stroke, or repeat coronary revascularization than aspirin alone at 1 year. (Funded by the Swedish Research Council and others; TACSI ClinicalTrials.gov number, NCT03560310; EudraCT number, 2017-001499-43; EU Clinical Trials number, 2023-508551-40-00.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients benefit from antiplatelet therapy after coronary-artery bypass grafting (CABG) for an acute coronary syndrome. Whether the addition of ticagrelor to aspirin, as compared with aspirin alone, further reduces the risk of adverse cardiovascular outcomes is unclear."
        },
        {
          "label": "METHODS",
          "text": "In this open-label, registry-based, clinical trial conducted at 22 Nordic cardiothoracic surgery centers, we randomly assigned patients in a 1:1 ratio to receive either ticagrelor plus aspirin or aspirin alone for 1 year after CABG for an acute coronary syndrome. The primary outcome was a composite of death, myocardial infarction, stroke, or repeat revascularization, evaluated at 1 year. A key secondary outcome was net adverse clinical events, defined as a primary-outcome event or major bleeding."
        },
        {
          "label": "RESULTS",
          "text": "A total of 2201 patients were randomly assigned to receive ticagrelor plus aspirin (1104 patients) or aspirin alone (1097 patients). The mean age of the patients was 66 years, and 14.4% were women. A primary-outcome event occurred in 53 patients (4.8%) in the ticagrelor-plus-aspirin group and 50 (4.6%) in the aspirin-alone group (hazard ratio, 1.06; 95% confidence interval [CI], 0.72 to 1.56; P = 0.77). Net adverse clinical events occurred in 9.1% of patients in the ticagrelor-plus-aspirin group and 6.4% in the aspirin-alone group (hazard ratio, 1.45; 95% CI, 1.07 to 1.97). Major bleeding occurred in 4.9% of patients in the ticagrelor-plus-aspirin group and 2.0% in the aspirin-alone group (hazard ratio, 2.50; 95% CI, 1.52 to 4.11)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients who underwent CABG for an acute coronary syndrome, ticagrelor plus aspirin did not result in a lower incidence of death, myocardial infarction, stroke, or repeat coronary revascularization than aspirin alone at 1 year. (Funded by the Swedish Research Council and others; TACSI ClinicalTrials.gov number, NCT03560310; EudraCT number, 2017-001499-43; EU Clinical Trials number, 2023-508551-40-00.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888737/",
      "pubDate": "2025 Sep 01",
      "doi": "10.1056/NEJMoa2508026",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "In patients undergoing CABG for acute coronary syndrome, ticagrelor plus aspirin did not reduce the combined risk of death, myocardial infarction, stroke, or repeat revascularization compared to aspirin alone at one year."
    },
    {
      "id": "672a3821b505",
      "title": "Is high-flow nasal oxygen as effective as non-invasive ventilation in acute cardiogenic pulmonary Edema?.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117508",
      "abstract": "Acute cardiogenic pulmonary edema (ACPE) is a significant cause of emergency department (ED) visits due to dyspnea. Non-invasive ventilation (NIV) is currently the recommended first-line treatment for respiratory failure secondary to ACPE. The aim of this study is to compare the effectiveness of high-flow nasal cannula (HFNC) and NIV in improving respiratory rate (RR) and other clinical outcomes in adult patients presenting to the ED with ACPE. This study was conducted as a prospective, randomized, single-center, superiority trial with a 1:1 parallel-group allocation. All consecutive adult patients (≥18 years) who presented to our emergency department between July 2023 and April 2024 were screened for eligibility. Those meeting the inclusion and exclusion criteria were enrolled and randomly assigned in a 1:1 ratio to receive either high-flow nasal cannula (HFNC) or non-invasive ventilation (NIV) therapy. All analyses were performed according to the intention-to-treat (ITT) principle, with per-protocol (PP) analyses also presented for comparison. During the study period, 1376 patients were screened, and 178 were randomized. Baseline characteristics, including initial respiratory rates-34 (IQR, 30-38) breaths/min in the HFNC group and 33.5 (IQR, 30-37) in the NIV group-were similar between groups. In both intention-to-treat and per-protocol analyses, the change in respiratory rate at 120 min was similar across groups. No significant differences were observed in respiratory rates or their changes at 30, 60, and 120 min. Likewise, changes in other vital signs, arterial blood gas parameters, and dyspnea scores during follow-up did not differ significantly between the groups. In this study, no difference was found between HFNC and NIV in reducing the symptoms and signs of respiratory failure with oxygen-ventilation support in patients with acute cardiogenic pulmonary edema. Considering that HFNC provides better patient tolerability and comfort, it may be considered a viable alternative to NIV in this specific patient population.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Acute cardiogenic pulmonary edema (ACPE) is a significant cause of emergency department (ED) visits due to dyspnea. Non-invasive ventilation (NIV) is currently the recommended first-line treatment for respiratory failure secondary to ACPE. The aim of this study is to compare the effectiveness of high-flow nasal cannula (HFNC) and NIV in improving respiratory rate (RR) and other clinical outcomes in adult patients presenting to the ED with ACPE."
        },
        {
          "label": "METHODS",
          "text": "This study was conducted as a prospective, randomized, single-center, superiority trial with a 1:1 parallel-group allocation. All consecutive adult patients (≥18 years) who presented to our emergency department between July 2023 and April 2024 were screened for eligibility. Those meeting the inclusion and exclusion criteria were enrolled and randomly assigned in a 1:1 ratio to receive either high-flow nasal cannula (HFNC) or non-invasive ventilation (NIV) therapy. All analyses were performed according to the intention-to-treat (ITT) principle, with per-protocol (PP) analyses also presented for comparison."
        },
        {
          "label": "RESULTS",
          "text": "During the study period, 1376 patients were screened, and 178 were randomized. Baseline characteristics, including initial respiratory rates-34 (IQR, 30-38) breaths/min in the HFNC group and 33.5 (IQR, 30-37) in the NIV group-were similar between groups. In both intention-to-treat and per-protocol analyses, the change in respiratory rate at 120 min was similar across groups. No significant differences were observed in respiratory rates or their changes at 30, 60, and 120 min. Likewise, changes in other vital signs, arterial blood gas parameters, and dyspnea scores during follow-up did not differ significantly between the groups."
        },
        {
          "label": "CONCLUSION",
          "text": "In this study, no difference was found between HFNC and NIV in reducing the symptoms and signs of respiratory failure with oxygen-ventilation support in patients with acute cardiogenic pulmonary edema. Considering that HFNC provides better patient tolerability and comfort, it may be considered a viable alternative to NIV in this specific patient population."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40848477/",
      "pubDate": "2025 Aug 15",
      "doi": "10.1016/j.ajem.2025.08.023",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "High-flow nasal cannula (HFNC) and non-invasive ventilation (NIV) showed no difference in treating respiratory failure from acute cardiogenic pulmonary edema, but HFNC may be preferred due to better patient comfort."
    },
    {
      "id": "cfd84a00430f",
      "title": "Non-targeted immunosuppressive and immunomodulatory therapies for idiopathic inflammatory myopathies.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47948799/117457",
      "abstract": "Idiopathic inflammatory myopathies (IIM) are autoimmune-mediated inflammatory disorders of skeletal muscles with non-muscle involvement in some people, which carry significant morbidity and mortality. Treatment of IIM represents an area of unmet need. This review is an update of a review previously published in 2012, as new and promising data on non-targeted treatments have emerged. To assess the effects (benefits and harms) of non-targeted immunosuppressant and immunomodulatory treatments for IIM: dermatomyositis (DM, including juvenile dermatomyositis, jDM), immune-mediated necrotising myopathy (IMNM), anti-synthetase syndrome (ASS), overlap-myositis (OM) and polymyositis (PM). We also included cancer-related myositis and amyopathic dermatomyositis. On 3 February 2023, we searched the Cochrane Neuromuscular Specialised Register, CENTRAL, Embase, MEDLINE, ClinicalTrials.gov and WHO ICTRP. We intended to check references and citations, and contact experts to identify additional studies, but lacked the resources. We included all randomised controlled trials (RCTs) or quasi-RCTs involving participants (adults and children) with IIM according to defined criteria. We included non-targeted immunosuppressants and immunomodulatory treatments alone or in combination, compared with a placebo, no treatment or another non-targeted immunosuppressant or immunomodulatory treatment. Our two primary outcomes were improvement of function or disability and improvement of muscle strength compared with baseline. By preference, we used the Health Assessment Questionnaire Disability Index (HAQ-DI) for disability and the Manual Muscle Test-8 (MMT8) score (adults or children) for muscle strength. Other outcomes were achievement of definitions of improvement (DOI) (the International Myositis Assessment and Clinical Studies (IMACS) Group or the more recent total improvement scores (TIS); for children, we reported achievement of improvement defined by the Paediatric Rheumatology International Trials Organisation (PRINTO)), cumulative corticosteroid dose, change in skin disease activity, serious adverse event and withdrawals for lack of benefit or adverse events. We followed standard Cochrane methodology. To assess the risk of bias, we used the domain-based Cochrane risk of bias tool (RoB 1). We used fixed-effect models and, when needed, random-effects models for meta-analysis. We created summary of findings tables for any comparison for which data were available but prioritised comparisons of the following with placebo, no treatment or standard care: immunoglobulin, azathioprine and methotrexate. We included other comparisons as additional tables. We assessed the certainty of evidence using the GRADE approach. We identified 16 studies (789 participants). The risk of bias in all but one study was high or unclear. Intravenous immunoglobulin (IVIg), compared to placebo, probably improves disability and muscle strength in participants with refractory IIM (standardised mean difference (SMD) 0.86, 95% confidence interval (CI) 0.51 to 1.21 (disability) and 0.78, 95% CI 0.43 to 1.13 (muscle strength); 3 RCTs, 136 participants; both moderate-certainty evidence). IVIg has a higher response rate based on American College of Rheumatology/European League Against Rheumatism (ACR/EULAR) criteria than placebo (risk ratio (RR) 1.80, 95% CI 1.26 to 2.56; 1 RCT, 95 participants; moderate-certainty evidence). IVIg, compared to placebo, improves skin symptoms (Cutaneous Dermatomyositis Disease Area and Severity Index (CDASI) total activity score 0 to 100; higher worse) in people with refractory DM (mean difference (MD) -8.20, 95% CI -11.91 to -4.49; 1 RCT, 95 participants; moderate-certainty evidence). There may be more serious adverse events with IVIg than with placebo (RR 1.91, 95% CI 0.50 to 7.30; 2 RCTs, 144 participants; very low-certainty evidence), but little or no difference between IVIg and placebo in withdrawals for either lack of benefit or adverse events (RR 1.02, 95% CI 0.24 to 4.33; 3 RCTs, 154 participants; very low-certainty evidence). For azathioprine versus placebo, one study showed little or no effect of azathioprine on improvement in muscle strength, but the evidence was very uncertain (RR 1.33, 95% CI 0.43 to 4.13; 1 RCT; 16 participants; very low-certainty evidence). The evidence was also very uncertain for cumulative steroid dose (MD 12.06 mg/kg, 95% CI -6.09 to 30.21; 1 RCT, 16 participants; very low-certainty evidence). This early study did not assess IMACS DOI or CDASI or measure function or disability. Serious adverse events and withdrawals for either lack of benefit or adverse events were not systematically reported. For methotrexate, there may be little or no improvement in adults with DM or PM in function (Amyotrophic Lateral Sclerosis Functional Rating Scale 0 to 40, higher better) (MD 1.24, 95% CI -1.60 to 4.08; 1 RCT, 27 participants; very low-certainty evidence), muscle strength (MMT scale 0 to 80, higher better) (MD -5.68, 95% CI -12.94 to 1.58; 1 RCT, 27 participants; very low-certainty evidence), achievement of IMACS DOI (RR 1.01, 95% CI 0.74 to 1.39; 1 RCT, 27 participants; very low-certainty evidence). Cumulative steroid dose was measured, but the data could not be analysed, and change in CDASI was not measured. In children with new-onset jDM on a background therapy of prednisone, a higher proportion may achieve minimal improvement according to the PRINTO criteria with methotrexate than with placebo (RR 1.40, 95% CI 1.01 to 1.96; 1 RCT, 93 participants; low-certainty evidence). Serious adverse events may occur slightly more frequently with methotrexate (RR 1.48, 95% CI 0.54 to 4.07; 2 RCTs, 124 participants; low-certainty evidence). There may be fewer withdrawals for lack of benefit or adverse events with methotrexate (RR 0.62, 95% CI 0.37 to 1.05; 3 RCTs, 151 participants; low-certainty evidence). Our review shows improvement in disability, muscle strength and skin symptoms following IVIg in people with refractory DM (for PM, these data are not reliable; other subtypes have not been investigated in RCTs). The improvements related to IVIg in DM may be clinically meaningful, but the absence of established minimal clinically important differences (MCIDs) for both disability and muscle strength in IIM does not facilitate interpretation. For the other agents, the small number of trials of immunosuppressive and immunomodulatory therapies is inadequate to decide whether these agents are beneficial in IIM (excluding IBM). Our review shows room for improvement in the conduct and reporting of clinical trials in IIM, as well as the need to further investigate MCIDs for important outcome measures in IIM.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Idiopathic inflammatory myopathies (IIM) are autoimmune-mediated inflammatory disorders of skeletal muscles with non-muscle involvement in some people, which carry significant morbidity and mortality. Treatment of IIM represents an area of unmet need. This review is an update of a review previously published in 2012, as new and promising data on non-targeted treatments have emerged."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects (benefits and harms) of non-targeted immunosuppressant and immunomodulatory treatments for IIM: dermatomyositis (DM, including juvenile dermatomyositis, jDM), immune-mediated necrotising myopathy (IMNM), anti-synthetase syndrome (ASS), overlap-myositis (OM) and polymyositis (PM). We also included cancer-related myositis and amyopathic dermatomyositis."
        },
        {
          "label": "SEARCH METHODS",
          "text": "On 3 February 2023, we searched the Cochrane Neuromuscular Specialised Register, CENTRAL, Embase, MEDLINE, ClinicalTrials.gov and WHO ICTRP. We intended to check references and citations, and contact experts to identify additional studies, but lacked the resources."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included all randomised controlled trials (RCTs) or quasi-RCTs involving participants (adults and children) with IIM according to defined criteria. We included non-targeted immunosuppressants and immunomodulatory treatments alone or in combination, compared with a placebo, no treatment or another non-targeted immunosuppressant or immunomodulatory treatment. Our two primary outcomes were improvement of function or disability and improvement of muscle strength compared with baseline. By preference, we used the Health Assessment Questionnaire Disability Index (HAQ-DI) for disability and the Manual Muscle Test-8 (MMT8) score (adults or children) for muscle strength. Other outcomes were achievement of definitions of improvement (DOI) (the International Myositis Assessment and Clinical Studies (IMACS) Group or the more recent total improvement scores (TIS); for children, we reported achievement of improvement defined by the Paediatric Rheumatology International Trials Organisation (PRINTO)), cumulative corticosteroid dose, change in skin disease activity, serious adverse event and withdrawals for lack of benefit or adverse events."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We followed standard Cochrane methodology. To assess the risk of bias, we used the domain-based Cochrane risk of bias tool (RoB 1). We used fixed-effect models and, when needed, random-effects models for meta-analysis. We created summary of findings tables for any comparison for which data were available but prioritised comparisons of the following with placebo, no treatment or standard care: immunoglobulin, azathioprine and methotrexate. We included other comparisons as additional tables. We assessed the certainty of evidence using the GRADE approach."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We identified 16 studies (789 participants). The risk of bias in all but one study was high or unclear. Intravenous immunoglobulin (IVIg), compared to placebo, probably improves disability and muscle strength in participants with refractory IIM (standardised mean difference (SMD) 0.86, 95% confidence interval (CI) 0.51 to 1.21 (disability) and 0.78, 95% CI 0.43 to 1.13 (muscle strength); 3 RCTs, 136 participants; both moderate-certainty evidence). IVIg has a higher response rate based on American College of Rheumatology/European League Against Rheumatism (ACR/EULAR) criteria than placebo (risk ratio (RR) 1.80, 95% CI 1.26 to 2.56; 1 RCT, 95 participants; moderate-certainty evidence). IVIg, compared to placebo, improves skin symptoms (Cutaneous Dermatomyositis Disease Area and Severity Index (CDASI) total activity score 0 to 100; higher worse) in people with refractory DM (mean difference (MD) -8.20, 95% CI -11.91 to -4.49; 1 RCT, 95 participants; moderate-certainty evidence). There may be more serious adverse events with IVIg than with placebo (RR 1.91, 95% CI 0.50 to 7.30; 2 RCTs, 144 participants; very low-certainty evidence), but little or no difference between IVIg and placebo in withdrawals for either lack of benefit or adverse events (RR 1.02, 95% CI 0.24 to 4.33; 3 RCTs, 154 participants; very low-certainty evidence). For azathioprine versus placebo, one study showed little or no effect of azathioprine on improvement in muscle strength, but the evidence was very uncertain (RR 1.33, 95% CI 0.43 to 4.13; 1 RCT; 16 participants; very low-certainty evidence). The evidence was also very uncertain for cumulative steroid dose (MD 12.06 mg/kg, 95% CI -6.09 to 30.21; 1 RCT, 16 participants; very low-certainty evidence). This early study did not assess IMACS DOI or CDASI or measure function or disability. Serious adverse events and withdrawals for either lack of benefit or adverse events were not systematically reported. For methotrexate, there may be little or no improvement in adults with DM or PM in function (Amyotrophic Lateral Sclerosis Functional Rating Scale 0 to 40, higher better) (MD 1.24, 95% CI -1.60 to 4.08; 1 RCT, 27 participants; very low-certainty evidence), muscle strength (MMT scale 0 to 80, higher better) (MD -5.68, 95% CI -12.94 to 1.58; 1 RCT, 27 participants; very low-certainty evidence), achievement of IMACS DOI (RR 1.01, 95% CI 0.74 to 1.39; 1 RCT, 27 participants; very low-certainty evidence). Cumulative steroid dose was measured, but the data could not be analysed, and change in CDASI was not measured. In children with new-onset jDM on a background therapy of prednisone, a higher proportion may achieve minimal improvement according to the PRINTO criteria with methotrexate than with placebo (RR 1.40, 95% CI 1.01 to 1.96; 1 RCT, 93 participants; low-certainty evidence). Serious adverse events may occur slightly more frequently with methotrexate (RR 1.48, 95% CI 0.54 to 4.07; 2 RCTs, 124 participants; low-certainty evidence). There may be fewer withdrawals for lack of benefit or adverse events with methotrexate (RR 0.62, 95% CI 0.37 to 1.05; 3 RCTs, 151 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Our review shows improvement in disability, muscle strength and skin symptoms following IVIg in people with refractory DM (for PM, these data are not reliable; other subtypes have not been investigated in RCTs). The improvements related to IVIg in DM may be clinically meaningful, but the absence of established minimal clinically important differences (MCIDs) for both disability and muscle strength in IIM does not facilitate interpretation. For the other agents, the small number of trials of immunosuppressive and immunomodulatory therapies is inadequate to decide whether these agents are beneficial in IIM (excluding IBM). Our review shows room for improvement in the conduct and reporting of clinical trials in IIM, as well as the need to further investigate MCIDs for important outcome measures in IIM."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40787733/",
      "pubDate": "2025 Aug 11",
      "doi": "10.1002/14651858.CD015855",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "Intravenous immunoglobulin (IVIg) may improve disability, muscle strength, and skin symptoms in refractory dermatomyositis (DM), but the clinical significance is uncertain due to a lack of established minimal clinically important differences."
    },
    {
      "id": "9819a9c0ee8c",
      "title": "Systemic pharmacological treatments for chronic plaque psoriasis: a network meta-analysis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Dermatology",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47948799/117413",
      "abstract": "Psoriasis is an immune-mediated disease with either skin or joints manifestations, or both, and it has a major impact on quality of life. Although there is currently no cure for psoriasis, various treatment strategies allow sustained control of disease signs and symptoms. Despite multiple available treatments, their comparative efficacies and safety remain unclear due to the limited number of direct comparisons. We conducted a network meta-analysis to comprehensively compare systemic treatments. To compare the benefits and harms of non-targeted systemic agents, targeted synthetic agents, and biologic targeted treatments for people with moderate-to-severe psoriasis using a network meta-analysis, and to rank these treatments according to their benefits and harms. For this update of the living systematic review, we updated our searches monthly up to July 2024 in the following databases and trial registers: CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and WHO ICTRP. Randomised controlled trials of systemic pharmacological treatments in adults over 18 years of age with moderate-to-severe plaque psoriasis, at any stage of treatment, compared to placebo or another active agent, irrespective of dose and duration. The critical outcomes were proportion of participants who achieved clear or almost clear skin, that is, at least Psoriasis Area and Severity Index (PASI) 90 and proportion of participants with serious adverse events (SAEs) at induction phase (8 to 24 weeks after randomisation). We used the Cochrane RoB 2 tool. We conducted study selection, data extraction, risk of bias assessment, and analysis in duplicate. We synthesised data using pairwise and network meta-analyses to compare treatments and rank them according to effectiveness (PASI 90 score) and acceptability (inverse of SAEs). We assessed the certainty of network meta-analysis evidence for the two critical outcomes and all comparisons using CINeMA, as very low, low, moderate, or high. We contacted study authors when data were unclear or missing. We used the surface under the cumulative ranking curve (SUCRA) to infer treatment hierarchy, from 0% (worst for effectiveness or safety) to 100% (best for effectiveness or safety). This update includes 26 new studies, taking the total number of included studies to 204, and randomised participants to 67,889 (67% men), mainly recruited from hospitals. The average age was 44.4 years, and the mean PASI score at baseline was 20.5 (range: 9.5 to 40). Most studies were placebo-controlled (56%). We assessed 26 treatments. Most (171) trials were multicentric (2 to 231 centres). Most studies (157/204) declared funding by a pharmaceutical company, and 27 studies did not report a funding source. Network meta-analysis at class level demonstrated that all interventions had a higher proportion of participants reaching PASI 90 than placebo. Anti-interleukin (IL)17 treatment showed a higher proportion of participants reaching PASI 90 compared to all the interventions. Biologic treatments anti-IL17, anti-IL12/23, anti-IL23, and anti-tumour necrosis factor (TNF)-alpha showed a higher proportion of participants reaching PASI 90 than the non-targeted systemic agents and the targeted systemic agents. For reaching PASI 90, the most effective drugs when compared to placebo were (in SUCRA rank order): infliximab (moderate-certainty evidence), xeligekimab (moderate-certainty), bimekizumab (high-certainty), ixekizumab (moderate-certainty), and risankizumab (moderate-certainty). Clinical effectiveness of these drugs was similar when compared against each other. There was evidence of a difference in favour of bimekizumab, ixekizumab, and risankizumab compared to secukinumab, brodalumab, and guselkumab in achieving PASI 90. Infliximab, anti-IL17 drugs (bimekizumab, ixekizumab, secukinumab, sonelokimab, brodalumab), and anti-IL23 drugs (risankizumab and guselkumab) showed evidence of a difference in achieving PASI 90 compared to ustekinumab, tildrakizumab, three anti-TNF-alpha agents (adalimumab, certolizumab, and etanercept), and deucravacitinib. Ustekinumab was superior to certolizumab. Adalimumab, tildrakizumab, and ustekinumab were superior to etanercept, deucravacitinib, and apremilast. Ciclosporin and methotrexate were superior to apremilast for reaching PASI 90. We found no evidence of a difference between any of the interventions and the placebo for the risk of SAEs. Nevertheless, the SAEs analyses were based on a very low number of events with low-certainty evidence for most comparisons. Therefore, the findings must be viewed with caution. For PASI 90, 31% of studies (51/165) had a high risk of bias, 34% (56 studies) had some concerns, and 35% (58) had low risk. For SAEs, 57% (94/169) had a high risk of bias, 31% (53 studies) had some concerns, and 13% (22 studies) had low risk. Our review shows that, compared to placebo, the biologics infliximab, xeligekimab, bimekizumab, ixekizumab, and risankizumab were the most effective treatments for achieving PASI 90 in people with moderate-to-severe psoriasis, with high-certainty evidence for bimekizumab and moderate-certainty evidence for infliximab, xeligekimab, ixekizumab, and risankizumab. This network meta-analysis evidence is limited to induction therapy (outcomes measured from 8 to 24 weeks after randomisation), and is not sufficient for evaluating longer-term outcomes in this chronic disease. Moreover, we found low numbers of studies for some of the interventions, and the young age (mean 44.4 years) and high level of disease severity (PASI 20.5 at baseline) may not be typical of people seen in daily clinical practice. More randomised trials directly comparing active agents are needed, and these should include systematic subgroup analyses (sex, age, ethnicity, comorbidities, psoriatic arthritis). To provide long-term information on the safety of treatments included in this review, an evaluation of non-randomised studies is needed. Our confidence in the results for non-targeted systemic treatments is limited due to concerns regarding study conduct. Further research is warranted and may modify these findings. Editorial note: this is a living systematic review. Living systematic reviews offer a new approach to review updating, in which the review is continually updated, incorporating relevant new evidence as it becomes available. Please refer to the Cochrane Database of Systematic Reviews for the current status of this review. This Cochrane review obtained funding from the French Society of Dermatology and the French Ministry of Health. The previous version of this Living Systematic Review is available via DOI 10.1002/14651858.CD011535.pub6.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Psoriasis is an immune-mediated disease with either skin or joints manifestations, or both, and it has a major impact on quality of life. Although there is currently no cure for psoriasis, various treatment strategies allow sustained control of disease signs and symptoms. Despite multiple available treatments, their comparative efficacies and safety remain unclear due to the limited number of direct comparisons. We conducted a network meta-analysis to comprehensively compare systemic treatments."
        },
        {
          "label": "OBJECTIVES",
          "text": "To compare the benefits and harms of non-targeted systemic agents, targeted synthetic agents, and biologic targeted treatments for people with moderate-to-severe psoriasis using a network meta-analysis, and to rank these treatments according to their benefits and harms."
        },
        {
          "label": "SEARCH METHODS",
          "text": "For this update of the living systematic review, we updated our searches monthly up to July 2024 in the following databases and trial registers: CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and WHO ICTRP."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials of systemic pharmacological treatments in adults over 18 years of age with moderate-to-severe plaque psoriasis, at any stage of treatment, compared to placebo or another active agent, irrespective of dose and duration."
        },
        {
          "label": "OUTCOMES",
          "text": "The critical outcomes were proportion of participants who achieved clear or almost clear skin, that is, at least Psoriasis Area and Severity Index (PASI) 90 and proportion of participants with serious adverse events (SAEs) at induction phase (8 to 24 weeks after randomisation)."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane RoB 2 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We conducted study selection, data extraction, risk of bias assessment, and analysis in duplicate. We synthesised data using pairwise and network meta-analyses to compare treatments and rank them according to effectiveness (PASI 90 score) and acceptability (inverse of SAEs). We assessed the certainty of network meta-analysis evidence for the two critical outcomes and all comparisons using CINeMA, as very low, low, moderate, or high. We contacted study authors when data were unclear or missing. We used the surface under the cumulative ranking curve (SUCRA) to infer treatment hierarchy, from 0% (worst for effectiveness or safety) to 100% (best for effectiveness or safety)."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This update includes 26 new studies, taking the total number of included studies to 204, and randomised participants to 67,889 (67% men), mainly recruited from hospitals. The average age was 44.4 years, and the mean PASI score at baseline was 20.5 (range: 9.5 to 40). Most studies were placebo-controlled (56%). We assessed 26 treatments. Most (171) trials were multicentric (2 to 231 centres). Most studies (157/204) declared funding by a pharmaceutical company, and 27 studies did not report a funding source."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Network meta-analysis at class level demonstrated that all interventions had a higher proportion of participants reaching PASI 90 than placebo. Anti-interleukin (IL)17 treatment showed a higher proportion of participants reaching PASI 90 compared to all the interventions. Biologic treatments anti-IL17, anti-IL12/23, anti-IL23, and anti-tumour necrosis factor (TNF)-alpha showed a higher proportion of participants reaching PASI 90 than the non-targeted systemic agents and the targeted systemic agents. For reaching PASI 90, the most effective drugs when compared to placebo were (in SUCRA rank order): infliximab (moderate-certainty evidence), xeligekimab (moderate-certainty), bimekizumab (high-certainty), ixekizumab (moderate-certainty), and risankizumab (moderate-certainty). Clinical effectiveness of these drugs was similar when compared against each other. There was evidence of a difference in favour of bimekizumab, ixekizumab, and risankizumab compared to secukinumab, brodalumab, and guselkumab in achieving PASI 90. Infliximab, anti-IL17 drugs (bimekizumab, ixekizumab, secukinumab, sonelokimab, brodalumab), and anti-IL23 drugs (risankizumab and guselkumab) showed evidence of a difference in achieving PASI 90 compared to ustekinumab, tildrakizumab, three anti-TNF-alpha agents (adalimumab, certolizumab, and etanercept), and deucravacitinib. Ustekinumab was superior to certolizumab. Adalimumab, tildrakizumab, and ustekinumab were superior to etanercept, deucravacitinib, and apremilast. Ciclosporin and methotrexate were superior to apremilast for reaching PASI 90. We found no evidence of a difference between any of the interventions and the placebo for the risk of SAEs. Nevertheless, the SAEs analyses were based on a very low number of events with low-certainty evidence for most comparisons. Therefore, the findings must be viewed with caution. For PASI 90, 31% of studies (51/165) had a high risk of bias, 34% (56 studies) had some concerns, and 35% (58) had low risk. For SAEs, 57% (94/169) had a high risk of bias, 31% (53 studies) had some concerns, and 13% (22 studies) had low risk."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Our review shows that, compared to placebo, the biologics infliximab, xeligekimab, bimekizumab, ixekizumab, and risankizumab were the most effective treatments for achieving PASI 90 in people with moderate-to-severe psoriasis, with high-certainty evidence for bimekizumab and moderate-certainty evidence for infliximab, xeligekimab, ixekizumab, and risankizumab. This network meta-analysis evidence is limited to induction therapy (outcomes measured from 8 to 24 weeks after randomisation), and is not sufficient for evaluating longer-term outcomes in this chronic disease. Moreover, we found low numbers of studies for some of the interventions, and the young age (mean 44.4 years) and high level of disease severity (PASI 20.5 at baseline) may not be typical of people seen in daily clinical practice. More randomised trials directly comparing active agents are needed, and these should include systematic subgroup analyses (sex, age, ethnicity, comorbidities, psoriatic arthritis). To provide long-term information on the safety of treatments included in this review, an evaluation of non-randomised studies is needed. Our confidence in the results for non-targeted systemic treatments is limited due to concerns regarding study conduct. Further research is warranted and may modify these findings. Editorial note: this is a living systematic review. Living systematic reviews offer a new approach to review updating, in which the review is continually updated, incorporating relevant new evidence as it becomes available. Please refer to the Cochrane Database of Systematic Reviews for the current status of this review."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review obtained funding from the French Society of Dermatology and the French Ministry of Health."
        },
        {
          "label": "REGISTRATION",
          "text": "The previous version of this Living Systematic Review is available via DOI 10.1002/14651858.CD011535.pub6."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40767824/",
      "pubDate": "2025 Aug 06",
      "doi": "10.1002/14651858.CD011535.pub7",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "Infliximab, xeligekimab, bimekizumab, ixekizumab, and risankizumab are the most effective biologics for achieving PASI 90 in moderate-to-severe psoriasis induction therapy."
    },
    {
      "id": "e7636acfd6ea",
      "title": "Spironolactone versus placebo in patients undergoing maintenance dialysis (ACHIEVE): an international, parallel-group, randomised controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47948799/117387",
      "abstract": "Patients undergoing maintenance dialysis for kidney failure are at substantial risk of cardiovascular morbidity and mortality. We aimed to establish if spironolactone reduces heart failure and cardiovascular deaths in these patients. ACHIEVE was an international, parallel-group, randomised controlled trial done in 143 dialysis programmes in 12 countries. Patients were aged 45 years or older, or aged 18 years or older with a history of diabetes, and were receiving maintenance dialysis for kidney failure for at least 3 months at the time of recruitment. Patients who were able to tolerate and adhere to spironolactone 25 mg daily orally during an open-label run-in were randomly assigned (1:1) to continue spironolactone or matching placebo, using a central computerised block randomisation system (block sizes of 4) stratified by centre. Participants, health-care providers, and those assessing outcomes were masked to group assignment. The primary outcome was a composite of cardiovascular mortality or hospitalisation for heart failure analysed as time-to-event in all randomly assigned participants. The trial was registered at ClinicalTrials.gov, NCT03020303. After a planned interim analysis of 75% of the expected primary outcome events, the external safety and efficacy monitoring committee recommended the trial be stopped early for futility. From Sept 19, 2017, to Oct 31, 2024, 3689 patients were screened for inclusion, 3565 of whom were enrolled in the open-label run-in phase, and 2538 were randomly assigned to spironolactone (n=1260) or placebo (n=1278). 931 (36·7%) participants were female and 1607 (63·3%) were male. Median follow-up was 1·8 years (IQR 0·85-3·35). The composite primary outcome occurred in 258 participants (10·46 events per 100 patient-years) in the spironolactone group and in 276 participants (11·33 per 100 patient-years) in the placebo group (hazard ratio [HR] 0·92 [95% CI 0·78-1·09]; p=0·35). Death from any cause was similar between groups (HR 0·95 [0·83-1·09]) as was hospitalisation for any cause (HR 0·96 [0·87-1·06]). Among patients receiving maintenance dialysis, spironolactone 25 mg daily orally did not reduce the composite outcome of cardiovascular mortality and hospitalisation due to heart failure compared with placebo. This trial did not identify a benefit of initiating spironolactone in patients receiving maintenance dialysis. Future research should consider alternatives to steroidal mineralocorticoid receptor antagonism to reduce cardiovascular morbidity and mortality in patients receiving maintenance haemodialysis. The Canadian Institutes of Health Research, The Medical Research Future Fund, The Health Research Council, The British Heart Foundation, Population Health Research Institute/Hamilton Health Sciences Research Institute, St Joseph's Healthcare Hamilton Division of Nephrology, Accelerating Clinical Trials Consortium, Can-SOLVE CKD Network, and the Dalhousie Department of Medicine.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients undergoing maintenance dialysis for kidney failure are at substantial risk of cardiovascular morbidity and mortality. We aimed to establish if spironolactone reduces heart failure and cardiovascular deaths in these patients."
        },
        {
          "label": "METHODS",
          "text": "ACHIEVE was an international, parallel-group, randomised controlled trial done in 143 dialysis programmes in 12 countries. Patients were aged 45 years or older, or aged 18 years or older with a history of diabetes, and were receiving maintenance dialysis for kidney failure for at least 3 months at the time of recruitment. Patients who were able to tolerate and adhere to spironolactone 25 mg daily orally during an open-label run-in were randomly assigned (1:1) to continue spironolactone or matching placebo, using a central computerised block randomisation system (block sizes of 4) stratified by centre. Participants, health-care providers, and those assessing outcomes were masked to group assignment. The primary outcome was a composite of cardiovascular mortality or hospitalisation for heart failure analysed as time-to-event in all randomly assigned participants. The trial was registered at ClinicalTrials.gov, NCT03020303."
        },
        {
          "label": "FINDINGS",
          "text": "After a planned interim analysis of 75% of the expected primary outcome events, the external safety and efficacy monitoring committee recommended the trial be stopped early for futility. From Sept 19, 2017, to Oct 31, 2024, 3689 patients were screened for inclusion, 3565 of whom were enrolled in the open-label run-in phase, and 2538 were randomly assigned to spironolactone (n=1260) or placebo (n=1278). 931 (36·7%) participants were female and 1607 (63·3%) were male. Median follow-up was 1·8 years (IQR 0·85-3·35). The composite primary outcome occurred in 258 participants (10·46 events per 100 patient-years) in the spironolactone group and in 276 participants (11·33 per 100 patient-years) in the placebo group (hazard ratio [HR] 0·92 [95% CI 0·78-1·09]; p=0·35). Death from any cause was similar between groups (HR 0·95 [0·83-1·09]) as was hospitalisation for any cause (HR 0·96 [0·87-1·06])."
        },
        {
          "label": "INTERPRETATION",
          "text": "Among patients receiving maintenance dialysis, spironolactone 25 mg daily orally did not reduce the composite outcome of cardiovascular mortality and hospitalisation due to heart failure compared with placebo. This trial did not identify a benefit of initiating spironolactone in patients receiving maintenance dialysis. Future research should consider alternatives to steroidal mineralocorticoid receptor antagonism to reduce cardiovascular morbidity and mortality in patients receiving maintenance haemodialysis."
        },
        {
          "label": "FUNDING",
          "text": "The Canadian Institutes of Health Research, The Medical Research Future Fund, The Health Research Council, The British Heart Foundation, Population Health Research Institute/Hamilton Health Sciences Research Institute, St Joseph's Healthcare Hamilton Division of Nephrology, Accelerating Clinical Trials Consortium, Can-SOLVE CKD Network, and the Dalhousie Department of Medicine."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40818850/",
      "pubDate": "2025 Aug 16",
      "doi": "10.1016/S0140-6736(25)01198-5",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "Spironolactone did not reduce cardiovascular mortality or heart failure hospitalizations in patients on maintenance dialysis."
    },
    {
      "id": "c191de67837f",
      "title": "Efficacy and Safety of Seltorexant in Insomnia Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47936082/117462",
      "abstract": "Existing pharmacological treatments for insomnia have significant limitations. To assess the effective dose range, safety, and tolerability of the novel selective orexin-2 receptor antagonist seltorexant in insomnia disorder. This randomized, double-blind, active- and placebo-controlled, dose-finding, polysomnography study was conducted from November 2017 to April 2019 at 55 sites in 6 countries and analyzed in August 2019. The timeline for submission of this data for publication was impacted by internal strategic decision-making. Adults (aged 18-64 years) and older adults (aged 65-85 years) with insomnia (Insomnia Severity Index score ≥15) and no psychiatric comorbidity were included. Participants were randomized 1:1:1:1:1 to receive nightly oral-seltorexant (5 mg, 10 mg, or 20 mg), placebo, or zolpidem (5-10 mg) for 14 days. Primary and key secondary outcomes included the dose-response relationship of night 1 latency to persistent sleep (LPS) and wake after sleep onset over the first 6 hours (WASO-6). Other secondary outcomes included night 13 LPS and WASO-6. Due to asymmetrical distributions of LPS and WASO-6 at baseline, log transformation was applied and results were expressed as back-transformed least-squares mean (LSM) ratios for comparisons between groups. Overall, 364 participants (mean [SD] age, 57.8 [12.4] years; 246 [67.6%] female) received seltorexant, 5 mg (n = 71), 10 mg (n = 74), or 20 mg (n = 71); placebo (n = 75); or zolpidem (n = 73). The night 1 dose-response relationship for LPS was significant (with trend test t statistics ≥3.99 and adjusted P values <.001 for all 4 prespecified models), with greater improvements in seltorexant, 10 mg and 20 mg, vs placebo (10 mg: LSM ratio, 0.64; 90% CI, 0.51-0.81; 20 mg: LSM ratio, 0.51; 90% CI, 0.41-0.64) and in seltorexant, 20 mg, vs zolpidem (LSM ratio, 0.71; 90% CI, 0.57-0.88). The night 1 dose-response relationship for WASO-6 was also significant, with trend test t statistics ≥3.99 and adjusted P values <.001 for all 4 prespecified models (seltorexant, 10 mg: LSM ratio, 0.68; 90% CI, 0.55-0.85; seltorexant, 20 mg: LSM ratio, 0.60; 90% CI, 0.48-0.74). Night 1 LPS and WASO-6 improvements were maintained on night 13 for seltorexant, 10 mg and 20 mg, but diminished for zolpidem. On night 13, compared with zolpidem, seltorexant, 10 mg and 20 mg, improved LPS by 30% and 28%, respectively, and seltorexant, 20 mg, improved WASO-6 by 31%. Treatment-emergent adverse events (TEAEs) were lower across the combined seltorexant doses (73/216 [33.8%]) relative to placebo (37/75 [49.3%]) and zolpidem (31/73 [42.5%]). Two participants experienced serious TEAEs during the double-blind phase (1 in the seltorexant, 20 mg, group and 1 in the zolpidem group). Three participants in the seltorexant, 5 mg, and 1 in the seltorexant, 20 mg, group experienced asymptomatic electrocardiogram-related TEAEs leading to discontinuation. Among participants with insomnia in this study, seltorexant, 10 mg and 20 mg, improved sleep initiation and maintenance throughout 14 days of treatment. Seltorexant was generally well tolerated. ClinicalTrials.gov Identifier: NCT03375203.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Existing pharmacological treatments for insomnia have significant limitations."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the effective dose range, safety, and tolerability of the novel selective orexin-2 receptor antagonist seltorexant in insomnia disorder."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized, double-blind, active- and placebo-controlled, dose-finding, polysomnography study was conducted from November 2017 to April 2019 at 55 sites in 6 countries and analyzed in August 2019. The timeline for submission of this data for publication was impacted by internal strategic decision-making. Adults (aged 18-64 years) and older adults (aged 65-85 years) with insomnia (Insomnia Severity Index score ≥15) and no psychiatric comorbidity were included."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1:1:1:1 to receive nightly oral-seltorexant (5 mg, 10 mg, or 20 mg), placebo, or zolpidem (5-10 mg) for 14 days."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Primary and key secondary outcomes included the dose-response relationship of night 1 latency to persistent sleep (LPS) and wake after sleep onset over the first 6 hours (WASO-6). Other secondary outcomes included night 13 LPS and WASO-6. Due to asymmetrical distributions of LPS and WASO-6 at baseline, log transformation was applied and results were expressed as back-transformed least-squares mean (LSM) ratios for comparisons between groups."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 364 participants (mean [SD] age, 57.8 [12.4] years; 246 [67.6%] female) received seltorexant, 5 mg (n = 71), 10 mg (n = 74), or 20 mg (n = 71); placebo (n = 75); or zolpidem (n = 73). The night 1 dose-response relationship for LPS was significant (with trend test t statistics ≥3.99 and adjusted P values <.001 for all 4 prespecified models), with greater improvements in seltorexant, 10 mg and 20 mg, vs placebo (10 mg: LSM ratio, 0.64; 90% CI, 0.51-0.81; 20 mg: LSM ratio, 0.51; 90% CI, 0.41-0.64) and in seltorexant, 20 mg, vs zolpidem (LSM ratio, 0.71; 90% CI, 0.57-0.88). The night 1 dose-response relationship for WASO-6 was also significant, with trend test t statistics ≥3.99 and adjusted P values <.001 for all 4 prespecified models (seltorexant, 10 mg: LSM ratio, 0.68; 90% CI, 0.55-0.85; seltorexant, 20 mg: LSM ratio, 0.60; 90% CI, 0.48-0.74). Night 1 LPS and WASO-6 improvements were maintained on night 13 for seltorexant, 10 mg and 20 mg, but diminished for zolpidem. On night 13, compared with zolpidem, seltorexant, 10 mg and 20 mg, improved LPS by 30% and 28%, respectively, and seltorexant, 20 mg, improved WASO-6 by 31%. Treatment-emergent adverse events (TEAEs) were lower across the combined seltorexant doses (73/216 [33.8%]) relative to placebo (37/75 [49.3%]) and zolpidem (31/73 [42.5%]). Two participants experienced serious TEAEs during the double-blind phase (1 in the seltorexant, 20 mg, group and 1 in the zolpidem group). Three participants in the seltorexant, 5 mg, and 1 in the seltorexant, 20 mg, group experienced asymptomatic electrocardiogram-related TEAEs leading to discontinuation."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among participants with insomnia in this study, seltorexant, 10 mg and 20 mg, improved sleep initiation and maintenance throughout 14 days of treatment. Seltorexant was generally well tolerated."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03375203."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40802194/",
      "pubDate": "2025 Aug 13",
      "doi": "10.1001/jamapsychiatry.2025.1999",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "Seltorexant, at both 10 mg and 20 mg doses, improved sleep onset and maintenance in insomnia patients over a 14-day period and was generally well-tolerated."
    },
    {
      "id": "cb21e4c652e8",
      "title": "Validation of the ToDay, a simplified diagnostic algorithm for deep vein thrombosis.",
      "journal": "J Thromb Haemost",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47936082/117451",
      "abstract": "The current deep vein thrombosis (DVT) diagnostic algorithms are rarely followed in clinical practice due to complexity and time constraints. Simplified alternatives are needed to enhance adherence while maintaining diagnostic accuracy. The ToDay algorithm was developed to address these concerns by combining physician implicit assessment of DVT likelihood with D-dimer testing. The objective of the study is to validate the ToDay algorithm using previously collected data. This analysis used data from the 4D study (NCT02038530), a multicenter study evaluating DVT diagnostic strategies. The ToDay algorithm considers DVT excluded without further testing if DVT is considered most likely and D-dimer <500 ng/mL or if DVT is not considered most likely and D-dimer less than age-adjusted threshold. The primary outcome was 90-day symptomatic venous thromboembolism (VTE). Secondary outcome was not requiring ultrasound imaging. Among 1497 patients, 163 (10.9%) were diagnosed with DVT. Of the 1334 patients who had DVT excluded by the ToDay algorithm, 10 patients were found to have VTE during follow-up, a failure rate of 0.75% (95% CI, 0.41-1.37). Of all patients, 38.6% (95% CI, 36.2-41.1) did not require ultrasound imaging. The ToDay algorithm was found to be a safe and efficient alternative for DVT testing, reducing reliance on ultrasound imaging. It simplifies the diagnostic process, making it more feasible for emergency settings. Prospective validation is required before clinical adoption.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The current deep vein thrombosis (DVT) diagnostic algorithms are rarely followed in clinical practice due to complexity and time constraints. Simplified alternatives are needed to enhance adherence while maintaining diagnostic accuracy. The ToDay algorithm was developed to address these concerns by combining physician implicit assessment of DVT likelihood with D-dimer testing."
        },
        {
          "label": "OBJECTIVES",
          "text": "The objective of the study is to validate the ToDay algorithm using previously collected data."
        },
        {
          "label": "METHODS",
          "text": "This analysis used data from the 4D study (NCT02038530), a multicenter study evaluating DVT diagnostic strategies. The ToDay algorithm considers DVT excluded without further testing if DVT is considered most likely and D-dimer <500 ng/mL or if DVT is not considered most likely and D-dimer less than age-adjusted threshold. The primary outcome was 90-day symptomatic venous thromboembolism (VTE). Secondary outcome was not requiring ultrasound imaging."
        },
        {
          "label": "RESULTS",
          "text": "Among 1497 patients, 163 (10.9%) were diagnosed with DVT. Of the 1334 patients who had DVT excluded by the ToDay algorithm, 10 patients were found to have VTE during follow-up, a failure rate of 0.75% (95% CI, 0.41-1.37). Of all patients, 38.6% (95% CI, 36.2-41.1) did not require ultrasound imaging."
        },
        {
          "label": "CONCLUSION",
          "text": "The ToDay algorithm was found to be a safe and efficient alternative for DVT testing, reducing reliance on ultrasound imaging. It simplifies the diagnostic process, making it more feasible for emergency settings. Prospective validation is required before clinical adoption."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40680941/",
      "pubDate": "2025 Jul 16",
      "doi": "10.1016/j.jtha.2025.06.029",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "The ToDay algorithm offers a safe and efficient method for diagnosing DVT, potentially decreasing the need for ultrasound and streamlining the process for emergency situations."
    },
    {
      "id": "4dda4523999e",
      "title": "Organised trauma systems and designated trauma centres for improving outcomes in injured patients.",
      "journal": "Cochrane Database Syst Rev",
      "score": "4/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47936082/117340",
      "abstract": "Trauma systems have become the standard of care in high-income countries, but remain uncommon in low- and middle-income countries. High-quality evidence of effectiveness is needed to advocate for the development of trauma systems in low- and middle-income countries, where the burden of injury is highest. To assess the benefits and harms of organised trauma systems and designated trauma centres compared with usual care in injured patients. We searched CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and WHO ICTRP on 16 December 2023. We also searched grey literature, checked reference lists of included studies, and contacted the authors of relevant studies. We included randomised controlled trials, non-randomised trials, controlled before-after studies, and interrupted time series studies comparing organised trauma systems or designated trauma centres with usual care. We planned to include patients who had had major trauma (i.e. Injury Severity Score greater than 15), but made a post-hoc decision to include patients regardless of injury severity. Studies were considered for inclusion regardless of date, language, or publication status. The critical outcomes were patient outcomes (such as mortality, survival, and recovery), and adverse effects. Important outcomes were utilisation and access to trauma care services, quality of care provided, equity, and knowledge about trauma care services. Studies only reported patient outcomes (mortality, survival); there were no reports on adverse effects, utilisation and access to services, quality of care, equity, and knowledge about trauma care services. We used the Cochrane RoB 1 tool and guidance from the Cochrane Effective Practice and Organisation of Care (EPOC) group to evaluate individual studies. Two review authors independently selected studies for inclusion, extracted data, and assessed risk of bias and certainty of evidence using GRADE. We could not perform a meta-analysis due to substantial clinical heterogeneity across studies. We re-analysed data from individual studies so they could be presented in a standardised format as relative effect, change in level, and change in slope. We summarised findings using a narrative synthesis. There were four interrupted time series studies (157,111 participants). Two studies (131,220 participants) compared organised trauma systems to usual care and two studies (25,891 participants) compared designated trauma centres to usual care. Two studies were conducted in the US, one in the UK, and one in Norway. It is very uncertain whether organised trauma systems reduce mortality compared to usual care because the certainty of the evidence was very low (2 studies, 131,220 participants). One study (20,357 participants, follow-up 6 years) reported reduced mortality with an organised trauma system intervention and a relative effect of -30% (change in level -2.02, 95% confidence interval (CI) -3.17 to -0.86; change in slope -0.10, 95% CI -0.53 to 0.33). A second study (110,863 participants, follow-up 9 years) reported improved survival with intervention and a relative effect of 14% (change in level 0.13, 95% CI -0.50 to 0.76; an increase of 0.13 survival cases per quarter; change in slope 0.08, 95% CI 0.01 to 0.15). No studies reported data on adverse effects, utilisation and access to trauma care services, quality of care provided, equity, or knowledge about trauma care services. It is very uncertain whether designated trauma centres reduce mortality compared to usual care because the certainty of the evidence was very low (2 studies, 25,891 participants). One study (7247 participants) reported a decrease in mortality for all patients (relative effect -42%; change in level -3.60, 95% CI -11.26 to 4.07; change in slope -0.51, 95% CI -2.26 to 1.23), patients with Injury Severity Score 15 to 24 (relative effect -44%; change in level -8.80, 95% CI -29.61 to 12.00; change in slope -0.96, 95% CI -5.69 to 3.77), and patients with Injury Severity Score greater than 24 (relative effect -55%; change in level -17.87, 95% CI -47.12 to 11.37; change in slope -1.90, 95% CI -8.55 to 4.75). A second study (18,644 participants, follow-up 11 years) reported reduced mortality for adults (relative effect -67%; change in level -17.52, 95% CI -42.27 to 7.23; change in slope -2.09, 95% CI -6.22 to 2.04) and children (relative effect -84%; change in level -18.56, 95% CI -30.11 to -7.01; change in slope -1.12, 95% CI -3.04 to 0.80). No studies reported data on adverse effects, utilisation and access to trauma care services, quality of care provided, equity, or knowledge about trauma care services. The available evidence is currently insufficient to quantify the implications and impact of organised trauma systems and designated trauma centres on clinical practice. This is primarily due to a lack of studies with high methodological rigour for assessing the effects of clinical interventions, as well as the absence of reporting on important outcomes for determining their effectiveness. Future research could provide evidence by utilising observational studies with high methodological rigour when randomised trials are not feasible; and focus on collecting important outcomes such as the utilisation, access, and quality of care provided, and knowledge about trauma care services. This Cochrane review had no dedicated funding. Protocol available via doi.org/10.1002/14651858.CD012500.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Trauma systems have become the standard of care in high-income countries, but remain uncommon in low- and middle-income countries. High-quality evidence of effectiveness is needed to advocate for the development of trauma systems in low- and middle-income countries, where the burden of injury is highest."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of organised trauma systems and designated trauma centres compared with usual care in injured patients."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and WHO ICTRP on 16 December 2023. We also searched grey literature, checked reference lists of included studies, and contacted the authors of relevant studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials, non-randomised trials, controlled before-after studies, and interrupted time series studies comparing organised trauma systems or designated trauma centres with usual care. We planned to include patients who had had major trauma (i.e. Injury Severity Score greater than 15), but made a post-hoc decision to include patients regardless of injury severity. Studies were considered for inclusion regardless of date, language, or publication status."
        },
        {
          "label": "OUTCOMES",
          "text": "The critical outcomes were patient outcomes (such as mortality, survival, and recovery), and adverse effects. Important outcomes were utilisation and access to trauma care services, quality of care provided, equity, and knowledge about trauma care services. Studies only reported patient outcomes (mortality, survival); there were no reports on adverse effects, utilisation and access to services, quality of care, equity, and knowledge about trauma care services."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane RoB 1 tool and guidance from the Cochrane Effective Practice and Organisation of Care (EPOC) group to evaluate individual studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently selected studies for inclusion, extracted data, and assessed risk of bias and certainty of evidence using GRADE. We could not perform a meta-analysis due to substantial clinical heterogeneity across studies. We re-analysed data from individual studies so they could be presented in a standardised format as relative effect, change in level, and change in slope. We summarised findings using a narrative synthesis."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "There were four interrupted time series studies (157,111 participants). Two studies (131,220 participants) compared organised trauma systems to usual care and two studies (25,891 participants) compared designated trauma centres to usual care. Two studies were conducted in the US, one in the UK, and one in Norway."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "It is very uncertain whether organised trauma systems reduce mortality compared to usual care because the certainty of the evidence was very low (2 studies, 131,220 participants). One study (20,357 participants, follow-up 6 years) reported reduced mortality with an organised trauma system intervention and a relative effect of -30% (change in level -2.02, 95% confidence interval (CI) -3.17 to -0.86; change in slope -0.10, 95% CI -0.53 to 0.33). A second study (110,863 participants, follow-up 9 years) reported improved survival with intervention and a relative effect of 14% (change in level 0.13, 95% CI -0.50 to 0.76; an increase of 0.13 survival cases per quarter; change in slope 0.08, 95% CI 0.01 to 0.15). No studies reported data on adverse effects, utilisation and access to trauma care services, quality of care provided, equity, or knowledge about trauma care services. It is very uncertain whether designated trauma centres reduce mortality compared to usual care because the certainty of the evidence was very low (2 studies, 25,891 participants). One study (7247 participants) reported a decrease in mortality for all patients (relative effect -42%; change in level -3.60, 95% CI -11.26 to 4.07; change in slope -0.51, 95% CI -2.26 to 1.23), patients with Injury Severity Score 15 to 24 (relative effect -44%; change in level -8.80, 95% CI -29.61 to 12.00; change in slope -0.96, 95% CI -5.69 to 3.77), and patients with Injury Severity Score greater than 24 (relative effect -55%; change in level -17.87, 95% CI -47.12 to 11.37; change in slope -1.90, 95% CI -8.55 to 4.75). A second study (18,644 participants, follow-up 11 years) reported reduced mortality for adults (relative effect -67%; change in level -17.52, 95% CI -42.27 to 7.23; change in slope -2.09, 95% CI -6.22 to 2.04) and children (relative effect -84%; change in level -18.56, 95% CI -30.11 to -7.01; change in slope -1.12, 95% CI -3.04 to 0.80). No studies reported data on adverse effects, utilisation and access to trauma care services, quality of care provided, equity, or knowledge about trauma care services."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "The available evidence is currently insufficient to quantify the implications and impact of organised trauma systems and designated trauma centres on clinical practice. This is primarily due to a lack of studies with high methodological rigour for assessing the effects of clinical interventions, as well as the absence of reporting on important outcomes for determining their effectiveness. Future research could provide evidence by utilising observational studies with high methodological rigour when randomised trials are not feasible; and focus on collecting important outcomes such as the utilisation, access, and quality of care provided, and knowledge about trauma care services."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available via doi.org/10.1002/14651858.CD012500."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40747779/",
      "pubDate": "2025 Aug 01",
      "doi": "10.1002/14651858.CD012500.pub2",
      "dateReceived": "2025-09-05T23:22:29.673Z",
      "isNew": false,
      "summary": "The impact of organized trauma systems and trauma centers on clinical practice cannot be definitively determined due to a lack of high-quality research and comprehensive outcome reporting."
    },
    {
      "id": "89674354ec72",
      "title": "Bivalent RSV Prefusion F Protein-Based Vaccine for Preventing Cardiovascular Hospitalizations in Older Adults: A Prespecified Analysis of the DAN-RSV Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48032633/117529",
      "dateReceived": "2025-09-05T23:22:29.672Z",
      "isNew": false
    },
    {
      "id": "69436cc0a769",
      "title": "Apixaban for Extended Treatment of Provoked Venous Thromboembolism.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Hematology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48020484/117515",
      "abstract": "The appropriate duration of anticoagulation for venous thromboembolism (VTE) in patients who have a transient provoking factor (e.g., surgery, trauma, or immobility) and concomitant enduring risk factors is uncertain. In this single-center, double-blind, randomized trial, adults with VTE after the occurrence of a transient provoking factor who had at least one enduring risk factor and had completed at least 3 months of anticoagulation were assigned to receive oral apixaban (at a dose of 2.5 mg twice daily) or placebo for 12 months. The primary efficacy outcome was the first symptomatic recurrent VTE. The primary safety outcome was the first episode of major bleeding according to the criteria of the International Society on Thrombosis and Hemostasis. A total of 600 patients underwent randomization (mean age, 59.5 years; female sex, 57.0%; non-White race, 19.2%). The trial population had a broad range of provoking factors and enduring risk factors. Symptomatic recurrent VTE occurred in 4 of the 300 patients (1.3%) in the apixaban group and in 30 of the 300 patients (10.0%) in the placebo group (hazard ratio, 0.13; 95% confidence interval [CI], 0.04 to 0.36; P<0.001). Major bleeding occurred in 1 patient in the apixaban group and none in the placebo group. Clinically relevant nonmajor bleeding was observed in 14 of 294 patients (4.8%) in the apixaban group and in 5 of 294 patients (1.7%) in the placebo group (hazard ratio, 2.68; 95% CI, 0.96 to 7.43; P = 0.06). One patient in the apixaban group and 3 patients in the placebo group died, with no deaths attributed to cardiovascular or hemorrhagic causes. Nonhemorrhagic, nonfatal adverse events occurred in 6 patients (2.0%) in each group. Among patients with provoked VTE and enduring risk factors, low-intensity therapy with apixaban for 12 months resulted in a lower risk of symptomatic recurrent VTE than placebo, with a low risk of major bleeding. (Funded by Bristol-Myers Squibb-Pfizer Alliance; HI-PRO ClinicalTrials.gov number, NCT04168203.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The appropriate duration of anticoagulation for venous thromboembolism (VTE) in patients who have a transient provoking factor (e.g., surgery, trauma, or immobility) and concomitant enduring risk factors is uncertain."
        },
        {
          "label": "METHODS",
          "text": "In this single-center, double-blind, randomized trial, adults with VTE after the occurrence of a transient provoking factor who had at least one enduring risk factor and had completed at least 3 months of anticoagulation were assigned to receive oral apixaban (at a dose of 2.5 mg twice daily) or placebo for 12 months. The primary efficacy outcome was the first symptomatic recurrent VTE. The primary safety outcome was the first episode of major bleeding according to the criteria of the International Society on Thrombosis and Hemostasis."
        },
        {
          "label": "RESULTS",
          "text": "A total of 600 patients underwent randomization (mean age, 59.5 years; female sex, 57.0%; non-White race, 19.2%). The trial population had a broad range of provoking factors and enduring risk factors. Symptomatic recurrent VTE occurred in 4 of the 300 patients (1.3%) in the apixaban group and in 30 of the 300 patients (10.0%) in the placebo group (hazard ratio, 0.13; 95% confidence interval [CI], 0.04 to 0.36; P<0.001). Major bleeding occurred in 1 patient in the apixaban group and none in the placebo group. Clinically relevant nonmajor bleeding was observed in 14 of 294 patients (4.8%) in the apixaban group and in 5 of 294 patients (1.7%) in the placebo group (hazard ratio, 2.68; 95% CI, 0.96 to 7.43; P = 0.06). One patient in the apixaban group and 3 patients in the placebo group died, with no deaths attributed to cardiovascular or hemorrhagic causes. Nonhemorrhagic, nonfatal adverse events occurred in 6 patients (2.0%) in each group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with provoked VTE and enduring risk factors, low-intensity therapy with apixaban for 12 months resulted in a lower risk of symptomatic recurrent VTE than placebo, with a low risk of major bleeding. (Funded by Bristol-Myers Squibb-Pfizer Alliance; HI-PRO ClinicalTrials.gov number, NCT04168203.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888734/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1056/NEJMoa2509426",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false,
      "summary": "In patients with blood clots triggered by a known cause and ongoing risk factors, taking apixaban for a year reduced the chance of another blood clot compared to a placebo, with a low risk of serious bleeding."
    },
    {
      "id": "cbe3b227998d",
      "title": "A clinical practice guideline for tuberculous meningitis.",
      "journal": "Lancet Infect Dis",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48020484/117496",
      "abstract": "Tuberculous meningitis is the most severe form of tuberculosis, causing death or disability in around half of those affected. There are no up-to-date international guidelines defining its optimal management. Therefore, the Tuberculous Meningitis International Research Consortium conducted a systematic review of available evidence to address key management questions and to develop practice guidance. The consortium includes representatives from India, Indonesia, South Africa, Uganda, Viet Nam, Australia, the Netherlands, the UK, and the USA. Questions were developed using the Population, Intervention, Comparator, Outcome (PICO) format for tuberculous meningitis diagnosis, anti-tuberculosis chemotherapy, adjunctive anti-inflammatory therapy, and neurocritical and neurosurgical care. A Grading of Recommendations, Assessment, Development and Evaluations approach was used to assess the certainty (or quality) of evidence and establish the direction and strength of recommendations for each PICO-based question. We provide evidence-based recommendations for the optimal treatment and diagnosis of tuberculous meningitis, alongside expert opinion. We expose substantial knowledge and evidence gaps, thereby highlighting current research priorities.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40840485/",
      "pubDate": "2025 Aug 18",
      "doi": "10.1016/S1473-3099(25)00364-0",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false,
      "summary": "The Tuberculous Meningitis International Research Consortium developed evidence-based recommendations for the optimal treatment and diagnosis of tuberculous meningitis, while also identifying research gaps."
    },
    {
      "id": "bc9237b9391a",
      "title": "Clinical Outcomes With Personalized Accelerated Physiologic Pacing in Heart Failure With Preserved Ejection Fraction: Follow-up of the myPACE Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48020484/117482",
      "abstract": "Patients with heart failure with preserved ejection fraction (HFpEF) and physiologic pacemakers may benefit from pacing rates above the standard 60 beats per minute (bpm). To compare adverse event accrual between personalized accelerated pacing and usual care in HFpEF. This was an observational extension of the myPACE randomized clinical trial with up to 4 years of follow-up in 100 patients with stage B or C HFpEF and preexisting physiologic pacemakers treated at the University of Vermont Medical Center. The myPACE study was conducted from June 2019 to December 2021; follow-up for this report was concluded in June 2023. Participants in the original myPACE trial were randomly assigned to either personalized accelerated pacing (myPACE) or 60 bpm (usual care). The primary outcome was the accrual of first and recurrent adverse clinical events during the open-label follow-up phase-including urgent visits or hospitalizations for heart failure or atrial fibrillation, myocardial infarction, stroke, or death-assessed using an intention-to-treat (ITT) analysis and a prespecified per-protocol (PP) analysis of patients who continued their assigned treatment. Secondary outcomes included event-free survival in both ITT and PP analyses. Among the 100 original trial participants (48 in myPACE and 52 in usual care), the ITT analysis demonstrated a trend toward slower event accrual with the myPACE intervention (15 vs 33 events; Lin-Wei-Ying-Yang estimate [LWYY], 0.48; 95% CI, 0.22-1.06; P = .07) and longer event-free survival (hazard ratio [HR], 0.63; 95% CI, 0.31-1.29; P = .20) but did not reach statistical significance. In the prespecified PP analysis, 87 remained on their assigned heart rate setting over the 4-year follow-up (39 in myPACE and 48 in usual care). The mean (SD) age was 74 (10) years, and 48 participants (55%) were male. In this PP analysis, myPACE was associated with a slower accrual of clinical events (5 vs 31 events; LWYY, 0.16; 95% CI, 0.04-0.67; P = .01) and longer event-free survival (HR, 0.30; 95% CI, 0.11-0.80; P = .02) compared to usual care. These results were primarily driven by heart failure-related events. In this observational clinical events analysis of the myPACE trial, analysis by ITT did not achieve statistical significance between study arms. However, PP analysis showed that personalized accelerated physiologic pacing was associated with a slower accrual of adverse clinical events compared with the standard 60-bpm setting. These results are hypothesis generating and warrant confirmation in larger multicenter trials. ClinicalTrials.gov Identifier: NCT04721314.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Patients with heart failure with preserved ejection fraction (HFpEF) and physiologic pacemakers may benefit from pacing rates above the standard 60 beats per minute (bpm)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare adverse event accrual between personalized accelerated pacing and usual care in HFpEF."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was an observational extension of the myPACE randomized clinical trial with up to 4 years of follow-up in 100 patients with stage B or C HFpEF and preexisting physiologic pacemakers treated at the University of Vermont Medical Center. The myPACE study was conducted from June 2019 to December 2021; follow-up for this report was concluded in June 2023."
        },
        {
          "label": "INTERVENTION",
          "text": "Participants in the original myPACE trial were randomly assigned to either personalized accelerated pacing (myPACE) or 60 bpm (usual care)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the accrual of first and recurrent adverse clinical events during the open-label follow-up phase-including urgent visits or hospitalizations for heart failure or atrial fibrillation, myocardial infarction, stroke, or death-assessed using an intention-to-treat (ITT) analysis and a prespecified per-protocol (PP) analysis of patients who continued their assigned treatment. Secondary outcomes included event-free survival in both ITT and PP analyses."
        },
        {
          "label": "RESULTS",
          "text": "Among the 100 original trial participants (48 in myPACE and 52 in usual care), the ITT analysis demonstrated a trend toward slower event accrual with the myPACE intervention (15 vs 33 events; Lin-Wei-Ying-Yang estimate [LWYY], 0.48; 95% CI, 0.22-1.06; P = .07) and longer event-free survival (hazard ratio [HR], 0.63; 95% CI, 0.31-1.29; P = .20) but did not reach statistical significance. In the prespecified PP analysis, 87 remained on their assigned heart rate setting over the 4-year follow-up (39 in myPACE and 48 in usual care). The mean (SD) age was 74 (10) years, and 48 participants (55%) were male. In this PP analysis, myPACE was associated with a slower accrual of clinical events (5 vs 31 events; LWYY, 0.16; 95% CI, 0.04-0.67; P = .01) and longer event-free survival (HR, 0.30; 95% CI, 0.11-0.80; P = .02) compared to usual care. These results were primarily driven by heart failure-related events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this observational clinical events analysis of the myPACE trial, analysis by ITT did not achieve statistical significance between study arms. However, PP analysis showed that personalized accelerated physiologic pacing was associated with a slower accrual of adverse clinical events compared with the standard 60-bpm setting. These results are hypothesis generating and warrant confirmation in larger multicenter trials."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04721314."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40864451/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1001/jamacardio.2025.2827",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false,
      "summary": "Personalized accelerated physiologic pacing demonstrated a slower accumulation of adverse clinical events compared to standard pacing in a per-protocol analysis, but the findings require validation in larger studies."
    },
    {
      "id": "ad6da80592c7",
      "title": "Risk of cancer in the short- and long-term after incident venous thromboembolism - the HUNT and Tromso studies.",
      "journal": "Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117455",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false
    },
    {
      "id": "929f706795a5",
      "title": "Improving stroke risk prediction in atrial fibrillation with circulating biomarkers: the CHA(2)DS(2)-VASc-Biomarkers model.",
      "journal": "J Thromb Haemost",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117403",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false
    },
    {
      "id": "823898ee419e",
      "title": "Vonoprazan High-Dose Dual, Vonoprazan Triple, and Rabeprazole Reverse Hybrid Therapies for First-Line Treatment of Helicobacter pylori Infection: A Multicenter Randomized Trial.",
      "journal": "Am J Gastroenterol",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117363",
      "abstract": "The aim of this study was to compare the efficacy of 14-day vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid therapies for the first-line treatment of Helicobacter pylori infection. In the multicenter, randomized, open-label trial, we consecutively recruited adult H. pylori -infected patients from 6 centers in Taiwan. Subjects were randomly assigned (1:1:1) to 14-day vonoprazan high-dose dual, vonoprazan triple, or rabeprazole reverse hybrid therapy. Eradication status was determined by 13 C-urea breath test. The primary outcome was the eradication rate of H. pylori assessed in the intention-to-treat population. Between December 2021 and April 2024, 906 patients were recruited. The eradication rates were 83.8% (253/302) for vonoprazan high-dose dual therapy, 90.1% (272/302) for vonoprazan triple therapy, and 89.1% (271/302) for rabeprazole reverse hybrid therapy in intention-to-treat analysis. Vonoprazan high-dose dual therapy was inferior to both vonoprazan triple (95% confidence interval -11.5% to -1.1%; P = 0.022) and rabeprazole reverse hybrid therapies (95% confidence interval -10.7% to 0.1%; P = 0.031). There were no significant differences in the overall proportions of patients experiencing adverse events among vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid groups (10.3%, 15.2%, and 15.6%, respectively). Body weight ≥60 kg, clarithromycin resistance, and poor drug adherence were independent risk factors predicting eradication failure for the 3 corresponding therapies, with odds ratios of 3.2 (1.3-7.5), 4.8 (1.2-18.9), and 14.8 (2.8-78.8), respectively. Vonoprazan triple therapy and rabeprazole reverse hybrid therapy are preferable to vonoprazan dual therapy for the first-line treatment of H. pylori infection.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "The aim of this study was to compare the efficacy of 14-day vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid therapies for the first-line treatment of Helicobacter pylori infection."
        },
        {
          "label": "METHODS",
          "text": "In the multicenter, randomized, open-label trial, we consecutively recruited adult H. pylori -infected patients from 6 centers in Taiwan. Subjects were randomly assigned (1:1:1) to 14-day vonoprazan high-dose dual, vonoprazan triple, or rabeprazole reverse hybrid therapy. Eradication status was determined by 13 C-urea breath test. The primary outcome was the eradication rate of H. pylori assessed in the intention-to-treat population."
        },
        {
          "label": "RESULTS",
          "text": "Between December 2021 and April 2024, 906 patients were recruited. The eradication rates were 83.8% (253/302) for vonoprazan high-dose dual therapy, 90.1% (272/302) for vonoprazan triple therapy, and 89.1% (271/302) for rabeprazole reverse hybrid therapy in intention-to-treat analysis. Vonoprazan high-dose dual therapy was inferior to both vonoprazan triple (95% confidence interval -11.5% to -1.1%; P = 0.022) and rabeprazole reverse hybrid therapies (95% confidence interval -10.7% to 0.1%; P = 0.031). There were no significant differences in the overall proportions of patients experiencing adverse events among vonoprazan high-dose dual, vonoprazan triple, and rabeprazole reverse hybrid groups (10.3%, 15.2%, and 15.6%, respectively). Body weight ≥60 kg, clarithromycin resistance, and poor drug adherence were independent risk factors predicting eradication failure for the 3 corresponding therapies, with odds ratios of 3.2 (1.3-7.5), 4.8 (1.2-18.9), and 14.8 (2.8-78.8), respectively."
        },
        {
          "label": "DISCUSSION",
          "text": "Vonoprazan triple therapy and rabeprazole reverse hybrid therapy are preferable to vonoprazan dual therapy for the first-line treatment of H. pylori infection."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40560185/",
      "pubDate": "2025 Jun 16",
      "doi": "10.14309/ajg.0000000000003607",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false,
      "summary": "Vonoprazan triple therapy and rabeprazole reverse hybrid therapy demonstrated superior eradication rates compared to vonoprazan high-dose dual therapy for first-line treatment of *H. pylori* infection."
    },
    {
      "id": "9cbe80b61900",
      "title": "Paclitaxel-Coated Balloon for the Treatment of Multilayer In-Stent Restenosis: AGENT IDE Subgroup Analysis.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47919189/117356",
      "abstract": "Patients with coronary in-stent restenosis (ISR) within multiple layers of stent pose a specific clinical challenge because of higher rates of recurrent restenosis as well as a desire to avoid an additional layer of stent. Drug-coated balloons (DCBs) provide an alternative antiproliferative therapeutic option for multilayer ISR. We evaluated the efficacy and safety of a low-dose paclitaxel-coated vs uncoated balloon among patients with multilayer or single-layer ISR in the AGENT IDE (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis) trial. AGENT IDE is a prospective, multicenter trial that randomized patients with ISR (reference vessel diameter >2.0 mm to ≤4.0 mm and lesion length <26 mm) in a 2:1 allocation to paclitaxel-coated or an uncoated balloon following successful lesion preparation. Randomization was stratified by multi- vs single-layer ISR as well as by center. The primary study endpoint was 1-year target lesion failure (TLF): composite occurrence of ischemia-driven target lesion revascularization (TLR), target vessel-related myocardial infarction (MI), or cardiac death. Of the 600 patients randomized in the trial, multilayer ISR was present in 258 (44%) patients. Patients with multilayer ISR had higher rates of TLF at 1 year compared with those with single-layer ISR (29.0% vs 15.7%, P < 0.0001). The overall study results were consistent irrespective of multilayer vs single-layer ISR (P = 0.66). Among patients with multilayer ISR, TLF was lower with paclitaxel-coated balloon compared with an uncoated balloon (23.8% vs 40.0%; HR: 0.55; 95% CI: 0.34-0.87; P = 0.01), driven by reductions in both TLR and target vessel-related MI. Similar findings were observed among patients with single layer ISR (1-year TLF: 13.5% with paclitaxel-coated vs 20.2% with uncoated balloon; HR: 0.64; 95% CI: 0.37-1.11; P = 0.11), although absolute event rates were lower. Patients with ISR of multiple stent layers had higher rates of adverse stent-related events compared with patients with single-layer ISR. Treatment with a paclitaxel-coated balloon led to greater absolute risk reduction in 1-year TLF among patients with multilayer ISR compared with an uncoated balloon. (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis [ISR] [AGENT IDE]; NCT04647253).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Patients with coronary in-stent restenosis (ISR) within multiple layers of stent pose a specific clinical challenge because of higher rates of recurrent restenosis as well as a desire to avoid an additional layer of stent. Drug-coated balloons (DCBs) provide an alternative antiproliferative therapeutic option for multilayer ISR."
        },
        {
          "label": "OBJECTIVES",
          "text": "We evaluated the efficacy and safety of a low-dose paclitaxel-coated vs uncoated balloon among patients with multilayer or single-layer ISR in the AGENT IDE (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis) trial."
        },
        {
          "label": "METHODS",
          "text": "AGENT IDE is a prospective, multicenter trial that randomized patients with ISR (reference vessel diameter >2.0 mm to ≤4.0 mm and lesion length <26 mm) in a 2:1 allocation to paclitaxel-coated or an uncoated balloon following successful lesion preparation. Randomization was stratified by multi- vs single-layer ISR as well as by center. The primary study endpoint was 1-year target lesion failure (TLF): composite occurrence of ischemia-driven target lesion revascularization (TLR), target vessel-related myocardial infarction (MI), or cardiac death."
        },
        {
          "label": "RESULTS",
          "text": "Of the 600 patients randomized in the trial, multilayer ISR was present in 258 (44%) patients. Patients with multilayer ISR had higher rates of TLF at 1 year compared with those with single-layer ISR (29.0% vs 15.7%, P < 0.0001). The overall study results were consistent irrespective of multilayer vs single-layer ISR (P = 0.66). Among patients with multilayer ISR, TLF was lower with paclitaxel-coated balloon compared with an uncoated balloon (23.8% vs 40.0%; HR: 0.55; 95% CI: 0.34-0.87; P = 0.01), driven by reductions in both TLR and target vessel-related MI. Similar findings were observed among patients with single layer ISR (1-year TLF: 13.5% with paclitaxel-coated vs 20.2% with uncoated balloon; HR: 0.64; 95% CI: 0.37-1.11; P = 0.11), although absolute event rates were lower."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Patients with ISR of multiple stent layers had higher rates of adverse stent-related events compared with patients with single-layer ISR. Treatment with a paclitaxel-coated balloon led to greater absolute risk reduction in 1-year TLF among patients with multilayer ISR compared with an uncoated balloon. (A Clinical Trial to Assess the Agent Paclitaxel Coated PTCA Balloon Catheter for the Treatment of Subjects With In-Stent Restenosis [ISR] [AGENT IDE]; NCT04647253)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40803784/",
      "pubDate": "2025 Aug 19",
      "doi": "10.1016/j.jacc.2025.05.062",
      "dateReceived": "2025-09-04T23:22:29.764Z",
      "isNew": false,
      "summary": "Patients with in-stent restenosis (ISR) involving multiple stent layers experienced more adverse events, and a paclitaxel-coated balloon was more effective than an uncoated balloon in reducing target lesion failure in these patients."
    },
    {
      "id": "e1d51f9053b7",
      "title": "RSV Prefusion F Vaccine for Prevention of Hospitalization in Older Adults.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48020484/117527",
      "abstract": "Respiratory syncytial virus (RSV) can cause serious illness in older adults. The bivalent RSV prefusion F protein-based vaccine (RSVpreF) has been shown to prevent RSV-associated respiratory illness, but data from randomized trials with regard to its effect on outcomes involving hospitalization are limited. In this pragmatic, open-label trial with individual randomization, participants who were 60 years of age or older were assigned in a 1:1 ratio to receive the RSVpreF vaccine (the RSVpreF group) or no vaccine (the control group) during the 2024-2025 winter season. Baseline and outcome data were collected with the use of national registries. The primary end point was hospitalization for RSV-related respiratory tract disease. Secondary end points included hospitalization for RSV-related lower respiratory tract disease and hospitalization for respiratory tract disease from any cause. The prespecified criterion for success for the primary end point and RSV-related secondary end points was a minimum vaccine effectiveness of greater than 20%. Of 131,379 participants who underwent randomization, 131,276 were included in the intention-to-treat population. During follow-up, hospitalization for RSV-related respiratory tract disease occurred in 3 of 65,642 participants in the RSVpreF group and in 18 of 65,634 participants in the control group (0.11 events vs. 0.66 events per 1000 participant-years; vaccine effectiveness, 83.3%; 95% confidence interval [CI], 42.9 to 96.9; P = 0.007 for minimum effectiveness of >20%). The RSVpreF group also had fewer hospitalizations for RSV-related lower respiratory tract disease than the control group (1 vs. 12; vaccine effectiveness, 91.7%; 95% CI, 43.7 to 99.8; P = 0.009 for minimum effectiveness of >20%), as well as fewer hospitalizations for respiratory tract disease from any cause (284 vs. 335; vaccine effectiveness, 15.2%; 95% CI, 0.5 to 27.9; P = 0.04 for vaccine effectiveness of >0%). The incidence of serious adverse events was similar in the two groups. Among adults 60 years of age or older, the RSVpreF vaccine reduced the incidence of hospitalization for RSV-related respiratory tract disease as compared with no vaccine. (Funded by Pfizer; European Union Clinical Trials number, 2024-516600-42-00; DAN-RSV ClinicalTrials.gov number, NCT06684743.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Respiratory syncytial virus (RSV) can cause serious illness in older adults. The bivalent RSV prefusion F protein-based vaccine (RSVpreF) has been shown to prevent RSV-associated respiratory illness, but data from randomized trials with regard to its effect on outcomes involving hospitalization are limited."
        },
        {
          "label": "METHODS",
          "text": "In this pragmatic, open-label trial with individual randomization, participants who were 60 years of age or older were assigned in a 1:1 ratio to receive the RSVpreF vaccine (the RSVpreF group) or no vaccine (the control group) during the 2024-2025 winter season. Baseline and outcome data were collected with the use of national registries. The primary end point was hospitalization for RSV-related respiratory tract disease. Secondary end points included hospitalization for RSV-related lower respiratory tract disease and hospitalization for respiratory tract disease from any cause. The prespecified criterion for success for the primary end point and RSV-related secondary end points was a minimum vaccine effectiveness of greater than 20%."
        },
        {
          "label": "RESULTS",
          "text": "Of 131,379 participants who underwent randomization, 131,276 were included in the intention-to-treat population. During follow-up, hospitalization for RSV-related respiratory tract disease occurred in 3 of 65,642 participants in the RSVpreF group and in 18 of 65,634 participants in the control group (0.11 events vs. 0.66 events per 1000 participant-years; vaccine effectiveness, 83.3%; 95% confidence interval [CI], 42.9 to 96.9; P = 0.007 for minimum effectiveness of >20%). The RSVpreF group also had fewer hospitalizations for RSV-related lower respiratory tract disease than the control group (1 vs. 12; vaccine effectiveness, 91.7%; 95% CI, 43.7 to 99.8; P = 0.009 for minimum effectiveness of >20%), as well as fewer hospitalizations for respiratory tract disease from any cause (284 vs. 335; vaccine effectiveness, 15.2%; 95% CI, 0.5 to 27.9; P = 0.04 for vaccine effectiveness of >0%). The incidence of serious adverse events was similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among adults 60 years of age or older, the RSVpreF vaccine reduced the incidence of hospitalization for RSV-related respiratory tract disease as compared with no vaccine. (Funded by Pfizer; European Union Clinical Trials number, 2024-516600-42-00; DAN-RSV ClinicalTrials.gov number, NCT06684743.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40888695/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1056/NEJMoa2509810",
      "dateReceived": "2025-09-04T23:22:29.763Z",
      "isNew": false,
      "summary": "The RSVpreF vaccine decreased the likelihood of hospitalization for RSV-related respiratory illness in adults aged 60 and older."
    },
    {
      "id": "e213ea767f96",
      "title": "Pharmacotherapy for obesity management in adults: 2025 clinical practice guideline update.",
      "journal": "CMAJ",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47909824/117406",
      "abstract": "Pharmacotherapy is a key component of comprehensive obesity management, alongside behavioural therapy and metabolic and bariatric surgery. In this guideline, we update the pharmacotherapy recommendations in the 2020 Canadian clinical practice guideline on obesity in adults and in the 2022 pharmacotherapy for obesity management revision to provide current recommendations for clinicians on the efficacy, safety, and appropriate use of pharmacotherapy in the management of obesity in adults. This guideline update follows the same methodology as the 2020 Canadian guideline on obesity in adults, adhering to the Appraisal of Guidelines for Research and Evaluation instrument and using the Shekelle framework to assess and grade evidence and to formulate recommendations. Building on the search conducted for the 2022 pharmacotherapy revision, we conducted a systematic literature review (search dates January 2022 to July 2024), supplemented by relevant trials published through May 2025, to identify studies assessing the efficacy of pharmacotherapy for weight management. We also conducted 13 targeted searches on the management of weight-related complications in 13 subpopulations with important adiposity-related health issues. We engaged primary care physicians, obesity medicine specialists, and people with lived experience of obesity to provide feedback on the recommendations. This update includes 6 new and 7 revised recommendations since the 2022 pharmacotherapy guideline revision (all 2020 pharmacotherapy recommendations are updated). Measures of central adiposity, in addition to ethnicity-specific body mass index and adiposity-related complications, should be used to guide the decision to initiate pharmacotherapy. Obesity pharmacotherapy should be used in conjunction with health behaviour changes and individualized based on a person's specific health needs and in keeping with their values and preferences. Recommendations support long-term use of obesity pharmacotherapy for sustained weight loss and maintenance of weight loss. We provide recommendations for use of specific obesity pharmacotherapies with proven benefit in specific subpopulations - atherosclerotic cardiovascular disease, heart failure with preserved ejection fraction, metabolic dysfunction-associated steatohepatitis, prediabetes, type 2 diabetes, obstructive sleep apnea, osteoarthritis - and for those with certain specific monogenic causes of obesity. We recommend against the use of compounded medications or medications other than those approved for weight loss in people with excess adiposity. Pharmacotherapy in obesity facilitates clinically meaningful weight loss and important improvements in obesity-related health complications. Clinicians who treat people with obesity with or without obesity-related health complications should appropriately use pharmacotherapy as an integral part of their treatment paradigm.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Pharmacotherapy is a key component of comprehensive obesity management, alongside behavioural therapy and metabolic and bariatric surgery. In this guideline, we update the pharmacotherapy recommendations in the 2020 Canadian clinical practice guideline on obesity in adults and in the 2022 pharmacotherapy for obesity management revision to provide current recommendations for clinicians on the efficacy, safety, and appropriate use of pharmacotherapy in the management of obesity in adults."
        },
        {
          "label": "METHODS",
          "text": "This guideline update follows the same methodology as the 2020 Canadian guideline on obesity in adults, adhering to the Appraisal of Guidelines for Research and Evaluation instrument and using the Shekelle framework to assess and grade evidence and to formulate recommendations. Building on the search conducted for the 2022 pharmacotherapy revision, we conducted a systematic literature review (search dates January 2022 to July 2024), supplemented by relevant trials published through May 2025, to identify studies assessing the efficacy of pharmacotherapy for weight management. We also conducted 13 targeted searches on the management of weight-related complications in 13 subpopulations with important adiposity-related health issues. We engaged primary care physicians, obesity medicine specialists, and people with lived experience of obesity to provide feedback on the recommendations."
        },
        {
          "label": "RECOMMENDATIONS",
          "text": "This update includes 6 new and 7 revised recommendations since the 2022 pharmacotherapy guideline revision (all 2020 pharmacotherapy recommendations are updated). Measures of central adiposity, in addition to ethnicity-specific body mass index and adiposity-related complications, should be used to guide the decision to initiate pharmacotherapy. Obesity pharmacotherapy should be used in conjunction with health behaviour changes and individualized based on a person's specific health needs and in keeping with their values and preferences. Recommendations support long-term use of obesity pharmacotherapy for sustained weight loss and maintenance of weight loss. We provide recommendations for use of specific obesity pharmacotherapies with proven benefit in specific subpopulations - atherosclerotic cardiovascular disease, heart failure with preserved ejection fraction, metabolic dysfunction-associated steatohepatitis, prediabetes, type 2 diabetes, obstructive sleep apnea, osteoarthritis - and for those with certain specific monogenic causes of obesity. We recommend against the use of compounded medications or medications other than those approved for weight loss in people with excess adiposity."
        },
        {
          "label": "INTERPRETATION",
          "text": "Pharmacotherapy in obesity facilitates clinically meaningful weight loss and important improvements in obesity-related health complications. Clinicians who treat people with obesity with or without obesity-related health complications should appropriately use pharmacotherapy as an integral part of their treatment paradigm."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40789597/",
      "pubDate": "2025 Aug 10",
      "doi": "10.1503/cmaj.250502",
      "dateReceived": "2025-09-03T23:22:14.666Z",
      "isNew": false,
      "summary": "Pharmacotherapy for obesity should be used alongside lifestyle changes, tailored to individual needs, and guided by measures of central adiposity and related complications, with long-term use supported."
    },
    {
      "id": "a84859329464",
      "title": "Continuous glucose monitoring in noninsulin-treated type 2 diabetes: A critical review of reported trials with an updated systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47909824/117338",
      "abstract": "We aimed to review the observational and randomised clinical trial evidence and provide pragmatic recommendations for using continuous glucose monitoring (CGM) in individuals living with noninsulin-treated type 2 diabetes (T2DM). We first undertook a narrative review of observational studies that enrolled noninsulin-users or mixed populations of noninsulin and insulin-users with T2DM as well as randomised controlled trials (RCTs) that enrolled mixed populations with T2DM. We then performed a systematic review of the RCTs that specifically enrolled noninsulin-treated populations with T2DM and compared CGM to BGM/usual care. A meta-analysis of glycaemic outcomes was conducted with predefined subgroups based on CGM type. RCTs in mixed populations and observational studies demonstrated a largely consistent benefit of CGM on glycaemic and nonglycaemic outcomes with cost effectiveness and reduced healthcare resource utilisation. The meta-analysis of RCTs in noninsulin users included 8 studies encompassing 541 participants, among whom 297 (55%) were assigned to the CGM group. CGM was associated with significantly reduced HbA1c (weighted mean difference [WMD] -0.37%; 95% CI -0.49, -0.24; p < 0.00001; I = 0%), increased % time in range (WMD 8.84; 95% CI 4.62, 13.06; p < 0.0001; I = 0%) and lower % time above range (WMD -8.14; 95% CI -12.66, -3.63; p = 0.0004; I = 0%). There were no significant subgroup differences. CGM use in noninsulin-treated individuals living with T2DM was associated with improved glycaemic outcomes and patient experience, reduced health care resource utilisation, and acceptable cost-effectiveness. These findings provide additional evidence to support CGM use among people living with T2DM who are not using insulin therapy.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "We aimed to review the observational and randomised clinical trial evidence and provide pragmatic recommendations for using continuous glucose monitoring (CGM) in individuals living with noninsulin-treated type 2 diabetes (T2DM)."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We first undertook a narrative review of observational studies that enrolled noninsulin-users or mixed populations of noninsulin and insulin-users with T2DM as well as randomised controlled trials (RCTs) that enrolled mixed populations with T2DM. We then performed a systematic review of the RCTs that specifically enrolled noninsulin-treated populations with T2DM and compared CGM to BGM/usual care. A meta-analysis of glycaemic outcomes was conducted with predefined subgroups based on CGM type."
        },
        {
          "label": "RESULTS",
          "text": "RCTs in mixed populations and observational studies demonstrated a largely consistent benefit of CGM on glycaemic and nonglycaemic outcomes with cost effectiveness and reduced healthcare resource utilisation. The meta-analysis of RCTs in noninsulin users included 8 studies encompassing 541 participants, among whom 297 (55%) were assigned to the CGM group. CGM was associated with significantly reduced HbA1c (weighted mean difference [WMD] -0.37%; 95% CI -0.49, -0.24; p < 0.00001; I = 0%), increased % time in range (WMD 8.84; 95% CI 4.62, 13.06; p < 0.0001; I = 0%) and lower % time above range (WMD -8.14; 95% CI -12.66, -3.63; p = 0.0004; I = 0%). There were no significant subgroup differences."
        },
        {
          "label": "CONCLUSIONS",
          "text": "CGM use in noninsulin-treated individuals living with T2DM was associated with improved glycaemic outcomes and patient experience, reduced health care resource utilisation, and acceptable cost-effectiveness. These findings provide additional evidence to support CGM use among people living with T2DM who are not using insulin therapy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40757453/",
      "pubDate": "2025 Aug 04",
      "doi": "10.1111/dom.70008",
      "dateReceived": "2025-09-03T23:22:14.666Z",
      "isNew": false,
      "summary": "Continuous glucose monitoring (CGM) in non-insulin-treated type 2 diabetes patients improved blood sugar control, patient experience, and resource use while being cost-effective."
    },
    {
      "id": "969f9b94f8f0",
      "title": "Canadian Association of Gastroenterology Clinical Practice Guideline for the Endoscopic Management of Nonvariceal Nonpeptic Ulcer Upper Gastrointestinal Bleeding.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47909824/117328",
      "dateReceived": "2025-09-03T23:22:14.666Z",
      "isNew": false
    },
    {
      "id": "e76b67147a20",
      "title": "Efficacies of artemether-lumefantrine, artesunate-amodiaquine, dihydroartemisinin-piperaquine, and artesunate-pyronaridine for the treatment of uncomplicated Plasmodium falciparum malaria in children aged 6 months to 10 years in Uganda: a randomised, open-label, phase 4 clinical trial.",
      "journal": "Lancet Infect Dis",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48006546/117497",
      "abstract": "Anti-malarial artemisinin-based combination therapies (ACTs) might be losing efficacy in east Africa, with the spread of artemisinin partial resistance and reduced partner drug activity. Our trial aimed to measure the efficacies of artemether-lumefantrine, artesunate-amodiaquine, dihydroartemisinin-piperaquine, and artesunate-pyronaridine in three sites in Uganda. This randomised, open-label, phase 4 clinical trial was carried out at three sites in the Agago, Arua, and Busia districts of Uganda. Children aged 6 months to 10 years with uncomplicated Plasmodium falciparum malaria were randomly assigned to receive either artemether-lumefantrine (20 mg artemether; 120 mg lumefantrine; twice a day for 3 days) in all sites or dihydroartemisinin-piperaquine (40 mg dihydroartemisinin and 320 mg piperaquine, once a day for 3 days) in Agago, artesunate-amodiaquine (25 mg artesunate and 67·5 mg amodiaquine for children <9 kg or 50 mg artesunate and 135 mg amodiaquine for children ≥9 kg, once a day for 3 days) in Busia; and artesunate-pyronaridine (60 mg artesunate and 180 mg pyronaridine for children >15 kg or 20 mg artesunate and 60 mg pyronaridine for children <15 kg, once a day for 3 days) in Arua, with follow-up to 42 days. Participants were not blinded to group assignments; however, investigators and those assessing outcome were masked. The primary outcome was parasitaemia, assessed by microscopy, either uncorrected or PCR-corrected to distinguish recrudescence from new infection. All participants who received the treatment per protocol and were not lost to follow-up were included in the primary outcome. All participants who were randomly allocated to treatment groups were included in the safety analyses. This study is registered with the Pan African Clinical Trials Registry, number PACTR202301796134887, and is complete. Between Nov 7, 2022, and March 24, 2023, 808 participants (437 [54%] female) were enrolled and assigned to treatment groups; 15 (2%) were lost to follow-up and 793 (98%) completed follow-up. The uncorrected adequate clinical and parasitological response for artemether-lumefantrine was 87 (51·8%; 95% CI 44·0-59·5) of 168 participants in Arua, 88 (51·8%; 44·0-59·4) of 170 and Busia, and 131 (79·4%; 72·3-85·1) of 165 in Agago. This response for artemether-lumefantrine was lower than that of the other ACTs at all sites: 97 (98·0%; 92·2-99·6) of 99 for dihydroartemisinin-piperaquine in Agago, 95 (99·0%; 93·5-99·9) of 96 for artesunate-amodiaquine in Busia, and 73 (73·7%; 63·8-81·8) of 99 for artesunate-pyronaridine in Arua. PCR-corrected 28-day efficacies were 88 (81·5%; 72·6-88·1) of 108 for artemether-lumefantrine and 95 (100%; 95·2-100·0) of 95 for artesunate-amodiaquine in Busia; 131 (97·0%; 92·1-99·0) of 135 for artemether-lumefantrine and 97 (100%; 95·3-100·0) of 97 for dihydroartemisinin-piperaquine in Agago; and 87 (82·1%; 73·2-88·6) of 106 for artemether-lumefantrine and 73 (92·4%; 83·6-96·9) of 79 for artesunate-pyronaridine in Arua. All regimens were well tolerated. The most common adverse events were upper respiratory tract infection, diarrhoea, and anaemia. None of the reported adverse events were attributed to the study drugs. There were two serious adverse events, both cases of severe malaria in Arua, one in each of the treatment groups. Parasite clearance half-lives were prolonged with parasites carrying the PfK13 Cys469Tyr (median 4·2 h; IQR 3·4-4·9) and Ala675Val (4·9 h; 3·4-5·7) mutations compared with wild-type parasites (2·8 h; 2·3-3·6; p<0·0001). Artemether-lumefantrine was associated with a higher risk of recurrent malaria than other antimalarial combinations tested, and K13 mutations were associated with delayed parasite clearance. Changes in first-line therapy for uncomplicated malaria must be considered in response to suboptimal efficacy of artemether-lumefantrine. US President's Malaria Initiative, US Agency for International Development, through the Uganda Malaria Reduction Activity and the National Institutes of Health (AI075045 and AI117001). For the Swahili translation of the abstract see Supplementary Materials section.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Anti-malarial artemisinin-based combination therapies (ACTs) might be losing efficacy in east Africa, with the spread of artemisinin partial resistance and reduced partner drug activity. Our trial aimed to measure the efficacies of artemether-lumefantrine, artesunate-amodiaquine, dihydroartemisinin-piperaquine, and artesunate-pyronaridine in three sites in Uganda."
        },
        {
          "label": "METHODS",
          "text": "This randomised, open-label, phase 4 clinical trial was carried out at three sites in the Agago, Arua, and Busia districts of Uganda. Children aged 6 months to 10 years with uncomplicated Plasmodium falciparum malaria were randomly assigned to receive either artemether-lumefantrine (20 mg artemether; 120 mg lumefantrine; twice a day for 3 days) in all sites or dihydroartemisinin-piperaquine (40 mg dihydroartemisinin and 320 mg piperaquine, once a day for 3 days) in Agago, artesunate-amodiaquine (25 mg artesunate and 67·5 mg amodiaquine for children <9 kg or 50 mg artesunate and 135 mg amodiaquine for children ≥9 kg, once a day for 3 days) in Busia; and artesunate-pyronaridine (60 mg artesunate and 180 mg pyronaridine for children >15 kg or 20 mg artesunate and 60 mg pyronaridine for children <15 kg, once a day for 3 days) in Arua, with follow-up to 42 days. Participants were not blinded to group assignments; however, investigators and those assessing outcome were masked. The primary outcome was parasitaemia, assessed by microscopy, either uncorrected or PCR-corrected to distinguish recrudescence from new infection. All participants who received the treatment per protocol and were not lost to follow-up were included in the primary outcome. All participants who were randomly allocated to treatment groups were included in the safety analyses. This study is registered with the Pan African Clinical Trials Registry, number PACTR202301796134887, and is complete."
        },
        {
          "label": "FINDINGS",
          "text": "Between Nov 7, 2022, and March 24, 2023, 808 participants (437 [54%] female) were enrolled and assigned to treatment groups; 15 (2%) were lost to follow-up and 793 (98%) completed follow-up. The uncorrected adequate clinical and parasitological response for artemether-lumefantrine was 87 (51·8%; 95% CI 44·0-59·5) of 168 participants in Arua, 88 (51·8%; 44·0-59·4) of 170 and Busia, and 131 (79·4%; 72·3-85·1) of 165 in Agago. This response for artemether-lumefantrine was lower than that of the other ACTs at all sites: 97 (98·0%; 92·2-99·6) of 99 for dihydroartemisinin-piperaquine in Agago, 95 (99·0%; 93·5-99·9) of 96 for artesunate-amodiaquine in Busia, and 73 (73·7%; 63·8-81·8) of 99 for artesunate-pyronaridine in Arua. PCR-corrected 28-day efficacies were 88 (81·5%; 72·6-88·1) of 108 for artemether-lumefantrine and 95 (100%; 95·2-100·0) of 95 for artesunate-amodiaquine in Busia; 131 (97·0%; 92·1-99·0) of 135 for artemether-lumefantrine and 97 (100%; 95·3-100·0) of 97 for dihydroartemisinin-piperaquine in Agago; and 87 (82·1%; 73·2-88·6) of 106 for artemether-lumefantrine and 73 (92·4%; 83·6-96·9) of 79 for artesunate-pyronaridine in Arua. All regimens were well tolerated. The most common adverse events were upper respiratory tract infection, diarrhoea, and anaemia. None of the reported adverse events were attributed to the study drugs. There were two serious adverse events, both cases of severe malaria in Arua, one in each of the treatment groups. Parasite clearance half-lives were prolonged with parasites carrying the PfK13 Cys469Tyr (median 4·2 h; IQR 3·4-4·9) and Ala675Val (4·9 h; 3·4-5·7) mutations compared with wild-type parasites (2·8 h; 2·3-3·6; p<0·0001)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Artemether-lumefantrine was associated with a higher risk of recurrent malaria than other antimalarial combinations tested, and K13 mutations were associated with delayed parasite clearance. Changes in first-line therapy for uncomplicated malaria must be considered in response to suboptimal efficacy of artemether-lumefantrine."
        },
        {
          "label": "FUNDING",
          "text": "US President's Malaria Initiative, US Agency for International Development, through the Uganda Malaria Reduction Activity and the National Institutes of Health (AI075045 and AI117001)."
        },
        {
          "label": "TRANSLATION",
          "text": "For the Swahili translation of the abstract see Supplementary Materials section."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40845863/",
      "pubDate": "2025 Aug 19",
      "doi": "10.1016/S1473-3099(25)00407-4",
      "dateReceived": "2025-09-03T23:22:14.665Z",
      "isNew": false,
      "summary": "The study evaluated the efficacy of four artemisinin-based combination therapies in Ugandan children with uncomplicated malaria."
    },
    {
      "id": "d9a7268960a3",
      "title": "Survival After Initial Stress Testing vs Anatomic Testing in Suspected Coronary Artery Disease: Long-Term Follow-Up of the PROMISE Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48006546/117483",
      "abstract": "Symptoms suggestive of coronary artery disease (CAD) often require noninvasive testing for diagnostic and prognostic evaluation. To determine long-term outcomes in patients randomized to functional (stress) vs anatomic (coronary computed tomographic angiography [CTA]) initial testing. This study is a 2025 follow-up analysis of mortality of participants in the PROMISE (Prospective Multicenter Imaging Study for Evaluation of Chest Pain) randomized clinical trial, which was conducted from 2009 to 2014, using a 2024 National Death Index search. Median (IQR) follow-up duration was 10.6 (9.9-11.3) years; maximum follow-up was 12.4 years. PROMISE was conducted at 193 multispecialty outpatient sites in North America among 10 003 symptomatic patients requiring testing for suspected CAD. Data analysis was conducted from August 2024 to March 2025. Participants were randomized 1:1 to initial CTA or stress testing. Testing and subsequent care were performed by sites according to usual practices. The PROMISE trial's original primary end point was death, myocardial infarction, unstable angina hospitalization, or major procedural complication. The primary end point for extended follow-up was all-cause death, with cardiovascular (CV) death as a secondary end point. At enrollment, mean (SD) participant age was 61 (8) years, 5270 participants (52.7%) were women, and 8762 (87.6%) had chest pain or dyspnea. Death occurred in 1128 participants (14.4%), including 558 (14.3%) in the CTA arm and 570 (14.5%) in the stress arm (unadjusted hazard ratio [HR], 0.98; 95% CI, 0.87-1.10). There was no demonstrable difference in cardiovascular mortality, although the point estimate favored CTA (HR, 0.84; 95% CI, 0.67-1.05; adjusted HR, 0.89; 95% CI, 0.41-1.94). There were no significant interactions between all-cause death or CV death and study arm by age (<60 or ≥60 years) (P value for interaction = .19), gender (P value for interaction = .60), or race and ethnicity (P value for interaction = .47). A CTA indicating any degree of abnormality, including mild (nonobstructive CAD), moderate, and severe findings, conferred elevated adjusted HRs of death (1.99-3.44; all P < .001) compared to normal study results. Among stress testing results, only a severe abnormality was prognostically significant (HR, 1.45; 95% CI, 1.10-1.91). In landmark analyses of those alive at 90 days, there were no interactions between randomized testing and use of statins (P value for interaction = .22), β-blockers (P value for interaction = .76), or antiplatelet agents (P value for interaction = .49). In long-term follow-up of the PROMISE randomized clinical trial, initial noninvasive test selection in patients with stable symptoms of suspected CAD did not affect all-cause or CV mortality at 10 years. ClinicalTrials.gov Identifier: NCT01174550.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Symptoms suggestive of coronary artery disease (CAD) often require noninvasive testing for diagnostic and prognostic evaluation."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine long-term outcomes in patients randomized to functional (stress) vs anatomic (coronary computed tomographic angiography [CTA]) initial testing."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This study is a 2025 follow-up analysis of mortality of participants in the PROMISE (Prospective Multicenter Imaging Study for Evaluation of Chest Pain) randomized clinical trial, which was conducted from 2009 to 2014, using a 2024 National Death Index search. Median (IQR) follow-up duration was 10.6 (9.9-11.3) years; maximum follow-up was 12.4 years. PROMISE was conducted at 193 multispecialty outpatient sites in North America among 10 003 symptomatic patients requiring testing for suspected CAD. Data analysis was conducted from August 2024 to March 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Participants were randomized 1:1 to initial CTA or stress testing. Testing and subsequent care were performed by sites according to usual practices."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The PROMISE trial's original primary end point was death, myocardial infarction, unstable angina hospitalization, or major procedural complication. The primary end point for extended follow-up was all-cause death, with cardiovascular (CV) death as a secondary end point."
        },
        {
          "label": "RESULTS",
          "text": "At enrollment, mean (SD) participant age was 61 (8) years, 5270 participants (52.7%) were women, and 8762 (87.6%) had chest pain or dyspnea. Death occurred in 1128 participants (14.4%), including 558 (14.3%) in the CTA arm and 570 (14.5%) in the stress arm (unadjusted hazard ratio [HR], 0.98; 95% CI, 0.87-1.10). There was no demonstrable difference in cardiovascular mortality, although the point estimate favored CTA (HR, 0.84; 95% CI, 0.67-1.05; adjusted HR, 0.89; 95% CI, 0.41-1.94). There were no significant interactions between all-cause death or CV death and study arm by age (<60 or ≥60 years) (P value for interaction = .19), gender (P value for interaction = .60), or race and ethnicity (P value for interaction = .47). A CTA indicating any degree of abnormality, including mild (nonobstructive CAD), moderate, and severe findings, conferred elevated adjusted HRs of death (1.99-3.44; all P < .001) compared to normal study results. Among stress testing results, only a severe abnormality was prognostically significant (HR, 1.45; 95% CI, 1.10-1.91). In landmark analyses of those alive at 90 days, there were no interactions between randomized testing and use of statins (P value for interaction = .22), β-blockers (P value for interaction = .76), or antiplatelet agents (P value for interaction = .49)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In long-term follow-up of the PROMISE randomized clinical trial, initial noninvasive test selection in patients with stable symptoms of suspected CAD did not affect all-cause or CV mortality at 10 years."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT01174550."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40864459/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1001/jamacardio.2025.2882",
      "dateReceived": "2025-09-03T23:22:14.665Z",
      "isNew": false,
      "summary": "In patients with stable chest pain suggestive of coronary artery disease, the initial noninvasive test chosen did not impact overall or cardiovascular-related death rates after a decade."
    },
    {
      "id": "510f88ee0506",
      "title": "Major Bleeding Risk During Concomitant Use of Antiarrhythmic Drugs and Oral Factor Xa Inhibitors: A Nationwide Self-Controlled Case Series Study.",
      "journal": "Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48006546/117454",
      "abstract": "Bleeding risk may increase when Factor Xa (FXa) inhibitors are co-administered with antiarrhythmic drugs (AADs) due to pharmacokinetic interactions, but real-world evidence on these interactions is inconsistent and limited, particularly for edoxaban. The aim of this study is to evaluate the overall and temporal risk of major bleeding associated with concomitant use of AADs (amiodarone, dronedarone, diltiazem, verapamil) and FXa inhibitors (apixaban, edoxaban, rivaroxaban) using the self-controlled case series (SCCS) method. A SCCS study was conducted using the Korean National Health Insurance Service database. Patients who initiated FXa inhibitors between July 2018 and December 2020, had AAD co-administration, and experienced major bleeding were included. Incidence rate ratios (IRRs) for major bleeding were estimated using conditional Poisson regression, adjusting for time-varying covariates. A total of 963 patients were analyzed. Concomitant use of amiodarone (IRR 2.16; 95% CI 1.73-2.70), diltiazem (IRR 1.96; 95% CI 1.63-2.35), and verapamil (IRR 1.72; 95% CI 1.15-2.59) was associated with an increased risk for major bleeding risk, while dronedarone did not (IRR 1.20; 95% CI 0.69-2.06). The findings were consistent across different FXa inhibitors. Bleeding risk was highest during the first month of co-administration and decreased over time, remaining significant beyond three months for amiodarone. Concomitant use of FXa inhibitors with amiodarone, diltiazem, or verapamil was related to an increased incidence of major bleeding, particularly during the first month of co-administration. Close monitoring during this period may be warranted for patients at high risk of bleeding.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Bleeding risk may increase when Factor Xa (FXa) inhibitors are co-administered with antiarrhythmic drugs (AADs) due to pharmacokinetic interactions, but real-world evidence on these interactions is inconsistent and limited, particularly for edoxaban."
        },
        {
          "label": "OBJECTIVE",
          "text": "The aim of this study is to evaluate the overall and temporal risk of major bleeding associated with concomitant use of AADs (amiodarone, dronedarone, diltiazem, verapamil) and FXa inhibitors (apixaban, edoxaban, rivaroxaban) using the self-controlled case series (SCCS) method."
        },
        {
          "label": "METHODS",
          "text": "A SCCS study was conducted using the Korean National Health Insurance Service database. Patients who initiated FXa inhibitors between July 2018 and December 2020, had AAD co-administration, and experienced major bleeding were included. Incidence rate ratios (IRRs) for major bleeding were estimated using conditional Poisson regression, adjusting for time-varying covariates."
        },
        {
          "label": "RESULTS",
          "text": "A total of 963 patients were analyzed. Concomitant use of amiodarone (IRR 2.16; 95% CI 1.73-2.70), diltiazem (IRR 1.96; 95% CI 1.63-2.35), and verapamil (IRR 1.72; 95% CI 1.15-2.59) was associated with an increased risk for major bleeding risk, while dronedarone did not (IRR 1.20; 95% CI 0.69-2.06). The findings were consistent across different FXa inhibitors. Bleeding risk was highest during the first month of co-administration and decreased over time, remaining significant beyond three months for amiodarone."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Concomitant use of FXa inhibitors with amiodarone, diltiazem, or verapamil was related to an increased incidence of major bleeding, particularly during the first month of co-administration. Close monitoring during this period may be warranted for patients at high risk of bleeding."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40789318/",
      "pubDate": "2025 Aug 11",
      "doi": "10.1055/a-2679-6101",
      "dateReceived": "2025-09-03T23:22:14.665Z",
      "isNew": false,
      "summary": "Combining FXa inhibitors with amiodarone, diltiazem, or verapamil increases the risk of major bleeding, especially in the first month of concurrent use, warranting close monitoring for high-risk patients."
    },
    {
      "id": "4d4fac2d86b9",
      "title": "Once-weekly semaglutide 2.4 mg in an Asian population with obesity, defined as BMI >/=25 kg/m(2), in South Korea and Thailand (STEP 11): a randomised, double-blind, placebo-controlled, phase 3 trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48006546/117445",
      "dateReceived": "2025-09-03T23:22:14.665Z",
      "isNew": false
    },
    {
      "id": "3203493bafcb",
      "title": "Safety and efficacy of steroidal mineralocorticoid receptor antagonists in patients with kidney failure requiring dialysis: a systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48006546/117440",
      "abstract": "Mineralocorticoid receptor antagonists can prevent cardiovascular events in patients with heart failure and non-severe chronic kidney disease, but their effects in patients with kidney failure requiring dialysis are uncertain. We aimed to assess the efficacy and safety of mineralocorticoid receptor antagonists in this patient population. In this systematic review and meta-analysis, we updated our previous systematic review by searching MEDLINE, Embase, Cochrane Central Register of Controlled Trials, and the Cumulative Index to Nursing and Allied Health Literature for randomised controlled trials published between database inception and March 18, 2025. Trials comparing a mineralocorticoid receptor antagonist with placebo or standard of care in adults (aged ≥18 years) receiving maintenance dialysis were eligible. Studies that did not report an outcome of interest (cardiovascular mortality, heart failure hospitalisation, all-cause mortality, all-cause hospitalisation, hyperkalaemia, gynaecomastia or breast pain, or hypotension) were excluded. Two reviewers independently identified studies, extracted data, and assessed the risk of bias using the Cochrane risk-of-bias tool. The main outcome was cardiovascular mortality assessed using the empirical Bayes random-effects models, stratified by risk-of-bias. The protocol is registered with PROSPERO (CRD420251008119). 19 trials of steroidal mineralocorticoid receptor antagonists including 4675 participants met eligibility criteria. Effect estimates differed trials with low and high risk of bias. In four trials with a low risk of bias (n=3562), 264 cardiovascular deaths occurred in 1785 patients in the mineralocorticoid receptor antagonist group compared with 276 of 1777 patients in the control group (odds ratio 0·98 [95% CI 0·80-1·20]; I=0·0%; τ=0·0; moderate certainty) resulting in an absolute risk reduction of 1 fewer event per 1000 patients per year (95% CI 14 fewer to 11 more). Our findings suggest that steroidal mineralocorticoid receptor antagonists have little to no effect on cardiovascular mortality in patients requiring dialysis. There is insufficient information on the effects of steroidal mineralocorticoid receptor antagonists in subgroups of patients requiring dialysis and no information on non-steroidal mineralocorticoid receptor antagonists. Future trials would need to consider the likelihood of only smaller effects or effects limited to patients or events with pathophysiology that is more clearly driven by aldosterone in their design. None.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Mineralocorticoid receptor antagonists can prevent cardiovascular events in patients with heart failure and non-severe chronic kidney disease, but their effects in patients with kidney failure requiring dialysis are uncertain. We aimed to assess the efficacy and safety of mineralocorticoid receptor antagonists in this patient population."
        },
        {
          "label": "METHODS",
          "text": "In this systematic review and meta-analysis, we updated our previous systematic review by searching MEDLINE, Embase, Cochrane Central Register of Controlled Trials, and the Cumulative Index to Nursing and Allied Health Literature for randomised controlled trials published between database inception and March 18, 2025. Trials comparing a mineralocorticoid receptor antagonist with placebo or standard of care in adults (aged ≥18 years) receiving maintenance dialysis were eligible. Studies that did not report an outcome of interest (cardiovascular mortality, heart failure hospitalisation, all-cause mortality, all-cause hospitalisation, hyperkalaemia, gynaecomastia or breast pain, or hypotension) were excluded. Two reviewers independently identified studies, extracted data, and assessed the risk of bias using the Cochrane risk-of-bias tool. The main outcome was cardiovascular mortality assessed using the empirical Bayes random-effects models, stratified by risk-of-bias. The protocol is registered with PROSPERO (CRD420251008119)."
        },
        {
          "label": "FINDINGS",
          "text": "19 trials of steroidal mineralocorticoid receptor antagonists including 4675 participants met eligibility criteria. Effect estimates differed trials with low and high risk of bias. In four trials with a low risk of bias (n=3562), 264 cardiovascular deaths occurred in 1785 patients in the mineralocorticoid receptor antagonist group compared with 276 of 1777 patients in the control group (odds ratio 0·98 [95% CI 0·80-1·20]; I=0·0%; τ=0·0; moderate certainty) resulting in an absolute risk reduction of 1 fewer event per 1000 patients per year (95% CI 14 fewer to 11 more)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Our findings suggest that steroidal mineralocorticoid receptor antagonists have little to no effect on cardiovascular mortality in patients requiring dialysis. There is insufficient information on the effects of steroidal mineralocorticoid receptor antagonists in subgroups of patients requiring dialysis and no information on non-steroidal mineralocorticoid receptor antagonists. Future trials would need to consider the likelihood of only smaller effects or effects limited to patients or events with pathophysiology that is more clearly driven by aldosterone in their design."
        },
        {
          "label": "FUNDING",
          "text": "None."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40840478/",
      "pubDate": "2025 Aug 23",
      "doi": "10.1016/S0140-6736(25)01153-5",
      "dateReceived": "2025-09-03T23:22:14.665Z",
      "isNew": false,
      "summary": "In patients with kidney failure requiring dialysis, mineralocorticoid receptor antagonists did not significantly reduce cardiovascular mortality."
    },
    {
      "id": "c5e72bcf3715",
      "title": "Prophylactic Antibiotics for Upper Gastrointestinal Bleeding in Patients With Cirrhosis: A Systematic Review and Bayesian Meta-Analysis.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48006546/117405",
      "abstract": "International guidelines recommend 5 to 7 days of antibiotic prophylaxis for patients with cirrhosis and upper gastrointestinal bleeding. However, the evidence for this recommendation has not been reassessed recently. To determine whether current evidence continues to support the recommended 5 to 7 days of antibiotic prophylaxis in patients with cirrhosis and upper gastrointestinal bleeding. Searches were performed of the Embase, MEDLINE, and CENTRAL databases for randomized clinical trials (RCTs) from inception to September 25, 2024. The search query included the keywords gastrointestinal bleeding and prophylactic antibiotics. Included RCTs compared longer durations of antibiotic prophylaxis to shorter durations (or 0 days) in patients with cirrhosis and upper gastrointestinal bleeding. Observational and pediatric studies, gray literature, comparisons of systemic antibiotics, studies not reporting mortality or early rebleed, and studies of nonsystemic antibiotics were excluded. Data were extracted in duplicate by independent reviewers. Study quality was assessed in duplicate using the Cochrane Risk of Bias 2 tool. Data were pooled by random-effects bayesian meta-analyses using a noninformative prior for the effect and a weakly informative prior for heterogeneity. To account for therapeutic advancements, a post hoc subgroup analysis was performed for studies published after 2004. The primary outcome was all-cause mortality with a prespecified 5% noninferiority margin on the risk difference (RD) scale. Early rebleed and bacterial infections were secondary outcomes. The analysis included 14 RCTs totaling 1322 participants (mean age range, 41.5 to 62.0 years; 981 male [74.2%] individuals), of whom 1202 (90.9%) had a variceal source of bleeding. Study quality was low to moderate, bacterial infections were heterogeneously defined, and no studies reported adverse events. Two RCTs compared longer (5-7 days) to shorter (2-3 days) durations and 12 RCTs compared any prophylaxis (1-10 days) to none. Shorter durations (including none) had a 97.3% probability of noninferiority for all-cause mortality (RD, 0.9%; 95% credible interval [95% CrI],  -2.6 to 4.9). Shorter durations had a 73.8% probability of noninferiority for early rebleeding (RD, 2.9%; 95% CrI, -4.2 to 10.0) but were associated with more study-defined bacterial infections (RD, 15.2%; 95% CrI, 5.0 to 25.9). The probabilities of noninferiority of shorter durations for all 3 outcomes were higher in studies published after 2004. The findings of this systematic review and bayesian meta-analysis do not support the purported mortality benefit driving guideline recommendations for antibiotic prophylaxis in patients with cirrhosis and upper gastrointestinal bleeds. Although prophylaxis reduced reported infections, methodological concerns regarding infection definitions introduced high risk of bias. Higher-quality RCTs are needed to determine the benefit and optimal duration of antibiotic prophylaxis in the modern era of advanced interventions. Until these studies are available, clinicians should be aware that the current guideline recommendations are not based on high-quality evidence.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "International guidelines recommend 5 to 7 days of antibiotic prophylaxis for patients with cirrhosis and upper gastrointestinal bleeding. However, the evidence for this recommendation has not been reassessed recently."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether current evidence continues to support the recommended 5 to 7 days of antibiotic prophylaxis in patients with cirrhosis and upper gastrointestinal bleeding."
        },
        {
          "label": "DATA SOURCES",
          "text": "Searches were performed of the Embase, MEDLINE, and CENTRAL databases for randomized clinical trials (RCTs) from inception to September 25, 2024. The search query included the keywords gastrointestinal bleeding and prophylactic antibiotics."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Included RCTs compared longer durations of antibiotic prophylaxis to shorter durations (or 0 days) in patients with cirrhosis and upper gastrointestinal bleeding. Observational and pediatric studies, gray literature, comparisons of systemic antibiotics, studies not reporting mortality or early rebleed, and studies of nonsystemic antibiotics were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Data were extracted in duplicate by independent reviewers. Study quality was assessed in duplicate using the Cochrane Risk of Bias 2 tool. Data were pooled by random-effects bayesian meta-analyses using a noninformative prior for the effect and a weakly informative prior for heterogeneity. To account for therapeutic advancements, a post hoc subgroup analysis was performed for studies published after 2004."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was all-cause mortality with a prespecified 5% noninferiority margin on the risk difference (RD) scale. Early rebleed and bacterial infections were secondary outcomes."
        },
        {
          "label": "RESULTS",
          "text": "The analysis included 14 RCTs totaling 1322 participants (mean age range, 41.5 to 62.0 years; 981 male [74.2%] individuals), of whom 1202 (90.9%) had a variceal source of bleeding. Study quality was low to moderate, bacterial infections were heterogeneously defined, and no studies reported adverse events. Two RCTs compared longer (5-7 days) to shorter (2-3 days) durations and 12 RCTs compared any prophylaxis (1-10 days) to none. Shorter durations (including none) had a 97.3% probability of noninferiority for all-cause mortality (RD, 0.9%; 95% credible interval [95% CrI],  -2.6 to 4.9). Shorter durations had a 73.8% probability of noninferiority for early rebleeding (RD, 2.9%; 95% CrI, -4.2 to 10.0) but were associated with more study-defined bacterial infections (RD, 15.2%; 95% CrI, 5.0 to 25.9). The probabilities of noninferiority of shorter durations for all 3 outcomes were higher in studies published after 2004."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "The findings of this systematic review and bayesian meta-analysis do not support the purported mortality benefit driving guideline recommendations for antibiotic prophylaxis in patients with cirrhosis and upper gastrointestinal bleeds. Although prophylaxis reduced reported infections, methodological concerns regarding infection definitions introduced high risk of bias. Higher-quality RCTs are needed to determine the benefit and optimal duration of antibiotic prophylaxis in the modern era of advanced interventions. Until these studies are available, clinicians should be aware that the current guideline recommendations are not based on high-quality evidence."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40788637/",
      "pubDate": "2025 Aug 11",
      "doi": "10.1001/jamainternmed.2025.3832",
      "dateReceived": "2025-09-03T23:22:14.665Z",
      "isNew": false,
      "summary": "Antibiotic prophylaxis in cirrhotic patients with upper gastrointestinal bleeds may reduce infections but lacks sufficient evidence to support a mortality benefit, and current guidelines are not based on high-quality evidence."
    },
    {
      "id": "62d96e0fdbe5",
      "title": "Adding Clip Before Endoscopic Cyanoacrylate Injection Decreases Ectopic Embolisms in Gastric Varices: A Randomized Controlled Trial.",
      "journal": "Am J Gastroenterol",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47989928/117365",
      "abstract": "Ectopic embolism caused by cyanoacrylate migration is a severe complication. We aimed to test the hypothesis that prior clipping can reduce ectopic embolism secondary to endoscopic cyanoacrylate injection (ECI) in gastric varices with a gastrorenal shunt. In this multicenter, open-label, parallel, randomized controlled trial, patients with fundal gastric varices and gastrorenal shunts from 10 tertiary hospitals were randomly assigned to clip-assisted ECI (Clip-ECI, n = 35) and conventional ECI groups (Con-ECI, n = 35). The primary outcome was the occurrence of ectopic embolism. Computed tomography was performed within 48 hours of the initial injection to screen for cyanoacrylate (marked with lipiodol) migration. The technical success rate was 100% in both groups. The Clip-ECI group had a significantly lower incidence of cyanoacrylate embolism than the Con-ECI group (11.4% vs 42.9%, P = 0.003). Symptomatic pulmonary embolism occurred in 4 patients in the Con-ECI group, of which 1 patient died. By contrast, no symptomatic embolism event was observed in the Clip-ECI group (11.4% vs 0%, P = 0.114). No clip-related bleeding was reported. No significant differences were observed in the total rebleeding rate (14.3% vs 14.3%) and survival rate (97.1% vs 93.9%) between the Clip-ECI and Con-ECI groups during a median follow-up of 10.1 (interquartile range 7.7-12.9) and 9.9 (interquartile range 6.3-12.6) months, respectively. Clipping before ECI reduces the risk of ectopic embolism in patients with fundal varices with a portal-systemic shunt, without compromising safety or efficacy.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Ectopic embolism caused by cyanoacrylate migration is a severe complication. We aimed to test the hypothesis that prior clipping can reduce ectopic embolism secondary to endoscopic cyanoacrylate injection (ECI) in gastric varices with a gastrorenal shunt."
        },
        {
          "label": "METHODS",
          "text": "In this multicenter, open-label, parallel, randomized controlled trial, patients with fundal gastric varices and gastrorenal shunts from 10 tertiary hospitals were randomly assigned to clip-assisted ECI (Clip-ECI, n = 35) and conventional ECI groups (Con-ECI, n = 35). The primary outcome was the occurrence of ectopic embolism. Computed tomography was performed within 48 hours of the initial injection to screen for cyanoacrylate (marked with lipiodol) migration."
        },
        {
          "label": "RESULTS",
          "text": "The technical success rate was 100% in both groups. The Clip-ECI group had a significantly lower incidence of cyanoacrylate embolism than the Con-ECI group (11.4% vs 42.9%, P = 0.003). Symptomatic pulmonary embolism occurred in 4 patients in the Con-ECI group, of which 1 patient died. By contrast, no symptomatic embolism event was observed in the Clip-ECI group (11.4% vs 0%, P = 0.114). No clip-related bleeding was reported. No significant differences were observed in the total rebleeding rate (14.3% vs 14.3%) and survival rate (97.1% vs 93.9%) between the Clip-ECI and Con-ECI groups during a median follow-up of 10.1 (interquartile range 7.7-12.9) and 9.9 (interquartile range 6.3-12.6) months, respectively."
        },
        {
          "label": "DISCUSSION",
          "text": "Clipping before ECI reduces the risk of ectopic embolism in patients with fundal varices with a portal-systemic shunt, without compromising safety or efficacy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40600964/",
      "pubDate": "2025 Jul 02",
      "doi": "10.14309/ajg.0000000000003629",
      "dateReceived": "2025-09-02T23:21:18.448Z",
      "isNew": false,
      "summary": "Clipping before endoscopic cyanoacrylate injection significantly reduces the incidence of ectopic embolism in patients with fundal varices and a gastrorenal shunt."
    },
    {
      "id": "40266ed85f11",
      "title": "Red Cell Transfusion in Acute Myocardial Infarction: AABB International Clinical Practice Guidelines.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine",
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117430",
      "abstract": "Optimal transfusion strategies for patients with acute myocardial infarction (AMI) are uncertain. The aim of this guideline is to provide recommendations for red blood cell transfusion in patients with AMI. These guidelines are based on evidence from randomized controlled trials of patients presenting with AMI and assigned to 2 different transfusion strategies (restrictive or liberal) based on hemoglobin concentrations or hematocrit levels before receipt of a transfusion. A meta-analysis of eligible trials was performed using Cochrane methods. The international panel followed GRADE (Grading of Recommendations Assessment, Development and Evaluation) methods to summarize evidence and formulate recommendations. This guideline's primary perspective is that of the patient, including medical, financial, and psychological effects, with secondary consideration of health care system issues, particularly conservation of the limited and costly blood supply. For hospitalized patients with AMI, the panel suggests a liberal red cell transfusion strategy when the hemoglobin concentration is less than 10 g/dL (conditional recommendation, low-certainty evidence). A restrictive strategy of 7 to 8 g/dL may result in increased mortality in patients with AMI. The direction of the recommendation for the liberal strategy was based on the great importance of mortality for patients. The conditional recommendation was based on the low certainty of evidence and the competing consideration of blood supply conservation. Clinicians should adopt mitigation strategies to reduce potential adverse events associated with a liberal transfusion strategy, and all transfusion decisions should incorporate the clinical context rather than solely the hemoglobin concentration.",
      "structuredAbstract": [
        {
          "label": "DESCRIPTION",
          "text": "Optimal transfusion strategies for patients with acute myocardial infarction (AMI) are uncertain. The aim of this guideline is to provide recommendations for red blood cell transfusion in patients with AMI."
        },
        {
          "label": "METHODS",
          "text": "These guidelines are based on evidence from randomized controlled trials of patients presenting with AMI and assigned to 2 different transfusion strategies (restrictive or liberal) based on hemoglobin concentrations or hematocrit levels before receipt of a transfusion. A meta-analysis of eligible trials was performed using Cochrane methods. The international panel followed GRADE (Grading of Recommendations Assessment, Development and Evaluation) methods to summarize evidence and formulate recommendations. This guideline's primary perspective is that of the patient, including medical, financial, and psychological effects, with secondary consideration of health care system issues, particularly conservation of the limited and costly blood supply."
        },
        {
          "label": "RECOMMENDATION",
          "text": "For hospitalized patients with AMI, the panel suggests a liberal red cell transfusion strategy when the hemoglobin concentration is less than 10 g/dL (conditional recommendation, low-certainty evidence). A restrictive strategy of 7 to 8 g/dL may result in increased mortality in patients with AMI. The direction of the recommendation for the liberal strategy was based on the great importance of mortality for patients. The conditional recommendation was based on the low certainty of evidence and the competing consideration of blood supply conservation. Clinicians should adopt mitigation strategies to reduce potential adverse events associated with a liberal transfusion strategy, and all transfusion decisions should incorporate the clinical context rather than solely the hemoglobin concentration."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40825204/",
      "pubDate": "2025 Aug 19",
      "doi": "10.7326/ANNALS-25-00706",
      "dateReceived": "2025-09-01T23:27:12.110Z",
      "isNew": false,
      "summary": "For patients hospitalized with acute myocardial infarction, a liberal red blood cell transfusion strategy (hemoglobin <10 g/dL) is suggested, as a restrictive strategy may increase mortality, though this recommendation is based on low-certainty evidence."
    },
    {
      "id": "78dc49ace746",
      "title": "Withdrawal of heart failure therapy after atrial fibrillation rhythm control with ejection fraction normalization: the WITHDRAW-AF trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117426",
      "dateReceived": "2025-09-01T23:27:12.110Z",
      "isNew": false
    },
    {
      "id": "a400ae1a60bc",
      "title": "Sex Differences in Safety and Efficacy of Dual Antiplatelet Therapy Strategies for Patients With Acute Coronary Syndromes: A Systematic Review and Meta-analysis of Randomized Controlled Trials.",
      "journal": "Am J Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117388",
      "abstract": "Sex-specific evidence on de-escalation strategies of dual antiplatelet therapy (DAPT) after percutaneous coronary intervention in patients with acute coronary syndromes (ACS) remains limited. Females are often under-represented in randomized controlled trials (RCTs) and sex-based subgroup analysis in RCTs yield conflicting results. We searched PubMed and EMBASE in September 2024 for RCTs that investigated DAPT strategies for patients with ACS. We examined whether there are differences in the efficacy and safety of de-escalation strategies (i.e., short-term DAPT (≤6 months), unguided de-escalation, and guided de-escalation with genotype or platelet function tests) compared to standard DAPT (12 months) between sexes. A systematic review and meta-analysis were performed to compare the efficacy and safety between sexes with p-value for test of moderators. The primary efficacy outcome was major adverse cardiovascular events (MACEs), defined as a composite of cardiovascular death, myocardial infarction, and stroke. The primary safety outcome was major or minor bleeding. Fourteen RCTs involving 35,901 patients with ACS (7,652 female patients, 28,249 male patients) were included. The effect of de-escalation strategies on the primary efficacy outcome was significantly different between female (HR, 0.74; 95% CI, 0.57-0.95; I = 0%) and male patients (HR, 1.04; 95% CI, 0.90-1.19; I = 15%), with p-value for test of moderators 0.019. The primary safety outcome showed no significant sex differences (p-value for test of moderators = 0.67). In conclusions, in patients with ACS, compared to standard DAPT, de-escalation strategies were more effective in reducing MACE in female than in their male counterparts. Meanwhile, de-escalation strategies were similarly safer for both sexes.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40691919/",
      "pubDate": "2025 Jul 20",
      "doi": "10.1016/j.amjcard.2025.07.020",
      "dateReceived": "2025-09-01T23:27:12.110Z",
      "isNew": false,
      "summary": "In acute coronary syndrome patients, de-escalation strategies of dual antiplatelet therapy were more effective in reducing major adverse cardiovascular events in females compared to males, with similar safety profiles for both sexes."
    },
    {
      "id": "44569e9c87c9",
      "title": "The Effect of Animated Educational Video to Reduce Anxiety Levels Before Outpatient Medical Abortion: A Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47897375/117318",
      "abstract": "To determine the efficacy of an animated educational video combined with traditional counselling to reduce anxiety levels among pregnant women seeking outpatient medical abortion. Randomised controlled trial with two parallel groups. Single centre in Bangkok, Thailand. 60 pregnant women seeking outpatient medical abortion. Participants received either an animated educational video combined with traditional counselling (n = 30) or traditional counselling alone (n = 30). Postintervention anxiety levels were assessed by the Spielberger State-Trait Anxiety Inventory (STAI), and satisfaction levels were measured by a 5-point Likert-type scale. There were no significant differences in demographic characteristics between groups. The postintervention STAI scores were significantly lower in the video group compared to the non-video group (32.70 ± 4.96 vs. 41.47 ± 8.57, p < 0.01). The odds of moderate to severe anxiety were significantly lower in the video group (OR 10.29, 95% CI 2.56-41.37). Patient satisfaction levels were similarly high in both groups (4.92 ± 0.27 vs. 4.85 ± 0.36, p = 0.42). Incorporating an animated educational video into traditional counselling effectively reduced anxiety in pregnant women seeking outpatient medical abortion while maintaining high levels of satisfaction with the medical service provided.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To determine the efficacy of an animated educational video combined with traditional counselling to reduce anxiety levels among pregnant women seeking outpatient medical abortion."
        },
        {
          "label": "DESIGN",
          "text": "Randomised controlled trial with two parallel groups."
        },
        {
          "label": "SETTING",
          "text": "Single centre in Bangkok, Thailand."
        },
        {
          "label": "POPULATION OR SAMPLE",
          "text": "60 pregnant women seeking outpatient medical abortion."
        },
        {
          "label": "METHODS",
          "text": "Participants received either an animated educational video combined with traditional counselling (n = 30) or traditional counselling alone (n = 30)."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Postintervention anxiety levels were assessed by the Spielberger State-Trait Anxiety Inventory (STAI), and satisfaction levels were measured by a 5-point Likert-type scale."
        },
        {
          "label": "RESULTS",
          "text": "There were no significant differences in demographic characteristics between groups. The postintervention STAI scores were significantly lower in the video group compared to the non-video group (32.70 ± 4.96 vs. 41.47 ± 8.57, p < 0.01). The odds of moderate to severe anxiety were significantly lower in the video group (OR 10.29, 95% CI 2.56-41.37). Patient satisfaction levels were similarly high in both groups (4.92 ± 0.27 vs. 4.85 ± 0.36, p = 0.42)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Incorporating an animated educational video into traditional counselling effectively reduced anxiety in pregnant women seeking outpatient medical abortion while maintaining high levels of satisfaction with the medical service provided."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40755262/",
      "pubDate": "2025 Aug 04",
      "doi": "10.1111/1471-0528.18321",
      "dateReceived": "2025-09-01T23:27:12.110Z",
      "isNew": false,
      "summary": "An animated educational video integrated into counseling for outpatient medical abortion successfully decreased anxiety in pregnant women without impacting their satisfaction with the service."
    }
  ]
}