{
  "updated_at": "2025-08-23T10:07:00.969Z",
  "articles": [
    {
      "id": "7ecd79218828",
      "title": "Ciprofloxacin versus Aminoglycoside-Ciprofloxacin for Bubonic Plague.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117291",
      "abstract": "Plague is a high-consequence infectious disease with epidemic potential. Current treatment guidelines are based on weak evidence. We enrolled persons (excluding pregnant persons) in Madagascar who had clinically suspected bubonic plague during 2020-2024. Using an open-label noninferiority design, we compared two treatments included in the national plague guidelines: oral ciprofloxacin for 10 days (ciprofloxacin monotherapy) or injectable aminoglycoside for 3 days followed by oral ciprofloxacin for 7 days (aminoglycoside-ciprofloxacin). The primary end point was treatment failure on day 11, with treatment failure defined as death, fever, secondary pneumonic plague, or alternative or prolonged plague treatment. To show noninferiority of ciprofloxacin monotherapy among patients with laboratory-confirmed or probable infections, the upper boundary of the 95% confidence interval around the risk difference had to be less than 15 percentage points. A total of 933 patients underwent screening; 450 patients with suspected bubonic plague were enrolled and underwent randomization. A total of 220 patients (110 per group) had confirmed infection, and 2 (1 per group) had probable infection. Of the patients who underwent randomization, 53.2% were male, and the median age was 14 years (range, 2 to 72). Ciprofloxacin monotherapy was noninferior to aminoglycoside-ciprofloxacin therapy: among the patients with confirmed or probable infection, treatment failure occurred in 9.0% (10 of 111 patients) in the ciprofloxacin monotherapy group and 8.1% (9 of 111 patients) in the aminoglycoside-ciprofloxacin group (difference, 0.9 percentage points; 95% confidence interval, -6.0 to 7.8). Noninferiority was consistent in other prespecified analysis populations. A total of 5 patients in the ciprofloxacin monotherapy group and 4 patients in the aminoglycoside-ciprofloxacin group died, and secondary pneumonic plague developed in 3 patients in each group. The incidence of adverse events among patients with confirmed or probable infections was similar in the two groups - 18.0% in the ciprofloxacin monotherapy group and 18.9% in the aminoglycoside-ciprofloxacin group had adverse events, and 7.2% and 5.4%, respectively, had serious adverse events. Oral ciprofloxacin monotherapy for 10 days was noninferior to an aminoglycoside-ciprofloxacin sequential combination for the treatment of patients with bubonic plague. (Funded by the U.K. Foreign, Commonwealth, and Development Office and Wellcome; IMASOY ClinicalTrials.gov number, NCT04110340.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Plague is a high-consequence infectious disease with epidemic potential. Current treatment guidelines are based on weak evidence."
        },
        {
          "label": "METHODS",
          "text": "We enrolled persons (excluding pregnant persons) in Madagascar who had clinically suspected bubonic plague during 2020-2024. Using an open-label noninferiority design, we compared two treatments included in the national plague guidelines: oral ciprofloxacin for 10 days (ciprofloxacin monotherapy) or injectable aminoglycoside for 3 days followed by oral ciprofloxacin for 7 days (aminoglycoside-ciprofloxacin). The primary end point was treatment failure on day 11, with treatment failure defined as death, fever, secondary pneumonic plague, or alternative or prolonged plague treatment. To show noninferiority of ciprofloxacin monotherapy among patients with laboratory-confirmed or probable infections, the upper boundary of the 95% confidence interval around the risk difference had to be less than 15 percentage points."
        },
        {
          "label": "RESULTS",
          "text": "A total of 933 patients underwent screening; 450 patients with suspected bubonic plague were enrolled and underwent randomization. A total of 220 patients (110 per group) had confirmed infection, and 2 (1 per group) had probable infection. Of the patients who underwent randomization, 53.2% were male, and the median age was 14 years (range, 2 to 72). Ciprofloxacin monotherapy was noninferior to aminoglycoside-ciprofloxacin therapy: among the patients with confirmed or probable infection, treatment failure occurred in 9.0% (10 of 111 patients) in the ciprofloxacin monotherapy group and 8.1% (9 of 111 patients) in the aminoglycoside-ciprofloxacin group (difference, 0.9 percentage points; 95% confidence interval, -6.0 to 7.8). Noninferiority was consistent in other prespecified analysis populations. A total of 5 patients in the ciprofloxacin monotherapy group and 4 patients in the aminoglycoside-ciprofloxacin group died, and secondary pneumonic plague developed in 3 patients in each group. The incidence of adverse events among patients with confirmed or probable infections was similar in the two groups - 18.0% in the ciprofloxacin monotherapy group and 18.9% in the aminoglycoside-ciprofloxacin group had adverse events, and 7.2% and 5.4%, respectively, had serious adverse events."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Oral ciprofloxacin monotherapy for 10 days was noninferior to an aminoglycoside-ciprofloxacin sequential combination for the treatment of patients with bubonic plague. (Funded by the U.K. Foreign, Commonwealth, and Development Office and Wellcome; IMASOY ClinicalTrials.gov number, NCT04110340.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40768716/",
      "pubDate": "2025 Aug 07",
      "doi": "10.1056/NEJMoa2413772",
      "dateReceived": "2025-08-23T10:06:47.057Z",
      "isNew": true,
      "summary": "Oral ciprofloxacin alone is as effective as a combination of aminoglycoside and ciprofloxacin for treating bubonic plague."
    },
    {
      "id": "fbc48a39864d",
      "title": "Alteplase for Acute Ischemic Stroke at 4.5 to 24 Hours: The HOPE Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117310",
      "abstract": "The safety and efficacy of intravenous thrombolytics beyond 4.5 hours after ischemic stroke onset remain inadequately studied. To evaluate the safety and efficacy of intravenous alteplase administered 4.5 to 24 hours after stroke onset in patients with salvageable brain tissue, regardless of the presence of large vessel occlusion. This randomized, open-label, blinded end-point trial was conducted at 26 stroke centers across China. A total of 372 patients with acute ischemic stroke and salvageable brain tissue identified by perfusion imaging were enrolled between June 21, 2021, and June 30, 2024 (final follow-up October 2, 2024). Eligibility criteria included stroke onset (or the midpoint between last known well and symptom recognition if onset was unknown) of 4.5 to 24 hours prior to presentation, and no initial plan for endovascular thrombectomy. Data were analyzed from December 2024 to February 2025. Patients were randomly assigned (1:1) using a minimization algorithm to receive intravenous alteplase (0.9 mg/kg; maximum dose, 90 mg; n = 186) or standard medical treatment (n = 186). The primary efficacy outcome was functional independence, defined as a modified Rankin Scale score of 0 to 1 at 90 days. Safety outcomes included symptomatic intracranial hemorrhage within 36 hours and all-cause mortality within 90 days. Among 372 patients who were enrolled (median [IQR] age, 72 [64-80] years; 160 [43%] women), all completed the trial. The primary outcome occurred in 75 of 186 patients (40%) in the alteplase group and 49 of 186 (26%) in the control group (adjusted risk ratio, 1.52 [95% CI, 1.14-2.02]; P = .004; unadjusted risk difference, 13.98% [95% CI, 4.50%-23.45%]). The incidence of symptomatic intracranial hemorrhage was higher with alteplase at 3.8% compared with 0.51% with standard treatment (adjusted risk ratio, 7.34 [95% CI, 1.54-34.84]; P = .01; unadjusted risk difference, 3.23% [0.28%-6.19%]), and mortality was 11% in both groups (adjusted risk ratio, 0.91 [95% CI, 0.52-1.62]; P = .76; unadjusted risk difference, 0% [95% CI, -6.30% to 6.30%]). In patients with acute ischemic stroke with salvageable brain tissue identified by perfusion imaging who did not initially receive thrombectomy, intravenous alteplase administered 4.5 to 24 hours after onset provided functional benefit, despite an increase in symptomatic intracranial hemorrhage. ClinicalTrials.gov Identifier: NCT04879615.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The safety and efficacy of intravenous thrombolytics beyond 4.5 hours after ischemic stroke onset remain inadequately studied."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the safety and efficacy of intravenous alteplase administered 4.5 to 24 hours after stroke onset in patients with salvageable brain tissue, regardless of the presence of large vessel occlusion."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized, open-label, blinded end-point trial was conducted at 26 stroke centers across China. A total of 372 patients with acute ischemic stroke and salvageable brain tissue identified by perfusion imaging were enrolled between June 21, 2021, and June 30, 2024 (final follow-up October 2, 2024). Eligibility criteria included stroke onset (or the midpoint between last known well and symptom recognition if onset was unknown) of 4.5 to 24 hours prior to presentation, and no initial plan for endovascular thrombectomy. Data were analyzed from December 2024 to February 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomly assigned (1:1) using a minimization algorithm to receive intravenous alteplase (0.9 mg/kg; maximum dose, 90 mg; n = 186) or standard medical treatment (n = 186)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary efficacy outcome was functional independence, defined as a modified Rankin Scale score of 0 to 1 at 90 days. Safety outcomes included symptomatic intracranial hemorrhage within 36 hours and all-cause mortality within 90 days."
        },
        {
          "label": "RESULTS",
          "text": "Among 372 patients who were enrolled (median [IQR] age, 72 [64-80] years; 160 [43%] women), all completed the trial. The primary outcome occurred in 75 of 186 patients (40%) in the alteplase group and 49 of 186 (26%) in the control group (adjusted risk ratio, 1.52 [95% CI, 1.14-2.02]; P = .004; unadjusted risk difference, 13.98% [95% CI, 4.50%-23.45%]). The incidence of symptomatic intracranial hemorrhage was higher with alteplase at 3.8% compared with 0.51% with standard treatment (adjusted risk ratio, 7.34 [95% CI, 1.54-34.84]; P = .01; unadjusted risk difference, 3.23% [0.28%-6.19%]), and mortality was 11% in both groups (adjusted risk ratio, 0.91 [95% CI, 0.52-1.62]; P = .76; unadjusted risk difference, 0% [95% CI, -6.30% to 6.30%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In patients with acute ischemic stroke with salvageable brain tissue identified by perfusion imaging who did not initially receive thrombectomy, intravenous alteplase administered 4.5 to 24 hours after onset provided functional benefit, despite an increase in symptomatic intracranial hemorrhage."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04879615."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40773205/",
      "pubDate": "2025 Aug 07",
      "doi": "10.1001/jama.2025.12063",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "Intravenous alteplase administered 4.5 to 24 hours after stroke onset improved outcomes in acute ischemic stroke patients with salvageable brain tissue, but increased the risk of bleeding in the brain."
    },
    {
      "id": "e2690345c954",
      "title": "Efficacy and Safety of Pharmacologic Therapies for Nausea and Emesis in the Emergency Department: A Systematic Review and Bayesian Network Meta-analysis.",
      "journal": "Ann Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117300",
      "abstract": "We conducted a systematic review and Bayesian network meta-analysis to identify the most effective and safest therapies for nausea/emesis in adult patients presenting to the emergency department (ED). We searched PubMed, Embase, Cumulated Index to Nursing and Allied Health Literature, and Web of Science from inception to November 22, 2023. Eligible studies were randomized controlled trials in adult participants presenting to ED with nausea or emesis and compared one pharmacologic therapy with another or placebo. Outcomes were as follows: (1) change in nausea intensity at 30 minutes, (2) need for rescue drug, and (3) significant adverse reaction. We extracted data according to Preferred Reporting Items for Systematic Reviews and Network Meta-Analysis and appraised studies using Cochrane RoB 2. We performed Bayesian network meta-analysis to calculate odds ratios with 95% credible intervals and frequentist network meta-analysis to calculate mean differences with 95% confidence intervals. We assessed confidence using Confidence in Network Meta-analysis. We ranked agents using surface under the cumulative ranking curve (SUCRA). Intravenous tropisetron (SUCRA=93.9%) is most likely superior for \"need for rescue drug\" (not needing rescue drug) (11 trials; n=1,465). Intravenous ondansetron (SUCRA=78.6%) is most likely superior for \"significant adverse reaction\" (not causing adverse reaction) (9 trials; n=1,267). The network for change in nausea intensity demonstrated statistically significant incoherence at the overall level. Within a minimally contextualized framework, as single agents, intravenous tropisetron and intravenous prochlorperazine are definitely among the most effective, intravenous metoclopramide and intravenous droperidol are possibly among the most effective, and oral ondansetron is definitely among the least effective; considering certain adverse reactions, intravenous metoclopramide, intravenous droperidol, and intravenous promethazine are definitely among the most harmful.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "We conducted a systematic review and Bayesian network meta-analysis to identify the most effective and safest therapies for nausea/emesis in adult patients presenting to the emergency department (ED)."
        },
        {
          "label": "METHODS",
          "text": "We searched PubMed, Embase, Cumulated Index to Nursing and Allied Health Literature, and Web of Science from inception to November 22, 2023. Eligible studies were randomized controlled trials in adult participants presenting to ED with nausea or emesis and compared one pharmacologic therapy with another or placebo. Outcomes were as follows: (1) change in nausea intensity at 30 minutes, (2) need for rescue drug, and (3) significant adverse reaction. We extracted data according to Preferred Reporting Items for Systematic Reviews and Network Meta-Analysis and appraised studies using Cochrane RoB 2. We performed Bayesian network meta-analysis to calculate odds ratios with 95% credible intervals and frequentist network meta-analysis to calculate mean differences with 95% confidence intervals. We assessed confidence using Confidence in Network Meta-analysis. We ranked agents using surface under the cumulative ranking curve (SUCRA)."
        },
        {
          "label": "RESULTS",
          "text": "Intravenous tropisetron (SUCRA=93.9%) is most likely superior for \"need for rescue drug\" (not needing rescue drug) (11 trials; n=1,465). Intravenous ondansetron (SUCRA=78.6%) is most likely superior for \"significant adverse reaction\" (not causing adverse reaction) (9 trials; n=1,267). The network for change in nausea intensity demonstrated statistically significant incoherence at the overall level."
        },
        {
          "label": "CONCLUSION",
          "text": "Within a minimally contextualized framework, as single agents, intravenous tropisetron and intravenous prochlorperazine are definitely among the most effective, intravenous metoclopramide and intravenous droperidol are possibly among the most effective, and oral ondansetron is definitely among the least effective; considering certain adverse reactions, intravenous metoclopramide, intravenous droperidol, and intravenous promethazine are definitely among the most harmful."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40772912/",
      "pubDate": "2025 Aug 06",
      "doi": "10.1016/j.annemergmed.2025.06.009",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "For managing nausea, intravenous tropisetron and prochlorperazine are highly effective, while oral ondansetron is least effective, and intravenous metoclopramide, droperidol, and promethazine are the most likely to cause harm."
    },
    {
      "id": "330ab3cabda8",
      "title": "Aspirin, cardiovascular events, and major bleeding in older adults: extended follow-up of the ASPREE trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117383",
      "abstract": "Guidelines recommend against routine initiation of low-dose aspirin in older adults for primary prevention of atherosclerotic cardiovascular disease events. This study aimed to estimate long-term and post-trial effects of aspirin on major adverse cardiovascular events (MACE) and major haemorrhage using extended follow-up of participants from the ASPREE trial. In-trial (2010-17) and post-trial (2017-22) data were analysed. At enrolment, participants were aged ≥70 years (≥65 years for US minorities) without prior cardiovascular events, dementia, or independence-limiting physical disability. Randomization was to daily low-dose aspirin or matching placebo for the 4.7 years of the trial. Of the 19 114 participants randomized (9525 aspirin, 9589 placebo), 15 668 without in-trial MACE consented to post-trial follow-up. No long-term benefit of randomization to aspirin was observed for MACE for the entire in-trial and post-trial period [hazard ratio (HR) 1.04, 95% confidence interval (CI) .94, 1.15]. However, during the post-trial period (median 4.3 years), there was a higher rate of MACE (HR 1.17, 95% CI 1.01, 1.36) in those randomized to aspirin compared with placebo. Over the entire period, a higher rate of major haemorrhage was observed in the randomized aspirin group compared with placebo (HR 1.24, 95% CI 1.10, 1.39). The present study provides novel evidence concerning long-term MACE and haemorrhage following aspirin use in initially healthy older adults. The finding of no long-term MACE benefit needs to be considered in clinical decision-making if aspirin is being considered for use in this context.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Guidelines recommend against routine initiation of low-dose aspirin in older adults for primary prevention of atherosclerotic cardiovascular disease events. This study aimed to estimate long-term and post-trial effects of aspirin on major adverse cardiovascular events (MACE) and major haemorrhage using extended follow-up of participants from the ASPREE trial."
        },
        {
          "label": "METHODS",
          "text": "In-trial (2010-17) and post-trial (2017-22) data were analysed. At enrolment, participants were aged ≥70 years (≥65 years for US minorities) without prior cardiovascular events, dementia, or independence-limiting physical disability. Randomization was to daily low-dose aspirin or matching placebo for the 4.7 years of the trial."
        },
        {
          "label": "RESULTS",
          "text": "Of the 19 114 participants randomized (9525 aspirin, 9589 placebo), 15 668 without in-trial MACE consented to post-trial follow-up. No long-term benefit of randomization to aspirin was observed for MACE for the entire in-trial and post-trial period [hazard ratio (HR) 1.04, 95% confidence interval (CI) .94, 1.15]. However, during the post-trial period (median 4.3 years), there was a higher rate of MACE (HR 1.17, 95% CI 1.01, 1.36) in those randomized to aspirin compared with placebo. Over the entire period, a higher rate of major haemorrhage was observed in the randomized aspirin group compared with placebo (HR 1.24, 95% CI 1.10, 1.39)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The present study provides novel evidence concerning long-term MACE and haemorrhage following aspirin use in initially healthy older adults. The finding of no long-term MACE benefit needs to be considered in clinical decision-making if aspirin is being considered for use in this context."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40796244/",
      "pubDate": "2025 Aug 12",
      "doi": "10.1093/eurheartj/ehaf514",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "Aspirin use in healthy older adults does not provide long-term benefit in preventing major adverse cardiovascular events (MACE)."
    },
    {
      "id": "76cc774ae6e4",
      "title": "Glucagon-like peptide 1 receptor agonists and risk of venous thromboembolism: a systematic review and meta-analysis of randomized controlled trials.",
      "journal": "J Thromb Haemost",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117358",
      "abstract": "Obesity is an established risk factor for venous thromboembolism (VTE). Observational data suggest that glucagon-like peptide 1 receptor agonists (GLP-1RAs) may reduce the risk of VTE. However, the effects of GLP-1RAs on VTE have not been tested in randomized controlled trials (RCTs). To investigate the impact of GLP-1RAs on VTE risk using data from RCTs. We conducted a systematic review and meta-analysis of placebo-controlled RCTs focusing on GLP-1RA use in patients with type 2 diabetes mellitus (T2DM) or obesity. Five databases were searched from inception to October 2024. The primary outcome was VTE, which was a composite of pulmonary embolism (PE), deep vein thrombosis, and VTE at other sites, and the secondary outcomes were the individual events. Twenty-seven RCTs with 84 003 patients were analyzed. The median incidence of VTE was 1.1 and 2.5 per 1000 patient-years in the GLP-1RA and placebo groups, respectively. There was no statistically significant difference in overall VTE risk between GLP-1RA and placebo groups (risk ratio [RR], 0.70; 95% CI, 0.46-1.07). However, GLP-1RAs were associated with a significantly lower risk of PE (RR, 0.60; 95% CI, 0.39-0.94). In contrast, there were no significant differences in the risk of deep vein thrombosis (RR, 1.21; 95% CI, 0.69-2.12) or VTE at other sites (RR, 0.56; 95% CI, 0.25-1.26). In this meta-analysis of randomized trials, GLP-1RAs were not associated with a significant reduction in overall VTE risk but were associated with a lower risk of PE among patients with T2DM or obesity.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Obesity is an established risk factor for venous thromboembolism (VTE). Observational data suggest that glucagon-like peptide 1 receptor agonists (GLP-1RAs) may reduce the risk of VTE. However, the effects of GLP-1RAs on VTE have not been tested in randomized controlled trials (RCTs)."
        },
        {
          "label": "OBJECTIVES",
          "text": "To investigate the impact of GLP-1RAs on VTE risk using data from RCTs."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review and meta-analysis of placebo-controlled RCTs focusing on GLP-1RA use in patients with type 2 diabetes mellitus (T2DM) or obesity. Five databases were searched from inception to October 2024. The primary outcome was VTE, which was a composite of pulmonary embolism (PE), deep vein thrombosis, and VTE at other sites, and the secondary outcomes were the individual events."
        },
        {
          "label": "RESULTS",
          "text": "Twenty-seven RCTs with 84 003 patients were analyzed. The median incidence of VTE was 1.1 and 2.5 per 1000 patient-years in the GLP-1RA and placebo groups, respectively. There was no statistically significant difference in overall VTE risk between GLP-1RA and placebo groups (risk ratio [RR], 0.70; 95% CI, 0.46-1.07). However, GLP-1RAs were associated with a significantly lower risk of PE (RR, 0.60; 95% CI, 0.39-0.94). In contrast, there were no significant differences in the risk of deep vein thrombosis (RR, 1.21; 95% CI, 0.69-2.12) or VTE at other sites (RR, 0.56; 95% CI, 0.25-1.26)."
        },
        {
          "label": "CONCLUSION",
          "text": "In this meta-analysis of randomized trials, GLP-1RAs were not associated with a significant reduction in overall VTE risk but were associated with a lower risk of PE among patients with T2DM or obesity."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40602613/",
      "pubDate": "2025 Jun 30",
      "doi": "10.1016/j.jtha.2025.06.020",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "GLP-1RAs did not significantly reduce overall VTE risk but were associated with a lower risk of pulmonary embolism in patients with type 2 diabetes or obesity."
    },
    {
      "id": "3c9c278f2a29",
      "title": "Effects of Prophylactic Oxytocin or Carbetocin on Troponin Release and Postpartum Haemorrhage at PlannedCaesarean Delivery: A Double-Blind Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117409",
      "abstract": "Oxytocin may cause dose-dependent myocardial side effects. We investigated if carbetocin, a long-acting oxytocin analogue, causes similar changes. Double-blind randomised trial. University Hospitals, Oslo, Norway. 240 singleton pregnant women, 18-50 years, undergoing planned caesarean delivery. Participants, randomised 1:1, received oxytocin 2.5 IU or carbetocin 100 μg intravenously immediately after delivery. The primary endpoint was change from baseline in cardiac troponin I (cTnI) serum concentration at 6-10 h postpartum. Secondary endpoints included blood loss, uterine tone (numerical rating scale 0-10), rescue treatment, and healthcare costs 48 h postpartum. 215 patients underwent a planned caesarean delivery and received their allocated study drug (oxytocin group, n = 112; carbetocin group, n = 103). We detected no difference in median change from baseline cTnI concentration at 6-10 h postpartum (0.0 [95% CI -1.09 to 1.09] ng/L; p = 1.00). Median (interquartile range [IQR]) estimated blood loss was similar: oxytocin, 395 (96 to 627) mL; carbetocin, 335 (127 to 570) mL (group difference: -41 mL [95% CI -158 to 76]; p = 0.49). Rescue treatment utilisation was higher with oxytocin (46.4%) versus carbetocin (27.2%); risk difference. (-19.2% [95% CI -31.2 to -6.3]; p = 0.004). Median (IQR) uterine tone at 5 min after delivery was lower with oxytocin (7 [6 to 8]) versus carbetocin (8 [7 to 9]; group difference 1.0 NRS [95% CI 1.0 to 1.0]; p < 0.001). Despite carbetocin costing 10 times more than oxytocin, mean total healthcare costs were similar, adjusted group difference 31 NOK ($3 USD; €3; [95% CI -361 to 298 NOK]; p = 0.85). Ischaemic myocardial risk and healthcare costs were comparable for both drugs. Patients receiving carbetocin maintained better uterine tone and required fewer rescue treatments. EudraCT: 2014-000507-27; ClinicalTrials.gov Identifier: NCT03899961 (02/04/2019).",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Oxytocin may cause dose-dependent myocardial side effects. We investigated if carbetocin, a long-acting oxytocin analogue, causes similar changes."
        },
        {
          "label": "DESIGN",
          "text": "Double-blind randomised trial."
        },
        {
          "label": "SETTING",
          "text": "University Hospitals, Oslo, Norway."
        },
        {
          "label": "POPULATION",
          "text": "240 singleton pregnant women, 18-50 years, undergoing planned caesarean delivery."
        },
        {
          "label": "METHODS",
          "text": "Participants, randomised 1:1, received oxytocin 2.5 IU or carbetocin 100 μg intravenously immediately after delivery."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary endpoint was change from baseline in cardiac troponin I (cTnI) serum concentration at 6-10 h postpartum. Secondary endpoints included blood loss, uterine tone (numerical rating scale 0-10), rescue treatment, and healthcare costs 48 h postpartum."
        },
        {
          "label": "RESULTS",
          "text": "215 patients underwent a planned caesarean delivery and received their allocated study drug (oxytocin group, n = 112; carbetocin group, n = 103). We detected no difference in median change from baseline cTnI concentration at 6-10 h postpartum (0.0 [95% CI -1.09 to 1.09] ng/L; p = 1.00). Median (interquartile range [IQR]) estimated blood loss was similar: oxytocin, 395 (96 to 627) mL; carbetocin, 335 (127 to 570) mL (group difference: -41 mL [95% CI -158 to 76]; p = 0.49). Rescue treatment utilisation was higher with oxytocin (46.4%) versus carbetocin (27.2%); risk difference. (-19.2% [95% CI -31.2 to -6.3]; p = 0.004). Median (IQR) uterine tone at 5 min after delivery was lower with oxytocin (7 [6 to 8]) versus carbetocin (8 [7 to 9]; group difference 1.0 NRS [95% CI 1.0 to 1.0]; p < 0.001). Despite carbetocin costing 10 times more than oxytocin, mean total healthcare costs were similar, adjusted group difference 31 NOK ($3 USD; €3; [95% CI -361 to 298 NOK]; p = 0.85)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ischaemic myocardial risk and healthcare costs were comparable for both drugs. Patients receiving carbetocin maintained better uterine tone and required fewer rescue treatments."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "EudraCT: 2014-000507-27; ClinicalTrials.gov Identifier: NCT03899961 (02/04/2019)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40772429/",
      "pubDate": "2025 Aug 07",
      "doi": "10.1111/1471-0528.18312",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "Carbetocin and oxytocin have similar effects on ischemic myocardial risk and healthcare costs, but carbetocin is associated with better uterine tone and fewer rescue treatments."
    },
    {
      "id": "eb8ff994ad22",
      "title": "Stapokibart for Severe Uncontrolled Chronic Rhinosinusitis With Nasal Polyps: The CROWNS-2 Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117411",
      "abstract": "Chronic rhinosinusitis with nasal polyps causes severe symptoms and impaired quality of life. Stapokibart is a novel monoclonal antibody that targets interleukin 4Rα. To assess the efficacy and safety of stapokibart as an add-on treatment to intranasal corticosteroids in patients with severe uncontrolled chronic rhinosinusitis with nasal polyps. From August 9, 2022, to April 28, 2023, this randomized, double-blind, phase 3 clinical trial, conducted at 51 hospitals in China, enrolled adult patients with chronic rhinosinusitis with nasal polyps who had a history of systemic corticosteroid use or sinonasal surgery and a bilateral nasal polyp score of 5 or greater (on a scale of 0-8) and a weekly mean nasal congestion score of 2 or greater (on a scale of 0-3). Eosinophilic chronic rhinosinusitis with nasal polyps was defined as blood eosinophils of 6.9% or greater (without asthma) or 3.7% or greater (with asthma) or an eosinophil count of 55 per high-power field or greater or 27% or greater in nasal polyp tissue. Patient follow-up was completed on June 25, 2024. Four weeks after initiation of mometasone furoate nasal spray, 100 µg in each nostril daily, patients were randomized to receive subcutaneous stapokibart, 300 mg, or placebo (1:1) every 2 weeks for 24 weeks. Both groups then received stapokibart for 28 weeks. Co-primary end points were changes from baseline in nasal polyp score (meaningful change threshold [MCT] ≥1 point) and nasal congestion score (MCT ≥0.5 points) at week 24 in all patients and in the population with eosinophilia. Among 180 patients randomized, 179 (mean age, 45 [SD, 12.9] years; 61 [34.1%] women) received at least 1 treatment dose (n = 90 for stapokibart; n = 89 for placebo). In the overall population, the least-squares (LS) mean change in nasal polyp score from baseline to week 24 in the stapokibart vs placebo groups was -2.6 vs -0.3 points, respectively, (LS mean difference, -2.3; 95% CI, -2.6 to -1.9; P < .001); in the population with eosinophilia, the change was -3.0 vs -0.4 points, respectively (LS mean difference, -2.5; 95% CI, -2.9 to -2.1; P < .001). The LS mean change in nasal congestion score from baseline to week 24 in the stapokibart vs placebo groups was -1.2 vs -0.5 points, respectively, in the overall population (LS mean difference, -0.7; 95% CI, -0.9 to -0.5; P < .001) and -1.3 vs -0.5 points, respectively, in the population with eosinophilia (LS mean difference, -0.8; 95% CI, -1.0 to -0.6; P < .001). Serious adverse events were rare (2.2% in the stapokibart group vs 1.1% in the placebo group). Higher rates of arthralgia (7.8% vs 0%) and hyperuricemia (5.6% vs 1.1%) were reported with stapokibart vs placebo, respectively. Among patients with severe chronic rhinosinusitis with nasal polyps treated with a daily intranasal corticosteroid, stapokibart reduced polyp size and severity of nasal symptoms at 24 weeks. ClinicalTrials.gov Identifier: NCT05436275.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Chronic rhinosinusitis with nasal polyps causes severe symptoms and impaired quality of life. Stapokibart is a novel monoclonal antibody that targets interleukin 4Rα."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of stapokibart as an add-on treatment to intranasal corticosteroids in patients with severe uncontrolled chronic rhinosinusitis with nasal polyps."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "From August 9, 2022, to April 28, 2023, this randomized, double-blind, phase 3 clinical trial, conducted at 51 hospitals in China, enrolled adult patients with chronic rhinosinusitis with nasal polyps who had a history of systemic corticosteroid use or sinonasal surgery and a bilateral nasal polyp score of 5 or greater (on a scale of 0-8) and a weekly mean nasal congestion score of 2 or greater (on a scale of 0-3). Eosinophilic chronic rhinosinusitis with nasal polyps was defined as blood eosinophils of 6.9% or greater (without asthma) or 3.7% or greater (with asthma) or an eosinophil count of 55 per high-power field or greater or 27% or greater in nasal polyp tissue. Patient follow-up was completed on June 25, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Four weeks after initiation of mometasone furoate nasal spray, 100 µg in each nostril daily, patients were randomized to receive subcutaneous stapokibart, 300 mg, or placebo (1:1) every 2 weeks for 24 weeks. Both groups then received stapokibart for 28 weeks."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Co-primary end points were changes from baseline in nasal polyp score (meaningful change threshold [MCT] ≥1 point) and nasal congestion score (MCT ≥0.5 points) at week 24 in all patients and in the population with eosinophilia."
        },
        {
          "label": "RESULTS",
          "text": "Among 180 patients randomized, 179 (mean age, 45 [SD, 12.9] years; 61 [34.1%] women) received at least 1 treatment dose (n = 90 for stapokibart; n = 89 for placebo). In the overall population, the least-squares (LS) mean change in nasal polyp score from baseline to week 24 in the stapokibart vs placebo groups was -2.6 vs -0.3 points, respectively, (LS mean difference, -2.3; 95% CI, -2.6 to -1.9; P < .001); in the population with eosinophilia, the change was -3.0 vs -0.4 points, respectively (LS mean difference, -2.5; 95% CI, -2.9 to -2.1; P < .001). The LS mean change in nasal congestion score from baseline to week 24 in the stapokibart vs placebo groups was -1.2 vs -0.5 points, respectively, in the overall population (LS mean difference, -0.7; 95% CI, -0.9 to -0.5; P < .001) and -1.3 vs -0.5 points, respectively, in the population with eosinophilia (LS mean difference, -0.8; 95% CI, -1.0 to -0.6; P < .001). Serious adverse events were rare (2.2% in the stapokibart group vs 1.1% in the placebo group). Higher rates of arthralgia (7.8% vs 0%) and hyperuricemia (5.6% vs 1.1%) were reported with stapokibart vs placebo, respectively."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with severe chronic rhinosinusitis with nasal polyps treated with a daily intranasal corticosteroid, stapokibart reduced polyp size and severity of nasal symptoms at 24 weeks."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05436275."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40824573/",
      "pubDate": "2025 Aug 18",
      "doi": "10.1001/jama.2025.12515",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "Stapokibart, a medication, improved nasal polyp size and symptoms in patients with severe chronic rhinosinusitis with nasal polyps when used with a daily intranasal corticosteroid over 24 weeks."
    },
    {
      "id": "309dcabf85cc",
      "title": "Guided Internet-Based Cognitive Behavior Therapy for Women With Bulimia Nervosa: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47868474/117380",
      "abstract": "Despite the rising prevalence of bulimia nervosa and the associated risks of chronicity and severe physical and psychological morbidity, access to effective treatment remains poor. The effectiveness and acceptability of internet-based cognitive behavior therapy (ICBT) for women with bulimia nervosa in clinical settings in East Asia remain unclear. To determine the effectiveness and acceptability of a guided ICBT program to treat women with bulimia nervosa in Japan. This randomized clinical trial was conducted at 7 university hospitals in Japan between August 2022 and October 2024. This study enrolled female participants aged 13 to 65 years whose symptoms met the Diagnostic and Statistical Manual of Mental Disorders (Fifth Edition) criteria for bulimia nervosa, had a body mass index (BMI) of 17.5 or greater, had internet access, and had no history of practicing CBT-related techniques within the past 2 years. Both the control and intervention groups received usual care. The intervention consisted of ICBT with additional guidance from a therapist. The therapy program was tailored to Japanese culture and grounded in a specific cognitive behavior model, and it was performed over a 12-week period. Severity of bulimia nervosa, measured by the weekly combined frequency of episodes involving binge eating and compensatory behaviors, was assessed by a blinded, independent rating team at baseline and at the 12-week intervention end point. Intention-to-treat analyses were conducted using a linear mixed model with effect sizes calculated using Cohen d. A total of 61 women met the eligibility criteria and were randomized to the intervention group (n = 31) or the control group (n = 30). Participants were predominantly young (mean [SD] age, 27.8 [9.0] years), had normal weight (mean [SD] BMI, 21.1 [3.6]), and had a mean (SD) duration of illness of 9.3 (8.8) years; half (31 [50.8%]) were employed. Intent-to-treat analysis revealed that guided ICBT significantly reduced the weekly combined frequency of episodes involving binge eating and compensatory behaviors (by an adjusted mean difference of 9.84 episodes [95% CI, 2.49-17.18 episodes], P = .01; Cohen d = 0.73 [95% CI, 0.21-1.26]). Sensitivity analyses supported these findings. In this randomized clinical trial, the intervention group experienced a significant decrease in bulimia symptoms compared with the control group, supporting the effectiveness and acceptability of the therapist-guided ICBT program. These findings suggest that integration of therapist-guided ICBT in usual care has the potential to improve accessibility to efficacious treatment options for women with bulimia nervosa. UMIN Clinical Trials Registry Identifier: UMIN00048732.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Despite the rising prevalence of bulimia nervosa and the associated risks of chronicity and severe physical and psychological morbidity, access to effective treatment remains poor. The effectiveness and acceptability of internet-based cognitive behavior therapy (ICBT) for women with bulimia nervosa in clinical settings in East Asia remain unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine the effectiveness and acceptability of a guided ICBT program to treat women with bulimia nervosa in Japan."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was conducted at 7 university hospitals in Japan between August 2022 and October 2024. This study enrolled female participants aged 13 to 65 years whose symptoms met the Diagnostic and Statistical Manual of Mental Disorders (Fifth Edition) criteria for bulimia nervosa, had a body mass index (BMI) of 17.5 or greater, had internet access, and had no history of practicing CBT-related techniques within the past 2 years."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Both the control and intervention groups received usual care. The intervention consisted of ICBT with additional guidance from a therapist. The therapy program was tailored to Japanese culture and grounded in a specific cognitive behavior model, and it was performed over a 12-week period."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Severity of bulimia nervosa, measured by the weekly combined frequency of episodes involving binge eating and compensatory behaviors, was assessed by a blinded, independent rating team at baseline and at the 12-week intervention end point. Intention-to-treat analyses were conducted using a linear mixed model with effect sizes calculated using Cohen d."
        },
        {
          "label": "RESULTS",
          "text": "A total of 61 women met the eligibility criteria and were randomized to the intervention group (n = 31) or the control group (n = 30). Participants were predominantly young (mean [SD] age, 27.8 [9.0] years), had normal weight (mean [SD] BMI, 21.1 [3.6]), and had a mean (SD) duration of illness of 9.3 (8.8) years; half (31 [50.8%]) were employed. Intent-to-treat analysis revealed that guided ICBT significantly reduced the weekly combined frequency of episodes involving binge eating and compensatory behaviors (by an adjusted mean difference of 9.84 episodes [95% CI, 2.49-17.18 episodes], P = .01; Cohen d = 0.73 [95% CI, 0.21-1.26]). Sensitivity analyses supported these findings."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, the intervention group experienced a significant decrease in bulimia symptoms compared with the control group, supporting the effectiveness and acceptability of the therapist-guided ICBT program. These findings suggest that integration of therapist-guided ICBT in usual care has the potential to improve accessibility to efficacious treatment options for women with bulimia nervosa."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "UMIN Clinical Trials Registry Identifier: UMIN00048732."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40762916/",
      "pubDate": "2025 Aug 01",
      "doi": "10.1001/jamanetworkopen.2025.25165",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "Therapist-guided internet-delivered cognitive behavioral therapy (ICBT) effectively reduced bulimia symptoms in the intervention group compared to the control group."
    },
    {
      "id": "cf3fff3e83a5",
      "title": "Comparative analysis on renal and cardiovascular outcomes of antidiabetic treatment in chronic kidney disease patients-A systematic review and network meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47868474/117353",
      "abstract": "Type 2 diabetes mellitus (T2DM) with chronic kidney disease (CKD) is a common complication that increases the risk of cardiovascular (CV) events and kidney failure. Recent therapies, including sodium-glucose cotransporter-2 (SGLT2) inhibitors, glucagon-like peptide-1 receptor agonists (GLP-1 RA) and dipeptidyl peptidase IV (DPP-4) inhibitors, show promise in improving outcomes. However, evidence of their comparative effectiveness in reducing CV and renal outcomes is scarce. We searched electronic databases such as PubMed, Scopus, and clinical trial registries for randomized controlled trials (RCTs) published between 2014 and 2024. A network meta-analysis (NMA) was employed to evaluate the effectiveness of antidiabetic drugs on cardiorenal outcomes. Primary outcomes were (1) major adverse CV events (MACE), (2) composite renal outcomes, (3) all-cause mortality. Other outcomes included heart failure (HF), stroke, macroalbuminuria, and a decline in estimated glomerular filtration rate (eGFR) >40% or renal replacement therapy. Twenty-six studies with 143 296 participants with T2DM and CKD were included. SGLT2 inhibitors were highly effective in reducing the risk of renal outcomes such as composite events (P-score: 0.94), eGFR decline >40% or renal replacement therapy (0.99) and CV outcomes such as MACE (0.93) and HF (1.00) followed by GLP-1 RA. While GLP-1 RA was particularly effective in reducing the risk of MI (0.87), macroalbuminuria (0.86) and stroke (0.83) compared to SGLT2 inhibitors. Both SGLT2 inhibitors and GLP-1 receptor agonists are highly effective (0.83) in reducing all-cause mortality. DPP-4 inhibitors had limited benefits compared to SGLT2 inhibitors and GLP-1 RA. SGLT2 inhibitors followed by GLP-1 RA provide strong benefits for CV and kidney health in patients with T2DM and CKD. SGLT2 inhibitors demonstrate superior benefit over GLP-1 receptor agonists for HF and renal outcomes, highlighting their preferred role in these clinical scenarios.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Type 2 diabetes mellitus (T2DM) with chronic kidney disease (CKD) is a common complication that increases the risk of cardiovascular (CV) events and kidney failure. Recent therapies, including sodium-glucose cotransporter-2 (SGLT2) inhibitors, glucagon-like peptide-1 receptor agonists (GLP-1 RA) and dipeptidyl peptidase IV (DPP-4) inhibitors, show promise in improving outcomes. However, evidence of their comparative effectiveness in reducing CV and renal outcomes is scarce."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We searched electronic databases such as PubMed, Scopus, and clinical trial registries for randomized controlled trials (RCTs) published between 2014 and 2024. A network meta-analysis (NMA) was employed to evaluate the effectiveness of antidiabetic drugs on cardiorenal outcomes. Primary outcomes were (1) major adverse CV events (MACE), (2) composite renal outcomes, (3) all-cause mortality. Other outcomes included heart failure (HF), stroke, macroalbuminuria, and a decline in estimated glomerular filtration rate (eGFR) >40% or renal replacement therapy."
        },
        {
          "label": "RESULTS",
          "text": "Twenty-six studies with 143 296 participants with T2DM and CKD were included. SGLT2 inhibitors were highly effective in reducing the risk of renal outcomes such as composite events (P-score: 0.94), eGFR decline >40% or renal replacement therapy (0.99) and CV outcomes such as MACE (0.93) and HF (1.00) followed by GLP-1 RA. While GLP-1 RA was particularly effective in reducing the risk of MI (0.87), macroalbuminuria (0.86) and stroke (0.83) compared to SGLT2 inhibitors. Both SGLT2 inhibitors and GLP-1 receptor agonists are highly effective (0.83) in reducing all-cause mortality. DPP-4 inhibitors had limited benefits compared to SGLT2 inhibitors and GLP-1 RA."
        },
        {
          "label": "CONCLUSION",
          "text": "SGLT2 inhibitors followed by GLP-1 RA provide strong benefits for CV and kidney health in patients with T2DM and CKD. SGLT2 inhibitors demonstrate superior benefit over GLP-1 receptor agonists for HF and renal outcomes, highlighting their preferred role in these clinical scenarios."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40798873/",
      "pubDate": "2025 Aug 12",
      "doi": "10.1111/dom.70010",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "SGLT2 inhibitors are superior to GLP-1 receptor agonists for heart failure and kidney outcomes in type 2 diabetes patients with chronic kidney disease."
    },
    {
      "id": "bb417520d8e9",
      "title": "Diagnosis accuracy of touchscreen-based testings for major neurocognitive disorders: a systematic review and meta-analysis.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47868474/117349",
      "abstract": "Facing an increasing prevalence, diagnosis and management of dementia has become a global health challenge. While most cognitive assessments are based on paper tests, the current trend is to digitise them, using new technologies. We aimed to achieve a systematic review on touchscreen-based assessments for neurocognitive disorders. A search on four databases (PubMed, Embase, IEEE Xplore and Web of Science) was performed. Two investigators independently selected the articles and assessed their quality using the QUADAS-2 tool. We included articles whose participants were over 65 years, classified according to the presence/absence of major neurocognitive disorder (M-NCD) determined by conventional assessment of cognition, examined with a novel tool using a touchscreen device (tablet or smartphone). We finally retained 35 articles for the systematic review and 24 for the meta-analysis. Of the 35 articles included in the systematic review, participants had Alzheimer's disease, Parkinson's disease, vascular dementia, Lewy body disease or any type of dementia. Pooled sensitivity and specificity were 0.89 (95% CI: 0.86-0.91) and 0.88 (95% CI: 0.82-0.92), respectively. Performances of self-administered or brief assessment testings were similar to those of assessor-administered or longer duration testings. The major limitation of this review and meta-analysis is the multiplicity and diversity of methods (tools, cognition assessment and type of M-NCD), which make the comparison difficult. We conclude that brief and self-assessment touchscreen-based cognitive tests are appropriate and simple tools to screen major cognitive disorders that can be used in primary care. The study was registered in Prospero (CRD42022358725).",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40742248/",
      "pubDate": "2025 Jul 01",
      "doi": "10.1093/ageing/afaf204",
      "dateReceived": "2025-08-23T10:06:47.056Z",
      "isNew": true,
      "summary": "Touchscreen-based cognitive tests show promise as simple and effective tools for screening major cognitive disorders, particularly in primary care settings."
    },
    {
      "id": "dba0760e712b",
      "title": "Effects of Prophylactic Oxytocin or Carbetocin on Troponin Release and Postpartum Haemorrhage at Planned Caesarean Delivery: A Double-Blind Randomised Controlled Trial.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/47842572/117409",
      "abstract": "Oxytocin may cause dose-dependent myocardial side effects. We investigated if carbetocin, a long-acting oxytocin analogue, causes similar changes. Double-blind randomised trial. University Hospitals, Oslo, Norway. 240 singleton pregnant women, 18-50 years, undergoing planned caesarean delivery. Participants, randomised 1:1, received oxytocin 2.5 IU or carbetocin 100 μg intravenously immediately after delivery. The primary endpoint was change from baseline in cardiac troponin I (cTnI) serum concentration at 6-10 h postpartum. Secondary endpoints included blood loss, uterine tone (numerical rating scale 0-10), rescue treatment, and healthcare costs 48 h postpartum. 215 patients underwent a planned caesarean delivery and received their allocated study drug (oxytocin group, n = 112; carbetocin group, n = 103). We detected no difference in median change from baseline cTnI concentration at 6-10 h postpartum (0.0 [95% CI -1.09 to 1.09] ng/L; p = 1.00). Median (interquartile range [IQR]) estimated blood loss was similar: oxytocin, 395 (96 to 627) mL; carbetocin, 335 (127 to 570) mL (group difference: -41 mL [95% CI -158 to 76]; p = 0.49). Rescue treatment utilisation was higher with oxytocin (46.4%) versus carbetocin (27.2%); risk difference. (-19.2% [95% CI -31.2 to -6.3]; p = 0.004). Median (IQR) uterine tone at 5 min after delivery was lower with oxytocin (7 [6 to 8]) versus carbetocin (8 [7 to 9]; group difference 1.0 NRS [95% CI 1.0 to 1.0]; p < 0.001). Despite carbetocin costing 10 times more than oxytocin, mean total healthcare costs were similar, adjusted group difference 31 NOK ($3 USD; €3; [95% CI -361 to 298 NOK]; p = 0.85). Ischaemic myocardial risk and healthcare costs were comparable for both drugs. Patients receiving carbetocin maintained better uterine tone and required fewer rescue treatments. EudraCT: 2014-000507-27; ClinicalTrials.gov Identifier: NCT03899961 (02/04/2019).",
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40772429/",
      "dateReceived": "2025-08-22T03:53:59.108Z",
      "isNew": false,
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Oxytocin may cause dose-dependent myocardial side effects. We investigated if carbetocin, a long-acting oxytocin analogue, causes similar changes."
        },
        {
          "label": "DESIGN",
          "text": "Double-blind randomised trial."
        },
        {
          "label": "SETTING",
          "text": "University Hospitals, Oslo, Norway."
        },
        {
          "label": "POPULATION",
          "text": "240 singleton pregnant women, 18-50 years, undergoing planned caesarean delivery."
        },
        {
          "label": "METHODS",
          "text": "Participants, randomised 1:1, received oxytocin 2.5 IU or carbetocin 100 μg intravenously immediately after delivery."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary endpoint was change from baseline in cardiac troponin I (cTnI) serum concentration at 6-10 h postpartum. Secondary endpoints included blood loss, uterine tone (numerical rating scale 0-10), rescue treatment, and healthcare costs 48 h postpartum."
        },
        {
          "label": "RESULTS",
          "text": "215 patients underwent a planned caesarean delivery and received their allocated study drug (oxytocin group, n = 112; carbetocin group, n = 103). We detected no difference in median change from baseline cTnI concentration at 6-10 h postpartum (0.0 [95% CI -1.09 to 1.09] ng/L; p = 1.00). Median (interquartile range [IQR]) estimated blood loss was similar: oxytocin, 395 (96 to 627) mL; carbetocin, 335 (127 to 570) mL (group difference: -41 mL [95% CI -158 to 76]; p = 0.49). Rescue treatment utilisation was higher with oxytocin (46.4%) versus carbetocin (27.2%); risk difference. (-19.2% [95% CI -31.2 to -6.3]; p = 0.004). Median (IQR) uterine tone at 5 min after delivery was lower with oxytocin (7 [6 to 8]) versus carbetocin (8 [7 to 9]; group difference 1.0 NRS [95% CI 1.0 to 1.0]; p < 0.001). Despite carbetocin costing 10 times more than oxytocin, mean total healthcare costs were similar, adjusted group difference 31 NOK ($3 USD; €3; [95% CI -361 to 298 NOK]; p = 0.85)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ischaemic myocardial risk and healthcare costs were comparable for both drugs. Patients receiving carbetocin maintained better uterine tone and required fewer rescue treatments."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "EudraCT: 2014-000507-27; ClinicalTrials.gov Identifier: NCT03899961 (02/04/2019)."
        }
      ],
      "doi": "10.1111/1471-0528.18312",
      "pubDate": "2025 Aug 07"
    }
  ]
}