{
  "updated_at": "2025-10-25T23:22:19.194Z",
  "articles": [
    {
      "id": "d0e02f3ef0db",
      "title": "Ruxolitinib Versus Best Available Therapy in Patients With Steroid-Refractory Acute Graft-Versus-Host Disease: Final Analysis From the Randomized Phase III REACH2 Trial.",
      "journal": "J Clin Oncol",
      "score": "5/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117911",
      "abstract": "Approximately 30%-50% of patients develop acute graft-versus-host disease (aGVHD) after allogeneic hematopoietic cell transplantation (Allo-HCT), representing a major limitation of this treatment. Although corticosteroids remain the standard first-line therapy for aGVHD, up to 50% of patients become steroid-refractory (SR). REACH2 is a phase III study of ruxolitinib versus best available therapy (BAT) in patients age 12 years and older with SR-aGVHD after Allo-HCT. We present the final efficacy and safety outcomes from REACH2 after 24 months of treatment. Cumulative median (range) duration of response was 167 (22-677) days with ruxolitinib and 106 (10-526) days with BAT. Median overall survival and event-free survival were 10.7 and 8.3 months for ruxolitinib, compared with 5.8 and 4.2 months, respectively, with BAT. Median failure-free survival was significantly longer with ruxolitinib than with BAT (4.86  1.02 months,  < .001). Similar numbers of nonrelapse mortality events were observed with ruxolitinib and BAT (72  71), and malignancy relapse/progression events remained low across both groups. Numerically higher chronic GVHD rates were noted with ruxolitinib than with BAT from 12 months; however, 95% confidence intervals overlapped. Safety observations were consistent with the primary analysis results. Ruxolitinib provided efficacy advantages over BAT in patients with SR-aGVHD over 24 months.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41092247/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1200/JCO-25-00809",
      "dateReceived": "2025-10-25T23:21:48.008Z",
      "isNew": true,
      "summary": "Ruxolitinib demonstrated improved efficacy, including longer duration of response, overall survival, and event-free survival, compared to best available therapy in patients with steroid-refractory acute graft-versus-host disease after allogeneic hematopoietic cell transplantation over a 24-month period."
    },
    {
      "id": "eaf17738892f",
      "title": "Effect of Intravenous, Inhalational, or Combined Anesthesia Maintenance on Postoperative Respiratory Adverse Events in Children Undergoing Adenotonsillectomy (AmPRAEC): A Multicenter Randomized Clinical Trial.",
      "journal": "Anesthesiology",
      "score": "5/7",
      "tags": [
        "Surgery - Ear Nose Throat"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117889",
      "abstract": "General anesthetic drugs may affect the risk of postoperative respiratory adverse events (PRAEs) in children, but the effect of anesthesia maintenance strategies on these events has not yet been widely validated. This study tested the hypothesis that anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone would lead to a progressive reduction in the incidence of PRAEs. This multicenter randomized clinical trial (AmPRAEC study) enrolled 760 children aged 0 to 12 yr who underwent adenotonsillectomy at 12 hospitals in China. Patients were randomly assigned to the intravenous anesthesia maintenance (IV group), the combined intravenous-inhalation anesthesia maintenance (IVIH group), or the inhalation anesthesia maintenance (IH group). Tracheal tubes were used for airway management, with all children undergoing awake extubation. The primary outcome was PRAE incidence in the postanesthesia care unit. A total of 760 children (median [interquartile range] age, 6 [4 to 7] years; 460 boys [60.5%]) were randomized, and 729 total samples were available for modified intention-to-treat analysis. The IV group had the lowest incidence of PRAEs (45 of 239 [18.8%]), followed by the IVIH group (70 of 246 [28.5%]) and the IH group (106 of 244 [43.4%]). Compared to the IH group, the IVIH group had a significantly lower risk of PRAEs (adjusted odds ratio [aOR], 0.44; 95% confidence interval [CI], 0.29 to 0.65; number needed to treat, 7). The IV group had significantly lower risk compared to both the IVIH group (aOR, 0.57; 95% CI, 0.36 to 0.90; number needed to treat, 6) and the IH group (aOR, 0.25; 95% CI, 0.16 to 0.39; number needed to treat, 3). Anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone resulted in a progressive reduction in the incidence of PRAEs. Propofol intravenous anesthesia maintenance should be considered for children undergoing adenotonsillectomy.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "General anesthetic drugs may affect the risk of postoperative respiratory adverse events (PRAEs) in children, but the effect of anesthesia maintenance strategies on these events has not yet been widely validated. This study tested the hypothesis that anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone would lead to a progressive reduction in the incidence of PRAEs."
        },
        {
          "label": "METHODS",
          "text": "This multicenter randomized clinical trial (AmPRAEC study) enrolled 760 children aged 0 to 12 yr who underwent adenotonsillectomy at 12 hospitals in China. Patients were randomly assigned to the intravenous anesthesia maintenance (IV group), the combined intravenous-inhalation anesthesia maintenance (IVIH group), or the inhalation anesthesia maintenance (IH group). Tracheal tubes were used for airway management, with all children undergoing awake extubation. The primary outcome was PRAE incidence in the postanesthesia care unit."
        },
        {
          "label": "RESULTS",
          "text": "A total of 760 children (median [interquartile range] age, 6 [4 to 7] years; 460 boys [60.5%]) were randomized, and 729 total samples were available for modified intention-to-treat analysis. The IV group had the lowest incidence of PRAEs (45 of 239 [18.8%]), followed by the IVIH group (70 of 246 [28.5%]) and the IH group (106 of 244 [43.4%]). Compared to the IH group, the IVIH group had a significantly lower risk of PRAEs (adjusted odds ratio [aOR], 0.44; 95% confidence interval [CI], 0.29 to 0.65; number needed to treat, 7). The IV group had significantly lower risk compared to both the IVIH group (aOR, 0.57; 95% CI, 0.36 to 0.90; number needed to treat, 6) and the IH group (aOR, 0.25; 95% CI, 0.16 to 0.39; number needed to treat, 3)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone resulted in a progressive reduction in the incidence of PRAEs. Propofol intravenous anesthesia maintenance should be considered for children undergoing adenotonsillectomy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40768554/",
      "pubDate": "2025 Oct 14",
      "doi": "10.1097/ALN.0000000000005707",
      "dateReceived": "2025-10-25T23:21:48.008Z",
      "isNew": true,
      "summary": "Propofol infusion during adenotonsillectomy reduces the occurrence of postoperative respiratory adverse events (PRAEs) in children."
    },
    {
      "id": "7ce77c84d5ff",
      "title": "Transcatheter Closure of Patent Foramen Ovale With a Novel Biodegradable Device: A Prospective, Multicenter, Randomized Controlled Clinical Trial.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117876",
      "abstract": "Novel biodegradable patent foramen ovale (PFO) closure devices offer a promising therapeutic option. The efficacy and safety of the novel biodegradable devices compared with nitinol devices have not yet been investigated in a randomized clinical trial. This multicenter, randomized, noninferiority trial examined whether the novel biodegradable PFO closure device achieves comparable closure success rates as traditional nitinol devices while demonstrating disappearance of the protruding parts of the device on echocardiography. A total of 190 patients with PFO were enrolled and randomly assigned to receive either the biodegradable device (n=96) or the nitinol device (n=94). The primary efficacy end point was PFO closure success rate at 6 months postprocedure as demonstrated by contrast echocardiography. We continued to evaluate device-related complications, device disappearance on echocardiography, and closure success rates over a 24-month follow-up period. Successful PFO closure was achieved in 87 patients (90.63%) in the biodegradable device group and 86 patients (91.49%) in the nitinol device control group. The lower limit of the 95% CI of absolute difference was -8.98%, greater than the predefined noninferiority margin of -10%, confirming that the biodegradable device was not inferior to the nitinol device in terms of closure success. One patient in the trial group required surgical device removal because of intraprocedural deformation. No deaths, embolism, thrombus on the device, or erosion were observed in either group throughout the entire study period. Transthoracic echocardiography revealed that the hyperechoic area corresponding to the biodegradable device began decreasing within the first year after implantation and disappeared on echocardiography by 24 months after implantation. The novel biodegradable PFO closure device, which disappears on echocardiography within 24 months after implantation, demonstrates noninferiority to the traditional nitinol device in both efficacy and safety.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Novel biodegradable patent foramen ovale (PFO) closure devices offer a promising therapeutic option. The efficacy and safety of the novel biodegradable devices compared with nitinol devices have not yet been investigated in a randomized clinical trial."
        },
        {
          "label": "METHODS",
          "text": "This multicenter, randomized, noninferiority trial examined whether the novel biodegradable PFO closure device achieves comparable closure success rates as traditional nitinol devices while demonstrating disappearance of the protruding parts of the device on echocardiography. A total of 190 patients with PFO were enrolled and randomly assigned to receive either the biodegradable device (n=96) or the nitinol device (n=94). The primary efficacy end point was PFO closure success rate at 6 months postprocedure as demonstrated by contrast echocardiography. We continued to evaluate device-related complications, device disappearance on echocardiography, and closure success rates over a 24-month follow-up period."
        },
        {
          "label": "RESULTS",
          "text": "Successful PFO closure was achieved in 87 patients (90.63%) in the biodegradable device group and 86 patients (91.49%) in the nitinol device control group. The lower limit of the 95% CI of absolute difference was -8.98%, greater than the predefined noninferiority margin of -10%, confirming that the biodegradable device was not inferior to the nitinol device in terms of closure success. One patient in the trial group required surgical device removal because of intraprocedural deformation. No deaths, embolism, thrombus on the device, or erosion were observed in either group throughout the entire study period. Transthoracic echocardiography revealed that the hyperechoic area corresponding to the biodegradable device began decreasing within the first year after implantation and disappeared on echocardiography by 24 months after implantation."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The novel biodegradable PFO closure device, which disappears on echocardiography within 24 months after implantation, demonstrates noninferiority to the traditional nitinol device in both efficacy and safety."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41078120/",
      "pubDate": "2025 Oct 13",
      "doi": "10.1161/CIRCULATIONAHA.125.074609",
      "dateReceived": "2025-10-25T23:21:48.008Z",
      "isNew": true,
      "summary": "A biodegradable PFO closure device is as effective and safe as a traditional nitinol device."
    },
    {
      "id": "ad3c9f37e8b7",
      "title": "Tenecteplase for Acute Ischemic Stroke at 4.5 to 24 Hours: A Meta-Analysis of Randomized Controlled Trials.",
      "journal": "Stroke",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48565878/117885",
      "dateReceived": "2025-10-25T23:21:48.008Z",
      "isNew": true
    },
    {
      "id": "f33892702daf",
      "title": "Sultiame once per day in obstructive sleep apnoea (FLOW): a multicentre, randomised, double-blind, placebo-controlled, dose-finding, phase 2 trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48565878/117884",
      "dateReceived": "2025-10-25T23:21:48.008Z",
      "isNew": true
    },
    {
      "id": "bf50a0c9e338",
      "title": "Pharmacotherapies for cannabis use disorder.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48565878/117874",
      "abstract": "Globally, cannabis use is prevalent and widespread. There are currently no pharmacotherapies approved for the treatment of cannabis use disorder (a problematic pattern of cannabis use that leads to clinically significant impairment or distress). This is the second update of a Cochrane Review first published in the Cochrane Library in Issue 12, 2014. To assess the effectiveness and safety of pharmacotherapies as compared with each other, placebo or no pharmacotherapy (supportive care) for reducing symptoms of cannabis withdrawal and promoting cessation or reduction of cannabis use. We updated our searches of the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase and PsycINFO in May 2024. Randomised controlled trials (RCTs) and quasi-RCTs of medications to treat cannabis withdrawal and/or to promote cessation or reduction of cannabis use, in comparison with other medications, placebo or no medication in people diagnosed as cannabis dependent or who are likely to be dependent. Critical outcomes were: 1) abstinence at the end of treatment; 2) intensity of withdrawal including craving; 3) nature, incidence and frequency of adverse events (AE) and 4) severe AE (SAE); 5) withdrawal from treatment due to adverse effects and whether the planned medication regimen was modified in response to adverse effects; 6) completion of scheduled treatment. Important outcomes were: 1) cannabis use at the end of treatment; 2) number of participants engaged in further treatment; 3) economic outcomes. We assessed the risk of bias in results included in meta-analyses using the risk of bias 2 (RoB 2) tool. We synthesised results for each outcome using random-effect meta-analysis where possible. Where this was not possible due to the nature of the data, we reported results narratively. We used GRADE to assess the certainty of evidence. We included 37 RCTs (3201 participants). Most were undertaken in the USA (29), Australia (4), Israel (2), Canada (1) and the United Kingdom (1), mainly recruiting adults (mean age 22-41 years), with four studies only including young people (mean age 17-21 years). In 32 studies, most of the participants were male (56-92%). Five studies targeted participants with comorbidities (depression (2), bipolar disorder (1), and attention deficit hyperactivity disorder (1)). Eleven studies received study medicines from the manufacturing company and none were funded by pharmaceutical companies. Thirty-six studies compared active medications and placebo; one study compared four active medications. Medications were diverse, as were the outcomes reported, which limited the potential for synthesis. Abstinence at end of treatment was no more likely with Δ-tetrahydrocannabinol (THC) preparations (risk ratio (RR) 1.04, 95% CI 0.71 to 1.52; 4 studies, 290 participants; moderate-certainty evidence) or N-acetylcysteine (RR 1.17, 95% CI 0.73 to 1.88; 2 studies, 270 participants; moderate-certainty evidence), and may be no more likely with cannabidiol (RR 2.23, 95% CI 0.54 to 9.32; 1 study, 68 participants; low-certainty evidence) or with anticonvulsant and mood stabilisers (RR 1.23, 95% CI 0.52 to 2.92; 1 study, 29 participants; very low-certainty evidence), when compared with placebo, but the evidence is uncertain. AE and SAE. There was probably little to no difference in the likelihood of AEs in participants treated with THC preparations (RR 1.05, 95% CI 0.88 to 1.26; 5 studies, 507 participants), cannabidiol (RR 1.01, 95% CI 0.81 to 1.25; 2 studies, 57 participants), N-acetylcysteine (RR 0.82, 95% CI 0.63 to 1.07; 2 studies, 418 participants), PF-04457845 (RR 0.98, 95% CI 0.87 to 1.11; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with anticonvulsants and mood stabilisers (RR 0.96, 95% CI 0.81 to 1.13; 4 studies, 331 participants) or oxytocin (RR 0.50, 95% CI 0.06 to 4.47; 1 study, 16 participants) (both low-certainty evidence), compared with placebo. SAE may be no more likely with THC preparations (RR 0.99, 95% CI 0.25 to 3.9; 7 studies, 584 participants), N-acetylcysteine (RR 0.16, 95% CI 0.02 to 1.33; 2 studies, 418 participants), PF-04457845 (RR 4.83, 95% CI 0.23 to 99.48; 2 studies, 298 participants), compared with placebo (all low-certainty evidence). Withdrawal from treatment due to adverse effects was more likely with anticonvulsants and mood stabilisers (RR 2.88, 95% CI 1.05 to 7.86; 5 studies, 257 participants; very low-certainty evidence), but the evidence is uncertain. There may be little to no difference in the likelihood of withdrawal from treatment due to adverse effects with THC preparations (RR 1.77, 95%CI 0.4 to 7.85; 5 studies, 507 participants), N-acetylcysteine (RR 0.61, 95% CI 0.03 to 12.53; 2 studies, 418 participants) compared with placebo (both low-certainty evidence). We found that completion of treatment was probably not more likely with cannabidiol (RR 1.02, 95% CI 0.89 to 1.17; 2 studies, 92 participants), anticonvulsant and mood stabilisers (RR 0.86, 95% CI 0.72 to 1.03; 6 studies, 407 participants), N-acetylcysteine (RR 1.08, 95% CI 0.95 to 1.23; 2 studies, 418 participants), or PF-04457845 (RR 0.96, 95% CI 0.85 to 1.07; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with THC (RR 1.11, 95% CI 0.93 to 1.32; 7 studies, 582 participants; low-certainty evidence). There is incomplete evidence for all the clinically-important pharmacotherapies investigated and, for half of their outcomes, the quality of the evidence was low (44%) or very low (11%). Given the limited evidence of efficacy, those pharmacotherapies should still be considered experimental for treating cannabis use disorder. The greater withdrawal from treatment due to adverse effects seen with anticonvulsants and mood stabilisers may limit their therapeutic value. FS, TP, JS: Received funding from the National Institute for Health and Care Research to directly support the conduct of this review. SN: National Health and Medical Research Council to directly support her time in the conduct of this review. Protocol [and previous versions] available via DOI: 10.1002/14651858.CD008940 [DOI: 10.1002/14651858.CD008940.pub2 and DOI: 10.1002/14651858.CD008940.pub3].",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Globally, cannabis use is prevalent and widespread. There are currently no pharmacotherapies approved for the treatment of cannabis use disorder (a problematic pattern of cannabis use that leads to clinically significant impairment or distress). This is the second update of a Cochrane Review first published in the Cochrane Library in Issue 12, 2014."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effectiveness and safety of pharmacotherapies as compared with each other, placebo or no pharmacotherapy (supportive care) for reducing symptoms of cannabis withdrawal and promoting cessation or reduction of cannabis use."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We updated our searches of the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase and PsycINFO in May 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials (RCTs) and quasi-RCTs of medications to treat cannabis withdrawal and/or to promote cessation or reduction of cannabis use, in comparison with other medications, placebo or no medication in people diagnosed as cannabis dependent or who are likely to be dependent."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were: 1) abstinence at the end of treatment; 2) intensity of withdrawal including craving; 3) nature, incidence and frequency of adverse events (AE) and 4) severe AE (SAE); 5) withdrawal from treatment due to adverse effects and whether the planned medication regimen was modified in response to adverse effects; 6) completion of scheduled treatment. Important outcomes were: 1) cannabis use at the end of treatment; 2) number of participants engaged in further treatment; 3) economic outcomes."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed the risk of bias in results included in meta-analyses using the risk of bias 2 (RoB 2) tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesised results for each outcome using random-effect meta-analysis where possible. Where this was not possible due to the nature of the data, we reported results narratively. We used GRADE to assess the certainty of evidence."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 37 RCTs (3201 participants). Most were undertaken in the USA (29), Australia (4), Israel (2), Canada (1) and the United Kingdom (1), mainly recruiting adults (mean age 22-41 years), with four studies only including young people (mean age 17-21 years). In 32 studies, most of the participants were male (56-92%). Five studies targeted participants with comorbidities (depression (2), bipolar disorder (1), and attention deficit hyperactivity disorder (1)). Eleven studies received study medicines from the manufacturing company and none were funded by pharmaceutical companies. Thirty-six studies compared active medications and placebo; one study compared four active medications. Medications were diverse, as were the outcomes reported, which limited the potential for synthesis."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Abstinence at end of treatment was no more likely with Δ-tetrahydrocannabinol (THC) preparations (risk ratio (RR) 1.04, 95% CI 0.71 to 1.52; 4 studies, 290 participants; moderate-certainty evidence) or N-acetylcysteine (RR 1.17, 95% CI 0.73 to 1.88; 2 studies, 270 participants; moderate-certainty evidence), and may be no more likely with cannabidiol (RR 2.23, 95% CI 0.54 to 9.32; 1 study, 68 participants; low-certainty evidence) or with anticonvulsant and mood stabilisers (RR 1.23, 95% CI 0.52 to 2.92; 1 study, 29 participants; very low-certainty evidence), when compared with placebo, but the evidence is uncertain. AE and SAE. There was probably little to no difference in the likelihood of AEs in participants treated with THC preparations (RR 1.05, 95% CI 0.88 to 1.26; 5 studies, 507 participants), cannabidiol (RR 1.01, 95% CI 0.81 to 1.25; 2 studies, 57 participants), N-acetylcysteine (RR 0.82, 95% CI 0.63 to 1.07; 2 studies, 418 participants), PF-04457845 (RR 0.98, 95% CI 0.87 to 1.11; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with anticonvulsants and mood stabilisers (RR 0.96, 95% CI 0.81 to 1.13; 4 studies, 331 participants) or oxytocin (RR 0.50, 95% CI 0.06 to 4.47; 1 study, 16 participants) (both low-certainty evidence), compared with placebo. SAE may be no more likely with THC preparations (RR 0.99, 95% CI 0.25 to 3.9; 7 studies, 584 participants), N-acetylcysteine (RR 0.16, 95% CI 0.02 to 1.33; 2 studies, 418 participants), PF-04457845 (RR 4.83, 95% CI 0.23 to 99.48; 2 studies, 298 participants), compared with placebo (all low-certainty evidence). Withdrawal from treatment due to adverse effects was more likely with anticonvulsants and mood stabilisers (RR 2.88, 95% CI 1.05 to 7.86; 5 studies, 257 participants; very low-certainty evidence), but the evidence is uncertain. There may be little to no difference in the likelihood of withdrawal from treatment due to adverse effects with THC preparations (RR 1.77, 95%CI 0.4 to 7.85; 5 studies, 507 participants), N-acetylcysteine (RR 0.61, 95% CI 0.03 to 12.53; 2 studies, 418 participants) compared with placebo (both low-certainty evidence). We found that completion of treatment was probably not more likely with cannabidiol (RR 1.02, 95% CI 0.89 to 1.17; 2 studies, 92 participants), anticonvulsant and mood stabilisers (RR 0.86, 95% CI 0.72 to 1.03; 6 studies, 407 participants), N-acetylcysteine (RR 1.08, 95% CI 0.95 to 1.23; 2 studies, 418 participants), or PF-04457845 (RR 0.96, 95% CI 0.85 to 1.07; 2 studies, 298 participants) (all moderate-certainty evidence) and there may be little to no difference in participants treated with THC (RR 1.11, 95% CI 0.93 to 1.32; 7 studies, 582 participants; low-certainty evidence)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is incomplete evidence for all the clinically-important pharmacotherapies investigated and, for half of their outcomes, the quality of the evidence was low (44%) or very low (11%). Given the limited evidence of efficacy, those pharmacotherapies should still be considered experimental for treating cannabis use disorder. The greater withdrawal from treatment due to adverse effects seen with anticonvulsants and mood stabilisers may limit their therapeutic value."
        },
        {
          "label": "FUNDING",
          "text": "FS, TP, JS: Received funding from the National Institute for Health and Care Research to directly support the conduct of this review. SN: National Health and Medical Research Council to directly support her time in the conduct of this review."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol [and previous versions] available via DOI: 10.1002/14651858.CD008940 [DOI: 10.1002/14651858.CD008940.pub2 and DOI: 10.1002/14651858.CD008940.pub3]."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41025421/",
      "pubDate": "2025 Sep 30",
      "doi": "10.1002/14651858.CD008940.pub4",
      "dateReceived": "2025-10-25T23:21:48.008Z",
      "isNew": true,
      "summary": "Current pharmacotherapies for cannabis use disorder lack sufficient evidence of efficacy and should be considered experimental, with some potentially causing adverse effects that limit their usefulness."
    },
    {
      "id": "8b1557647e86",
      "title": "Progestagens for pain symptoms associated with endometriosis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gynecology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117932",
      "abstract": "Endometriosis is a hormone-sensitive inflammatory condition affecting between 5% and 10% of reproductive-aged women and an unknown number of gender-diverse individuals. It is often associated with debilitating pelvic pain symptoms. Various formulations of progestagens (e.g. oral, depot, implantable) have been studied as potential treatments for endometriosis because they induce atrophy of endometrial tissue. To determine the benefits and harms of progestagens in the treatment of endometriosis-associated pain symptoms. We searched CENTRAL, MEDLINE, Embase, and PsycINFO on 29 October 2024 without language restrictions. We included randomised controlled trials (RCTs) comparing progestagens for symptomatic endometriosis against placebo, other medications, or different doses of progestagens. Studies assessing the levonorgestrel-releasing intrauterine device were ineligible, as a separate Cochrane review covers this intervention. Participants were of reproductive age with a laparoscopic diagnosis of endometriosis and associated pain symptoms. Primary outcomes included endometriosis-associated pain symptoms (overall pain, pelvic pain, and dysmenorrhoea). Secondary outcomes included quality of life, patient satisfaction, and adverse effects. At least two review authors independently selected studies, extracted data, and assessed risk of bias. We reported dichotomous outcomes as risk ratios (RRs) and continuous outcomes as mean differences (MDs), each with its corresponding 95% confidence interval (CI). The meta-analysis employed a fixed-effect model, and we assessed statistical heterogeneity using the I statistic. We used GRADE to assess evidence certainty. We included 33 RCTs involving 5059 participants with symptomatic, laparoscopically diagnosed endometriosis. We judged 13 studies at overall low risk of bias. The following comparisons are limited by the small number of studies reporting each outcome. Pain outcomes, quality of life, and patient satisfaction were measured at six months unless otherwise specified. Oral progestagens versus placebo or no treatment (8 studies) Oral progestagens compared with placebo probably reduce overall pain measured on a visual analogue scale (VAS; MD -2.58, 95% CI -3.13 to -2.03; moderate certainty), and probably reduce dysmenorrhoea at three months (RR 0.21, 95% CI 0.07 to 0.70, moderate certainty), but may have little to no effect on pelvic pain at three months (RR 0.7, 95% CI 0.29 to 1.69; low certainty). Oral progestagens improve quality of life (SF-36 score; MD 4.11, 95% CI 2.41 to 5.82, high certainty). There is probably little to no difference between the interventions in study withdrawal due to adverse effects (RR 2.36, CI 0.74 to 7.52, moderate certainty) and cumulative side effects (RR 1.18, 95% CI 0.94 to 1.46, moderate certainty). Oral progestagens versus oral contraceptives (4 studies) Oral progestagens compared with oral contraceptives probably have little to no effect on pelvic pain measured on a VAS (MD 0.38, 95% CI -0.46 to 1.22, moderate certainty). There was very low-certainty evidence about their effect on dysmenorrhoea at 12 months (MD -0.57, 95% CI -1.29 to 0.15), quality of life (SF-36 general health perception; MD 5.2, 95% CI -1.3 to 11.70), and patient satisfaction (RR 1.18, 95% CI 0.88 to 1.57). Oral progestagens may lead to better quality of life (SF-36 pain score; MD 11.5, 95% CI 2.35 to 20.65, low certainty). There may be little to no difference between oral progestagens and oral contraceptives in study withdrawal due to adverse effects (RR 0.75, 95% CI 0.27 to 2.07, low certainty), and there is probably little to no difference in cumulative side effects (RR 1.13, 95% CI 0.8 to 1.60, moderate certainty). Oral progestagens versus gonadotropin-releasing hormone (GnRH) agonists (10 studies) Oral progestagens compared with GnRH agonists may have little to no effect on overall pain measured on a VAS (MD -0.01, 95% CI -0.30 to 0.28), risk of pelvic pain (RR 1.12, 95% CI 0.80 to 1.59), dysmenorrhoea (RR 1.45, 95% CI 0.71 to 3.00), SF-36 physical health score (MD 0.40, 95% CI -1.58 to 2.38), SF-36 mental health score (MD -0.50, 95% CI -3.75 to 2.75), patient satisfaction (RR 1.08, 95% CI 0.92 to 1.26), and study withdrawal due to adverse effects (RR 0.9, 95% CI 0.34 to 2.43). All these outcomes had low-certainty evidence. The risk of cumulative side effects was probably higher with oral progestagens (RR 1.44, 95% CI 1.11 to 1.86, moderate certainty). Depot progestagens versus GnRH agonists (2 studies) Depot progestagens compared with GnRH agonists reduce dysmenorrhoea risk slightly (RR 0.93, 95% CI 0.89 to 0.97, high certainty) but may have little to no effect on pelvic pain (RR 0.96, 95% CI 0.87 to 1.07, low certainty). The interventions may be similar in study withdrawal due to adverse effects (RR 1.41, 95% CI 0.24 to 8.32, low certainty), but the risk of cumulative side effects is probably lower with depot progestagens (RR 0.03, 95% CI 0.01 to 0.11, moderate certainty). Depot progestagens versus GnRH antagonist (1 study) Depot progestagens compared with GNRH agonists may have little to no effect on pelvic pain (RR 0.85, 95% CI 0.7 to 1.03, low certainty), dysmenorrhoea (RR 0.85, 95% CI 0.7 to 1.03, low certainty), and cumulative adverse effects (RR 1.04, 0.95 to 1.14, low certainty). Study withdrawal due to side effects is likely higher with depot progestagens (RR 2.02, 95% CI 1.04 to 3.94, moderate certainty). Depot progestagens versus the etonogestrel implant (1 study) There was very low-certainty evidence about the effect of depot progestagens versus the etonogestrel implant on overall pain measured on a VAS (MD 0.80, 95% CI - 0.42 to 2.02), patient satisfaction (RR 0.96, 95% CI 0.56 to 1.66), and study withdrawal due to adverse effects (RR 1.84, 95% CI 0.63 to 5.33). In individuals with endometriosis, oral progestagens compared with placebo likely reduce overall pain and dysmenorrhoea and may reduce pelvic pain. Compared with other hormonal suppression strategies, the evidence is less certain due to the small number of studies for each comparison and outcome. Despite such limitations, this update provides a comprehensive overview and valuable insights on progestagen treatment for endometriosis, emphasising the nuanced balance between efficacy, adverse effects, and patient satisfaction.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Endometriosis is a hormone-sensitive inflammatory condition affecting between 5% and 10% of reproductive-aged women and an unknown number of gender-diverse individuals. It is often associated with debilitating pelvic pain symptoms. Various formulations of progestagens (e.g. oral, depot, implantable) have been studied as potential treatments for endometriosis because they induce atrophy of endometrial tissue."
        },
        {
          "label": "OBJECTIVES",
          "text": "To determine the benefits and harms of progestagens in the treatment of endometriosis-associated pain symptoms."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, and PsycINFO on 29 October 2024 without language restrictions."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCTs) comparing progestagens for symptomatic endometriosis against placebo, other medications, or different doses of progestagens. Studies assessing the levonorgestrel-releasing intrauterine device were ineligible, as a separate Cochrane review covers this intervention. Participants were of reproductive age with a laparoscopic diagnosis of endometriosis and associated pain symptoms. Primary outcomes included endometriosis-associated pain symptoms (overall pain, pelvic pain, and dysmenorrhoea). Secondary outcomes included quality of life, patient satisfaction, and adverse effects."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "At least two review authors independently selected studies, extracted data, and assessed risk of bias. We reported dichotomous outcomes as risk ratios (RRs) and continuous outcomes as mean differences (MDs), each with its corresponding 95% confidence interval (CI). The meta-analysis employed a fixed-effect model, and we assessed statistical heterogeneity using the I statistic. We used GRADE to assess evidence certainty."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 33 RCTs involving 5059 participants with symptomatic, laparoscopically diagnosed endometriosis. We judged 13 studies at overall low risk of bias. The following comparisons are limited by the small number of studies reporting each outcome. Pain outcomes, quality of life, and patient satisfaction were measured at six months unless otherwise specified. Oral progestagens versus placebo or no treatment (8 studies) Oral progestagens compared with placebo probably reduce overall pain measured on a visual analogue scale (VAS; MD -2.58, 95% CI -3.13 to -2.03; moderate certainty), and probably reduce dysmenorrhoea at three months (RR 0.21, 95% CI 0.07 to 0.70, moderate certainty), but may have little to no effect on pelvic pain at three months (RR 0.7, 95% CI 0.29 to 1.69; low certainty). Oral progestagens improve quality of life (SF-36 score; MD 4.11, 95% CI 2.41 to 5.82, high certainty). There is probably little to no difference between the interventions in study withdrawal due to adverse effects (RR 2.36, CI 0.74 to 7.52, moderate certainty) and cumulative side effects (RR 1.18, 95% CI 0.94 to 1.46, moderate certainty). Oral progestagens versus oral contraceptives (4 studies) Oral progestagens compared with oral contraceptives probably have little to no effect on pelvic pain measured on a VAS (MD 0.38, 95% CI -0.46 to 1.22, moderate certainty). There was very low-certainty evidence about their effect on dysmenorrhoea at 12 months (MD -0.57, 95% CI -1.29 to 0.15), quality of life (SF-36 general health perception; MD 5.2, 95% CI -1.3 to 11.70), and patient satisfaction (RR 1.18, 95% CI 0.88 to 1.57). Oral progestagens may lead to better quality of life (SF-36 pain score; MD 11.5, 95% CI 2.35 to 20.65, low certainty). There may be little to no difference between oral progestagens and oral contraceptives in study withdrawal due to adverse effects (RR 0.75, 95% CI 0.27 to 2.07, low certainty), and there is probably little to no difference in cumulative side effects (RR 1.13, 95% CI 0.8 to 1.60, moderate certainty). Oral progestagens versus gonadotropin-releasing hormone (GnRH) agonists (10 studies) Oral progestagens compared with GnRH agonists may have little to no effect on overall pain measured on a VAS (MD -0.01, 95% CI -0.30 to 0.28), risk of pelvic pain (RR 1.12, 95% CI 0.80 to 1.59), dysmenorrhoea (RR 1.45, 95% CI 0.71 to 3.00), SF-36 physical health score (MD 0.40, 95% CI -1.58 to 2.38), SF-36 mental health score (MD -0.50, 95% CI -3.75 to 2.75), patient satisfaction (RR 1.08, 95% CI 0.92 to 1.26), and study withdrawal due to adverse effects (RR 0.9, 95% CI 0.34 to 2.43). All these outcomes had low-certainty evidence. The risk of cumulative side effects was probably higher with oral progestagens (RR 1.44, 95% CI 1.11 to 1.86, moderate certainty). Depot progestagens versus GnRH agonists (2 studies) Depot progestagens compared with GnRH agonists reduce dysmenorrhoea risk slightly (RR 0.93, 95% CI 0.89 to 0.97, high certainty) but may have little to no effect on pelvic pain (RR 0.96, 95% CI 0.87 to 1.07, low certainty). The interventions may be similar in study withdrawal due to adverse effects (RR 1.41, 95% CI 0.24 to 8.32, low certainty), but the risk of cumulative side effects is probably lower with depot progestagens (RR 0.03, 95% CI 0.01 to 0.11, moderate certainty). Depot progestagens versus GnRH antagonist (1 study) Depot progestagens compared with GNRH agonists may have little to no effect on pelvic pain (RR 0.85, 95% CI 0.7 to 1.03, low certainty), dysmenorrhoea (RR 0.85, 95% CI 0.7 to 1.03, low certainty), and cumulative adverse effects (RR 1.04, 0.95 to 1.14, low certainty). Study withdrawal due to side effects is likely higher with depot progestagens (RR 2.02, 95% CI 1.04 to 3.94, moderate certainty). Depot progestagens versus the etonogestrel implant (1 study) There was very low-certainty evidence about the effect of depot progestagens versus the etonogestrel implant on overall pain measured on a VAS (MD 0.80, 95% CI - 0.42 to 2.02), patient satisfaction (RR 0.96, 95% CI 0.56 to 1.66), and study withdrawal due to adverse effects (RR 1.84, 95% CI 0.63 to 5.33)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In individuals with endometriosis, oral progestagens compared with placebo likely reduce overall pain and dysmenorrhoea and may reduce pelvic pain. Compared with other hormonal suppression strategies, the evidence is less certain due to the small number of studies for each comparison and outcome. Despite such limitations, this update provides a comprehensive overview and valuable insights on progestagen treatment for endometriosis, emphasising the nuanced balance between efficacy, adverse effects, and patient satisfaction."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41065045/",
      "pubDate": "2025 Oct 09",
      "doi": "10.1002/14651858.CD002122.pub3",
      "dateReceived": "2025-10-25T23:21:48.007Z",
      "isNew": true,
      "summary": "Oral progestagens are likely effective for reducing pain and dysmenorrhea in individuals with endometriosis."
    },
    {
      "id": "171e80714bc6",
      "title": "Modest Effects of Intensive Blood Pressure-Lowering on Quality of Life in Patients at High Cardiovascular Risk: The ESPRIT trial.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48639951/117921",
      "abstract": "Cumulative evidence supports the beneficial effects of intensive blood pressure (BP)-lowering treatment to prevent cardiovascular events and death; however, the effects of a more aggressive BP target on health-related quality of life (HRQoL) remain unclear. This study aimed to compare the effects of intensive vs standard BP-lowering treatment strategies on long-term change in HRQoL among hypertensive patients with high cardiovascular risk. The ESPRIT (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events) trial was an open-label, blinded-outcome, randomized controlled trial. Participants were randomly assigned to receive either intensive BP-lowering treatment (targeting standard office systolic blood pressure [SBP] to <120 mm Hg) or standard BP-lowering treatment (targeting office SBP to <140 mm Hg). HRQoL was assessed by using the 5-level EuroQol Five Dimensions Questionnaire (EQ-5D-5L) at baseline and the final follow-up visit. Covariance analyses were applied to evaluate the effect of treatment assignment on changes in HRQoL. The current study included 5,398 participants in the intensive treatment group and 5,406 participants in the standard treatment group. Over 3.4 years of follow-up, the EQ-5D visual analog scale scores increased by 0.56 point in the intensive treatment group and decreased by 0.50 point in the standard treatment group, resulting in a mean difference of 1.26 (95% CI: 0.55 to 1.98; P < 0.001). Compared with the standard treatment, the intensive treatment was associated with a 16% higher likelihood of meaningful improvement than worsening in EQ-5D visual analog scale (relative risk: 1.16; 95% CI: 1.04-1.30; P = 0.007). Categorical changes from baseline to the final follow-up visit in 5 domains between the 2 groups showed no statistical differences. Intensive BP treatment, targeting office SBP to <120 mm Hg, produced modest benefits to HRQoL among hypertensive patients with high cardiovascular risk. (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events [ESPRIT]; NCT04030234).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cumulative evidence supports the beneficial effects of intensive blood pressure (BP)-lowering treatment to prevent cardiovascular events and death; however, the effects of a more aggressive BP target on health-related quality of life (HRQoL) remain unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study aimed to compare the effects of intensive vs standard BP-lowering treatment strategies on long-term change in HRQoL among hypertensive patients with high cardiovascular risk."
        },
        {
          "label": "METHODS",
          "text": "The ESPRIT (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events) trial was an open-label, blinded-outcome, randomized controlled trial. Participants were randomly assigned to receive either intensive BP-lowering treatment (targeting standard office systolic blood pressure [SBP] to <120 mm Hg) or standard BP-lowering treatment (targeting office SBP to <140 mm Hg). HRQoL was assessed by using the 5-level EuroQol Five Dimensions Questionnaire (EQ-5D-5L) at baseline and the final follow-up visit. Covariance analyses were applied to evaluate the effect of treatment assignment on changes in HRQoL."
        },
        {
          "label": "RESULTS",
          "text": "The current study included 5,398 participants in the intensive treatment group and 5,406 participants in the standard treatment group. Over 3.4 years of follow-up, the EQ-5D visual analog scale scores increased by 0.56 point in the intensive treatment group and decreased by 0.50 point in the standard treatment group, resulting in a mean difference of 1.26 (95% CI: 0.55 to 1.98; P < 0.001). Compared with the standard treatment, the intensive treatment was associated with a 16% higher likelihood of meaningful improvement than worsening in EQ-5D visual analog scale (relative risk: 1.16; 95% CI: 1.04-1.30; P = 0.007). Categorical changes from baseline to the final follow-up visit in 5 domains between the 2 groups showed no statistical differences."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Intensive BP treatment, targeting office SBP to <120 mm Hg, produced modest benefits to HRQoL among hypertensive patients with high cardiovascular risk. (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events [ESPRIT]; NCT04030234)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41105075/",
      "pubDate": "2025 Jul 25",
      "doi": "10.1016/j.jacc.2025.06.010",
      "dateReceived": "2025-10-24T23:23:08.857Z",
      "isNew": true,
      "summary": "Intensive blood pressure lowering to below 120 mm Hg in hypertensive patients with high cardiovascular risk showed small improvements in health-related quality of life."
    },
    {
      "id": "d4754eb7f29d",
      "title": "SGLT2 Inhibitors in Older Adults With Cardiovascular Disease: A Systematic Review and Meta-Analysis.",
      "journal": "J Am Geriatr Soc",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48555079/117854",
      "abstract": "Sodium-glucose cotransporter-2 (SGLT2) inhibitors, developed for type 2 diabetes mellitus (T2DM), have demonstrated cardiorenal benefits in conditions including cardiovascular (CV) disease. However, few meta-analyses have synthesized outcomes in older adults with CV disease. A systematic review and meta-analysis of randomized controlled trials published from January 2015 to January 2025 was conducted using MEDLINE (PubMed), Embase (Ovid), and CENTRAL. We included studies that reported the risk of CV outcomes for subgroups of older adults (≥ 65 years) with CV disease. The primary outcome was a composite of hospitalization for heart failure (HHF), urgent heart failure (HF) visits, and cardiovascular death (CVD). Secondary outcomes included all-cause mortality, CVD, and HHF individually. Subgroup analyses were conducted in patients with HF, T2DM, age strata (65-74 vs. ≥ 75), SGLT2 inhibitor agent, and adverse events. Analyzing nine studies, SGLT2 inhibitors were associated with reducing the risk of composite outcome (HR: 0.75, 95% CI: 0.67-0.83, I = 51%), all-cause mortality (HR: 0.80, 95% CI: 0.66-0.97, I = 68%), CVD (HR: 0.78, 95% CI: 0.65-0.94, I = 61%), and HHF (HR: 0.73, 95% CI: 0.65-0.83, I = 0%). Benefits were consistent in subgroups of HF only, T2DM only, and those aged ≥ 75 years. No significant differences were observed by SGLT2 inhibitor type (p = 0.090). SGLT2 inhibitors increased the risk of genital infections (RR: 3.18, 95% CI: 2.35-4.30, I = 0%) but decreased that of other serious adverse events (RR: 0.92, 95% CI: 0.86-0.97, I = 64%). In adults aged ≥ 65 years with CV disease, SGLT2 inhibitors significantly reduce the composite risk of HHF, urgent HF visits, and CVD and secondary outcomes of all-cause mortality, CVD, and HHF, supporting their use in this population with careful monitoring of age-related risks.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Sodium-glucose cotransporter-2 (SGLT2) inhibitors, developed for type 2 diabetes mellitus (T2DM), have demonstrated cardiorenal benefits in conditions including cardiovascular (CV) disease. However, few meta-analyses have synthesized outcomes in older adults with CV disease."
        },
        {
          "label": "METHODS",
          "text": "A systematic review and meta-analysis of randomized controlled trials published from January 2015 to January 2025 was conducted using MEDLINE (PubMed), Embase (Ovid), and CENTRAL. We included studies that reported the risk of CV outcomes for subgroups of older adults (≥ 65 years) with CV disease. The primary outcome was a composite of hospitalization for heart failure (HHF), urgent heart failure (HF) visits, and cardiovascular death (CVD). Secondary outcomes included all-cause mortality, CVD, and HHF individually. Subgroup analyses were conducted in patients with HF, T2DM, age strata (65-74 vs. ≥ 75), SGLT2 inhibitor agent, and adverse events."
        },
        {
          "label": "RESULTS",
          "text": "Analyzing nine studies, SGLT2 inhibitors were associated with reducing the risk of composite outcome (HR: 0.75, 95% CI: 0.67-0.83, I = 51%), all-cause mortality (HR: 0.80, 95% CI: 0.66-0.97, I = 68%), CVD (HR: 0.78, 95% CI: 0.65-0.94, I = 61%), and HHF (HR: 0.73, 95% CI: 0.65-0.83, I = 0%). Benefits were consistent in subgroups of HF only, T2DM only, and those aged ≥ 75 years. No significant differences were observed by SGLT2 inhibitor type (p = 0.090). SGLT2 inhibitors increased the risk of genital infections (RR: 3.18, 95% CI: 2.35-4.30, I = 0%) but decreased that of other serious adverse events (RR: 0.92, 95% CI: 0.86-0.97, I = 64%)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In adults aged ≥ 65 years with CV disease, SGLT2 inhibitors significantly reduce the composite risk of HHF, urgent HF visits, and CVD and secondary outcomes of all-cause mortality, CVD, and HHF, supporting their use in this population with careful monitoring of age-related risks."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41054314/",
      "pubDate": "2025 Oct 07",
      "doi": "10.1111/jgs.70143",
      "dateReceived": "2025-10-24T23:23:08.857Z",
      "isNew": true,
      "summary": "SGLT2 inhibitors effectively reduce heart failure and cardiovascular risks, including death, in older adults with cardiovascular disease."
    },
    {
      "id": "1c6f7e6d7d71",
      "title": "Adverse Events Following Short-Course Systemic Corticosteroids Among Children and Adolescents: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48555079/117810",
      "abstract": "Short courses of systemic corticosteroids are used in the management of a number of acute clinical conditions, including Bell palsy, croup, and pneumonia, but research on associations of corticosteroid use with adverse events (AEs) in children is limited. To document AEs associated with short-term (≤14 days) use of systemic corticosteroids in children and adolescents (1 to younger than 18 years) across different clinical conditions. MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) databases were searched from inception to February 2025. Reference lists of eligible articles and related systematic reviews were also searched. Randomized clinical trials evaluating AEs (any unfavorable and unintended signs, symptoms, or syndromes that occurred during the period of using an investigational product) after use of short-course systemic corticosteroids in children and adolescents were included. Using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guideline, pairs of reviewers independently reviewed abstracts, extracted data, and assessed risk of bias of eligible trials. Pairwise, fixed-effects meta-analyses were performed using Mantel-Haenszel methods with risk difference (RD). The primary outcomes were serious AEs (events resulting in death, life-threatening conditions, hospitalization, or substantial disability), AEs leading to discontinuation, hyperglycemia, sleep disturbances, change in behavior, and gastrointestinal bleeding. RDs were reported as AEs per 1000 patients with 95% CIs. The Grading of Recommendations Assessment, Development and Evaluation approach was used to assess the certainty of evidence (high, moderate, low, or very low certainty). A total of 45 eligible trials that included 6470 children (mean [SD] age, 5.57 [3.62] years; 3753 male [58%]) were identified. In pooled analysis, there was moderate certainty evidence that compared with usual care, corticosteroids were not associated with serious AEs (RD, 1 fewer AE per 1000 patients [95% CI], 9 fewer to 7 more AEs per 1000 patients]), AEs leading to discontinuation (RD, 4 more AEs per 1000 patients [95% CI, 3 fewer to 11 more AEs per 1000 patients]), or change in behavior (RD, 8 more AEs per 1000 patients [95% CI, 5 fewer to 21 more AEs per 1000 patients]). With moderate certainty evidence, corticosteroids were associated with an increased risk of hyperglycemia (RD, 38 more AEs per 1000 patients [95% CI, 11 to 64 more AEs per 1000 patients]) and sleep problems (RD, 15 more AEs per 1000 patients [95% CI, 1 to 28 more AEs per 1000 patients]). Corticosteroid use was also associated with an increased risk of gastrointestinal bleeding (RD, 13 more per AEs per 1000 patients [95% CI, 3 to 23 more AEs per 1000 patients]), but the certainty of evidence was low. In this systematic review and meta-analysis of randomized trials, there was moderate certainty evidence that corticosteroids were associated with an increased risk of hyperglycemia and sleep problems and low certainty evidence that corticosteroids were associated with increased risk of gastrointestinal bleeding, but these AEs were very seldom serious. These findings suggest that an individualized approach to short-term corticosteroid use may be warranted and that further research is needed to obtain better quality of evidence.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Short courses of systemic corticosteroids are used in the management of a number of acute clinical conditions, including Bell palsy, croup, and pneumonia, but research on associations of corticosteroid use with adverse events (AEs) in children is limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To document AEs associated with short-term (≤14 days) use of systemic corticosteroids in children and adolescents (1 to younger than 18 years) across different clinical conditions."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) databases were searched from inception to February 2025. Reference lists of eligible articles and related systematic reviews were also searched."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Randomized clinical trials evaluating AEs (any unfavorable and unintended signs, symptoms, or syndromes that occurred during the period of using an investigational product) after use of short-course systemic corticosteroids in children and adolescents were included."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guideline, pairs of reviewers independently reviewed abstracts, extracted data, and assessed risk of bias of eligible trials. Pairwise, fixed-effects meta-analyses were performed using Mantel-Haenszel methods with risk difference (RD)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were serious AEs (events resulting in death, life-threatening conditions, hospitalization, or substantial disability), AEs leading to discontinuation, hyperglycemia, sleep disturbances, change in behavior, and gastrointestinal bleeding. RDs were reported as AEs per 1000 patients with 95% CIs. The Grading of Recommendations Assessment, Development and Evaluation approach was used to assess the certainty of evidence (high, moderate, low, or very low certainty)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 45 eligible trials that included 6470 children (mean [SD] age, 5.57 [3.62] years; 3753 male [58%]) were identified. In pooled analysis, there was moderate certainty evidence that compared with usual care, corticosteroids were not associated with serious AEs (RD, 1 fewer AE per 1000 patients [95% CI], 9 fewer to 7 more AEs per 1000 patients]), AEs leading to discontinuation (RD, 4 more AEs per 1000 patients [95% CI, 3 fewer to 11 more AEs per 1000 patients]), or change in behavior (RD, 8 more AEs per 1000 patients [95% CI, 5 fewer to 21 more AEs per 1000 patients]). With moderate certainty evidence, corticosteroids were associated with an increased risk of hyperglycemia (RD, 38 more AEs per 1000 patients [95% CI, 11 to 64 more AEs per 1000 patients]) and sleep problems (RD, 15 more AEs per 1000 patients [95% CI, 1 to 28 more AEs per 1000 patients]). Corticosteroid use was also associated with an increased risk of gastrointestinal bleeding (RD, 13 more per AEs per 1000 patients [95% CI, 3 to 23 more AEs per 1000 patients]), but the certainty of evidence was low."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis of randomized trials, there was moderate certainty evidence that corticosteroids were associated with an increased risk of hyperglycemia and sleep problems and low certainty evidence that corticosteroids were associated with increased risk of gastrointestinal bleeding, but these AEs were very seldom serious. These findings suggest that an individualized approach to short-term corticosteroid use may be warranted and that further research is needed to obtain better quality of evidence."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41026484/",
      "pubDate": "2025 Sep 02",
      "doi": "10.1001/jamanetworkopen.2025.34953",
      "dateReceived": "2025-10-24T23:23:08.857Z",
      "isNew": true,
      "summary": "Corticosteroids are associated with increased risks of hyperglycemia, sleep problems, and possibly gastrointestinal bleeding, though serious adverse events are rare, suggesting a need for individualized use and further research."
    },
    {
      "id": "d5f368b6240f",
      "title": "Effectiveness and Safety of Postoperative Medical Treatments Following Fertility-Preserving Surgery for Endometriosis: A Network Meta-Analysis.",
      "journal": "BJOG",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48555079/117804",
      "abstract": "Endometriosis (EMs) is a common gynaecological condition with high recurrence rates after fertility-preserving laparoscopic surgery, and optimal postoperative medical treatment remains unclear. To evaluate the efficacy and safety of various postoperative medical treatments in reducing recurrence, pain and adverse events in EMs patients after fertility-preserving surgery. PubMed, Web of Science, CENTRAL and Embase databases searched until August 1, 2024. Randomised controlled trials (RCTs) involving women aged 20-45 years post-fertility-preserving laparoscopic surgery, comparing single postoperative medications with a minimum follow-up of 2 months. Two reviewers independently extracted data and assessed quality using ROB 2.0 and CINeMA. Bayesian network meta-analysis calculated odds ratios (OR) and mean differences (MD) for recurrence rates, VAS pain reduction and adverse events. Sixteen RCTs (n = 1605 participants) evaluated 10 drugs: danazol, desogestrel, dienogest, gestrinone, goserelin, leuprolide, LNG-IUS, medroxyprogesterone, oral contraceptives and triptorelin. Only LNG-IUS significantly reduced recurrence rates (OR 0.12, 95% CI 0.02-0.63) and showed the greatest reduction in VAS pain scores (MD -24.96, 95% CI -41.76 to -8.75). Danazol significantly increased weight gain, and goserelin increased hot flashes. LNG-IUS combined with laparoscopic surgery appears most effective in reducing recurrence and pain in EMs patients. Danazol and goserelin should be used cautiously due to notable adverse effects.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Endometriosis (EMs) is a common gynaecological condition with high recurrence rates after fertility-preserving laparoscopic surgery, and optimal postoperative medical treatment remains unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the efficacy and safety of various postoperative medical treatments in reducing recurrence, pain and adverse events in EMs patients after fertility-preserving surgery."
        },
        {
          "label": "SEARCH STRATEGY",
          "text": "PubMed, Web of Science, CENTRAL and Embase databases searched until August 1, 2024."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "Randomised controlled trials (RCTs) involving women aged 20-45 years post-fertility-preserving laparoscopic surgery, comparing single postoperative medications with a minimum follow-up of 2 months."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Two reviewers independently extracted data and assessed quality using ROB 2.0 and CINeMA. Bayesian network meta-analysis calculated odds ratios (OR) and mean differences (MD) for recurrence rates, VAS pain reduction and adverse events."
        },
        {
          "label": "MAIN RESULTS",
          "text": "Sixteen RCTs (n = 1605 participants) evaluated 10 drugs: danazol, desogestrel, dienogest, gestrinone, goserelin, leuprolide, LNG-IUS, medroxyprogesterone, oral contraceptives and triptorelin. Only LNG-IUS significantly reduced recurrence rates (OR 0.12, 95% CI 0.02-0.63) and showed the greatest reduction in VAS pain scores (MD -24.96, 95% CI -41.76 to -8.75). Danazol significantly increased weight gain, and goserelin increased hot flashes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "LNG-IUS combined with laparoscopic surgery appears most effective in reducing recurrence and pain in EMs patients. Danazol and goserelin should be used cautiously due to notable adverse effects."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41017486/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1111/1471-0528.70016",
      "dateReceived": "2025-10-24T23:23:08.857Z",
      "isNew": true,
      "summary": "For endometriosis patients, a levonorgestrel-releasing intrauterine system (LNG-IUS) combined with laparoscopic surgery is the most effective treatment for reducing recurrence and pain, while danazol and goserelin should be used with caution due to significant side effects."
    },
    {
      "id": "cacda27f6dc8",
      "title": "Effectiveness of SARS-CoV-2 testing strategies inreducing COVID-19 cases, hospitalisations, and deaths.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48626885/117875",
      "abstract": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has substantially affected daily life. Sustainable testing practices are essential to balance the resource demands of widespread testing with the need to reduce the health impacts of COVID-19. However, the effectiveness of specific testing strategies for symptomatic and asymptomatic individuals in reducing COVID-19 cases, hospitalisations, and deaths remains uncertain. To evaluate the effectiveness of different SARS-CoV-2 testing strategies in reducing COVID-19 cases, hospitalisations, and deaths amongst suspected cases and asymptomatic individuals. We searched CENTRAL, MEDLINE (Ovid), Embase (Elsevier), Europe PMC, ClinicalTrials.gov, and the World Health Organization (WHO) International Clinical Trials Registry Platform. We also conducted reference checks, citation searches, and contacted study authors to identify eligible studies. The most recent search was conducted on 07 October 2024. We included randomised controlled trials (RCTs), non-randomised studies of interventions (NRSIs), controlled before-and-after studies (CBA), matched cohort studies, and observational studies with a comparison group involving suspected or asymptomatic individuals. Eligible studies compared testing strategy versus no testing or standard care or usual practice; one testing strategy with another, such as antigen-detecting rapid diagnostic tests (RDTs) versus nucleic acid amplification testing (NAAT), including reverse transcription polymerase chain reaction (RT-PCR); home-based versus provider-administered testing; one-time testing versus repeated testing at different frequencies; and targeted testing versus widespread testing. Combinations of these components were also considered. In this review, we define 'SARS-CoV-2 testing strategy' as a complex intervention comprising multiple varying components, including test type (e.g. NAAT, antigen-detecting RDT), sample type (e.g. nasopharyngeal swab, saliva), target population (e.g. symptomatic, contacts), setting (e.g. home, clinic, congregate), frequency of testing (e.g. one-time, weekly, daily), and response protocol (e.g. isolation, confirmatory testing, treatment). We excluded single-arm studies, reviews, theses, editorials, letters, commentaries, studies reported solely in abstract form, laboratory or animal studies, mathematical modelling studies, and diagnostic test accuracy studies. Our critical outcomes were: COVID-19 cases avoided (reduction in new cases); COVID-19-related hospitalisations avoided (reduction in hospital admissions); COVID-19-related deaths avoided (reduction in mortality); and serious adverse events related to testing, including unnecessary interventions, employment impacts, isolation effects, and psychological harms. We used the Risk of bias 2 (RoB 2) tool to assess the risk of bias in RCTs and the ROBINS-I tool to assess the risk of bias in NRSIs, CBA studies, and matched cohort studies. As a meta-analysis was not feasible due to the nature of the data, we applied Synthesis Without Meta-analysis (SWiM) methods. We assessed the certainty of the evidence for each outcome using the GRADE approach. We included 21 studies (10 RCTs and 11 NRSIs) with 13,312,327 participants. Among these, 13 studies-comprising eight RCTs and five NRSIs-either reported one or more prespecified outcomes (four studies), provided relevant information through proxy measurements (five studies), or supplied information following author correspondence (four studies). We present the prioritised comparisons and critical outcomes. For the comparison testing strategy versus no testing or standard care or usual practice, one included study measured two critical outcomes. The study did not measure the other critical outcomes: COVID-19 cases avoided, and serious adverse events related to testing. No studies measured any critical outcomes for the other prioritised comparison: antigen-detecting RDT versus NAAT testing. Benefits and harms of testing strategy versus no testing or standard care or usual practice One observational study with a comparison group, conducted in a long-term care facility in Israel, compared weekly SARS-CoV-2 RT-PCR testing with no testing and measured two of our critical outcomes. Based on the analysis, the evidence is very uncertain about the effect of SARS-CoV-2 RT-PCR testing on reducing hospitalisation (decrease in the hospitalisation rate from 13.59% to 11.41%; 1 study, 162,205 participants, very low-certainty evidence) and mortality (33.8% decrease in expected mortality; 1 study, 162,205 participants, very low-certainty evidence) compared to no testing. We downgraded the certainty of the evidence because of methodological limitations, indirectness, and imprecision. The available data are of very low-certainty. Only one of the 21 included studies reported hospitalisations or deaths; therefore, we cannot draw conclusions about the effects of testing strategy versus no testing on reducing hospitalisation and mortality. No studies evaluated other critical outcomes i.e. COVID-19 cases avoided, and serious adverse events related to testing. Future research should aim for consistency and relevance by using clearly defined outcomes, preferably based on a standardised core outcome set. A qualitative evidence synthesis (QES) would help identify barriers and facilitators to routine SARS-CoV-2 testing in healthcare settings, which could help inform intervention development. The QES would explore factors affecting the implementation of routine testing, drawing on the perspectives of healthcare providers, patients, and other interest holders. This Cochrane review was partially funded by the World Health Organization (WHO) and the Health Research Board of Ireland. Protocol (2025) DOI: 10.1002/14651858.CD016192.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has substantially affected daily life. Sustainable testing practices are essential to balance the resource demands of widespread testing with the need to reduce the health impacts of COVID-19. However, the effectiveness of specific testing strategies for symptomatic and asymptomatic individuals in reducing COVID-19 cases, hospitalisations, and deaths remains uncertain."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the effectiveness of different SARS-CoV-2 testing strategies in reducing COVID-19 cases, hospitalisations, and deaths amongst suspected cases and asymptomatic individuals."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE (Ovid), Embase (Elsevier), Europe PMC, ClinicalTrials.gov, and the World Health Organization (WHO) International Clinical Trials Registry Platform. We also conducted reference checks, citation searches, and contacted study authors to identify eligible studies. The most recent search was conducted on 07 October 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs), non-randomised studies of interventions (NRSIs), controlled before-and-after studies (CBA), matched cohort studies, and observational studies with a comparison group involving suspected or asymptomatic individuals. Eligible studies compared testing strategy versus no testing or standard care or usual practice; one testing strategy with another, such as antigen-detecting rapid diagnostic tests (RDTs) versus nucleic acid amplification testing (NAAT), including reverse transcription polymerase chain reaction (RT-PCR); home-based versus provider-administered testing; one-time testing versus repeated testing at different frequencies; and targeted testing versus widespread testing. Combinations of these components were also considered. In this review, we define 'SARS-CoV-2 testing strategy' as a complex intervention comprising multiple varying components, including test type (e.g. NAAT, antigen-detecting RDT), sample type (e.g. nasopharyngeal swab, saliva), target population (e.g. symptomatic, contacts), setting (e.g. home, clinic, congregate), frequency of testing (e.g. one-time, weekly, daily), and response protocol (e.g. isolation, confirmatory testing, treatment). We excluded single-arm studies, reviews, theses, editorials, letters, commentaries, studies reported solely in abstract form, laboratory or animal studies, mathematical modelling studies, and diagnostic test accuracy studies."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were: COVID-19 cases avoided (reduction in new cases); COVID-19-related hospitalisations avoided (reduction in hospital admissions); COVID-19-related deaths avoided (reduction in mortality); and serious adverse events related to testing, including unnecessary interventions, employment impacts, isolation effects, and psychological harms."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Risk of bias 2 (RoB 2) tool to assess the risk of bias in RCTs and the ROBINS-I tool to assess the risk of bias in NRSIs, CBA studies, and matched cohort studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "As a meta-analysis was not feasible due to the nature of the data, we applied Synthesis Without Meta-analysis (SWiM) methods. We assessed the certainty of the evidence for each outcome using the GRADE approach."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 21 studies (10 RCTs and 11 NRSIs) with 13,312,327 participants. Among these, 13 studies-comprising eight RCTs and five NRSIs-either reported one or more prespecified outcomes (four studies), provided relevant information through proxy measurements (five studies), or supplied information following author correspondence (four studies)."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We present the prioritised comparisons and critical outcomes. For the comparison testing strategy versus no testing or standard care or usual practice, one included study measured two critical outcomes. The study did not measure the other critical outcomes: COVID-19 cases avoided, and serious adverse events related to testing. No studies measured any critical outcomes for the other prioritised comparison: antigen-detecting RDT versus NAAT testing. Benefits and harms of testing strategy versus no testing or standard care or usual practice One observational study with a comparison group, conducted in a long-term care facility in Israel, compared weekly SARS-CoV-2 RT-PCR testing with no testing and measured two of our critical outcomes. Based on the analysis, the evidence is very uncertain about the effect of SARS-CoV-2 RT-PCR testing on reducing hospitalisation (decrease in the hospitalisation rate from 13.59% to 11.41%; 1 study, 162,205 participants, very low-certainty evidence) and mortality (33.8% decrease in expected mortality; 1 study, 162,205 participants, very low-certainty evidence) compared to no testing. We downgraded the certainty of the evidence because of methodological limitations, indirectness, and imprecision."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "The available data are of very low-certainty. Only one of the 21 included studies reported hospitalisations or deaths; therefore, we cannot draw conclusions about the effects of testing strategy versus no testing on reducing hospitalisation and mortality. No studies evaluated other critical outcomes i.e. COVID-19 cases avoided, and serious adverse events related to testing. Future research should aim for consistency and relevance by using clearly defined outcomes, preferably based on a standardised core outcome set. A qualitative evidence synthesis (QES) would help identify barriers and facilitators to routine SARS-CoV-2 testing in healthcare settings, which could help inform intervention development. The QES would explore factors affecting the implementation of routine testing, drawing on the perspectives of healthcare providers, patients, and other interest holders."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review was partially funded by the World Health Organization (WHO) and the Health Research Board of Ireland."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2025) DOI: 10.1002/14651858.CD016192."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41036688/",
      "pubDate": "2025 Oct 02",
      "doi": "10.1002/14651858.CD016192.pub2",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "Due to the very low certainty of the data, the impact of testing strategies on hospitalizations, mortality, and other critical outcomes related to SARS-CoV-2 cannot be determined."
    },
    {
      "id": "13c470ec4583",
      "title": "Timing and Safety of Anticoagulation Reinitiation After Intracranial Hemorrhage in Patients With Mechanical Valves: A Meta-Analysis.",
      "journal": "Neurology",
      "score": "6/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117866",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false
    },
    {
      "id": "bf354bd4d129",
      "title": "Non-Injectable Ketamine for Pediatric Sedation in the Emergency Department: A Systematic Review.",
      "journal": "Acad Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117863",
      "abstract": "Ketamine is the most common medication for procedural sedation and analgesia (PSA) of pediatric patients in the emergency department (ED). Since ketamine injection is painful, some studies have assessed the routes other than intravenous and intramuscular. Therefore, this systematic review aims to evaluate the details of noninjectable ketamine (NIK) administration. The review followed the Preferred Reporting Items for Systematic Review and Meta-Analysis for Systematic Review (PRISMA) guidelines. MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Web of Science Core Collection (SCIE and ESCI), and Scopus were searched for relevant studies from inception to 3 July 2025. All English original clinical research on PSA with NIK administration in pediatric populations in the ED was included. Risk of bias and certainty of evidence (COE) were also assessed. From 5617 identified records, 12 studies (7 interventional and 5 observational) with a total number of 1484 patients were included. Most of the studies evaluated laceration repair among children 2-12 years of age. Seven single-center double-blinded randomized controlled trials showed that oral ketamine (5-10 mg/kg) alone or in combination with other medications (mainly midazolam) provided the desirable level of sedation (COE: very low) relative to the oral comparators. It also resulted in faster onset of action (OA) (15-35 min) and shorter duration of action (DA) (60-265 min) (COE: low). Oral and nasal ketamine studies did not report any serious adverse event (SAE) associated with invasive interventions (COE: moderate to low). Sedation with oral ketamine might have a desirable depth, faster OA, and shorter DA relative to the oral comparators. Furthermore, NIK probably showed no SAE during PSA. Nevertheless, the limited number of heterogeneous studies leaves uncertainty, highlighting the need for further research.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Ketamine is the most common medication for procedural sedation and analgesia (PSA) of pediatric patients in the emergency department (ED). Since ketamine injection is painful, some studies have assessed the routes other than intravenous and intramuscular. Therefore, this systematic review aims to evaluate the details of noninjectable ketamine (NIK) administration."
        },
        {
          "label": "METHODS",
          "text": "The review followed the Preferred Reporting Items for Systematic Review and Meta-Analysis for Systematic Review (PRISMA) guidelines. MEDLINE, Embase, Cochrane Central Register of Controlled Trials, Web of Science Core Collection (SCIE and ESCI), and Scopus were searched for relevant studies from inception to 3 July 2025. All English original clinical research on PSA with NIK administration in pediatric populations in the ED was included. Risk of bias and certainty of evidence (COE) were also assessed."
        },
        {
          "label": "RESULTS",
          "text": "From 5617 identified records, 12 studies (7 interventional and 5 observational) with a total number of 1484 patients were included. Most of the studies evaluated laceration repair among children 2-12 years of age. Seven single-center double-blinded randomized controlled trials showed that oral ketamine (5-10 mg/kg) alone or in combination with other medications (mainly midazolam) provided the desirable level of sedation (COE: very low) relative to the oral comparators. It also resulted in faster onset of action (OA) (15-35 min) and shorter duration of action (DA) (60-265 min) (COE: low). Oral and nasal ketamine studies did not report any serious adverse event (SAE) associated with invasive interventions (COE: moderate to low)."
        },
        {
          "label": "CONCLUSION",
          "text": "Sedation with oral ketamine might have a desirable depth, faster OA, and shorter DA relative to the oral comparators. Furthermore, NIK probably showed no SAE during PSA. Nevertheless, the limited number of heterogeneous studies leaves uncertainty, highlighting the need for further research."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41069251/",
      "pubDate": "2025 Oct 10",
      "doi": "10.1111/acem.70163",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "Oral ketamine sedation may achieve a desirable depth of sedation, faster onset, and shorter duration of action compared to other oral sedatives, with a low risk of serious adverse events."
    },
    {
      "id": "5c1f07ad5053",
      "title": "Cefiderocol versus standard therapy for hospital-acquired and health-care-associated Gram-negative bacterial bloodstream infection (the GAME CHANGER trial): an open-label, parallel-group, randomised trial.",
      "journal": "Lancet Infect Dis",
      "score": "5/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117860",
      "abstract": "Bloodstream infections caused by bacteria with carbapenem resistance are associated with high mortality. Cefiderocol has broad in vitro activity against carbapenem-resistant Gram-negative bacilli. We aimed to assess whether cefiderocol was non-inferior or superior to standard-of-care antibiotics in preventing mortality in patients with bloodstream infection caused by Gram-negative bacilli. The GAME CHANGER trial was an open-label, parallel-group, randomised clinical trial in which patients with health-care-associated or hospital-acquired Gram-negative bloodstream infection were recruited from 17 tertiary hospitals with more than 500 beds in Australia, Malaysia, Singapore, Taiwan, Thailand, and Türkiye. Adult patients (aged ≥21 years in Singapore or ≥18 years elsewhere) with positive blood cultures and Gram-negative bacilli seen on Gram stain were eligible. Participants were randomly assigned in a 1:1 ratio to cefiderocol (2 g intravenously every 8 h) or standard of care (chosen by the patient's clinical team) using an online randomisation tool with strata defined by severity of comorbidities and region, with random permuted blocks of unequal size. Patients, treating clinicians, and site investigators were not masked to treatment. The primary outcome was all-cause mortality at 14 days after randomisation. All outcomes were analysed in participants who received at least one dose of assigned antibiotic, grew an aerobic Gram-negative bacillus from the index blood culture, and did not withdraw consent before day 14. The non-inferiority margin was 10%; superiority was to be assessed if non-inferiority was shown, and was evaluated in both the main analysis population and in patients with at least one carbapenem-resistant organism causing bloodstream infection. Missing data were handled by imputing data. The trial was registered on ClinicalTrials.gov (NCT03869437) and is closed to new participants. 513 participants were enrolled between Nov 12, 2019, and Oct 31, 2023 (210 [42%] female and 294 [58%] male). 256 patients were randomly assigned to cefiderocol and 257 were assigned to standard of care. Nine patients (six in the cefiderocol group and three in the standard-of-care group) were excluded from further analysis because they withdrew consent or their blood cultures did not grow an aerobic Gram-negative bacillus. Thus, 504 participants were included in the main analysis population. 20 (8%) of 250 patients in the cefiderocol group had died at 14 days compared with 17 (7%) of 254 patients in the standard-of-care group (absolute risk difference 1%, 95% CI -3 to 6). 127 (25%) of 504 patients had an infection with a carbapenem-resistant organism; at 14 days, nine (14%) of 64 patients in the cefiderocol group had died compared with six (10%) of 63 patients in the standard-of-care group (5%, -7 to 16). There were five treatment-emergent serious adverse events that were either probably or possibly related to the study drug (all in the cefiderocol group): delirium, stupor, rigors, abnormal liver chemistry, and rash, all of which resolved without treatment (except for the rash, which required hydrocortisone and anti-histamines). Among patients with a hospital-acquired or health-care-associated Gram-negative bloodstream infection, cefiderocol resulted in non-inferior 14-day mortality compared with standard of care. Adverse events were similar between groups, although those thought to be related to the study drug only occurred in the cefiderocol group. In both the main analysis population and the carbapenem-resistant subset, cefiderocol was not superior to standard of care. This evidence suggests that cefiderocol is efficacious in patients with health-care-associated Gram-negative bloodstream infection who are at high risk of antibiotic resistance, but more evidence is required to define its efficacy when carbapenem-resistant organisms are the cause. The University of Queensland, Shionogi, The Henderson Foundation, and the National Medical Research Council (Singapore).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Bloodstream infections caused by bacteria with carbapenem resistance are associated with high mortality. Cefiderocol has broad in vitro activity against carbapenem-resistant Gram-negative bacilli. We aimed to assess whether cefiderocol was non-inferior or superior to standard-of-care antibiotics in preventing mortality in patients with bloodstream infection caused by Gram-negative bacilli."
        },
        {
          "label": "METHODS",
          "text": "The GAME CHANGER trial was an open-label, parallel-group, randomised clinical trial in which patients with health-care-associated or hospital-acquired Gram-negative bloodstream infection were recruited from 17 tertiary hospitals with more than 500 beds in Australia, Malaysia, Singapore, Taiwan, Thailand, and Türkiye. Adult patients (aged ≥21 years in Singapore or ≥18 years elsewhere) with positive blood cultures and Gram-negative bacilli seen on Gram stain were eligible. Participants were randomly assigned in a 1:1 ratio to cefiderocol (2 g intravenously every 8 h) or standard of care (chosen by the patient's clinical team) using an online randomisation tool with strata defined by severity of comorbidities and region, with random permuted blocks of unequal size. Patients, treating clinicians, and site investigators were not masked to treatment. The primary outcome was all-cause mortality at 14 days after randomisation. All outcomes were analysed in participants who received at least one dose of assigned antibiotic, grew an aerobic Gram-negative bacillus from the index blood culture, and did not withdraw consent before day 14. The non-inferiority margin was 10%; superiority was to be assessed if non-inferiority was shown, and was evaluated in both the main analysis population and in patients with at least one carbapenem-resistant organism causing bloodstream infection. Missing data were handled by imputing data. The trial was registered on ClinicalTrials.gov (NCT03869437) and is closed to new participants."
        },
        {
          "label": "FINDINGS",
          "text": "513 participants were enrolled between Nov 12, 2019, and Oct 31, 2023 (210 [42%] female and 294 [58%] male). 256 patients were randomly assigned to cefiderocol and 257 were assigned to standard of care. Nine patients (six in the cefiderocol group and three in the standard-of-care group) were excluded from further analysis because they withdrew consent or their blood cultures did not grow an aerobic Gram-negative bacillus. Thus, 504 participants were included in the main analysis population. 20 (8%) of 250 patients in the cefiderocol group had died at 14 days compared with 17 (7%) of 254 patients in the standard-of-care group (absolute risk difference 1%, 95% CI -3 to 6). 127 (25%) of 504 patients had an infection with a carbapenem-resistant organism; at 14 days, nine (14%) of 64 patients in the cefiderocol group had died compared with six (10%) of 63 patients in the standard-of-care group (5%, -7 to 16). There were five treatment-emergent serious adverse events that were either probably or possibly related to the study drug (all in the cefiderocol group): delirium, stupor, rigors, abnormal liver chemistry, and rash, all of which resolved without treatment (except for the rash, which required hydrocortisone and anti-histamines)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Among patients with a hospital-acquired or health-care-associated Gram-negative bloodstream infection, cefiderocol resulted in non-inferior 14-day mortality compared with standard of care. Adverse events were similar between groups, although those thought to be related to the study drug only occurred in the cefiderocol group. In both the main analysis population and the carbapenem-resistant subset, cefiderocol was not superior to standard of care. This evidence suggests that cefiderocol is efficacious in patients with health-care-associated Gram-negative bloodstream infection who are at high risk of antibiotic resistance, but more evidence is required to define its efficacy when carbapenem-resistant organisms are the cause."
        },
        {
          "label": "FUNDING",
          "text": "The University of Queensland, Shionogi, The Henderson Foundation, and the National Medical Research Council (Singapore)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41067237/",
      "pubDate": "2025 Oct 06",
      "doi": "10.1016/S1473-3099(25)00469-4",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "Cefiderocol was not inferior to standard-of-care antibiotics in treating bloodstream infections caused by Gram-negative bacilli."
    },
    {
      "id": "e158a4cb7b6e",
      "title": "Efficacy and safety of respiratory syncytial virus vaccines.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117857",
      "abstract": "Respiratory syncytial virus (RSV) is a highly transmissible pathogen that causes varying degrees of respiratory illness across all age groups. The safety and efficacy profiles of available RSV vaccines, a critical consideration for their integration into public health strategies and clinical practice, remain uncertain. To assess the benefits and harms of RSV vaccines compared to placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or monoclonal antibodies (mAbs) across all human populations. We conducted a comprehensive literature search of CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the WHO ICTRP following standard systematic review methodology from 2000 to April 2024. We included both randomised controlled trials (RCTs) and non-randomised studies of interventions (NRSIs) involving all human populations comparing RSV vaccines with placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or mAbs. We excluded studies focused on dose-finding schedules and immunogenicity assessment. Benefits included frequency of RSV illness (both lower and upper respiratory illness) confirmed by laboratory tests (RSV-associated lower respiratory tract illness and RSV-associated acute respiratory illness); hospitalisation due to RSV disease (both lower and upper respiratory illness) confirmed by laboratory tests; mortality from illness caused by RSV (confirmed by laboratory test); all-cause mortality; and admission to an intensive care unit. Harms included serious adverse events (SAEs) related to vaccination, including neurological disorders such as Guillain-Barré syndrome. We assessed risk of bias in RCTs using Cochrane's RoB 2 tool. We used standard Cochrane methods. We identified 14 RCTs: five trials (101,825 participants) on older adults; three trials (12,010 participants) on maternal vaccination and effects on infants; one trial (300 participants) on women of childbearing age; and five trials (192 participants) on infants and children. We identified no NRSIs. RSV prefusion vaccine versus placebo in older adults These vaccines reduced RSV-associated lower respiratory tract illness with vaccine efficacy (VE) of 77% (95% confidence interval (CI) 0.70 to 0.83; risk ratio (RR) 0.23, 95% CI 0.17 to 0.30; 4 RCTs, 99,931 participants; high-certainty evidence) and RSV-associated acute respiratory illness with VE of 67% (95% CI 0.60 to 0.73; RR 0.33, 95% CI 0.27 to 0.40; 3 RCTs, 94,339 participants; high-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). RSV postfusion F protein-based vaccine versus placebo in older adults There is probably little to no difference in RSV-associated lower respiratory tract illness with VE of -0.37% (95% CI -1.96 to 0.37; RR 1.37, 95% CI 0.63 to 2.96; 1 RCT, 1894 participants; moderate-certainty evidence) and RSV-associated acute respiratory illness with VE of -0.07% (95% CI -1.15 to 0.47; RR 1.07, 95% CI 0.53 to 2.15; 1 RCT, 1894 participants; moderate-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Maternal RSV F protein-based vaccine versus placebo in infants These vaccines reduced medically attended RSV-associated lower respiratory tract illness with VE of 54% (95% CI 0.28 to 0.71; RR 0.46, 95% CI 0.29 to 0.72; 3 RCTs, 12,010 participants; high-certainty evidence), medically attended RSV-associated severe lower respiratory tract illness with VE of 74% (95% CI 0.44 to 0.88; RR 0.26, 95% CI 0.12 to 0.56; 3 RCTs, 12,010 participants; high-certainty evidence), and hospitalisation due to RSV disease with VE of 54% (95% CI 0.27 to 0.71; RR 0.46, 95% CI 0.29 to 0.73; 2 RCTs, 11,502 participants; high-certainty evidence) in infants. There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination in mothers and infants (low-certainty evidence). Live-attenuated RSV vaccines versus placebo in infants and children The evidence is very uncertain regarding all-cause medically attended acute respiratory illness (MAARI) with VE of 26% (95% CI -0.01 to 0.46; RR 0.74, 95% CI 0.54 to 1.01; 5 RCTs, 171 participants; very low-certainty evidence) and RSV-associated MAARI with VE of 38% (95% CI -0.24 to 0.69; RR 0.62, 95% CI 0.31 to 1.24; 5 RCTs, 192 participants; very low-certainty evidence). There may be little to no difference in SAEs related to vaccination (low-certainty evidence). RSV recombinant F nanoparticle vaccine versus placebo in women of childbearing age The evidence is very uncertain regarding new RSV infections with VE of 50% (95% CI 0.08 to 0.73; RR 0.50, 95% CI 0.27 to 0.92; 1 RCT, 300 participants; very low-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Phase III trials consistently demonstrated low risk of bias. Whilst phase I and II trials occasionally raised concerns about selection bias in the randomisation process, the overall evidence was deemed robust. RSV prefusion vaccines reduced RSV-associated lower respiratory tract illness and acute respiratory illness in older adults. There may be little to no difference in SAEs related to vaccination in older adults. Maternal vaccination with RSV F protein-based vaccines reduced medically attended RSV-associated lower respiratory tract illness and severe cases in infants. There may be little to no difference in SAEs related to vaccination in mothers and infants. The evidence is very uncertain regarding the effects of RSV vaccine on women of childbearing age, and the effects of live-attenuated RSV vaccines on infants and children; there may be little to no difference in SAEs related to vaccination. This review was funded by the EU4Health Programme under a service contract with the European Health and Digital Executive Agency (HaDEA). The review was registered in the International Prospective Register of Systematic Reviews (PROSPERO) (CRD42023439128).",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Respiratory syncytial virus (RSV) is a highly transmissible pathogen that causes varying degrees of respiratory illness across all age groups. The safety and efficacy profiles of available RSV vaccines, a critical consideration for their integration into public health strategies and clinical practice, remain uncertain."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of RSV vaccines compared to placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or monoclonal antibodies (mAbs) across all human populations."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We conducted a comprehensive literature search of CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and the WHO ICTRP following standard systematic review methodology from 2000 to April 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included both randomised controlled trials (RCTs) and non-randomised studies of interventions (NRSIs) involving all human populations comparing RSV vaccines with placebo, no intervention, vaccines for other respiratory infections, other RSV vaccines, or mAbs. We excluded studies focused on dose-finding schedules and immunogenicity assessment."
        },
        {
          "label": "OUTCOMES",
          "text": "Benefits included frequency of RSV illness (both lower and upper respiratory illness) confirmed by laboratory tests (RSV-associated lower respiratory tract illness and RSV-associated acute respiratory illness); hospitalisation due to RSV disease (both lower and upper respiratory illness) confirmed by laboratory tests; mortality from illness caused by RSV (confirmed by laboratory test); all-cause mortality; and admission to an intensive care unit. Harms included serious adverse events (SAEs) related to vaccination, including neurological disorders such as Guillain-Barré syndrome."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We assessed risk of bias in RCTs using Cochrane's RoB 2 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We used standard Cochrane methods."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We identified 14 RCTs: five trials (101,825 participants) on older adults; three trials (12,010 participants) on maternal vaccination and effects on infants; one trial (300 participants) on women of childbearing age; and five trials (192 participants) on infants and children. We identified no NRSIs."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "RSV prefusion vaccine versus placebo in older adults These vaccines reduced RSV-associated lower respiratory tract illness with vaccine efficacy (VE) of 77% (95% confidence interval (CI) 0.70 to 0.83; risk ratio (RR) 0.23, 95% CI 0.17 to 0.30; 4 RCTs, 99,931 participants; high-certainty evidence) and RSV-associated acute respiratory illness with VE of 67% (95% CI 0.60 to 0.73; RR 0.33, 95% CI 0.27 to 0.40; 3 RCTs, 94,339 participants; high-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). RSV postfusion F protein-based vaccine versus placebo in older adults There is probably little to no difference in RSV-associated lower respiratory tract illness with VE of -0.37% (95% CI -1.96 to 0.37; RR 1.37, 95% CI 0.63 to 2.96; 1 RCT, 1894 participants; moderate-certainty evidence) and RSV-associated acute respiratory illness with VE of -0.07% (95% CI -1.15 to 0.47; RR 1.07, 95% CI 0.53 to 2.15; 1 RCT, 1894 participants; moderate-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Maternal RSV F protein-based vaccine versus placebo in infants These vaccines reduced medically attended RSV-associated lower respiratory tract illness with VE of 54% (95% CI 0.28 to 0.71; RR 0.46, 95% CI 0.29 to 0.72; 3 RCTs, 12,010 participants; high-certainty evidence), medically attended RSV-associated severe lower respiratory tract illness with VE of 74% (95% CI 0.44 to 0.88; RR 0.26, 95% CI 0.12 to 0.56; 3 RCTs, 12,010 participants; high-certainty evidence), and hospitalisation due to RSV disease with VE of 54% (95% CI 0.27 to 0.71; RR 0.46, 95% CI 0.29 to 0.73; 2 RCTs, 11,502 participants; high-certainty evidence) in infants. There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination in mothers and infants (low-certainty evidence). Live-attenuated RSV vaccines versus placebo in infants and children The evidence is very uncertain regarding all-cause medically attended acute respiratory illness (MAARI) with VE of 26% (95% CI -0.01 to 0.46; RR 0.74, 95% CI 0.54 to 1.01; 5 RCTs, 171 participants; very low-certainty evidence) and RSV-associated MAARI with VE of 38% (95% CI -0.24 to 0.69; RR 0.62, 95% CI 0.31 to 1.24; 5 RCTs, 192 participants; very low-certainty evidence). There may be little to no difference in SAEs related to vaccination (low-certainty evidence). RSV recombinant F nanoparticle vaccine versus placebo in women of childbearing age The evidence is very uncertain regarding new RSV infections with VE of 50% (95% CI 0.08 to 0.73; RR 0.50, 95% CI 0.27 to 0.92; 1 RCT, 300 participants; very low-certainty evidence). There may be little to no difference in mortality from illness caused by RSV, all-cause mortality, and SAEs related to vaccination (low-certainty evidence). Phase III trials consistently demonstrated low risk of bias. Whilst phase I and II trials occasionally raised concerns about selection bias in the randomisation process, the overall evidence was deemed robust."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "RSV prefusion vaccines reduced RSV-associated lower respiratory tract illness and acute respiratory illness in older adults. There may be little to no difference in SAEs related to vaccination in older adults. Maternal vaccination with RSV F protein-based vaccines reduced medically attended RSV-associated lower respiratory tract illness and severe cases in infants. There may be little to no difference in SAEs related to vaccination in mothers and infants. The evidence is very uncertain regarding the effects of RSV vaccine on women of childbearing age, and the effects of live-attenuated RSV vaccines on infants and children; there may be little to no difference in SAEs related to vaccination."
        },
        {
          "label": "FUNDING",
          "text": "This review was funded by the EU4Health Programme under a service contract with the European Health and Digital Executive Agency (HaDEA)."
        },
        {
          "label": "REGISTRATION",
          "text": "The review was registered in the International Prospective Register of Systematic Reviews (PROSPERO) (CRD42023439128)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41016728/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1002/14651858.CD016131",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "RSV prefusion vaccines protect older adults and infants from RSV-related illness, with no significant increase in serious adverse events, while the effects on women of childbearing age and live-attenuated vaccines in children are uncertain."
    },
    {
      "id": "2187d7959ea6",
      "title": "Electromechanically Optimized Right Ventricular Pacing for Obstructive Hypertrophic Cardiomyopathy (EMORI-HCM).",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117846",
      "abstract": "Many patients with symptomatic obstructive hypertrophic cardiomyopathy (oHCM) have devices capable of right ventricular pacing (RVP). Although pacing can reduce left ventricular outflow tract gradient (LVOTg), it can also reduce cardiac output, so its net effect is variable. We tested whether electromechanical optimization of the programmed atrio-ventricular delay (AVD) allows RVP to achieve a net benefit on symptoms. EMORI-HCM (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy) is a multicenter, blinded, randomized, crossover trial of AVD-optimized RVP in patients with symptomatic oHCM with resting or provoked gradient of at least 30 mm Hg. Patients with existing dual-chamber devices were randomized to either 3 months of continuous AVD-optimized RVP (intervention) followed by 3 months of backup-only RVP (control), or vice versa. AVD was optimized using a high-precision multiple-alternation protocol assessing acute change in beat-by-beat blood pressure while varying AVD. The primary outcome was symptoms measured by the Kansas City Cardiomyopathy Questionnaire Clinical Summary Score. Secondary outcomes include patient-reported daily symptom data collected using a dedicated smartphone application (ORBITA-app), dichotomous patient preference, EQ-5D, exercise capacity, and LVOTg. Patients were blinded to treatment allocation. Symptom assessments were self-administered. Outcome measures were recorded at baseline, crossover, and completion. Analysis was by Bayesian ordinal mixed modeling. Between October 2021 and October 2024, 117 screened patients met the inclusion criteria, of whom 60 were randomized. AVD-optimized RVP improved Kansas City Cardiomyopathy Questionnaire Clinical Summary Score (+4.5; 95% credible interval [CrI]: 1.3-8.1; probability of benefit [Pr] = 0.997) and daily symptom scores (OR: 1.29; 95% CrI: 0.98-1.68; Pr: 0.969) compared with backup-only pacing. AVD-optimized RVP improved exercise capacity (+1.0 mL/kg/min; 95% CrI: 0.1-2.0; Pr: 0.984) and LVOTg (-7.3 mm Hg; 95% CrI: -13.5 to -1.1; Pr: 0.010). It had no effect on B-type natriuretic peptide (Pr: 0.893) and ejection fraction was preserved (Pr: 0.409). In patients with oHCM, RVP delivered at electromechanically optimized AVD improves symptoms and exercise capacity. (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy [EMORI-HCM], NCT05257772).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Many patients with symptomatic obstructive hypertrophic cardiomyopathy (oHCM) have devices capable of right ventricular pacing (RVP). Although pacing can reduce left ventricular outflow tract gradient (LVOTg), it can also reduce cardiac output, so its net effect is variable."
        },
        {
          "label": "OBJECTIVE",
          "text": "We tested whether electromechanical optimization of the programmed atrio-ventricular delay (AVD) allows RVP to achieve a net benefit on symptoms."
        },
        {
          "label": "METHODS",
          "text": "EMORI-HCM (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy) is a multicenter, blinded, randomized, crossover trial of AVD-optimized RVP in patients with symptomatic oHCM with resting or provoked gradient of at least 30 mm Hg. Patients with existing dual-chamber devices were randomized to either 3 months of continuous AVD-optimized RVP (intervention) followed by 3 months of backup-only RVP (control), or vice versa. AVD was optimized using a high-precision multiple-alternation protocol assessing acute change in beat-by-beat blood pressure while varying AVD. The primary outcome was symptoms measured by the Kansas City Cardiomyopathy Questionnaire Clinical Summary Score. Secondary outcomes include patient-reported daily symptom data collected using a dedicated smartphone application (ORBITA-app), dichotomous patient preference, EQ-5D, exercise capacity, and LVOTg. Patients were blinded to treatment allocation. Symptom assessments were self-administered. Outcome measures were recorded at baseline, crossover, and completion. Analysis was by Bayesian ordinal mixed modeling."
        },
        {
          "label": "RESULTS",
          "text": "Between October 2021 and October 2024, 117 screened patients met the inclusion criteria, of whom 60 were randomized. AVD-optimized RVP improved Kansas City Cardiomyopathy Questionnaire Clinical Summary Score (+4.5; 95% credible interval [CrI]: 1.3-8.1; probability of benefit [Pr] = 0.997) and daily symptom scores (OR: 1.29; 95% CrI: 0.98-1.68; Pr: 0.969) compared with backup-only pacing. AVD-optimized RVP improved exercise capacity (+1.0 mL/kg/min; 95% CrI: 0.1-2.0; Pr: 0.984) and LVOTg (-7.3 mm Hg; 95% CrI: -13.5 to -1.1; Pr: 0.010). It had no effect on B-type natriuretic peptide (Pr: 0.893) and ejection fraction was preserved (Pr: 0.409)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with oHCM, RVP delivered at electromechanically optimized AVD improves symptoms and exercise capacity. (Electromechanically Optimized Right Ventricular Pacing in Obstructive Hypertrophic Cardiomyopathy [EMORI-HCM], NCT05257772)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892619/",
      "pubDate": "2025 Aug 31",
      "doi": "10.1016/j.jacc.2025.08.050",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "In patients with obstructive hypertrophic cardiomyopathy, right ventricular pacing optimized for electromechanical function improves symptoms and exercise capacity."
    },
    {
      "id": "59a3d4be2c89",
      "title": "Prognostic accuracy of clinical markers of postpartum bleeding in predicting maternal mortality or severe morbidity: a WHO individual participant data meta-analysis.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117840",
      "abstract": "Postpartum haemorrhage (excessive bleeding after birth) is a leading cause of maternal mortality and morbidity worldwide. However, there is no global consensus on which clinical markers best define excessive bleeding or reliably predict adverse maternal outcomes. The aim of this study was to assess the prognostic accuracy of clinical markers of postpartum bleeding in predicting maternal mortality or severe morbidity. In this individual participant data meta-analysis, eligible datasets were identified through a global call for data issued by WHO and systematic searches of PubMed, MEDLINE, Embase, the Cochrane Library, and WHO trial registries (from database inception to Nov 6, 2024). Studies were eligible if they included at least 200 participants with objectively measured blood loss or other clinical markers of haemodynamic instability, and reported at least one clinical outcome of interest. Individual participant data were requested for all eligible studies. For each dataset, we computed the prognostic accuracy of each clinical marker to predict a composite outcome of maternal mortality or severe morbidity (blood transfusion, surgical interventions, or admission to intensive care unit). Five clinical markers were assessed: measured blood loss, pulse rate, systolic blood pressure, diastolic blood pressure, and shock index. Results were meta-analysed through two-level mixed-effects logistic regression models, with a bivariate normal model used to generate summary accuracy estimates. Clinical marker and threshold selections were informed by a WHO expert consensus process, which placed emphasis on maximising prognostic sensitivity (preferably >80%) over prognostic specificity (preferably ≥50%). This meta-analysis was registered on PROSPERO (CRD420251034918). We identified 33 potentially eligible datasets and successfully obtained and analysed full data for 12 datasets, comprising 312 151 women. At the conventional threshold of 500 mL, measured blood loss had a summary prognostic sensitivity of 75·7% (95% CI 60·3-86·4) and specificity of 81·4% (95% CI 70·7-88·8) for predicting the composite outcome. The preferred sensitivity threshold was reached at 300 mL (83·9% [95% CI 72·8-91·1]), although at the expense of reduced specificity (54·8% [95% CI 38·0-70·5]). Prognostic performance improved with a decision rule that combined the use of either blood loss thresholds less than 500 mL (≥300 mL to ≥450 mL) and any abnormal haemodynamic sign (pulse rate >100 beats per min, systolic blood pressure <100 mm Hg, diastolic blood pressure <60 mm Hg, or shock index >1·0) or 500 mL or more of blood loss, with sensitivities ranging from 86·9% to 87·9% and specificities from 66·6% to 76·1%. Measured blood loss below the conventional threshold, combined with abnormal haemodynamic signs, accurately predicts women at risk of death or life-threatening complications from postpartum bleeding and could support earlier postpartum haemorrhage diagnosis and treatment. The Gates Foundation and UNDP/UNFPA/UNICEF/WHO/World Bank Special Programme of Research, Development and Research Training in Human Reproduction.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Postpartum haemorrhage (excessive bleeding after birth) is a leading cause of maternal mortality and morbidity worldwide. However, there is no global consensus on which clinical markers best define excessive bleeding or reliably predict adverse maternal outcomes. The aim of this study was to assess the prognostic accuracy of clinical markers of postpartum bleeding in predicting maternal mortality or severe morbidity."
        },
        {
          "label": "METHODS",
          "text": "In this individual participant data meta-analysis, eligible datasets were identified through a global call for data issued by WHO and systematic searches of PubMed, MEDLINE, Embase, the Cochrane Library, and WHO trial registries (from database inception to Nov 6, 2024). Studies were eligible if they included at least 200 participants with objectively measured blood loss or other clinical markers of haemodynamic instability, and reported at least one clinical outcome of interest. Individual participant data were requested for all eligible studies. For each dataset, we computed the prognostic accuracy of each clinical marker to predict a composite outcome of maternal mortality or severe morbidity (blood transfusion, surgical interventions, or admission to intensive care unit). Five clinical markers were assessed: measured blood loss, pulse rate, systolic blood pressure, diastolic blood pressure, and shock index. Results were meta-analysed through two-level mixed-effects logistic regression models, with a bivariate normal model used to generate summary accuracy estimates. Clinical marker and threshold selections were informed by a WHO expert consensus process, which placed emphasis on maximising prognostic sensitivity (preferably >80%) over prognostic specificity (preferably ≥50%). This meta-analysis was registered on PROSPERO (CRD420251034918)."
        },
        {
          "label": "FINDINGS",
          "text": "We identified 33 potentially eligible datasets and successfully obtained and analysed full data for 12 datasets, comprising 312 151 women. At the conventional threshold of 500 mL, measured blood loss had a summary prognostic sensitivity of 75·7% (95% CI 60·3-86·4) and specificity of 81·4% (95% CI 70·7-88·8) for predicting the composite outcome. The preferred sensitivity threshold was reached at 300 mL (83·9% [95% CI 72·8-91·1]), although at the expense of reduced specificity (54·8% [95% CI 38·0-70·5]). Prognostic performance improved with a decision rule that combined the use of either blood loss thresholds less than 500 mL (≥300 mL to ≥450 mL) and any abnormal haemodynamic sign (pulse rate >100 beats per min, systolic blood pressure <100 mm Hg, diastolic blood pressure <60 mm Hg, or shock index >1·0) or 500 mL or more of blood loss, with sensitivities ranging from 86·9% to 87·9% and specificities from 66·6% to 76·1%."
        },
        {
          "label": "INTERPRETATION",
          "text": "Measured blood loss below the conventional threshold, combined with abnormal haemodynamic signs, accurately predicts women at risk of death or life-threatening complications from postpartum bleeding and could support earlier postpartum haemorrhage diagnosis and treatment."
        },
        {
          "label": "FUNDING",
          "text": "The Gates Foundation and UNDP/UNFPA/UNICEF/WHO/World Bank Special Programme of Research, Development and Research Training in Human Reproduction."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41056961/",
      "pubDate": "2025 Oct 04",
      "doi": "10.1016/S0140-6736(25)01639-3",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "Measured blood loss at a threshold of 500 mL effectively predicts maternal mortality or severe morbidity following childbirth."
    },
    {
      "id": "b35a915aea5b",
      "title": "CAPABLE for People After Hospitalization: A Randomized Trial.",
      "journal": "J Am Geriatr Soc",
      "score": "6/7",
      "tags": [
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117786",
      "abstract": "Following hospitalization, nearly 30% of older adults lose some independence. This can lead to rehospitalization, nursing home admission, and increased dependence. CAPABLE, an evidence-based program, increases independence among older adults with functional limitations but has not been tested in recently hospitalized people. This randomized clinical trial enrolled 268 low-income community-dwelling adults who had been discharged to home from the hospital 60 days prior, had a home health episode, yet had remaining difficulties in at least one activity of daily living. Participants were randomized to no further care or to CAPABLE, which involved up to 10 home visits over 5 months with an occupational therapist, a registered nurse, and a handyworker to address an older adult's self-identified functional goals. Main outcomes were (1) improvement in difficulty with and assistance needed for 10 activities of daily living (range 10-50); (2) five instrumental activities of daily living and mobility: walking up a set of stairs and walking a block. The CAPABLE group decreased their ADL difficulty by -1.76 (CI -2.98, -0.54) and the control group decreased (-0.63: CI -1.86, 0.60) over 5 months, which was not statistically or clinically significant. However, the CAPABLE treatment group demonstrated greater improvement in a composite mobility measure than control participants (-0.52 and -0.02, respectively, p = 0.028). Additionally, among participants with four or more co-morbidities at baseline, the CAPABLE group showed significantly improved ADL independence compared to control participants. Among recently hospitalized persons receiving skilled home health care, CAPABLE did not improve ADLs. However, it improved functional mobility and benefited those with ≥ 4 comorbidities. This study provides novel information on targeting CAPABLE in the post-hospitalization period.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Following hospitalization, nearly 30% of older adults lose some independence. This can lead to rehospitalization, nursing home admission, and increased dependence. CAPABLE, an evidence-based program, increases independence among older adults with functional limitations but has not been tested in recently hospitalized people."
        },
        {
          "label": "METHODS",
          "text": "This randomized clinical trial enrolled 268 low-income community-dwelling adults who had been discharged to home from the hospital 60 days prior, had a home health episode, yet had remaining difficulties in at least one activity of daily living. Participants were randomized to no further care or to CAPABLE, which involved up to 10 home visits over 5 months with an occupational therapist, a registered nurse, and a handyworker to address an older adult's self-identified functional goals. Main outcomes were (1) improvement in difficulty with and assistance needed for 10 activities of daily living (range 10-50); (2) five instrumental activities of daily living and mobility: walking up a set of stairs and walking a block."
        },
        {
          "label": "RESULTS",
          "text": "The CAPABLE group decreased their ADL difficulty by -1.76 (CI -2.98, -0.54) and the control group decreased (-0.63: CI -1.86, 0.60) over 5 months, which was not statistically or clinically significant. However, the CAPABLE treatment group demonstrated greater improvement in a composite mobility measure than control participants (-0.52 and -0.02, respectively, p = 0.028). Additionally, among participants with four or more co-morbidities at baseline, the CAPABLE group showed significantly improved ADL independence compared to control participants."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among recently hospitalized persons receiving skilled home health care, CAPABLE did not improve ADLs. However, it improved functional mobility and benefited those with ≥ 4 comorbidities. This study provides novel information on targeting CAPABLE in the post-hospitalization period."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40990312/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1111/jgs.70116",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "CAPABLE intervention did not improve activities of daily living (ADLs) but did improve functional mobility, especially for those with multiple comorbidities, in recently hospitalized individuals receiving skilled home health care."
    },
    {
      "id": "126bdbefacc7",
      "title": "Antenatal Corticosteroid in Twin-Pregnant Women at Risk of Late Preterm Delivery: A Randomized Clinical Trial.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117763",
      "abstract": "Recent guidelines have recommended corticosteroid injection in women with singleton pregnancies at risk of late preterm delivery. However, the effectiveness of antenatal corticosteroid administration in women with twin pregnancies at risk of late preterm delivery has not been evaluated, and studies on this population are lacking. To evaluate whether antenatal betamethasone administration reduces the risk of neonatal respiratory morbidity in late preterm twin neonates. In this multicenter randomized trial, twin-pregnant women at 34 weeks 0 days to 36 weeks 5 days of gestation at risk of late preterm delivery were enrolled across 8 university-based clinical centers in Korea. Data were collected between May 2018 and July 2024. Intention-to-treat analysis was performed. The participants received 2 injections of betamethasone or placebo after randomization (1:1). The primary outcome was perinatal death within 72 hours after birth or severe neonatal respiratory morbidity. The exploratory outcomes were mild neonatal respiratory morbidities, other neonatal respiratory morbidities, other neonatal complications, or maternal complications. A total of 812 participants were randomized and analyzed, with 410 in the intervention group (median [IQR] age, 35 [33-37] years) and 402 in the placebo group (median [IQR] age, 35 [32-38] years). Among 1620 neonates (818 in the intervention group and 802 in the placebo group), there were no perinatal deaths in either group, and severe neonatal respiratory morbidity occurred in 99 neonates (6.1%), with lower risk in the betamethasone group than in the placebo group (39 [4.8%] vs 60 [7.5%]; relative risk [RR], 0.64 [95% CI, 0.42-0.98]). For the exploratory outcomes, continuous positive airway pressure use for 2 hours or more (RR, 0.58 [95% CI, 0.35-0.95]) and transient tachypnea of the newborn (RR, 0.47 [95% CI, 0.25-0.89]) were lower in the betamethasone group. The risk of primary outcome and mild respiratory morbidities was reduced only in neonates delivered between 12 hours or more and less than 7 days after the first betamethasone administration. The risk of neonatal hypoglycemia was increased in the betamethasone group (128 [15.6%] vs 94 [11.7%]; RR, 1.33 [95% CI, 1.01-1.75]), but the risk of neonatal sepsis or maternal chorioamnionitis did not differ between the 2 groups. In this randomized clinical trial, antenatal betamethasone administration in women with twin pregnancies at risk of late preterm delivery significantly reduced the risk of neonatal respiratory morbidity. The outcomes from this study could serve as a valuable reference in clinical management of twin pregnancies at risk of late preterm delivery. ClinicalTrials.gov Identifier: NCT03547791.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Recent guidelines have recommended corticosteroid injection in women with singleton pregnancies at risk of late preterm delivery. However, the effectiveness of antenatal corticosteroid administration in women with twin pregnancies at risk of late preterm delivery has not been evaluated, and studies on this population are lacking."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate whether antenatal betamethasone administration reduces the risk of neonatal respiratory morbidity in late preterm twin neonates."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "In this multicenter randomized trial, twin-pregnant women at 34 weeks 0 days to 36 weeks 5 days of gestation at risk of late preterm delivery were enrolled across 8 university-based clinical centers in Korea. Data were collected between May 2018 and July 2024. Intention-to-treat analysis was performed."
        },
        {
          "label": "INTERVENTION",
          "text": "The participants received 2 injections of betamethasone or placebo after randomization (1:1)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was perinatal death within 72 hours after birth or severe neonatal respiratory morbidity. The exploratory outcomes were mild neonatal respiratory morbidities, other neonatal respiratory morbidities, other neonatal complications, or maternal complications."
        },
        {
          "label": "RESULTS",
          "text": "A total of 812 participants were randomized and analyzed, with 410 in the intervention group (median [IQR] age, 35 [33-37] years) and 402 in the placebo group (median [IQR] age, 35 [32-38] years). Among 1620 neonates (818 in the intervention group and 802 in the placebo group), there were no perinatal deaths in either group, and severe neonatal respiratory morbidity occurred in 99 neonates (6.1%), with lower risk in the betamethasone group than in the placebo group (39 [4.8%] vs 60 [7.5%]; relative risk [RR], 0.64 [95% CI, 0.42-0.98]). For the exploratory outcomes, continuous positive airway pressure use for 2 hours or more (RR, 0.58 [95% CI, 0.35-0.95]) and transient tachypnea of the newborn (RR, 0.47 [95% CI, 0.25-0.89]) were lower in the betamethasone group. The risk of primary outcome and mild respiratory morbidities was reduced only in neonates delivered between 12 hours or more and less than 7 days after the first betamethasone administration. The risk of neonatal hypoglycemia was increased in the betamethasone group (128 [15.6%] vs 94 [11.7%]; RR, 1.33 [95% CI, 1.01-1.75]), but the risk of neonatal sepsis or maternal chorioamnionitis did not differ between the 2 groups."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, antenatal betamethasone administration in women with twin pregnancies at risk of late preterm delivery significantly reduced the risk of neonatal respiratory morbidity. The outcomes from this study could serve as a valuable reference in clinical management of twin pregnancies at risk of late preterm delivery."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03547791."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40982289/",
      "pubDate": "2025 Sep 22",
      "doi": "10.1001/jamapediatrics.2025.3284",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "Antenatal betamethasone in twin pregnancies at risk of late preterm delivery decreased the likelihood of breathing problems in newborns."
    },
    {
      "id": "1530a2adaab0",
      "title": "Conservative management of placenta accreta spectrum is associated with improved surgical outcomes compared to cesarean hysterectomy: a systematic review and meta-analysis.",
      "journal": "Am J Obstet Gynecol",
      "score": "6/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48539006/117716",
      "abstract": "To compare maternal and surgical outcomes between patients with placenta accreta spectrum who underwent conservative management and those who underwent cesarean hysterectomy. We performed a systematic search in PubMed, Embase, and Web of Science from inception up to June 2, 2024. Studies comparing clinical outcomes among patients with placenta accreta spectrum undergoing conservative management vs cesarean hysterectomy were included. Conservative management was defined as leaving the placenta in situ and local myometrial resection. A random-effects model was used to pool the mean differences or odds ratios and the corresponding 95% confidence intervals. Heterogeneity was assessed using the I statistic. The meta-analysis included 16 studies, with a total of 2300 women diagnosed with placenta accreta spectrum. Of this pooled sample, 1072 patients underwent cesarean hysterectomy and 1228 were managed conservatively. In pregnancies affected by placenta accreta spectrum, cesarean hysterectomy was associated with significantly higher estimated blood loss compared to placenta in situ (mean difference 973.5 mL, 95% confidence interval 615.4-1331.7, 95% prediction interval [PI] -50.2 to 1997.2, P<.001) and local resection (mean difference 739.7 mL, 95% confidence interval 287.7-1191.7, 95% PI -911.5 to 2390.9, P<.001). Additionally, cesarean hysterectomy resulted in more intraoperative transfused red blood cell units than the local resection (mean difference 1.54 units, 95% confidence interval 1.06-2.01, 95% PI 0.27-2.81, P=.001) but had similar rates as compared to placenta in situ group (mean difference 0.72 units, 95% confidence interval -0.21 to 1.64, 95% PI -2.21 to 3.64, P=.065). The risk of genitourinary injury was significantly higher for cesarean hysterectomy compared to both placenta left in situ (odds ratio 3.79, 95% confidence interval 1.88-7.61, 95% PI 1.52-9.46, P<.001) and local resection (odds ratio 4.11, 95% confidence interval 2.57-6.56, 95% PI 2.34-7.22, P<.001). Patients undergoing cesarean hysterectomy, as compared to placenta in situ group, were more likely to be admitted to intensive care unit (odds ratio 7.98, 95% confidence interval 2.23-28.51, 95% PI 0.34-188.50, P<0.001); however, there was no significant difference between cesarean hysterectomy and local resection group in terms of intensive care unit admission. There were no significant differences between cesarean hysterectomy and conservative approaches regarding the risk of gastrointestinal injury and thromboembolic events. This meta-analysis strengthens the evidence supporting conservative management for pregnancies with placenta accreta spectrum, demonstrating that it is associated with reduced surgical morbidity and may offer an effective alternative to cesarean hysterectomy, particularly for patients seeking fertility preservation. However, further research, including randomized controlled trials and longitudinal studies, is necessary to more definitively evaluate conservative management approaches for pregnancies with placenta accreta spectrum and assess long-term clinical outcomes after conservative management.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To compare maternal and surgical outcomes between patients with placenta accreta spectrum who underwent conservative management and those who underwent cesarean hysterectomy."
        },
        {
          "label": "DATA SOURCES",
          "text": "We performed a systematic search in PubMed, Embase, and Web of Science from inception up to June 2, 2024."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Studies comparing clinical outcomes among patients with placenta accreta spectrum undergoing conservative management vs cesarean hysterectomy were included. Conservative management was defined as leaving the placenta in situ and local myometrial resection."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "A random-effects model was used to pool the mean differences or odds ratios and the corresponding 95% confidence intervals. Heterogeneity was assessed using the I statistic."
        },
        {
          "label": "RESULTS",
          "text": "The meta-analysis included 16 studies, with a total of 2300 women diagnosed with placenta accreta spectrum. Of this pooled sample, 1072 patients underwent cesarean hysterectomy and 1228 were managed conservatively. In pregnancies affected by placenta accreta spectrum, cesarean hysterectomy was associated with significantly higher estimated blood loss compared to placenta in situ (mean difference 973.5 mL, 95% confidence interval 615.4-1331.7, 95% prediction interval [PI] -50.2 to 1997.2, P<.001) and local resection (mean difference 739.7 mL, 95% confidence interval 287.7-1191.7, 95% PI -911.5 to 2390.9, P<.001). Additionally, cesarean hysterectomy resulted in more intraoperative transfused red blood cell units than the local resection (mean difference 1.54 units, 95% confidence interval 1.06-2.01, 95% PI 0.27-2.81, P=.001) but had similar rates as compared to placenta in situ group (mean difference 0.72 units, 95% confidence interval -0.21 to 1.64, 95% PI -2.21 to 3.64, P=.065). The risk of genitourinary injury was significantly higher for cesarean hysterectomy compared to both placenta left in situ (odds ratio 3.79, 95% confidence interval 1.88-7.61, 95% PI 1.52-9.46, P<.001) and local resection (odds ratio 4.11, 95% confidence interval 2.57-6.56, 95% PI 2.34-7.22, P<.001). Patients undergoing cesarean hysterectomy, as compared to placenta in situ group, were more likely to be admitted to intensive care unit (odds ratio 7.98, 95% confidence interval 2.23-28.51, 95% PI 0.34-188.50, P<0.001); however, there was no significant difference between cesarean hysterectomy and local resection group in terms of intensive care unit admission. There were no significant differences between cesarean hysterectomy and conservative approaches regarding the risk of gastrointestinal injury and thromboembolic events."
        },
        {
          "label": "CONCLUSION",
          "text": "This meta-analysis strengthens the evidence supporting conservative management for pregnancies with placenta accreta spectrum, demonstrating that it is associated with reduced surgical morbidity and may offer an effective alternative to cesarean hysterectomy, particularly for patients seeking fertility preservation. However, further research, including randomized controlled trials and longitudinal studies, is necessary to more definitively evaluate conservative management approaches for pregnancies with placenta accreta spectrum and assess long-term clinical outcomes after conservative management."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/39884567/",
      "pubDate": "2025 May",
      "doi": "10.1016/j.ajog.2025.01.030",
      "dateReceived": "2025-10-23T23:22:37.069Z",
      "isNew": false,
      "summary": "Conservative management of placenta accreta spectrum pregnancies is associated with reduced surgical morbidity and may be a viable alternative to cesarean hysterectomy, especially for those desiring future fertility."
    },
    {
      "id": "528ccfe50aaa",
      "title": "A Hybrid Chatbot to Promote Pneumococcal Vaccination Among Older Adults: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48617366/117872",
      "abstract": "There are few robust evaluations assessing the efficacy of chatbots to improve pneumococcal vaccination (PV) uptake among adults 65 years of age or older. To evaluate the relative efficacy of a hybrid chatbot in increasing PV uptake among Hong Kong residents aged 65 years or older. This partially masked, parallel-group randomized clinical trial was conducted between May 1, 2023, and November 30, 2024 in Hong Kong, China. Participants were aged 65 years or older, had a Hong Kong identity card, could speak and comprehend Cantonese, were smartphone and WhatsApp users, and had no prior PV uptake. Participants were recruited through random telephone calls and were randomized to either the stage of change group or the standard intervention group. In the stage of change group, the rule-based component of the hybrid chatbot assessed participants' stage of change regarding PV uptake and then delivered stage of change-tailored interventions at months 0, 1, 2, and 3. The natural language processing component of the hybrid chatbot provided real-time answers to participants' PV-related questions. In the standard intervention group, the chatbot sent participants a link to access a standard online video covering PV information at months 0, 1, 2, and 3. The primary outcome was self-reported PV uptake at month 12, which was validated by the research team. The secondary outcome was participants' stage of change measured at month 0 and month 12 by using validated questions, with a score of 1 = precontemplation, 2 = contemplation, 3 = preparation, and 4 = action. A total of 374 participants (213 female [57.0%]; mean [SD] age, 69.6 [3.1] years) were randomized to either the stage of change group (n = 187) or the standard intervention group (n = 187). The intention-to-treat analysis showed that the validated PV uptake rate was higher in the stage of change group than in the standard intervention group (29.4% vs 18.7%; P = .01). The mean (SD) stage of change score was higher in the stage of change group than in the standard intervention group (2.2 [1.3] vs 1.9 [1.1]; P = .02). More participants in the stage of change group than in the standard intervention group completed at least 1 intervention session (79.7% vs 57.8%; P < .001). In this randomized clinical trial, the hybrid chatbot was more efficacious than the standard intervention in increasing PV uptake among older adults in Hong Kong. A hybrid chatbot may be a sustainable PV promotion for older adults. ClinicalTrials.gov Identifier: NCT05772117.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There are few robust evaluations assessing the efficacy of chatbots to improve pneumococcal vaccination (PV) uptake among adults 65 years of age or older."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the relative efficacy of a hybrid chatbot in increasing PV uptake among Hong Kong residents aged 65 years or older."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This partially masked, parallel-group randomized clinical trial was conducted between May 1, 2023, and November 30, 2024 in Hong Kong, China. Participants were aged 65 years or older, had a Hong Kong identity card, could speak and comprehend Cantonese, were smartphone and WhatsApp users, and had no prior PV uptake. Participants were recruited through random telephone calls and were randomized to either the stage of change group or the standard intervention group."
        },
        {
          "label": "INTERVENTIONS",
          "text": "In the stage of change group, the rule-based component of the hybrid chatbot assessed participants' stage of change regarding PV uptake and then delivered stage of change-tailored interventions at months 0, 1, 2, and 3. The natural language processing component of the hybrid chatbot provided real-time answers to participants' PV-related questions. In the standard intervention group, the chatbot sent participants a link to access a standard online video covering PV information at months 0, 1, 2, and 3."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was self-reported PV uptake at month 12, which was validated by the research team. The secondary outcome was participants' stage of change measured at month 0 and month 12 by using validated questions, with a score of 1 = precontemplation, 2 = contemplation, 3 = preparation, and 4 = action."
        },
        {
          "label": "RESULTS",
          "text": "A total of 374 participants (213 female [57.0%]; mean [SD] age, 69.6 [3.1] years) were randomized to either the stage of change group (n = 187) or the standard intervention group (n = 187). The intention-to-treat analysis showed that the validated PV uptake rate was higher in the stage of change group than in the standard intervention group (29.4% vs 18.7%; P = .01). The mean (SD) stage of change score was higher in the stage of change group than in the standard intervention group (2.2 [1.3] vs 1.9 [1.1]; P = .02). More participants in the stage of change group than in the standard intervention group completed at least 1 intervention session (79.7% vs 57.8%; P < .001)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, the hybrid chatbot was more efficacious than the standard intervention in increasing PV uptake among older adults in Hong Kong. A hybrid chatbot may be a sustainable PV promotion for older adults."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05772117."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41060654/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1001/jamanetworkopen.2025.35813",
      "dateReceived": "2025-10-22T23:22:16.434Z",
      "isNew": false,
      "summary": "A hybrid chatbot was more effective than standard methods in increasing pneumococcal vaccination uptake in older adults."
    },
    {
      "id": "9736b8d2f7c6",
      "title": "Dupilumab versus omalizumab in patients with chronic rhinosinusitis with nasal polyps and coexisting asthma (EVEREST): a multicentre, randomised, double-blind, head-to-head phase 4 trial.",
      "journal": "Lancet Respir Med",
      "score": "5/7",
      "tags": [
        "Allergy and Immunology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48530164/117797",
      "dateReceived": "2025-10-22T23:22:16.434Z",
      "isNew": false
    },
    {
      "id": "6c84da312979",
      "title": "Open-Label Placebos as Adjunct for the Preventive Treatment of Migraine: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Neurology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48617366/117895",
      "dateReceived": "2025-10-22T23:22:16.433Z",
      "isNew": false
    },
    {
      "id": "de4dbd17ca3c",
      "title": "Comparison of 2 Doses vs 1 Dose in the First Season Children Are Vaccinated Against Influenza: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117862",
      "abstract": "Based on the findings of immunogenicity studies, the World Health Organization has recommended influenza vaccine-naive children younger than 9 years receive 2 doses of influenza vaccine in the first year of vaccination. To estimate the increase in protection associated with the second dose of influenza vaccine for influenza vaccine-naive children younger than 9 years. MEDLINE, EMBASE, and CINAHL were searched for articles published from inception to March 24, 2025. Peer-reviewed studies that reported vaccine efficacy or vaccine effectiveness against influenza for influenza vaccine-naive children aged 6 months to younger than 9 years by dose number were included. Modeling and cost-effectiveness studies were excluded. Two reviewers independently screened and extracted data and assessed studies' risk of bias. The study followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) reporting guideline. For studies reporting both 1 and 2 dose estimates, the difference in vaccine efficacy or effectiveness was calculated in order to estimate the additional protection associated with the second dose. Pooled vaccine efficacy or effectiveness and difference were calculated separately for inactivated influenza and live attenuated influenza vaccines. There were 51 studies with 415 050 participants included in this analysis. The pooled absolute increase in vaccine effectiveness of a second inactivated influenza vaccine dose in the first year of vaccination was 15 percentage points (pp) (95% CI, -2.8 pp to 33 pp) for those younger than 9 years and 28 pp (95% CI, 4.7 pp to 51 pp) for children younger than 3 years. Insufficient estimates were available to assess the incremental benefit associated with a second dose of live attenuated influenza vaccine. In this systematic review and meta-analysis of influenza vaccine efficacy and effectiveness in the first year of vaccination, receiving 2 doses of inactivated influenza vaccine was associated with improved protection for children younger than 3 years compared with those who receive one dose; however, when the age range was broadened to younger than 9 years, the second dose of inactivated influenza vaccine was not significantly associated with increased protection. Additional high-quality studies are needed to assess the impact of the 2-dose schedule for both vaccine types by age to determine the age range for which a 2-dose schedule is beneficial.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Based on the findings of immunogenicity studies, the World Health Organization has recommended influenza vaccine-naive children younger than 9 years receive 2 doses of influenza vaccine in the first year of vaccination."
        },
        {
          "label": "OBJECTIVE",
          "text": "To estimate the increase in protection associated with the second dose of influenza vaccine for influenza vaccine-naive children younger than 9 years."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, EMBASE, and CINAHL were searched for articles published from inception to March 24, 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Peer-reviewed studies that reported vaccine efficacy or vaccine effectiveness against influenza for influenza vaccine-naive children aged 6 months to younger than 9 years by dose number were included. Modeling and cost-effectiveness studies were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers independently screened and extracted data and assessed studies' risk of bias. The study followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) reporting guideline."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "For studies reporting both 1 and 2 dose estimates, the difference in vaccine efficacy or effectiveness was calculated in order to estimate the additional protection associated with the second dose. Pooled vaccine efficacy or effectiveness and difference were calculated separately for inactivated influenza and live attenuated influenza vaccines."
        },
        {
          "label": "RESULTS",
          "text": "There were 51 studies with 415 050 participants included in this analysis. The pooled absolute increase in vaccine effectiveness of a second inactivated influenza vaccine dose in the first year of vaccination was 15 percentage points (pp) (95% CI, -2.8 pp to 33 pp) for those younger than 9 years and 28 pp (95% CI, 4.7 pp to 51 pp) for children younger than 3 years. Insufficient estimates were available to assess the incremental benefit associated with a second dose of live attenuated influenza vaccine."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis of influenza vaccine efficacy and effectiveness in the first year of vaccination, receiving 2 doses of inactivated influenza vaccine was associated with improved protection for children younger than 3 years compared with those who receive one dose; however, when the age range was broadened to younger than 9 years, the second dose of inactivated influenza vaccine was not significantly associated with increased protection. Additional high-quality studies are needed to assess the impact of the 2-dose schedule for both vaccine types by age to determine the age range for which a 2-dose schedule is beneficial."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41042511/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1001/jamanetworkopen.2025.35250",
      "dateReceived": "2025-10-21T23:24:46.317Z",
      "isNew": false,
      "summary": "Two doses of inactivated influenza vaccine are more protective for children under 3 years old, but not for those under 9 years old."
    },
    {
      "id": "677569c8e5db",
      "title": "Ibrutinib and rituximab versus immunochemotherapy in patients with previously untreated mantle cell lymphoma (ENRICH): a randomised, open-label, phase 2/3 superiority trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117826",
      "dateReceived": "2025-10-21T23:24:46.317Z",
      "isNew": false
    },
    {
      "id": "3b259d90a6ec",
      "title": "Service delivery, behavioural, and self-management interventions for adults with epilepsy.",
      "journal": "Cochrane Database Syst Rev",
      "score": "4/7",
      "tags": [
        "Neurology",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117820",
      "abstract": "Epilepsy is a common condition, affecting around 660 per 100,000 people worldwide. Despite treatment with anti-seizure medications, one-third of people do not achieve seizure control. There is a need to focus on models of service delivery and therapies that target cognitive, psychological, and behavioural aspects to improve seizure control and quality of life. To assess the effects of service delivery, behavioural, and self-management inventions on seizure control and health-related quality of life in adults with epilepsy. We used the Cochrane Register of Studies, MEDLINE, and two other databases, together with reference checking and contact with study authors, to identify the studies included in the review. The latest search date was 21 August 2023. We included randomised controlled trials (RCTs) or quasi-RCTs of any design (double/single-blinded, unblinded; parallel, cross-over, or cluster) involving participants with a mean age of 16 or older. Eligible interventions included behavioural, self-management, or service-delivery approaches. Behavioural and self-management interventions had to report seizure control as an outcome. Our primary outcome was seizure frequency. Our secondary outcomes were: seizure severity, health-related quality of life (HRQoL), medication usage, knowledge, general health, social and psychological function, and adverse events. We classified outcomes as short-term (up to six months) or long-term (over six months). At least two review authors independently screened all papers, extracted data, assessed the risk of bias, and analysed data. We used GRADE to assess the certainty of the evidence. We included 36 studies with 5834 randomised participants. Twenty-six studies included participants with a diagnosis of epilepsy, six studies included participants with severe or drug-resistant epilepsy, and four studies included participants with epilepsy and another comorbidity, including depression, psychosocial problems, or learning disabilities. We rated 16 studies as having an overall low risk of bias, 11 studies as high risk, and nine studies with an unclear risk of bias. Twenty-one studies were conducted in high-income countries, seven in upper-middle-income countries, and eight in lower-middle-income countries. We categorised interventions into psycho-behavioural, mind-body, self-management, physical exercise, nurse-led service delivery, and other service delivery interventions. Seizure frequency Two studies showed that psycho-behavioural interventions likely reduce seizure frequency at three to six months (mean seizure frequency reduction 4.42 per month, 95% confidence interval (CI) 6.41 per month lower to 2.43 per month lower; 64 participants; moderate-certainty evidence). However, this intervention may not improve seizure frequency immediately post-intervention. Three studies showed that mind-body interventions may reduce seizure frequency slightly at six to eight weeks (mean seizure frequency reduction 3.28 per month, 95% CI 6.36 per month lower to 0.20 per month lower; 148 participants; low-certainty evidence). However, evidence from two studies suggests that such interventions have no effect on seizure control. Evidence from three studies suggests that self-management interventions may not reduce seizure frequency between 20 weeks and six months (mean seizure frequency was 1.61 per month higher, 95% CI 6.08 per month lower to 9.29 per month higher; 222 participants; low-certainty evidence). However, three studies showed these interventions are likely to increase seizure freedom. In the short term, the effect of physical exercise on seizure control is very uncertain. Evidence from one study suggests that a nurse-led service delivery intervention does not improve seizure frequency. No data were available for other service-based interventions. The long-term data (> six months) for psycho-behavioural, self-management, and service-based interventions are limited. There are no long-term data available for mind-body, physical exercise, or nurse-led service delivery interventions. Health-related quality of life One study reported that psycho-behavioural interventions likely result in no difference in Quality of Life in Epilepsy Inventory (QOLIE)-10 total score at six months (mean total score was 0.89 higher, 95% CI 1.06 lower to 2.84 higher; 120 participants; moderate-certainty evidence). Overall, there is very uncertain evidence of the short- and long-term effect of psycho-behavioural interventions on HRQoL outcomes. One study showed that mind-body interventions may result in no difference in QOLIE-31-P (31-item questionnaire with patient-weighted scoring system) total scores at six weeks (mean total score was 0.75 higher, 95% CI 5.49 lower to 6.99 higher; 60 participants; low-certainty evidence). Two studies showed that self-management interventions probably do not improve the mean QOLIE-31 or QOLIE-31-P total scores at six months (mean scores 2.42 higher, 95% CI 2.58 lower to 7.42 higher; 393 participants; moderate-certainty evidence). However, one study showed that these interventions are likely to result in a slight improvement in QOLIE-10 total scores. Four studies showed that this intervention probably does not improve HRQoL outcomes. We are very uncertain about the effect of this intervention on long-term outcomes. Three studies showed that physical exercise may result in no difference to HRQoL outcomes in the short term. Two studies showed that nurse-led service delivery interventions probably do not improve outcomes in the short or long term. One study showed that a service delivery-based intervention likely results in an improvement in HRQoL in the long term. Other outcomes Evidence for improvements in epilepsy knowledge, medication usage, general health, social and psychological function was very limited and showed no consistent differences between interventions and controls. There were no reported adverse events related to the interventions. There is no high-certainty evidence that service delivery, behavioural, and self-management interventions improve seizure control or quality of life outcomes for adults with epilepsy. There were wide variations in the size of the effect estimate, depending on how outcomes were measured. Furthermore, there was significant clinical heterogeneity amongst the populations studied, types of interventions delivered, study setting, and study design, which limit interpretation of the currently available evidence and its overall applicability. Further research is needed from well-designed studies using validated measures to assess long-term improvement in outcomes important to adults with epilepsy.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Epilepsy is a common condition, affecting around 660 per 100,000 people worldwide. Despite treatment with anti-seizure medications, one-third of people do not achieve seizure control. There is a need to focus on models of service delivery and therapies that target cognitive, psychological, and behavioural aspects to improve seizure control and quality of life."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of service delivery, behavioural, and self-management inventions on seizure control and health-related quality of life in adults with epilepsy."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used the Cochrane Register of Studies, MEDLINE, and two other databases, together with reference checking and contact with study authors, to identify the studies included in the review. The latest search date was 21 August 2023."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCTs) or quasi-RCTs of any design (double/single-blinded, unblinded; parallel, cross-over, or cluster) involving participants with a mean age of 16 or older. Eligible interventions included behavioural, self-management, or service-delivery approaches. Behavioural and self-management interventions had to report seizure control as an outcome."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Our primary outcome was seizure frequency. Our secondary outcomes were: seizure severity, health-related quality of life (HRQoL), medication usage, knowledge, general health, social and psychological function, and adverse events. We classified outcomes as short-term (up to six months) or long-term (over six months). At least two review authors independently screened all papers, extracted data, assessed the risk of bias, and analysed data. We used GRADE to assess the certainty of the evidence."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 36 studies with 5834 randomised participants. Twenty-six studies included participants with a diagnosis of epilepsy, six studies included participants with severe or drug-resistant epilepsy, and four studies included participants with epilepsy and another comorbidity, including depression, psychosocial problems, or learning disabilities. We rated 16 studies as having an overall low risk of bias, 11 studies as high risk, and nine studies with an unclear risk of bias. Twenty-one studies were conducted in high-income countries, seven in upper-middle-income countries, and eight in lower-middle-income countries. We categorised interventions into psycho-behavioural, mind-body, self-management, physical exercise, nurse-led service delivery, and other service delivery interventions. Seizure frequency Two studies showed that psycho-behavioural interventions likely reduce seizure frequency at three to six months (mean seizure frequency reduction 4.42 per month, 95% confidence interval (CI) 6.41 per month lower to 2.43 per month lower; 64 participants; moderate-certainty evidence). However, this intervention may not improve seizure frequency immediately post-intervention. Three studies showed that mind-body interventions may reduce seizure frequency slightly at six to eight weeks (mean seizure frequency reduction 3.28 per month, 95% CI 6.36 per month lower to 0.20 per month lower; 148 participants; low-certainty evidence). However, evidence from two studies suggests that such interventions have no effect on seizure control. Evidence from three studies suggests that self-management interventions may not reduce seizure frequency between 20 weeks and six months (mean seizure frequency was 1.61 per month higher, 95% CI 6.08 per month lower to 9.29 per month higher; 222 participants; low-certainty evidence). However, three studies showed these interventions are likely to increase seizure freedom. In the short term, the effect of physical exercise on seizure control is very uncertain. Evidence from one study suggests that a nurse-led service delivery intervention does not improve seizure frequency. No data were available for other service-based interventions. The long-term data (> six months) for psycho-behavioural, self-management, and service-based interventions are limited. There are no long-term data available for mind-body, physical exercise, or nurse-led service delivery interventions. Health-related quality of life One study reported that psycho-behavioural interventions likely result in no difference in Quality of Life in Epilepsy Inventory (QOLIE)-10 total score at six months (mean total score was 0.89 higher, 95% CI 1.06 lower to 2.84 higher; 120 participants; moderate-certainty evidence). Overall, there is very uncertain evidence of the short- and long-term effect of psycho-behavioural interventions on HRQoL outcomes. One study showed that mind-body interventions may result in no difference in QOLIE-31-P (31-item questionnaire with patient-weighted scoring system) total scores at six weeks (mean total score was 0.75 higher, 95% CI 5.49 lower to 6.99 higher; 60 participants; low-certainty evidence). Two studies showed that self-management interventions probably do not improve the mean QOLIE-31 or QOLIE-31-P total scores at six months (mean scores 2.42 higher, 95% CI 2.58 lower to 7.42 higher; 393 participants; moderate-certainty evidence). However, one study showed that these interventions are likely to result in a slight improvement in QOLIE-10 total scores. Four studies showed that this intervention probably does not improve HRQoL outcomes. We are very uncertain about the effect of this intervention on long-term outcomes. Three studies showed that physical exercise may result in no difference to HRQoL outcomes in the short term. Two studies showed that nurse-led service delivery interventions probably do not improve outcomes in the short or long term. One study showed that a service delivery-based intervention likely results in an improvement in HRQoL in the long term. Other outcomes Evidence for improvements in epilepsy knowledge, medication usage, general health, social and psychological function was very limited and showed no consistent differences between interventions and controls. There were no reported adverse events related to the interventions."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is no high-certainty evidence that service delivery, behavioural, and self-management interventions improve seizure control or quality of life outcomes for adults with epilepsy. There were wide variations in the size of the effect estimate, depending on how outcomes were measured. Furthermore, there was significant clinical heterogeneity amongst the populations studied, types of interventions delivered, study setting, and study design, which limit interpretation of the currently available evidence and its overall applicability. Further research is needed from well-designed studies using validated measures to assess long-term improvement in outcomes important to adults with epilepsy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40990160/",
      "pubDate": "2025 Sep 24",
      "doi": "10.1002/14651858.CD015284.pub2",
      "dateReceived": "2025-10-21T23:24:46.317Z",
      "isNew": false,
      "summary": "Current evidence does not definitively show that service delivery, behavioral, or self-management interventions improve seizure control or quality of life for adults with epilepsy, and more research is needed."
    },
    {
      "id": "a436cceb173b",
      "title": "Calcium supplementation commenced before pregnancy for preventing hypertensive disorders and related problems.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117756",
      "abstract": "Hypertensive disorders of pregnancy are a leading cause of maternal and perinatal morbidity and mortality. Calcium supplementation commenced before pregnancy may prevent the development of these disorders. This is an update of a review last published in 2019. To assess the effects of calcium supplementation commenced before pregnancy on hypertensive disorders of pregnancy and related maternal and neonatal outcomes. We searched CENTRAL, MEDLINE, Embase, CINAHL, Portal Regional BVS-Lilacs, Scopus, Web of Science, WHO ICTRP and ClinicalTrials.gov on 7 January 2025 and searched reference lists of retrieved trials and relevant systematic reviews. We included randomised controlled trials (RCTs) that compared calcium supplementation commenced before pregnancy with placebo or standard care. Trials conducted after 2010 needed to be prospectively registered. We applied a trustworthiness checklist. Critical outcomes for women were pre-eclampsia or pregnancy loss, and pre-eclampsia. The critical outcome for children was perinatal loss. Our main important outcomes for women were pregnancy loss at any gestational age, maternal death, maternal death or severe morbidity, and adverse effects. Our main important outcomes for children were preterm delivery before 37 weeks, neonatal death or severe morbidity, stillbirth, neonatal death, and early neonatal death. We used version 2 of the Cochrane tool for assessing risk of bias in randomised trials (RoB 2). Two review authors independently selected trials, extracted data, and assessed risk of bias and trustworthiness. We pooled data using random-effects meta-analysis. We assessed the certainty of the evidence using GRADE. Because conception and pregnancy loss are intermediate outcomes potentially on the causal pathway to pre-eclampsia, we chose the composite outcome 'pre-eclampsia or pregnancy loss' as the first critical outcome (and most relevant to pregnant women), and included sensitivity analyses including only women who conceived during the trial. We included one multicentre, double-blind, randomised, placebo-controlled trial. It included 1355 parous women, whose most recent planned pregnancy had been complicated by pre-eclampsia or eclampsia. Pre-eclampsia or pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pre-eclampsia or pregnancy loss at any gestational age (risk ratio (RR) 0.85, 95% confidence interval (CI) 0.67 to 1.07; 1 RCT, 1355 women; risk difference (RD) 28/1000 fewer, 95% CI 61 fewer to 13 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.82 (95% CI 0.66 to 1.00; 1 RCT, 633 women). Pre-eclampsia Compared to placebo, calcium may result in little to no difference in pre-eclampsia (RR 0.84, 95% CI 0.62 to 1.14; 1 RCT, 1355 women; RD 19/1000 fewer, 95% CI 46 fewer to 17 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.81 (95% CI 0.61 to 1.07; 1 RCT, 633 women). Pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pregnancy loss at any gestational age (RR 0.92, 95% CI 0.69 to 1.24; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 37 fewer to 28 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.89 (95% CI 0.67 to 1.17; 1 RCT, 633 women). Maternal death The evidence is very uncertain about the effect of calcium compared to placebo on maternal death (RR 1.00, 95% CI 0.14 to 7.07; 1 RCT, 1355 women; RD 0/10,000 fewer, 95% CI 25 fewer to 179 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.96 (95% CI 0.14 to 6.77; 1 RCT, 633 women). Maternal death or severe morbidity The evidence is very uncertain about the effect of calcium, compared to placebo, on maternal death or severe morbidity (RR 0.97, 95% CI 0.70 to 1.35; 1 RCT, 1355 women; RD 3/1000 fewer, 95% CI 29 fewer to 34 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.93 (95% CI 0.68 to 1.27; 1 RCT, 633 women). Preterm delivery before 37 weeks Compared to placebo, calcium may result in little to no difference in preterm delivery before 37 weeks (RR 0.94, 95% CI 0.74 to 1.19; 1 RCT, 1355 women; RD 11/1000 fewer, 95% CI 46 fewer to 33 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.90 (95% CI 0.74 to 1.11; 1 RCT, 633 women). Stillbirth The evidence is very uncertain about the effect of calcium compared to placebo on stillbirth (RR 0.82, 95% CI 0.50 to 1.34; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 24 fewer to 17 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.79 (95% CI 0.48 to 1.27; 1 RCT, 633 women). The included trial did not measure perinatal loss, maternal adverse effects, neonatal death or severe morbidity, neonatal death, or early neonatal death. When all randomised women are considered, calcium commenced before pregnancy may result in little to no difference in pre-eclampsia or pregnancy loss, and pre-eclampsia. When only pregnant women are considered, calcium may result in little to no difference in pre-eclampsia but may result in a slight reduction in pre-eclampsia or pregnancy loss. No trials measured perinatal loss. The evidence is drawn from one trial of calcium supplementation that commenced before and continued into the first half of pregnancy. Current evidence neither supports nor refutes the routine use of calcium supplementation commencing before conception. This review was funded in part by the World Health Organization. Updated protocol (2025): PROSPERO: CRD420250649571 Review update (2019): DOI: 10.1002/14651858.CD011192.pub3 Original review (2017): DOI: 10.1002/14651858.CD011192.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Hypertensive disorders of pregnancy are a leading cause of maternal and perinatal morbidity and mortality. Calcium supplementation commenced before pregnancy may prevent the development of these disorders. This is an update of a review last published in 2019."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of calcium supplementation commenced before pregnancy on hypertensive disorders of pregnancy and related maternal and neonatal outcomes."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, CINAHL, Portal Regional BVS-Lilacs, Scopus, Web of Science, WHO ICTRP and ClinicalTrials.gov on 7 January 2025 and searched reference lists of retrieved trials and relevant systematic reviews."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) that compared calcium supplementation commenced before pregnancy with placebo or standard care. Trials conducted after 2010 needed to be prospectively registered. We applied a trustworthiness checklist."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes for women were pre-eclampsia or pregnancy loss, and pre-eclampsia. The critical outcome for children was perinatal loss. Our main important outcomes for women were pregnancy loss at any gestational age, maternal death, maternal death or severe morbidity, and adverse effects. Our main important outcomes for children were preterm delivery before 37 weeks, neonatal death or severe morbidity, stillbirth, neonatal death, and early neonatal death."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used version 2 of the Cochrane tool for assessing risk of bias in randomised trials (RoB 2)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently selected trials, extracted data, and assessed risk of bias and trustworthiness. We pooled data using random-effects meta-analysis. We assessed the certainty of the evidence using GRADE. Because conception and pregnancy loss are intermediate outcomes potentially on the causal pathway to pre-eclampsia, we chose the composite outcome 'pre-eclampsia or pregnancy loss' as the first critical outcome (and most relevant to pregnant women), and included sensitivity analyses including only women who conceived during the trial."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included one multicentre, double-blind, randomised, placebo-controlled trial. It included 1355 parous women, whose most recent planned pregnancy had been complicated by pre-eclampsia or eclampsia."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Pre-eclampsia or pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pre-eclampsia or pregnancy loss at any gestational age (risk ratio (RR) 0.85, 95% confidence interval (CI) 0.67 to 1.07; 1 RCT, 1355 women; risk difference (RD) 28/1000 fewer, 95% CI 61 fewer to 13 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.82 (95% CI 0.66 to 1.00; 1 RCT, 633 women). Pre-eclampsia Compared to placebo, calcium may result in little to no difference in pre-eclampsia (RR 0.84, 95% CI 0.62 to 1.14; 1 RCT, 1355 women; RD 19/1000 fewer, 95% CI 46 fewer to 17 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.81 (95% CI 0.61 to 1.07; 1 RCT, 633 women). Pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pregnancy loss at any gestational age (RR 0.92, 95% CI 0.69 to 1.24; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 37 fewer to 28 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.89 (95% CI 0.67 to 1.17; 1 RCT, 633 women). Maternal death The evidence is very uncertain about the effect of calcium compared to placebo on maternal death (RR 1.00, 95% CI 0.14 to 7.07; 1 RCT, 1355 women; RD 0/10,000 fewer, 95% CI 25 fewer to 179 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.96 (95% CI 0.14 to 6.77; 1 RCT, 633 women). Maternal death or severe morbidity The evidence is very uncertain about the effect of calcium, compared to placebo, on maternal death or severe morbidity (RR 0.97, 95% CI 0.70 to 1.35; 1 RCT, 1355 women; RD 3/1000 fewer, 95% CI 29 fewer to 34 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.93 (95% CI 0.68 to 1.27; 1 RCT, 633 women). Preterm delivery before 37 weeks Compared to placebo, calcium may result in little to no difference in preterm delivery before 37 weeks (RR 0.94, 95% CI 0.74 to 1.19; 1 RCT, 1355 women; RD 11/1000 fewer, 95% CI 46 fewer to 33 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.90 (95% CI 0.74 to 1.11; 1 RCT, 633 women). Stillbirth The evidence is very uncertain about the effect of calcium compared to placebo on stillbirth (RR 0.82, 95% CI 0.50 to 1.34; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 24 fewer to 17 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.79 (95% CI 0.48 to 1.27; 1 RCT, 633 women). The included trial did not measure perinatal loss, maternal adverse effects, neonatal death or severe morbidity, neonatal death, or early neonatal death."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "When all randomised women are considered, calcium commenced before pregnancy may result in little to no difference in pre-eclampsia or pregnancy loss, and pre-eclampsia. When only pregnant women are considered, calcium may result in little to no difference in pre-eclampsia but may result in a slight reduction in pre-eclampsia or pregnancy loss. No trials measured perinatal loss. The evidence is drawn from one trial of calcium supplementation that commenced before and continued into the first half of pregnancy. Current evidence neither supports nor refutes the routine use of calcium supplementation commencing before conception."
        },
        {
          "label": "FUNDING",
          "text": "This review was funded in part by the World Health Organization."
        },
        {
          "label": "REGISTRATION",
          "text": "Updated protocol (2025): PROSPERO: CRD420250649571 Review update (2019): DOI: 10.1002/14651858.CD011192.pub3 Original review (2017): DOI: 10.1002/14651858.CD011192.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40965861/",
      "pubDate": "2025 Sep 18",
      "doi": "10.1002/14651858.CD011192.pub4",
      "dateReceived": "2025-10-21T23:24:46.317Z",
      "isNew": false,
      "summary": "Calcium supplementation started before pregnancy may have little to no effect on pre-eclampsia or pregnancy loss, but may slightly reduce pre-eclampsia or pregnancy loss when started during pregnancy."
    },
    {
      "id": "edc6dfd54fd0",
      "title": "Using ``HINTS family`` to diagnose stroke in the acute vestibular syndrome: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48520543/117852",
      "abstract": "Acute vestibular syndrome (AVS) often arises from benign peripheral causes, yet the critical need to distinguish dangerous causes, notably stroke, persists. The Head Impulse test, Nystagmus, Test of Skew (HINTS) examination has emerged as a bedside test to identify stroke. HINTS plus hearing loss and video-oculography-HINTS (v-HINTS) have gained traction for stroke diagnosis. This systematic review and meta-analysis aims to assess the accuracy of the \"HINTS family\" of tests (HINTS, HINTS plus, v-HINTS) in diagnosing stroke in AVS. We searched PubMed, Embase, Web of Science, and Cochrane library for prospective studies involving AVS patients diagnosed using MRI and/or CT as the gold standard. Two authors independently screened articles, extracted data, and assessed study quality using QUADAS-2. A meta-analysis was performed using STATA (12.0) and RevMan 5.3. We included 11 studies in the analysis: 11 for HINTS (n = 1286), 2 for HINTS plus (n = 265), and 1 for v-HINTS (n = 50). Their sensitivities for stroke were 0.97 (95 %CI: 0.94-0.99), 0.99 (0.95-1.00) and 1.00, with specificities of 0.81 (0.72-0.88), 0.82 (0.74-0.88), and 0.90, respectively. LR+ for stroke were 5.2 (95 %CI: 3.3-8.2), 5.5 (3.8-8.2) and 9.75. Youden index were 0.78, 0.81 and 0.90. The AUC for HINTS and HINTS plus in diagnosing stroke were 0.98 and 0.99. \"HINTS Family\" examinations are generally effective in detecting stroke in AVS patients, especially those with stroke risk factors. HINTS plus outperforms the HINTS examination. Furthermore, v-HINTS exhibits the highest accuracy, highlighting the importance of using VOG devices for acute stroke diagnosis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Acute vestibular syndrome (AVS) often arises from benign peripheral causes, yet the critical need to distinguish dangerous causes, notably stroke, persists. The Head Impulse test, Nystagmus, Test of Skew (HINTS) examination has emerged as a bedside test to identify stroke. HINTS plus hearing loss and video-oculography-HINTS (v-HINTS) have gained traction for stroke diagnosis. This systematic review and meta-analysis aims to assess the accuracy of the \"HINTS family\" of tests (HINTS, HINTS plus, v-HINTS) in diagnosing stroke in AVS."
        },
        {
          "label": "METHOD",
          "text": "We searched PubMed, Embase, Web of Science, and Cochrane library for prospective studies involving AVS patients diagnosed using MRI and/or CT as the gold standard. Two authors independently screened articles, extracted data, and assessed study quality using QUADAS-2. A meta-analysis was performed using STATA (12.0) and RevMan 5.3."
        },
        {
          "label": "RESULTS",
          "text": "We included 11 studies in the analysis: 11 for HINTS (n = 1286), 2 for HINTS plus (n = 265), and 1 for v-HINTS (n = 50). Their sensitivities for stroke were 0.97 (95 %CI: 0.94-0.99), 0.99 (0.95-1.00) and 1.00, with specificities of 0.81 (0.72-0.88), 0.82 (0.74-0.88), and 0.90, respectively. LR+ for stroke were 5.2 (95 %CI: 3.3-8.2), 5.5 (3.8-8.2) and 9.75. Youden index were 0.78, 0.81 and 0.90. The AUC for HINTS and HINTS plus in diagnosing stroke were 0.98 and 0.99."
        },
        {
          "label": "CONCLUSION",
          "text": "\"HINTS Family\" examinations are generally effective in detecting stroke in AVS patients, especially those with stroke risk factors. HINTS plus outperforms the HINTS examination. Furthermore, v-HINTS exhibits the highest accuracy, highlighting the importance of using VOG devices for acute stroke diagnosis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41045791/",
      "pubDate": "2025 Sep 08",
      "doi": "10.1016/j.ajem.2025.08.066",
      "dateReceived": "2025-10-21T23:24:46.317Z",
      "isNew": false,
      "summary": "In patients with acute vestibular syndrome (AVS), the HINTS family of examinations effectively detects stroke, with v-HINTS, which incorporates video-oculography (VOG), demonstrating the highest accuracy."
    },
    {
      "id": "db35cc31563f",
      "title": "Synchronised approach for intrauterine insemination in subfertile couples.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Gynecology",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48520543/117777",
      "abstract": "Intrauterine insemination (IUI) is widely used as a first-line treatment for subfertile couples with favourable prognostic factors, yet pregnancy rates vary considerably. The optimal method for timing IUI - whether through different monitoring strategies or ovulation triggering techniques in natural or stimulated cycles - remains uncertain. This review explores which timing approaches and methods of ovulation monitoring and triggering lead to the best outcomes, including live birth and clinical pregnancy. It updates a Cochrane review last published in 2014. To evaluate the effectiveness of different methods of synchronisation of insemination with ovulation on live birth or ongoing pregnancy, in natural and stimulated cycles for IUI in subfertile couples. We used the Cochrane Gynaecology and Fertility Group specialised register, CENTRAL, MEDLINE, and two other databases, along with reference checking, citation searching, handsearching of conference abstracts, and contact with study authors to identify the studies included in the review. The latest search date was October 2023. We included randomised controlled trials (RCTs) comparing timing methods in natural or stimulated cycles, and different ovulation triggering methods. These included: varying the time interval between ovulation triggering and insemination, luteinising hormone (LH) detection in urine, LH detection in blood, basal body temperature charts, ultrasound detection of ovulation, human chorionic gonadotropin (hCG) administration, a combination of LH detection and hCG administration, gonadotropin-releasing hormone (GnRH) agonist administration, and other trigger administrations. Critical outcome: live birth or ongoing pregnancy rate per couple. Important outcomes (all are rate per couple): clinical pregnancy; multiple pregnancy; miscarriage; ovarian hyperstimulation syndrome; tubal pregnancy. We used the Cochrane Collaboration's original tool to assess the risk of bias in the included RCTs. After the search, we screened the trials, extracted the data, and assessed the risk of bias and trustworthiness of the included studies. We synthesised results for each outcome using meta-analysis where possible. We expressed results for each included study as Mantel-Haenszel odds ratios (OR) with 95% confidence intervals (CI). We used GRADE to assess the certainty of the evidence for each outcome. This review update includes 42 studies: 18 from the 2014 version, plus 24 studies newly identified in the updated search. Of the 42 included studies (a total of 6603 couples), we included seven in the primary meta-analyses (1917 couples) and 12 in the sensitivity meta-analyses (2143 couples). The certainty of the evidence was low for most comparisons. The main limitation of the evidence was serious imprecision. Of the seven studies included in the primary analyses, two compared the optimum time interval from hCG injection to IUI for live birth or ongoing pregnancy rate, comparing different time frames ranging from 0 to 48 hours. We categorised the time frames into three groups: (i) 0 to 33 hours; (ii) 34 to 40 hours; and (iii) more than 40 hours. We compared 0 to 33 hours versus 34 to 40 hours, and 34 to 40 hours versus more than 40 hours. Results were too imprecise to be informative in both comparisons (0 to 33 hours versus 34 to 40 hours: OR 1.42, 95% CI 0.90 to 2.23; 1 study, 374 couples; 34 to 40 hours versus more than 40 hours: OR 0.45, 95% CI 0.15 to 1.33; 1 study, 107 couples). We included one study in the primary analysis for each of the following comparisons: hCG versus LH surge; recombinant hCG versus urinary hCG; and hCG alone versus hCG plus follicle-stimulating hormone (FSH). It is unclear whether there might be a difference in live birth or ongoing pregnancy rates in the first two comparisons: hCG versus LH surge: OR 1.08, 95% CI 0.50 to 2.37; 1 study, 392 couples; low-certainty evidence; recombinant hCG versus urinary hCG: OR 1.13, 95% CI 0.49 to 2.63; 1 study, 125 couples; low-certainty evidence. However, live birth or ongoing pregnancy rates may be lower with hCG alone compared to hCG plus FSH (OR 0.35, 95% CI 0.13 to 0.95; 1 study, 108 couples; low-certainty evidence). We found no clear evidence of a difference between any of the groups in clinical pregnancy rate or adverse events (multiple pregnancy rate, miscarriage rate, tubal pregnancy rate). However, all results were of low-certainty evidence. None of the studies included in the primary analyses reported on ovarian hyperstimulation syndrome. There is insufficient evidence to determine whether there is any difference in effectiveness between different methods of synchronisation of ovulation and insemination. This Cochrane review had no dedicated funding. First review update (2014): doi.org/10.1002/14651858.CD006942.pub3 Review (2010): doi.org/10.1002/14651858.CD006942.pub2 Protocol (2008): doi.org/10.1002/14651858.CD006942.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Intrauterine insemination (IUI) is widely used as a first-line treatment for subfertile couples with favourable prognostic factors, yet pregnancy rates vary considerably. The optimal method for timing IUI - whether through different monitoring strategies or ovulation triggering techniques in natural or stimulated cycles - remains uncertain. This review explores which timing approaches and methods of ovulation monitoring and triggering lead to the best outcomes, including live birth and clinical pregnancy. It updates a Cochrane review last published in 2014."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the effectiveness of different methods of synchronisation of insemination with ovulation on live birth or ongoing pregnancy, in natural and stimulated cycles for IUI in subfertile couples."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used the Cochrane Gynaecology and Fertility Group specialised register, CENTRAL, MEDLINE, and two other databases, along with reference checking, citation searching, handsearching of conference abstracts, and contact with study authors to identify the studies included in the review. The latest search date was October 2023."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) comparing timing methods in natural or stimulated cycles, and different ovulation triggering methods. These included: varying the time interval between ovulation triggering and insemination, luteinising hormone (LH) detection in urine, LH detection in blood, basal body temperature charts, ultrasound detection of ovulation, human chorionic gonadotropin (hCG) administration, a combination of LH detection and hCG administration, gonadotropin-releasing hormone (GnRH) agonist administration, and other trigger administrations."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcome: live birth or ongoing pregnancy rate per couple. Important outcomes (all are rate per couple): clinical pregnancy; multiple pregnancy; miscarriage; ovarian hyperstimulation syndrome; tubal pregnancy."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane Collaboration's original tool to assess the risk of bias in the included RCTs."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "After the search, we screened the trials, extracted the data, and assessed the risk of bias and trustworthiness of the included studies. We synthesised results for each outcome using meta-analysis where possible. We expressed results for each included study as Mantel-Haenszel odds ratios (OR) with 95% confidence intervals (CI). We used GRADE to assess the certainty of the evidence for each outcome."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This review update includes 42 studies: 18 from the 2014 version, plus 24 studies newly identified in the updated search."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Of the 42 included studies (a total of 6603 couples), we included seven in the primary meta-analyses (1917 couples) and 12 in the sensitivity meta-analyses (2143 couples). The certainty of the evidence was low for most comparisons. The main limitation of the evidence was serious imprecision. Of the seven studies included in the primary analyses, two compared the optimum time interval from hCG injection to IUI for live birth or ongoing pregnancy rate, comparing different time frames ranging from 0 to 48 hours. We categorised the time frames into three groups: (i) 0 to 33 hours; (ii) 34 to 40 hours; and (iii) more than 40 hours. We compared 0 to 33 hours versus 34 to 40 hours, and 34 to 40 hours versus more than 40 hours. Results were too imprecise to be informative in both comparisons (0 to 33 hours versus 34 to 40 hours: OR 1.42, 95% CI 0.90 to 2.23; 1 study, 374 couples; 34 to 40 hours versus more than 40 hours: OR 0.45, 95% CI 0.15 to 1.33; 1 study, 107 couples). We included one study in the primary analysis for each of the following comparisons: hCG versus LH surge; recombinant hCG versus urinary hCG; and hCG alone versus hCG plus follicle-stimulating hormone (FSH). It is unclear whether there might be a difference in live birth or ongoing pregnancy rates in the first two comparisons: hCG versus LH surge: OR 1.08, 95% CI 0.50 to 2.37; 1 study, 392 couples; low-certainty evidence; recombinant hCG versus urinary hCG: OR 1.13, 95% CI 0.49 to 2.63; 1 study, 125 couples; low-certainty evidence. However, live birth or ongoing pregnancy rates may be lower with hCG alone compared to hCG plus FSH (OR 0.35, 95% CI 0.13 to 0.95; 1 study, 108 couples; low-certainty evidence). We found no clear evidence of a difference between any of the groups in clinical pregnancy rate or adverse events (multiple pregnancy rate, miscarriage rate, tubal pregnancy rate). However, all results were of low-certainty evidence. None of the studies included in the primary analyses reported on ovarian hyperstimulation syndrome."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is insufficient evidence to determine whether there is any difference in effectiveness between different methods of synchronisation of ovulation and insemination."
        },
        {
          "label": "FUNDING",
          "text": "This Cochrane review had no dedicated funding."
        },
        {
          "label": "REGISTRATION",
          "text": "First review update (2014): doi.org/10.1002/14651858.CD006942.pub3 Review (2010): doi.org/10.1002/14651858.CD006942.pub2 Protocol (2008): doi.org/10.1002/14651858.CD006942."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40985294/",
      "pubDate": "2025 Sep 23",
      "doi": "10.1002/14651858.CD006942.pub4",
      "dateReceived": "2025-10-21T23:24:46.317Z",
      "isNew": false,
      "summary": "The effectiveness of different methods for synchronizing ovulation and insemination remains uncertain due to a lack of sufficient evidence."
    },
    {
      "id": "b88c4b54bfed",
      "title": "Efficacy of Adding Intravenous Saline Solution to Nonsteroidal Anti-Inflammatory Drug-Based Treatment of Acute Migraine in the Emergency Department.",
      "journal": "Ann Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117864",
      "abstract": "Intravenous fluid administration is frequently used alongside nonsteroidal anti-inflammatory drugs (NSAIDs) in the treatment of acute migraine in emergency departments (EDs), despite a lack of clear evidence supporting its benefit. The objective of this study was to evaluate whether the addition of 1,000 mL intravenous normal saline solution to standard NSAID-based treatment improves clinical outcomes in adults presenting to the ED with acute migraine. It was a double-blind, parallel-group, randomized controlled trial in single tertiary care academic ED (June 2020 to June 2021). Adults aged ≥18 years with migraine per International Classification of Headache Disorders, 3rd edition criteria, presenting with an acute attack. Patients with dehydration, recent intravenous fluid use, or contraindications were excluded. Of 955 screened patients, 128 were randomized; 125 were analyzed. All patients received 75 mg intramuscular diclofenac. The intervention group received 1,000 mL intravenous saline solution over 1 hour; the control group received 10 mL intravenous saline solution over 1 hour. The primary outcome was change in headache severity (100-mm visual analog scale [VAS]) at 2 hours. Secondary outcomes included rescue medication use, ED length of stay, adverse events, and functional disability. Median VAS reduction was 62.0 mm (IQR 37.5-82.0) in the intervention group vs 48.0 mm (26.0-74.0) in controls; the Hodges-Lehmann estimated between-group difference was 10.0 mm (95% CI -2.0 to 20.0). We found no between-group differences in nausea VAS or functional disability across time points. Rescue medication use was lower in the intervention group (23.8%) than in controls (42.5%) (absolute difference 18.6%, 95% CI 2.1% to 35.0%). Median ED length of stay was shorter in the intervention group (150 vs 168 minutes; difference 19 minutes, 95% CI 0 to 39). No serious adverse events occurred; 24-hour survey outcomes were similar between groups. Adding 1,000 mL intravenous saline solution to NSAID-based therapy did not produce a clear improvement in pain relief at 2 hours. Lower rescue medication use and shorter ED length of stay in the intervention group are secondary findings that may be influenced by unblinded administering staff and should be interpreted cautiously. Routine intravenous fluids should be considered selectively, particularly for patients with clinical signs of dehydration.",
      "structuredAbstract": [
        {
          "label": "STUDY OBJECTIVE",
          "text": "Intravenous fluid administration is frequently used alongside nonsteroidal anti-inflammatory drugs (NSAIDs) in the treatment of acute migraine in emergency departments (EDs), despite a lack of clear evidence supporting its benefit. The objective of this study was to evaluate whether the addition of 1,000 mL intravenous normal saline solution to standard NSAID-based treatment improves clinical outcomes in adults presenting to the ED with acute migraine."
        },
        {
          "label": "METHODS",
          "text": "It was a double-blind, parallel-group, randomized controlled trial in single tertiary care academic ED (June 2020 to June 2021). Adults aged ≥18 years with migraine per International Classification of Headache Disorders, 3rd edition criteria, presenting with an acute attack. Patients with dehydration, recent intravenous fluid use, or contraindications were excluded. Of 955 screened patients, 128 were randomized; 125 were analyzed. All patients received 75 mg intramuscular diclofenac. The intervention group received 1,000 mL intravenous saline solution over 1 hour; the control group received 10 mL intravenous saline solution over 1 hour. The primary outcome was change in headache severity (100-mm visual analog scale [VAS]) at 2 hours. Secondary outcomes included rescue medication use, ED length of stay, adverse events, and functional disability."
        },
        {
          "label": "RESULTS",
          "text": "Median VAS reduction was 62.0 mm (IQR 37.5-82.0) in the intervention group vs 48.0 mm (26.0-74.0) in controls; the Hodges-Lehmann estimated between-group difference was 10.0 mm (95% CI -2.0 to 20.0). We found no between-group differences in nausea VAS or functional disability across time points. Rescue medication use was lower in the intervention group (23.8%) than in controls (42.5%) (absolute difference 18.6%, 95% CI 2.1% to 35.0%). Median ED length of stay was shorter in the intervention group (150 vs 168 minutes; difference 19 minutes, 95% CI 0 to 39). No serious adverse events occurred; 24-hour survey outcomes were similar between groups."
        },
        {
          "label": "CONCLUSION",
          "text": "Adding 1,000 mL intravenous saline solution to NSAID-based therapy did not produce a clear improvement in pain relief at 2 hours. Lower rescue medication use and shorter ED length of stay in the intervention group are secondary findings that may be influenced by unblinded administering staff and should be interpreted cautiously. Routine intravenous fluids should be considered selectively, particularly for patients with clinical signs of dehydration."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41071134/",
      "pubDate": "2025 Oct 09",
      "doi": "10.1016/j.annemergmed.2025.09.013",
      "dateReceived": "2025-10-21T23:24:46.316Z",
      "isNew": false,
      "summary": "Intravenous saline added to NSAID therapy did not significantly improve pain relief at two hours, and secondary benefits like reduced rescue medication and ED stay should be viewed with caution."
    },
    {
      "id": "46f7744e59ac",
      "title": "Fractional flow reserve-guided renal artery stenting in atherosclerotic renovascular hypertension: the FAIR randomized trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48513868/117847",
      "abstract": "The optimal therapy for patients with atherosclerotic renal artery stenosis (ARAS) remains unresolved. This study compared the efficacy of renal fractional flow reserve (FFR)-guided revascularization and traditional angiography-guided revascularization. In total, 101 patients with ARAS and hypertension were randomly assigned to either the FFR-guided or angiography-guided group (ClinicalTrials.gov identifier: NCT05732077). Stenting was performed in the angiography-guided group regardless of FFR, whereas stenting was only performed in the FFR-guided group for patients with FFR < 0.80. The primary endpoints were the percentage changes in ambulatory daytime mean systolic blood pressure (DMSBP) and composite index of antihypertensive medicines (CIAHM) after 3 months. The percentage changes in DMSBP (4% [-2%, 11%] vs 4% [-3%, 10%]; P = .97) and CIAHM (0% [0%, 3%] vs 1% [0%, 4%]; P = .33) did not differ between groups. However, the rate of stenting was significantly lower in the FFR-guided group (46.0% vs 100.0%, P < .01). Moreover, compared with the findings in patients with FFR ≥ 0.80 who did not receive stenting, stenting was beneficial in patients with FFR < 0.80 (adjusted mean DMSBP reduction, 6.2 [95% confidence interval {CI}, 0.6-11.9] mmHg; mean CIAHM reduction, 3.1 [95% CI, 1.5-4.7]), but not in those with FFR ≥ 0.80 (1.4 [95% CI, -4.5-7.2] mmHg, and 0.7 [95% CI, -1.1-2.5], respectively). FFR-guided revascularization significantly reduced unnecessary stenting compared with angiography-guided revascularization. Both blood pressure and antihypertensive medication usage decreased significantly after stenting in patients with FFR < 0.80.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "The optimal therapy for patients with atherosclerotic renal artery stenosis (ARAS) remains unresolved. This study compared the efficacy of renal fractional flow reserve (FFR)-guided revascularization and traditional angiography-guided revascularization."
        },
        {
          "label": "METHODS",
          "text": "In total, 101 patients with ARAS and hypertension were randomly assigned to either the FFR-guided or angiography-guided group (ClinicalTrials.gov identifier: NCT05732077). Stenting was performed in the angiography-guided group regardless of FFR, whereas stenting was only performed in the FFR-guided group for patients with FFR < 0.80. The primary endpoints were the percentage changes in ambulatory daytime mean systolic blood pressure (DMSBP) and composite index of antihypertensive medicines (CIAHM) after 3 months."
        },
        {
          "label": "RESULTS",
          "text": "The percentage changes in DMSBP (4% [-2%, 11%] vs 4% [-3%, 10%]; P = .97) and CIAHM (0% [0%, 3%] vs 1% [0%, 4%]; P = .33) did not differ between groups. However, the rate of stenting was significantly lower in the FFR-guided group (46.0% vs 100.0%, P < .01). Moreover, compared with the findings in patients with FFR ≥ 0.80 who did not receive stenting, stenting was beneficial in patients with FFR < 0.80 (adjusted mean DMSBP reduction, 6.2 [95% confidence interval {CI}, 0.6-11.9] mmHg; mean CIAHM reduction, 3.1 [95% CI, 1.5-4.7]), but not in those with FFR ≥ 0.80 (1.4 [95% CI, -4.5-7.2] mmHg, and 0.7 [95% CI, -1.1-2.5], respectively)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "FFR-guided revascularization significantly reduced unnecessary stenting compared with angiography-guided revascularization. Both blood pressure and antihypertensive medication usage decreased significantly after stenting in patients with FFR < 0.80."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41056188/",
      "pubDate": "2025 Oct 07",
      "doi": "10.1093/eurheartj/ehaf746",
      "dateReceived": "2025-10-20T23:23:11.117Z",
      "isNew": false,
      "summary": "FFR-guided revascularization led to less unnecessary stenting and improved blood pressure control in patients with functionally significant stenosis."
    },
    {
      "id": "ba23c267a537",
      "title": "Reevaluating Nonoperative Management for Pediatric Uncomplicated Acute Appendicitis: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Gastroenterology",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48595609/117868",
      "abstract": "Nonoperative management (NOM) has emerged as a potential alternative to surgery for acute uncomplicated appendicitis in children; however, while short-term outcomes are often favorable, concerns remain about treatment durability, complication rates, and long-term failure. An updated meta-analysis of randomized clinical trials (RCTs) may help clarify the comparative safety and effectiveness of NOM vs appendectomy. To evaluate the safety and effectiveness of NOM compared with appendectomy for uncomplicated appendicitis in children using the highest level of available evidence. A systematic review of PubMed, Embase, Scopus, Cochrane, and Web of Science was conducted from inception through March 2025 to identify randomized clinical trials comparing NOM with surgical management in pediatric patients. RCTs comparing NOM vs surgical management in pediatric patients younger than 18 years were included. Nonrandomized and quasi-randomized studies were excluded. Data were extracted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Meta-analyses were conducted using random-effects models. Risk of bias was assessed independently by multiple reviewers. Trial sequential analysis was performed to determine whether the evidence was sufficiently robust and conclusive. The primary outcomes were treatment failure and treatment success in 1 year and major complications (Clavien-Dindo grade ≥IIIb). Secondary outcomes included time to return to school and time to return to normal activity. Of 1246 studies screened, 7 RCTs, including 1480 pediatric patients, met inclusion criteria. Treatment failure was significantly higher in the NOM group than in the appendectomy group at 1 year (risk ratio [RR], 4.97; 95% CI, 3.57-6.91; I2 = 0.0%). Treatment success was significantly lower in the NOM group at 1 year (RR, 0.67; 95% CI, 0.60-0.75; I2 = 31.1%). Major complications classified as Clavien-Dindo grade IIIb or worse were more frequent in the NOM group (RR, 33.37; 95% CI, 7.89-141.05; I2 = 9.5%). Appendicitis recurred at a rate of 18.47 events/100 observations (95% CI, 12.62-25.07 events/100 observations; I2 = 48.5%) among patients who received NOM. NOM, compared with appendectomy, was associated with a modestly faster return to school (mean difference, -1.36 days; 95% CI, -2.64 to -0.08 days; P = .04; I2 = 57.7%) and return to normal activities (-4.93 days; 95% CI, -8.68 to -1.19 days; P = .01; I2 = 87.2%), although this may be offset by subsequent readmissions or reintervention. Trial sequential analysis demonstrated the robustness and conclusiveness of primary outcomes. In contrast to earlier studies, this meta-analysis found significantly higher treatment failure and major complication rates within a year with NOM among children and adolescents. The meta-analysis provides pediatricians and pediatric surgeons with up-to-date data to inform shared decision-making with families and encourage individualized, patient-centered treatment.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Nonoperative management (NOM) has emerged as a potential alternative to surgery for acute uncomplicated appendicitis in children; however, while short-term outcomes are often favorable, concerns remain about treatment durability, complication rates, and long-term failure. An updated meta-analysis of randomized clinical trials (RCTs) may help clarify the comparative safety and effectiveness of NOM vs appendectomy."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the safety and effectiveness of NOM compared with appendectomy for uncomplicated appendicitis in children using the highest level of available evidence."
        },
        {
          "label": "DATA SOURCES",
          "text": "A systematic review of PubMed, Embase, Scopus, Cochrane, and Web of Science was conducted from inception through March 2025 to identify randomized clinical trials comparing NOM with surgical management in pediatric patients."
        },
        {
          "label": "STUDY SELECTION",
          "text": "RCTs comparing NOM vs surgical management in pediatric patients younger than 18 years were included. Nonrandomized and quasi-randomized studies were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Data were extracted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Meta-analyses were conducted using random-effects models. Risk of bias was assessed independently by multiple reviewers. Trial sequential analysis was performed to determine whether the evidence was sufficiently robust and conclusive."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were treatment failure and treatment success in 1 year and major complications (Clavien-Dindo grade ≥IIIb). Secondary outcomes included time to return to school and time to return to normal activity."
        },
        {
          "label": "RESULTS",
          "text": "Of 1246 studies screened, 7 RCTs, including 1480 pediatric patients, met inclusion criteria. Treatment failure was significantly higher in the NOM group than in the appendectomy group at 1 year (risk ratio [RR], 4.97; 95% CI, 3.57-6.91; I2 = 0.0%). Treatment success was significantly lower in the NOM group at 1 year (RR, 0.67; 95% CI, 0.60-0.75; I2 = 31.1%). Major complications classified as Clavien-Dindo grade IIIb or worse were more frequent in the NOM group (RR, 33.37; 95% CI, 7.89-141.05; I2 = 9.5%). Appendicitis recurred at a rate of 18.47 events/100 observations (95% CI, 12.62-25.07 events/100 observations; I2 = 48.5%) among patients who received NOM. NOM, compared with appendectomy, was associated with a modestly faster return to school (mean difference, -1.36 days; 95% CI, -2.64 to -0.08 days; P = .04; I2 = 57.7%) and return to normal activities (-4.93 days; 95% CI, -8.68 to -1.19 days; P = .01; I2 = 87.2%), although this may be offset by subsequent readmissions or reintervention. Trial sequential analysis demonstrated the robustness and conclusiveness of primary outcomes."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In contrast to earlier studies, this meta-analysis found significantly higher treatment failure and major complication rates within a year with NOM among children and adolescents. The meta-analysis provides pediatricians and pediatric surgeons with up-to-date data to inform shared decision-making with families and encourage individualized, patient-centered treatment."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41046476/",
      "pubDate": "2025 Oct 05",
      "doi": "10.1001/jamapediatrics.2025.4091",
      "dateReceived": "2025-10-20T23:23:11.116Z",
      "isNew": false,
      "summary": "Non-operative management (NOM) in children and adolescents resulted in significantly higher treatment failure and major complication rates within a year compared to previous findings."
    },
    {
      "id": "8e7f67835bb4",
      "title": "Impact of exercise training during pregnancy on maternal biomarkers: a systematic review.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48588298/117892",
      "abstract": "The aim of this systematic review was to identify and analyze biomarkers that are influenced by physical exercise during pregnancy and that contribute to maternal-fetal health and development. A comprehensive systematic search of PubMed, Web of Science, and Elton B. Stephens Company Host databases was conducted without time restriction in accordance with Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines (PROSPERO ID: CRD420251017740). Eligible studies were randomized controlled trials examining the effects of exercise interventions during pregnancy on biomarkers measured in maternal serum, umbilical cord blood, breast milk, and placental tissue. Eleven randomized controlled trials meeting the inclusion criteria were analyzed. The effects of different exercise modalities, durations, and intensities on a wide range of biomarkers were evaluated. Exercise interventions performed for 12 weeks or longer with 2 to 3 weekly sessions at moderate-to-vigorous intensity, demonstrated substantial effects on several biomarkers. These included a reduction in proinflammatory markers (TNF-α, interleukin 6), an increase in antiinflammatory cytokines (interleukin 10), improved lipid profiles (lower low-density lipoprotein, triglycerides), improved glucose regulation, and favorable changes in hormonal markers such as leptin and brain-derived neurotrophic factor. Additionally, exercise was associated with positive changes in umbilical cord blood cytokines, immunologic composition of breast milk, and placental mineral content. Structured exercise programs during pregnancy, particularly resistance training and aerobic exercise performed in the same session, show promising effects on modulating inflammatory, metabolic, and immunologic biomarkers that may contribute to improved maternal-fetal health outcomes. However, current evidence is limited by methodological heterogeneity and lack of data from early pregnancy.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "The aim of this systematic review was to identify and analyze biomarkers that are influenced by physical exercise during pregnancy and that contribute to maternal-fetal health and development."
        },
        {
          "label": "DATA SOURCES",
          "text": "A comprehensive systematic search of PubMed, Web of Science, and Elton B. Stephens Company Host databases was conducted without time restriction in accordance with Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines (PROSPERO ID: CRD420251017740)."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Eligible studies were randomized controlled trials examining the effects of exercise interventions during pregnancy on biomarkers measured in maternal serum, umbilical cord blood, breast milk, and placental tissue."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Eleven randomized controlled trials meeting the inclusion criteria were analyzed. The effects of different exercise modalities, durations, and intensities on a wide range of biomarkers were evaluated."
        },
        {
          "label": "RESULTS",
          "text": "Exercise interventions performed for 12 weeks or longer with 2 to 3 weekly sessions at moderate-to-vigorous intensity, demonstrated substantial effects on several biomarkers. These included a reduction in proinflammatory markers (TNF-α, interleukin 6), an increase in antiinflammatory cytokines (interleukin 10), improved lipid profiles (lower low-density lipoprotein, triglycerides), improved glucose regulation, and favorable changes in hormonal markers such as leptin and brain-derived neurotrophic factor. Additionally, exercise was associated with positive changes in umbilical cord blood cytokines, immunologic composition of breast milk, and placental mineral content."
        },
        {
          "label": "CONCLUSION",
          "text": "Structured exercise programs during pregnancy, particularly resistance training and aerobic exercise performed in the same session, show promising effects on modulating inflammatory, metabolic, and immunologic biomarkers that may contribute to improved maternal-fetal health outcomes. However, current evidence is limited by methodological heterogeneity and lack of data from early pregnancy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40947085/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1016/j.ajog.2025.09.021",
      "dateReceived": "2025-10-19T23:22:58.449Z",
      "isNew": false,
      "summary": "Structured exercise, especially combined resistance and aerobic training, during pregnancy may improve maternal and fetal health by positively influencing inflammatory, metabolic, and immune markers, but more research is needed, particularly in early pregnancy."
    },
    {
      "id": "c3d7e587a38a",
      "title": "Comparative efficacy and safety of exercise modalities in knee osteoarthritis: systematic review and network meta-analysis.",
      "journal": "BMJ",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48588298/117890",
      "abstract": "To assess the efficacy and safety of various exercise modalities as therapeutic interventions for managing knee osteoarthritis. Systematic review with network meta-analysis. PubMed, Embase, Cochrane Library, Web of Science, CINAHL, PsycINFO, AMED, PEDro, Scopus, ClinicalTrials.gov, ICTRP, and ClinicalTrialsRegister.eu from database inception to August 2024. Randomised controlled trials comparing different exercise modalities, including aerobic exercise, flexibility exercise, mind-body exercise, neuromotor exercise, strengthening exercise, mixed exercise, and control group for patients with knee osteoarthritis. Primary outcomes included pain, function, gait performance, and quality of life, assessed at short term (four weeks), mid-term (12 weeks), and long term (24 weeks) follow-up. When exact time points were unavailable, data from adjacent time windows were used. 217 randomised controlled trials involving 15 684 participants were included. Moderate certainty evidence showed that, compared with the control group, aerobic exercise probably results in large improvements in pain at short term (standardised mean difference -1.10, 95% confidence interval -1.68 to -0.52) and mid-term follow-up (-1.19, -1.59 to -0.79), function at mid-term (1.78, 1.05 to 2.51), gait performance at mid-term (0.85, 0.55 to 1.14), and quality of life at short term (1.53, 0.47 to 2.59). Mind-body exercise probably results in a large increase in function at short term follow-up (0.88, 0.03 to 1.73; moderate certainty), while neuromotor exercise probably results in a large increase in gait performance at short term follow-up (1.04, 0.51 to 1.57; moderate certainty). Strengthening (0.86, 0.53 to 1.18) and mixed exercise (1.07, 0.68 to 1.46) probably result in a large increase in function at mid-term follow-up, all with moderate certainty evidence. Regarding long term follow-up, flexibility exercise may result in a large reduction in pain (-0.99, -1.63 to -0.36; low certainty); aerobic exercise may result in a large increase in function (0.87, 0.02 to 1.72, low certainty); and mixed exercise may increase function (0.56, 0.26 to 0.86; low certainty) and probably increases gait performance (0.57, 0.21 to 0.92, moderate certainty). Overall, aerobic exercise consistently showed the highest probability of being the best treatment, as reflected by surface under the cumulative ranking curve values (mean 0.72) across outcomes. The safety outcome was reported in a small proportion of studies (40 studies, 18%), and no clear differences were observed between exercise interventions and control. In patients with knee osteoarthritis, aerobic exercise is likely the most beneficial exercise modality for improving pain, function, gait performance, and quality of life, with moderate certainty. PROSPERO CRD42023469762.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of various exercise modalities as therapeutic interventions for managing knee osteoarthritis."
        },
        {
          "label": "DESIGN",
          "text": "Systematic review with network meta-analysis."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, Embase, Cochrane Library, Web of Science, CINAHL, PsycINFO, AMED, PEDro, Scopus, ClinicalTrials.gov, ICTRP, and ClinicalTrialsRegister.eu from database inception to August 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA FOR SELECTING STUDIES",
          "text": "Randomised controlled trials comparing different exercise modalities, including aerobic exercise, flexibility exercise, mind-body exercise, neuromotor exercise, strengthening exercise, mixed exercise, and control group for patients with knee osteoarthritis."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Primary outcomes included pain, function, gait performance, and quality of life, assessed at short term (four weeks), mid-term (12 weeks), and long term (24 weeks) follow-up. When exact time points were unavailable, data from adjacent time windows were used."
        },
        {
          "label": "RESULTS",
          "text": "217 randomised controlled trials involving 15 684 participants were included. Moderate certainty evidence showed that, compared with the control group, aerobic exercise probably results in large improvements in pain at short term (standardised mean difference -1.10, 95% confidence interval -1.68 to -0.52) and mid-term follow-up (-1.19, -1.59 to -0.79), function at mid-term (1.78, 1.05 to 2.51), gait performance at mid-term (0.85, 0.55 to 1.14), and quality of life at short term (1.53, 0.47 to 2.59). Mind-body exercise probably results in a large increase in function at short term follow-up (0.88, 0.03 to 1.73; moderate certainty), while neuromotor exercise probably results in a large increase in gait performance at short term follow-up (1.04, 0.51 to 1.57; moderate certainty). Strengthening (0.86, 0.53 to 1.18) and mixed exercise (1.07, 0.68 to 1.46) probably result in a large increase in function at mid-term follow-up, all with moderate certainty evidence. Regarding long term follow-up, flexibility exercise may result in a large reduction in pain (-0.99, -1.63 to -0.36; low certainty); aerobic exercise may result in a large increase in function (0.87, 0.02 to 1.72, low certainty); and mixed exercise may increase function (0.56, 0.26 to 0.86; low certainty) and probably increases gait performance (0.57, 0.21 to 0.92, moderate certainty). Overall, aerobic exercise consistently showed the highest probability of being the best treatment, as reflected by surface under the cumulative ranking curve values (mean 0.72) across outcomes. The safety outcome was reported in a small proportion of studies (40 studies, 18%), and no clear differences were observed between exercise interventions and control."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with knee osteoarthritis, aerobic exercise is likely the most beneficial exercise modality for improving pain, function, gait performance, and quality of life, with moderate certainty."
        },
        {
          "label": "SYSTEMATIC REVIEW REGISTRATION",
          "text": "PROSPERO CRD42023469762."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41093618/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1136/bmj-2025-085242",
      "dateReceived": "2025-10-19T23:22:58.449Z",
      "isNew": false,
      "summary": "Aerobic exercise is likely the most effective exercise type for improving pain, function, gait, and quality of life in individuals with knee osteoarthritis."
    },
    {
      "id": "7455e3a5ca26",
      "title": "Antibiotic prophylaxis for corneal abrasion.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatric Emergency Medicine",
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48588298/117855",
      "abstract": "Corneal abrasion is a condition frequently treated by eye care professionals, emergency physicians, and primary care physicians. Topical ophthalmic antibiotics are the most common therapy for corneal abrasion. However, there has been no comprehensive summary and synthesis of the evidence regarding antibiotic prophylaxis in traumatic corneal abrasion. In this review update, we evaluated the current evidence regarding the benefits and harms of antibiotic treatment for this relatively common emergency condition. This is an update of a review published in 2022. To assess the benefits and harms of topical antibiotic prophylaxis for corneal abrasion. We searched CENTRAL, MEDLINE, Embase.com, two other databases, and two trials registries together with reference checking to identify studies that are included in the review. The latest search date was 28 March 2025. We included randomized controlled trials (RCTs) comparing an antibiotic with another antibiotic or with placebo in children and adults with corneal abrasion(s). Outcomes included the following: risk of any ocular infection up to one month following corneal abrasion, proportion of eyes healed within 48 hours, participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, complications of corneal abrasion, and treatment-related adverse events at the longest follow-up. Using the Cochrane risk of bias (RoB) 2 tool, we assessed the RoB for the three reported outcomes. We synthesized results for each outcome using meta-analysis by calculating risk ratios (RR) with 95% confidence intervals (CI) for dichotomous outcomes where possible; otherwise, we summarized the results narratively. We used GRADE to assess the certainty of evidence for prespecified outcomes. We included four RCTs enrolling a total of 998 participants, ranging from 20 to 437 participants. The included studies were published from 1975 to 1998, and conducted in Denmark (1), the Republic of Korea (1), and the UK (2). The length of follow-up was 24 hours to four weeks, or unspecified in two studies. Two studies had industry support. Participants had a mean age of 35 years (range 5 to 80 years) in one study, while the other three studies reported age ranges from 15 to 64 years. Most participants had traumatic corneal abrasions, commonly following foreign body removal. Two studies compared topical antibiotics with placebo (vehicle ointment or sodium hyaluronic acid drops), while three studies compared chloramphenicol ointment with antibiotics from other classes. One study was a three-arm study that compared two antibiotic regimens and one vehicle control. We judged the risk of bias from one study as raising some concerns about two efficacy outcomes, and three studies as having a high risk of overall bias across three outcomes. We classified study interventions into two comparisons: 1) antibiotics versus placebo, and 2) chloramphenicol versus other classes of antibiotics. Overall, we judged the certainty of evidence as very low for all outcomes due to imprecision, indirectness, and risk of bias. Two studies compared antibiotics with placebo. For one study, we combined the data for the sulfacetamide sodium and chloramphenicol ointment groups and compared them with a vehicle control group in a three-arm study. This study suggested that antibiotics may increase the risk of ocular infection (RR 1.32, 95% CI 1.03 to 1.70; 1 study, 320 participants). The same study found little to no difference in healing within 48 hours (RR 0.94, 95% CI 0.88 to 1.00). Another study compared tobramycin with sodium hyaluronic acid and reported complete healing in most eyes by 48 hours, with no incidence of infection; however, the study was not included in the meta-analysis because of unit-of-analysis issues. One study reported severe allergic reactions to medication or other adverse events leading to participant withdrawal. The analysis showed no evidence of a difference in treatment-related adverse events between antibiotics and placebo (RR 0.77, 95% CI 0.40 to 1.47; 1 study, 437 participants). Another study reported no adverse events in both arms but was not included in the analysis because it was unclear how the outcomes were measured. Three studies compared chloramphenicol with other classes of antibiotics (fusidic acid or sulfacetamide sodium). The pooled analysis showed little to no difference in the risk of ocular infection within one month (RR 1.07, 95% CI 0.87 to 1.31; 3 studies, 651 participants). One study reported no positive cultures in either group, although minor inflammatory signs (e.g. conjunctival hyperemia) were noted in the chloramphenicol arm. For corneal healing within 48 hours, three studies assessed cure rates within 24 hours using slightly different definitions, but the pooled analysis again showed no clinically meaningful difference between groups (RR 1.00, 95% CI 0.94 to 1.06; 3 studies, 651 participants). Two studies found no evidence of a difference in the incidence of treatment-related adverse events between groups (RR 1.01, 95% CI 0.47 to 2.17; 2 studies, 677 participants). Another study reported that one-third of participants in both groups experienced discomfort or itching, although these outcomes were not reported separately by each treatment arm. For both comparisons, none of the included studies reported the following prespecified outcomes: participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, and complications of corneal abrasion up to the longest follow-up. Given that the evidence supporting antibiotic use in corneal abrasion is of very low certainty, we are not able to support a specific antibiotic regimen or draw conclusions about the effects of antibiotic prophylaxis in preventing ocular infection or accelerating epithelial healing. Future research could explore adequately powered RCTs or alternative approaches, such as target trial emulation, while focusing on high-risk populations and antibiotic formulations. The Cochrane Eyes and Vision US Project is supported by grant UG1EY020522, National Eye Institute, National Institutes of Health. Protocol (2021) DOI: 10.1002/14651858.CD014617 Original Review (2022) DOI: 10.1002/14651858.CD014617.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Corneal abrasion is a condition frequently treated by eye care professionals, emergency physicians, and primary care physicians. Topical ophthalmic antibiotics are the most common therapy for corneal abrasion. However, there has been no comprehensive summary and synthesis of the evidence regarding antibiotic prophylaxis in traumatic corneal abrasion. In this review update, we evaluated the current evidence regarding the benefits and harms of antibiotic treatment for this relatively common emergency condition. This is an update of a review published in 2022."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of topical antibiotic prophylaxis for corneal abrasion."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase.com, two other databases, and two trials registries together with reference checking to identify studies that are included in the review. The latest search date was 28 March 2025."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) comparing an antibiotic with another antibiotic or with placebo in children and adults with corneal abrasion(s)."
        },
        {
          "label": "OUTCOMES",
          "text": "Outcomes included the following: risk of any ocular infection up to one month following corneal abrasion, proportion of eyes healed within 48 hours, participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, complications of corneal abrasion, and treatment-related adverse events at the longest follow-up."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Using the Cochrane risk of bias (RoB) 2 tool, we assessed the RoB for the three reported outcomes."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesized results for each outcome using meta-analysis by calculating risk ratios (RR) with 95% confidence intervals (CI) for dichotomous outcomes where possible; otherwise, we summarized the results narratively. We used GRADE to assess the certainty of evidence for prespecified outcomes."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included four RCTs enrolling a total of 998 participants, ranging from 20 to 437 participants. The included studies were published from 1975 to 1998, and conducted in Denmark (1), the Republic of Korea (1), and the UK (2). The length of follow-up was 24 hours to four weeks, or unspecified in two studies. Two studies had industry support. Participants had a mean age of 35 years (range 5 to 80 years) in one study, while the other three studies reported age ranges from 15 to 64 years. Most participants had traumatic corneal abrasions, commonly following foreign body removal. Two studies compared topical antibiotics with placebo (vehicle ointment or sodium hyaluronic acid drops), while three studies compared chloramphenicol ointment with antibiotics from other classes. One study was a three-arm study that compared two antibiotic regimens and one vehicle control. We judged the risk of bias from one study as raising some concerns about two efficacy outcomes, and three studies as having a high risk of overall bias across three outcomes."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We classified study interventions into two comparisons: 1) antibiotics versus placebo, and 2) chloramphenicol versus other classes of antibiotics. Overall, we judged the certainty of evidence as very low for all outcomes due to imprecision, indirectness, and risk of bias. Two studies compared antibiotics with placebo. For one study, we combined the data for the sulfacetamide sodium and chloramphenicol ointment groups and compared them with a vehicle control group in a three-arm study. This study suggested that antibiotics may increase the risk of ocular infection (RR 1.32, 95% CI 1.03 to 1.70; 1 study, 320 participants). The same study found little to no difference in healing within 48 hours (RR 0.94, 95% CI 0.88 to 1.00). Another study compared tobramycin with sodium hyaluronic acid and reported complete healing in most eyes by 48 hours, with no incidence of infection; however, the study was not included in the meta-analysis because of unit-of-analysis issues. One study reported severe allergic reactions to medication or other adverse events leading to participant withdrawal. The analysis showed no evidence of a difference in treatment-related adverse events between antibiotics and placebo (RR 0.77, 95% CI 0.40 to 1.47; 1 study, 437 participants). Another study reported no adverse events in both arms but was not included in the analysis because it was unclear how the outcomes were measured. Three studies compared chloramphenicol with other classes of antibiotics (fusidic acid or sulfacetamide sodium). The pooled analysis showed little to no difference in the risk of ocular infection within one month (RR 1.07, 95% CI 0.87 to 1.31; 3 studies, 651 participants). One study reported no positive cultures in either group, although minor inflammatory signs (e.g. conjunctival hyperemia) were noted in the chloramphenicol arm. For corneal healing within 48 hours, three studies assessed cure rates within 24 hours using slightly different definitions, but the pooled analysis again showed no clinically meaningful difference between groups (RR 1.00, 95% CI 0.94 to 1.06; 3 studies, 651 participants). Two studies found no evidence of a difference in the incidence of treatment-related adverse events between groups (RR 1.01, 95% CI 0.47 to 2.17; 2 studies, 677 participants). Another study reported that one-third of participants in both groups experienced discomfort or itching, although these outcomes were not reported separately by each treatment arm. For both comparisons, none of the included studies reported the following prespecified outcomes: participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, and complications of corneal abrasion up to the longest follow-up."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Given that the evidence supporting antibiotic use in corneal abrasion is of very low certainty, we are not able to support a specific antibiotic regimen or draw conclusions about the effects of antibiotic prophylaxis in preventing ocular infection or accelerating epithelial healing. Future research could explore adequately powered RCTs or alternative approaches, such as target trial emulation, while focusing on high-risk populations and antibiotic formulations."
        },
        {
          "label": "FUNDING",
          "text": "The Cochrane Eyes and Vision US Project is supported by grant UG1EY020522, National Eye Institute, National Institutes of Health."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2021) DOI: 10.1002/14651858.CD014617 Original Review (2022) DOI: 10.1002/14651858.CD014617.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41017778/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1002/14651858.CD014617.pub3",
      "dateReceived": "2025-10-19T23:22:58.449Z",
      "isNew": false,
      "summary": "Due to insufficient evidence, the effectiveness of antibiotics for preventing infection or improving healing in corneal abrasions remains unclear."
    },
    {
      "id": "b2ce1033dac6",
      "title": "AGA Clinical Practice Guideline on Management of Gastroparesis.",
      "journal": "Gastroenterology",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48505184/117682",
      "abstract": "Gastroparesis is a complex gastric motility disorder characterized by nausea, vomiting, and other symptoms associated with a delay in gastric emptying in the absence of mechanical obstruction. Variations in diagnostic testing and limited effective treatments make caring for this patient population challenging. The American Gastroenterological Association developed this guideline to provide recommendations for ensuring an accurate diagnosis and identifying evidence-based, effective treatments among the available pharmacologic and procedural interventions for patients with idiopathic gastroparesis or gastroparesis related to diabetes. The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and develop this guideline. The Guideline Panel prioritized clinical questions and outcomes, conducted an evidence review, and used the Evidence to Decision Framework to develop recommendations. The Guideline Panel agreed on 12 recommendations. A conditional recommendation was issued against using 2-hour gastric emptying testing and in favor of 4-hour testing in patients with suspected gastroparesis. There are conditional recommendations for the use of metoclopramide and erythromycin in patients with gastroparesis. Conditional recommendations were issued against the use of domperidone, prucalopride, aprepitant, nortriptyline, buspirone, and cannabidiol as first-line therapies. In addition, conditional recommendations were issued against the routine initial use of gastric per-oral endoscopic pyloromyotomy or gastric electrical stimulation in patients with gastroparesis, reserving these treatments for select patients with symptoms refractory to medical therapies. No recommendation was given regarding the use of surgical pyloromyotomy and surgical pyloroplasty, which were identified as procedures with knowledge gaps in their use for treatment for gastroparesis. The diagnosis of gastroparesis requires the use of 4-hour gastric emptying tests. Metoclopramide or erythromycin is appropriate for initial pharmacologic treatment. Other treatment recommendations require shared patient-physician decision making. There are still considerable unmet needs in the treatment of gastroparesis.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "Gastroparesis is a complex gastric motility disorder characterized by nausea, vomiting, and other symptoms associated with a delay in gastric emptying in the absence of mechanical obstruction. Variations in diagnostic testing and limited effective treatments make caring for this patient population challenging. The American Gastroenterological Association developed this guideline to provide recommendations for ensuring an accurate diagnosis and identifying evidence-based, effective treatments among the available pharmacologic and procedural interventions for patients with idiopathic gastroparesis or gastroparesis related to diabetes."
        },
        {
          "label": "METHODS",
          "text": "The Grading of Recommendations Assessment, Development and Evaluation framework was used to assess evidence and develop this guideline. The Guideline Panel prioritized clinical questions and outcomes, conducted an evidence review, and used the Evidence to Decision Framework to develop recommendations."
        },
        {
          "label": "RESULTS",
          "text": "The Guideline Panel agreed on 12 recommendations. A conditional recommendation was issued against using 2-hour gastric emptying testing and in favor of 4-hour testing in patients with suspected gastroparesis. There are conditional recommendations for the use of metoclopramide and erythromycin in patients with gastroparesis. Conditional recommendations were issued against the use of domperidone, prucalopride, aprepitant, nortriptyline, buspirone, and cannabidiol as first-line therapies. In addition, conditional recommendations were issued against the routine initial use of gastric per-oral endoscopic pyloromyotomy or gastric electrical stimulation in patients with gastroparesis, reserving these treatments for select patients with symptoms refractory to medical therapies. No recommendation was given regarding the use of surgical pyloromyotomy and surgical pyloroplasty, which were identified as procedures with knowledge gaps in their use for treatment for gastroparesis."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The diagnosis of gastroparesis requires the use of 4-hour gastric emptying tests. Metoclopramide or erythromycin is appropriate for initial pharmacologic treatment. Other treatment recommendations require shared patient-physician decision making. There are still considerable unmet needs in the treatment of gastroparesis."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40976635/",
      "pubDate": "2025 Oct",
      "doi": "10.1053/j.gastro.2025.08.004",
      "dateReceived": "2025-10-19T23:22:58.449Z",
      "isNew": false,
      "summary": "Gastroparesis diagnosis relies on 4-hour gastric emptying tests, with initial treatment often involving metoclopramide or erythromycin, but further management necessitates collaborative decision-making due to ongoing treatment challenges."
    }
  ]
}