{
  "updated_at": "2025-11-16T23:24:20.519Z",
  "articles": [
    {
      "id": "e2c0564ae2d0",
      "title": "Diagnostic utility of speech-based biomarkers in mild cognitive impairment: a systematic review and meta-analysis.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48849269/118070",
      "abstract": "Among various tools developed for mild cognitive impairment (MCI) detection, analysing speech features is a non-invasive and cost-effective approach that shows promise for early detection. This review aimed to systematically synthesise and analyse current evidence on the diagnostic utility of speech-based biomarkers for identifying MCI. A systematic review and meta-analysis were conducted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. PubMed, Scopus, Ovid Medline and PsycINFO databases were searched up to April 2025 without restrictions on language, article status or year. Of 4432 identified records, 54 peer-reviewed articles met the inclusion criteria. Fixed-effects meta-analyses showed pooled estimates of 80.0% 'accuracy' [95% confidence intervals (CI): 70.0%-89.0%, P < .001, n = 21], 78.0% 'area under the curve' (95% CI: 70.0%-86.0%, P < .001, n = 21), 80.0% 'sensitivity' (95% CI: 71.0%-90.0%, P < .001, n = 22), and 77.0% 'specificity' (95% CI: 65.0%-89.0%, P < .001, n = 15) in differentiating MCI from cognitively unimpaired (CU) individuals. Egger's regression tests indicated no publication bias (P ≥ .299), and the I2 statistic revealed no heterogeneity across studies (I2 = 0.00%, P = 1.00). Four studies also included a subjective cognitive decline group, reporting significant differences in certain speech features compared to CU. Speech analysis demonstrates moderate classification performance, with balanced sensitivity and specificity, in distinguishing MCI from CU, suggesting its potential as an accurate and cost-effective diagnostic tool for MCI detection. Further research is needed to address variations in study methodologies, refine speech analysis protocols and validate findings in diverse populations to enhance generalisability.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Among various tools developed for mild cognitive impairment (MCI) detection, analysing speech features is a non-invasive and cost-effective approach that shows promise for early detection. This review aimed to systematically synthesise and analyse current evidence on the diagnostic utility of speech-based biomarkers for identifying MCI."
        },
        {
          "label": "METHODS",
          "text": "A systematic review and meta-analysis were conducted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. PubMed, Scopus, Ovid Medline and PsycINFO databases were searched up to April 2025 without restrictions on language, article status or year."
        },
        {
          "label": "RESULTS",
          "text": "Of 4432 identified records, 54 peer-reviewed articles met the inclusion criteria. Fixed-effects meta-analyses showed pooled estimates of 80.0% 'accuracy' [95% confidence intervals (CI): 70.0%-89.0%, P < .001, n = 21], 78.0% 'area under the curve' (95% CI: 70.0%-86.0%, P < .001, n = 21), 80.0% 'sensitivity' (95% CI: 71.0%-90.0%, P < .001, n = 22), and 77.0% 'specificity' (95% CI: 65.0%-89.0%, P < .001, n = 15) in differentiating MCI from cognitively unimpaired (CU) individuals. Egger's regression tests indicated no publication bias (P ≥ .299), and the I2 statistic revealed no heterogeneity across studies (I2 = 0.00%, P = 1.00). Four studies also included a subjective cognitive decline group, reporting significant differences in certain speech features compared to CU."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Speech analysis demonstrates moderate classification performance, with balanced sensitivity and specificity, in distinguishing MCI from CU, suggesting its potential as an accurate and cost-effective diagnostic tool for MCI detection. Further research is needed to address variations in study methodologies, refine speech analysis protocols and validate findings in diverse populations to enhance generalisability."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41148189/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf316",
      "dateReceived": "2025-11-16T23:23:49.678Z",
      "isNew": true,
      "summary": "Speech analysis shows promise as a moderately accurate and affordable way to identify mild cognitive impairment (MCI) compared to cognitively unimpaired individuals (CU)."
    },
    {
      "id": "5722ccc719a0",
      "title": "Outcomes of boarding critically ill patients in U.S. EDs: A systematic review and meta-analysis.",
      "journal": "Am J Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/118072",
      "abstract": "Boarding is the practice of holding patients in the emergency department (ED) or a temporary location after the decision to admit or transfer has been made. Previous literature suggests that ED Length of Stay (LOS), prolonged in boarded patients, is linked to worse outcomes. We conducted a systematic review and meta-analysis (SR/MA) to evaluate the differences in mortality and hospital LOS in ED-boarding (EDB) and non-ED boarding (non-EDB) critically ill patients in U.S. EDs. A systematic search was performed with medical librarians using major health science databases from 2012 through December 2024. Eligible studies included observational or randomized trials involving adults comparing EDB and non-EDB groups in U.S. EDs. Only full-text English-language articles were included. Outcomes were mortality and hospital LOS. We used random-effects meta-analysis to compare the outcomes. Heterogeneity was assessed with the I value while publication bias was assessed via the funnel plot. We identified 3139 studies and included 17, comprising 407,178 ED patients: 194,814 (48 %) EDB and 212,364 (52 %) non-EDB. 87.4 % of patients came from urban academic Emergency Departments with a resuscitation unit or team. Median ED LOS was 6.5 h (IQR 5.18-8.1) for EDB and 4.2 h (IQR 2.38-5.75) for non-EDB (p < 0.01). EDB patients had similar all-cause mortality (OR 1.06, 95 % CI 0.94-1.19, I = 69 %, p = 0.38) and hospital LOS (mean difference 0.38 days, 95 % CI -0.75-1.50, I = 61 %, p = 0.51). Funnel plot suggested publication bias favoring higher mortality in EDB. Our SR/MA suggested that EDB was associated with a non-statistically significant increase in mortality and hospital LOS compared to non-EDB. High heterogeneity and inconsistent boarding definitions were also noted.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Boarding is the practice of holding patients in the emergency department (ED) or a temporary location after the decision to admit or transfer has been made. Previous literature suggests that ED Length of Stay (LOS), prolonged in boarded patients, is linked to worse outcomes. We conducted a systematic review and meta-analysis (SR/MA) to evaluate the differences in mortality and hospital LOS in ED-boarding (EDB) and non-ED boarding (non-EDB) critically ill patients in U.S. EDs."
        },
        {
          "label": "METHODS",
          "text": "A systematic search was performed with medical librarians using major health science databases from 2012 through December 2024. Eligible studies included observational or randomized trials involving adults comparing EDB and non-EDB groups in U.S. EDs. Only full-text English-language articles were included. Outcomes were mortality and hospital LOS. We used random-effects meta-analysis to compare the outcomes. Heterogeneity was assessed with the I value while publication bias was assessed via the funnel plot."
        },
        {
          "label": "RESULTS",
          "text": "We identified 3139 studies and included 17, comprising 407,178 ED patients: 194,814 (48 %) EDB and 212,364 (52 %) non-EDB. 87.4 % of patients came from urban academic Emergency Departments with a resuscitation unit or team. Median ED LOS was 6.5 h (IQR 5.18-8.1) for EDB and 4.2 h (IQR 2.38-5.75) for non-EDB (p < 0.01). EDB patients had similar all-cause mortality (OR 1.06, 95 % CI 0.94-1.19, I = 69 %, p = 0.38) and hospital LOS (mean difference 0.38 days, 95 % CI -0.75-1.50, I = 61 %, p = 0.51). Funnel plot suggested publication bias favoring higher mortality in EDB."
        },
        {
          "label": "CONCLUSION",
          "text": "Our SR/MA suggested that EDB was associated with a non-statistically significant increase in mortality and hospital LOS compared to non-EDB. High heterogeneity and inconsistent boarding definitions were also noted."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41151219/",
      "pubDate": "2025 Oct 17",
      "doi": "10.1016/j.ajem.2025.10.036",
      "dateReceived": "2025-11-16T23:23:49.678Z",
      "isNew": true,
      "summary": "Emergency department boarding (EDB) may be linked to a possible, but not statistically significant, increase in mortality and hospital length of stay."
    },
    {
      "id": "8417b56e9afa",
      "title": "Predictive value of clinical risk scores for adverse outcomes and safe discharge in acute lower gastrointestinal bleeding.",
      "journal": "Am J Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48937743/118150",
      "abstract": "This study aims to evaluate the predictive value of various clinical prediction tools in predicting adverse outcomes and safe discharge in patients with lower gastrointestinal bleeding (LGIB). This retrospective cohort study was conducted in the emergency department of a tertiary training and research hospital between October 1, 2017, and October 1, 2022. Adult patients (≥18 years) with a final diagnosis of acute LGIB were included. Demographics, medication history, chief complaints, vital signs, physical examination findings, laboratory results, bleeding sources, adverse outcomes (in-hospital mortality, severe bleeding, transfusion needs, and therapeutic interventions), and the variables needed to calculate the CHAMPS, NOBLADS, Oakland, SALGIB, and Strate scores were recorded, and analysis was performed. A total of 2051 patients were included in the final analysis. The median age of the patients was 59 years (IQR: 42-75), and 40.7 % were female. An adverse outcome occurred in 792 (38.6 %) patients, and severe bleeding occurred in 611 patients (29.8 %). A total of 752 patients (36.7 %) required blood transfusions, and 67 patients (3.3 %) underwent therapeutic intervention. The Oakland score demonstrated the highest predictive performance for adverse outcomes (AUC: 0.902), severe bleeding (AUC: 0.925), and safe discharge (AUC: 0.889). The SALGIB score followed, with AUC values of 0.880, 0.901, and 0.867, respectively, for the same outcomes. The remaining scores exhibited moderate predictive performance across all three outcomes. The Oakland and SALGIB scores outperformed other clinical prediction tools and may aid clinicians in identifying patients at risk of adverse outcomes and making safe discharge decisions in acute LGIB.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "This study aims to evaluate the predictive value of various clinical prediction tools in predicting adverse outcomes and safe discharge in patients with lower gastrointestinal bleeding (LGIB)."
        },
        {
          "label": "METHODS",
          "text": "This retrospective cohort study was conducted in the emergency department of a tertiary training and research hospital between October 1, 2017, and October 1, 2022. Adult patients (≥18 years) with a final diagnosis of acute LGIB were included. Demographics, medication history, chief complaints, vital signs, physical examination findings, laboratory results, bleeding sources, adverse outcomes (in-hospital mortality, severe bleeding, transfusion needs, and therapeutic interventions), and the variables needed to calculate the CHAMPS, NOBLADS, Oakland, SALGIB, and Strate scores were recorded, and analysis was performed."
        },
        {
          "label": "RESULTS",
          "text": "A total of 2051 patients were included in the final analysis. The median age of the patients was 59 years (IQR: 42-75), and 40.7 % were female. An adverse outcome occurred in 792 (38.6 %) patients, and severe bleeding occurred in 611 patients (29.8 %). A total of 752 patients (36.7 %) required blood transfusions, and 67 patients (3.3 %) underwent therapeutic intervention. The Oakland score demonstrated the highest predictive performance for adverse outcomes (AUC: 0.902), severe bleeding (AUC: 0.925), and safe discharge (AUC: 0.889). The SALGIB score followed, with AUC values of 0.880, 0.901, and 0.867, respectively, for the same outcomes. The remaining scores exhibited moderate predictive performance across all three outcomes."
        },
        {
          "label": "CONCLUSION",
          "text": "The Oakland and SALGIB scores outperformed other clinical prediction tools and may aid clinicians in identifying patients at risk of adverse outcomes and making safe discharge decisions in acute LGIB."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41175440/",
      "pubDate": "2025 Oct 25",
      "doi": "10.1016/j.ajem.2025.10.051",
      "dateReceived": "2025-11-16T23:23:49.677Z",
      "isNew": true,
      "summary": "The Oakland and SALGIB scores are effective in predicting adverse outcomes and guiding safe discharge decisions for patients with acute lower gastrointestinal bleeding (LGIB)."
    },
    {
      "id": "9dfd0f4a0422",
      "title": "Therapy for Atrial Fibrillation in Patients with Drug-Eluting Stents.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48929961/118125",
      "abstract": "Despite guideline recommendations, evidence for the use of non-vitamin K antagonist oral anticoagulant (NOAC) monotherapy in patients with atrial fibrillation after implantation of a drug-eluting stent remains limited. In this multicenter, randomized, open-label, noninferiority trial in South Korea, we assigned patients with atrial fibrillation who had undergone the implantation of a drug-eluting stent at least 1 year earlier in a 1:1 ratio to receive NOAC monotherapy or combination therapy (NOAC plus clopidogrel). The primary end point was net adverse clinical events, a composite of death from any cause, myocardial infarction, stent thrombosis, stroke, systemic embolism, or major bleeding or clinically relevant nonmajor bleeding at 12 months. The noninferiority margin was 3.0 percentage points. A total of 960 patients underwent randomization: 482 patients to receive monotherapy and 478 to receive combination therapy. The mean age of the patients was 71.1 years, and 21.4% were women. At 12 months, a primary end-point event had occurred in 46 patients (Kaplan-Meier estimate, 9.6%) in the monotherapy group and in 82 patients (Kaplan-Meier estimate, 17.2%) in the combination-therapy group, for an absolute difference of -7.6 percentage points (95.2% confidence interval [CI], -11.9 to -3.3; P<0.001 for noninferiority) and a hazard ratio of 0.54 (95.2% CI, 0.37 to 0.77; P<0.001 for superiority). Major bleeding or clinically relevant nonmajor bleeding occurred in 25 patients (5.2%) in the monotherapy group and in 63 patients (13.2%) in the combination-therapy group (hazard ratio, 0.38; 95% CI, 0.24 to 0.60). Among patients with atrial fibrillation who had undergone implantation of a drug-eluting stent at least 1 year earlier, NOAC monotherapy was noninferior to combination therapy for net adverse clinical events. (Funded by Cardiovascular Research Center and Samjin Pharmaceutical; ADAPT AF-DES ClinicalTrials.gov number, NCT04250116.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Despite guideline recommendations, evidence for the use of non-vitamin K antagonist oral anticoagulant (NOAC) monotherapy in patients with atrial fibrillation after implantation of a drug-eluting stent remains limited."
        },
        {
          "label": "METHODS",
          "text": "In this multicenter, randomized, open-label, noninferiority trial in South Korea, we assigned patients with atrial fibrillation who had undergone the implantation of a drug-eluting stent at least 1 year earlier in a 1:1 ratio to receive NOAC monotherapy or combination therapy (NOAC plus clopidogrel). The primary end point was net adverse clinical events, a composite of death from any cause, myocardial infarction, stent thrombosis, stroke, systemic embolism, or major bleeding or clinically relevant nonmajor bleeding at 12 months. The noninferiority margin was 3.0 percentage points."
        },
        {
          "label": "RESULTS",
          "text": "A total of 960 patients underwent randomization: 482 patients to receive monotherapy and 478 to receive combination therapy. The mean age of the patients was 71.1 years, and 21.4% were women. At 12 months, a primary end-point event had occurred in 46 patients (Kaplan-Meier estimate, 9.6%) in the monotherapy group and in 82 patients (Kaplan-Meier estimate, 17.2%) in the combination-therapy group, for an absolute difference of -7.6 percentage points (95.2% confidence interval [CI], -11.9 to -3.3; P<0.001 for noninferiority) and a hazard ratio of 0.54 (95.2% CI, 0.37 to 0.77; P<0.001 for superiority). Major bleeding or clinically relevant nonmajor bleeding occurred in 25 patients (5.2%) in the monotherapy group and in 63 patients (13.2%) in the combination-therapy group (hazard ratio, 0.38; 95% CI, 0.24 to 0.60)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with atrial fibrillation who had undergone implantation of a drug-eluting stent at least 1 year earlier, NOAC monotherapy was noninferior to combination therapy for net adverse clinical events. (Funded by Cardiovascular Research Center and Samjin Pharmaceutical; ADAPT AF-DES ClinicalTrials.gov number, NCT04250116.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211917/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2512091",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "In patients with atrial fibrillation and a drug-eluting stent implanted at least a year prior, a NOAC alone was as safe as a NOAC plus another medication for adverse clinical events."
    },
    {
      "id": "cab2369526a9",
      "title": "Nivolumab for Resected Stage III or IV Melanoma at 9 Years.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Dermatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48929961/117989",
      "abstract": "In the CheckMate 238 trial, patients with resected stage IIIB-C or stage IV melanoma who were treated with nivolumab had longer recurrence-free survival than those who received ipilimumab. Data were needed on longer-term survival. We randomly assigned patients in a 1:1 ratio to receive an intravenous infusion of nivolumab (at a dose of 3 mg per kilogram of body weight every 2 weeks) or ipilimumab (at a dose of 10 mg per kilogram every 3 weeks for four doses, then every 12 weeks) for up to 1 year or until disease recurrence or the occurrence of unacceptable toxic effects. Randomization was stratified according to disease stage and status with respect to programmed cell death ligand 1. The primary end point was recurrence-free survival; secondary end points included overall and distant metastasis-free survival and safety. At a minimum follow-up of nearly 9 years (107 months), the median duration of recurrence-free survival was 61.1 months with nivolumab and 24.2 months with ipilimumab (hazard ratio for recurrence or death, 0.76; 95% confidence interval [CI], 0.63 to 0.90); 9-year recurrence-free survival was 44% and 37%, respectively. The median duration of distant metastasis-free survival in patients with stage III melanoma was more than 9 years with nivolumab and 83.8 months with ipilimumab, with 9-year survival of 54% and 48%, respectively (hazard ratio for distant metastasis or death, 0.81; 95% CI, 0.65 to 1.00). The median overall survival was more than 9 years in both trial groups, with 9-year survival of 69% in the nivolumab group and 65% in the ipilimumab group (hazard ratio for death, 0.88; 95.03% CI, 0.69 to 1.11). The rates of death from melanoma at 9 years were 26% with nivolumab and 30% with ipilimumab (hazard ratio, 0.87; 95% CI, 0.67 to 1.13). Subsequent systemic therapy was administered to fewer patients in the nivolumab group than in the ipilimumab group (37.3% vs. 44.6%). No new late adverse events were reported. The 9-year final data support a sustained finding of longer recurrence-free survival with nivolumab than with ipilimumab. (Funded by Bristol Myers Squibb and Ono Pharmaceutical; CheckMate 238 ClinicalTrials.gov number, NCT02388906; Eudra-CT number, 2014-002351-26.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In the CheckMate 238 trial, patients with resected stage IIIB-C or stage IV melanoma who were treated with nivolumab had longer recurrence-free survival than those who received ipilimumab. Data were needed on longer-term survival."
        },
        {
          "label": "METHODS",
          "text": "We randomly assigned patients in a 1:1 ratio to receive an intravenous infusion of nivolumab (at a dose of 3 mg per kilogram of body weight every 2 weeks) or ipilimumab (at a dose of 10 mg per kilogram every 3 weeks for four doses, then every 12 weeks) for up to 1 year or until disease recurrence or the occurrence of unacceptable toxic effects. Randomization was stratified according to disease stage and status with respect to programmed cell death ligand 1. The primary end point was recurrence-free survival; secondary end points included overall and distant metastasis-free survival and safety."
        },
        {
          "label": "RESULTS",
          "text": "At a minimum follow-up of nearly 9 years (107 months), the median duration of recurrence-free survival was 61.1 months with nivolumab and 24.2 months with ipilimumab (hazard ratio for recurrence or death, 0.76; 95% confidence interval [CI], 0.63 to 0.90); 9-year recurrence-free survival was 44% and 37%, respectively. The median duration of distant metastasis-free survival in patients with stage III melanoma was more than 9 years with nivolumab and 83.8 months with ipilimumab, with 9-year survival of 54% and 48%, respectively (hazard ratio for distant metastasis or death, 0.81; 95% CI, 0.65 to 1.00). The median overall survival was more than 9 years in both trial groups, with 9-year survival of 69% in the nivolumab group and 65% in the ipilimumab group (hazard ratio for death, 0.88; 95.03% CI, 0.69 to 1.11). The rates of death from melanoma at 9 years were 26% with nivolumab and 30% with ipilimumab (hazard ratio, 0.87; 95% CI, 0.67 to 1.13). Subsequent systemic therapy was administered to fewer patients in the nivolumab group than in the ipilimumab group (37.3% vs. 44.6%). No new late adverse events were reported."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The 9-year final data support a sustained finding of longer recurrence-free survival with nivolumab than with ipilimumab. (Funded by Bristol Myers Squibb and Ono Pharmaceutical; CheckMate 238 ClinicalTrials.gov number, NCT02388906; Eudra-CT number, 2014-002351-26.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41124198/",
      "pubDate": "2025 Oct 18",
      "doi": "10.1056/NEJMoa2504966",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "Nivolumab demonstrates a durable benefit in extending recurrence-free survival compared to ipilimumab."
    },
    {
      "id": "a13c665d47d8",
      "title": "Deferring Arterial Catheterization in Critically Ill Patients with Shock.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/118036",
      "abstract": "In patients with shock, whether noninvasive blood-pressure monitoring is an effective alternative to the recommended use of an arterial catheter is uncertain. In this multicenter, open-label, noninferiority trial, we randomly assigned patients who had shock and had been admitted to an intensive care unit within the past 24 hours to receive early insertion (<4 hours after randomization) of an arterial catheter (invasive strategy) or to be monitored with an automated brachial cuff (noninvasive strategy). Insertion of an arterial catheter was allowed later in patients assigned to the noninvasive-strategy group who met prespecified safety criteria. The primary outcome was death from any cause at day 28 (noninferiority margin, 5 percentage points). Adverse events of special interest related to the blood-pressure-monitoring device that was used were recorded, as was patient-reported pain or discomfort related to the ongoing presence of the device. A total of 1010 patients underwent randomization; 504 patients assigned to the noninvasive-strategy group and 502 assigned to the invasive-strategy group were included in the analyses. A total of 74 patients (14.7%) in the noninvasive-strategy group and 493 (98.2%) in the invasive-strategy group underwent insertion of an arterial catheter. Death within 28 days occurred in 173 patients (34.3%) in the noninvasive-strategy group and 185 (36.9%) in the invasive-strategy group (adjusted risk difference, -3.2 percentage points; 95% confidence interval, -8.9 to 2.5; P = 0.006 for noninferiority). Results of per-protocol analyses were similar in the two groups. A total of 66 patients (13.1%) in the noninvasive-strategy group and 45 (9.0%) in the invasive-strategy group had at least 1 day of pain or discomfort related to the ongoing presence of the blood-pressure-monitoring device. Hematoma or hemorrhage related to the arterial catheter occurred in 5 patients (1.0%) in the noninvasive-strategy group and 41 patients (8.2%) in the invasive-strategy group. Among patients with shock, results for death from any cause at day 28 indicated that management without early arterial catheter insertion was noninferior to early catheter insertion. (Funded by the French Ministry of Health; ClinicalTrials.gov number, NCT03680963.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In patients with shock, whether noninvasive blood-pressure monitoring is an effective alternative to the recommended use of an arterial catheter is uncertain."
        },
        {
          "label": "METHODS",
          "text": "In this multicenter, open-label, noninferiority trial, we randomly assigned patients who had shock and had been admitted to an intensive care unit within the past 24 hours to receive early insertion (<4 hours after randomization) of an arterial catheter (invasive strategy) or to be monitored with an automated brachial cuff (noninvasive strategy). Insertion of an arterial catheter was allowed later in patients assigned to the noninvasive-strategy group who met prespecified safety criteria. The primary outcome was death from any cause at day 28 (noninferiority margin, 5 percentage points). Adverse events of special interest related to the blood-pressure-monitoring device that was used were recorded, as was patient-reported pain or discomfort related to the ongoing presence of the device."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1010 patients underwent randomization; 504 patients assigned to the noninvasive-strategy group and 502 assigned to the invasive-strategy group were included in the analyses. A total of 74 patients (14.7%) in the noninvasive-strategy group and 493 (98.2%) in the invasive-strategy group underwent insertion of an arterial catheter. Death within 28 days occurred in 173 patients (34.3%) in the noninvasive-strategy group and 185 (36.9%) in the invasive-strategy group (adjusted risk difference, -3.2 percentage points; 95% confidence interval, -8.9 to 2.5; P = 0.006 for noninferiority). Results of per-protocol analyses were similar in the two groups. A total of 66 patients (13.1%) in the noninvasive-strategy group and 45 (9.0%) in the invasive-strategy group had at least 1 day of pain or discomfort related to the ongoing presence of the blood-pressure-monitoring device. Hematoma or hemorrhage related to the arterial catheter occurred in 5 patients (1.0%) in the noninvasive-strategy group and 41 patients (8.2%) in the invasive-strategy group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with shock, results for death from any cause at day 28 indicated that management without early arterial catheter insertion was noninferior to early catheter insertion. (Funded by the French Ministry of Health; ClinicalTrials.gov number, NCT03680963.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159885/",
      "pubDate": "2025 Nov 13",
      "doi": "10.1056/NEJMoa2502136",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "In patients with shock, early arterial catheter insertion did not improve 28-day mortality compared to management without it."
    },
    {
      "id": "ba42ab146ac7",
      "title": "A Randomized Trial of Physical Therapy for Meniscal Tear and Knee Pain.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/118034",
      "abstract": "Physical therapy is routinely recommended for knee pain attributed to a degenerative meniscal tear, but its efficacy has not been established. We randomly assigned participants 45 to 85 years of age with knee pain, osteoarthritis, and meniscal tear to one of four groups: home exercise (3-month home-exercise program), home exercise plus text messages to encourage exercise adherence, home exercise plus text messages plus sham physical therapy (in-clinic sham manual therapy and sham ultrasound therapy), and home exercise plus text messages plus standard physical therapy (supervised strengthening, functional, and stretching exercises and manual therapy). The primary outcome was the change in the Knee Injury and Osteoarthritis Outcome Score (KOOS) pain subscore (range, 0 to 100, with higher scores indicating more pain) between baseline and 3 months, with adjustment for trial site, baseline KOOS pain subscore, and radiographic grade. A total of 879 participants underwent randomization (mean [±SD] age, 59.2±7.8 years). The difference in the 3-month change in the KOOS pain subscore between home exercise and home exercise plus text messages was -0.1 points (98.3% confidence interval [CI], -3.8 to 3.7) and between home exercise and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.3 to 6.2); the difference between home exercise plus text messages and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.4 to 6.5). Adverse events were generally nonserious and evenly distributed overall across groups. For patients with degenerative meniscal tear and knee pain, the addition of physical therapy or text messages to encourage adherence to home exercises was not superior in reducing pain to a home-exercise program alone. (Funded by the National Institute of Arthritis and Musculoskeletal and Skin Diseases and others; TeMPO ClinicalTrials.gov number, NCT03059004.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Physical therapy is routinely recommended for knee pain attributed to a degenerative meniscal tear, but its efficacy has not been established."
        },
        {
          "label": "METHODS",
          "text": "We randomly assigned participants 45 to 85 years of age with knee pain, osteoarthritis, and meniscal tear to one of four groups: home exercise (3-month home-exercise program), home exercise plus text messages to encourage exercise adherence, home exercise plus text messages plus sham physical therapy (in-clinic sham manual therapy and sham ultrasound therapy), and home exercise plus text messages plus standard physical therapy (supervised strengthening, functional, and stretching exercises and manual therapy). The primary outcome was the change in the Knee Injury and Osteoarthritis Outcome Score (KOOS) pain subscore (range, 0 to 100, with higher scores indicating more pain) between baseline and 3 months, with adjustment for trial site, baseline KOOS pain subscore, and radiographic grade."
        },
        {
          "label": "RESULTS",
          "text": "A total of 879 participants underwent randomization (mean [±SD] age, 59.2±7.8 years). The difference in the 3-month change in the KOOS pain subscore between home exercise and home exercise plus text messages was -0.1 points (98.3% confidence interval [CI], -3.8 to 3.7) and between home exercise and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.3 to 6.2); the difference between home exercise plus text messages and home exercise plus text messages plus standard physical therapy was 2.5 points (98.3% CI, -1.4 to 6.5). Adverse events were generally nonserious and evenly distributed overall across groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "For patients with degenerative meniscal tear and knee pain, the addition of physical therapy or text messages to encourage adherence to home exercises was not superior in reducing pain to a home-exercise program alone. (Funded by the National Institute of Arthritis and Musculoskeletal and Skin Diseases and others; TeMPO ClinicalTrials.gov number, NCT03059004.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160820/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1056/NEJMoa2503385",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "Physical therapy or text message support did not improve pain reduction compared to a home exercise program for patients with degenerative meniscal tears and knee pain."
    },
    {
      "id": "66b2b1d36c68",
      "title": "Effect of Vericiguat on Total Heart Failure Events in Compensated Outpatients With HFrEF: Insights From VICTOR.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48836337/117953",
      "abstract": "In the VICTOR (Vericiguat Global Study in Participants With Chronic Heart Failure) trial, in a contemporary ambulatory cohort with heart failure and reduced ejection fraction (HFrEF) and no recent hospitalization, the primary outcome of hospitalization for heart failure (HHF) and cardiovascular death was not statistically significantly reduced with vericiguat. Vericiguat reduced risk of mortality but not HHF. In this ambulatory compensated cohort, time to first HHF may underestimate the overall worsening HF burden by failing to consider the high proportion of outpatient worsening HF events. This study aimed to determine the effect of vericiguat on the overall risk of worsening HF by incorporating the entire patient experience of worsening outpatient and inpatient HF episodes. VICTOR was a phase 3, double-blind, placebo-controlled trial testing the effect of vericiguat in ambulatory patients with HFrEF who had not experienced recent worsening (defined as HHF admission within 6 months or outpatient intravenous diuretic use within 3 months) and were on a background of high use of contemporary guideline therapy. The primary endpoint was a composite of cardiovascular death or HHF. The current analysis provides detailed effects of vericiguat on overall worsening HF in both the inpatient and outpatient settings, including urgent care visits for intravenous diuretics or outpatient oral diuretic initiation or intensification. A total of 6,105 participants were randomized. Outpatient worsening HF was more common as the first worsening HF event (n = 851, 59.3%), compared with HHF (n = 507, 35.4%) or urgent HF visits (n = 76, 5.3%). Outpatient oral diuretic initiation or intensification was associated with increased mortality (RR: 1.69; 95% CI: 1.47-1.94; P < 0.001). Overall worsening HF occurred in 686 participants (22.5%) in the vericiguat group and 748 participants (24.8%) in the placebo group (HR: 0.90; 95% CI: 0.81-1.00; P = 0.047). The composite of all-cause death and overall worsening HF occurred in 917 participants (30.0%) in the vericiguat group and 1,004 participants (32.9%) in the placebo group (HR: 0.90; 95% CI: 0.82-0.98; P = 0.016). In compensated patients with HFrEF on contemporary guideline therapy, worsening HF in outpatients was more common than HHF and was associated with higher risk of mortality. Exploratory analyses suggested a potential reduction in overall worsening HF events when both inpatient and outpatient settings were considered.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In the VICTOR (Vericiguat Global Study in Participants With Chronic Heart Failure) trial, in a contemporary ambulatory cohort with heart failure and reduced ejection fraction (HFrEF) and no recent hospitalization, the primary outcome of hospitalization for heart failure (HHF) and cardiovascular death was not statistically significantly reduced with vericiguat. Vericiguat reduced risk of mortality but not HHF. In this ambulatory compensated cohort, time to first HHF may underestimate the overall worsening HF burden by failing to consider the high proportion of outpatient worsening HF events."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study aimed to determine the effect of vericiguat on the overall risk of worsening HF by incorporating the entire patient experience of worsening outpatient and inpatient HF episodes."
        },
        {
          "label": "METHODS",
          "text": "VICTOR was a phase 3, double-blind, placebo-controlled trial testing the effect of vericiguat in ambulatory patients with HFrEF who had not experienced recent worsening (defined as HHF admission within 6 months or outpatient intravenous diuretic use within 3 months) and were on a background of high use of contemporary guideline therapy. The primary endpoint was a composite of cardiovascular death or HHF. The current analysis provides detailed effects of vericiguat on overall worsening HF in both the inpatient and outpatient settings, including urgent care visits for intravenous diuretics or outpatient oral diuretic initiation or intensification."
        },
        {
          "label": "RESULTS",
          "text": "A total of 6,105 participants were randomized. Outpatient worsening HF was more common as the first worsening HF event (n = 851, 59.3%), compared with HHF (n = 507, 35.4%) or urgent HF visits (n = 76, 5.3%). Outpatient oral diuretic initiation or intensification was associated with increased mortality (RR: 1.69; 95% CI: 1.47-1.94; P < 0.001). Overall worsening HF occurred in 686 participants (22.5%) in the vericiguat group and 748 participants (24.8%) in the placebo group (HR: 0.90; 95% CI: 0.81-1.00; P = 0.047). The composite of all-cause death and overall worsening HF occurred in 917 participants (30.0%) in the vericiguat group and 1,004 participants (32.9%) in the placebo group (HR: 0.90; 95% CI: 0.82-0.98; P = 0.016)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In compensated patients with HFrEF on contemporary guideline therapy, worsening HF in outpatients was more common than HHF and was associated with higher risk of mortality. Exploratory analyses suggested a potential reduction in overall worsening HF events when both inpatient and outpatient settings were considered."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892609/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.051",
      "dateReceived": "2025-11-15T23:23:25.944Z",
      "isNew": false,
      "summary": "In heart failure patients with reduced ejection fraction receiving standard treatment, worsening heart failure in the outpatient setting was more frequent than hospitalization for heart failure and linked to increased death risk, though considering both inpatient and outpatient settings might reduce overall worsening events."
    },
    {
      "id": "1dd31aace9ff",
      "title": "Metformin to Improve Walking Performance in Lower Extremity Peripheral Artery Disease: The PERMET Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48929961/118127",
      "abstract": "Lower extremity peripheral artery disease (PAD) is a disabling cardiovascular condition that impairs walking ability. Few effective therapies improve walking performance in people with PAD. Metformin is a widely available and inexpensive therapy for type 2 diabetes with pleiotropic effects that include activating AMP-activated protein kinase, reducing oxidative stress, and stimulating endothelial nitric oxide synthase (eNOS). To determine whether metformin improves 6-minute walk distance, compared with placebo, in people with PAD and without diabetes at 6-month follow-up. Randomized double-blind clinical trial involving 4 centers in the US. Enrollment began May 23, 2017, and ended on February 17, 2025, with 202 of the targeted 212 (95%) enrolled, due to funding limitations. Participants were adults aged 50 years and older with PAD. Final follow-up occurred August 19, 2025. Participants with PAD were randomized to receive either metformin (n = 97) or placebo (n = 105) for 6 months. The primary outcome was 6-month change in 6-minute walk distance (minimum clinically important difference, 8 to 20 m). Secondary outcomes were maximal treadmill walking time, pain-free treadmill walking time, the Walking Impairment Questionnaire distance and speed scores, the Short-Form 36 physical functioning score, and brachial artery flow-mediated dilation. Results were adjusted for site and the baseline value for each outcome measure. Of 202 randomized patients (mean [SD] age, 69.6 [8.4] years, 56 [28%] female, 79 [39%] Black), 179 (89%) completed 6-month follow-up. Metformin did not significantly improve 6-minute walk distance compared with placebo (metformin: 358.6 to 353.2 m, within-group change: -5.4 m; placebo: 359.8 to 354.5 m, within-group change: -5.3 m, adjusted between-group difference: 1.1 m [95% CI, -16.3 to 18.6 m]; P = .90). Compared with placebo, metformin did not significantly improve any secondary outcomes. The most common serious adverse events were cardiovascular events (3.1% for metformin and 1.9% for placebo). The most common nonserious adverse events were indigestion/stomach upset (64.9% for metformin and 40.6% for placebo) and headache (37.2% for metformin and 49.5% for placebo). Among people with PAD without diabetes, metformin did not improve 6-minute walk distance at 6-month follow-up compared with placebo. These results do not support metformin for improving walking performance in patients with PAD. ClinicalTrials.gov Identifier: NCT03054519.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Lower extremity peripheral artery disease (PAD) is a disabling cardiovascular condition that impairs walking ability. Few effective therapies improve walking performance in people with PAD. Metformin is a widely available and inexpensive therapy for type 2 diabetes with pleiotropic effects that include activating AMP-activated protein kinase, reducing oxidative stress, and stimulating endothelial nitric oxide synthase (eNOS)."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether metformin improves 6-minute walk distance, compared with placebo, in people with PAD and without diabetes at 6-month follow-up."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Randomized double-blind clinical trial involving 4 centers in the US. Enrollment began May 23, 2017, and ended on February 17, 2025, with 202 of the targeted 212 (95%) enrolled, due to funding limitations. Participants were adults aged 50 years and older with PAD. Final follow-up occurred August 19, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants with PAD were randomized to receive either metformin (n = 97) or placebo (n = 105) for 6 months."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was 6-month change in 6-minute walk distance (minimum clinically important difference, 8 to 20 m). Secondary outcomes were maximal treadmill walking time, pain-free treadmill walking time, the Walking Impairment Questionnaire distance and speed scores, the Short-Form 36 physical functioning score, and brachial artery flow-mediated dilation. Results were adjusted for site and the baseline value for each outcome measure."
        },
        {
          "label": "RESULTS",
          "text": "Of 202 randomized patients (mean [SD] age, 69.6 [8.4] years, 56 [28%] female, 79 [39%] Black), 179 (89%) completed 6-month follow-up. Metformin did not significantly improve 6-minute walk distance compared with placebo (metformin: 358.6 to 353.2 m, within-group change: -5.4 m; placebo: 359.8 to 354.5 m, within-group change: -5.3 m, adjusted between-group difference: 1.1 m [95% CI, -16.3 to 18.6 m]; P = .90). Compared with placebo, metformin did not significantly improve any secondary outcomes. The most common serious adverse events were cardiovascular events (3.1% for metformin and 1.9% for placebo). The most common nonserious adverse events were indigestion/stomach upset (64.9% for metformin and 40.6% for placebo) and headache (37.2% for metformin and 49.5% for placebo)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among people with PAD without diabetes, metformin did not improve 6-minute walk distance at 6-month follow-up compared with placebo. These results do not support metformin for improving walking performance in patients with PAD."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03054519."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41205146/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1001/jama.2025.21358",
      "dateReceived": "2025-11-15T23:23:25.943Z",
      "isNew": false,
      "summary": "Metformin did not improve walking distance in people with peripheral artery disease (PAD) without diabetes."
    },
    {
      "id": "b31a329b43d3",
      "title": "Antithrombotic Therapy after Successful Catheter Ablation for Atrial Fibrillation.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48917141/118121",
      "abstract": "Whether successful catheter ablation for atrial fibrillation eliminates the need for long-term oral anticoagulant therapy is unknown. We conducted an international, open-label, randomized, blinded-outcome-assessment trial involving 1284 patients who had undergone successful catheter ablation for atrial fibrillation at least 1 year earlier and had a CHADS-VASc score (scores range from 0 to 9, with higher scores indicating a higher risk of stroke) of 1 or more (or ≥2 for women or for patients in whom vascular disease was a risk factor). Patients were randomly assigned to receive either aspirin (at a dose of 70 to 120 mg daily, depending on availability in the local jurisdiction) or rivaroxaban (at a dose of 15 mg) and followed for 3 years. Magnetic resonance imaging (MRI) of the head was performed after enrollment and at 3 years. The primary outcome was a composite of stroke, systemic embolism, or new covert embolic stroke (defined by ≥1 new infarct measuring ≥15 mm on MRI) at 3 years. A total of 641 patients were assigned to the rivaroxaban group and 643 to the aspirin group. A primary-outcome event occurred in 5 patients (0.31 events per 100 patient-years) in the rivaroxaban group and in 9 patients (0.66 events per 100 patient-years) in the aspirin group (relative risk, 0.56; 95% confidence interval [CI], 0.19 to 1.65; absolute risk difference at 3 years, -0.6 percentage points; 95% CI, -1.8 to 0.5; P = 0.28). New cerebral infarcts measuring less than 15 mm occurred in 22 of 568 patients (3.9%) in the rivaroxaban group and in 26 of 590 patients (4.4%) in the aspirin group (relative risk, 0.89; 95% CI, 0.51 to 1.55). Fatal or major bleeding (the composite primary safety outcome) had occurred in 10 patients (1.6%) with rivaroxaban and in 4 patients (0.6%) with aspirin (hazard ratio, 2.51; 95% CI, 0.79 to 7.95) at 3 years. Among patients who had had successful catheter ablation for atrial fibrillation at least 1 year earlier and had risk factors for stroke, treatment with rivaroxaban did not result in a significantly lower incidence of a composite of stroke, systemic embolism, or new covert embolic stroke than treatment with aspirin. (Funded by Bayer and others; OCEAN ClinicalTrials.gov number, NCT02168829.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Whether successful catheter ablation for atrial fibrillation eliminates the need for long-term oral anticoagulant therapy is unknown."
        },
        {
          "label": "METHODS",
          "text": "We conducted an international, open-label, randomized, blinded-outcome-assessment trial involving 1284 patients who had undergone successful catheter ablation for atrial fibrillation at least 1 year earlier and had a CHADS-VASc score (scores range from 0 to 9, with higher scores indicating a higher risk of stroke) of 1 or more (or ≥2 for women or for patients in whom vascular disease was a risk factor). Patients were randomly assigned to receive either aspirin (at a dose of 70 to 120 mg daily, depending on availability in the local jurisdiction) or rivaroxaban (at a dose of 15 mg) and followed for 3 years. Magnetic resonance imaging (MRI) of the head was performed after enrollment and at 3 years. The primary outcome was a composite of stroke, systemic embolism, or new covert embolic stroke (defined by ≥1 new infarct measuring ≥15 mm on MRI) at 3 years."
        },
        {
          "label": "RESULTS",
          "text": "A total of 641 patients were assigned to the rivaroxaban group and 643 to the aspirin group. A primary-outcome event occurred in 5 patients (0.31 events per 100 patient-years) in the rivaroxaban group and in 9 patients (0.66 events per 100 patient-years) in the aspirin group (relative risk, 0.56; 95% confidence interval [CI], 0.19 to 1.65; absolute risk difference at 3 years, -0.6 percentage points; 95% CI, -1.8 to 0.5; P = 0.28). New cerebral infarcts measuring less than 15 mm occurred in 22 of 568 patients (3.9%) in the rivaroxaban group and in 26 of 590 patients (4.4%) in the aspirin group (relative risk, 0.89; 95% CI, 0.51 to 1.55). Fatal or major bleeding (the composite primary safety outcome) had occurred in 10 patients (1.6%) with rivaroxaban and in 4 patients (0.6%) with aspirin (hazard ratio, 2.51; 95% CI, 0.79 to 7.95) at 3 years."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients who had had successful catheter ablation for atrial fibrillation at least 1 year earlier and had risk factors for stroke, treatment with rivaroxaban did not result in a significantly lower incidence of a composite of stroke, systemic embolism, or new covert embolic stroke than treatment with aspirin. (Funded by Bayer and others; OCEAN ClinicalTrials.gov number, NCT02168829.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41211931/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1056/NEJMoa2509688",
      "dateReceived": "2025-11-14T23:24:51.705Z",
      "isNew": false,
      "summary": "In patients with successful atrial fibrillation ablation and stroke risk factors, rivaroxaban did not significantly reduce stroke, systemic embolism, or covert embolic stroke compared to aspirin."
    },
    {
      "id": "3f63e0573bf5",
      "title": "Fish-Oil Supplementation and Cardiovascular Events in Patients Receiving Hemodialysis.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48917141/118117",
      "abstract": "Cardiovascular disease is the leading cause of death in patients receiving hemodialysis, yet effective preventive therapies remain limited. Supplementation with n-3 polyunsaturated fatty acids, especially eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), may have cardiovascular benefits in the general population, but efficacy among patients receiving hemodialysis is uncertain. In a double-blind, randomized, placebo-controlled trial conducted at 26 sites in Canada and Australia, we assigned adult patients receiving maintenance hemodialysis to daily supplementation with fish oil (4 g of n-3 polyunsaturated fatty acids [1.6 g of EPA and 0.8 g of DHA]) or corn-oil placebo. The primary end point was a composite of all serious cardiovascular events including sudden and nonsudden cardiac death, fatal and nonfatal myocardial infarction, peripheral vascular disease leading to amputation, and fatal and nonfatal stroke. Secondary end points included extension of the primary end point to include noncardiac causes of death, the individual components of the primary end point, and a first cardiovascular event or death from any cause. Between November 28, 2013, and July 22, 2019, a total of 1228 participants underwent randomization; 610 were assigned to the fish-oil group and 618 to the placebo group. During 3.5 years of follow-up, the rate of serious cardiovascular events was significantly lower in the fish-oil group than in the placebo group (0.31 vs. 0.61 per 1000 patient-days; hazard ratio, 0.57; 95% confidence interval [CI], 0.47 to 0.70; P<0.001). The rate of the extended primary end point that included noncardiac causes of death appeared to be lower in the fish-oil group than in the placebo group, with a hazard ratio of 0.77 (95% CI, 0.65 to 0.90). The hazard ratio for cardiac death was 0.55 (95% CI, 0.40 to 0.75); for fatal and nonfatal myocardial infarction, 0.56 (95% CI, 0.40 to 0.80); for peripheral vascular disease leading to amputation, 0.57 (95% CI, 0.38 to 0.86); for fatal and nonfatal stroke, 0.37 (95% CI, 0.18 to 0.76); and for a first cardiovascular event or death from any cause, 0.73 (95% CI, 0.61 to 0.87). Adherence to the trial regimen and the incidence of adverse events did not differ meaningfully between the groups. The rate of serious cardiovascular events among participants receiving maintenance hemodialysis was lower with daily supplementation with n-3 fatty acids than with placebo. (Supported by the Heart and Stroke Foundation of Canada and others; PISCES ClinicalTrials.gov number, ISRCTN00691795.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cardiovascular disease is the leading cause of death in patients receiving hemodialysis, yet effective preventive therapies remain limited. Supplementation with n-3 polyunsaturated fatty acids, especially eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), may have cardiovascular benefits in the general population, but efficacy among patients receiving hemodialysis is uncertain."
        },
        {
          "label": "METHODS",
          "text": "In a double-blind, randomized, placebo-controlled trial conducted at 26 sites in Canada and Australia, we assigned adult patients receiving maintenance hemodialysis to daily supplementation with fish oil (4 g of n-3 polyunsaturated fatty acids [1.6 g of EPA and 0.8 g of DHA]) or corn-oil placebo. The primary end point was a composite of all serious cardiovascular events including sudden and nonsudden cardiac death, fatal and nonfatal myocardial infarction, peripheral vascular disease leading to amputation, and fatal and nonfatal stroke. Secondary end points included extension of the primary end point to include noncardiac causes of death, the individual components of the primary end point, and a first cardiovascular event or death from any cause."
        },
        {
          "label": "RESULTS",
          "text": "Between November 28, 2013, and July 22, 2019, a total of 1228 participants underwent randomization; 610 were assigned to the fish-oil group and 618 to the placebo group. During 3.5 years of follow-up, the rate of serious cardiovascular events was significantly lower in the fish-oil group than in the placebo group (0.31 vs. 0.61 per 1000 patient-days; hazard ratio, 0.57; 95% confidence interval [CI], 0.47 to 0.70; P<0.001). The rate of the extended primary end point that included noncardiac causes of death appeared to be lower in the fish-oil group than in the placebo group, with a hazard ratio of 0.77 (95% CI, 0.65 to 0.90). The hazard ratio for cardiac death was 0.55 (95% CI, 0.40 to 0.75); for fatal and nonfatal myocardial infarction, 0.56 (95% CI, 0.40 to 0.80); for peripheral vascular disease leading to amputation, 0.57 (95% CI, 0.38 to 0.86); for fatal and nonfatal stroke, 0.37 (95% CI, 0.18 to 0.76); and for a first cardiovascular event or death from any cause, 0.73 (95% CI, 0.61 to 0.87). Adherence to the trial regimen and the incidence of adverse events did not differ meaningfully between the groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The rate of serious cardiovascular events among participants receiving maintenance hemodialysis was lower with daily supplementation with n-3 fatty acids than with placebo. (Supported by the Heart and Stroke Foundation of Canada and others; PISCES ClinicalTrials.gov number, ISRCTN00691795.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41201837/",
      "pubDate": "2025 Nov 07",
      "doi": "10.1056/NEJMoa2513032",
      "dateReceived": "2025-11-14T23:24:51.705Z",
      "isNew": false,
      "summary": "Daily n-3 fatty acid supplementation in hemodialysis patients reduced the incidence of serious cardiovascular events compared to placebo."
    },
    {
      "id": "c290266cdbb7",
      "title": "Vernakalant versus procainamide for rapid cardioversion of patients with acute atrial fibrillation (RAFF4): randomised clinical trial.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48917141/118136",
      "abstract": "To conduct a randomised, open label comparison of the effectiveness and safety of intravenous vernakalant and intravenous procainamide for the management of acute atrial fibrillation in the emergency department. Randomised clinical trial (RAFF4 trial). 12 tertiary care emergency departments in Canada. Patients with acute atrial fibrillation for whom acute rhythm control was a safe option. Patients were randomised (1:1) to an intravenous infusion of vernakalant or procainamide; when rapid conversion did not occur, patients were offered electrical cardioversion. The primary outcome was conversion to sinus rhythm within 30 minutes of drug infusion completion. Secondary outcomes included time to conversion to sinus rhythm and whether the patient required electrical cardioversion. Of the 350 enrolled eligible patients, baseline characteristics were similar in the procainamide (n=172) and vernakalant (n=178) groups. For the primary outcome of conversion success, vernakalant was more effective (62.4%  48.3%; adjusted absolute difference 15.0%, 95% confidence interval 4.6% to 25.0%, P=0.005; adjusted odds ratio 1.87, 95% confidence interval 1.2 to 2.9, P=0.006). With vernakalant, time to conversion was faster (21.8  44.7 minutes; mean difference -22.9, 95% confidence interval -29.9 to -16.0, P<0.001), and fewer patients underwent attempted electrical cardioversion (33.7%  44.2%; odds ratio 0.62, 95% confidence interval 0.39 to 0.96, P=0.033). Adverse events were similar in both groups, were generally mild and brief, and most patients were discharged home. Subgroup analysis strongly favoured vernakalant for conversion in patients younger than 70 years (73.3%  47.2%; adjusted odds ratio 3.1, 95% confidence interval 1.7 to 5.5, P=0.001, interaction P=0.005). In this head-to-head comparison, vernakalant was superior to procainamide for patients with higher conversion rates and faster times to conversion. Therefore, vernakalant is a safe and highly effective intravenous alternative for the rapid cardioversion and discharge home of patients with acute atrial fibrillation. ClinicalTrials.gov NCT04485195.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To conduct a randomised, open label comparison of the effectiveness and safety of intravenous vernakalant and intravenous procainamide for the management of acute atrial fibrillation in the emergency department."
        },
        {
          "label": "DESIGN",
          "text": "Randomised clinical trial (RAFF4 trial)."
        },
        {
          "label": "SETTING",
          "text": "12 tertiary care emergency departments in Canada."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Patients with acute atrial fibrillation for whom acute rhythm control was a safe option."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomised (1:1) to an intravenous infusion of vernakalant or procainamide; when rapid conversion did not occur, patients were offered electrical cardioversion."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was conversion to sinus rhythm within 30 minutes of drug infusion completion. Secondary outcomes included time to conversion to sinus rhythm and whether the patient required electrical cardioversion."
        },
        {
          "label": "RESULTS",
          "text": "Of the 350 enrolled eligible patients, baseline characteristics were similar in the procainamide (n=172) and vernakalant (n=178) groups. For the primary outcome of conversion success, vernakalant was more effective (62.4%  48.3%; adjusted absolute difference 15.0%, 95% confidence interval 4.6% to 25.0%, P=0.005; adjusted odds ratio 1.87, 95% confidence interval 1.2 to 2.9, P=0.006). With vernakalant, time to conversion was faster (21.8  44.7 minutes; mean difference -22.9, 95% confidence interval -29.9 to -16.0, P<0.001), and fewer patients underwent attempted electrical cardioversion (33.7%  44.2%; odds ratio 0.62, 95% confidence interval 0.39 to 0.96, P=0.033). Adverse events were similar in both groups, were generally mild and brief, and most patients were discharged home. Subgroup analysis strongly favoured vernakalant for conversion in patients younger than 70 years (73.3%  47.2%; adjusted odds ratio 3.1, 95% confidence interval 1.7 to 5.5, P=0.001, interaction P=0.005)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this head-to-head comparison, vernakalant was superior to procainamide for patients with higher conversion rates and faster times to conversion. Therefore, vernakalant is a safe and highly effective intravenous alternative for the rapid cardioversion and discharge home of patients with acute atrial fibrillation."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov NCT04485195."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41218981/",
      "pubDate": "2025 Nov 11",
      "doi": "10.1136/bmj-2025-085632",
      "dateReceived": "2025-11-14T23:24:51.704Z",
      "isNew": false,
      "summary": "Vernakalant is a safe and highly effective intravenous medication for rapidly converting acute atrial fibrillation to normal rhythm, leading to faster conversion times and higher success rates compared to procainamide."
    },
    {
      "id": "e099a1fcf599",
      "title": "Efficacy and safety of tirzepatide added to basal insulin in patients with type 2 diabetes in China (SURPASS-CN-INS): a double-blind, multicentre, randomised, placebo-controlled, phase 3 trial.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118088",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false
    },
    {
      "id": "2269be1b1635",
      "title": "Xpert MTB/RIF Ultra assay for tuberculosis disease and rifampicin resistance in children.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118068",
      "abstract": "In 2023, an estimated 1.3 million children (aged 0-14 years) became ill with tuberculosis, and 166,000 children (aged 0-15 years) died from the disease. Xpert MTB/RIF Ultra (Xpert Ultra) is a molecular World Health Organization (WHO)-recommended rapid diagnostic test that detects Mycobacterium tuberculosis complex and rifampicin resistance. This is an update of a Cochrane review first published in 2020 and last updated in 2022. Parts of the current update informed the 2024 WHO updated guidance for the diagnosis of tuberculosis. To assess the diagnostic accuracy of Xpert Ultra for detecting pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance in children (aged 0-9 years) with presumed tuberculosis. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, three other databases, and three trial registers without language restrictions to 6 October 2023. For study design, we included cross-sectional and cohort studies and randomized trials that evaluated Xpert Ultra in HIV-positive and HIV-negative children aged birth to nine years. Regarding specimen type, we included studies evaluating sputum, gastric, stool, or nasopharyngeal specimens (pulmonary tuberculosis); cerebrospinal fluid (tuberculous meningitis); and fine needle aspirate or surgical biopsy tissue (lymph node tuberculosis). Reference standards for detection of tuberculosis were microbiological reference standard (MRS; including culture) or composite reference standard (CRS); for stool, we considered Xpert Ultra in sputum or gastric aspirates in addition to culture. Reference standards for detection of rifampicin resistance in sputum were phenotypic drug susceptibility testing or targeted or whole genome sequencing. Two review authors independently extracted data and assessed methodological quality using the tailored QUADAS-2 tool, judging risk of bias separately for each target condition and sample type. We conducted separate meta-analyses for detection of pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance. We used a bivariate model to estimate summary sensitivity and specificity with 95% confidence intervals (CIs). We assessed certainty of evidence using the GRADE approach. This update included 23 studies (including 9 new studies since the previous review) that evaluated detection of pulmonary tuberculosis (21 studies, 9223 children), tuberculous meningitis (3 studies, 215 children), lymph node tuberculosis (2 studies, 58 children), and rifampicin resistance (3 studies, 130 children). Seventeen studies (74%) took place in countries with a high tuberculosis burden. Overall, risk of bias and applicability concerns were low. Detection of pulmonary tuberculosis (microbiological reference standard) Sputum (11 studies) Xpert Ultra summary sensitivity was 75.3% (95% CI 68.9% to 80.8%; 345 children; moderate-certainty evidence), and specificity was 95.9% (95% CI 92.3% to 97.9%; 2645 children; high-certainty evidence). Gastric aspirate (12 studies) Xpert Ultra summary sensitivity was 69.6% (95% CI 60.3% to 77.6%; 167 children; moderate-certainty evidence), and specificity was 91.0% (95% CI 82.5% to 95.6%; 1792 children; moderate-certainty evidence). Stool (10 studies) Xpert Ultra summary sensitivity was 68.0% (95% CI 50.3% to 81.7%; 255 children; moderate-certainty evidence), and specificity was 98.2% (95% CI 96.3% to 99.1%; 2630 children; high-certainty evidence). Nasopharyngeal aspirate (6 studies) Xpert Ultra summary sensitivity was 46.2% (95% CI 34.9% to 57.9%; 94 children; moderate-certainty evidence), and specificity was 97.5% (95% CI 95.1% to 98.7%; 1259 children; high-certainty evidence). Xpert Ultra sensitivity was lower against CRS than against MRS for all specimen types, while the specificities were similar. Extrapulmonary tuberculosis Meta-analysis was not possible for lymph node tuberculosis and tuberculous meningitis due to low study numbers. Interpretation of results For a population of 1000 children, where 100 have pulmonary tuberculosis: In sputum: • 112 would be Xpert Ultra positive, of whom 75 would have pulmonary tuberculosis (true positives) and 37 would not (false positives). • 888 would be Xpert Ultra negative, of whom 863 would not have pulmonary tuberculosis (true negatives) and 25 would have pulmonary tuberculosis (false negatives). In gastric aspirate: • 151 would be Xpert Ultra positive, of whom 70 would have pulmonary tuberculosis (true positives) and 81 would not (false positives). • 849 would be Xpert Ultra negative, of whom 819 would not have pulmonary tuberculosis (true negatives) and 30 would have pulmonary tuberculosis (false negatives). In stool: • 85 would be Xpert Ultra positive, of whom 68 would have pulmonary tuberculosis (true positives) and 17 would not (false positives). • 915 would be Xpert Ultra negative, of whom 883 would not have pulmonary tuberculosis (true negatives) and 32 would have pulmonary tuberculosis (false negatives). In nasopharyngeal aspirate: • 68 would be Xpert Ultra positive, of whom 46 would have pulmonary tuberculosis (true positives) and 22 would not (false positives). • 932 would be Xpert Ultra negative, of whom 878 would not have pulmonary tuberculosis (true negatives), and 54 would have pulmonary tuberculosis (false negatives). Detection of rifampicin resistance Three studies with 76 children evaluated detection of rifampicin resistance (sputum only); two of these studies reported no cases and one reported rifampicin resistance in two children. Xpert Ultra sensitivity was moderate in sputum, gastric aspirate, and stool specimens. Nasopharyngeal aspirate had the lowest sensitivity. Xpert Ultra specificity was high against both MRS and CRS. We were unable to determine the accuracy of Xpert Ultra for detecting tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance due to a paucity of data. This update was funded through WHO. The protocol for this review was originally published through Cochrane in 2019. The protocol for this update was a generic protocol that consolidated previously published Cochrane protocols of Xpert Ultra for tuberculosis detection and can be accessed at https://osf.io/26wg7/. Protocol (2019) DOI: 10.1002/14651858.CD013359 Original review (2020) DOI: 10.1002/14651858.CD013359.pub2 Review update (2022) DOI: 10.1002/14651858.CD013359.pub3.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In 2023, an estimated 1.3 million children (aged 0-14 years) became ill with tuberculosis, and 166,000 children (aged 0-15 years) died from the disease. Xpert MTB/RIF Ultra (Xpert Ultra) is a molecular World Health Organization (WHO)-recommended rapid diagnostic test that detects Mycobacterium tuberculosis complex and rifampicin resistance. This is an update of a Cochrane review first published in 2020 and last updated in 2022. Parts of the current update informed the 2024 WHO updated guidance for the diagnosis of tuberculosis."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the diagnostic accuracy of Xpert Ultra for detecting pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance in children (aged 0-9 years) with presumed tuberculosis."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, three other databases, and three trial registers without language restrictions to 6 October 2023."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "For study design, we included cross-sectional and cohort studies and randomized trials that evaluated Xpert Ultra in HIV-positive and HIV-negative children aged birth to nine years. Regarding specimen type, we included studies evaluating sputum, gastric, stool, or nasopharyngeal specimens (pulmonary tuberculosis); cerebrospinal fluid (tuberculous meningitis); and fine needle aspirate or surgical biopsy tissue (lymph node tuberculosis). Reference standards for detection of tuberculosis were microbiological reference standard (MRS; including culture) or composite reference standard (CRS); for stool, we considered Xpert Ultra in sputum or gastric aspirates in addition to culture. Reference standards for detection of rifampicin resistance in sputum were phenotypic drug susceptibility testing or targeted or whole genome sequencing."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Two review authors independently extracted data and assessed methodological quality using the tailored QUADAS-2 tool, judging risk of bias separately for each target condition and sample type. We conducted separate meta-analyses for detection of pulmonary tuberculosis, tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance. We used a bivariate model to estimate summary sensitivity and specificity with 95% confidence intervals (CIs). We assessed certainty of evidence using the GRADE approach."
        },
        {
          "label": "MAIN RESULTS",
          "text": "This update included 23 studies (including 9 new studies since the previous review) that evaluated detection of pulmonary tuberculosis (21 studies, 9223 children), tuberculous meningitis (3 studies, 215 children), lymph node tuberculosis (2 studies, 58 children), and rifampicin resistance (3 studies, 130 children). Seventeen studies (74%) took place in countries with a high tuberculosis burden. Overall, risk of bias and applicability concerns were low. Detection of pulmonary tuberculosis (microbiological reference standard) Sputum (11 studies) Xpert Ultra summary sensitivity was 75.3% (95% CI 68.9% to 80.8%; 345 children; moderate-certainty evidence), and specificity was 95.9% (95% CI 92.3% to 97.9%; 2645 children; high-certainty evidence). Gastric aspirate (12 studies) Xpert Ultra summary sensitivity was 69.6% (95% CI 60.3% to 77.6%; 167 children; moderate-certainty evidence), and specificity was 91.0% (95% CI 82.5% to 95.6%; 1792 children; moderate-certainty evidence). Stool (10 studies) Xpert Ultra summary sensitivity was 68.0% (95% CI 50.3% to 81.7%; 255 children; moderate-certainty evidence), and specificity was 98.2% (95% CI 96.3% to 99.1%; 2630 children; high-certainty evidence). Nasopharyngeal aspirate (6 studies) Xpert Ultra summary sensitivity was 46.2% (95% CI 34.9% to 57.9%; 94 children; moderate-certainty evidence), and specificity was 97.5% (95% CI 95.1% to 98.7%; 1259 children; high-certainty evidence). Xpert Ultra sensitivity was lower against CRS than against MRS for all specimen types, while the specificities were similar. Extrapulmonary tuberculosis Meta-analysis was not possible for lymph node tuberculosis and tuberculous meningitis due to low study numbers. Interpretation of results For a population of 1000 children, where 100 have pulmonary tuberculosis: In sputum: • 112 would be Xpert Ultra positive, of whom 75 would have pulmonary tuberculosis (true positives) and 37 would not (false positives). • 888 would be Xpert Ultra negative, of whom 863 would not have pulmonary tuberculosis (true negatives) and 25 would have pulmonary tuberculosis (false negatives). In gastric aspirate: • 151 would be Xpert Ultra positive, of whom 70 would have pulmonary tuberculosis (true positives) and 81 would not (false positives). • 849 would be Xpert Ultra negative, of whom 819 would not have pulmonary tuberculosis (true negatives) and 30 would have pulmonary tuberculosis (false negatives). In stool: • 85 would be Xpert Ultra positive, of whom 68 would have pulmonary tuberculosis (true positives) and 17 would not (false positives). • 915 would be Xpert Ultra negative, of whom 883 would not have pulmonary tuberculosis (true negatives) and 32 would have pulmonary tuberculosis (false negatives). In nasopharyngeal aspirate: • 68 would be Xpert Ultra positive, of whom 46 would have pulmonary tuberculosis (true positives) and 22 would not (false positives). • 932 would be Xpert Ultra negative, of whom 878 would not have pulmonary tuberculosis (true negatives), and 54 would have pulmonary tuberculosis (false negatives). Detection of rifampicin resistance Three studies with 76 children evaluated detection of rifampicin resistance (sputum only); two of these studies reported no cases and one reported rifampicin resistance in two children."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Xpert Ultra sensitivity was moderate in sputum, gastric aspirate, and stool specimens. Nasopharyngeal aspirate had the lowest sensitivity. Xpert Ultra specificity was high against both MRS and CRS. We were unable to determine the accuracy of Xpert Ultra for detecting tuberculous meningitis, lymph node tuberculosis, and rifampicin resistance due to a paucity of data."
        },
        {
          "label": "FUNDING",
          "text": "This update was funded through WHO."
        },
        {
          "label": "REGISTRATION",
          "text": "The protocol for this review was originally published through Cochrane in 2019. The protocol for this update was a generic protocol that consolidated previously published Cochrane protocols of Xpert Ultra for tuberculosis detection and can be accessed at https://osf.io/26wg7/. Protocol (2019) DOI: 10.1002/14651858.CD013359 Original review (2020) DOI: 10.1002/14651858.CD013359.pub2 Review update (2022) DOI: 10.1002/14651858.CD013359.pub3."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41128098/",
      "pubDate": "2025 Oct 23",
      "doi": "10.1002/14651858.CD013359.pub4",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false,
      "summary": "Xpert Ultra showed moderate sensitivity in sputum, gastric aspirate, and stool, low sensitivity in nasopharyngeal aspirate, and high specificity against MRS and CRS, but data was insufficient to assess its accuracy for certain conditions."
    },
    {
      "id": "69c648f896d3",
      "title": "GRADE-Based Clinical Practice Guidelines for Emergency Department Delirium Risk Stratification, Screening, and Brain Imaging in Older Patients With Suspected Delirium.",
      "journal": "Acad Emerg Med",
      "score": "5/7",
      "tags": [
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118025",
      "abstract": "This portion of the Geriatric Emergency Department (GED) Guidelines 2.0 focuses on delirium in the emergency department (ED). A multidisciplinary group applied the Grading of Recommendations Assessment, Development, and Evaluation (GRADE) approach to assess the certainty of evidence and develop recommendations related to older ED patients with possible delirium. The GED Guidelines 2.0 Delirium Work Group derived six evidence-based recommendations for risk stratification, diagnosis, and brain imaging. To reduce universal screening, the Delirium Risk Score may be used to identify older adults at low risk for delirium, though the evidence certainty is very low. In adults over 65 admitted to ED observation units, Zucchelli's risk assessment tool (threshold ≥ 4) may stratify delirium risk, also with very low certainty. For adults over 75, the REDEEM Score may be used to identify low- or high-risk individuals, again with very low certainty. For diagnosis, 4AT, bCAM, CAM-ICU, mCAM, AMT-4, or RASS may be used to rule delirium in or out, based on very low certainty. The Delirium Triage Screen (DTS) may be used to rule out, but not to rule in, delirium, also with very low certainty. For diagnostic imaging, there is very low certainty of evidence to recommend for or against obtaining a head CT as part of the evaluation for older ED patients with delirium. All recommendations are conditional, reflecting very low certainty of evidence due to the lack of high-quality ED-based studies and comparative effectiveness research. Rigorous ED-based research is needed to strengthen evidence and guide delirium care for older adults in geriatric emergency medicine.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "This portion of the Geriatric Emergency Department (GED) Guidelines 2.0 focuses on delirium in the emergency department (ED)."
        },
        {
          "label": "METHODS",
          "text": "A multidisciplinary group applied the Grading of Recommendations Assessment, Development, and Evaluation (GRADE) approach to assess the certainty of evidence and develop recommendations related to older ED patients with possible delirium."
        },
        {
          "label": "RESULTS",
          "text": "The GED Guidelines 2.0 Delirium Work Group derived six evidence-based recommendations for risk stratification, diagnosis, and brain imaging. To reduce universal screening, the Delirium Risk Score may be used to identify older adults at low risk for delirium, though the evidence certainty is very low. In adults over 65 admitted to ED observation units, Zucchelli's risk assessment tool (threshold ≥ 4) may stratify delirium risk, also with very low certainty. For adults over 75, the REDEEM Score may be used to identify low- or high-risk individuals, again with very low certainty. For diagnosis, 4AT, bCAM, CAM-ICU, mCAM, AMT-4, or RASS may be used to rule delirium in or out, based on very low certainty. The Delirium Triage Screen (DTS) may be used to rule out, but not to rule in, delirium, also with very low certainty. For diagnostic imaging, there is very low certainty of evidence to recommend for or against obtaining a head CT as part of the evaluation for older ED patients with delirium. All recommendations are conditional, reflecting very low certainty of evidence due to the lack of high-quality ED-based studies and comparative effectiveness research."
        },
        {
          "label": "CONCLUSION",
          "text": "Rigorous ED-based research is needed to strengthen evidence and guide delirium care for older adults in geriatric emergency medicine."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41146403/",
      "pubDate": "2025 Oct 27",
      "doi": "10.1111/acem.70167",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false,
      "summary": "Further research in emergency departments is crucial to improve the care of older adults experiencing delirium."
    },
    {
      "id": "9907f25425a5",
      "title": "Aggressive Risk Factor Reduction Study for Atrial Fibrillation Implications for Ablation Outcomes: The ARREST-AF Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48816420/118041",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false
    },
    {
      "id": "3ea9f95c5d86",
      "title": "Pyronaridine-artesunate for treating uncomplicated Plasmodium falciparum malaria.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease",
        "Tropical and Travel Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48816420/118004",
      "abstract": "The World Health Organization (WHO) recommends artemisinin-based combination therapies (ACTs) to treat uncomplicated Plasmodium falciparum malaria. Concerns about artemisinin resistance have led to global initiatives to develop new partner drugs to protect artemisinin derivatives in ACT. Pyronaridine-artesunate (PY-AS) is a novel ACT first recommended by the WHO in 2022. To evaluate the benefits of pyronaridine-artesunate compared to alternative ACTs for treating people with uncomplicated P falciparum malaria, and to evaluate the harms of pyronaridine-artesunate and other pyronaridine treatments compared to alternative treatments. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and LILACS. We also searched ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, and the ISRCTN registry for ongoing or recently completed trials. The date of the last search was 31 July 2024. For the efficacy analysis, we included randomized controlled trials (RCTs) of pyronaridine-artesunate for treating adults and children with uncomplicated P falciparum malaria compared to any other WHO-recommended ACT. For the safety analysis, we included RCTs that used pyronaridine alone or in combination with any other antimalarials. Our primary outcomes were treatment failure at days 28 and 42 (PCR-adjusted and -unadjusted), serious adverse events, adverse events leading to withdrawal from treatment, and elevated liver function tests. Secondary outcomes included early treatment failure, other adverse events, cost-effectiveness, feasibility, and acceptability. We used the Cochrane RoB 1 tool to assess bias in the RCTs. Two review authors independently extracted all data and assessed the certainty of the evidence. We meta-analyzed data to calculate risk ratios (RRs) for treatment failures between comparisons, and for safety outcomes between and across comparisons. We included 15 studies (14 RCTs reporting safety and efficacy, 1 quasi-experimental study reporting acceptability and feasibility) with 7295 participants. For a separate safety analysis, we included 10 non-randomized studies (NRS) with 11,783 participants. Efficacy analysis (RCTs) We evaluated pyronaridine-artesunate versus the following. - Artemether-lumefantrine. Pyronaridine-artesunate probably performs better for PCR-adjusted failures at day 28 (RR 0.40, 95% confidence interval (CI) 0.19 to 0.85; 5 RCTs, 3213 participants; moderate-certainty evidence); for unadjusted failures at day 28 (RR 0.27, 95% CI 0.14 to 0.52; 5 RCTs, 3314 participants; moderate-certainty evidence); and for unadjusted failures at day 42 (RR 0.61, 95% CI 0.46 to 0.82; 4 RCTs, 3080 participants; moderate-certainty evidence). For PCR-adjusted failures at day 42, there is probably little or no difference between groups (RR 0.86, 95% CI 0.49 to 1.51; 4 RCTs, 2575 participants; moderate-certainty evidence). - Artesunate-amodiaquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.55, 95% CI 0.11 to 2.77; 1 RCT, 1245 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.49, 95% CI 0.30 to 0.81; 1 RCT, 1257 participants; moderate-certainty evidence); may make little or no difference for PCR-adjusted failures at day 42 (RR 0.98, 95% CI 0.20 to 4.83; 1 RCT, 1091 participants; low-certainty evidence); and probably makes little or no difference for unadjusted failures at day 42 (RR 0.98, 95% CI 0.78 to 1.23; 1 RCT, 1235 participants; moderate-certainty evidence). - Artesunate-mefloquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.37, 95% CI 0.13 to 1.05; 1 RCT, 1117 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.36, 95% CI 0.17 to 0.78; 1 RCT, 1120 participants; moderate-certainty evidence); may make little or no difference for unadjusted failures at day 42 (RR 0.84, 95% CI 0.54 to 1.31; 1 RCT, 1059 participants; low-certainty evidence); but may lead to higher PCR-adjusted failures at day 42 (RR 1.80, 95% CI 0.90 to 3.57; 1 RCT, 1037 participants; low-certainty evidence). Safety analysis in adults and children (RCTs) Pyronaridine-artesunate was associated with raised liver enzymes compared to other antimalarials: alanine aminotransferase (ALT) (RR 3.59, 95% CI 1.76 to 7.33; 8 RCTs, 6669 participants; high-certainty evidence) and aspartate transaminase (AST) (RR 2.22, 95% CI 1.12 to 4.41; 8 RCTs, 6669 participants; high-certainty evidence). There was no such effect with bilirubin (RR 1.03, 95% CI 0.49 to 2.18; 7 RCTs, 6384 participants; moderate-certainty evidence). There was one reported case in which raised ALT occurred with raised bilirubin. No study reported severe drug-induced liver injury. Safety analysis in pregnant women (RCTs) We do not know if malaria testing and treatment with pyronaridine-artesunate for positive cases resulted in any difference in serious adverse effects for pregnant women compared to intermittent preventive treatment with sulfadoxine-pyrimethamine (RR 0.57, 95% CI 0.28 to 1.15; 1 RCT, 250 participants; very-low certainty evidence). Acceptability and feasibility One study determined that the adherence rate to a three-day treatment with pyronaridine-artesunate in children aged under five years was 85.3%. Limited qualitative data suggests pyronaridine-artesunate is acceptable to patients and their carers. Certainty of the evidence and limitations The studies included in this review ranged between very low-certainty and high-certainty evidence, largely due to imprecision of the effect estimate with wide CIs, and indirectness, given that children under five years were under-represented (especially in Asia). We did not identify any evidence of cost-effectiveness. Pyronaridine-artesunate was efficacious against uncomplicated P falciparum malaria; achieved a PCR-adjusted treatment failure rate of less than 8% at days 28 and 42; and may be at least as good as artesunate-amodiaquine and artesunate-mefloquine (based on 1 RCT per drug) and may be at least as good as, or better than, artemether-lumefantrine. Pyronaridine-artesunate increases the risk of episodes of abnormally raised ALT and AST compared to other studied therapeutics. Tilly Fox and the Cochrane Infectious Diseases Group editorial base were funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104, ended 31 December 2024). The views expressed do not necessarily reflect the UK Government's official policies. Protocol and previous versions available via doi.org/10.1002/14651858.CD006404, doi.org/10.1002/14651858.CD006404.pub2, doi.org/10.1002/14651858.CD006404.pub3, doi.org/10.1002/14651858.CD006404.pub4.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "The World Health Organization (WHO) recommends artemisinin-based combination therapies (ACTs) to treat uncomplicated Plasmodium falciparum malaria. Concerns about artemisinin resistance have led to global initiatives to develop new partner drugs to protect artemisinin derivatives in ACT. Pyronaridine-artesunate (PY-AS) is a novel ACT first recommended by the WHO in 2022."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the benefits of pyronaridine-artesunate compared to alternative ACTs for treating people with uncomplicated P falciparum malaria, and to evaluate the harms of pyronaridine-artesunate and other pyronaridine treatments compared to alternative treatments."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and LILACS. We also searched ClinicalTrials.gov, the WHO International Clinical Trials Registry Platform, and the ISRCTN registry for ongoing or recently completed trials. The date of the last search was 31 July 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "For the efficacy analysis, we included randomized controlled trials (RCTs) of pyronaridine-artesunate for treating adults and children with uncomplicated P falciparum malaria compared to any other WHO-recommended ACT. For the safety analysis, we included RCTs that used pyronaridine alone or in combination with any other antimalarials."
        },
        {
          "label": "OUTCOMES",
          "text": "Our primary outcomes were treatment failure at days 28 and 42 (PCR-adjusted and -unadjusted), serious adverse events, adverse events leading to withdrawal from treatment, and elevated liver function tests. Secondary outcomes included early treatment failure, other adverse events, cost-effectiveness, feasibility, and acceptability."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the Cochrane RoB 1 tool to assess bias in the RCTs."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently extracted all data and assessed the certainty of the evidence. We meta-analyzed data to calculate risk ratios (RRs) for treatment failures between comparisons, and for safety outcomes between and across comparisons."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 15 studies (14 RCTs reporting safety and efficacy, 1 quasi-experimental study reporting acceptability and feasibility) with 7295 participants. For a separate safety analysis, we included 10 non-randomized studies (NRS) with 11,783 participants."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Efficacy analysis (RCTs) We evaluated pyronaridine-artesunate versus the following. - Artemether-lumefantrine. Pyronaridine-artesunate probably performs better for PCR-adjusted failures at day 28 (RR 0.40, 95% confidence interval (CI) 0.19 to 0.85; 5 RCTs, 3213 participants; moderate-certainty evidence); for unadjusted failures at day 28 (RR 0.27, 95% CI 0.14 to 0.52; 5 RCTs, 3314 participants; moderate-certainty evidence); and for unadjusted failures at day 42 (RR 0.61, 95% CI 0.46 to 0.82; 4 RCTs, 3080 participants; moderate-certainty evidence). For PCR-adjusted failures at day 42, there is probably little or no difference between groups (RR 0.86, 95% CI 0.49 to 1.51; 4 RCTs, 2575 participants; moderate-certainty evidence). - Artesunate-amodiaquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.55, 95% CI 0.11 to 2.77; 1 RCT, 1245 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.49, 95% CI 0.30 to 0.81; 1 RCT, 1257 participants; moderate-certainty evidence); may make little or no difference for PCR-adjusted failures at day 42 (RR 0.98, 95% CI 0.20 to 4.83; 1 RCT, 1091 participants; low-certainty evidence); and probably makes little or no difference for unadjusted failures at day 42 (RR 0.98, 95% CI 0.78 to 1.23; 1 RCT, 1235 participants; moderate-certainty evidence). - Artesunate-mefloquine. Pyronaridine-artesunate may perform better for PCR-adjusted failures at day 28 (RR 0.37, 95% CI 0.13 to 1.05; 1 RCT, 1117 participants; low-certainty evidence, CI crosses line of no effect); probably performs better for unadjusted failures at day 28 (RR 0.36, 95% CI 0.17 to 0.78; 1 RCT, 1120 participants; moderate-certainty evidence); may make little or no difference for unadjusted failures at day 42 (RR 0.84, 95% CI 0.54 to 1.31; 1 RCT, 1059 participants; low-certainty evidence); but may lead to higher PCR-adjusted failures at day 42 (RR 1.80, 95% CI 0.90 to 3.57; 1 RCT, 1037 participants; low-certainty evidence). Safety analysis in adults and children (RCTs) Pyronaridine-artesunate was associated with raised liver enzymes compared to other antimalarials: alanine aminotransferase (ALT) (RR 3.59, 95% CI 1.76 to 7.33; 8 RCTs, 6669 participants; high-certainty evidence) and aspartate transaminase (AST) (RR 2.22, 95% CI 1.12 to 4.41; 8 RCTs, 6669 participants; high-certainty evidence). There was no such effect with bilirubin (RR 1.03, 95% CI 0.49 to 2.18; 7 RCTs, 6384 participants; moderate-certainty evidence). There was one reported case in which raised ALT occurred with raised bilirubin. No study reported severe drug-induced liver injury. Safety analysis in pregnant women (RCTs) We do not know if malaria testing and treatment with pyronaridine-artesunate for positive cases resulted in any difference in serious adverse effects for pregnant women compared to intermittent preventive treatment with sulfadoxine-pyrimethamine (RR 0.57, 95% CI 0.28 to 1.15; 1 RCT, 250 participants; very-low certainty evidence). Acceptability and feasibility One study determined that the adherence rate to a three-day treatment with pyronaridine-artesunate in children aged under five years was 85.3%. Limited qualitative data suggests pyronaridine-artesunate is acceptable to patients and their carers. Certainty of the evidence and limitations The studies included in this review ranged between very low-certainty and high-certainty evidence, largely due to imprecision of the effect estimate with wide CIs, and indirectness, given that children under five years were under-represented (especially in Asia). We did not identify any evidence of cost-effectiveness."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Pyronaridine-artesunate was efficacious against uncomplicated P falciparum malaria; achieved a PCR-adjusted treatment failure rate of less than 8% at days 28 and 42; and may be at least as good as artesunate-amodiaquine and artesunate-mefloquine (based on 1 RCT per drug) and may be at least as good as, or better than, artemether-lumefantrine. Pyronaridine-artesunate increases the risk of episodes of abnormally raised ALT and AST compared to other studied therapeutics."
        },
        {
          "label": "FUNDING",
          "text": "Tilly Fox and the Cochrane Infectious Diseases Group editorial base were funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104, ended 31 December 2024). The views expressed do not necessarily reflect the UK Government's official policies."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol and previous versions available via doi.org/10.1002/14651858.CD006404, doi.org/10.1002/14651858.CD006404.pub2, doi.org/10.1002/14651858.CD006404.pub3, doi.org/10.1002/14651858.CD006404.pub4."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41085194/",
      "pubDate": "2025 Oct 14",
      "doi": "10.1002/14651858.CD006404.pub5",
      "dateReceived": "2025-11-13T23:25:17.293Z",
      "isNew": false,
      "summary": "Pyronaridine-artesunate effectively treats uncomplicated *P. falciparum* malaria with a low failure rate, potentially performing as well or better than other artemisinin-based combination therapies, but increases the risk of elevated liver enzymes."
    },
    {
      "id": "2fd1834f5ccb",
      "title": "Triple Versus Dual Lipid-Lowering Therapy in Acute Coronary Syndrome: The ES-BempeDACS Randomized Clinical Trial.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48905249/118089",
      "abstract": "Current guidelines recommend a stepwise strategy to achieve low-density lipoprotein cholesterol (LDL-C) goals after acute coronary syndrome (ACS). Earlier intensive strategies based on a combination of lipid-lowering therapies (LLTs) could be useful from the onset of ACS. However, the role of bempedoic acid in ACS, particularly when combined with high-intensity statins and ezetimibe, remains uncertain. The aim of ES-BempeDACS (Efficacy and Security of Bempedoic Acid in Acute Coronary Syndrome) was to compare the efficacy and safety of triple LLT (high-dose, high-intensity statin+ezetimibe+bempedoic acid) versus standard of care (high-dose, high-intensity statin+ezetimibe) after ACS. ES-BempeDACS is a multicenter, independent, pragmatic, prospective, randomized, open, blinded end point controlled trial conducted in 12 Spanish hospitals between November 2023 and October 2024. The primary end point was the proportion of patients achieving LDL-C <55 mg/dL (<1.4 mmol/L) at 8 weeks after ACS, comparing triple LLT with standard of care. A total of 206 patients (59.5±10.9 years of age [mean±SD]; 21.4% women) were randomized within the first 72 hours of ACS to triple LLT or standard therapy of high-intensity statin+ezetimibe (ie, dual LLT). The baseline LDL-C level was 133.6±28.8 mg/dL. After 8 weeks, the LDL-C level was reduced to <55 mg/dL in 59.4% of patients in the triple LLT group compared with 53.1% in the control group (dual LLT; =0.376). The percentage change in LDL-C level was 57.5±17.8% and 56.9±18.5% in the triple and dual LLT groups, respectively (=0.823). Triple versus dual LLT showed similar results in reduction of non-high-density lipoprotein cholesterol levels (49.0±25.4 in triple LLT versus 49.1±31.2 in dual LLT; =0.970) and triglyceride levels (14.9±36.9 in triple LLT versus 16.8±36.0 in dual LLT;) =0.718), without differences in adverse events. Both dual and triple LLT after ACS allow for high rates (>50%) of adequate LDL-C control (<55 mg/dL) at 8 weeks. Adding bempedoic acid to statin-ezetimibe therapy in the setting of ACS is safe but failed to improve the percentage of patients achieving the LDL-C goal (<55 mg/dL) at 8 weeks. Larger, randomized studies are needed to confirm our findings. URL: https://www.clinicaltrialsregister.eu; Unique identifier: 2021-006550-31.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Current guidelines recommend a stepwise strategy to achieve low-density lipoprotein cholesterol (LDL-C) goals after acute coronary syndrome (ACS). Earlier intensive strategies based on a combination of lipid-lowering therapies (LLTs) could be useful from the onset of ACS. However, the role of bempedoic acid in ACS, particularly when combined with high-intensity statins and ezetimibe, remains uncertain. The aim of ES-BempeDACS (Efficacy and Security of Bempedoic Acid in Acute Coronary Syndrome) was to compare the efficacy and safety of triple LLT (high-dose, high-intensity statin+ezetimibe+bempedoic acid) versus standard of care (high-dose, high-intensity statin+ezetimibe) after ACS."
        },
        {
          "label": "METHODS",
          "text": "ES-BempeDACS is a multicenter, independent, pragmatic, prospective, randomized, open, blinded end point controlled trial conducted in 12 Spanish hospitals between November 2023 and October 2024. The primary end point was the proportion of patients achieving LDL-C <55 mg/dL (<1.4 mmol/L) at 8 weeks after ACS, comparing triple LLT with standard of care."
        },
        {
          "label": "RESULTS",
          "text": "A total of 206 patients (59.5±10.9 years of age [mean±SD]; 21.4% women) were randomized within the first 72 hours of ACS to triple LLT or standard therapy of high-intensity statin+ezetimibe (ie, dual LLT). The baseline LDL-C level was 133.6±28.8 mg/dL. After 8 weeks, the LDL-C level was reduced to <55 mg/dL in 59.4% of patients in the triple LLT group compared with 53.1% in the control group (dual LLT; =0.376). The percentage change in LDL-C level was 57.5±17.8% and 56.9±18.5% in the triple and dual LLT groups, respectively (=0.823). Triple versus dual LLT showed similar results in reduction of non-high-density lipoprotein cholesterol levels (49.0±25.4 in triple LLT versus 49.1±31.2 in dual LLT; =0.970) and triglyceride levels (14.9±36.9 in triple LLT versus 16.8±36.0 in dual LLT;) =0.718), without differences in adverse events."
        },
        {
          "label": "CONCLUSION",
          "text": "Both dual and triple LLT after ACS allow for high rates (>50%) of adequate LDL-C control (<55 mg/dL) at 8 weeks. Adding bempedoic acid to statin-ezetimibe therapy in the setting of ACS is safe but failed to improve the percentage of patients achieving the LDL-C goal (<55 mg/dL) at 8 weeks. Larger, randomized studies are needed to confirm our findings."
        },
        {
          "label": "REGISTRATION",
          "text": "URL: https://www.clinicaltrialsregister.eu; Unique identifier: 2021-006550-31."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41200807/",
      "pubDate": "2025 Nov 07",
      "doi": "10.1161/CIRCULATIONAHA.125.075388",
      "dateReceived": "2025-11-13T23:25:17.292Z",
      "isNew": false,
      "summary": "In patients with acute coronary syndrome, both dual and triple lipid-lowering therapy achieved high rates of LDL-C control, but adding bempedoic acid to statin-ezetimibe did not further improve LDL-C goal attainment."
    },
    {
      "id": "59745d3a7f74",
      "title": "Falling short on implementation of fall prevention guidelines in health services: a systematic review with meta-analysis.",
      "journal": "Age Ageing",
      "score": "6/7",
      "tags": [
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48892119/118014",
      "abstract": "Falls are a serious risk for people who use health services. We aimed to evaluate the implementation of fall prevention guidelines in health services. Databases and grey literature were searched for studies of the implementation of fall prevention guidelines in health services. Implementation outcomes were aligned with the reach, effectiveness, adoption, implementation and maintenance framework. The methodological quality of included papers was assessed using an internal validity checklist. Results were synthesised using narrative synthesis and meta-analysis. The certainty of evidence of each meta-analysis was assessed using the Grading of Recommendations Assessment, Development and Evaluation framework. Fifty-five studies of over 115 000 patients implemented recommendations from 14 fall prevention guidelines. Methodological quality was generally poor (median of 5 of 13 internal validity criteria). Median reach of guideline implementation was 64% (range 38%-96%, five studies). Meta-analysis provided low certainty evidence that implementing guidelines did not prevent falls [falls risk ratio 1.01, 95% confidence interval (CI) = 0.81-1.26; falls rate ratio 1.06, 95% CI = 0.77-1.46]. Adoption of fall prevention recommendations by health professionals improved in 87% of recorded outcomes across 43 studies and was maintained 50% of the time. Adherence of patients to recommendations, however, varied from 7% to 73%. Two studies assessed maintenance of reduced falls percentage or rates and found that changes were sustained. Implementation of fall prevention guidelines in health services can change and sometimes sustain fall prevention behaviour of health professionals. It is uncertain whether implementation leads to reduced falls or changes in patient behaviour.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Falls are a serious risk for people who use health services. We aimed to evaluate the implementation of fall prevention guidelines in health services."
        },
        {
          "label": "METHODS",
          "text": "Databases and grey literature were searched for studies of the implementation of fall prevention guidelines in health services. Implementation outcomes were aligned with the reach, effectiveness, adoption, implementation and maintenance framework. The methodological quality of included papers was assessed using an internal validity checklist. Results were synthesised using narrative synthesis and meta-analysis. The certainty of evidence of each meta-analysis was assessed using the Grading of Recommendations Assessment, Development and Evaluation framework."
        },
        {
          "label": "RESULTS",
          "text": "Fifty-five studies of over 115 000 patients implemented recommendations from 14 fall prevention guidelines. Methodological quality was generally poor (median of 5 of 13 internal validity criteria). Median reach of guideline implementation was 64% (range 38%-96%, five studies). Meta-analysis provided low certainty evidence that implementing guidelines did not prevent falls [falls risk ratio 1.01, 95% confidence interval (CI) = 0.81-1.26; falls rate ratio 1.06, 95% CI = 0.77-1.46]. Adoption of fall prevention recommendations by health professionals improved in 87% of recorded outcomes across 43 studies and was maintained 50% of the time. Adherence of patients to recommendations, however, varied from 7% to 73%. Two studies assessed maintenance of reduced falls percentage or rates and found that changes were sustained."
        },
        {
          "label": "CONCLUSION",
          "text": "Implementation of fall prevention guidelines in health services can change and sometimes sustain fall prevention behaviour of health professionals. It is uncertain whether implementation leads to reduced falls or changes in patient behaviour."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41134532/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf307",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "Implementing fall prevention guidelines can alter healthcare professionals' fall prevention practices, but the impact on patient falls or behavior is unclear."
    },
    {
      "id": "f291bb9fa61a",
      "title": "Transfusion thresholds and other strategies for guiding red blood cell transfusion.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Gastroenterology",
        "Hematology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118056",
      "abstract": "The optimal haemoglobin threshold for use of red blood cell (RBC) transfusions in anaemic patients remains an active area of research. Blood is a limited resource, and there are concerns about risks, including transmitted infections. If a liberal transfusion strategy does not improve clinical outcomes, or if it is equivalent, then adopting a more restrictive approach should be recognised as the standard of care. The aim of this review update was to compare 30-day mortality and other clinical outcomes for participants randomised to restrictive versus liberal red blood cell (RBC) transfusion thresholds (triggers) for all clinical conditions. The restrictive transfusion threshold uses a lower haemoglobin concentration as a threshold for transfusion (most commonly, 7.0 g/dL to 8.0 g/dL), and the liberal transfusion threshold uses a higher haemoglobin concentration to direct transfusion (most commonly, 9.0 g/dL to 10.0 g/dL). Increasingly, investigators are considering other strategies including physiological triggers (i.e. central venous oxygen saturation), alone or in combination with such thresholds, to determine when a transfusion is indicated, so it is important to assess this growing body of evidence in tandem. We searched CENTRAL, MEDLINE, Embase, Transfusion Evidence Library, Web of Science Conference Proceedings Citation Index, trial registries and PubMed on 14 October 2024. We checked reference lists of published reviews and papers for additional trials. We included randomised trials of surgical or medical participants that recruited adults or children. We excluded studies that focused on preterm neonates. Eligible trials assigned intervention groups based on different transfusion strategies or thresholds, usually defined by a haemoglobin concentration below which a RBC transfusion would be administered. We included trials in which investigators had allocated participants to higher thresholds or more liberal transfusion strategies compared to more restrictive ones, which might include no transfusion. We used standard Cochrane methods. We pooled risk ratios across trials using a random-effects model. We assessed risk of bias using the Cochrane RoB 1 tool, and assessed the certainty of evidence using GRADE. We defined participants randomly allocated to the lower transfusion threshold as being in the 'restrictive transfusion' group and those randomly allocated to the higher transfusion threshold as being in the 'liberal transfusion' group. Adult threshold comparison We included 61 trials (27,639 participants), across a range of clinical contexts: orthopaedic, cardiac or vascular surgery; critical care; neurocritical care; gastrointestinal bleeding; trauma; acute myocardial infarction; haematological malignancies and postpartum haemorrhage. The haemoglobin concentration used to define the restrictive transfusion group in most trials was between 7.0 g/dL and 8.0 g/dL. The main outcomes were exposure to blood transfusion, 30-day mortality, neurologic function, myocardial infarction, congestive heart failure, cerebral vascular accident, infection and thromboembolism. Studies were generally at low risk of bias. Restrictive transfusion strategies reduced the risk of receiving at least one RBC transfusion by 42% when combining all clinical contexts (risk ratio (RR) 0.58, 95% confidence interval (CI) 0.52 to 0.65; high-certainty evidence), with a large amount of heterogeneity between trials (I² = 97%), reflecting diversity in the strength of estimates, not the efficacy of the policy. When combining all clinical contexts, restrictive transfusion strategies did not modify the risk of 30-day mortality compared with liberal transfusion strategies (RR 1.01, 95% CI 0.90 to 1.14; 44 studies, 22,575 participants; high-certainty evidence) or any of the other outcomes assessed including myocardial infarction, stroke, thromboembolism or infection (moderate to high-certainty evidence). There were two exceptions in clinical populations. In gastrointestinal bleeding, 30-day mortality was lower with a restrictive transfusion strategy (RR 0.63, 95% CI 0.42 to 0.95; 4 studies, 1574 participants). In critically ill patients with brain injury, unfavourable neurological outcome at 6 to 12 months was lower with a liberal transfusion strategy (RR 1.14, 95% CI 1.05 to 1.22; 4 studies, 2297 participants) (moderate-certainty evidence). Transfusion-specific reactions are uncommon, but occurred more frequently with the liberal strategy (Peto odds ratio 0.47, 95% CI 0.36 to 0.62; 18 studies, 11,505 participants). Paediatric threshold comparison We included eight trials (2764 participants), across a limited range of clinical contexts (critical care, cardiac surgery, haematological malignancies and severe malarial anaemia). The haemoglobin concentration used to define the restrictive group in critical care and haematological malignancies trials was between 6.5 g/dL and 8.0 g/dL, and between 7.0 g/dL and 9 g/dL in cardiac surgery trials, depending on the cardiac abnormality and stage of repair. Studies were generally at low risk of bias. There was no clear difference in 30-day mortality between restrictive and liberal transfusion strategies, although confidence intervals were wide (RR 1.22, 95% CI 0.72 to 2.08; 7 studies, 2571 participants; low-certainty evidence). There was moderate-certainty evidence of no clear difference between threshold strategies for infection; very low-certainty evidence of little to no difference for thrombosis and very low-certainty evidence of little to no difference for the outcomes multiple organ dysfunction and cerebrovascular accident. Physiological triggers Nine trials in adults (3818 participants) and one trial in children (100 participants) were identified. These tested different interventions and measures of physiological parameters in diverse clinical populations. The risk of bias was variable. Meta-analysis was not appropriate due to heterogeneity. A restrictive transfusion strategy significantly decreased the proportion of adults and children exposed to RBC transfusion. In most clinical contexts, there was no evidence of harm from a restrictive compared with a liberal transfusion strategy. Neurocritically ill patients, however, have better neurological outcomes at 6 to 12 months with a liberal transfusion strategy. Further work is needed to improve our understanding of outcomes beyond mortality, and to what degree the optimal strategies for transfusion should be modified in some patient populations, including different types of acute bleeding, cancers and subgroups of patients with myocardial infarction and other neurological injuries. New studies need to recognise the clinical context and the limitations of the adoption of a single threshold of haemoglobin, and to consider evaluating the use of physiological parameters to modify transfusion.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The optimal haemoglobin threshold for use of red blood cell (RBC) transfusions in anaemic patients remains an active area of research. Blood is a limited resource, and there are concerns about risks, including transmitted infections. If a liberal transfusion strategy does not improve clinical outcomes, or if it is equivalent, then adopting a more restrictive approach should be recognised as the standard of care."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this review update was to compare 30-day mortality and other clinical outcomes for participants randomised to restrictive versus liberal red blood cell (RBC) transfusion thresholds (triggers) for all clinical conditions. The restrictive transfusion threshold uses a lower haemoglobin concentration as a threshold for transfusion (most commonly, 7.0 g/dL to 8.0 g/dL), and the liberal transfusion threshold uses a higher haemoglobin concentration to direct transfusion (most commonly, 9.0 g/dL to 10.0 g/dL). Increasingly, investigators are considering other strategies including physiological triggers (i.e. central venous oxygen saturation), alone or in combination with such thresholds, to determine when a transfusion is indicated, so it is important to assess this growing body of evidence in tandem."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, Transfusion Evidence Library, Web of Science Conference Proceedings Citation Index, trial registries and PubMed on 14 October 2024. We checked reference lists of published reviews and papers for additional trials."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised trials of surgical or medical participants that recruited adults or children. We excluded studies that focused on preterm neonates. Eligible trials assigned intervention groups based on different transfusion strategies or thresholds, usually defined by a haemoglobin concentration below which a RBC transfusion would be administered. We included trials in which investigators had allocated participants to higher thresholds or more liberal transfusion strategies compared to more restrictive ones, which might include no transfusion."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "We used standard Cochrane methods. We pooled risk ratios across trials using a random-effects model. We assessed risk of bias using the Cochrane RoB 1 tool, and assessed the certainty of evidence using GRADE. We defined participants randomly allocated to the lower transfusion threshold as being in the 'restrictive transfusion' group and those randomly allocated to the higher transfusion threshold as being in the 'liberal transfusion' group."
        },
        {
          "label": "MAIN RESULTS",
          "text": "Adult threshold comparison We included 61 trials (27,639 participants), across a range of clinical contexts: orthopaedic, cardiac or vascular surgery; critical care; neurocritical care; gastrointestinal bleeding; trauma; acute myocardial infarction; haematological malignancies and postpartum haemorrhage. The haemoglobin concentration used to define the restrictive transfusion group in most trials was between 7.0 g/dL and 8.0 g/dL. The main outcomes were exposure to blood transfusion, 30-day mortality, neurologic function, myocardial infarction, congestive heart failure, cerebral vascular accident, infection and thromboembolism. Studies were generally at low risk of bias. Restrictive transfusion strategies reduced the risk of receiving at least one RBC transfusion by 42% when combining all clinical contexts (risk ratio (RR) 0.58, 95% confidence interval (CI) 0.52 to 0.65; high-certainty evidence), with a large amount of heterogeneity between trials (I² = 97%), reflecting diversity in the strength of estimates, not the efficacy of the policy. When combining all clinical contexts, restrictive transfusion strategies did not modify the risk of 30-day mortality compared with liberal transfusion strategies (RR 1.01, 95% CI 0.90 to 1.14; 44 studies, 22,575 participants; high-certainty evidence) or any of the other outcomes assessed including myocardial infarction, stroke, thromboembolism or infection (moderate to high-certainty evidence). There were two exceptions in clinical populations. In gastrointestinal bleeding, 30-day mortality was lower with a restrictive transfusion strategy (RR 0.63, 95% CI 0.42 to 0.95; 4 studies, 1574 participants). In critically ill patients with brain injury, unfavourable neurological outcome at 6 to 12 months was lower with a liberal transfusion strategy (RR 1.14, 95% CI 1.05 to 1.22; 4 studies, 2297 participants) (moderate-certainty evidence). Transfusion-specific reactions are uncommon, but occurred more frequently with the liberal strategy (Peto odds ratio 0.47, 95% CI 0.36 to 0.62; 18 studies, 11,505 participants). Paediatric threshold comparison We included eight trials (2764 participants), across a limited range of clinical contexts (critical care, cardiac surgery, haematological malignancies and severe malarial anaemia). The haemoglobin concentration used to define the restrictive group in critical care and haematological malignancies trials was between 6.5 g/dL and 8.0 g/dL, and between 7.0 g/dL and 9 g/dL in cardiac surgery trials, depending on the cardiac abnormality and stage of repair. Studies were generally at low risk of bias. There was no clear difference in 30-day mortality between restrictive and liberal transfusion strategies, although confidence intervals were wide (RR 1.22, 95% CI 0.72 to 2.08; 7 studies, 2571 participants; low-certainty evidence). There was moderate-certainty evidence of no clear difference between threshold strategies for infection; very low-certainty evidence of little to no difference for thrombosis and very low-certainty evidence of little to no difference for the outcomes multiple organ dysfunction and cerebrovascular accident. Physiological triggers Nine trials in adults (3818 participants) and one trial in children (100 participants) were identified. These tested different interventions and measures of physiological parameters in diverse clinical populations. The risk of bias was variable. Meta-analysis was not appropriate due to heterogeneity."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "A restrictive transfusion strategy significantly decreased the proportion of adults and children exposed to RBC transfusion. In most clinical contexts, there was no evidence of harm from a restrictive compared with a liberal transfusion strategy. Neurocritically ill patients, however, have better neurological outcomes at 6 to 12 months with a liberal transfusion strategy. Further work is needed to improve our understanding of outcomes beyond mortality, and to what degree the optimal strategies for transfusion should be modified in some patient populations, including different types of acute bleeding, cancers and subgroups of patients with myocardial infarction and other neurological injuries. New studies need to recognise the clinical context and the limitations of the adoption of a single threshold of haemoglobin, and to consider evaluating the use of physiological parameters to modify transfusion."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41114449/",
      "pubDate": "2025 Oct 20",
      "doi": "10.1002/14651858.CD002042.pub6",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "A restrictive red blood cell transfusion strategy reduces transfusion exposure without harm in most adults and children, except in neurocritically ill patients who may benefit from a more liberal approach."
    },
    {
      "id": "6359263251cf",
      "title": "Intracranial Hemorrhage With Direct Oral Anticoagulants vs Low-Molecular-Weight Heparin in Brain Tumors: A Review and Meta-Analysis.",
      "journal": "Neurology",
      "score": "5/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118045",
      "abstract": "Patients with brain tumors face an increased risk of arterial and venous thromboembolic events. However, owing to risk of intracranial hemorrhage (ICH), clinician practice patterns vary on preference for anticoagulation treatment. This meta-analysis evaluates the safety of direct oral anticoagulants (DOACs) vs low-molecular-weight heparin (LMWH) on the development of ICH in patients with brain tumor. We searched MEDLINE, Embase, Web of Science, and Cochrane Central Register of Controlled Trials (January 2010-June 2025) for randomized-controlled trials or cohort studies enrolling adults (age ≥18 years) with primary or metastatic brain tumors receiving therapeutic DOACs (apixaban, rivaroxaban, edoxaban, betrixaban, and dabigatran) vs LMWH (enoxaparin, dalteparin, nadroparin, and tinzaparin). Studies limited to prophylactic dosing or non-brain tumor patients were excluded. Pooled risk ratios (RRs) with 95% CIs were calculated using a restricted random-effects model. Heterogeneity () and bias were evaluated, with prespecified subgroups (tumor type, follow-up duration, and study quality) and sensitivity analyses. The study protocol was registered on PROSPERO (CRD42025635334). Among 762 publications identified, 10 retrospective cohort studies (1,572 patients: 645 DOAC, 895 LMWH) were included. Patients' mean or median age ranged 60.4-67 years (DOAC) vs 53-64 years (LMWH), with follow-up durations ranging from 3 to 12 months. Patients with primary or metastatic brain tumors receiving DOACs had a statistically significantly lower risk of any ICH compared with LMWH (RR = 0.50, 95% CI 0.29-0.87;  = 0.01,  = 49.50%). Reduction was more pronounced in 3 studies with three-month follow-up (RR = 0.23, 95% CI 0.09-0.57;  < 0.01,  < 0.01%). Stratified analyses showed reduced ICH risk with DOACs in primary brain tumors (5 studies, RR = 0.20, 95% CI 0.08-0.54;  < 0.01,  < 0.01%) but not in metastatic brain tumors (5 studies, RR = 0.86, 95% CI 0.44-1.68;  = 0.66,  = 36.04%). Leave-one-out analyses confirmed robustness, and cumulative meta-analysis demonstrated stable estimates with narrowing CIs. Egger ( = 0.19) and Begg ( = 0.59) tests showed no statistical evidence of publication bias. In the current meta-analysis, DOACs were associated with significantly lower ICH risk than LMWH in patients with anticoagulated brain tumor, particularly those with primary brain tumors. Findings support DOACs as a safe anticoagulant in arterial and venous thromboembolism. Given observational designs with inherent confounding, findings warrant cautious interpretation.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND OBJECTIVES",
          "text": "Patients with brain tumors face an increased risk of arterial and venous thromboembolic events. However, owing to risk of intracranial hemorrhage (ICH), clinician practice patterns vary on preference for anticoagulation treatment. This meta-analysis evaluates the safety of direct oral anticoagulants (DOACs) vs low-molecular-weight heparin (LMWH) on the development of ICH in patients with brain tumor."
        },
        {
          "label": "METHODS",
          "text": "We searched MEDLINE, Embase, Web of Science, and Cochrane Central Register of Controlled Trials (January 2010-June 2025) for randomized-controlled trials or cohort studies enrolling adults (age ≥18 years) with primary or metastatic brain tumors receiving therapeutic DOACs (apixaban, rivaroxaban, edoxaban, betrixaban, and dabigatran) vs LMWH (enoxaparin, dalteparin, nadroparin, and tinzaparin). Studies limited to prophylactic dosing or non-brain tumor patients were excluded. Pooled risk ratios (RRs) with 95% CIs were calculated using a restricted random-effects model. Heterogeneity () and bias were evaluated, with prespecified subgroups (tumor type, follow-up duration, and study quality) and sensitivity analyses. The study protocol was registered on PROSPERO (CRD42025635334)."
        },
        {
          "label": "RESULTS",
          "text": "Among 762 publications identified, 10 retrospective cohort studies (1,572 patients: 645 DOAC, 895 LMWH) were included. Patients' mean or median age ranged 60.4-67 years (DOAC) vs 53-64 years (LMWH), with follow-up durations ranging from 3 to 12 months. Patients with primary or metastatic brain tumors receiving DOACs had a statistically significantly lower risk of any ICH compared with LMWH (RR = 0.50, 95% CI 0.29-0.87;  = 0.01,  = 49.50%). Reduction was more pronounced in 3 studies with three-month follow-up (RR = 0.23, 95% CI 0.09-0.57;  < 0.01,  < 0.01%). Stratified analyses showed reduced ICH risk with DOACs in primary brain tumors (5 studies, RR = 0.20, 95% CI 0.08-0.54;  < 0.01,  < 0.01%) but not in metastatic brain tumors (5 studies, RR = 0.86, 95% CI 0.44-1.68;  = 0.66,  = 36.04%). Leave-one-out analyses confirmed robustness, and cumulative meta-analysis demonstrated stable estimates with narrowing CIs. Egger ( = 0.19) and Begg ( = 0.59) tests showed no statistical evidence of publication bias."
        },
        {
          "label": "DISCUSSION",
          "text": "In the current meta-analysis, DOACs were associated with significantly lower ICH risk than LMWH in patients with anticoagulated brain tumor, particularly those with primary brain tumors. Findings support DOACs as a safe anticoagulant in arterial and venous thromboembolism. Given observational designs with inherent confounding, findings warrant cautious interpretation."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40953341/",
      "pubDate": "2025 Oct 21",
      "doi": "10.1212/WNL.0000000000214140",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "In patients with brain tumors, direct oral anticoagulants (DOACs) were associated with a significantly lower risk of intracranial hemorrhage (ICH) compared to low-molecular-weight heparin (LMWH)."
    },
    {
      "id": "651bdaf9295c",
      "title": "Immediate or Deferred Nonculprit-Lesion PCI in Myocardial Infarction.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118038",
      "abstract": "The preferred timing of treatment of nonculprit lesions in patients with ST-segment elevation myocardial infarction (STEMI) remains uncertain. A comparison of immediate percutaneous coronary intervention (PCI) guided by instantaneous wave-free ratio (iFR) and deferred PCI guided by cardiac stress magnetic resonance imaging (MRI) in patients with STEMI and multivessel disease is warranted. In this international, investigator-initiated, open-label, randomized, controlled trial, patients with STEMI and at least one nonculprit lesion who had undergone successful primary PCI were randomly assigned in a 1:1 ratio to immediate iFR-guided PCI (in lesions with >50% stenosis and an iFR of ≤0.89 [normal value, >0.89]) or deferred cardiac stress MRI-guided PCI within 6 weeks after randomization. The primary end point was a composite of death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3-year follow-up. The trial included 1146 patients (558 in the iFR group and 588 in the MRI group) with a mean (±SD) age of 63±11 years; 78% were men. A total of 237 of 556 patients (42.6%) in the iFR group and 110 of 587 patients (18.7%) in the MRI group underwent nonculprit-lesion coronary-artery PCI. A primary-end-point event occurred in 50 patients (9.3%) in the iFR group and in 55 patients (9.8%) in the MRI group (hazard ratio, 0.95; 95% confidence interval, 0.65 to 1.40; P = 0.81). Serious adverse events occurred in 145 patients in the iFR group and in 181 in the MRI group. Among patients with STEMI who have undergone successful primary PCI, immediate iFR-guided PCI was not superior to deferred cardiac stress MRI-guided PCI of nonculprit coronary-artery lesions with respect to death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3 years. (Funded by Philips Volcano and others; iMODERN ClinicalTrials.gov number, NCT03298659.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The preferred timing of treatment of nonculprit lesions in patients with ST-segment elevation myocardial infarction (STEMI) remains uncertain. A comparison of immediate percutaneous coronary intervention (PCI) guided by instantaneous wave-free ratio (iFR) and deferred PCI guided by cardiac stress magnetic resonance imaging (MRI) in patients with STEMI and multivessel disease is warranted."
        },
        {
          "label": "METHODS",
          "text": "In this international, investigator-initiated, open-label, randomized, controlled trial, patients with STEMI and at least one nonculprit lesion who had undergone successful primary PCI were randomly assigned in a 1:1 ratio to immediate iFR-guided PCI (in lesions with >50% stenosis and an iFR of ≤0.89 [normal value, >0.89]) or deferred cardiac stress MRI-guided PCI within 6 weeks after randomization. The primary end point was a composite of death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3-year follow-up."
        },
        {
          "label": "RESULTS",
          "text": "The trial included 1146 patients (558 in the iFR group and 588 in the MRI group) with a mean (±SD) age of 63±11 years; 78% were men. A total of 237 of 556 patients (42.6%) in the iFR group and 110 of 587 patients (18.7%) in the MRI group underwent nonculprit-lesion coronary-artery PCI. A primary-end-point event occurred in 50 patients (9.3%) in the iFR group and in 55 patients (9.8%) in the MRI group (hazard ratio, 0.95; 95% confidence interval, 0.65 to 1.40; P = 0.81). Serious adverse events occurred in 145 patients in the iFR group and in 181 in the MRI group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with STEMI who have undergone successful primary PCI, immediate iFR-guided PCI was not superior to deferred cardiac stress MRI-guided PCI of nonculprit coronary-artery lesions with respect to death from any cause, recurrent myocardial infarction, or hospitalization for heart failure at 3 years. (Funded by Philips Volcano and others; iMODERN ClinicalTrials.gov number, NCT03298659.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159879/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1056/NEJMoa2512918",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "In STEMI patients with successful primary PCI, immediate iFR-guided PCI of nonculprit lesions did not improve outcomes compared to deferred cardiac stress MRI-guided PCI at 3 years."
    },
    {
      "id": "efc10e58bc50",
      "title": "Sodium Bicarbonate for Severe Metabolic Acidemia and Acute Kidney Injury: The BICARICU-2 Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Intensivist/Critical Care",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118032",
      "abstract": "The effect of sodium bicarbonate infusion on outcome in patients with severe metabolic acidemia and moderate to severe acute kidney injury is unknown. To determine whether sodium bicarbonate infusion is associated with day 90 all-cause mortality in patients with severe metabolic acidemia and moderate to severe acute kidney injury. Randomized, open-label, clinical trial conducted with 640 patients in 43 French intensive care units from October 6, 2019, to December 19, 2023, with 90-day follow-up. The last date of follow-up was June 17, 2024. Adults with severe metabolic acidemia (defined as pH ≤7.20) and moderate to severe acute kidney injury were enrolled. Patients were randomized 1:1 to receive either intravenous sodium bicarbonate infusion or no sodium bicarbonate to target an arterial pH of 7.30 or higher. The primary outcome was day 90 all-cause mortality. Secondary outcomes included day 28 and day 180 all-cause mortality; use of organ support therapy, vasopressors, or invasive mechanical ventilation; intensive care unit and hospital length of stay; intensive care unit-acquired infections; fluid balance; day-7 Sequential [Sepsis-related] Organ Failure Assessment score (6 organ systems' function is evaluated and scored from 0 [no dysfunction] to 4 [failure]; total score ranges from 0 [normal] to 24 [maximum failure]); and major adverse kidney events on day 90. Among 640 randomly assigned patients, 627 were analyzed (313 in the control group and 314 in the bicarbonate group). The median age was 67 years (IQR, 59-74 years); 194 of 314 patients (62%) in the bicarbonate group and 185 of 313 controls (59%) were male. In the primary analysis, day 90 all-cause mortality was 195 of 314 patients (62.1%) in the bicarbonate group and 193 of 313 (61.7%) in the control group (absolute difference, 0.4; 95% CI, -7.2 to 8.0; P = .91). There was no evidence of a group effect on day 28 or day 180 all-cause mortality. Among 18 secondary outcomes, kidney replacement therapy was used in 109 of 314 (35%) bicarbonate group patients and 157 of 313 (50%) controls (absolute difference, -15.5; 95% CI, -23.1 to -7.8). No evidence of a group effect was found on other secondary outcomes, including adverse events. For patients with severe metabolic acidemia and moderate to severe acute kidney injury, intravenous sodium bicarbonate did not affect mortality. ClinicalTrials.gov Identifier: NCT04010630.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The effect of sodium bicarbonate infusion on outcome in patients with severe metabolic acidemia and moderate to severe acute kidney injury is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether sodium bicarbonate infusion is associated with day 90 all-cause mortality in patients with severe metabolic acidemia and moderate to severe acute kidney injury."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Randomized, open-label, clinical trial conducted with 640 patients in 43 French intensive care units from October 6, 2019, to December 19, 2023, with 90-day follow-up. The last date of follow-up was June 17, 2024. Adults with severe metabolic acidemia (defined as pH ≤7.20) and moderate to severe acute kidney injury were enrolled."
        },
        {
          "label": "INTERVENTION",
          "text": "Patients were randomized 1:1 to receive either intravenous sodium bicarbonate infusion or no sodium bicarbonate to target an arterial pH of 7.30 or higher."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was day 90 all-cause mortality. Secondary outcomes included day 28 and day 180 all-cause mortality; use of organ support therapy, vasopressors, or invasive mechanical ventilation; intensive care unit and hospital length of stay; intensive care unit-acquired infections; fluid balance; day-7 Sequential [Sepsis-related] Organ Failure Assessment score (6 organ systems' function is evaluated and scored from 0 [no dysfunction] to 4 [failure]; total score ranges from 0 [normal] to 24 [maximum failure]); and major adverse kidney events on day 90."
        },
        {
          "label": "RESULTS",
          "text": "Among 640 randomly assigned patients, 627 were analyzed (313 in the control group and 314 in the bicarbonate group). The median age was 67 years (IQR, 59-74 years); 194 of 314 patients (62%) in the bicarbonate group and 185 of 313 controls (59%) were male. In the primary analysis, day 90 all-cause mortality was 195 of 314 patients (62.1%) in the bicarbonate group and 193 of 313 (61.7%) in the control group (absolute difference, 0.4; 95% CI, -7.2 to 8.0; P = .91). There was no evidence of a group effect on day 28 or day 180 all-cause mortality. Among 18 secondary outcomes, kidney replacement therapy was used in 109 of 314 (35%) bicarbonate group patients and 157 of 313 (50%) controls (absolute difference, -15.5; 95% CI, -23.1 to -7.8). No evidence of a group effect was found on other secondary outcomes, including adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "For patients with severe metabolic acidemia and moderate to severe acute kidney injury, intravenous sodium bicarbonate did not affect mortality."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04010630."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159812/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1001/jama.2025.20231",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "Intravenous sodium bicarbonate did not improve survival in patients with severe metabolic acidemia and moderate to severe acute kidney injury."
    },
    {
      "id": "4d4eb51e03ee",
      "title": "EULAR recommendations for the management of systemic lupus erythematosus with kidney involvement: 2025 update.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Nephrology",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118018",
      "abstract": "The objective of this study was to update the 2019 European Alliance of Associations for Rheumatology (EULAR)/ European Renal Association/European Dialysis Transplantation Association (ERA-EDTA) recommendations for the management of systemic lupus erythematosus (SLE) with kidney involvement, taking into consideration emerging evidence and recent developments in the field. We recruited an international Task Force of experts and followed the EULAR standard operating procedures. We performed systematic literature research (period January 2019 to March 2024), followed by the modified Delphi method, to form questions, elicit expert opinions, and reach consensus. The new evidence was examined, taking into consideration previous updates. The Task Force agreed on 4 overarching principles and 13 recommendations, which were also evaluated for their feasibility and impact on clinical care. These concern the use of kidney biopsy for diagnosis; targets of therapy and treatment milestones; immunomodulatory therapy with antimalarials, glucocorticoids, immunosuppressives (mycophenolate, cyclophosphamide, and calcineurin inhibitors), and biologics (belimumab, obinutuzumab, and rituximab); nonimmune therapy (kidney protection, vaccinations, cardiovascular, and bone protection); family planning; and management of kidney failure. Guidance on single-agent or early combination immune therapy, glucocorticoid tapering and withdrawal, duration of immune therapy, and treatment of refractory disease is provided. The updated EULAR recommendations provide evidence- and expert-based consensus on the management of SLE with kidney involvement, adjusted for severity, and taking into consideration long-term efficacy, safety, cost, and local availability of drugs.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "The objective of this study was to update the 2019 European Alliance of Associations for Rheumatology (EULAR)/ European Renal Association/European Dialysis Transplantation Association (ERA-EDTA) recommendations for the management of systemic lupus erythematosus (SLE) with kidney involvement, taking into consideration emerging evidence and recent developments in the field."
        },
        {
          "label": "METHODS",
          "text": "We recruited an international Task Force of experts and followed the EULAR standard operating procedures. We performed systematic literature research (period January 2019 to March 2024), followed by the modified Delphi method, to form questions, elicit expert opinions, and reach consensus. The new evidence was examined, taking into consideration previous updates."
        },
        {
          "label": "RESULTS",
          "text": "The Task Force agreed on 4 overarching principles and 13 recommendations, which were also evaluated for their feasibility and impact on clinical care. These concern the use of kidney biopsy for diagnosis; targets of therapy and treatment milestones; immunomodulatory therapy with antimalarials, glucocorticoids, immunosuppressives (mycophenolate, cyclophosphamide, and calcineurin inhibitors), and biologics (belimumab, obinutuzumab, and rituximab); nonimmune therapy (kidney protection, vaccinations, cardiovascular, and bone protection); family planning; and management of kidney failure. Guidance on single-agent or early combination immune therapy, glucocorticoid tapering and withdrawal, duration of immune therapy, and treatment of refractory disease is provided."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The updated EULAR recommendations provide evidence- and expert-based consensus on the management of SLE with kidney involvement, adjusted for severity, and taking into consideration long-term efficacy, safety, cost, and local availability of drugs."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41107121/",
      "pubDate": "2025 Oct 16",
      "doi": "10.1016/j.ard.2025.09.007",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "The updated EULAR recommendations offer evidence-based guidance on managing lupus nephritis, tailored to disease severity and considering long-term outcomes, safety, cost, and drug availability."
    },
    {
      "id": "6797d3997953",
      "title": "Weight-reducing treatments are associated with an improvement in depression, functional health status, and quality of life: A meta-analysis of randomized controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/118017",
      "abstract": "To assess whether there is a beneficial or detrimental effect of weight reduction on mental health. Meta-analysis of randomized trials performed for weight loss, in which weight loss at endpoint was greater than 5% in the intervention arm and smaller than 5% in the control arm, obtained with any surgical, endoscopic, or EMA-approved pharmacological intervention. The endpoints were the incidence of overall and specific psychiatric adverse events. Weight loss was associated with a reduced risk of major depression (MH-OR 0.45 95% CI [0.21, 0.94], I = 0), and overall depression (MH-OR 0.72 [0.54, 0.97]); in subgroup analyses, a weight loss greater than 10% was associated with a lower incidence of depression than smaller weight loss (p = 0.04), whereas no difference was found between different interventions. No difference was detected in the incidence of anxiety (MH-OR 1.04 [0.78, 1.39]), of serious (M-H, OR CI 1.07 [0.78, 1.47]) and overall (MH-OR 1.09 [0.89, 1.34]) psychiatric adverse events, suicidal ideation (M-H, OR 0.87 [0.44, 1.70]), or suicide (M-H, OR 0.87 [0.44, 1.70]). An improvement in functional health status was detected, either as SF-36 Mental (SMD-IV 0.45 [0.37, 0.52]) or SF-36 Physical function (SMD-IV 0.29 [0.14, 0.44]) or IWQOL Lite Physical function (MD-IV 3.96 [1.60, 6.32]). Weight-reducing treatments were associated with a beneficial effect on quality of life and functional health status and a reduced risk of depression, without any safety signal for serious or non-serious psychiatric adverse events.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "To assess whether there is a beneficial or detrimental effect of weight reduction on mental health."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "Meta-analysis of randomized trials performed for weight loss, in which weight loss at endpoint was greater than 5% in the intervention arm and smaller than 5% in the control arm, obtained with any surgical, endoscopic, or EMA-approved pharmacological intervention. The endpoints were the incidence of overall and specific psychiatric adverse events."
        },
        {
          "label": "RESULTS",
          "text": "Weight loss was associated with a reduced risk of major depression (MH-OR 0.45 95% CI [0.21, 0.94], I = 0), and overall depression (MH-OR 0.72 [0.54, 0.97]); in subgroup analyses, a weight loss greater than 10% was associated with a lower incidence of depression than smaller weight loss (p = 0.04), whereas no difference was found between different interventions. No difference was detected in the incidence of anxiety (MH-OR 1.04 [0.78, 1.39]), of serious (M-H, OR CI 1.07 [0.78, 1.47]) and overall (MH-OR 1.09 [0.89, 1.34]) psychiatric adverse events, suicidal ideation (M-H, OR 0.87 [0.44, 1.70]), or suicide (M-H, OR 0.87 [0.44, 1.70]). An improvement in functional health status was detected, either as SF-36 Mental (SMD-IV 0.45 [0.37, 0.52]) or SF-36 Physical function (SMD-IV 0.29 [0.14, 0.44]) or IWQOL Lite Physical function (MD-IV 3.96 [1.60, 6.32])."
        },
        {
          "label": "CONCLUSION",
          "text": "Weight-reducing treatments were associated with a beneficial effect on quality of life and functional health status and a reduced risk of depression, without any safety signal for serious or non-serious psychiatric adverse events."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41131966/",
      "pubDate": "2025 Oct 23",
      "doi": "10.1111/dom.70202",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "Weight-reducing treatments improve quality of life, functional health, and reduce depression risk, with no observed increase in psychiatric adverse events."
    },
    {
      "id": "2c0b78dfcf9a",
      "title": "Recommendation on screening adults for depression using a screening tool.",
      "journal": "CMAJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117996",
      "abstract": "Depression negatively affects how a person feels, thinks, or behaves; is associated with impaired functioning in social and work settings; and can be associated with thoughts of suicide. This update of the 2013 Canadian Task Force on Preventive Health Care guideline provides an evidence-based recommendation about instrument-based screening for depression. For this update, we commissioned a systematic review on benefits and harms of instrument-based screening (i.e., using a screening tool) for depression among adults. The systematic review covered relevant literature from October 2018 to May 2020, updated to January 2025 for trials, and to March 2025 for trial registries. We examined patient values and preferences via patient engagement surveys and focus groups; we engaged content experts and other interest holders at key points throughout the project. We used the Grading of Recommendations, Assessment, Development and Evaluation approach to determine the certainty of evidence for each outcome and strength of the recommendation; adhered to the Guidelines International Network principles of managing competing interests; and followed Appraisal of Guidelines for Research and Evaluation, and Guidance for Reporting Involvement of Patients and the Public reporting guidance. We recommend against screening all adults aged 18 years and older for depression using questionnaires (strong recommendation, very low-certainty evidence), based on evidence suggesting that depression screening using a screening tool has little to no effect on health. This recommendation does not apply to adults with a personal history, current diagnosis, or clinical suspicion of a diagnosis of depression or another mental health disorder. It does apply to those who may be at an elevated risk of depression. The recommendation against screening adults for depression using a screening tool emphasizes the importance of good clinical care, where clinicians ask about their patients' well-being and remain vigilant for symptoms and signs of depression.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Depression negatively affects how a person feels, thinks, or behaves; is associated with impaired functioning in social and work settings; and can be associated with thoughts of suicide. This update of the 2013 Canadian Task Force on Preventive Health Care guideline provides an evidence-based recommendation about instrument-based screening for depression."
        },
        {
          "label": "METHODS",
          "text": "For this update, we commissioned a systematic review on benefits and harms of instrument-based screening (i.e., using a screening tool) for depression among adults. The systematic review covered relevant literature from October 2018 to May 2020, updated to January 2025 for trials, and to March 2025 for trial registries. We examined patient values and preferences via patient engagement surveys and focus groups; we engaged content experts and other interest holders at key points throughout the project. We used the Grading of Recommendations, Assessment, Development and Evaluation approach to determine the certainty of evidence for each outcome and strength of the recommendation; adhered to the Guidelines International Network principles of managing competing interests; and followed Appraisal of Guidelines for Research and Evaluation, and Guidance for Reporting Involvement of Patients and the Public reporting guidance."
        },
        {
          "label": "RECOMMENDATIONS",
          "text": "We recommend against screening all adults aged 18 years and older for depression using questionnaires (strong recommendation, very low-certainty evidence), based on evidence suggesting that depression screening using a screening tool has little to no effect on health. This recommendation does not apply to adults with a personal history, current diagnosis, or clinical suspicion of a diagnosis of depression or another mental health disorder. It does apply to those who may be at an elevated risk of depression."
        },
        {
          "label": "INTERPRETATION",
          "text": "The recommendation against screening adults for depression using a screening tool emphasizes the importance of good clinical care, where clinicians ask about their patients' well-being and remain vigilant for symptoms and signs of depression."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41115725/",
      "pubDate": "2025 Oct 19",
      "doi": "10.1503/cmaj.250237",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "Routine screening of all adults aged 18 and older for depression using questionnaires is not recommended due to limited evidence of benefit."
    },
    {
      "id": "c302cc2ab9ca",
      "title": "Development of a Novel Frailty Trigger for Use at Triage in the Emergency Department.",
      "journal": "Acad Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117990",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41178120/",
      "pubDate": "2025 Nov 02",
      "doi": "10.1111/acem.70188",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false
    },
    {
      "id": "23fb1fe15f21",
      "title": "Semaglutide and cardiovascular outcomes by baseline and changes in adiposity measurements: a prespecified analysis of the SELECT trial.",
      "journal": "Lancet",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117986",
      "abstract": "The SELECT trial found semaglutide reduced major adverse cardiovascular events (MACE) in patients with overweight or obesity with cardiovascular disease but without diabetes. We report a prespecified analysis of the SELECT trial on the relationships between baseline adiposity measures, treatment-induced adiposity changes, and subsequent MACE risk. Patients aged at least 45 years, with a BMI of at least 27 kg/m were enrolled in 41 countries (804 sites) and randomised 1:1 to once-weekly semaglutide 2·4 mg or placebo. The primary outcome was time to first MACE (composite of cardiovascular death, non-fatal myocardial infarction, or non-fatal stroke). Adiposity measures included weight and waist circumference. In this analysis, risk of MACE occurring after 20 weeks was assessed between patients by adiposity changes in the first 20 weeks and, in a separate analysis, all in-trial MACE were assessed between patients by adiposity changes over 104 weeks. This trial is registered with ClinicalTrials.gov, NCT03574597. Semaglutide significantly reduced MACE incidence compared with placebo among 17 604 patients enrolled in SELECT, with consistent benefits across all baseline weight and waist circumference categories. In the semaglutide group, analyses for linear trends showed lower baseline bodyweight and waist circumference were associated with lower incidence of MACE-an average 4% reduction in risk per 5 kg lower bodyweight (hazard ratio [HR] 0·96 [95% CI 0·94-0·99]; p=0·001) and per 5 cm smaller waist circumference (0·96 [0·93-0·99]; p=0·004). In the placebo group, lower baseline waist circumference (0·96 [0·94-0·99]; p=0·007), but not bodyweight (0·99 [0·97-1·01]; p=0·28), was associated with a lower MACE risk and weight loss was paradoxically associated with increased MACE risk. In those receiving semaglutide there was no linear trend linking weight loss at week 20 to subsequent MACE risk, but greater waist circumference reduction at week 20 was associated with lower subsequent MACE risk, and waist circumference reduction by week 104 was associated with lower in-trial risk of MACE. An estimated 33% of the observed benefit on MACE was mediated through waist circumference reduction (HR 0·86 [95% CI 0·77-0·97] after adjustment for time-varying changes in waist circumference). The cardioprotective effects of semaglutide were independent of baseline adiposity and weight loss and had only a small association with waist circumference, suggesting some mechanisms for benefit beyond adiposity reduction. Novo Nordisk.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The SELECT trial found semaglutide reduced major adverse cardiovascular events (MACE) in patients with overweight or obesity with cardiovascular disease but without diabetes. We report a prespecified analysis of the SELECT trial on the relationships between baseline adiposity measures, treatment-induced adiposity changes, and subsequent MACE risk."
        },
        {
          "label": "METHODS",
          "text": "Patients aged at least 45 years, with a BMI of at least 27 kg/m were enrolled in 41 countries (804 sites) and randomised 1:1 to once-weekly semaglutide 2·4 mg or placebo. The primary outcome was time to first MACE (composite of cardiovascular death, non-fatal myocardial infarction, or non-fatal stroke). Adiposity measures included weight and waist circumference. In this analysis, risk of MACE occurring after 20 weeks was assessed between patients by adiposity changes in the first 20 weeks and, in a separate analysis, all in-trial MACE were assessed between patients by adiposity changes over 104 weeks. This trial is registered with ClinicalTrials.gov, NCT03574597."
        },
        {
          "label": "FINDINGS",
          "text": "Semaglutide significantly reduced MACE incidence compared with placebo among 17 604 patients enrolled in SELECT, with consistent benefits across all baseline weight and waist circumference categories. In the semaglutide group, analyses for linear trends showed lower baseline bodyweight and waist circumference were associated with lower incidence of MACE-an average 4% reduction in risk per 5 kg lower bodyweight (hazard ratio [HR] 0·96 [95% CI 0·94-0·99]; p=0·001) and per 5 cm smaller waist circumference (0·96 [0·93-0·99]; p=0·004). In the placebo group, lower baseline waist circumference (0·96 [0·94-0·99]; p=0·007), but not bodyweight (0·99 [0·97-1·01]; p=0·28), was associated with a lower MACE risk and weight loss was paradoxically associated with increased MACE risk. In those receiving semaglutide there was no linear trend linking weight loss at week 20 to subsequent MACE risk, but greater waist circumference reduction at week 20 was associated with lower subsequent MACE risk, and waist circumference reduction by week 104 was associated with lower in-trial risk of MACE. An estimated 33% of the observed benefit on MACE was mediated through waist circumference reduction (HR 0·86 [95% CI 0·77-0·97] after adjustment for time-varying changes in waist circumference)."
        },
        {
          "label": "INTERPRETATION",
          "text": "The cardioprotective effects of semaglutide were independent of baseline adiposity and weight loss and had only a small association with waist circumference, suggesting some mechanisms for benefit beyond adiposity reduction."
        },
        {
          "label": "FUNDING",
          "text": "Novo Nordisk."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41138739/",
      "pubDate": "2025 Nov 08",
      "doi": "10.1016/S0140-6736(25)01375-3",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "In patients with overweight or obesity and cardiovascular disease, semaglutide's cardiovascular benefits were associated with lower baseline body weight and waist circumference, and greater waist circumference reduction."
    },
    {
      "id": "c0b4d59a6330",
      "title": "Closed-Loop Insulin Delivery in Type 1 Diabetes in Pregnancy: The CIRCUIT Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48800952/117983",
      "abstract": "Hyperglycemia-related pregnancy complications occur in 50% of pregnant women with type 1 diabetes. Closed-loop insulin systems improve glycemia outside of pregnancy but have had limited testing in pregnancy. To assess the efficacy of a closed-loop system in pregnancy. Open-label trial enrolling pregnant women with type 1 diabetes at 14 clinical centers in Canada and Australia before 14 weeks' gestation with follow-up until 6 weeks postpartum. Enrollment occurred between June 2021 and July 2024 and follow-up was completed in March 2025. Participants were randomized 1:1 to closed-loop therapy (n = 46) or standard care (insulin pump or multiple daily insulin injections) (n = 45) with continuous glucose monitoring. The primary outcome was the percentage of time spent in the pregnancy-specific glucose range (63-140 mg/dL), measured by continuous glucose monitoring from 16 to 34 weeks' gestation. Among 94 enrolled participants, 3 experienced pregnancy loss prior to randomization, 91 were randomized (mean age, 31.7 [SD, 5.2] years; early pregnancy hemoglobin A1c, 7.4% [SD, 1.0%]), and 88 were included in the primary analysis. The mean percentage of time spent in the pregnancy-specific glucose range from 16 to 34 weeks' gestation was 65.4% in the closed-loop group and 50.3% in the standard care group (mean adjusted difference, 12.5 [95% CI, 9.5-15.6] percentage points; P < .001). There was 1 episode of severe hypoglycemia in the closed-loop group, and there were 2 episodes of diabetic ketoacidosis in the closed-loop group and 1 in the standard care group. Pregnant women with type 1 diabetes using a closed-loop system spent significantly more time in the pregnancy-specific glucose range than those receiving standard care. These findings support the use of this closed-loop system in pregnant women with type 1 diabetes. ClinicalTrials.gov Identifier: NCT04902378.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Hyperglycemia-related pregnancy complications occur in 50% of pregnant women with type 1 diabetes. Closed-loop insulin systems improve glycemia outside of pregnancy but have had limited testing in pregnancy."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy of a closed-loop system in pregnancy."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Open-label trial enrolling pregnant women with type 1 diabetes at 14 clinical centers in Canada and Australia before 14 weeks' gestation with follow-up until 6 weeks postpartum. Enrollment occurred between June 2021 and July 2024 and follow-up was completed in March 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1 to closed-loop therapy (n = 46) or standard care (insulin pump or multiple daily insulin injections) (n = 45) with continuous glucose monitoring."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the percentage of time spent in the pregnancy-specific glucose range (63-140 mg/dL), measured by continuous glucose monitoring from 16 to 34 weeks' gestation."
        },
        {
          "label": "RESULTS",
          "text": "Among 94 enrolled participants, 3 experienced pregnancy loss prior to randomization, 91 were randomized (mean age, 31.7 [SD, 5.2] years; early pregnancy hemoglobin A1c, 7.4% [SD, 1.0%]), and 88 were included in the primary analysis. The mean percentage of time spent in the pregnancy-specific glucose range from 16 to 34 weeks' gestation was 65.4% in the closed-loop group and 50.3% in the standard care group (mean adjusted difference, 12.5 [95% CI, 9.5-15.6] percentage points; P < .001). There was 1 episode of severe hypoglycemia in the closed-loop group, and there were 2 episodes of diabetic ketoacidosis in the closed-loop group and 1 in the standard care group."
        },
        {
          "label": "CONCLUSION AND RELEVANCE",
          "text": "Pregnant women with type 1 diabetes using a closed-loop system spent significantly more time in the pregnancy-specific glucose range than those receiving standard care. These findings support the use of this closed-loop system in pregnant women with type 1 diabetes."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04902378."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41134589/",
      "pubDate": "2025 Oct 24",
      "doi": "10.1001/jama.2025.19578",
      "dateReceived": "2025-11-12T23:25:54.207Z",
      "isNew": false,
      "summary": "Pregnant women with type 1 diabetes using a closed-loop system achieved better glycemic control during pregnancy compared to those receiving standard care."
    },
    {
      "id": "af51107ceb2c",
      "title": "Double-blind randomized controlled trial of Er: YAG vaginal laser to treat female stress urinary incontinence.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48892119/118083",
      "dateReceived": "2025-11-12T23:25:54.206Z",
      "isNew": false
    },
    {
      "id": "60087dc11c40",
      "title": "PCI of Native Coronary Artery vs Saphenous Vein Graft After Prior Bypass Surgery: A Multicenter, Randomized Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48892119/118040",
      "abstract": "In patients with prior coronary artery bypass grafting (CABG) presenting with graft failure, current guidelines recommend percutaneous coronary intervention (PCI) of the bypassed native coronary artery over PCI of the bypass graft. However, this recommendation relies solely on observational data. This study compared clinical outcomes between a strategy of native vessel PCI with saphenous vein graft (SVG) PCI in post-CABG patients presenting with SVG failure. The multicenter, randomized PROCTOR (Percutaneous Coronary Intervention of Native Coronary Artery versus Saphenous Vein Graft in Patients with Prior Coronary Artery Bypass Graft Surgery) trial included patients with significant SVG stenosis and a heart team-defined clinical indication for revascularization. Patients were randomly assigned (1:1) to either a strategy of native vessel PCI or SVG PCI using an interactive web-based randomization platform. The trial was conducted across 14 centers in Europe. We report the occurrence of major adverse cardiac events at 1 year following the index PCI, defined as the composite of all-cause mortality, nonfatal target coronary territory myocardial infarction (MI), or clinically driven target coronary territory revascularization, analyzed on an intention-to-treat basis. The trial is registered with ClinicalTrials.gov (NCT03805048), and long-term follow-up is ongoing. Between January 2019 and December 2023, 220 patients (mean age 73 ± 7 years; 84% men [185/220 patients]) were randomized to a strategy of native vessel PCI (n = 108) or SVG PCI (n = 112). At 1 year, major adverse cardiac events occurred in 37 patients (34%) in the native vessel PCI group and 21 patients (19%) in the SVG PCI group (HR: 2.14; 95% CI: 1.25-3.65; P = 0.006). There was no significant difference in all-cause mortality (HR: 1.59; 95% CI: 0.45-5.64; P = 0.472), whereas both nonfatal target coronary territory MI (HR: 2.12; 95% CI: 1.08-4.17; P = 0.029) and clinically driven target coronary territory revascularization (HR: 2.19; 95% CI: 1.02-4.72; P = 0.044) occurred more frequently in patients assigned to native vessel PCI. The incidence of PCI-related MI was 13% in the native vessel PCI group and 1% in the SVG PCI group (HR: 14.85; 95% CI: 1.95-112.96; P = 0.009). In the randomized PROCTOR trial, SVG PCI was associated with improved 1-year clinical outcomes compared with native vessel PCI, primarily driven by lower rates of PCI-related MI and clinically driven target coronary territory revascularization.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In patients with prior coronary artery bypass grafting (CABG) presenting with graft failure, current guidelines recommend percutaneous coronary intervention (PCI) of the bypassed native coronary artery over PCI of the bypass graft. However, this recommendation relies solely on observational data."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study compared clinical outcomes between a strategy of native vessel PCI with saphenous vein graft (SVG) PCI in post-CABG patients presenting with SVG failure."
        },
        {
          "label": "METHODS",
          "text": "The multicenter, randomized PROCTOR (Percutaneous Coronary Intervention of Native Coronary Artery versus Saphenous Vein Graft in Patients with Prior Coronary Artery Bypass Graft Surgery) trial included patients with significant SVG stenosis and a heart team-defined clinical indication for revascularization. Patients were randomly assigned (1:1) to either a strategy of native vessel PCI or SVG PCI using an interactive web-based randomization platform. The trial was conducted across 14 centers in Europe. We report the occurrence of major adverse cardiac events at 1 year following the index PCI, defined as the composite of all-cause mortality, nonfatal target coronary territory myocardial infarction (MI), or clinically driven target coronary territory revascularization, analyzed on an intention-to-treat basis. The trial is registered with ClinicalTrials.gov (NCT03805048), and long-term follow-up is ongoing."
        },
        {
          "label": "RESULTS",
          "text": "Between January 2019 and December 2023, 220 patients (mean age 73 ± 7 years; 84% men [185/220 patients]) were randomized to a strategy of native vessel PCI (n = 108) or SVG PCI (n = 112). At 1 year, major adverse cardiac events occurred in 37 patients (34%) in the native vessel PCI group and 21 patients (19%) in the SVG PCI group (HR: 2.14; 95% CI: 1.25-3.65; P = 0.006). There was no significant difference in all-cause mortality (HR: 1.59; 95% CI: 0.45-5.64; P = 0.472), whereas both nonfatal target coronary territory MI (HR: 2.12; 95% CI: 1.08-4.17; P = 0.029) and clinically driven target coronary territory revascularization (HR: 2.19; 95% CI: 1.02-4.72; P = 0.044) occurred more frequently in patients assigned to native vessel PCI. The incidence of PCI-related MI was 13% in the native vessel PCI group and 1% in the SVG PCI group (HR: 14.85; 95% CI: 1.95-112.96; P = 0.009)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In the randomized PROCTOR trial, SVG PCI was associated with improved 1-year clinical outcomes compared with native vessel PCI, primarily driven by lower rates of PCI-related MI and clinically driven target coronary territory revascularization."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41159978/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1016/j.jacc.2025.09.1577",
      "dateReceived": "2025-11-12T23:25:54.206Z",
      "isNew": false,
      "summary": "SVG PCI led to better clinical outcomes at one year compared to native vessel PCI, mainly due to fewer heart attacks related to the procedure and fewer repeat procedures in the same area."
    },
    {
      "id": "5da8d1a0a808",
      "title": "Molnupiravir for treating COVID-19.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118077",
      "abstract": "Five years from the start of the COVID-19 pandemic, morbidity and mortality have subsided. Vaccines have contributed to reducing the risk of infection and severe disease. However, new COVID-19 variants continue to emerge, and the role of oral antivirals such as molnupiravir in preventing progression of disease or hospitalisation must be assessed. To assess the effects of molnupiravir in people with confirmed severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection and mild to moderate symptoms. We identified all relevant randomised controlled trials (RCTs) by searching the Cochrane COVID-19 Study Register, Science Citation Index Expanded, the World Health Organization (WHO) Global Literature on Coronavirus Disease database, and the COVID Network Meta-Analysis database with no language restrictions up to 26 April 2024. We considered full-text articles, preprints, abstracts, trial registry records, and reports of ongoing trials. Cluster-RCTs were eligible for inclusion, but cross-over trials were ineligible. Participants had confirmed SARS-CoV-2 infection with or without risk factors for severe disease. The intervention was molnupiravir 800 mg taken orally every 12 hours for five days, and control was no treatment, placebo, or standard of care, as defined by the study authors. We excluded studies comparing molnupiravir with treatment strategies that included molnupiravir. Our critical outcomes were all-cause mortality and hospitalisation. Our important outcomes were change in clinical status, viral clearance, quality of life, adverse events, and serious adverse events. Two review authors independently assessed the risk of bias in each included study using the Cochrane risk of bias tool (RoB 2). Disagreements were resolved through discussion. We conducted a meta-analysis where two or more studies with reasonably similar clinical and methodological characteristics reported the same outcome. We used data from intention-to-treat analysis where available. We analysed all outcomes at the participant level using the generic inverse variance method, applying a random-effects model. We used the GRADE approach to assess the certainty of evidence. This review included 11 studies (31,272 participants). Eight studies recruited outpatients and three recruited inpatients. We did not meta-analyse inpatient studies, as characteristics varied widely. All outpatient studies included participants with mild to moderate COVID-19, with a mean age ranging from 35 years to 57 years and variable prevalences of comorbidities and COVID-19 vaccination. We excluded suboptimal molnupiravir dosing arms in four outpatient studies and one inpatient study. Outpatients Molnupiravir compared to placebo or usual care probably results in little to no difference in all-cause mortality at 28 to 30 days (risk ratio (RR) 0.17, 95% confidence interval (CI) 0.04 to 0.65; 7 RCTs, 29,238 participants; moderate-certainty evidence). The absolute reduction in mortality is nine fewer deaths per 10,000 people treated (95% CI 10 fewer to four fewer per 10,000), which we consider clinically insignificant. Molnupiravir may result in little to no difference in hospitalisation (RR 0.70, 95% CI 0.43 to 1.12; 6 RCTs, 29,228 participants; low-certainty evidence), symptom resolution by day 14 (RR 1.20, 95% CI 0.84 to 1.71; 3 RCTs, 22,400 participants; low-certainty evidence), and symptom resolution by day 28 (RR 1.06, 95% CI 0.89 to 1.26; 3 RCTs, 24,728 participants; low-certainty evidence). Four studies reported viral clearance by day 5, which was higher in people receiving molnupiravir compared with those receiving placebo or usual care (RR 3.40, 95% CI 2.15 to 5.36; 3067 participants). The effect size decreased by day 10 (RR 1.58, 95% CI 1.07 to 2.34; 2 RCTs, 2438 participants) and indicated little to no difference between molnupiravir and control by day 14 to 15 (RR 1.05, 95% CI 0.98 to 1.13; 4 RCTs, 3062 participants). The results at day 28 to 30 again showed higher virus clearance in the molnupiravir arm (RR 1.11, 95% CI 1.03 to 1.19; 3 RCTs, 397 participants), although there were few participants in this analysis. Molnupiravir probably results in little to no difference in adverse events (RR 1.00, 95% CI 0.87 to 1.15; 7 RCTs, 4304 participants; moderate-certainty evidence). Molnupiravir results in little to no difference in serious adverse events (RR 0.86, 95% CI 0.62 to 1.21; 8 RCTs, 30,009 participants; high-certainty evidence). Inpatients The effect of molnupiravir in inpatients is unclear; substantial heterogeneity precluded meta-analysis. Risk of bias and certainty of the evidence We assigned high risk of bias judgements to one of seven RCTs for all-cause mortality, one of six RCTs for hospitalisation, two of three RCTs for symptom resolution at 14 days and 28 days, three of seven RCTs for adverse events, and three of eight RCTs for serious adverse events. We downgraded the certainty of the evidence for serious indirectness as well as risk of bias, as the populations across trials differed by vaccination status. There was no serious imprecision identified for any outcome. Publication bias is likely high in this review, as we identified 16 unpublished trials. Six were listed as complete, but only one had available data. In outpatients with mild to moderate COVID-19, molnupiravir 800 mg taken orally every 12 hours for five days probably results in little to no difference in all-cause mortality and may result in little to no difference in rates of hospitalisation and symptom resolution. There is evidence of increased viral clearance by day 5, but the clinical relevance of this finding is unclear. There is probably little to no difference in adverse events, and there is little to no difference in serious adverse events, with molnupiravir versus placebo or standard care. Inpatient data are lacking, and there is no evidence of benefit of molnupiravir in this population. Further research involving inpatients may change this. The editorial base of the Cochrane Infectious Diseases Group is funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104). The views expressed herein do not necessarily reflect the UK Government's official policies. Protocol available at https://doi.org/10.1002/14651858.CD015381.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Five years from the start of the COVID-19 pandemic, morbidity and mortality have subsided. Vaccines have contributed to reducing the risk of infection and severe disease. However, new COVID-19 variants continue to emerge, and the role of oral antivirals such as molnupiravir in preventing progression of disease or hospitalisation must be assessed."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of molnupiravir in people with confirmed severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection and mild to moderate symptoms."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We identified all relevant randomised controlled trials (RCTs) by searching the Cochrane COVID-19 Study Register, Science Citation Index Expanded, the World Health Organization (WHO) Global Literature on Coronavirus Disease database, and the COVID Network Meta-Analysis database with no language restrictions up to 26 April 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We considered full-text articles, preprints, abstracts, trial registry records, and reports of ongoing trials. Cluster-RCTs were eligible for inclusion, but cross-over trials were ineligible. Participants had confirmed SARS-CoV-2 infection with or without risk factors for severe disease. The intervention was molnupiravir 800 mg taken orally every 12 hours for five days, and control was no treatment, placebo, or standard of care, as defined by the study authors. We excluded studies comparing molnupiravir with treatment strategies that included molnupiravir."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality and hospitalisation. Our important outcomes were change in clinical status, viral clearance, quality of life, adverse events, and serious adverse events."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two review authors independently assessed the risk of bias in each included study using the Cochrane risk of bias tool (RoB 2). Disagreements were resolved through discussion."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We conducted a meta-analysis where two or more studies with reasonably similar clinical and methodological characteristics reported the same outcome. We used data from intention-to-treat analysis where available. We analysed all outcomes at the participant level using the generic inverse variance method, applying a random-effects model. We used the GRADE approach to assess the certainty of evidence."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "This review included 11 studies (31,272 participants). Eight studies recruited outpatients and three recruited inpatients. We did not meta-analyse inpatient studies, as characteristics varied widely. All outpatient studies included participants with mild to moderate COVID-19, with a mean age ranging from 35 years to 57 years and variable prevalences of comorbidities and COVID-19 vaccination. We excluded suboptimal molnupiravir dosing arms in four outpatient studies and one inpatient study."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Outpatients Molnupiravir compared to placebo or usual care probably results in little to no difference in all-cause mortality at 28 to 30 days (risk ratio (RR) 0.17, 95% confidence interval (CI) 0.04 to 0.65; 7 RCTs, 29,238 participants; moderate-certainty evidence). The absolute reduction in mortality is nine fewer deaths per 10,000 people treated (95% CI 10 fewer to four fewer per 10,000), which we consider clinically insignificant. Molnupiravir may result in little to no difference in hospitalisation (RR 0.70, 95% CI 0.43 to 1.12; 6 RCTs, 29,228 participants; low-certainty evidence), symptom resolution by day 14 (RR 1.20, 95% CI 0.84 to 1.71; 3 RCTs, 22,400 participants; low-certainty evidence), and symptom resolution by day 28 (RR 1.06, 95% CI 0.89 to 1.26; 3 RCTs, 24,728 participants; low-certainty evidence). Four studies reported viral clearance by day 5, which was higher in people receiving molnupiravir compared with those receiving placebo or usual care (RR 3.40, 95% CI 2.15 to 5.36; 3067 participants). The effect size decreased by day 10 (RR 1.58, 95% CI 1.07 to 2.34; 2 RCTs, 2438 participants) and indicated little to no difference between molnupiravir and control by day 14 to 15 (RR 1.05, 95% CI 0.98 to 1.13; 4 RCTs, 3062 participants). The results at day 28 to 30 again showed higher virus clearance in the molnupiravir arm (RR 1.11, 95% CI 1.03 to 1.19; 3 RCTs, 397 participants), although there were few participants in this analysis. Molnupiravir probably results in little to no difference in adverse events (RR 1.00, 95% CI 0.87 to 1.15; 7 RCTs, 4304 participants; moderate-certainty evidence). Molnupiravir results in little to no difference in serious adverse events (RR 0.86, 95% CI 0.62 to 1.21; 8 RCTs, 30,009 participants; high-certainty evidence). Inpatients The effect of molnupiravir in inpatients is unclear; substantial heterogeneity precluded meta-analysis. Risk of bias and certainty of the evidence We assigned high risk of bias judgements to one of seven RCTs for all-cause mortality, one of six RCTs for hospitalisation, two of three RCTs for symptom resolution at 14 days and 28 days, three of seven RCTs for adverse events, and three of eight RCTs for serious adverse events. We downgraded the certainty of the evidence for serious indirectness as well as risk of bias, as the populations across trials differed by vaccination status. There was no serious imprecision identified for any outcome. Publication bias is likely high in this review, as we identified 16 unpublished trials. Six were listed as complete, but only one had available data."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In outpatients with mild to moderate COVID-19, molnupiravir 800 mg taken orally every 12 hours for five days probably results in little to no difference in all-cause mortality and may result in little to no difference in rates of hospitalisation and symptom resolution. There is evidence of increased viral clearance by day 5, but the clinical relevance of this finding is unclear. There is probably little to no difference in adverse events, and there is little to no difference in serious adverse events, with molnupiravir versus placebo or standard care. Inpatient data are lacking, and there is no evidence of benefit of molnupiravir in this population. Further research involving inpatients may change this."
        },
        {
          "label": "FUNDING",
          "text": "The editorial base of the Cochrane Infectious Diseases Group is funded by UK aid from the UK Government for the benefit of low- and middle-income countries (project number 300342-104). The views expressed herein do not necessarily reflect the UK Government's official policies."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol available at https://doi.org/10.1002/14651858.CD015381."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41147546/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1002/14651858.CD015381.pub2",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Molnupiravir shows little to no impact on mortality, hospitalization, or symptom resolution in outpatients with mild to moderate COVID-19, with unclear clinical significance of increased viral clearance and no significant difference in adverse events."
    },
    {
      "id": "7d2def0e9edf",
      "title": "Oral nicotine pouches for cessation or reduction of use of other tobacco or nicotine products.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118067",
      "abstract": "Electronic cigarettes (EC) are handheld electronic vaping devices that produce an aerosol by heating a liquid. People who smoke, healthcare providers, and regulators want to know if EC can help people quit smoking, and if they are safe to use for this purpose. This review update was conducted as part of a living systematic review. To examine the safety, tolerability, and effectiveness of EC for helping people who smoke tobacco achieve long-term smoking abstinence, in comparison to non-nicotine EC, other smoking cessation treatments, and no treatment. We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and PsycINFO to 1 March 2025, reference-checked, and contacted study authors. We included trials randomising people who smoked to an EC or control condition. We also included uncontrolled intervention studies where all participants received an EC intervention. Studies had to measure an eligible outcome. Critical outcomes were abstinence from smoking after at least six months, adverse events (AEs), and serious adverse events (SAEs). Important outcomes were biomarkers, toxicants/carcinogens, and longer-term EC use. We used the RoB 1 tool to assess risk of bias for each study and GRADE to assess evidence certainty. We followed standard Cochrane methods for screening and data extraction. Where appropriate, we pooled data using random-effects models to calculate risk ratios (RRs) with 95% confidence intervals (CIs) for dichotomous outcomes. For continuous outcomes, we calculated mean differences with 95% CIs. We included 104 completed studies (14 new to this update), representing 30,366 participants, of which 61 were randomised controlled trials (RCTs). We rated 11 included studies as being at low risk of bias, 70 at high risk (including all non-randomised studies), and the remainder at unclear risk overall. Nicotine EC result in increased quit rates compared to nicotine replacement therapy (NRT) (high-certainty evidence) (RR 1.55, 95% CI 1.28 to 1.88; I² = 0%; 9 studies, 2703 participants). In absolute terms, this might translate to an additional three quitters per 100 (95% CI 2 to 5 more). The rate of occurrence of AEs is probably similar between groups (moderate-certainty evidence (limited by imprecision)) (RR 1.00, 95% CI 0.73 to 1.37; I² = 58%; 7 studies, 2241 participants). SAEs were rare, and there is insufficient evidence to determine whether rates differ between groups due to very serious imprecision (RR 1.22, 95% CI 0.73 to 2.03; I² = 30%; 8 studies, 2950 participants; low-certainty evidence). Nicotine EC probably result in increased quit rates compared to non-nicotine EC (moderate-certainty evidence, limited by imprecision) (RR 1.34, 95% CI 1.06 to 1.70; I² = 0%; 7 studies, 1918 participants). In absolute terms, this might lead to an additional two quitters per 100 (95% CI 0 to 4 more). There is probably little to no difference in the rate of AEs between these groups (moderate-certainty evidence) (RR 1.01, 95% CI 0.95 to 1.08; I² = 0%; 5 studies, 840 participants). There is insufficient evidence to determine whether rates of SAEs differ between groups, due to very serious imprecision (RR 0.98, 95% CI 0.55 to 1.73; I² = 0%; 10 studies, 1717 participants; low-certainty evidence). Compared to behavioural support only or no support, quit rates may be higher for participants randomised to nicotine EC (low-certainty evidence due to risk of bias) (RR 1.78, 95% CI 1.42 to 2.25; I² = 13%; 11 studies, 6819 participants). In absolute terms, this represents an additional three quitters per 100 (95% CI 2 to 5 more). There was some evidence that (non-serious) AEs may be more common in people randomised to nicotine EC (RR 1.22, 95% CI 0.96 to 1.55; I² = 66%; 8 studies, 2485 participants; very low-certainty evidence) but the evidence is uncertain and, again, there was insufficient evidence to determine whether rates of SAEs differed between groups (RR 0.93, 95% CI 0.67 to 1.29; I² = 0%; 15 studies, 4716 participants; very low-certainty evidence). Data from non-randomised studies were consistent with RCT data. The most commonly reported AEs were throat/mouth irritation, headache, cough, and nausea, which tended to dissipate with continued EC use. Very few studies reported data on other outcomes or comparisons; hence, evidence for these is limited, with CIs often encompassing both clinically significant harm and benefit. There is high-certainty evidence that nicotine EC increase quit rates compared to NRT, and moderate-certainty evidence that they probably increase quit rates compared to EC without nicotine. Evidence comparing nicotine EC with behavioural support or no support also suggests benefit, but is less certain due to risk of bias inherent in the study designs. CIs were, for the most part, wide for data on AEs, SAEs, and other safety markers, with no evidence of a difference in AEs between nicotine and non-nicotine EC nor between nicotine EC and NRT, but low-certainty evidence for increased AEs compared with behavioural support/no support. Overall incidence of SAEs was low across all study arms. We did not detect evidence of serious harm from nicotine EC, but longer, larger trials are needed to fully evaluate safety. Included studies tested regulated nicotine-containing EC; illicit products and/or products containing other active substances (e.g. tetrahydrocannabinol (THC)) may have different harm profiles. The main limitation of the evidence base remains imprecision for some comparisons and for safety outcomes due to the relatively small number of RCTs contributing, often with low event rates. Further RCTs are underway. To ensure the review continues to provide up-to-date information to decision-makers, this is a living systematic review. We run and screen searches monthly, with the review updated when relevant new evidence becomes available. Please refer to the Cochrane Database of Systematic Reviews for the review's current status. Cancer Research UK (PICCTR-2024/100012). Original 2012 protocol available via DOI: 10.1002/14651858.CD010216. Updated 2023 protocol available via DOI 10.17605/OSF.IO/ZWGSK (https://osf.io/ZWGSK/). 2025 updates to protocol available via DOI: 10.17605/OSF.IO/59M4U (https://osf.io/59M4U/) and DOI: 10.17605/OSF.IO/UPGJC (https://osf.io/UPGJC/).",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Electronic cigarettes (EC) are handheld electronic vaping devices that produce an aerosol by heating a liquid. People who smoke, healthcare providers, and regulators want to know if EC can help people quit smoking, and if they are safe to use for this purpose. This review update was conducted as part of a living systematic review."
        },
        {
          "label": "OBJECTIVES",
          "text": "To examine the safety, tolerability, and effectiveness of EC for helping people who smoke tobacco achieve long-term smoking abstinence, in comparison to non-nicotine EC, other smoking cessation treatments, and no treatment."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, Embase, and PsycINFO to 1 March 2025, reference-checked, and contacted study authors."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included trials randomising people who smoked to an EC or control condition. We also included uncontrolled intervention studies where all participants received an EC intervention. Studies had to measure an eligible outcome."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes were abstinence from smoking after at least six months, adverse events (AEs), and serious adverse events (SAEs). Important outcomes were biomarkers, toxicants/carcinogens, and longer-term EC use."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used the RoB 1 tool to assess risk of bias for each study and GRADE to assess evidence certainty."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We followed standard Cochrane methods for screening and data extraction. Where appropriate, we pooled data using random-effects models to calculate risk ratios (RRs) with 95% confidence intervals (CIs) for dichotomous outcomes. For continuous outcomes, we calculated mean differences with 95% CIs."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 104 completed studies (14 new to this update), representing 30,366 participants, of which 61 were randomised controlled trials (RCTs). We rated 11 included studies as being at low risk of bias, 70 at high risk (including all non-randomised studies), and the remainder at unclear risk overall."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Nicotine EC result in increased quit rates compared to nicotine replacement therapy (NRT) (high-certainty evidence) (RR 1.55, 95% CI 1.28 to 1.88; I² = 0%; 9 studies, 2703 participants). In absolute terms, this might translate to an additional three quitters per 100 (95% CI 2 to 5 more). The rate of occurrence of AEs is probably similar between groups (moderate-certainty evidence (limited by imprecision)) (RR 1.00, 95% CI 0.73 to 1.37; I² = 58%; 7 studies, 2241 participants). SAEs were rare, and there is insufficient evidence to determine whether rates differ between groups due to very serious imprecision (RR 1.22, 95% CI 0.73 to 2.03; I² = 30%; 8 studies, 2950 participants; low-certainty evidence). Nicotine EC probably result in increased quit rates compared to non-nicotine EC (moderate-certainty evidence, limited by imprecision) (RR 1.34, 95% CI 1.06 to 1.70; I² = 0%; 7 studies, 1918 participants). In absolute terms, this might lead to an additional two quitters per 100 (95% CI 0 to 4 more). There is probably little to no difference in the rate of AEs between these groups (moderate-certainty evidence) (RR 1.01, 95% CI 0.95 to 1.08; I² = 0%; 5 studies, 840 participants). There is insufficient evidence to determine whether rates of SAEs differ between groups, due to very serious imprecision (RR 0.98, 95% CI 0.55 to 1.73; I² = 0%; 10 studies, 1717 participants; low-certainty evidence). Compared to behavioural support only or no support, quit rates may be higher for participants randomised to nicotine EC (low-certainty evidence due to risk of bias) (RR 1.78, 95% CI 1.42 to 2.25; I² = 13%; 11 studies, 6819 participants). In absolute terms, this represents an additional three quitters per 100 (95% CI 2 to 5 more). There was some evidence that (non-serious) AEs may be more common in people randomised to nicotine EC (RR 1.22, 95% CI 0.96 to 1.55; I² = 66%; 8 studies, 2485 participants; very low-certainty evidence) but the evidence is uncertain and, again, there was insufficient evidence to determine whether rates of SAEs differed between groups (RR 0.93, 95% CI 0.67 to 1.29; I² = 0%; 15 studies, 4716 participants; very low-certainty evidence). Data from non-randomised studies were consistent with RCT data. The most commonly reported AEs were throat/mouth irritation, headache, cough, and nausea, which tended to dissipate with continued EC use. Very few studies reported data on other outcomes or comparisons; hence, evidence for these is limited, with CIs often encompassing both clinically significant harm and benefit."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "There is high-certainty evidence that nicotine EC increase quit rates compared to NRT, and moderate-certainty evidence that they probably increase quit rates compared to EC without nicotine. Evidence comparing nicotine EC with behavioural support or no support also suggests benefit, but is less certain due to risk of bias inherent in the study designs. CIs were, for the most part, wide for data on AEs, SAEs, and other safety markers, with no evidence of a difference in AEs between nicotine and non-nicotine EC nor between nicotine EC and NRT, but low-certainty evidence for increased AEs compared with behavioural support/no support. Overall incidence of SAEs was low across all study arms. We did not detect evidence of serious harm from nicotine EC, but longer, larger trials are needed to fully evaluate safety. Included studies tested regulated nicotine-containing EC; illicit products and/or products containing other active substances (e.g. tetrahydrocannabinol (THC)) may have different harm profiles. The main limitation of the evidence base remains imprecision for some comparisons and for safety outcomes due to the relatively small number of RCTs contributing, often with low event rates. Further RCTs are underway. To ensure the review continues to provide up-to-date information to decision-makers, this is a living systematic review. We run and screen searches monthly, with the review updated when relevant new evidence becomes available. Please refer to the Cochrane Database of Systematic Reviews for the review's current status."
        },
        {
          "label": "FUNDING",
          "text": "Cancer Research UK (PICCTR-2024/100012)."
        },
        {
          "label": "REGISTRATION",
          "text": "Original 2012 protocol available via DOI: 10.1002/14651858.CD010216. Updated 2023 protocol available via DOI 10.17605/OSF.IO/ZWGSK (https://osf.io/ZWGSK/). 2025 updates to protocol available via DOI: 10.17605/OSF.IO/59M4U (https://osf.io/59M4U/) and DOI: 10.17605/OSF.IO/UPGJC (https://osf.io/UPGJC/)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212103/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1002/14651858.CD010216.pub10",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Nicotine-containing electronic cigarettes (ECs) likely increase smoking cessation rates compared to nicotine replacement therapy (NRT) and ECs without nicotine, with no evidence of serious harm detected in the included studies, though further research is needed."
    },
    {
      "id": "5d17f6088dd5",
      "title": "Management of systemic lupus erythematosus with kidney involvement: systematic literature review to inform the 2025 update of EULAR recommendations.",
      "journal": "EULAR Rheumatology Open",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology",
        "Nephrology",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118019",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false
    },
    {
      "id": "62e2a5805606",
      "title": "Efficacy and safety of European Medicines Agency (EMA)-approved pharmacological, endoscopic, and surgical treatments in different classes of obesity: A network meta-analysis of randomised controlled trials for the development of the SIO (Societa Italiana Obesita) Italian guidelines for the diagnosis and treatment of overweight and obesity.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/117992",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false
    },
    {
      "id": "fa4112247617",
      "title": "Time to Benefit for Lung Cancer Screening: A Systematic Review and Survival Meta-Analysis.",
      "journal": "Am J Prev Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/117949",
      "abstract": "Lung cancer screening with low-dose computed tomography reduces lung cancer mortality in the long term but carries immediate risks. Guidelines recommend screening persons whose life expectancy exceeds the screening test's time to benefit, defined as the time from screening initiation to first observed benefit. This study aimed to estimate the time to benefit for lung cancer screening to prevent lung cancer mortality. Randomized controlled trials of lung cancer screening with low-dose computed tomography were identified from two prior systematic reviews and an updated search to December 3, 2023. Studies that reported lung cancer mortality were included. For each study, independent Weibull survival curves were fitted and Markov chain Monte Carlo simulations were generated to estimate the absolute risk reduction at different time points. Time to benefit was determined as the time at which absolute risk reduction thresholds (ARR=0.0005, 0.001, 0.002) were crossed. These estimates were pooled using a random-effects meta-analysis model. A total of eight randomized controlled trials comprising 88,526 participants were included. Enrollment age ranged from age 50 to 70 years; follow-up duration ranged from 7.3 to 12.3 years. For every 1,000 persons screened, 3.4 years (95%=CI 2.2, 5.1) passed before 1 death from lung cancer was prevented (ARR=0.001). The time to prevent one lung cancer death per 2,000 persons screened (ARR=0.0005) was 2.2 years (95% CI=1.4, 3.4); per 500 persons screened (ARR=0.002), it was 5.2 years (95%=CI 3.7, 7.3). Lung cancer screening is most appropriate for older adults at high risk of lung cancer with a life expectancy greater than 3.4 years.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Lung cancer screening with low-dose computed tomography reduces lung cancer mortality in the long term but carries immediate risks. Guidelines recommend screening persons whose life expectancy exceeds the screening test's time to benefit, defined as the time from screening initiation to first observed benefit. This study aimed to estimate the time to benefit for lung cancer screening to prevent lung cancer mortality."
        },
        {
          "label": "METHODS",
          "text": "Randomized controlled trials of lung cancer screening with low-dose computed tomography were identified from two prior systematic reviews and an updated search to December 3, 2023. Studies that reported lung cancer mortality were included. For each study, independent Weibull survival curves were fitted and Markov chain Monte Carlo simulations were generated to estimate the absolute risk reduction at different time points. Time to benefit was determined as the time at which absolute risk reduction thresholds (ARR=0.0005, 0.001, 0.002) were crossed. These estimates were pooled using a random-effects meta-analysis model."
        },
        {
          "label": "RESULTS",
          "text": "A total of eight randomized controlled trials comprising 88,526 participants were included. Enrollment age ranged from age 50 to 70 years; follow-up duration ranged from 7.3 to 12.3 years. For every 1,000 persons screened, 3.4 years (95%=CI 2.2, 5.1) passed before 1 death from lung cancer was prevented (ARR=0.001). The time to prevent one lung cancer death per 2,000 persons screened (ARR=0.0005) was 2.2 years (95% CI=1.4, 3.4); per 500 persons screened (ARR=0.002), it was 5.2 years (95%=CI 3.7, 7.3)."
        },
        {
          "label": "DISCUSSION",
          "text": "Lung cancer screening is most appropriate for older adults at high risk of lung cancer with a life expectancy greater than 3.4 years."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40447235/",
      "pubDate": "2025 Aug",
      "doi": "10.1016/j.amepre.2025.107736",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Lung cancer screening with low-dose computed tomography prevents one lung cancer death for every 1,000 people screened after approximately 3.4 years."
    },
    {
      "id": "e05d33588c47",
      "title": "Antidiabetic agents and dementia risk in type 2 diabetes: A systematic review and network meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/118007",
      "abstract": "Certain antidiabetic agents may prevent dementia in patients with type 2 diabetes mellitus (T2DM). The purpose of this study is to elucidate the relative effect of antidiabetic agents on reducing dementia risk in patients with T2DM. PubMed, Cochrane Library and Igaku Chuo Zasshi-Web from inception to 31 December 2023 were searched. Trials reported in English or Japanese language that assessed the effects of glucose-lowering drugs on dementia were selected. Overall, 67 trials (4 088 683 individuals) assessing nine antidiabetic agent classes were included. Studies comprised monotherapies versus control (no use of antidiabetic agents or placebo) (three trials), monotherapies versus add-on therapies (one trial) and real-world database studies (63 trials). The analysis showed that the risk of dementia decreased with sodium-glucose cotransporter 2 inhibitors (SGLT2i), glucagon-like peptide-1 receptor agonists (GLP1-RA), thiazolidinediones (TZD) and dipeptidyl peptidase-4 inhibitors (DPP4i) compared with the reference (placebo, no use of antidiabetic agents or other antidiabetic agents). Conversely, insulin was associated with an increased risk of dementia, whereas no significant association was found with the use of metformin, sulfonylureas, glinides and α-glucosidase inhibitors. Analyses of treatment rankings further revealed the relative effect on reducing dementia risk in the following order: SGLT2i > GLP1-RA > TZD > DPP4i; insulin ranked the lowest. The most effective antidiabetic agent in reducing dementia risk in T2DM is SGLT2i, followed by GLP1-RA, TZD and DPP4i, whereas insulin is associated with an elevated risk of dementia.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "Certain antidiabetic agents may prevent dementia in patients with type 2 diabetes mellitus (T2DM). The purpose of this study is to elucidate the relative effect of antidiabetic agents on reducing dementia risk in patients with T2DM."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "PubMed, Cochrane Library and Igaku Chuo Zasshi-Web from inception to 31 December 2023 were searched. Trials reported in English or Japanese language that assessed the effects of glucose-lowering drugs on dementia were selected."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 67 trials (4 088 683 individuals) assessing nine antidiabetic agent classes were included. Studies comprised monotherapies versus control (no use of antidiabetic agents or placebo) (three trials), monotherapies versus add-on therapies (one trial) and real-world database studies (63 trials). The analysis showed that the risk of dementia decreased with sodium-glucose cotransporter 2 inhibitors (SGLT2i), glucagon-like peptide-1 receptor agonists (GLP1-RA), thiazolidinediones (TZD) and dipeptidyl peptidase-4 inhibitors (DPP4i) compared with the reference (placebo, no use of antidiabetic agents or other antidiabetic agents). Conversely, insulin was associated with an increased risk of dementia, whereas no significant association was found with the use of metformin, sulfonylureas, glinides and α-glucosidase inhibitors. Analyses of treatment rankings further revealed the relative effect on reducing dementia risk in the following order: SGLT2i > GLP1-RA > TZD > DPP4i; insulin ranked the lowest."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The most effective antidiabetic agent in reducing dementia risk in T2DM is SGLT2i, followed by GLP1-RA, TZD and DPP4i, whereas insulin is associated with an elevated risk of dementia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41126557/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1111/dom.70182",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "SGLT2 inhibitors are the most effective antidiabetic medication for reducing dementia risk in type 2 diabetes, while insulin is associated with increased risk."
    },
    {
      "id": "61bd51f1c861",
      "title": "The effects of antidepressants on cardiometabolic and other physiological parameters: a systematic review and network meta-analysis.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117975",
      "abstract": "Antidepressants induce physiological alterations; however, the degree to which these occur in treatment with various antidepressants is unclear. We aimed to compare and rank antidepressants based on physiological side-effects by synthesising data from randomised controlled trials (RCTs). We searched MEDLINE, EMBASE, PsycINFO, ClinicalTrials.gov, and the US Food and Drug Administration (FDA) website from database inception to April 21, 2025. We included single-blinded and double-blinded RCTs comparing antidepressants and placebo in acute monotherapy of any psychiatric disorder. We did frequentist random-effects network meta-analyses to investigate treatment-induced changes in weight; total cholesterol; glucose; heart rate; systolic and diastolic blood pressure; corrected QT interval (QTc); sodium; potassium; aspartate transferase (AST); alanine transaminase (ALT); alkaline phosphatase (ALP); bilirubin; urea; and creatinine. We did meta-regressions to examine study-level associations between physiological change and age, sex, and baseline weight. We estimated the correlation between depressive symptom severity change and metabolic parameter change. Of 26 252 citations, 151 studies and 17 FDA reports met inclusion criteria. The overall sample included 58 534 participants, comparing 30 antidepressants with placebo. Median treatment duration was 8 weeks (IQR 6·0-8·5). We observed clinically significant differences between antidepressants in terms of metabolic and haemodynamic effects, including an approximate 4 kg difference in weight-change between agomelatine and maprotiline, over 21 beats-per-minute difference in heart rate change between fluvoxamine and nortriptyline, and over 11 mmHg difference in systolic blood pressure between nortriptyline and doxepin. Paroxetine, duloxetine, desvenlafaxine, and venlafaxine were associated with increases in total cholesterol and, for duloxetine, glucose concentrations, despite all drugs reducing bodyweight. There was strong evidence of duloxetine, desvenlafaxine, and levomilnacipran increasing AST, ALT, and ALP concentrations, although the magnitudes of these alterations were not considered clinically significant. We did not find strong evidence of any antidepressant affecting QTc, or concentrations of sodium, potassium, urea, and creatinine to a clinically significant extent. Higher baseline bodyweight was associated with larger antidepressant-induced increases in systolic blood pressure, ALT, and AST, and higher baseline age was associated with larger antidepressant-induced increases in glucose. We did not observe an association between changes in depressive symptoms and metabolic disturbance. We found strong evidence that antidepressants differ markedly in their physiological effects, particularly for cardiometabolic parameters. Treatment guidelines should be updated to reflect differences in physiological risk, but choice of antidepressant should be made on an individual basis, considering clinical presentation and preferences of patients, carers, and clinicians. National Institute for Health Research, Maudsley Charity, Wellcome Trust, Medical Research Council.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Antidepressants induce physiological alterations; however, the degree to which these occur in treatment with various antidepressants is unclear. We aimed to compare and rank antidepressants based on physiological side-effects by synthesising data from randomised controlled trials (RCTs)."
        },
        {
          "label": "METHODS",
          "text": "We searched MEDLINE, EMBASE, PsycINFO, ClinicalTrials.gov, and the US Food and Drug Administration (FDA) website from database inception to April 21, 2025. We included single-blinded and double-blinded RCTs comparing antidepressants and placebo in acute monotherapy of any psychiatric disorder. We did frequentist random-effects network meta-analyses to investigate treatment-induced changes in weight; total cholesterol; glucose; heart rate; systolic and diastolic blood pressure; corrected QT interval (QTc); sodium; potassium; aspartate transferase (AST); alanine transaminase (ALT); alkaline phosphatase (ALP); bilirubin; urea; and creatinine. We did meta-regressions to examine study-level associations between physiological change and age, sex, and baseline weight. We estimated the correlation between depressive symptom severity change and metabolic parameter change."
        },
        {
          "label": "FINDINGS",
          "text": "Of 26 252 citations, 151 studies and 17 FDA reports met inclusion criteria. The overall sample included 58 534 participants, comparing 30 antidepressants with placebo. Median treatment duration was 8 weeks (IQR 6·0-8·5). We observed clinically significant differences between antidepressants in terms of metabolic and haemodynamic effects, including an approximate 4 kg difference in weight-change between agomelatine and maprotiline, over 21 beats-per-minute difference in heart rate change between fluvoxamine and nortriptyline, and over 11 mmHg difference in systolic blood pressure between nortriptyline and doxepin. Paroxetine, duloxetine, desvenlafaxine, and venlafaxine were associated with increases in total cholesterol and, for duloxetine, glucose concentrations, despite all drugs reducing bodyweight. There was strong evidence of duloxetine, desvenlafaxine, and levomilnacipran increasing AST, ALT, and ALP concentrations, although the magnitudes of these alterations were not considered clinically significant. We did not find strong evidence of any antidepressant affecting QTc, or concentrations of sodium, potassium, urea, and creatinine to a clinically significant extent. Higher baseline bodyweight was associated with larger antidepressant-induced increases in systolic blood pressure, ALT, and AST, and higher baseline age was associated with larger antidepressant-induced increases in glucose. We did not observe an association between changes in depressive symptoms and metabolic disturbance."
        },
        {
          "label": "INTERPRETATION",
          "text": "We found strong evidence that antidepressants differ markedly in their physiological effects, particularly for cardiometabolic parameters. Treatment guidelines should be updated to reflect differences in physiological risk, but choice of antidepressant should be made on an individual basis, considering clinical presentation and preferences of patients, carers, and clinicians."
        },
        {
          "label": "FUNDING",
          "text": "National Institute for Health Research, Maudsley Charity, Wellcome Trust, Medical Research Council."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41135546/",
      "pubDate": "2025 Nov 01",
      "doi": "10.1016/S0140-6736(25)01293-0",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Different antidepressants have clinically significant and varying effects on metabolic and cardiovascular parameters."
    },
    {
      "id": "20c2c59f2e7d",
      "title": "Serial Ketamine Infusions as Adjunctive Therapy to Inpatient Care for Depression: The KARMA-Dep 2 Randomized Clinical Trial.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117971",
      "abstract": "Serial ketamine infusions are being increasingly adopted as off-label treatment for major depression in routine clinical practice, yet robust psychoactive placebo-controlled trial evidence for short- and long-term efficacy and safety remains limited. To assess antidepressant efficacy, safety, tolerability, cost-effectiveness, and quality of life during and after serial ketamine infusions compared with midazolam as an adjunct to usual inpatient care. The KARMA-Dep 2 trial was an investigator-led, double-blind, randomized, midazolam-controlled, pragmatic trial conducted at an academic center in Ireland between September 2021 and August 2024. Participants included adults (≥18 years) hospitalized with a DSM-5 major depressive episode (unipolar or bipolar) and baseline Montgomery-Åsberg Depression Rating Scale (MADRS) score ≥20. Participants were randomized 1:1 to receive up to 8 twice-weekly intravenous infusions of either ketamine (0.5 mg/kg) or midazolam (0.045 mg/kg) as an adjunct to usual-care pharmacotherapy and other aspects of routine inpatient psychiatric care. Participants were followed up for 6 months. The primary outcome was change in depression symptom severity measured by the observer-rated MADRS score from baseline to end of treatment. Secondary outcomes included self-reported depression severity, safety, tolerability, health care costs, and quality of life. Of 65 randomized participants (mean [SD] age, 53.5 [18.6] years; 37 [59.7%] male), 62 were included in the final analysis. In the analysis of primary outcome, end-of-treatment MADRS scores did not significantly differ between the ketamine and midazolam groups (adjusted mean difference, -3.16 points, 95% CI, -8.54 to 2.22; P = .25; Cohen d, -0.29). Similarly, there was no significant between-group difference between Quick Inventory of Depressive Symptoms, Self-Report, scores (adjusted mean difference, -0.002; 95% CI, -2.71 to 2.71; P > .99; Cohen d, -0.0004). There were no significant between-group differences on other secondary outcomes, including cognition, cost-effectiveness, or quality of life. Most patients and raters accurately guessed treatment allocation. Serial adjunctive ketamine infusions were not more effective than serial midazolam infusions in reducing depressive symptoms in inpatients receiving usual psychiatric care. ClinicalTrials.gov Identifier: NCT04939649.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Serial ketamine infusions are being increasingly adopted as off-label treatment for major depression in routine clinical practice, yet robust psychoactive placebo-controlled trial evidence for short- and long-term efficacy and safety remains limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess antidepressant efficacy, safety, tolerability, cost-effectiveness, and quality of life during and after serial ketamine infusions compared with midazolam as an adjunct to usual inpatient care."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "The KARMA-Dep 2 trial was an investigator-led, double-blind, randomized, midazolam-controlled, pragmatic trial conducted at an academic center in Ireland between September 2021 and August 2024. Participants included adults (≥18 years) hospitalized with a DSM-5 major depressive episode (unipolar or bipolar) and baseline Montgomery-Åsberg Depression Rating Scale (MADRS) score ≥20."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomized 1:1 to receive up to 8 twice-weekly intravenous infusions of either ketamine (0.5 mg/kg) or midazolam (0.045 mg/kg) as an adjunct to usual-care pharmacotherapy and other aspects of routine inpatient psychiatric care. Participants were followed up for 6 months."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was change in depression symptom severity measured by the observer-rated MADRS score from baseline to end of treatment. Secondary outcomes included self-reported depression severity, safety, tolerability, health care costs, and quality of life."
        },
        {
          "label": "RESULTS",
          "text": "Of 65 randomized participants (mean [SD] age, 53.5 [18.6] years; 37 [59.7%] male), 62 were included in the final analysis. In the analysis of primary outcome, end-of-treatment MADRS scores did not significantly differ between the ketamine and midazolam groups (adjusted mean difference, -3.16 points, 95% CI, -8.54 to 2.22; P = .25; Cohen d, -0.29). Similarly, there was no significant between-group difference between Quick Inventory of Depressive Symptoms, Self-Report, scores (adjusted mean difference, -0.002; 95% CI, -2.71 to 2.71; P > .99; Cohen d, -0.0004). There were no significant between-group differences on other secondary outcomes, including cognition, cost-effectiveness, or quality of life. Most patients and raters accurately guessed treatment allocation."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Serial adjunctive ketamine infusions were not more effective than serial midazolam infusions in reducing depressive symptoms in inpatients receiving usual psychiatric care."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04939649."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123905/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1001/jamapsychiatry.2025.3019",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Ketamine infusions did not outperform midazolam infusions in alleviating depressive symptoms in hospitalized patients receiving standard psychiatric treatment."
    },
    {
      "id": "3758ce7ed7b9",
      "title": "Twice-Daily Clopidogrel vs Ticagrelor to Reduce Short-Term Major Adverse Cardiovascular Events After Primary Percutaneous Coronary Intervention: The TADCLOT Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117957",
      "abstract": "The first month postprimary percutaneous coronary intervention (PCI) for ST-segment elevation myocardial infarction (STEMI) is the highest risk period for major adverse cardiovascular events (MACEs), including stent thrombosis. Ticagrelor and double-dose clopidogrel are effective antiplatelet therapies, but no head-to-head comparison exists in this setting. The authors sought to evaluate the efficacy of ticagrelor over twice-daily clopidogrel in reducing MACE events within the first 1 month postprimary PCI. TADCLOT (Twice-A-Day CLOpidogrel vs Ticagrelor), a double-blind, randomized superiority trial at the National Institute of Cardiovascular Diseases, Karachi, Pakistan (February 19, 2024 to January 30, 2025), randomized 2,201 patients with STEMI within 24 hours of primary PCI 1:1 to ticagrelor (180-mg loading dose, 90 mg twice a day) or twice-daily clopidogrel (600-mg loading dose, 75 mg twice a day) for 1 month. The primary endpoint was MACEs (death, myocardial infarction, stent thrombosis, stroke, or target lesion revascularization) at 1 month, analyzed by intention to treat. Secondary endpoints were individual MACE components and clinically significant bleeding (Bleeding Academic Research Consortium [BARC] type 2, 3, or 5). Among 2,201 randomized patients, MACEs occurred in 24 (2.2%) ticagrelor patients vs 32 (2.9%) in twice-daily clopidogrel patients (HR: 0.75; 95% CI: 0.44-1.27; P = 0.28; absolute risk difference: -0.7%; 95% CI: -2.05 to 0.60). Cardiovascular death or definite stent thrombosis occurred in 21 (1.9%) vs 27 (2.5%) patients (HR: 0.77; 95% CI: 0.44-1.37). Clinically significant bleeding (BARC type 2, 3, or 5) occurred in 6 patients (0.5%) with ticagrelor vs 4 (0.4%) with clopidogrel (HR: 1.50; 95% CI: 0.42-5.31). Major bleeding (BARC type 3 or 5) was infrequent and similar between the groups: 3 patients (0.3%) in the ticagrelor arm and 2 (0.2%) in the clopidogrel arm (HR: 1.50; 95% CI: 0.25-8.97). At both 7 (HR: 0.15; 95% CI: 0.04-0.5; P = 0.002) and 14 days (HR: 0.46; 95% CI: 0.23-0.91; P = 0.02), MACEs were significantly lower with ticagrelor compared with twice-daily clopidogrel, although these differences were no longer statistically significant at 30 days. Ticagrelor was not superior to twice-daily clopidogrel in reducing MACEs at 1 month after primary PCI, and bleeding rates were similar. However, event rates were lower than anticipated, and ticagrelor significantly reduced MACEs within the first 2 weeks compared with twice-daily clopidogrel. (TADCLOT-a Double Blind Randomized Controlled Trial [TADCLOT]; NCT06318481).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The first month postprimary percutaneous coronary intervention (PCI) for ST-segment elevation myocardial infarction (STEMI) is the highest risk period for major adverse cardiovascular events (MACEs), including stent thrombosis. Ticagrelor and double-dose clopidogrel are effective antiplatelet therapies, but no head-to-head comparison exists in this setting."
        },
        {
          "label": "OBJECTIVES",
          "text": "The authors sought to evaluate the efficacy of ticagrelor over twice-daily clopidogrel in reducing MACE events within the first 1 month postprimary PCI."
        },
        {
          "label": "METHODS",
          "text": "TADCLOT (Twice-A-Day CLOpidogrel vs Ticagrelor), a double-blind, randomized superiority trial at the National Institute of Cardiovascular Diseases, Karachi, Pakistan (February 19, 2024 to January 30, 2025), randomized 2,201 patients with STEMI within 24 hours of primary PCI 1:1 to ticagrelor (180-mg loading dose, 90 mg twice a day) or twice-daily clopidogrel (600-mg loading dose, 75 mg twice a day) for 1 month. The primary endpoint was MACEs (death, myocardial infarction, stent thrombosis, stroke, or target lesion revascularization) at 1 month, analyzed by intention to treat. Secondary endpoints were individual MACE components and clinically significant bleeding (Bleeding Academic Research Consortium [BARC] type 2, 3, or 5)."
        },
        {
          "label": "RESULTS",
          "text": "Among 2,201 randomized patients, MACEs occurred in 24 (2.2%) ticagrelor patients vs 32 (2.9%) in twice-daily clopidogrel patients (HR: 0.75; 95% CI: 0.44-1.27; P = 0.28; absolute risk difference: -0.7%; 95% CI: -2.05 to 0.60). Cardiovascular death or definite stent thrombosis occurred in 21 (1.9%) vs 27 (2.5%) patients (HR: 0.77; 95% CI: 0.44-1.37). Clinically significant bleeding (BARC type 2, 3, or 5) occurred in 6 patients (0.5%) with ticagrelor vs 4 (0.4%) with clopidogrel (HR: 1.50; 95% CI: 0.42-5.31). Major bleeding (BARC type 3 or 5) was infrequent and similar between the groups: 3 patients (0.3%) in the ticagrelor arm and 2 (0.2%) in the clopidogrel arm (HR: 1.50; 95% CI: 0.25-8.97). At both 7 (HR: 0.15; 95% CI: 0.04-0.5; P = 0.002) and 14 days (HR: 0.46; 95% CI: 0.23-0.91; P = 0.02), MACEs were significantly lower with ticagrelor compared with twice-daily clopidogrel, although these differences were no longer statistically significant at 30 days."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ticagrelor was not superior to twice-daily clopidogrel in reducing MACEs at 1 month after primary PCI, and bleeding rates were similar. However, event rates were lower than anticipated, and ticagrelor significantly reduced MACEs within the first 2 weeks compared with twice-daily clopidogrel. (TADCLOT-a Double Blind Randomized Controlled Trial [TADCLOT]; NCT06318481)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892606/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1016/j.jacc.2025.08.041",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Ticagrelor did not outperform twice-daily clopidogrel in reducing major adverse cardiovascular events (MACEs) at one month, though it showed early benefit within the first two weeks."
    },
    {
      "id": "3a4f1670ead2",
      "title": "Effects of empagliflozin on conventional and exploratory acute and chronic kidney outcomes: an individual participant-level meta-analysis.",
      "journal": "Lancet Diabetes Endocrinol",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117954",
      "abstract": "Uncertainty remains about effects of sodium-glucose co-transporter-2 (SGLT2) inhibition on kidney outcomes in individuals with slowly progressive chronic kidney disease (eg, low albuminuria) and those at risk of large acute estimated glomerular filtration rate (eGFR) dips on initiation of such treatment. We aimed to explore the effects of empagliflozin on a range of kidney outcomes in these population subtypes. In this meta-analysis, we used individual-level data from 23 340 participants in four large placebo-controlled trials (EMPA-REG OUTCOME, EMPEROR-Reduced, EMPEROR-Preserved, and EMPA-KIDNEY) to assess the effects of empagliflozin on conventional and exploratory acute and chronic kidney outcomes. We then assessed whether effects varied by predicted size of the acute eGFR dip on treatment initiation or among other key population subtypes using tests for heterogeneity and trend. The individual-level data were requested from Boehringer Ingelheim (Ingelheim, Germany). Compared with placebo, allocation to empagliflozin reduced the risk of a marker of acute kidney injury (a ≥50% increase in serum creatinine in consecutive follow-up samples) by 20% (hazard ratio 0·80 [95% CI 0·72-0·88]; 1573 outcomes), acute kidney injury adverse events by 27% (0·73 [0·63-0·85]; 694 outcomes), a categorical chronic kidney disease progression outcome by 30% (0·70 [0·63-0·78]; 1403 outcomes), and kidney failure by 34% (0·66 [0·55-0·79]; 490 outcomes). Empagliflozin slowed a chronic annual rate of eGFR decline by 64% (95% CI 59-69) and off-treatment dip-free slope-a post-hoc outcome using randomisation and off-treatment eGFR values available in a subset of 10 630 participants-by 64% (54-73). These kidney benefits were similar in subgroups divided by predicted size of acute eGFR dip, and were present irrespective of diabetes or heart failure status, level of kidney function, or albuminuria. SGLT2 inhibition reduces risk of acute and chronic kidney outcomes irrespective of the size of the acute dip in eGFR. Kidney benefits are evident irrespective of diabetes status, heart failure status, primary cause of kidney disease, and markers of severity of these diseases. None.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Uncertainty remains about effects of sodium-glucose co-transporter-2 (SGLT2) inhibition on kidney outcomes in individuals with slowly progressive chronic kidney disease (eg, low albuminuria) and those at risk of large acute estimated glomerular filtration rate (eGFR) dips on initiation of such treatment. We aimed to explore the effects of empagliflozin on a range of kidney outcomes in these population subtypes."
        },
        {
          "label": "METHODS",
          "text": "In this meta-analysis, we used individual-level data from 23 340 participants in four large placebo-controlled trials (EMPA-REG OUTCOME, EMPEROR-Reduced, EMPEROR-Preserved, and EMPA-KIDNEY) to assess the effects of empagliflozin on conventional and exploratory acute and chronic kidney outcomes. We then assessed whether effects varied by predicted size of the acute eGFR dip on treatment initiation or among other key population subtypes using tests for heterogeneity and trend. The individual-level data were requested from Boehringer Ingelheim (Ingelheim, Germany)."
        },
        {
          "label": "FINDINGS",
          "text": "Compared with placebo, allocation to empagliflozin reduced the risk of a marker of acute kidney injury (a ≥50% increase in serum creatinine in consecutive follow-up samples) by 20% (hazard ratio 0·80 [95% CI 0·72-0·88]; 1573 outcomes), acute kidney injury adverse events by 27% (0·73 [0·63-0·85]; 694 outcomes), a categorical chronic kidney disease progression outcome by 30% (0·70 [0·63-0·78]; 1403 outcomes), and kidney failure by 34% (0·66 [0·55-0·79]; 490 outcomes). Empagliflozin slowed a chronic annual rate of eGFR decline by 64% (95% CI 59-69) and off-treatment dip-free slope-a post-hoc outcome using randomisation and off-treatment eGFR values available in a subset of 10 630 participants-by 64% (54-73). These kidney benefits were similar in subgroups divided by predicted size of acute eGFR dip, and were present irrespective of diabetes or heart failure status, level of kidney function, or albuminuria."
        },
        {
          "label": "INTERPRETATION",
          "text": "SGLT2 inhibition reduces risk of acute and chronic kidney outcomes irrespective of the size of the acute dip in eGFR. Kidney benefits are evident irrespective of diabetes status, heart failure status, primary cause of kidney disease, and markers of severity of these diseases."
        },
        {
          "label": "FUNDING",
          "text": "None."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41082889/",
      "pubDate": "2025 Oct 10",
      "doi": "10.1016/S2213-8587(25)00222-0",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false,
      "summary": "Empagliflozin, an SGLT2 inhibitor, significantly reduced the risk of acute kidney injury, chronic kidney disease progression, and kidney failure, and slowed the decline of kidney function, regardless of the predicted initial drop in kidney function or other patient characteristics."
    },
    {
      "id": "3b356947d2e0",
      "title": "Supervised exercise and pelvic floor muscle training eases current pelvic and genital pain but not worst pelvic and genital pain in women with endometriosis: a randomised trial.",
      "journal": "J Physiother",
      "score": "5/7",
      "tags": [
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48783120/117793",
      "dateReceived": "2025-11-11T23:24:37.533Z",
      "isNew": false
    },
    {
      "id": "d201455fe2de",
      "title": "Comparative Gastrointestinal Safety of Dulaglutide, Semaglutide, and Tirzepatide in Adults With Type 2 Diabetes.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48876858/118093",
      "abstract": "The comparative gastrointestinal safety across glucagon-like peptide-1 receptor agonists and tirzepatide is still unclear. To compare the risk for severe gastrointestinal adverse events across dulaglutide, subcutaneous semaglutide, and tirzepatide in patients with type 2 diabetes (T2D) in routine clinical practice. New-user, active-comparator cohort study. Population-based study. Adults with T2D initiating dulaglutide, subcutaneous semaglutide, and tirzepatide between 1 January 2019 and 30 August 2024 in 3 cohorts corresponding to 3 pairwise comparisons. The primary outcome was a composite of acute pancreatitis, biliary disease, bowel obstruction, gastroparesis, and severe constipation. Secondary outcomes of interest were the individual components of the primary outcome. Patients were 1:1 propensity score matched within each comparison. We calculated hazard ratios (HRs) with 95% CIs. There were 65 238 matched pairs in the semaglutide versus dulaglutide cohort, 20 893 in the tirzepatide versus dulaglutide cohort, and 46 620 in the tirzepatide versus semaglutide cohort. The HR of gastrointestinal events was 0.96 (95% CI, 0.87 to 1.06) in the semaglutide versus dulaglutide cohort, 0.96 (CI, 0.77 to 1.20) in the tirzepatide versus dulaglutide cohort, and 1.07 (CI, 0.90 to 1.26) in the tirzepatide versus semaglutide cohort. Possible residual confounding by glycemic control and body mass index. These findings suggest that dulaglutide, semaglutide, and tirzepatide have similar gastrointestinal safety profiles in adults with T2D. This study provides clinicians with evidence to weigh the benefits and risks of these medications. National Institute of Diabetes and Digestive and Kidney Diseases.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The comparative gastrointestinal safety across glucagon-like peptide-1 receptor agonists and tirzepatide is still unclear."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the risk for severe gastrointestinal adverse events across dulaglutide, subcutaneous semaglutide, and tirzepatide in patients with type 2 diabetes (T2D) in routine clinical practice."
        },
        {
          "label": "DESIGN",
          "text": "New-user, active-comparator cohort study."
        },
        {
          "label": "SETTING",
          "text": "Population-based study."
        },
        {
          "label": "PARTICIPANTS",
          "text": "Adults with T2D initiating dulaglutide, subcutaneous semaglutide, and tirzepatide between 1 January 2019 and 30 August 2024 in 3 cohorts corresponding to 3 pairwise comparisons."
        },
        {
          "label": "MEASUREMENTS",
          "text": "The primary outcome was a composite of acute pancreatitis, biliary disease, bowel obstruction, gastroparesis, and severe constipation. Secondary outcomes of interest were the individual components of the primary outcome. Patients were 1:1 propensity score matched within each comparison. We calculated hazard ratios (HRs) with 95% CIs."
        },
        {
          "label": "RESULTS",
          "text": "There were 65 238 matched pairs in the semaglutide versus dulaglutide cohort, 20 893 in the tirzepatide versus dulaglutide cohort, and 46 620 in the tirzepatide versus semaglutide cohort. The HR of gastrointestinal events was 0.96 (95% CI, 0.87 to 1.06) in the semaglutide versus dulaglutide cohort, 0.96 (CI, 0.77 to 1.20) in the tirzepatide versus dulaglutide cohort, and 1.07 (CI, 0.90 to 1.26) in the tirzepatide versus semaglutide cohort."
        },
        {
          "label": "LIMITATION",
          "text": "Possible residual confounding by glycemic control and body mass index."
        },
        {
          "label": "CONCLUSION",
          "text": "These findings suggest that dulaglutide, semaglutide, and tirzepatide have similar gastrointestinal safety profiles in adults with T2D. This study provides clinicians with evidence to weigh the benefits and risks of these medications."
        },
        {
          "label": "PRIMARY FUNDING SOURCE",
          "text": "National Institute of Diabetes and Digestive and Kidney Diseases."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41183330/",
      "pubDate": "2025 Nov 04",
      "doi": "10.7326/ANNALS-25-01724",
      "dateReceived": "2025-11-11T23:24:37.532Z",
      "isNew": false,
      "summary": "Dulaglutide, semaglutide, and tirzepatide appear to have comparable gastrointestinal safety in adults with type 2 diabetes."
    },
    {
      "id": "3345597cf6f2",
      "title": "Updated Evidence for Covid-19, RSV, and Influenza Vaccines for 2025-2026.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/118039",
      "abstract": "Changes in the vaccine advisory process in the United States have disrupted immunization guidance, which reinforces the need for independent evidence review to inform decisions regarding immunization for respiratory viruses during the 2025-2026 season. We conducted a systematic review of U.S.-licensed immunizations against coronavirus disease 2019 (Covid-19), respiratory syncytial virus (RSV), and influenza. We searched databases on PubMed/MEDLINE, Embase, and Web of Science for updates of the most recent review by the Advisory Committee on Immunization Practices (ACIP) Evidence-to-Recommendations for each disease, which was performed during the 2023-2024 period. Outcomes included vaccine efficacy and effectiveness against hospitalization, other clinical end points, and safety. Of 17,263 identified references, 511 studies met the inclusion criteria. Covid-19 mRNA vaccines against the XBB.1.5 subvariant had pooled vaccine effectiveness against hospitalization of 46% (95% confidence interval [CI], 34 to 55; from cohort studies) and 50% (95% CI, 43 to 57; from case-control studies) among adults and 37% (95% CI, 29 to 44) among immunocompromised adults. In a case-control study, vaccines against the KP.2 subvariant showed an effectiveness of 68% (95% CI, 42 to 82). Maternal RSV vaccination (for infant protection), nirsevimab for infants, and RSV vaccines in adults who were 60 years of age or older showed vaccine effectiveness of 68% or more against hospitalization. Influenza vaccination had a pooled vaccine effectiveness of 48% (95% CI, 39 to 55) in adults between the ages of 18 and 64 years and 67% (95% CI, 58 to 75) in children against hospitalization. Safety profiles were consistent with previous evaluations. The diagnosis of myocarditis associated with Covid-19 vaccines occurred at rates of 1.3 to 3.1 per 100,000 doses in male adolescents, with lower risk associated with longer dosing intervals. The RSVPreF vaccine was associated with 18.2 excess cases of Guillain-Barré syndrome per million doses in older adults; a significant association with preterm birth was not observed when the vaccine was administered at 32 to 36 weeks' gestation. Ongoing peer-reviewed evidence supports the safety and effectiveness of immunizations against Covid-19, RSV, and influenza during the 2025-2026 season. (Funded by the Center for Infectious Disease Research and Policy and the Alumbra Innovations Foundation.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Changes in the vaccine advisory process in the United States have disrupted immunization guidance, which reinforces the need for independent evidence review to inform decisions regarding immunization for respiratory viruses during the 2025-2026 season."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic review of U.S.-licensed immunizations against coronavirus disease 2019 (Covid-19), respiratory syncytial virus (RSV), and influenza. We searched databases on PubMed/MEDLINE, Embase, and Web of Science for updates of the most recent review by the Advisory Committee on Immunization Practices (ACIP) Evidence-to-Recommendations for each disease, which was performed during the 2023-2024 period. Outcomes included vaccine efficacy and effectiveness against hospitalization, other clinical end points, and safety."
        },
        {
          "label": "RESULTS",
          "text": "Of 17,263 identified references, 511 studies met the inclusion criteria. Covid-19 mRNA vaccines against the XBB.1.5 subvariant had pooled vaccine effectiveness against hospitalization of 46% (95% confidence interval [CI], 34 to 55; from cohort studies) and 50% (95% CI, 43 to 57; from case-control studies) among adults and 37% (95% CI, 29 to 44) among immunocompromised adults. In a case-control study, vaccines against the KP.2 subvariant showed an effectiveness of 68% (95% CI, 42 to 82). Maternal RSV vaccination (for infant protection), nirsevimab for infants, and RSV vaccines in adults who were 60 years of age or older showed vaccine effectiveness of 68% or more against hospitalization. Influenza vaccination had a pooled vaccine effectiveness of 48% (95% CI, 39 to 55) in adults between the ages of 18 and 64 years and 67% (95% CI, 58 to 75) in children against hospitalization. Safety profiles were consistent with previous evaluations. The diagnosis of myocarditis associated with Covid-19 vaccines occurred at rates of 1.3 to 3.1 per 100,000 doses in male adolescents, with lower risk associated with longer dosing intervals. The RSVPreF vaccine was associated with 18.2 excess cases of Guillain-Barré syndrome per million doses in older adults; a significant association with preterm birth was not observed when the vaccine was administered at 32 to 36 weeks' gestation."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Ongoing peer-reviewed evidence supports the safety and effectiveness of immunizations against Covid-19, RSV, and influenza during the 2025-2026 season. (Funded by the Center for Infectious Disease Research and Policy and the Alumbra Innovations Foundation.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160817/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1056/NEJMsa2514268",
      "dateReceived": "2025-11-10T23:25:10.470Z",
      "isNew": false
    },
    {
      "id": "9ff97cc77277",
      "title": "European Study of Prostate Cancer Screening - 23-Year Follow-up.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/118037",
      "abstract": "The European Randomized Study of Screening for Prostate Cancer (ERSPC) was initiated in 1993 to assess the effect of prostate-specific antigen (PSA) testing on prostate cancer mortality. Because deaths from prostate cancer are expected to rise worldwide owing to increased life expectancy and population growth, a final analysis of the long-term outcomes of prostate cancer screening is essential to understanding the benefits and harms of PSA testing. We updated the findings from ERSPC, a multicenter, randomized study conducted across eight European countries with a focus on a predefined core age group of 162,236 men who were 55 to 69 years of age at the time of randomization. Participants were randomly assigned to the screening group and offered repeated PSA testing or to the control group and not invited for screening. The primary outcome was prostate cancer mortality. After a median follow-up of 23 years, prostate cancer mortality was 13% lower in the screening group (rate ratio, 0.87; 95% confidence interval [CI], 0.80 to 0.95), and the absolute risk reduction was 0.22% (95% CI, 0.10 to 0.34). The cumulative incidence of prostate cancer was higher in the screening group than in the control group (rate ratio, 1.30; 95% CI, 1.26 to 1.33). At a median of 23 years of follow-up, one death from prostate cancer was prevented for every 456 men (95% CI, 306 to 943) who were invited for screening, and one death from prostate cancer was averted for every 12 men (95% CI, 8 to 26) in whom prostate cancer was diagnosed, as compared with one death from prostate cancer prevented for every 628 men (95% CI, 419 to 1481) and one death averted for every 18 men (95% CI, 12 to 45) at 16 years of follow-up. Long-term follow-up confirms a sustained reduction in deaths from prostate cancer with PSA testing, alongside an improved harm-benefit ratio. Future screening strategies should adopt risk-based approaches to minimize overdiagnosis while maintaining clinical benefits. (Funded by the Dutch Cancer Society and others; ERSPC ISRCTN registry number, ISRCTN49127736.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The European Randomized Study of Screening for Prostate Cancer (ERSPC) was initiated in 1993 to assess the effect of prostate-specific antigen (PSA) testing on prostate cancer mortality. Because deaths from prostate cancer are expected to rise worldwide owing to increased life expectancy and population growth, a final analysis of the long-term outcomes of prostate cancer screening is essential to understanding the benefits and harms of PSA testing."
        },
        {
          "label": "METHODS",
          "text": "We updated the findings from ERSPC, a multicenter, randomized study conducted across eight European countries with a focus on a predefined core age group of 162,236 men who were 55 to 69 years of age at the time of randomization. Participants were randomly assigned to the screening group and offered repeated PSA testing or to the control group and not invited for screening. The primary outcome was prostate cancer mortality."
        },
        {
          "label": "RESULTS",
          "text": "After a median follow-up of 23 years, prostate cancer mortality was 13% lower in the screening group (rate ratio, 0.87; 95% confidence interval [CI], 0.80 to 0.95), and the absolute risk reduction was 0.22% (95% CI, 0.10 to 0.34). The cumulative incidence of prostate cancer was higher in the screening group than in the control group (rate ratio, 1.30; 95% CI, 1.26 to 1.33). At a median of 23 years of follow-up, one death from prostate cancer was prevented for every 456 men (95% CI, 306 to 943) who were invited for screening, and one death from prostate cancer was averted for every 12 men (95% CI, 8 to 26) in whom prostate cancer was diagnosed, as compared with one death from prostate cancer prevented for every 628 men (95% CI, 419 to 1481) and one death averted for every 18 men (95% CI, 12 to 45) at 16 years of follow-up."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Long-term follow-up confirms a sustained reduction in deaths from prostate cancer with PSA testing, alongside an improved harm-benefit ratio. Future screening strategies should adopt risk-based approaches to minimize overdiagnosis while maintaining clinical benefits. (Funded by the Dutch Cancer Society and others; ERSPC ISRCTN registry number, ISRCTN49127736.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160819/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1056/NEJMoa2503223",
      "dateReceived": "2025-11-10T23:25:10.470Z",
      "isNew": false
    },
    {
      "id": "92b781b2f32f",
      "title": "Extracorporeal Membrane Oxygenation Complications Are Not Causal for Mortality in Patients With Infarct-Related Cardiogenic Shock: A Mediation Analysis of the Extracorporeal Life Support in Infarct-Related Cardiogenic Shock (ECLS-SHOCK) Trial.",
      "journal": "Crit Care Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/118005",
      "abstract": "Recently published randomized controlled trials and an individual patient data meta-analysis showed that the routine use of venoarterial extracorporeal membrane oxygenation (VA-ECMO) did not reduce mortality compared with medical therapy alone in patients with acute myocardial infarction complicated by cardiogenic shock (AMI-CS). The objective of this study was to investigate whether possible VA-ECMO-related medical complications are associated with increased mortality risk, which might explain the observed equipoise among mortality outcomes between VA-ECMO and usual care. Sub-analysis of the randomized Extracorporeal Life Support in Infarct-Related Cardiogenic Shock (ECLS-SHOCK) trial. Multicenter, international randomized controlled trial across 44 centers specialized in treating AMI-CS. Adults patients with AMI-CS. Patients received either routine VA-ECMO support or medical therapy. The rate of complications and mortality as well as causes of death within 30 days. In total, 417 patients were included in this analysis. Moderate and severe bleeding as well as peripheral vascular complications requiring intervention were classified as possible VA-ECMO-related complications. A total of 88 patients (21.1%) developed possible VA-ECMO-related complications, which mostly occurred within five days after randomization and more frequently in the VA-ECMO group than in the control group: 49 (23.4%) vs. 20 (9.6%) patients, p < 0.001 for bleeding and 23 (11.0%) vs. 8 (3.8%) patients, p equals to 0.008 for peripheral vascular complications, respectively. Only four patients died from bleeding as the primary cause of death. Causal mediation analyses revealed no significant mediation effect of possible VA-ECMO-related complications on 30-day mortality. Logistic regression analyses of possible VA-ECMO-related complications confirmed no significant associations between the frequency of VA-ECMO-related complications and mortality. VA-ECMO use in patients with AMI-CS was associated with increased frequencies of moderate to severe bleeding as well as vascular complications warranting intervention. However, these possible VA-ECMO-related complications did not mediate an increased mortality risk. ClinicalTrials.gov, protocol: NCT03637205; August 2018.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "Recently published randomized controlled trials and an individual patient data meta-analysis showed that the routine use of venoarterial extracorporeal membrane oxygenation (VA-ECMO) did not reduce mortality compared with medical therapy alone in patients with acute myocardial infarction complicated by cardiogenic shock (AMI-CS). The objective of this study was to investigate whether possible VA-ECMO-related medical complications are associated with increased mortality risk, which might explain the observed equipoise among mortality outcomes between VA-ECMO and usual care."
        },
        {
          "label": "DESIGN",
          "text": "Sub-analysis of the randomized Extracorporeal Life Support in Infarct-Related Cardiogenic Shock (ECLS-SHOCK) trial."
        },
        {
          "label": "SETTING",
          "text": "Multicenter, international randomized controlled trial across 44 centers specialized in treating AMI-CS."
        },
        {
          "label": "PATIENTS",
          "text": "Adults patients with AMI-CS."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients received either routine VA-ECMO support or medical therapy."
        },
        {
          "label": "MEASUREMENTS AND MAIN RESULTS",
          "text": "The rate of complications and mortality as well as causes of death within 30 days. In total, 417 patients were included in this analysis. Moderate and severe bleeding as well as peripheral vascular complications requiring intervention were classified as possible VA-ECMO-related complications. A total of 88 patients (21.1%) developed possible VA-ECMO-related complications, which mostly occurred within five days after randomization and more frequently in the VA-ECMO group than in the control group: 49 (23.4%) vs. 20 (9.6%) patients, p < 0.001 for bleeding and 23 (11.0%) vs. 8 (3.8%) patients, p equals to 0.008 for peripheral vascular complications, respectively. Only four patients died from bleeding as the primary cause of death. Causal mediation analyses revealed no significant mediation effect of possible VA-ECMO-related complications on 30-day mortality. Logistic regression analyses of possible VA-ECMO-related complications confirmed no significant associations between the frequency of VA-ECMO-related complications and mortality."
        },
        {
          "label": "CONCLUSIONS",
          "text": "VA-ECMO use in patients with AMI-CS was associated with increased frequencies of moderate to severe bleeding as well as vascular complications warranting intervention. However, these possible VA-ECMO-related complications did not mediate an increased mortality risk."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov, protocol: NCT03637205; August 2018."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41114622/",
      "pubDate": "2025 Oct 17",
      "doi": "10.1097/CCM.0000000000006893",
      "dateReceived": "2025-11-10T23:25:10.470Z",
      "isNew": false
    },
    {
      "id": "f97d2469abaa",
      "title": "Optimal Antithrombotics for Ischemic Stroke and Concurrent Atrial Fibrillation and Atherosclerosis: A Randomized Clinical Trial.",
      "journal": "JAMA Neurol",
      "score": "6/7",
      "tags": [
        "Hemostasis and Thrombosis",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/117994",
      "abstract": "Patients with ischemic stroke and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease are at an elevated risk of recurrent ischemic events. Although combined anticoagulant and antiplatelet therapy may reduce ischemic risk, it also increases bleeding, and the optimal antithrombotic strategy remains uncertain. To determine whether adding an antiplatelet agent to anticoagulant therapy influences the net clinical benefit in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease. This multicenter, open-label randomized clinical trial was conducted at 41 sites across Japan from November 2016 to March 2025. Eligible patients had an ischemic stroke or transient ischemic attack within 8 to 360 days of onset, nonvalvular atrial fibrillation, and at least 1 manifestation of atherosclerotic cardiovascular disease (carotid or intracranial artery stenosis, noncardioembolic stroke, ischemic heart disease, or peripheral artery disease). Data were analyzed from April 16, 2024, to October 14, 2024. Patients were randomized to receive combination therapy (anticoagulant plus antiplatelet) or anticoagulant monotherapy. The primary outcome was a composite of ischemic cardiovascular events and major bleeding within 2 years. Secondary outcomes included ischemic cardiovascular events; safety outcomes included major and clinically relevant nonmajor bleeding. In total, 316 patients were randomized to combination therapy (n = 159) or monotherapy (n = 157) (mean [SD] age, 77.2 [7.4] years; 90 female patients [28.5%]). The trial was terminated on July 18, 2023, after an interim analysis for futility. The cumulative incidence of the primary outcome was 17.8% in the combination therapy group and 19.6% in the monotherapy group (hazard ratio [HR], 0.91; 95% CI, 0.53-1.55; P = .64). Ischemic cardiovascular events occurred in 11.1% and 14.2% (HR, 0.76; 95% CI, 0.39-1.48; P = .41), and major and clinically relevant nonmajor bleeding occurred in 19.5% and 8.6% (HR, 2.42; 95% CI, 1.23-4.76; P = .008) of combination therapy and monotherapy groups, respectively. In this randomized clinical trial, in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease, adding an antiplatelet agent to anticoagulant therapy provided no net clinical benefit over anticoagulant monotherapy, with higher bleeding risk. ClinicalTrials.gov Identifier: NCT03062319.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Patients with ischemic stroke and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease are at an elevated risk of recurrent ischemic events. Although combined anticoagulant and antiplatelet therapy may reduce ischemic risk, it also increases bleeding, and the optimal antithrombotic strategy remains uncertain."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether adding an antiplatelet agent to anticoagulant therapy influences the net clinical benefit in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This multicenter, open-label randomized clinical trial was conducted at 41 sites across Japan from November 2016 to March 2025. Eligible patients had an ischemic stroke or transient ischemic attack within 8 to 360 days of onset, nonvalvular atrial fibrillation, and at least 1 manifestation of atherosclerotic cardiovascular disease (carotid or intracranial artery stenosis, noncardioembolic stroke, ischemic heart disease, or peripheral artery disease). Data were analyzed from April 16, 2024, to October 14, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomized to receive combination therapy (anticoagulant plus antiplatelet) or anticoagulant monotherapy."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a composite of ischemic cardiovascular events and major bleeding within 2 years. Secondary outcomes included ischemic cardiovascular events; safety outcomes included major and clinically relevant nonmajor bleeding."
        },
        {
          "label": "RESULTS",
          "text": "In total, 316 patients were randomized to combination therapy (n = 159) or monotherapy (n = 157) (mean [SD] age, 77.2 [7.4] years; 90 female patients [28.5%]). The trial was terminated on July 18, 2023, after an interim analysis for futility. The cumulative incidence of the primary outcome was 17.8% in the combination therapy group and 19.6% in the monotherapy group (hazard ratio [HR], 0.91; 95% CI, 0.53-1.55; P = .64). Ischemic cardiovascular events occurred in 11.1% and 14.2% (HR, 0.76; 95% CI, 0.39-1.48; P = .41), and major and clinically relevant nonmajor bleeding occurred in 19.5% and 8.6% (HR, 2.42; 95% CI, 1.23-4.76; P = .008) of combination therapy and monotherapy groups, respectively."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, in patients with ischemic stroke or transient ischemic attack and concurrent nonvalvular atrial fibrillation and atherosclerotic cardiovascular disease, adding an antiplatelet agent to anticoagulant therapy provided no net clinical benefit over anticoagulant monotherapy, with higher bleeding risk."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03062319."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41051787/",
      "pubDate": "2025 Oct 06",
      "doi": "10.1001/jamaneurol.2025.3662",
      "dateReceived": "2025-11-10T23:25:10.470Z",
      "isNew": false
    },
    {
      "id": "7332b591bd33",
      "title": "Sacubitril/Valsartan and Prevention of Cardiac Dysfunction During Adjuvant Breast Cancer Therapy: The PRADA II Randomized Clinical Trial.",
      "journal": "Circulation",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48772242/117912",
      "abstract": "Anthracycline- and trastuzumab-associated cardiotoxicity may lead to cardiac dysfunction and dose reduction or halt of potentially life-saving adjuvant cancer therapy. Whether angiotensin receptor/neprilysin inhibitors can prevent cancer therapy-related cardiac dysfunction and injury remains to be established. PRADA II (Prevention of Cardiac Dysfunction During Adjuvant Breast Cancer Therapy) was a randomized, parallel-group, placebo-controlled, double-blind, multicenter trial conducted at 4 academic medical centers in Norway that evaluated the cardioprotective effect of sacubitril/valsartan versus placebo administered concomitantly with anthracycline-containing breast cancer therapy and continued for 18 months. The target dose was 97/103 mg BID. The primary outcome was change in left ventricular ejection fraction by cardiovascular magnetic resonance from prior to initiation of chemotherapy to 18 months thereafter. Secondary outcomes included change in echocardiographic global longitudinal strain, circulating cardiac troponins, and NT-proBNP (N-terminal pro-B-type natriuretic peptide). In total, 138 women (mean±SD age: 54.0±9.4 years) were randomized. The overall decline in left ventricular ejection fraction from baseline to 18 months was 2.2 percentage points (95% CI, 1.1 to 3.3) in the placebo group and 1.1 percentage points (95% CI, -0.01 to 2.2) in the sacubitril/valsartan group. The between-group difference was 1.1 percentage points (95% CI, -0.4 to 2.7; =0.16). Left ventricular global longitudinal strain was normal and remained stable in the sacubitril/valsartan group throughout the study (change from baseline to 18 months, -0.3 [95% CI, -0.80 to 0.2]). In contrast, there was a progressive decline in the placebo group (change from baseline to 18 months, 0.5 [95% CI, 0.05 to 1.0]). The between-group difference was -0.9 (95% CI, -1.5 to -0.2). The mean increases in NT-proBNP and cardiac troponin I concentrations from baseline to 18 months were greater in the placebo group than in the sacubitril/valsartan group (log difference, 0.3 [95% CI, 0.05 to 0.6] for NT-proBNP and 0.5 [95% CI, 0.1to 1.0] for cardiac troponin I). Anthracycline-based treatment for early breast cancer was associated with a reduction in left ventricular ejection fraction that was not significantly attenuated by sacubitril/valsartan. URL: https://www.clinicaltrials.gov; Unique identifier: NCT03760588.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Anthracycline- and trastuzumab-associated cardiotoxicity may lead to cardiac dysfunction and dose reduction or halt of potentially life-saving adjuvant cancer therapy. Whether angiotensin receptor/neprilysin inhibitors can prevent cancer therapy-related cardiac dysfunction and injury remains to be established."
        },
        {
          "label": "METHODS",
          "text": "PRADA II (Prevention of Cardiac Dysfunction During Adjuvant Breast Cancer Therapy) was a randomized, parallel-group, placebo-controlled, double-blind, multicenter trial conducted at 4 academic medical centers in Norway that evaluated the cardioprotective effect of sacubitril/valsartan versus placebo administered concomitantly with anthracycline-containing breast cancer therapy and continued for 18 months. The target dose was 97/103 mg BID. The primary outcome was change in left ventricular ejection fraction by cardiovascular magnetic resonance from prior to initiation of chemotherapy to 18 months thereafter. Secondary outcomes included change in echocardiographic global longitudinal strain, circulating cardiac troponins, and NT-proBNP (N-terminal pro-B-type natriuretic peptide)."
        },
        {
          "label": "RESULTS",
          "text": "In total, 138 women (mean±SD age: 54.0±9.4 years) were randomized. The overall decline in left ventricular ejection fraction from baseline to 18 months was 2.2 percentage points (95% CI, 1.1 to 3.3) in the placebo group and 1.1 percentage points (95% CI, -0.01 to 2.2) in the sacubitril/valsartan group. The between-group difference was 1.1 percentage points (95% CI, -0.4 to 2.7; =0.16). Left ventricular global longitudinal strain was normal and remained stable in the sacubitril/valsartan group throughout the study (change from baseline to 18 months, -0.3 [95% CI, -0.80 to 0.2]). In contrast, there was a progressive decline in the placebo group (change from baseline to 18 months, 0.5 [95% CI, 0.05 to 1.0]). The between-group difference was -0.9 (95% CI, -1.5 to -0.2). The mean increases in NT-proBNP and cardiac troponin I concentrations from baseline to 18 months were greater in the placebo group than in the sacubitril/valsartan group (log difference, 0.3 [95% CI, 0.05 to 0.6] for NT-proBNP and 0.5 [95% CI, 0.1to 1.0] for cardiac troponin I)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Anthracycline-based treatment for early breast cancer was associated with a reduction in left ventricular ejection fraction that was not significantly attenuated by sacubitril/valsartan."
        },
        {
          "label": "REGISTRATION",
          "text": "URL: https://www.clinicaltrials.gov; Unique identifier: NCT03760588."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884047/",
      "pubDate": "2025 Oct 21",
      "doi": "10.1161/CIRCULATIONAHA.125.076616",
      "dateReceived": "2025-11-10T23:25:10.470Z",
      "isNew": false
    },
    {
      "id": "ff3a7dcdd578",
      "title": "Transcatheter or Surgical Aortic-Valve Replacement in Low-Risk Patients at 7 Years.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48868381/118011",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41160827/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1056/NEJMc2507935",
      "dateReceived": "2025-11-10T23:25:10.469Z",
      "isNew": false
    }
  ]
}