{
  "updated_at": "2025-11-01T23:23:45.408Z",
  "articles": [
    {
      "id": "8b1557647e86",
      "title": "Progestagens for pain symptoms associated with endometriosis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gynecology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117932",
      "abstract": "Endometriosis is a hormone-sensitive inflammatory condition affecting between 5% and 10% of reproductive-aged women and an unknown number of gender-diverse individuals. It is often associated with debilitating pelvic pain symptoms. Various formulations of progestagens (e.g. oral, depot, implantable) have been studied as potential treatments for endometriosis because they induce atrophy of endometrial tissue. To determine the benefits and harms of progestagens in the treatment of endometriosis-associated pain symptoms. We searched CENTRAL, MEDLINE, Embase, and PsycINFO on 29 October 2024 without language restrictions. We included randomised controlled trials (RCTs) comparing progestagens for symptomatic endometriosis against placebo, other medications, or different doses of progestagens. Studies assessing the levonorgestrel-releasing intrauterine device were ineligible, as a separate Cochrane review covers this intervention. Participants were of reproductive age with a laparoscopic diagnosis of endometriosis and associated pain symptoms. Primary outcomes included endometriosis-associated pain symptoms (overall pain, pelvic pain, and dysmenorrhoea). Secondary outcomes included quality of life, patient satisfaction, and adverse effects. At least two review authors independently selected studies, extracted data, and assessed risk of bias. We reported dichotomous outcomes as risk ratios (RRs) and continuous outcomes as mean differences (MDs), each with its corresponding 95% confidence interval (CI). The meta-analysis employed a fixed-effect model, and we assessed statistical heterogeneity using the I statistic. We used GRADE to assess evidence certainty. We included 33 RCTs involving 5059 participants with symptomatic, laparoscopically diagnosed endometriosis. We judged 13 studies at overall low risk of bias. The following comparisons are limited by the small number of studies reporting each outcome. Pain outcomes, quality of life, and patient satisfaction were measured at six months unless otherwise specified. Oral progestagens versus placebo or no treatment (8 studies) Oral progestagens compared with placebo probably reduce overall pain measured on a visual analogue scale (VAS; MD -2.58, 95% CI -3.13 to -2.03; moderate certainty), and probably reduce dysmenorrhoea at three months (RR 0.21, 95% CI 0.07 to 0.70, moderate certainty), but may have little to no effect on pelvic pain at three months (RR 0.7, 95% CI 0.29 to 1.69; low certainty). Oral progestagens improve quality of life (SF-36 score; MD 4.11, 95% CI 2.41 to 5.82, high certainty). There is probably little to no difference between the interventions in study withdrawal due to adverse effects (RR 2.36, CI 0.74 to 7.52, moderate certainty) and cumulative side effects (RR 1.18, 95% CI 0.94 to 1.46, moderate certainty). Oral progestagens versus oral contraceptives (4 studies) Oral progestagens compared with oral contraceptives probably have little to no effect on pelvic pain measured on a VAS (MD 0.38, 95% CI -0.46 to 1.22, moderate certainty). There was very low-certainty evidence about their effect on dysmenorrhoea at 12 months (MD -0.57, 95% CI -1.29 to 0.15), quality of life (SF-36 general health perception; MD 5.2, 95% CI -1.3 to 11.70), and patient satisfaction (RR 1.18, 95% CI 0.88 to 1.57). Oral progestagens may lead to better quality of life (SF-36 pain score; MD 11.5, 95% CI 2.35 to 20.65, low certainty). There may be little to no difference between oral progestagens and oral contraceptives in study withdrawal due to adverse effects (RR 0.75, 95% CI 0.27 to 2.07, low certainty), and there is probably little to no difference in cumulative side effects (RR 1.13, 95% CI 0.8 to 1.60, moderate certainty). Oral progestagens versus gonadotropin-releasing hormone (GnRH) agonists (10 studies) Oral progestagens compared with GnRH agonists may have little to no effect on overall pain measured on a VAS (MD -0.01, 95% CI -0.30 to 0.28), risk of pelvic pain (RR 1.12, 95% CI 0.80 to 1.59), dysmenorrhoea (RR 1.45, 95% CI 0.71 to 3.00), SF-36 physical health score (MD 0.40, 95% CI -1.58 to 2.38), SF-36 mental health score (MD -0.50, 95% CI -3.75 to 2.75), patient satisfaction (RR 1.08, 95% CI 0.92 to 1.26), and study withdrawal due to adverse effects (RR 0.9, 95% CI 0.34 to 2.43). All these outcomes had low-certainty evidence. The risk of cumulative side effects was probably higher with oral progestagens (RR 1.44, 95% CI 1.11 to 1.86, moderate certainty). Depot progestagens versus GnRH agonists (2 studies) Depot progestagens compared with GnRH agonists reduce dysmenorrhoea risk slightly (RR 0.93, 95% CI 0.89 to 0.97, high certainty) but may have little to no effect on pelvic pain (RR 0.96, 95% CI 0.87 to 1.07, low certainty). The interventions may be similar in study withdrawal due to adverse effects (RR 1.41, 95% CI 0.24 to 8.32, low certainty), but the risk of cumulative side effects is probably lower with depot progestagens (RR 0.03, 95% CI 0.01 to 0.11, moderate certainty). Depot progestagens versus GnRH antagonist (1 study) Depot progestagens compared with GNRH agonists may have little to no effect on pelvic pain (RR 0.85, 95% CI 0.7 to 1.03, low certainty), dysmenorrhoea (RR 0.85, 95% CI 0.7 to 1.03, low certainty), and cumulative adverse effects (RR 1.04, 0.95 to 1.14, low certainty). Study withdrawal due to side effects is likely higher with depot progestagens (RR 2.02, 95% CI 1.04 to 3.94, moderate certainty). Depot progestagens versus the etonogestrel implant (1 study) There was very low-certainty evidence about the effect of depot progestagens versus the etonogestrel implant on overall pain measured on a VAS (MD 0.80, 95% CI - 0.42 to 2.02), patient satisfaction (RR 0.96, 95% CI 0.56 to 1.66), and study withdrawal due to adverse effects (RR 1.84, 95% CI 0.63 to 5.33). In individuals with endometriosis, oral progestagens compared with placebo likely reduce overall pain and dysmenorrhoea and may reduce pelvic pain. Compared with other hormonal suppression strategies, the evidence is less certain due to the small number of studies for each comparison and outcome. Despite such limitations, this update provides a comprehensive overview and valuable insights on progestagen treatment for endometriosis, emphasising the nuanced balance between efficacy, adverse effects, and patient satisfaction.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Endometriosis is a hormone-sensitive inflammatory condition affecting between 5% and 10% of reproductive-aged women and an unknown number of gender-diverse individuals. It is often associated with debilitating pelvic pain symptoms. Various formulations of progestagens (e.g. oral, depot, implantable) have been studied as potential treatments for endometriosis because they induce atrophy of endometrial tissue."
        },
        {
          "label": "OBJECTIVES",
          "text": "To determine the benefits and harms of progestagens in the treatment of endometriosis-associated pain symptoms."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, and PsycINFO on 29 October 2024 without language restrictions."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCTs) comparing progestagens for symptomatic endometriosis against placebo, other medications, or different doses of progestagens. Studies assessing the levonorgestrel-releasing intrauterine device were ineligible, as a separate Cochrane review covers this intervention. Participants were of reproductive age with a laparoscopic diagnosis of endometriosis and associated pain symptoms. Primary outcomes included endometriosis-associated pain symptoms (overall pain, pelvic pain, and dysmenorrhoea). Secondary outcomes included quality of life, patient satisfaction, and adverse effects."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "At least two review authors independently selected studies, extracted data, and assessed risk of bias. We reported dichotomous outcomes as risk ratios (RRs) and continuous outcomes as mean differences (MDs), each with its corresponding 95% confidence interval (CI). The meta-analysis employed a fixed-effect model, and we assessed statistical heterogeneity using the I statistic. We used GRADE to assess evidence certainty."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included 33 RCTs involving 5059 participants with symptomatic, laparoscopically diagnosed endometriosis. We judged 13 studies at overall low risk of bias. The following comparisons are limited by the small number of studies reporting each outcome. Pain outcomes, quality of life, and patient satisfaction were measured at six months unless otherwise specified. Oral progestagens versus placebo or no treatment (8 studies) Oral progestagens compared with placebo probably reduce overall pain measured on a visual analogue scale (VAS; MD -2.58, 95% CI -3.13 to -2.03; moderate certainty), and probably reduce dysmenorrhoea at three months (RR 0.21, 95% CI 0.07 to 0.70, moderate certainty), but may have little to no effect on pelvic pain at three months (RR 0.7, 95% CI 0.29 to 1.69; low certainty). Oral progestagens improve quality of life (SF-36 score; MD 4.11, 95% CI 2.41 to 5.82, high certainty). There is probably little to no difference between the interventions in study withdrawal due to adverse effects (RR 2.36, CI 0.74 to 7.52, moderate certainty) and cumulative side effects (RR 1.18, 95% CI 0.94 to 1.46, moderate certainty). Oral progestagens versus oral contraceptives (4 studies) Oral progestagens compared with oral contraceptives probably have little to no effect on pelvic pain measured on a VAS (MD 0.38, 95% CI -0.46 to 1.22, moderate certainty). There was very low-certainty evidence about their effect on dysmenorrhoea at 12 months (MD -0.57, 95% CI -1.29 to 0.15), quality of life (SF-36 general health perception; MD 5.2, 95% CI -1.3 to 11.70), and patient satisfaction (RR 1.18, 95% CI 0.88 to 1.57). Oral progestagens may lead to better quality of life (SF-36 pain score; MD 11.5, 95% CI 2.35 to 20.65, low certainty). There may be little to no difference between oral progestagens and oral contraceptives in study withdrawal due to adverse effects (RR 0.75, 95% CI 0.27 to 2.07, low certainty), and there is probably little to no difference in cumulative side effects (RR 1.13, 95% CI 0.8 to 1.60, moderate certainty). Oral progestagens versus gonadotropin-releasing hormone (GnRH) agonists (10 studies) Oral progestagens compared with GnRH agonists may have little to no effect on overall pain measured on a VAS (MD -0.01, 95% CI -0.30 to 0.28), risk of pelvic pain (RR 1.12, 95% CI 0.80 to 1.59), dysmenorrhoea (RR 1.45, 95% CI 0.71 to 3.00), SF-36 physical health score (MD 0.40, 95% CI -1.58 to 2.38), SF-36 mental health score (MD -0.50, 95% CI -3.75 to 2.75), patient satisfaction (RR 1.08, 95% CI 0.92 to 1.26), and study withdrawal due to adverse effects (RR 0.9, 95% CI 0.34 to 2.43). All these outcomes had low-certainty evidence. The risk of cumulative side effects was probably higher with oral progestagens (RR 1.44, 95% CI 1.11 to 1.86, moderate certainty). Depot progestagens versus GnRH agonists (2 studies) Depot progestagens compared with GnRH agonists reduce dysmenorrhoea risk slightly (RR 0.93, 95% CI 0.89 to 0.97, high certainty) but may have little to no effect on pelvic pain (RR 0.96, 95% CI 0.87 to 1.07, low certainty). The interventions may be similar in study withdrawal due to adverse effects (RR 1.41, 95% CI 0.24 to 8.32, low certainty), but the risk of cumulative side effects is probably lower with depot progestagens (RR 0.03, 95% CI 0.01 to 0.11, moderate certainty). Depot progestagens versus GnRH antagonist (1 study) Depot progestagens compared with GNRH agonists may have little to no effect on pelvic pain (RR 0.85, 95% CI 0.7 to 1.03, low certainty), dysmenorrhoea (RR 0.85, 95% CI 0.7 to 1.03, low certainty), and cumulative adverse effects (RR 1.04, 0.95 to 1.14, low certainty). Study withdrawal due to side effects is likely higher with depot progestagens (RR 2.02, 95% CI 1.04 to 3.94, moderate certainty). Depot progestagens versus the etonogestrel implant (1 study) There was very low-certainty evidence about the effect of depot progestagens versus the etonogestrel implant on overall pain measured on a VAS (MD 0.80, 95% CI - 0.42 to 2.02), patient satisfaction (RR 0.96, 95% CI 0.56 to 1.66), and study withdrawal due to adverse effects (RR 1.84, 95% CI 0.63 to 5.33)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "In individuals with endometriosis, oral progestagens compared with placebo likely reduce overall pain and dysmenorrhoea and may reduce pelvic pain. Compared with other hormonal suppression strategies, the evidence is less certain due to the small number of studies for each comparison and outcome. Despite such limitations, this update provides a comprehensive overview and valuable insights on progestagen treatment for endometriosis, emphasising the nuanced balance between efficacy, adverse effects, and patient satisfaction."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41065045/",
      "pubDate": "2025 Oct 09",
      "doi": "10.1002/14651858.CD002122.pub3",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": true,
      "summary": "Oral progestagens likely alleviate pain and dysmenorrhea in individuals with endometriosis."
    },
    {
      "id": "d0e02f3ef0db",
      "title": "Ruxolitinib Versus Best Available Therapy in Patients With Steroid-Refractory Acute Graft-Versus-Host Disease: Final Analysis From the Randomized Phase III REACH2 Trial.",
      "journal": "J Clin Oncol",
      "score": "5/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117911",
      "abstract": "Approximately 30%-50% of patients develop acute graft-versus-host disease (aGVHD) after allogeneic hematopoietic cell transplantation (Allo-HCT), representing a major limitation of this treatment. Although corticosteroids remain the standard first-line therapy for aGVHD, up to 50% of patients become steroid-refractory (SR). REACH2 is a phase III study of ruxolitinib versus best available therapy (BAT) in patients age 12 years and older with SR-aGVHD after Allo-HCT. We present the final efficacy and safety outcomes from REACH2 after 24 months of treatment. Cumulative median (range) duration of response was 167 (22-677) days with ruxolitinib and 106 (10-526) days with BAT. Median overall survival and event-free survival were 10.7 and 8.3 months for ruxolitinib, compared with 5.8 and 4.2 months, respectively, with BAT. Median failure-free survival was significantly longer with ruxolitinib than with BAT (4.86  1.02 months,  < .001). Similar numbers of nonrelapse mortality events were observed with ruxolitinib and BAT (72  71), and malignancy relapse/progression events remained low across both groups. Numerically higher chronic GVHD rates were noted with ruxolitinib than with BAT from 12 months; however, 95% confidence intervals overlapped. Safety observations were consistent with the primary analysis results. Ruxolitinib provided efficacy advantages over BAT in patients with SR-aGVHD over 24 months.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41092247/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1200/JCO-25-00809",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": true,
      "summary": "Ruxolitinib demonstrated improved efficacy, including longer duration of response, overall survival, and event-free survival, compared to best available therapy in patients with steroid-refractory acute graft-versus-host disease after allogeneic hematopoietic cell transplantation over a 24-month period."
    },
    {
      "id": "eaf17738892f",
      "title": "Effect of Intravenous, Inhalational, or Combined Anesthesia Maintenance on Postoperative Respiratory Adverse Events in Children Undergoing Adenotonsillectomy (AmPRAEC): A Multicenter Randomized Clinical Trial.",
      "journal": "Anesthesiology",
      "score": "5/7",
      "tags": [
        "Surgery - Ear Nose Throat"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117889",
      "abstract": "General anesthetic drugs may affect the risk of postoperative respiratory adverse events (PRAEs) in children, but the effect of anesthesia maintenance strategies on these events has not yet been widely validated. This study tested the hypothesis that anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone would lead to a progressive reduction in the incidence of PRAEs. This multicenter randomized clinical trial (AmPRAEC study) enrolled 760 children aged 0 to 12 yr who underwent adenotonsillectomy at 12 hospitals in China. Patients were randomly assigned to the intravenous anesthesia maintenance (IV group), the combined intravenous-inhalation anesthesia maintenance (IVIH group), or the inhalation anesthesia maintenance (IH group). Tracheal tubes were used for airway management, with all children undergoing awake extubation. The primary outcome was PRAE incidence in the postanesthesia care unit. A total of 760 children (median [interquartile range] age, 6 [4 to 7] years; 460 boys [60.5%]) were randomized, and 729 total samples were available for modified intention-to-treat analysis. The IV group had the lowest incidence of PRAEs (45 of 239 [18.8%]), followed by the IVIH group (70 of 246 [28.5%]) and the IH group (106 of 244 [43.4%]). Compared to the IH group, the IVIH group had a significantly lower risk of PRAEs (adjusted odds ratio [aOR], 0.44; 95% confidence interval [CI], 0.29 to 0.65; number needed to treat, 7). The IV group had significantly lower risk compared to both the IVIH group (aOR, 0.57; 95% CI, 0.36 to 0.90; number needed to treat, 6) and the IH group (aOR, 0.25; 95% CI, 0.16 to 0.39; number needed to treat, 3). Anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone resulted in a progressive reduction in the incidence of PRAEs. Propofol intravenous anesthesia maintenance should be considered for children undergoing adenotonsillectomy.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "General anesthetic drugs may affect the risk of postoperative respiratory adverse events (PRAEs) in children, but the effect of anesthesia maintenance strategies on these events has not yet been widely validated. This study tested the hypothesis that anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone would lead to a progressive reduction in the incidence of PRAEs."
        },
        {
          "label": "METHODS",
          "text": "This multicenter randomized clinical trial (AmPRAEC study) enrolled 760 children aged 0 to 12 yr who underwent adenotonsillectomy at 12 hospitals in China. Patients were randomly assigned to the intravenous anesthesia maintenance (IV group), the combined intravenous-inhalation anesthesia maintenance (IVIH group), or the inhalation anesthesia maintenance (IH group). Tracheal tubes were used for airway management, with all children undergoing awake extubation. The primary outcome was PRAE incidence in the postanesthesia care unit."
        },
        {
          "label": "RESULTS",
          "text": "A total of 760 children (median [interquartile range] age, 6 [4 to 7] years; 460 boys [60.5%]) were randomized, and 729 total samples were available for modified intention-to-treat analysis. The IV group had the lowest incidence of PRAEs (45 of 239 [18.8%]), followed by the IVIH group (70 of 246 [28.5%]) and the IH group (106 of 244 [43.4%]). Compared to the IH group, the IVIH group had a significantly lower risk of PRAEs (adjusted odds ratio [aOR], 0.44; 95% confidence interval [CI], 0.29 to 0.65; number needed to treat, 7). The IV group had significantly lower risk compared to both the IVIH group (aOR, 0.57; 95% CI, 0.36 to 0.90; number needed to treat, 6) and the IH group (aOR, 0.25; 95% CI, 0.16 to 0.39; number needed to treat, 3)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Anesthesia maintenance with propofol infusion in addition to inhalation anesthesia or alone resulted in a progressive reduction in the incidence of PRAEs. Propofol intravenous anesthesia maintenance should be considered for children undergoing adenotonsillectomy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40768554/",
      "pubDate": "2025 Oct 14",
      "doi": "10.1097/ALN.0000000000005707",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": true,
      "summary": "Propofol infusion during adenotonsillectomy reduces the occurrence of postoperative respiratory adverse events (PRAEs) in children."
    },
    {
      "id": "7ce77c84d5ff",
      "title": "Transcatheter Closure of Patent Foramen Ovale With a Novel Biodegradable Device: A Prospective, Multicenter, Randomized Controlled Clinical Trial.",
      "journal": "Circulation",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48650885/117876",
      "abstract": "Novel biodegradable patent foramen ovale (PFO) closure devices offer a promising therapeutic option. The efficacy and safety of the novel biodegradable devices compared with nitinol devices have not yet been investigated in a randomized clinical trial. This multicenter, randomized, noninferiority trial examined whether the novel biodegradable PFO closure device achieves comparable closure success rates as traditional nitinol devices while demonstrating disappearance of the protruding parts of the device on echocardiography. A total of 190 patients with PFO were enrolled and randomly assigned to receive either the biodegradable device (n=96) or the nitinol device (n=94). The primary efficacy end point was PFO closure success rate at 6 months postprocedure as demonstrated by contrast echocardiography. We continued to evaluate device-related complications, device disappearance on echocardiography, and closure success rates over a 24-month follow-up period. Successful PFO closure was achieved in 87 patients (90.63%) in the biodegradable device group and 86 patients (91.49%) in the nitinol device control group. The lower limit of the 95% CI of absolute difference was -8.98%, greater than the predefined noninferiority margin of -10%, confirming that the biodegradable device was not inferior to the nitinol device in terms of closure success. One patient in the trial group required surgical device removal because of intraprocedural deformation. No deaths, embolism, thrombus on the device, or erosion were observed in either group throughout the entire study period. Transthoracic echocardiography revealed that the hyperechoic area corresponding to the biodegradable device began decreasing within the first year after implantation and disappeared on echocardiography by 24 months after implantation. The novel biodegradable PFO closure device, which disappears on echocardiography within 24 months after implantation, demonstrates noninferiority to the traditional nitinol device in both efficacy and safety.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Novel biodegradable patent foramen ovale (PFO) closure devices offer a promising therapeutic option. The efficacy and safety of the novel biodegradable devices compared with nitinol devices have not yet been investigated in a randomized clinical trial."
        },
        {
          "label": "METHODS",
          "text": "This multicenter, randomized, noninferiority trial examined whether the novel biodegradable PFO closure device achieves comparable closure success rates as traditional nitinol devices while demonstrating disappearance of the protruding parts of the device on echocardiography. A total of 190 patients with PFO were enrolled and randomly assigned to receive either the biodegradable device (n=96) or the nitinol device (n=94). The primary efficacy end point was PFO closure success rate at 6 months postprocedure as demonstrated by contrast echocardiography. We continued to evaluate device-related complications, device disappearance on echocardiography, and closure success rates over a 24-month follow-up period."
        },
        {
          "label": "RESULTS",
          "text": "Successful PFO closure was achieved in 87 patients (90.63%) in the biodegradable device group and 86 patients (91.49%) in the nitinol device control group. The lower limit of the 95% CI of absolute difference was -8.98%, greater than the predefined noninferiority margin of -10%, confirming that the biodegradable device was not inferior to the nitinol device in terms of closure success. One patient in the trial group required surgical device removal because of intraprocedural deformation. No deaths, embolism, thrombus on the device, or erosion were observed in either group throughout the entire study period. Transthoracic echocardiography revealed that the hyperechoic area corresponding to the biodegradable device began decreasing within the first year after implantation and disappeared on echocardiography by 24 months after implantation."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The novel biodegradable PFO closure device, which disappears on echocardiography within 24 months after implantation, demonstrates noninferiority to the traditional nitinol device in both efficacy and safety."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41078120/",
      "pubDate": "2025 Oct 13",
      "doi": "10.1161/CIRCULATIONAHA.125.074609",
      "dateReceived": "2025-11-01T23:23:16.927Z",
      "isNew": true,
      "summary": "A biodegradable PFO closure device is as effective and safe as a traditional nitinol device."
    },
    {
      "id": "171e80714bc6",
      "title": "Modest Effects of Intensive Blood Pressure-Lowering on Quality of Life in Patients at High Cardiovascular Risk: The ESPRIT trial.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48639951/117921",
      "abstract": "Cumulative evidence supports the beneficial effects of intensive blood pressure (BP)-lowering treatment to prevent cardiovascular events and death; however, the effects of a more aggressive BP target on health-related quality of life (HRQoL) remain unclear. This study aimed to compare the effects of intensive vs standard BP-lowering treatment strategies on long-term change in HRQoL among hypertensive patients with high cardiovascular risk. The ESPRIT (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events) trial was an open-label, blinded-outcome, randomized controlled trial. Participants were randomly assigned to receive either intensive BP-lowering treatment (targeting standard office systolic blood pressure [SBP] to <120 mm Hg) or standard BP-lowering treatment (targeting office SBP to <140 mm Hg). HRQoL was assessed by using the 5-level EuroQol Five Dimensions Questionnaire (EQ-5D-5L) at baseline and the final follow-up visit. Covariance analyses were applied to evaluate the effect of treatment assignment on changes in HRQoL. The current study included 5,398 participants in the intensive treatment group and 5,406 participants in the standard treatment group. Over 3.4 years of follow-up, the EQ-5D visual analog scale scores increased by 0.56 point in the intensive treatment group and decreased by 0.50 point in the standard treatment group, resulting in a mean difference of 1.26 (95% CI: 0.55 to 1.98; P < 0.001). Compared with the standard treatment, the intensive treatment was associated with a 16% higher likelihood of meaningful improvement than worsening in EQ-5D visual analog scale (relative risk: 1.16; 95% CI: 1.04-1.30; P = 0.007). Categorical changes from baseline to the final follow-up visit in 5 domains between the 2 groups showed no statistical differences. Intensive BP treatment, targeting office SBP to <120 mm Hg, produced modest benefits to HRQoL among hypertensive patients with high cardiovascular risk. (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events [ESPRIT]; NCT04030234).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cumulative evidence supports the beneficial effects of intensive blood pressure (BP)-lowering treatment to prevent cardiovascular events and death; however, the effects of a more aggressive BP target on health-related quality of life (HRQoL) remain unclear."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study aimed to compare the effects of intensive vs standard BP-lowering treatment strategies on long-term change in HRQoL among hypertensive patients with high cardiovascular risk."
        },
        {
          "label": "METHODS",
          "text": "The ESPRIT (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events) trial was an open-label, blinded-outcome, randomized controlled trial. Participants were randomly assigned to receive either intensive BP-lowering treatment (targeting standard office systolic blood pressure [SBP] to <120 mm Hg) or standard BP-lowering treatment (targeting office SBP to <140 mm Hg). HRQoL was assessed by using the 5-level EuroQol Five Dimensions Questionnaire (EQ-5D-5L) at baseline and the final follow-up visit. Covariance analyses were applied to evaluate the effect of treatment assignment on changes in HRQoL."
        },
        {
          "label": "RESULTS",
          "text": "The current study included 5,398 participants in the intensive treatment group and 5,406 participants in the standard treatment group. Over 3.4 years of follow-up, the EQ-5D visual analog scale scores increased by 0.56 point in the intensive treatment group and decreased by 0.50 point in the standard treatment group, resulting in a mean difference of 1.26 (95% CI: 0.55 to 1.98; P < 0.001). Compared with the standard treatment, the intensive treatment was associated with a 16% higher likelihood of meaningful improvement than worsening in EQ-5D visual analog scale (relative risk: 1.16; 95% CI: 1.04-1.30; P = 0.007). Categorical changes from baseline to the final follow-up visit in 5 domains between the 2 groups showed no statistical differences."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Intensive BP treatment, targeting office SBP to <120 mm Hg, produced modest benefits to HRQoL among hypertensive patients with high cardiovascular risk. (Effects of Intensive Systolic Blood Pressure Lowering Treatment in Reducing Risk of Vascular Events [ESPRIT]; NCT04030234)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41105075/",
      "pubDate": "2025 Jul 25",
      "doi": "10.1016/j.jacc.2025.06.010",
      "dateReceived": "2025-10-31T23:23:33.864Z",
      "isNew": false,
      "summary": "Intensive blood pressure control to below 120 mm Hg slightly improved health-related quality of life in high-risk hypertensive patients."
    },
    {
      "id": "d0773fdb2b5e",
      "title": "Effectiveness of Exercise in Older Adults Discharged From the ER After Minor Injuries: The CEDeComS Stepped-Wedge Trial.",
      "journal": "J Am Geriatr Soc",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48734199/117995",
      "abstract": "Older adults consulting Emergency Departments (EDs) for minor injuries are at risk for new functional impairments in the 6 months following their injuries. To compare the effects of exercise programs versus usual ED practices on functional status and physical performance at 3-6 months in at-risk older adults with minor injuries. Stepped-wedge randomized trial in six Canadian EDs from 2017 to 2020. Participants aged ≥ 65 years were screened for low, moderate, or high risk of functional decline and assessed three times: baseline at ED, 3 and 6 months. Multicomponent (flexibility, balance, strengthening, aerobic) and risk-level adapted exercise programs targeting moderate- and high-risk patients, 3×/week for 12 weeks, at home or in community groups. Usual ED care. Functional decline was defined as a 2/28-point loss from baseline on the Older Americans Resources and Services (OARS) scale. Basic physical performance (leg strength, balance, walking speed) was measured using the Short Physical Performance Battery (SPPB) test. Generalized linear mixed log-binomial regressions were used to examine the effects of the intervention on outcomes compared to usual ED care, stratified by risk level. The intervention and control phases included 277 and 205 moderate-risk individuals, and 249 and 128 high-risk individuals, respectively. Among moderate-risk individuals, functional loss in intervention participants at 3 months was half that of controls: 12% [95% CI: 8%-17%] vs. 25% [95% CI: 18%-34%], RR: 0.48 [0.26, 0.90]. 12-week multicomponent exercises implemented early after minor injuries are associated with lower proportions of functional decline at 3 months in moderate-risk seniors and may help those at high risk recover some physical performance. ClinicalTrials.gov, ID Cedecoms NCT03991598.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Older adults consulting Emergency Departments (EDs) for minor injuries are at risk for new functional impairments in the 6 months following their injuries."
        },
        {
          "label": "OBJECTIVE",
          "text": "To compare the effects of exercise programs versus usual ED practices on functional status and physical performance at 3-6 months in at-risk older adults with minor injuries."
        },
        {
          "label": "DESIGN AND SETTINGS",
          "text": "Stepped-wedge randomized trial in six Canadian EDs from 2017 to 2020. Participants aged ≥ 65 years were screened for low, moderate, or high risk of functional decline and assessed three times: baseline at ED, 3 and 6 months."
        },
        {
          "label": "INTERVENTION AND MEASURES",
          "text": "Multicomponent (flexibility, balance, strengthening, aerobic) and risk-level adapted exercise programs targeting moderate- and high-risk patients, 3×/week for 12 weeks, at home or in community groups."
        },
        {
          "label": "CONTROL",
          "text": "Usual ED care."
        },
        {
          "label": "MEASURES",
          "text": "Functional decline was defined as a 2/28-point loss from baseline on the Older Americans Resources and Services (OARS) scale. Basic physical performance (leg strength, balance, walking speed) was measured using the Short Physical Performance Battery (SPPB) test. Generalized linear mixed log-binomial regressions were used to examine the effects of the intervention on outcomes compared to usual ED care, stratified by risk level."
        },
        {
          "label": "RESULTS",
          "text": "The intervention and control phases included 277 and 205 moderate-risk individuals, and 249 and 128 high-risk individuals, respectively. Among moderate-risk individuals, functional loss in intervention participants at 3 months was half that of controls: 12% [95% CI: 8%-17%] vs. 25% [95% CI: 18%-34%], RR: 0.48 [0.26, 0.90]."
        },
        {
          "label": "CONCLUSION",
          "text": "12-week multicomponent exercises implemented early after minor injuries are associated with lower proportions of functional decline at 3 months in moderate-risk seniors and may help those at high risk recover some physical performance."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov, ID Cedecoms NCT03991598."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41116303/",
      "pubDate": "2025 Oct 20",
      "doi": "10.1111/jgs.70166",
      "dateReceived": "2025-10-31T23:23:33.863Z",
      "isNew": false,
      "summary": "Early multicomponent exercise after minor injuries in seniors reduces functional decline at 3 months in moderate-risk individuals and may improve physical performance in high-risk individuals."
    },
    {
      "id": "1b7cde5dd7c9",
      "title": "Eltrombopag for Newly Diagnosed Pediatric Immune Thrombocytopenia Requiring Treatment: The PINES Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/117950",
      "abstract": "Eltrombopag, a thrombopoietin receptor agonist, is approved by the US Food and Drug Administration for children with chronic immune thrombocytopenia. Efficacy of eltrombopag during the newly diagnosed phase of pediatric immune thrombocytopenia is unknown. To determine if the proportion of patients with a platelet response is significantly greater in patients with newly diagnosed immune thrombocytopenia treated with eltrombopag than in those treated with standard therapy (first-line treatments). This phase 3, randomized clinical trial enrolled patients (aged 1-<18 years) with newly diagnosed primary immune thrombocytopenia (platelet count <30 × 109/L who required pharmacological treatment but did not have severe bleeding or need a rapid increase in platelet count) from May 7, 2019, to January 25, 2024, at 23 centers participating in the Pediatric ITP Consortium of North America. Final follow-up occurred on February 26, 2025. Eltrombopag was administered orally based on a standard dosing schedule (n = 78) vs standard therapy (investigator choice of glucocorticoids, intravenous immunoglobulin, or anti-D immunoglobulin) (n = 40). The primary outcome was a sustained platelet response defined as 3 or more of 4 platelet counts greater than 50 × 109/L during weeks 6 to 12 without rescue treatment. The secondary outcomes included bleeding scores, change in health-related quality of life, and serious adverse events. Of 118 pediatric patients (median age, 8 years [IQR, 4-12 years]; 49% were male), 63% experienced an initial treatment failure after observation or medical therapy. Enrollment ended after a planned interim analysis met a prespecified threshold for efficacy. Of 71 patients in the eltrombopag group, 46 (65% [95% CI, 54%-76%]) had a sustained platelet response compared with 13 of 37 patients (35% [95% CI, 20%-51%]) in the standard therapy group (between-group difference, 30% [95% CI, 11%-49%]; P = .002), which crossed the monitoring boundary for efficacy. Overall, there was no between-group difference in the number and type of adverse events. In pediatric patients with newly diagnosed immune thrombocytopenia requiring pharmacological treatment, eltrombopag resulted in a higher rate of sustained platelet response compared with standard therapy. Eltrombopag may be an effective option for pediatric patients with newly diagnosed immune thrombocytopenia with nonsevere bleeding who warrant medical intervention. ClinicalTrials.gov Identifier: NCT03939637.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Eltrombopag, a thrombopoietin receptor agonist, is approved by the US Food and Drug Administration for children with chronic immune thrombocytopenia. Efficacy of eltrombopag during the newly diagnosed phase of pediatric immune thrombocytopenia is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine if the proportion of patients with a platelet response is significantly greater in patients with newly diagnosed immune thrombocytopenia treated with eltrombopag than in those treated with standard therapy (first-line treatments)."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This phase 3, randomized clinical trial enrolled patients (aged 1-<18 years) with newly diagnosed primary immune thrombocytopenia (platelet count <30 × 109/L who required pharmacological treatment but did not have severe bleeding or need a rapid increase in platelet count) from May 7, 2019, to January 25, 2024, at 23 centers participating in the Pediatric ITP Consortium of North America. Final follow-up occurred on February 26, 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Eltrombopag was administered orally based on a standard dosing schedule (n = 78) vs standard therapy (investigator choice of glucocorticoids, intravenous immunoglobulin, or anti-D immunoglobulin) (n = 40)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was a sustained platelet response defined as 3 or more of 4 platelet counts greater than 50 × 109/L during weeks 6 to 12 without rescue treatment. The secondary outcomes included bleeding scores, change in health-related quality of life, and serious adverse events."
        },
        {
          "label": "RESULTS",
          "text": "Of 118 pediatric patients (median age, 8 years [IQR, 4-12 years]; 49% were male), 63% experienced an initial treatment failure after observation or medical therapy. Enrollment ended after a planned interim analysis met a prespecified threshold for efficacy. Of 71 patients in the eltrombopag group, 46 (65% [95% CI, 54%-76%]) had a sustained platelet response compared with 13 of 37 patients (35% [95% CI, 20%-51%]) in the standard therapy group (between-group difference, 30% [95% CI, 11%-49%]; P = .002), which crossed the monitoring boundary for efficacy. Overall, there was no between-group difference in the number and type of adverse events."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In pediatric patients with newly diagnosed immune thrombocytopenia requiring pharmacological treatment, eltrombopag resulted in a higher rate of sustained platelet response compared with standard therapy. Eltrombopag may be an effective option for pediatric patients with newly diagnosed immune thrombocytopenia with nonsevere bleeding who warrant medical intervention."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT03939637."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123939/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1001/jama.2025.18168",
      "dateReceived": "2025-10-30T23:23:37.336Z",
      "isNew": false,
      "summary": "Eltrombopag is more effective than standard therapy in achieving a sustained platelet response in children newly diagnosed with immune thrombocytopenia needing treatment."
    },
    {
      "id": "8ff2fd4cb947",
      "title": "ERS/EULAR clinical practice guidelines for connective tissue diseases associated interstitial lung disease.",
      "journal": "Ann Rheum Dis",
      "score": "6/7",
      "tags": [
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/117943",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41077478/",
      "pubDate": "2025 Oct 11",
      "doi": "10.1016/j.ard.2025.09.006",
      "dateReceived": "2025-10-30T23:23:37.336Z",
      "isNew": false
    },
    {
      "id": "a009e18069a6",
      "title": "Anti-CD38 monoclonal antibody CM313 for primary immune thrombocytopenia: multicentre, randomised, placebo controlled, phase 2 trial.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/117937",
      "abstract": "To assess the efficacy and safety of CM313, an anti-CD38 monoclonal antibody, in adults with persistent or chronic primary immune thrombocytopenia. Multicentre, randomised, placebo controlled, phase 2 trial. Five hospitals in China, 16 January to 11 June 2024. 45 patients aged ≥18 years with persistent or chronic immune thrombocytopenia who failed to respond to, or relapsed after, glucocorticoid treatment but had previously responded to standard first line treatment. Patients were randomised to receive intravenous CM313 (16 mg/kg) or placebo weekly for eight weeks. The primary outcome was overall response rate (at least two consecutive platelet counts ≥30×10/L, a minimum doubling from baseline, and no bleeding) at week 8. A secondary outcome was time to the first two consecutive platelet counts ≥50×10/L. Of 56 patients screened, 45 were randomised to receive CM313 (n=30) or placebo (n=15). At week 8, the overall response rate was higher in the CM313 group (83%; 25/30) compared with placebo group (20%; 3/15): difference 63.3% (95% confidence interval 33.7% to 81.3%; P<0.001). The median time to a platelet count of ≥50×10/L was one week in the CM313 group but was not reached in the placebo group (P<0.001). The median cumulative response duration for platelet counts ≥50×10/L was 18 weeks in the CM313 group versus three weeks in the placebo group (P=0.004). Treatment emergent adverse events occurred in 87% (26/30) of patients in the CM313 group and 80% (12/15) in the placebo group, with infusion related reactions and petechiae being the most common. CM313 showed a favourable safety profile and encouraging efficacy in adults with persistent or chronic primary immune thrombocytopenia, characterised by rapid increase in platelet count, sustained platelet responses, and manageable adverse events. ClinicalTrials.gov NCT06199089.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of CM313, an anti-CD38 monoclonal antibody, in adults with persistent or chronic primary immune thrombocytopenia."
        },
        {
          "label": "DESIGN",
          "text": "Multicentre, randomised, placebo controlled, phase 2 trial."
        },
        {
          "label": "SETTING",
          "text": "Five hospitals in China, 16 January to 11 June 2024."
        },
        {
          "label": "PARTICIPANTS",
          "text": "45 patients aged ≥18 years with persistent or chronic immune thrombocytopenia who failed to respond to, or relapsed after, glucocorticoid treatment but had previously responded to standard first line treatment."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomised to receive intravenous CM313 (16 mg/kg) or placebo weekly for eight weeks."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "The primary outcome was overall response rate (at least two consecutive platelet counts ≥30×10/L, a minimum doubling from baseline, and no bleeding) at week 8. A secondary outcome was time to the first two consecutive platelet counts ≥50×10/L."
        },
        {
          "label": "RESULTS",
          "text": "Of 56 patients screened, 45 were randomised to receive CM313 (n=30) or placebo (n=15). At week 8, the overall response rate was higher in the CM313 group (83%; 25/30) compared with placebo group (20%; 3/15): difference 63.3% (95% confidence interval 33.7% to 81.3%; P<0.001). The median time to a platelet count of ≥50×10/L was one week in the CM313 group but was not reached in the placebo group (P<0.001). The median cumulative response duration for platelet counts ≥50×10/L was 18 weeks in the CM313 group versus three weeks in the placebo group (P=0.004). Treatment emergent adverse events occurred in 87% (26/30) of patients in the CM313 group and 80% (12/15) in the placebo group, with infusion related reactions and petechiae being the most common."
        },
        {
          "label": "CONCLUSION",
          "text": "CM313 showed a favourable safety profile and encouraging efficacy in adults with persistent or chronic primary immune thrombocytopenia, characterised by rapid increase in platelet count, sustained platelet responses, and manageable adverse events."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov NCT06199089."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41120215/",
      "pubDate": "2025 Oct 21",
      "doi": "10.1136/bmj-2025-084314",
      "dateReceived": "2025-10-30T23:23:37.336Z",
      "isNew": false,
      "summary": "CM313 demonstrated a safe and effective treatment for adults with persistent or chronic primary immune thrombocytopenia, leading to increased and sustained platelet counts with manageable side effects."
    },
    {
      "id": "cacda27f6dc8",
      "title": "Effectiveness of SARS-CoV-2 testing strategies inreducing COVID-19 cases, hospitalisations, and deaths.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48626885/117875",
      "dateReceived": "2025-10-30T23:23:37.336Z",
      "isNew": false
    },
    {
      "id": "0b974bcdcf37",
      "title": "Comparative Efficacy of Advanced Therapies for Management of Moderate-to-Severe Crohn`s Disease: 2025 AGA Evidence Synthesis.",
      "journal": "Gastroenterology",
      "score": "6/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48718301/118015",
      "abstract": "We performed an updated systematic review and network meta-analysis to inform the 2025 American Gastroenterological Association Clinical Guidelines on the management of moderate-to-severe Crohn's disease (CD). We searched multiple electronic databases from inception through August 14, 2024, to identify randomized controlled trials in adults with moderate-to-severe CD, comparing advanced therapies (eg, tumor necrosis factor antagonists, vedolizumab, interleukin 12/23, or interleukin 23p19 antagonists, and/or Janus kinase inhibitors) with placebo or another active comparator. Our primary outcomes were induction and maintenance of clinical remission; analyses were stratified by biologic therapy exposure status. We performed a network meta-analysis using a frequentist approach and applied the Grading of Recommendations, Assessment, Development and Evaluation to appraise certainty of evidence. We identified 28 trials of induction therapy and 22 trials of maintenance therapy of advanced therapies in patients with moderate-to-severe CD. In biologic-naïve patients, moderate-to-high certainty evidence supported the use of infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, and guselkumab, and low certainty evidence supported the use of certolizumab pegol and upadacitinib over no treatment for inducing remission. Among active comparators, moderate-to-high certainty evidence supported the use of adalimumab and ustekinumab compared with certolizumab pegol and upadacitinib. Among patients with prior exposure to biologics, moderate-to-high certainty evidence supported the use of adalimumab, ustekinumab, risankizumab, guselkumab, and upadacitinib, and low certainty evidence supported the use of vedolizumab and mirikizumab, over no treatment, for inducing remission. Among active comparators, moderate certainty evidence supported the use of risankizumab and guselkumab compared with vedolizumab and ustekinumab. Using Grading of Recommendations, Assessment, Development and Evaluation to appraise quality of evidence, this updated network meta-analysis can inform positioning of advanced therapies for the treatment of biologic-naïve and biologic-exposed patients with moderate-to-severe CD.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "We performed an updated systematic review and network meta-analysis to inform the 2025 American Gastroenterological Association Clinical Guidelines on the management of moderate-to-severe Crohn's disease (CD)."
        },
        {
          "label": "METHODS",
          "text": "We searched multiple electronic databases from inception through August 14, 2024, to identify randomized controlled trials in adults with moderate-to-severe CD, comparing advanced therapies (eg, tumor necrosis factor antagonists, vedolizumab, interleukin 12/23, or interleukin 23p19 antagonists, and/or Janus kinase inhibitors) with placebo or another active comparator. Our primary outcomes were induction and maintenance of clinical remission; analyses were stratified by biologic therapy exposure status. We performed a network meta-analysis using a frequentist approach and applied the Grading of Recommendations, Assessment, Development and Evaluation to appraise certainty of evidence."
        },
        {
          "label": "RESULTS",
          "text": "We identified 28 trials of induction therapy and 22 trials of maintenance therapy of advanced therapies in patients with moderate-to-severe CD. In biologic-naïve patients, moderate-to-high certainty evidence supported the use of infliximab, adalimumab, vedolizumab, ustekinumab, risankizumab, mirikizumab, and guselkumab, and low certainty evidence supported the use of certolizumab pegol and upadacitinib over no treatment for inducing remission. Among active comparators, moderate-to-high certainty evidence supported the use of adalimumab and ustekinumab compared with certolizumab pegol and upadacitinib. Among patients with prior exposure to biologics, moderate-to-high certainty evidence supported the use of adalimumab, ustekinumab, risankizumab, guselkumab, and upadacitinib, and low certainty evidence supported the use of vedolizumab and mirikizumab, over no treatment, for inducing remission. Among active comparators, moderate certainty evidence supported the use of risankizumab and guselkumab compared with vedolizumab and ustekinumab."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Using Grading of Recommendations, Assessment, Development and Evaluation to appraise quality of evidence, this updated network meta-analysis can inform positioning of advanced therapies for the treatment of biologic-naïve and biologic-exposed patients with moderate-to-severe CD."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41114682/",
      "pubDate": "2025 Oct 20",
      "doi": "10.1053/j.gastro.2025.08.032",
      "dateReceived": "2025-10-30T23:23:37.335Z",
      "isNew": false,
      "summary": "This network meta-analysis provides evidence to guide the use of advanced therapies for Crohn's disease in patients new to biologics and those who have previously used them."
    },
    {
      "id": "64dd5a83f176",
      "title": "Efficacy of vaginal mussel adhesive protein for treating postmenopausal vulvovaginal atrophy.",
      "journal": "Age Ageing",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Gynecology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48705294/117925",
      "abstract": "To compare the efficacy and safety of the vaginal mussel adhesive protein (MAP) hydrogel with the promestriene or the placebo hydrogel for treating moderate-to-severe postmenopausal vulvovaginal atrophy (VVA) symptoms. This 12-week randomised clinical trial enrolled postmenopausal women with moderate-to-severe VVA to receive treatment with MAP, promestriene or placebo hydrogel. The primary outcome was the decrease in severity of most bothersome symptom (MBS) between baseline and 12 weeks. Additional measures included a composite vaginal symptom index, vaginal health index, female sexual function index (FSFI) score, vaginal pH, vaginal maturation value, vaginal microecology, treatment satisfaction, meaningful benefit and treatment safety. We recruited 105 participants, and 96 provided data for the study analysis. Three treatments had similar mean reductions in MBS severity over 12 weeks: MAP, -1.72 (95% CI, -1.91 to -1.53); promestriene, -1.55 (95% CI, -1.86 to -1.24) and placebo, -1.71 (95% CI, -1.95 to -1.48). Compared to the placebo, the MAP significantly improved the Satisfaction (P = .003) of the FSFI. In addition, the MAP and promestriene improved the vaginal microecology significantly. Adjusted for age and year after menopause, the mean reductions in MBS and the mean improvements in FSFI of MAP were comparable with promestriene (MBS, P = .410; FSFI, P = .233) but greater than the placebo (MBS, P = .028; FSFI, P = .046). After adjusting for age and year after menopause, MAP demonstrates comparable efficacy to promestriene but superior effectiveness to placebo in alleviating postmenopausal vulvovaginal symptoms.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To compare the efficacy and safety of the vaginal mussel adhesive protein (MAP) hydrogel with the promestriene or the placebo hydrogel for treating moderate-to-severe postmenopausal vulvovaginal atrophy (VVA) symptoms."
        },
        {
          "label": "METHODS",
          "text": "This 12-week randomised clinical trial enrolled postmenopausal women with moderate-to-severe VVA to receive treatment with MAP, promestriene or placebo hydrogel. The primary outcome was the decrease in severity of most bothersome symptom (MBS) between baseline and 12 weeks. Additional measures included a composite vaginal symptom index, vaginal health index, female sexual function index (FSFI) score, vaginal pH, vaginal maturation value, vaginal microecology, treatment satisfaction, meaningful benefit and treatment safety."
        },
        {
          "label": "RESULTS",
          "text": "We recruited 105 participants, and 96 provided data for the study analysis. Three treatments had similar mean reductions in MBS severity over 12 weeks: MAP, -1.72 (95% CI, -1.91 to -1.53); promestriene, -1.55 (95% CI, -1.86 to -1.24) and placebo, -1.71 (95% CI, -1.95 to -1.48). Compared to the placebo, the MAP significantly improved the Satisfaction (P = .003) of the FSFI. In addition, the MAP and promestriene improved the vaginal microecology significantly. Adjusted for age and year after menopause, the mean reductions in MBS and the mean improvements in FSFI of MAP were comparable with promestriene (MBS, P = .410; FSFI, P = .233) but greater than the placebo (MBS, P = .028; FSFI, P = .046)."
        },
        {
          "label": "CONCLUSION",
          "text": "After adjusting for age and year after menopause, MAP demonstrates comparable efficacy to promestriene but superior effectiveness to placebo in alleviating postmenopausal vulvovaginal symptoms."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41066676/",
      "pubDate": "2025 Aug 29",
      "doi": "10.1093/ageing/afaf288",
      "dateReceived": "2025-10-29T23:24:30.175Z",
      "isNew": false,
      "summary": "MAP is as effective as promestriene but more effective than placebo in treating postmenopausal vulvovaginal symptoms."
    },
    {
      "id": "fbbfa11049e7",
      "title": "Mycophenolate Mofetil versus Cyclophosphamide for Initial Therapy in Childhood-Onset Proliferative Lupus Nephritis: A Prospective, Multicenter, Randomized Trial.",
      "journal": "J Am Soc Nephrol",
      "score": "6/7",
      "tags": [
        "Pediatrics (General)",
        "Rheumatology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48705294/117891",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40938672/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1681/ASN.0000000866",
      "dateReceived": "2025-10-29T23:24:30.175Z",
      "isNew": false
    },
    {
      "id": "6c84da312979",
      "title": "Open-Label Placebos as Adjunct for the Preventive Treatment of Migraine: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Neurology",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48617366/117895",
      "dateReceived": "2025-10-29T23:24:30.175Z",
      "isNew": false
    },
    {
      "id": "528ccfe50aaa",
      "title": "A Hybrid Chatbot to Promote Pneumococcal Vaccination Among Older Adults: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48617366/117872",
      "abstract": "There are few robust evaluations assessing the efficacy of chatbots to improve pneumococcal vaccination (PV) uptake among adults 65 years of age or older. To evaluate the relative efficacy of a hybrid chatbot in increasing PV uptake among Hong Kong residents aged 65 years or older. This partially masked, parallel-group randomized clinical trial was conducted between May 1, 2023, and November 30, 2024 in Hong Kong, China. Participants were aged 65 years or older, had a Hong Kong identity card, could speak and comprehend Cantonese, were smartphone and WhatsApp users, and had no prior PV uptake. Participants were recruited through random telephone calls and were randomized to either the stage of change group or the standard intervention group. In the stage of change group, the rule-based component of the hybrid chatbot assessed participants' stage of change regarding PV uptake and then delivered stage of change-tailored interventions at months 0, 1, 2, and 3. The natural language processing component of the hybrid chatbot provided real-time answers to participants' PV-related questions. In the standard intervention group, the chatbot sent participants a link to access a standard online video covering PV information at months 0, 1, 2, and 3. The primary outcome was self-reported PV uptake at month 12, which was validated by the research team. The secondary outcome was participants' stage of change measured at month 0 and month 12 by using validated questions, with a score of 1 = precontemplation, 2 = contemplation, 3 = preparation, and 4 = action. A total of 374 participants (213 female [57.0%]; mean [SD] age, 69.6 [3.1] years) were randomized to either the stage of change group (n = 187) or the standard intervention group (n = 187). The intention-to-treat analysis showed that the validated PV uptake rate was higher in the stage of change group than in the standard intervention group (29.4% vs 18.7%; P = .01). The mean (SD) stage of change score was higher in the stage of change group than in the standard intervention group (2.2 [1.3] vs 1.9 [1.1]; P = .02). More participants in the stage of change group than in the standard intervention group completed at least 1 intervention session (79.7% vs 57.8%; P < .001). In this randomized clinical trial, the hybrid chatbot was more efficacious than the standard intervention in increasing PV uptake among older adults in Hong Kong. A hybrid chatbot may be a sustainable PV promotion for older adults. ClinicalTrials.gov Identifier: NCT05772117.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There are few robust evaluations assessing the efficacy of chatbots to improve pneumococcal vaccination (PV) uptake among adults 65 years of age or older."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the relative efficacy of a hybrid chatbot in increasing PV uptake among Hong Kong residents aged 65 years or older."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This partially masked, parallel-group randomized clinical trial was conducted between May 1, 2023, and November 30, 2024 in Hong Kong, China. Participants were aged 65 years or older, had a Hong Kong identity card, could speak and comprehend Cantonese, were smartphone and WhatsApp users, and had no prior PV uptake. Participants were recruited through random telephone calls and were randomized to either the stage of change group or the standard intervention group."
        },
        {
          "label": "INTERVENTIONS",
          "text": "In the stage of change group, the rule-based component of the hybrid chatbot assessed participants' stage of change regarding PV uptake and then delivered stage of change-tailored interventions at months 0, 1, 2, and 3. The natural language processing component of the hybrid chatbot provided real-time answers to participants' PV-related questions. In the standard intervention group, the chatbot sent participants a link to access a standard online video covering PV information at months 0, 1, 2, and 3."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was self-reported PV uptake at month 12, which was validated by the research team. The secondary outcome was participants' stage of change measured at month 0 and month 12 by using validated questions, with a score of 1 = precontemplation, 2 = contemplation, 3 = preparation, and 4 = action."
        },
        {
          "label": "RESULTS",
          "text": "A total of 374 participants (213 female [57.0%]; mean [SD] age, 69.6 [3.1] years) were randomized to either the stage of change group (n = 187) or the standard intervention group (n = 187). The intention-to-treat analysis showed that the validated PV uptake rate was higher in the stage of change group than in the standard intervention group (29.4% vs 18.7%; P = .01). The mean (SD) stage of change score was higher in the stage of change group than in the standard intervention group (2.2 [1.3] vs 1.9 [1.1]; P = .02). More participants in the stage of change group than in the standard intervention group completed at least 1 intervention session (79.7% vs 57.8%; P < .001)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, the hybrid chatbot was more efficacious than the standard intervention in increasing PV uptake among older adults in Hong Kong. A hybrid chatbot may be a sustainable PV promotion for older adults."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05772117."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41060654/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1001/jamanetworkopen.2025.35813",
      "dateReceived": "2025-10-29T23:24:30.175Z",
      "isNew": false,
      "summary": "A hybrid chatbot was more effective than standard methods in increasing pneumococcal vaccination uptake in older adults, suggesting its potential as a sustainable promotion strategy."
    },
    {
      "id": "9b6d7dd01329",
      "title": "Long-Term Effect of ICDs in Nonischemic Heart Failure With Reduced Ejection Fraction: Extended Follow-Up Analysis of DANISH.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48705294/117959",
      "abstract": "The most common causes of death may change over time in heart failure with reduced ejection fraction (HFrEF). These shifts can influence the risk-benefit balance of interventions such as implantable cardioverter-defibrillators (ICDs), which are designed to prevent sudden cardiac death. Long-term follow-up is therefore essential to determine whether early benefits are sustained, attenuated, or lost over time. This study sought to examine the long-term effect of primary prevention ICD implantation, compared with usual clinical care, in patients with nonischemic HFrEF enrolled in the DANISH (Danish Study To Assess the Efficacy of ICDs in Patients With Nonischemic Systolic Heart Failure on Mortality) trial. The DANISH trial enrolled 1,116 patients with nonischemic HFrEF, left ventricular ejection fraction ≤35%, NYHA functional class II-III (class IV if cardiac resynchronization therapy was planned), and elevated natriuretic peptide levels. The primary outcome was all-cause death, and secondary outcomes were cardiovascular death and sudden cardiovascular death. In this study with extended follow-up, patients were followed until death or January 31, 2024, whichever came first. During a median follow-up of 13.2 years (Q1-Q3: 11.6-14.6 years), 294 patients (52.9%) in the ICD group and 299 (53.4%) in the control group died. Compared with usual clinical care, ICD implantation did not significantly reduce the long-term rate of all-cause death (HR: 0.96; 95% CI: 0.82-1.13), but it did reduce the long-term rate of sudden cardiovascular death (HR: 0.54; 95% CI: 0.36-0.80). The effect of ICD implantation on all-cause death was consistent regardless of age (P = 0.89). However, age significantly modified the effect of ICD implantation on sudden cardiovascular death, such that ICD implantation reduced the rate of this outcome in patients ≤70 years (HR: 0.38; 95% CI: 0.23-0.62), but not in those >70 years (HR: 1.27; 95% CI: 0.56-2.89; P = 0.01). Similar trends were observed when age was analyzed as a continuous variable. The effect of ICD implantation was generally consistent across other key subgroups, including cardiac resynchronization therapy use at baseline. In patients with nonischemic HFrEF, during a median follow-up of 13.2 years, primary prevention ICD implantation did not reduce all-cause death, but it did reduce sudden cardiovascular death, and younger individuals appeared to derive a greater benefit. (Danish ICD Study in Patients With Dilated Cardiomyopathy [DANISH]; NCT00542945).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The most common causes of death may change over time in heart failure with reduced ejection fraction (HFrEF). These shifts can influence the risk-benefit balance of interventions such as implantable cardioverter-defibrillators (ICDs), which are designed to prevent sudden cardiac death. Long-term follow-up is therefore essential to determine whether early benefits are sustained, attenuated, or lost over time."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study sought to examine the long-term effect of primary prevention ICD implantation, compared with usual clinical care, in patients with nonischemic HFrEF enrolled in the DANISH (Danish Study To Assess the Efficacy of ICDs in Patients With Nonischemic Systolic Heart Failure on Mortality) trial."
        },
        {
          "label": "METHODS",
          "text": "The DANISH trial enrolled 1,116 patients with nonischemic HFrEF, left ventricular ejection fraction ≤35%, NYHA functional class II-III (class IV if cardiac resynchronization therapy was planned), and elevated natriuretic peptide levels. The primary outcome was all-cause death, and secondary outcomes were cardiovascular death and sudden cardiovascular death. In this study with extended follow-up, patients were followed until death or January 31, 2024, whichever came first."
        },
        {
          "label": "RESULTS",
          "text": "During a median follow-up of 13.2 years (Q1-Q3: 11.6-14.6 years), 294 patients (52.9%) in the ICD group and 299 (53.4%) in the control group died. Compared with usual clinical care, ICD implantation did not significantly reduce the long-term rate of all-cause death (HR: 0.96; 95% CI: 0.82-1.13), but it did reduce the long-term rate of sudden cardiovascular death (HR: 0.54; 95% CI: 0.36-0.80). The effect of ICD implantation on all-cause death was consistent regardless of age (P = 0.89). However, age significantly modified the effect of ICD implantation on sudden cardiovascular death, such that ICD implantation reduced the rate of this outcome in patients ≤70 years (HR: 0.38; 95% CI: 0.23-0.62), but not in those >70 years (HR: 1.27; 95% CI: 0.56-2.89; P = 0.01). Similar trends were observed when age was analyzed as a continuous variable. The effect of ICD implantation was generally consistent across other key subgroups, including cardiac resynchronization therapy use at baseline."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with nonischemic HFrEF, during a median follow-up of 13.2 years, primary prevention ICD implantation did not reduce all-cause death, but it did reduce sudden cardiovascular death, and younger individuals appeared to derive a greater benefit. (Danish ICD Study in Patients With Dilated Cardiomyopathy [DANISH]; NCT00542945)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123523/",
      "pubDate": "2025 Oct 11",
      "doi": "10.1016/j.jacc.2025.08.089",
      "dateReceived": "2025-10-29T23:24:30.174Z",
      "isNew": false,
      "summary": "In patients with nonischemic HFrEF, primary prevention ICD implantation reduced sudden cardiovascular death but did not reduce all-cause death, with potentially greater benefit in younger individuals."
    },
    {
      "id": "da9abad01010",
      "title": "Histological efficacy of anti-diabetic agents in MASH and the mediating role of weight loss: A network meta-analysis.",
      "journal": "Diabetes Obes Metab",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117924",
      "abstract": "Metabolic dysfunction-associated steatohepatitis (MASH) is a progressive liver disease with rising global prevalence, closely linked to type 2 diabetes. While several anti-diabetic agents show promise, a comprehensive analysis comparing their efficacy on biopsy-confirmed histological outcomes, including dose-dependent effects and the mediating role of weight loss, remains unexplored. A frequentist random-effects network meta-analysis (NMA) was conducted to explore histological efficacy of anti-diabetic agents in biopsy-confirmed MASH without cirrhosis. The primary outcome was fibrosis improvement (≥1 stage) without worsening steatohepatitis; the secondary outcome was MASH resolution without fibrosis worsening. Incretin-based agents were dose-stratified. Treatment ranking used surface-under the cumulative-ranking curve (SUCRA). Meta-regression investigated the impact of percentage weight loss and baseline covariates on the proportion of individuals achieving histological end-points. Data from five RCTs (N = 1667) were included. All active treatments, including Dapagliflozin 10 mg, Survodutide (2.4 mg/wk, 4.8-6 mg/wk), Tirzepatide (5 mg/wk, 10-15 mg/wk), and Semaglutide (0.7-1.4 mg/wk, 2.4 or 2.8 mg/wk), improved fibrosis versus placebo (I = 0%). For MASH resolution, dose-dependent effects led to significant heterogeneity (I = 73%), with lower-dose Semaglutide demonstrating no benefits and Dapagliflozin showing benefits in the F2-F3 subgroup only on sensitivity analysis. Survodutide exhibited the highest ranking (SUCRA = 0.822-0.849), followed by Tirzepatide (SUCRA = 0.622-0.681) and higher-dose Semaglutide (SUCRA = 0.327) for MASH resolution. Meta-regression using data from 16 interventions, including placebo arms, showed that weight loss significantly explained heterogeneity in treatment effects on fibrosis improvement (R = 54.26%) and MASH resolution (R = 78.16%). SGLT2 inhibitor and incretin-based agents improved fibrosis in MASH, with weight loss being a significant mediator. Targeting multiple incretin pathways, especially involving glucagon receptors, may offer greater MASH resolution. Dose-dependent effects were more prominent for MASH resolution than fibrosis improvement, indicating potential weight-loss-independent anti-fibrotic pathways.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Metabolic dysfunction-associated steatohepatitis (MASH) is a progressive liver disease with rising global prevalence, closely linked to type 2 diabetes. While several anti-diabetic agents show promise, a comprehensive analysis comparing their efficacy on biopsy-confirmed histological outcomes, including dose-dependent effects and the mediating role of weight loss, remains unexplored."
        },
        {
          "label": "METHODS",
          "text": "A frequentist random-effects network meta-analysis (NMA) was conducted to explore histological efficacy of anti-diabetic agents in biopsy-confirmed MASH without cirrhosis. The primary outcome was fibrosis improvement (≥1 stage) without worsening steatohepatitis; the secondary outcome was MASH resolution without fibrosis worsening. Incretin-based agents were dose-stratified. Treatment ranking used surface-under the cumulative-ranking curve (SUCRA). Meta-regression investigated the impact of percentage weight loss and baseline covariates on the proportion of individuals achieving histological end-points."
        },
        {
          "label": "RESULTS",
          "text": "Data from five RCTs (N = 1667) were included. All active treatments, including Dapagliflozin 10 mg, Survodutide (2.4 mg/wk, 4.8-6 mg/wk), Tirzepatide (5 mg/wk, 10-15 mg/wk), and Semaglutide (0.7-1.4 mg/wk, 2.4 or 2.8 mg/wk), improved fibrosis versus placebo (I = 0%). For MASH resolution, dose-dependent effects led to significant heterogeneity (I = 73%), with lower-dose Semaglutide demonstrating no benefits and Dapagliflozin showing benefits in the F2-F3 subgroup only on sensitivity analysis. Survodutide exhibited the highest ranking (SUCRA = 0.822-0.849), followed by Tirzepatide (SUCRA = 0.622-0.681) and higher-dose Semaglutide (SUCRA = 0.327) for MASH resolution. Meta-regression using data from 16 interventions, including placebo arms, showed that weight loss significantly explained heterogeneity in treatment effects on fibrosis improvement (R = 54.26%) and MASH resolution (R = 78.16%)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "SGLT2 inhibitor and incretin-based agents improved fibrosis in MASH, with weight loss being a significant mediator. Targeting multiple incretin pathways, especially involving glucagon receptors, may offer greater MASH resolution. Dose-dependent effects were more prominent for MASH resolution than fibrosis improvement, indicating potential weight-loss-independent anti-fibrotic pathways."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41063381/",
      "pubDate": "2025 Oct 08",
      "doi": "10.1111/dom.70187",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "SGLT2 inhibitors and incretin-based therapies improved liver fibrosis in metabolic-associated steatohepatitis (MASH), with weight loss playing a key role, and targeting multiple incretin pathways, particularly glucagon receptors, may enhance disease resolution."
    },
    {
      "id": "da937bd8fe43",
      "title": "Anthropometric Measures, Cardiovascular Outcomes, and Treatment Effects of Finerenone in Cardiovascular-Kidney-Metabolic Disease: Pooled Participant-Level Analysis of 3 Global Trials.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117919",
      "abstract": "Obesity is a core pathophysiologic contributor to cardiovascular, kidney, and metabolic (CKM) conditions. However, the association between different adiposity-related anthropometrics and cardiovascular outcomes in persons with CKM conditions has not been rigorously explored. In this study, the authors sought to examine cardiovascular outcomes and treatment effects of finerenone according to different adiposity-related anthropometrics. In this prespecified participant-level pooled analysis of FIDELIO-DKD, FIGARO-DKD, and FINEARTS-HF (FINE-HEART), cardiovascular outcomes and treatment effects of finerenone according to baseline body mass index (BMI), waist circumference (WC), waist-height ratio (WHtR), and waist-hip ratio (WHR) were evaluated with the use of multivariable-adjusted Cox proportional hazards regression and Poisson regression. Of 18,759 participants with available data for all anthropometrics, 52% had a BMI ≥30 kg/m and 98% had any excess adiposity. Among those with BMI <30 kg/m, 95% had increased abdominal adiposity, especially women and older individuals. Higher BMI, WC, WHtR, and WHR were each significantly associated with a wide range of cardiovascular outcomes, including cardiovascular death or heart failure (HF) hospitalization and its individual components, major adverse cardiovascular events, new-onset atrial fibrillation, and incident HF hospitalization. BMI-adjusted WHtR and WHtR-adjusted BMI were each associated with a higher rate of cardiovascular death or HF hospitalization, and participants with elevated BMI and WHtR experienced a higher rate of cardiovascular death or HF hospitalization compared with those with elevated BMI or WHtR alone (P < 0.001). Benefits of finerenone on cardiovascular death or HF hospitalization were consistent regardless of baseline BMI (P = 0.27) or WHtR (P = 0.26), and absolute benefits appeared to be greater among participants with higher adiposity. Serious adverse events were less common with finerenone vs placebo, regardless of baseline BMI category (P = 0.08). These findings suggest that assessment of anthropometrics capturing abdominal adiposity, in addition to BMI, may enhance obesity identification and risk stratification among individuals with CKM conditions. Finerenone consistently reduced adverse cardiovascular outcomes across a wide range of adiposity. (FINE-HEART: An Integrated Pooled Analysis of Finerenone Across 3 Phase III Trials of Heart Failure and Chronic Kidney Disease and Type 2 Diabetes; CRD42024570467).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Obesity is a core pathophysiologic contributor to cardiovascular, kidney, and metabolic (CKM) conditions. However, the association between different adiposity-related anthropometrics and cardiovascular outcomes in persons with CKM conditions has not been rigorously explored."
        },
        {
          "label": "OBJECTIVES",
          "text": "In this study, the authors sought to examine cardiovascular outcomes and treatment effects of finerenone according to different adiposity-related anthropometrics."
        },
        {
          "label": "METHODS",
          "text": "In this prespecified participant-level pooled analysis of FIDELIO-DKD, FIGARO-DKD, and FINEARTS-HF (FINE-HEART), cardiovascular outcomes and treatment effects of finerenone according to baseline body mass index (BMI), waist circumference (WC), waist-height ratio (WHtR), and waist-hip ratio (WHR) were evaluated with the use of multivariable-adjusted Cox proportional hazards regression and Poisson regression."
        },
        {
          "label": "RESULTS",
          "text": "Of 18,759 participants with available data for all anthropometrics, 52% had a BMI ≥30 kg/m and 98% had any excess adiposity. Among those with BMI <30 kg/m, 95% had increased abdominal adiposity, especially women and older individuals. Higher BMI, WC, WHtR, and WHR were each significantly associated with a wide range of cardiovascular outcomes, including cardiovascular death or heart failure (HF) hospitalization and its individual components, major adverse cardiovascular events, new-onset atrial fibrillation, and incident HF hospitalization. BMI-adjusted WHtR and WHtR-adjusted BMI were each associated with a higher rate of cardiovascular death or HF hospitalization, and participants with elevated BMI and WHtR experienced a higher rate of cardiovascular death or HF hospitalization compared with those with elevated BMI or WHtR alone (P < 0.001). Benefits of finerenone on cardiovascular death or HF hospitalization were consistent regardless of baseline BMI (P = 0.27) or WHtR (P = 0.26), and absolute benefits appeared to be greater among participants with higher adiposity. Serious adverse events were less common with finerenone vs placebo, regardless of baseline BMI category (P = 0.08)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "These findings suggest that assessment of anthropometrics capturing abdominal adiposity, in addition to BMI, may enhance obesity identification and risk stratification among individuals with CKM conditions. Finerenone consistently reduced adverse cardiovascular outcomes across a wide range of adiposity. (FINE-HEART: An Integrated Pooled Analysis of Finerenone Across 3 Phase III Trials of Heart Failure and Chronic Kidney Disease and Type 2 Diabetes; CRD42024570467)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40892605/",
      "pubDate": "2025 Aug 27",
      "doi": "10.1016/j.jacc.2025.08.039",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "Assessing abdominal fat alongside BMI can improve obesity identification and risk prediction in people with chronic kidney and heart conditions, and finerenone consistently reduces cardiovascular risks regardless of body fat distribution."
    },
    {
      "id": "1ccf9e4ffbe3",
      "title": "Spinal cord stimulation plus conventional medical management versus conventional medical management alone for severe, non-surgical, refractory back pain: a randomized clinical trial followed by crossover.",
      "journal": "Reg Anesth Pain Med",
      "score": "5/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117869",
      "abstract": "Chronic low back pain is a major contributor to long-term disability. Many patients lack a clearly identifiable source for their pain on physical examination or imaging or present with multiple pain generators. This subset of patients, who do not have surgical pathology, relies on conservative medical management (CMM) in the absence of effective and lasting treatment alternatives. For those who fail to respond to CMM, spinal cord stimulation (SCS) should be considered as an effective adjunctive therapy for improving pain, disability and health-related quality of life. SOLIS is a prospective, multicenter trial that randomized patients with non-surgical, refractory back pain (with or without leg pain) to receive either SCS combined with CMM or CMM alone. The primary endpoint at 3 months compared the proportion of patients with ≥50% overall pain relief without an increase in mean daily opioid use between the SCS+CMM and CMM groups. Three months after treatment activation, patients initially randomized to receive CMM alone had the option to cross over and add SCS to their pain management regimen. Patients in both randomized groups underwent 12-month follow-up visits to assess long-term effects on pain relief, disability, health-related quality of life, global impression of change, and treatment satisfaction. 147 patients were randomized to SCS+CMM (n=79) or CMM alone (n=68). At the 3-month follow-up, 89.5% of patients who received SCS+CMM (including subperception and paresthesia-based programming modalities) and 8.1% who received CMM alone were classified as study responders (≥50% pain relief without an increase in mean daily opioid use; modified intention-to-treat analysis, p<0.0001). The level of disability due to low back pain improved significantly: the Oswestry Disability Index score decreased by -27.5±15.9 points in the SCS+CMM group versus -7.2±9.9 points in the CMM alone group (p<0.0001). Health-related quality of life also improved at 3 months: the EuroQol 5 Dimension 5 Level questionnaire index score increased by 0.247±0.164 points in the SCS+CMM group versus 0.031±0.151 points in the CMM alone group (p<0.0001). The benefits of SCS were sustained until the 12-month visit. Seven patients experienced serious adverse events related to SCS, including 5 (3.6%) implant site infections resulting in explant. SCS relieved pain and resulted in clinically significant improvements in functional disability and health-related quality of life in patients with non-surgical, refractory back pain with or without accompanying leg pain. NCT04676022.",
      "structuredAbstract": [
        {
          "label": "INTRODUCTION",
          "text": "Chronic low back pain is a major contributor to long-term disability. Many patients lack a clearly identifiable source for their pain on physical examination or imaging or present with multiple pain generators. This subset of patients, who do not have surgical pathology, relies on conservative medical management (CMM) in the absence of effective and lasting treatment alternatives. For those who fail to respond to CMM, spinal cord stimulation (SCS) should be considered as an effective adjunctive therapy for improving pain, disability and health-related quality of life."
        },
        {
          "label": "METHODS",
          "text": "SOLIS is a prospective, multicenter trial that randomized patients with non-surgical, refractory back pain (with or without leg pain) to receive either SCS combined with CMM or CMM alone. The primary endpoint at 3 months compared the proportion of patients with ≥50% overall pain relief without an increase in mean daily opioid use between the SCS+CMM and CMM groups. Three months after treatment activation, patients initially randomized to receive CMM alone had the option to cross over and add SCS to their pain management regimen. Patients in both randomized groups underwent 12-month follow-up visits to assess long-term effects on pain relief, disability, health-related quality of life, global impression of change, and treatment satisfaction."
        },
        {
          "label": "RESULTS",
          "text": "147 patients were randomized to SCS+CMM (n=79) or CMM alone (n=68). At the 3-month follow-up, 89.5% of patients who received SCS+CMM (including subperception and paresthesia-based programming modalities) and 8.1% who received CMM alone were classified as study responders (≥50% pain relief without an increase in mean daily opioid use; modified intention-to-treat analysis, p<0.0001). The level of disability due to low back pain improved significantly: the Oswestry Disability Index score decreased by -27.5±15.9 points in the SCS+CMM group versus -7.2±9.9 points in the CMM alone group (p<0.0001). Health-related quality of life also improved at 3 months: the EuroQol 5 Dimension 5 Level questionnaire index score increased by 0.247±0.164 points in the SCS+CMM group versus 0.031±0.151 points in the CMM alone group (p<0.0001). The benefits of SCS were sustained until the 12-month visit. Seven patients experienced serious adverse events related to SCS, including 5 (3.6%) implant site infections resulting in explant."
        },
        {
          "label": "CONCLUSION",
          "text": "SCS relieved pain and resulted in clinically significant improvements in functional disability and health-related quality of life in patients with non-surgical, refractory back pain with or without accompanying leg pain."
        },
        {
          "label": "TRIAL REGISTRATION NUMBER",
          "text": "NCT04676022."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41047246/",
      "pubDate": "2025 Oct 05",
      "doi": "10.1136/rapm-2024-106335",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "Spinal cord stimulation (SCS) effectively reduced pain and improved function and quality of life in patients with chronic back pain that didn't respond to other treatments."
    },
    {
      "id": "a24dcadc34d1",
      "title": "Effectiveness and safety of assisted vaginal birth and second-stage cesarean section: a systematic review and meta-analysis of real-world contemporary data.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117858",
      "abstract": "To synthesize evidence on the effectiveness of different instruments for assisted vaginal birth and to assess the prevalence of maternal and neonatal adverse outcomes associated with assisted vaginal birth and second-stage cesarean section. A comprehensive search was conducted in Cochrane, Embase, and MEDLINE to identify randomized controlled trials and cross-sectional and cohort studies published between January 2001 and December 2023. Studies published in English, Spanish, French, or Italian with >30 participants, conducted in any type of healthcare facility, and reporting operative procedures in the second stage of labor were eligible if they included at least one outcome of interest for women undergoing assisted vaginal birth and/or second-stage cesarean section. Two independent reviewers conducted study selection, data extraction, and quality assessment. Meta-analyses of proportions were performed using random-effects models, and heterogeneity was assessed using the I statistic. A total of 241 studies, involving 751,242 participants, were included, of which 231 were observational and 10 randomized controlled trials. Prevalence estimates for assisted vaginal birth failure and adverse outcomes varied widely. Vacuum extraction had a significantly higher failure rate than forceps (7.60% vs 3.26%, P<.01), but a lower prevalence of obstetric anal sphincter injury (4.73% vs 7.99%, P<.01). Spatula use was associated with a lower prevalence of neonatal cephalohematoma compared to vacuum extraction (0.73% vs 5.45%, P<.01) and forceps (0.73% vs 3.54%, P<.01), but a higher prevalence of postpartum hemorrhage compared to vacuum extraction (10.77% vs 5.46%, P<.0001). Compared to assisted vaginal birth, second-stage cesarean section was associated with significantly higher rates of neonatal intensive care unit admission (17.18% vs 6.64% forceps, 6.07% vacuum extraction, P<.001), low Apgar scores (6.01% vs 2.43% forceps, 2.05% vacuum extraction, P<.01), skull fractures (1.54% vs 0.27% for both, P<.05), and neonatal death (1.95% vs 0.31% for both, P<.01). Contemporary data reveal wide variability in the prevalence of failed assisted vaginal birth and adverse maternal and neonatal outcomes following operative delivery in the second stage of labor. While assisted vaginal birth carries specific risks, it may offer advantages over emergency second-stage cesarean section, particularly regarding neonatal outcomes.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To synthesize evidence on the effectiveness of different instruments for assisted vaginal birth and to assess the prevalence of maternal and neonatal adverse outcomes associated with assisted vaginal birth and second-stage cesarean section."
        },
        {
          "label": "DATA SOURCES",
          "text": "A comprehensive search was conducted in Cochrane, Embase, and MEDLINE to identify randomized controlled trials and cross-sectional and cohort studies published between January 2001 and December 2023."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Studies published in English, Spanish, French, or Italian with >30 participants, conducted in any type of healthcare facility, and reporting operative procedures in the second stage of labor were eligible if they included at least one outcome of interest for women undergoing assisted vaginal birth and/or second-stage cesarean section."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Two independent reviewers conducted study selection, data extraction, and quality assessment. Meta-analyses of proportions were performed using random-effects models, and heterogeneity was assessed using the I statistic."
        },
        {
          "label": "RESULTS",
          "text": "A total of 241 studies, involving 751,242 participants, were included, of which 231 were observational and 10 randomized controlled trials. Prevalence estimates for assisted vaginal birth failure and adverse outcomes varied widely. Vacuum extraction had a significantly higher failure rate than forceps (7.60% vs 3.26%, P<.01), but a lower prevalence of obstetric anal sphincter injury (4.73% vs 7.99%, P<.01). Spatula use was associated with a lower prevalence of neonatal cephalohematoma compared to vacuum extraction (0.73% vs 5.45%, P<.01) and forceps (0.73% vs 3.54%, P<.01), but a higher prevalence of postpartum hemorrhage compared to vacuum extraction (10.77% vs 5.46%, P<.0001). Compared to assisted vaginal birth, second-stage cesarean section was associated with significantly higher rates of neonatal intensive care unit admission (17.18% vs 6.64% forceps, 6.07% vacuum extraction, P<.001), low Apgar scores (6.01% vs 2.43% forceps, 2.05% vacuum extraction, P<.01), skull fractures (1.54% vs 0.27% for both, P<.05), and neonatal death (1.95% vs 0.31% for both, P<.01)."
        },
        {
          "label": "CONCLUSION",
          "text": "Contemporary data reveal wide variability in the prevalence of failed assisted vaginal birth and adverse maternal and neonatal outcomes following operative delivery in the second stage of labor. While assisted vaginal birth carries specific risks, it may offer advantages over emergency second-stage cesarean section, particularly regarding neonatal outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40947089/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1016/j.ajog.2025.09.022",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "Assisted vaginal birth has variable failure rates and associated risks, but may lead to better neonatal outcomes compared to emergency cesarean section in the second stage of labor."
    },
    {
      "id": "b88c4b54bfed",
      "title": "Efficacy of Adding Intravenous Saline Solution to Nonsteroidal Anti-Inflammatory Drug-Based Treatment of Acute Migraine in the Emergency Department.",
      "journal": "Ann Emerg Med",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117864",
      "abstract": "Intravenous fluid administration is frequently used alongside nonsteroidal anti-inflammatory drugs (NSAIDs) in the treatment of acute migraine in emergency departments (EDs), despite a lack of clear evidence supporting its benefit. The objective of this study was to evaluate whether the addition of 1,000 mL intravenous normal saline solution to standard NSAID-based treatment improves clinical outcomes in adults presenting to the ED with acute migraine. It was a double-blind, parallel-group, randomized controlled trial in single tertiary care academic ED (June 2020 to June 2021). Adults aged ≥18 years with migraine per International Classification of Headache Disorders, 3rd edition criteria, presenting with an acute attack. Patients with dehydration, recent intravenous fluid use, or contraindications were excluded. Of 955 screened patients, 128 were randomized; 125 were analyzed. All patients received 75 mg intramuscular diclofenac. The intervention group received 1,000 mL intravenous saline solution over 1 hour; the control group received 10 mL intravenous saline solution over 1 hour. The primary outcome was change in headache severity (100-mm visual analog scale [VAS]) at 2 hours. Secondary outcomes included rescue medication use, ED length of stay, adverse events, and functional disability. Median VAS reduction was 62.0 mm (IQR 37.5-82.0) in the intervention group vs 48.0 mm (26.0-74.0) in controls; the Hodges-Lehmann estimated between-group difference was 10.0 mm (95% CI -2.0 to 20.0). We found no between-group differences in nausea VAS or functional disability across time points. Rescue medication use was lower in the intervention group (23.8%) than in controls (42.5%) (absolute difference 18.6%, 95% CI 2.1% to 35.0%). Median ED length of stay was shorter in the intervention group (150 vs 168 minutes; difference 19 minutes, 95% CI 0 to 39). No serious adverse events occurred; 24-hour survey outcomes were similar between groups. Adding 1,000 mL intravenous saline solution to NSAID-based therapy did not produce a clear improvement in pain relief at 2 hours. Lower rescue medication use and shorter ED length of stay in the intervention group are secondary findings that may be influenced by unblinded administering staff and should be interpreted cautiously. Routine intravenous fluids should be considered selectively, particularly for patients with clinical signs of dehydration.",
      "structuredAbstract": [
        {
          "label": "STUDY OBJECTIVE",
          "text": "Intravenous fluid administration is frequently used alongside nonsteroidal anti-inflammatory drugs (NSAIDs) in the treatment of acute migraine in emergency departments (EDs), despite a lack of clear evidence supporting its benefit. The objective of this study was to evaluate whether the addition of 1,000 mL intravenous normal saline solution to standard NSAID-based treatment improves clinical outcomes in adults presenting to the ED with acute migraine."
        },
        {
          "label": "METHODS",
          "text": "It was a double-blind, parallel-group, randomized controlled trial in single tertiary care academic ED (June 2020 to June 2021). Adults aged ≥18 years with migraine per International Classification of Headache Disorders, 3rd edition criteria, presenting with an acute attack. Patients with dehydration, recent intravenous fluid use, or contraindications were excluded. Of 955 screened patients, 128 were randomized; 125 were analyzed. All patients received 75 mg intramuscular diclofenac. The intervention group received 1,000 mL intravenous saline solution over 1 hour; the control group received 10 mL intravenous saline solution over 1 hour. The primary outcome was change in headache severity (100-mm visual analog scale [VAS]) at 2 hours. Secondary outcomes included rescue medication use, ED length of stay, adverse events, and functional disability."
        },
        {
          "label": "RESULTS",
          "text": "Median VAS reduction was 62.0 mm (IQR 37.5-82.0) in the intervention group vs 48.0 mm (26.0-74.0) in controls; the Hodges-Lehmann estimated between-group difference was 10.0 mm (95% CI -2.0 to 20.0). We found no between-group differences in nausea VAS or functional disability across time points. Rescue medication use was lower in the intervention group (23.8%) than in controls (42.5%) (absolute difference 18.6%, 95% CI 2.1% to 35.0%). Median ED length of stay was shorter in the intervention group (150 vs 168 minutes; difference 19 minutes, 95% CI 0 to 39). No serious adverse events occurred; 24-hour survey outcomes were similar between groups."
        },
        {
          "label": "CONCLUSION",
          "text": "Adding 1,000 mL intravenous saline solution to NSAID-based therapy did not produce a clear improvement in pain relief at 2 hours. Lower rescue medication use and shorter ED length of stay in the intervention group are secondary findings that may be influenced by unblinded administering staff and should be interpreted cautiously. Routine intravenous fluids should be considered selectively, particularly for patients with clinical signs of dehydration."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41071134/",
      "pubDate": "2025 Oct 09",
      "doi": "10.1016/j.annemergmed.2025.09.013",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "Intravenous saline added to NSAID therapy did not significantly improve pain relief at two hours, and secondary benefits like reduced rescue medication and shorter ED stays should be viewed with caution."
    },
    {
      "id": "de4dbd17ca3c",
      "title": "Comparison of 2 Doses vs 1 Dose in the First Season Children Are Vaccinated Against Influenza: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117862",
      "abstract": "Based on the findings of immunogenicity studies, the World Health Organization has recommended influenza vaccine-naive children younger than 9 years receive 2 doses of influenza vaccine in the first year of vaccination. To estimate the increase in protection associated with the second dose of influenza vaccine for influenza vaccine-naive children younger than 9 years. MEDLINE, EMBASE, and CINAHL were searched for articles published from inception to March 24, 2025. Peer-reviewed studies that reported vaccine efficacy or vaccine effectiveness against influenza for influenza vaccine-naive children aged 6 months to younger than 9 years by dose number were included. Modeling and cost-effectiveness studies were excluded. Two reviewers independently screened and extracted data and assessed studies' risk of bias. The study followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) reporting guideline. For studies reporting both 1 and 2 dose estimates, the difference in vaccine efficacy or effectiveness was calculated in order to estimate the additional protection associated with the second dose. Pooled vaccine efficacy or effectiveness and difference were calculated separately for inactivated influenza and live attenuated influenza vaccines. There were 51 studies with 415 050 participants included in this analysis. The pooled absolute increase in vaccine effectiveness of a second inactivated influenza vaccine dose in the first year of vaccination was 15 percentage points (pp) (95% CI, -2.8 pp to 33 pp) for those younger than 9 years and 28 pp (95% CI, 4.7 pp to 51 pp) for children younger than 3 years. Insufficient estimates were available to assess the incremental benefit associated with a second dose of live attenuated influenza vaccine. In this systematic review and meta-analysis of influenza vaccine efficacy and effectiveness in the first year of vaccination, receiving 2 doses of inactivated influenza vaccine was associated with improved protection for children younger than 3 years compared with those who receive one dose; however, when the age range was broadened to younger than 9 years, the second dose of inactivated influenza vaccine was not significantly associated with increased protection. Additional high-quality studies are needed to assess the impact of the 2-dose schedule for both vaccine types by age to determine the age range for which a 2-dose schedule is beneficial.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Based on the findings of immunogenicity studies, the World Health Organization has recommended influenza vaccine-naive children younger than 9 years receive 2 doses of influenza vaccine in the first year of vaccination."
        },
        {
          "label": "OBJECTIVE",
          "text": "To estimate the increase in protection associated with the second dose of influenza vaccine for influenza vaccine-naive children younger than 9 years."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, EMBASE, and CINAHL were searched for articles published from inception to March 24, 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Peer-reviewed studies that reported vaccine efficacy or vaccine effectiveness against influenza for influenza vaccine-naive children aged 6 months to younger than 9 years by dose number were included. Modeling and cost-effectiveness studies were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers independently screened and extracted data and assessed studies' risk of bias. The study followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) reporting guideline."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "For studies reporting both 1 and 2 dose estimates, the difference in vaccine efficacy or effectiveness was calculated in order to estimate the additional protection associated with the second dose. Pooled vaccine efficacy or effectiveness and difference were calculated separately for inactivated influenza and live attenuated influenza vaccines."
        },
        {
          "label": "RESULTS",
          "text": "There were 51 studies with 415 050 participants included in this analysis. The pooled absolute increase in vaccine effectiveness of a second inactivated influenza vaccine dose in the first year of vaccination was 15 percentage points (pp) (95% CI, -2.8 pp to 33 pp) for those younger than 9 years and 28 pp (95% CI, 4.7 pp to 51 pp) for children younger than 3 years. Insufficient estimates were available to assess the incremental benefit associated with a second dose of live attenuated influenza vaccine."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis of influenza vaccine efficacy and effectiveness in the first year of vaccination, receiving 2 doses of inactivated influenza vaccine was associated with improved protection for children younger than 3 years compared with those who receive one dose; however, when the age range was broadened to younger than 9 years, the second dose of inactivated influenza vaccine was not significantly associated with increased protection. Additional high-quality studies are needed to assess the impact of the 2-dose schedule for both vaccine types by age to determine the age range for which a 2-dose schedule is beneficial."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41042511/",
      "pubDate": "2025 Oct 01",
      "doi": "10.1001/jamanetworkopen.2025.35250",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "Two doses of inactivated influenza vaccine are more protective for children under 3 years old, but not for those under 9 years old."
    },
    {
      "id": "677569c8e5db",
      "title": "Ibrutinib and rituximab versus immunochemotherapy in patients with previously untreated mantle cell lymphoma (ENRICH): a randomised, open-label, phase 2/3 superiority trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Hematology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117826",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false
    },
    {
      "id": "3b259d90a6ec",
      "title": "Service delivery, behavioural, and self-management interventions for adults with epilepsy.",
      "journal": "Cochrane Database Syst Rev",
      "score": "4/7",
      "tags": [
        "Neurology",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117820",
      "abstract": "In the UK, approximately one in 1000 children aged zero to four years have epilepsy, and one in 200 children between the ages of five and 19 have epilepsy. There is a need to focus on models of service delivery and therapies that target cognitive, psychological, and behavioural aspects to improve seizure control and quality of life. To assess the effects of service delivery, behavioural, and self-management inventions on seizure control and health-related quality of life in children with epilepsy. We used the Cochrane Register of Studies, MEDLINE, and two other databases, together with reference checking and contact with study authors, to identify the studies included in the review. The latest search date was 21 August 2023. We included randomised controlled trials (RCTs) or quasi-RCTs of any design (double/single-blinded, unblinded; parallel, cross-over, or cluster). We included behavioural or self-management interventions aimed at improving seizure control in children with epilepsy (average age 18 years or under), and any service delivery interventions targeting children with epilepsy (average age 18 years or under), their parents/carers, or both. Our primary outcome was seizure control (i.e. change in seizure frequency, seizure freedom). Our secondary outcomes were: seizure severity, overall quality of life and other aspects of quality of life (such as anxiety and depression), medication usage, knowledge, general health, social and psychological function, and adverse events. We classified outcomes as short-term (up to six months) or long-term (over six months). At least two review authors independently screened all papers, extracted data, and assessed the risk of bias. Data analysis was performed by one review author and checked by at least one other review author. We used GRADE to assess the certainty of the evidence for (1) seizure control and (2) participant-reported overall quality of life using validated scales. We included six studies with a total of 468 randomised participants: four behavioural studies (subcategorised into psycho-behavioural interventions investigated in three studies involving 205 children; and one mind-body intervention with 20 children) and two service delivery studies, involving 243 adult carers of children with epilepsy. Most studies had a high risk of performance bias, detection bias, or both (for lack of or inadequate blinding of participants, personnel, or outcome assessors). The risk of bias was low or unclear across all other domains. Due to the studies' heterogeneity, we were unable to conduct a meta-analysis for any intervention or outcome. We identified no eligible self-management interventions. Psycho-behavioural interventions Compared to usual care, there was a small important effect showing that systemic family therapy may reduce seizure frequency slightly per month at three months (mean difference (MD) in seizure frequency per month -1.98, 95% confidence interval (CI) -3.84 to -0.12; 1 study, 104 participants; low-certainty evidence). Evidence was lacking for differences in seizure frequency between behavioural interventions and control groups in the other two studies (94 participants; results reported descriptively at 10 weeks, three months, and 12 months). Compared to usual care, a manual-based psychosocial group intervention may result in little to no difference in quality of life at three months, but the evidence is very uncertain (Paediatric Quality of Life Inventory: MD -1.40, 95% CI -8.21 to 5.41; 1 study, 76 participants; very low-certainty evidence; Glasgow Epilepsy Outcome Scale for Young Persons: MD -0.33, 95% CI -5.68 to 5.02; P = 0.90; 1 study, 76 participants; very low-certainty evidence). The other two psycho-behavioural studies did not assess overall quality of life. Mind-body interventions It is uncertain whether a mind-body intervention (yoga) made a difference in the number of participants who were seizure-free at three months (seizure freedom MD 1.62, 95% CI 0.97 to 2.69; 1 study, 20 participants; low-certainty evidence). This study did not measure quality of life. Service delivery interventions One service delivery intervention (a clinical pharmacist-led education intervention) assessed seizure control and overall quality of life versus usual care. The evidence is very uncertain whether there were differences in seizure freedom (MD 1.32, 95% CI 0.86 to 2.00; 1 study, 71 participants; very low-certainty evidence) or overall quality of life at two months (MD 10.46, 95% CI 1.82 to 19.10; 1 study, 71 participants; very low-certainty evidence). Quality of life was assessed by adult carers, not the children themselves. The other service delivery intervention ('WeChat'-based remote follow-up after hospital discharge) did not evaluate seizure control and only measured aspects of quality of life (anxiety and depression, 162 participants), rather than overall quality of life. No adverse events were reported in any of the six included studies. We included six studies in this review, each examining a different intervention, reporting on different outcomes, and involving varied populations. All studies had several limitations, including small sample sizes, lack of blinding, and inconsistent outcome measurement across studies. Overall, the available evidence was of low to very low certainty. Results for long-term (≥ six months) outcomes were very limited for any type of intervention. High-quality RCTs assessing service delivery, behavioural, and self-management interventions in children and adolescents with epilepsy are needed. Trials should assess short-term (≤ six months) and long-term (> six months) outcomes. The development of a core outcome set for children with epilepsy would help ensure trials use relevant, meaningful, and consistent outcomes for evaluating intervention effects.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In the UK, approximately one in 1000 children aged zero to four years have epilepsy, and one in 200 children between the ages of five and 19 have epilepsy. There is a need to focus on models of service delivery and therapies that target cognitive, psychological, and behavioural aspects to improve seizure control and quality of life."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of service delivery, behavioural, and self-management inventions on seizure control and health-related quality of life in children with epilepsy."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We used the Cochrane Register of Studies, MEDLINE, and two other databases, together with reference checking and contact with study authors, to identify the studies included in the review. The latest search date was 21 August 2023."
        },
        {
          "label": "SELECTION CRITERIA",
          "text": "We included randomised controlled trials (RCTs) or quasi-RCTs of any design (double/single-blinded, unblinded; parallel, cross-over, or cluster). We included behavioural or self-management interventions aimed at improving seizure control in children with epilepsy (average age 18 years or under), and any service delivery interventions targeting children with epilepsy (average age 18 years or under), their parents/carers, or both."
        },
        {
          "label": "DATA COLLECTION AND ANALYSIS",
          "text": "Our primary outcome was seizure control (i.e. change in seizure frequency, seizure freedom). Our secondary outcomes were: seizure severity, overall quality of life and other aspects of quality of life (such as anxiety and depression), medication usage, knowledge, general health, social and psychological function, and adverse events. We classified outcomes as short-term (up to six months) or long-term (over six months). At least two review authors independently screened all papers, extracted data, and assessed the risk of bias. Data analysis was performed by one review author and checked by at least one other review author. We used GRADE to assess the certainty of the evidence for (1) seizure control and (2) participant-reported overall quality of life using validated scales."
        },
        {
          "label": "MAIN RESULTS",
          "text": "We included six studies with a total of 468 randomised participants: four behavioural studies (subcategorised into psycho-behavioural interventions investigated in three studies involving 205 children; and one mind-body intervention with 20 children) and two service delivery studies, involving 243 adult carers of children with epilepsy. Most studies had a high risk of performance bias, detection bias, or both (for lack of or inadequate blinding of participants, personnel, or outcome assessors). The risk of bias was low or unclear across all other domains. Due to the studies' heterogeneity, we were unable to conduct a meta-analysis for any intervention or outcome. We identified no eligible self-management interventions. Psycho-behavioural interventions Compared to usual care, there was a small important effect showing that systemic family therapy may reduce seizure frequency slightly per month at three months (mean difference (MD) in seizure frequency per month -1.98, 95% confidence interval (CI) -3.84 to -0.12; 1 study, 104 participants; low-certainty evidence). Evidence was lacking for differences in seizure frequency between behavioural interventions and control groups in the other two studies (94 participants; results reported descriptively at 10 weeks, three months, and 12 months). Compared to usual care, a manual-based psychosocial group intervention may result in little to no difference in quality of life at three months, but the evidence is very uncertain (Paediatric Quality of Life Inventory: MD -1.40, 95% CI -8.21 to 5.41; 1 study, 76 participants; very low-certainty evidence; Glasgow Epilepsy Outcome Scale for Young Persons: MD -0.33, 95% CI -5.68 to 5.02; P = 0.90; 1 study, 76 participants; very low-certainty evidence). The other two psycho-behavioural studies did not assess overall quality of life. Mind-body interventions It is uncertain whether a mind-body intervention (yoga) made a difference in the number of participants who were seizure-free at three months (seizure freedom MD 1.62, 95% CI 0.97 to 2.69; 1 study, 20 participants; low-certainty evidence). This study did not measure quality of life. Service delivery interventions One service delivery intervention (a clinical pharmacist-led education intervention) assessed seizure control and overall quality of life versus usual care. The evidence is very uncertain whether there were differences in seizure freedom (MD 1.32, 95% CI 0.86 to 2.00; 1 study, 71 participants; very low-certainty evidence) or overall quality of life at two months (MD 10.46, 95% CI 1.82 to 19.10; 1 study, 71 participants; very low-certainty evidence). Quality of life was assessed by adult carers, not the children themselves. The other service delivery intervention ('WeChat'-based remote follow-up after hospital discharge) did not evaluate seizure control and only measured aspects of quality of life (anxiety and depression, 162 participants), rather than overall quality of life. No adverse events were reported in any of the six included studies."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "We included six studies in this review, each examining a different intervention, reporting on different outcomes, and involving varied populations. All studies had several limitations, including small sample sizes, lack of blinding, and inconsistent outcome measurement across studies. Overall, the available evidence was of low to very low certainty. Results for long-term (≥ six months) outcomes were very limited for any type of intervention. High-quality RCTs assessing service delivery, behavioural, and self-management interventions in children and adolescents with epilepsy are needed. Trials should assess short-term (≤ six months) and long-term (> six months) outcomes. The development of a core outcome set for children with epilepsy would help ensure trials use relevant, meaningful, and consistent outcomes for evaluating intervention effects."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41123096/",
      "pubDate": "2025 Oct 22",
      "doi": "10.1002/14651858.CD015287.pub2",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "The current evidence base for interventions in children and adolescents with epilepsy is limited and of low certainty, necessitating high-quality randomized controlled trials with standardized outcome measures."
    },
    {
      "id": "a436cceb173b",
      "title": "Calcium supplementation commenced before pregnancy for preventing hypertensive disorders and related problems.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48604141/117756",
      "abstract": "Hypertensive disorders of pregnancy are a leading cause of maternal and perinatal morbidity and mortality. Calcium supplementation commenced before pregnancy may prevent the development of these disorders. This is an update of a review last published in 2019. To assess the effects of calcium supplementation commenced before pregnancy on hypertensive disorders of pregnancy and related maternal and neonatal outcomes. We searched CENTRAL, MEDLINE, Embase, CINAHL, Portal Regional BVS-Lilacs, Scopus, Web of Science, WHO ICTRP and ClinicalTrials.gov on 7 January 2025 and searched reference lists of retrieved trials and relevant systematic reviews. We included randomised controlled trials (RCTs) that compared calcium supplementation commenced before pregnancy with placebo or standard care. Trials conducted after 2010 needed to be prospectively registered. We applied a trustworthiness checklist. Critical outcomes for women were pre-eclampsia or pregnancy loss, and pre-eclampsia. The critical outcome for children was perinatal loss. Our main important outcomes for women were pregnancy loss at any gestational age, maternal death, maternal death or severe morbidity, and adverse effects. Our main important outcomes for children were preterm delivery before 37 weeks, neonatal death or severe morbidity, stillbirth, neonatal death, and early neonatal death. We used version 2 of the Cochrane tool for assessing risk of bias in randomised trials (RoB 2). Two review authors independently selected trials, extracted data, and assessed risk of bias and trustworthiness. We pooled data using random-effects meta-analysis. We assessed the certainty of the evidence using GRADE. Because conception and pregnancy loss are intermediate outcomes potentially on the causal pathway to pre-eclampsia, we chose the composite outcome 'pre-eclampsia or pregnancy loss' as the first critical outcome (and most relevant to pregnant women), and included sensitivity analyses including only women who conceived during the trial. We included one multicentre, double-blind, randomised, placebo-controlled trial. It included 1355 parous women, whose most recent planned pregnancy had been complicated by pre-eclampsia or eclampsia. Pre-eclampsia or pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pre-eclampsia or pregnancy loss at any gestational age (risk ratio (RR) 0.85, 95% confidence interval (CI) 0.67 to 1.07; 1 RCT, 1355 women; risk difference (RD) 28/1000 fewer, 95% CI 61 fewer to 13 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.82 (95% CI 0.66 to 1.00; 1 RCT, 633 women). Pre-eclampsia Compared to placebo, calcium may result in little to no difference in pre-eclampsia (RR 0.84, 95% CI 0.62 to 1.14; 1 RCT, 1355 women; RD 19/1000 fewer, 95% CI 46 fewer to 17 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.81 (95% CI 0.61 to 1.07; 1 RCT, 633 women). Pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pregnancy loss at any gestational age (RR 0.92, 95% CI 0.69 to 1.24; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 37 fewer to 28 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.89 (95% CI 0.67 to 1.17; 1 RCT, 633 women). Maternal death The evidence is very uncertain about the effect of calcium compared to placebo on maternal death (RR 1.00, 95% CI 0.14 to 7.07; 1 RCT, 1355 women; RD 0/10,000 fewer, 95% CI 25 fewer to 179 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.96 (95% CI 0.14 to 6.77; 1 RCT, 633 women). Maternal death or severe morbidity The evidence is very uncertain about the effect of calcium, compared to placebo, on maternal death or severe morbidity (RR 0.97, 95% CI 0.70 to 1.35; 1 RCT, 1355 women; RD 3/1000 fewer, 95% CI 29 fewer to 34 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.93 (95% CI 0.68 to 1.27; 1 RCT, 633 women). Preterm delivery before 37 weeks Compared to placebo, calcium may result in little to no difference in preterm delivery before 37 weeks (RR 0.94, 95% CI 0.74 to 1.19; 1 RCT, 1355 women; RD 11/1000 fewer, 95% CI 46 fewer to 33 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.90 (95% CI 0.74 to 1.11; 1 RCT, 633 women). Stillbirth The evidence is very uncertain about the effect of calcium compared to placebo on stillbirth (RR 0.82, 95% CI 0.50 to 1.34; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 24 fewer to 17 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.79 (95% CI 0.48 to 1.27; 1 RCT, 633 women). The included trial did not measure perinatal loss, maternal adverse effects, neonatal death or severe morbidity, neonatal death, or early neonatal death. When all randomised women are considered, calcium commenced before pregnancy may result in little to no difference in pre-eclampsia or pregnancy loss, and pre-eclampsia. When only pregnant women are considered, calcium may result in little to no difference in pre-eclampsia but may result in a slight reduction in pre-eclampsia or pregnancy loss. No trials measured perinatal loss. The evidence is drawn from one trial of calcium supplementation that commenced before and continued into the first half of pregnancy. Current evidence neither supports nor refutes the routine use of calcium supplementation commencing before conception. This review was funded in part by the World Health Organization. Updated protocol (2025): PROSPERO: CRD420250649571 Review update (2019): DOI: 10.1002/14651858.CD011192.pub3 Original review (2017): DOI: 10.1002/14651858.CD011192.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Hypertensive disorders of pregnancy are a leading cause of maternal and perinatal morbidity and mortality. Calcium supplementation commenced before pregnancy may prevent the development of these disorders. This is an update of a review last published in 2019."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of calcium supplementation commenced before pregnancy on hypertensive disorders of pregnancy and related maternal and neonatal outcomes."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, CINAHL, Portal Regional BVS-Lilacs, Scopus, Web of Science, WHO ICTRP and ClinicalTrials.gov on 7 January 2025 and searched reference lists of retrieved trials and relevant systematic reviews."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) that compared calcium supplementation commenced before pregnancy with placebo or standard care. Trials conducted after 2010 needed to be prospectively registered. We applied a trustworthiness checklist."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes for women were pre-eclampsia or pregnancy loss, and pre-eclampsia. The critical outcome for children was perinatal loss. Our main important outcomes for women were pregnancy loss at any gestational age, maternal death, maternal death or severe morbidity, and adverse effects. Our main important outcomes for children were preterm delivery before 37 weeks, neonatal death or severe morbidity, stillbirth, neonatal death, and early neonatal death."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used version 2 of the Cochrane tool for assessing risk of bias in randomised trials (RoB 2)."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "Two review authors independently selected trials, extracted data, and assessed risk of bias and trustworthiness. We pooled data using random-effects meta-analysis. We assessed the certainty of the evidence using GRADE. Because conception and pregnancy loss are intermediate outcomes potentially on the causal pathway to pre-eclampsia, we chose the composite outcome 'pre-eclampsia or pregnancy loss' as the first critical outcome (and most relevant to pregnant women), and included sensitivity analyses including only women who conceived during the trial."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included one multicentre, double-blind, randomised, placebo-controlled trial. It included 1355 parous women, whose most recent planned pregnancy had been complicated by pre-eclampsia or eclampsia."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Pre-eclampsia or pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pre-eclampsia or pregnancy loss at any gestational age (risk ratio (RR) 0.85, 95% confidence interval (CI) 0.67 to 1.07; 1 RCT, 1355 women; risk difference (RD) 28/1000 fewer, 95% CI 61 fewer to 13 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.82 (95% CI 0.66 to 1.00; 1 RCT, 633 women). Pre-eclampsia Compared to placebo, calcium may result in little to no difference in pre-eclampsia (RR 0.84, 95% CI 0.62 to 1.14; 1 RCT, 1355 women; RD 19/1000 fewer, 95% CI 46 fewer to 17 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.81 (95% CI 0.61 to 1.07; 1 RCT, 633 women). Pregnancy loss at any gestational age Compared to placebo, calcium may result in little to no difference in pregnancy loss at any gestational age (RR 0.92, 95% CI 0.69 to 1.24; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 37 fewer to 28 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.89 (95% CI 0.67 to 1.17; 1 RCT, 633 women). Maternal death The evidence is very uncertain about the effect of calcium compared to placebo on maternal death (RR 1.00, 95% CI 0.14 to 7.07; 1 RCT, 1355 women; RD 0/10,000 fewer, 95% CI 25 fewer to 179 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.96 (95% CI 0.14 to 6.77; 1 RCT, 633 women). Maternal death or severe morbidity The evidence is very uncertain about the effect of calcium, compared to placebo, on maternal death or severe morbidity (RR 0.97, 95% CI 0.70 to 1.35; 1 RCT, 1355 women; RD 3/1000 fewer, 95% CI 29 fewer to 34 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.93 (95% CI 0.68 to 1.27; 1 RCT, 633 women). Preterm delivery before 37 weeks Compared to placebo, calcium may result in little to no difference in preterm delivery before 37 weeks (RR 0.94, 95% CI 0.74 to 1.19; 1 RCT, 1355 women; RD 11/1000 fewer, 95% CI 46 fewer to 33 more; low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.90 (95% CI 0.74 to 1.11; 1 RCT, 633 women). Stillbirth The evidence is very uncertain about the effect of calcium compared to placebo on stillbirth (RR 0.82, 95% CI 0.50 to 1.34; 1 RCT, 1355 women; RD 9/1000 fewer, 95% CI 24 fewer to 17 more; very low-certainty evidence). Sensitivity analysis including only women who conceived during the trial yielded a risk ratio of 0.79 (95% CI 0.48 to 1.27; 1 RCT, 633 women). The included trial did not measure perinatal loss, maternal adverse effects, neonatal death or severe morbidity, neonatal death, or early neonatal death."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "When all randomised women are considered, calcium commenced before pregnancy may result in little to no difference in pre-eclampsia or pregnancy loss, and pre-eclampsia. When only pregnant women are considered, calcium may result in little to no difference in pre-eclampsia but may result in a slight reduction in pre-eclampsia or pregnancy loss. No trials measured perinatal loss. The evidence is drawn from one trial of calcium supplementation that commenced before and continued into the first half of pregnancy. Current evidence neither supports nor refutes the routine use of calcium supplementation commencing before conception."
        },
        {
          "label": "FUNDING",
          "text": "This review was funded in part by the World Health Organization."
        },
        {
          "label": "REGISTRATION",
          "text": "Updated protocol (2025): PROSPERO: CRD420250649571 Review update (2019): DOI: 10.1002/14651858.CD011192.pub3 Original review (2017): DOI: 10.1002/14651858.CD011192.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40965861/",
      "pubDate": "2025 Sep 18",
      "doi": "10.1002/14651858.CD011192.pub4",
      "dateReceived": "2025-10-28T23:24:22.800Z",
      "isNew": false,
      "summary": "Calcium supplementation started before pregnancy may have little to no effect on pre-eclampsia or pregnancy loss, and the evidence neither supports nor refutes its routine use."
    },
    {
      "id": "49535c2e8177",
      "title": "Pragmatic Comparative Effectiveness of Primary Care Treatments for Posttraumatic Stress Disorder: A Randomized Clinical Trial.",
      "journal": "JAMA Psychiatry",
      "score": "6/7",
      "tags": [
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48690459/117961",
      "abstract": "There have only been 3 efficacy trials reporting head-to-head comparisons of pharmacotherapy and trauma-focused psychotherapy for posttraumatic stress disorder (PTSD), and none were conducted in primary care. In addition, few trials have examined treatment sequences for patients not responding to an initial treatment. To test the hypothesis that (1) brief trauma-focused psychotherapy (written exposure therapy [WET]) is more effective than a choice of 3 selective serotonin reuptake inhibitors (SSRIs; ie, sertraline, fluoxetine, or paroxetine) and (2) WET augmentation is more effective than switching to the serotonin-norepinephrine reuptake inhibitor (SNRI) venlafaxine for those not responding to an SSRI. This was a pragmatic comparative effectiveness trial conducted from April 2021 to June 2024 that randomized primary care patients to 1 of 3 treatment sequences: (1) SSRI followed by WET augmentation, (2) SSRI followed by switch to SNRI, or (3) WET followed by SSRI. Effectiveness in this pragmatic trial depends on treatment engagement and treatment fidelity. The study included patients meeting clinical criteria for PTSD from primary care clinics of 7 federally qualified health centers and 8 Department of Veterans Affairs medical centers. SSRI followed by WET augmentation, SSRI followed by switch to SNRI, or WET followed by SSRI. PTSD symptom severity, as measured by the DSM-5 PTSD Checklist (PCL-5). A total of 700 patients (mean [SD] age, 45.1 [15.4] years; 368 men [62.1%]). The mean (SD) baseline PCL-5 score was 52.8 (11.1), indicating considerable symptom severity. At 4 months, 144 of 278 patients (51.8%) randomized to an SSRI were adherent and reported a 14.0-point PCL-5 decrease, whereas 11 of 352 patients (31.5%) randomized to WET completed all sessions and reported a 12.1-point decrease. There was no significant between-group difference (adjusted mean difference [MD], 1.79; 95% CI, -0.76 to 4.34; P = .17). For the 122 of 295 patients (41.4%) randomized to an SSRI who did not respond to treatment, those randomized to switch to the SNRI reported a 9.2-point PCL-5 decrease compared with a 2.3-point decrease for those randomized to WET augmentation, which was a statistically significant between-group difference (adjusted MD, 10.19; 95% CI, 4.97-15.41; P < .001). Study results showed that treatment of PTSD in primary care with either SSRIs or WET was feasible and effective. For patients not responding to an SSRI, switching to an SNRI may be more effective than WET augmentation. ClinicalTrials.gov Identifier: NCT04597190.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There have only been 3 efficacy trials reporting head-to-head comparisons of pharmacotherapy and trauma-focused psychotherapy for posttraumatic stress disorder (PTSD), and none were conducted in primary care. In addition, few trials have examined treatment sequences for patients not responding to an initial treatment."
        },
        {
          "label": "OBJECTIVE",
          "text": "To test the hypothesis that (1) brief trauma-focused psychotherapy (written exposure therapy [WET]) is more effective than a choice of 3 selective serotonin reuptake inhibitors (SSRIs; ie, sertraline, fluoxetine, or paroxetine) and (2) WET augmentation is more effective than switching to the serotonin-norepinephrine reuptake inhibitor (SNRI) venlafaxine for those not responding to an SSRI."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a pragmatic comparative effectiveness trial conducted from April 2021 to June 2024 that randomized primary care patients to 1 of 3 treatment sequences: (1) SSRI followed by WET augmentation, (2) SSRI followed by switch to SNRI, or (3) WET followed by SSRI. Effectiveness in this pragmatic trial depends on treatment engagement and treatment fidelity. The study included patients meeting clinical criteria for PTSD from primary care clinics of 7 federally qualified health centers and 8 Department of Veterans Affairs medical centers."
        },
        {
          "label": "INTERVENTIONS",
          "text": "SSRI followed by WET augmentation, SSRI followed by switch to SNRI, or WET followed by SSRI."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "PTSD symptom severity, as measured by the DSM-5 PTSD Checklist (PCL-5)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 700 patients (mean [SD] age, 45.1 [15.4] years; 368 men [62.1%]). The mean (SD) baseline PCL-5 score was 52.8 (11.1), indicating considerable symptom severity. At 4 months, 144 of 278 patients (51.8%) randomized to an SSRI were adherent and reported a 14.0-point PCL-5 decrease, whereas 11 of 352 patients (31.5%) randomized to WET completed all sessions and reported a 12.1-point decrease. There was no significant between-group difference (adjusted mean difference [MD], 1.79; 95% CI, -0.76 to 4.34; P = .17). For the 122 of 295 patients (41.4%) randomized to an SSRI who did not respond to treatment, those randomized to switch to the SNRI reported a 9.2-point PCL-5 decrease compared with a 2.3-point decrease for those randomized to WET augmentation, which was a statistically significant between-group difference (adjusted MD, 10.19; 95% CI, 4.97-15.41; P < .001)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Study results showed that treatment of PTSD in primary care with either SSRIs or WET was feasible and effective. For patients not responding to an SSRI, switching to an SNRI may be more effective than WET augmentation."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04597190."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41091477/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1001/jamapsychiatry.2025.2962",
      "dateReceived": "2025-10-28T23:24:22.799Z",
      "isNew": false,
      "summary": "Both SSRIs and WET are viable treatments for PTSD in primary care, but switching to an SNRI may be more effective than adding WET for patients who don't respond to an SSRI."
    },
    {
      "id": "ba23c267a537",
      "title": "Reevaluating Nonoperative Management for Pediatric Uncomplicated Acute Appendicitis: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Pediatr",
      "score": "6/7",
      "tags": [
        "Gastroenterology",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48595609/117868",
      "abstract": "Nonoperative management (NOM) has emerged as a potential alternative to surgery for acute uncomplicated appendicitis in children; however, while short-term outcomes are often favorable, concerns remain about treatment durability, complication rates, and long-term failure. An updated meta-analysis of randomized clinical trials (RCTs) may help clarify the comparative safety and effectiveness of NOM vs appendectomy. To evaluate the safety and effectiveness of NOM compared with appendectomy for uncomplicated appendicitis in children using the highest level of available evidence. A systematic review of PubMed, Embase, Scopus, Cochrane, and Web of Science was conducted from inception through March 2025 to identify randomized clinical trials comparing NOM with surgical management in pediatric patients. RCTs comparing NOM vs surgical management in pediatric patients younger than 18 years were included. Nonrandomized and quasi-randomized studies were excluded. Data were extracted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Meta-analyses were conducted using random-effects models. Risk of bias was assessed independently by multiple reviewers. Trial sequential analysis was performed to determine whether the evidence was sufficiently robust and conclusive. The primary outcomes were treatment failure and treatment success in 1 year and major complications (Clavien-Dindo grade ≥IIIb). Secondary outcomes included time to return to school and time to return to normal activity. Of 1246 studies screened, 7 RCTs, including 1480 pediatric patients, met inclusion criteria. Treatment failure was significantly higher in the NOM group than in the appendectomy group at 1 year (risk ratio [RR], 4.97; 95% CI, 3.57-6.91; I2 = 0.0%). Treatment success was significantly lower in the NOM group at 1 year (RR, 0.67; 95% CI, 0.60-0.75; I2 = 31.1%). Major complications classified as Clavien-Dindo grade IIIb or worse were more frequent in the NOM group (RR, 33.37; 95% CI, 7.89-141.05; I2 = 9.5%). Appendicitis recurred at a rate of 18.47 events/100 observations (95% CI, 12.62-25.07 events/100 observations; I2 = 48.5%) among patients who received NOM. NOM, compared with appendectomy, was associated with a modestly faster return to school (mean difference, -1.36 days; 95% CI, -2.64 to -0.08 days; P = .04; I2 = 57.7%) and return to normal activities (-4.93 days; 95% CI, -8.68 to -1.19 days; P = .01; I2 = 87.2%), although this may be offset by subsequent readmissions or reintervention. Trial sequential analysis demonstrated the robustness and conclusiveness of primary outcomes. In contrast to earlier studies, this meta-analysis found significantly higher treatment failure and major complication rates within a year with NOM among children and adolescents. The meta-analysis provides pediatricians and pediatric surgeons with up-to-date data to inform shared decision-making with families and encourage individualized, patient-centered treatment.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Nonoperative management (NOM) has emerged as a potential alternative to surgery for acute uncomplicated appendicitis in children; however, while short-term outcomes are often favorable, concerns remain about treatment durability, complication rates, and long-term failure. An updated meta-analysis of randomized clinical trials (RCTs) may help clarify the comparative safety and effectiveness of NOM vs appendectomy."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the safety and effectiveness of NOM compared with appendectomy for uncomplicated appendicitis in children using the highest level of available evidence."
        },
        {
          "label": "DATA SOURCES",
          "text": "A systematic review of PubMed, Embase, Scopus, Cochrane, and Web of Science was conducted from inception through March 2025 to identify randomized clinical trials comparing NOM with surgical management in pediatric patients."
        },
        {
          "label": "STUDY SELECTION",
          "text": "RCTs comparing NOM vs surgical management in pediatric patients younger than 18 years were included. Nonrandomized and quasi-randomized studies were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Data were extracted following Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines. Meta-analyses were conducted using random-effects models. Risk of bias was assessed independently by multiple reviewers. Trial sequential analysis was performed to determine whether the evidence was sufficiently robust and conclusive."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcomes were treatment failure and treatment success in 1 year and major complications (Clavien-Dindo grade ≥IIIb). Secondary outcomes included time to return to school and time to return to normal activity."
        },
        {
          "label": "RESULTS",
          "text": "Of 1246 studies screened, 7 RCTs, including 1480 pediatric patients, met inclusion criteria. Treatment failure was significantly higher in the NOM group than in the appendectomy group at 1 year (risk ratio [RR], 4.97; 95% CI, 3.57-6.91; I2 = 0.0%). Treatment success was significantly lower in the NOM group at 1 year (RR, 0.67; 95% CI, 0.60-0.75; I2 = 31.1%). Major complications classified as Clavien-Dindo grade IIIb or worse were more frequent in the NOM group (RR, 33.37; 95% CI, 7.89-141.05; I2 = 9.5%). Appendicitis recurred at a rate of 18.47 events/100 observations (95% CI, 12.62-25.07 events/100 observations; I2 = 48.5%) among patients who received NOM. NOM, compared with appendectomy, was associated with a modestly faster return to school (mean difference, -1.36 days; 95% CI, -2.64 to -0.08 days; P = .04; I2 = 57.7%) and return to normal activities (-4.93 days; 95% CI, -8.68 to -1.19 days; P = .01; I2 = 87.2%), although this may be offset by subsequent readmissions or reintervention. Trial sequential analysis demonstrated the robustness and conclusiveness of primary outcomes."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In contrast to earlier studies, this meta-analysis found significantly higher treatment failure and major complication rates within a year with NOM among children and adolescents. The meta-analysis provides pediatricians and pediatric surgeons with up-to-date data to inform shared decision-making with families and encourage individualized, patient-centered treatment."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41046476/",
      "pubDate": "2025 Oct 05",
      "doi": "10.1001/jamapediatrics.2025.4091",
      "dateReceived": "2025-10-27T23:23:09.498Z",
      "isNew": false,
      "summary": "Non-operative management (NOM) in children and adolescents resulted in significantly higher treatment failure and major complication rates within a year compared to previous findings."
    },
    {
      "id": "30e627f7a05d",
      "title": "Antiviral efficacy of oral ensitrelvir versus oral ritonavir-boosted nirmatrelvir in COVID-19 (PLATCOV): an open-label, phase 2, randomised, controlled, adaptive trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48672768/117929",
      "abstract": "Ensitrelvir is an oral antiviral treatment for COVID-19 with the same molecular target (the main protease) as ritonavir-boosted nirmatrelvir-the current oral first-line treatment. We aimed to compare the clinical antiviral effects of the two drugs. In an open-label, phase 2, randomised, controlled, adaptive pharmacometric platform trial, low-risk adult outpatients aged 18-60 years with early symptomatic COVID-19 (<4 days of symptoms) were recruited from hospital acute respiratory infection clinics in Thailand and Laos. Patients were randomly assigned in blocks (block sizes depended on the number of interventions available) to one of eight treatment groups, including oral ensitrelvir and oral ritonavir-boosted nirmatrelvir at standard doses, both given for 5 days, and no study drug. The primary endpoint was the oropharyngeal SARS-CoV-2 viral clearance rate assessed between day 0 and day 5 in the modified intention-to-treat population (defined as patients with at least 2 days of follow-up). Patients had four oropharyngeal swabs taken on day 0 and two swabs taken daily from days 1 to 7, then on days 10 and 14. Viral clearance rates were derived under a Bayesian hierarchical linear model fitted to log viral densities in standardised paired oropharyngeal swab eluates taken daily over the 5 days (14 samples). An individual patient data meta-analysis of all small molecule drugs evaluated in this platform trial using published results was also performed, adjusting for temporal trends in viral clearance. This trial is registered at ClinicalTrials.gov, NCT05041907. Between March 17, 2023, and April 21, 2024, 604 of 903 patients enrolled were concurrently assigned to the three treatment groups (ensitrelvir n=202; ritonavir-boosted nirmatrelvir n=207; no study drug n=195). Median estimated SARS-CoV-2 clearance half-lives were 5·9 h (IQR 4·0-8·6) with ensitrelvir, 5·2 h (3·8-6·6) with nirmatrelvir, and 11·6 h (8·1-14·5) with no study drug. Viral clearance following ensitrelvir was 82% faster (95% credible interval 61-104) than no study drug and 16% slower (5-25) than ritonavir-boosted nirmatrelvir. In the meta-analysis of all unblinded small molecule drugs evaluated in the platform trial, nirmatrelvir and ensitrelvir had the largest antiviral effects (1157 patients). Viral rebound occurred in 15 (7%) of 207 patients in the nirmatrelvir group and 10 (5%) of 202 in the ensitrelvir group (p=0·45). Both ensitrelvir and nirmatrelvir accelerate oropharyngeal SARS-CoV-2 viral clearance. Ensitrelvir is an effective alternative to currently available antivirals in treating COVID-19. Although COVID-19 is now generally a mild disease, it still causes substantial morbidity, particularly in vulnerable groups, and new variants or other coronaviruses could still emerge with pandemic potential. Safe effective and affordable antivirals are needed, and these are best assessed initially in pharmacometric platform trials assessing viral clearance. Wellcome Trust through the COVID-19 Therapeutics Accelerator.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Ensitrelvir is an oral antiviral treatment for COVID-19 with the same molecular target (the main protease) as ritonavir-boosted nirmatrelvir-the current oral first-line treatment. We aimed to compare the clinical antiviral effects of the two drugs."
        },
        {
          "label": "METHODS",
          "text": "In an open-label, phase 2, randomised, controlled, adaptive pharmacometric platform trial, low-risk adult outpatients aged 18-60 years with early symptomatic COVID-19 (<4 days of symptoms) were recruited from hospital acute respiratory infection clinics in Thailand and Laos. Patients were randomly assigned in blocks (block sizes depended on the number of interventions available) to one of eight treatment groups, including oral ensitrelvir and oral ritonavir-boosted nirmatrelvir at standard doses, both given for 5 days, and no study drug. The primary endpoint was the oropharyngeal SARS-CoV-2 viral clearance rate assessed between day 0 and day 5 in the modified intention-to-treat population (defined as patients with at least 2 days of follow-up). Patients had four oropharyngeal swabs taken on day 0 and two swabs taken daily from days 1 to 7, then on days 10 and 14. Viral clearance rates were derived under a Bayesian hierarchical linear model fitted to log viral densities in standardised paired oropharyngeal swab eluates taken daily over the 5 days (14 samples). An individual patient data meta-analysis of all small molecule drugs evaluated in this platform trial using published results was also performed, adjusting for temporal trends in viral clearance. This trial is registered at ClinicalTrials.gov, NCT05041907."
        },
        {
          "label": "FINDINGS",
          "text": "Between March 17, 2023, and April 21, 2024, 604 of 903 patients enrolled were concurrently assigned to the three treatment groups (ensitrelvir n=202; ritonavir-boosted nirmatrelvir n=207; no study drug n=195). Median estimated SARS-CoV-2 clearance half-lives were 5·9 h (IQR 4·0-8·6) with ensitrelvir, 5·2 h (3·8-6·6) with nirmatrelvir, and 11·6 h (8·1-14·5) with no study drug. Viral clearance following ensitrelvir was 82% faster (95% credible interval 61-104) than no study drug and 16% slower (5-25) than ritonavir-boosted nirmatrelvir. In the meta-analysis of all unblinded small molecule drugs evaluated in the platform trial, nirmatrelvir and ensitrelvir had the largest antiviral effects (1157 patients). Viral rebound occurred in 15 (7%) of 207 patients in the nirmatrelvir group and 10 (5%) of 202 in the ensitrelvir group (p=0·45)."
        },
        {
          "label": "INTERPRETATION",
          "text": "Both ensitrelvir and nirmatrelvir accelerate oropharyngeal SARS-CoV-2 viral clearance. Ensitrelvir is an effective alternative to currently available antivirals in treating COVID-19. Although COVID-19 is now generally a mild disease, it still causes substantial morbidity, particularly in vulnerable groups, and new variants or other coronaviruses could still emerge with pandemic potential. Safe effective and affordable antivirals are needed, and these are best assessed initially in pharmacometric platform trials assessing viral clearance."
        },
        {
          "label": "FUNDING",
          "text": "Wellcome Trust through the COVID-19 Therapeutics Accelerator."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41082886/",
      "pubDate": "2025 Oct 10",
      "doi": "10.1016/S1473-3099(25)00482-7",
      "dateReceived": "2025-10-26T23:23:01.059Z",
      "isNew": false,
      "summary": "Ensitrelvir and ritonavir-boosted nirmatrelvir demonstrated similar SARS-CoV-2 viral clearance rates in outpatients with early COVID-19, both outperforming no treatment."
    },
    {
      "id": "88b62bbfbf92",
      "title": "Outcomes of cardiovascular screening in men aged 60-64 years: the DANCAVAS II trial.",
      "journal": "Eur Heart J",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48672768/117914",
      "abstract": "Limited data suggest a benefit of population-based screening for cardiovascular disease (CVD) with respect to mortality. A population-based, parallel-randomized controlled trial of Danish men aged 60-64 years randomized 1:4 to invitation to screening for subclinical CVD or no invitation (control group) were performed. Allocation was based on computer-generated random numbers and stratified on municipality. Only the control group was blinded. The screening included coronary artery calcification score, aneurysms, atrial fibrillation, peripheral arterial disease, hypertension, diabetes mellitus and hypercholesterolemia. Intervention included statin, aspirin and surveillance. The primary outcome was all-cause mortality. 31,268 participants were randomized; 25,322 men in the control arm and 5,946 in the invited arm, of whom 3,720 attended and were screened (62·6%). In intention-to-treat analyses, after a median follow-up of 7·0 years, 555 (9.3%) men in the intervention group and 2,509 (9·9%) men in the control group had died; hazard ratio (HR) = 0.94 (95% CI: 0·86;1·03), p=0·169.Major adverse cardiovascular events (MACE) were registered in 606 (10·2%) versus 2,682 (10·6%) (HR=0·96 [95% CI 0·88;1.04]; p=0·319).Severe bleedings were significantly more common in the invited-to-screening group (6·0% versus 5·1%; HR=1·18 [95% CI 1·05;1·32]; p=0·007). This included intracranial (HR=1·23 (95% CI 0·96;1·58); p=0·097) and gastrointestinal bleedings (HR=1·18; (95% CI 1·03;1·34) p=0·014), respectively. Invitation to a comprehensive CT-based screening for subclinical CVD did not decrease death over 7 years among men aged 60-64 years but did increase severe bleeding. Because the trial was powered for events over 10 years, further follow-up is needed. Clinicaltrials.gov number: NCT03946410.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Limited data suggest a benefit of population-based screening for cardiovascular disease (CVD) with respect to mortality."
        },
        {
          "label": "METHODS",
          "text": "A population-based, parallel-randomized controlled trial of Danish men aged 60-64 years randomized 1:4 to invitation to screening for subclinical CVD or no invitation (control group) were performed. Allocation was based on computer-generated random numbers and stratified on municipality. Only the control group was blinded. The screening included coronary artery calcification score, aneurysms, atrial fibrillation, peripheral arterial disease, hypertension, diabetes mellitus and hypercholesterolemia. Intervention included statin, aspirin and surveillance. The primary outcome was all-cause mortality."
        },
        {
          "label": "RESULTS",
          "text": "31,268 participants were randomized; 25,322 men in the control arm and 5,946 in the invited arm, of whom 3,720 attended and were screened (62·6%). In intention-to-treat analyses, after a median follow-up of 7·0 years, 555 (9.3%) men in the intervention group and 2,509 (9·9%) men in the control group had died; hazard ratio (HR) = 0.94 (95% CI: 0·86;1·03), p=0·169.Major adverse cardiovascular events (MACE) were registered in 606 (10·2%) versus 2,682 (10·6%) (HR=0·96 [95% CI 0·88;1.04]; p=0·319).Severe bleedings were significantly more common in the invited-to-screening group (6·0% versus 5·1%; HR=1·18 [95% CI 1·05;1·32]; p=0·007). This included intracranial (HR=1·23 (95% CI 0·96;1·58); p=0·097) and gastrointestinal bleedings (HR=1·18; (95% CI 1·03;1·34) p=0·014), respectively."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Invitation to a comprehensive CT-based screening for subclinical CVD did not decrease death over 7 years among men aged 60-64 years but did increase severe bleeding. Because the trial was powered for events over 10 years, further follow-up is needed. Clinicaltrials.gov number: NCT03946410."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40884758/",
      "pubDate": "2025 Aug 30",
      "doi": "10.1093/eurheartj/ehaf704",
      "dateReceived": "2025-10-26T23:23:01.059Z",
      "isNew": false,
      "summary": "A CT-based screening for subclinical cardiovascular disease did not reduce mortality in men aged 60-64 over 7 years, but it did increase severe bleeding, and further follow-up is required."
    },
    {
      "id": "8e7f67835bb4",
      "title": "Impact of exercise training during pregnancy on maternal biomarkers: a systematic review.",
      "journal": "Am J Obstet Gynecol",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48588298/117892",
      "abstract": "The aim of this systematic review was to identify and analyze biomarkers that are influenced by physical exercise during pregnancy and that contribute to maternal-fetal health and development. A comprehensive systematic search of PubMed, Web of Science, and Elton B. Stephens Company Host databases was conducted without time restriction in accordance with Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines (PROSPERO ID: CRD420251017740). Eligible studies were randomized controlled trials examining the effects of exercise interventions during pregnancy on biomarkers measured in maternal serum, umbilical cord blood, breast milk, and placental tissue. Eleven randomized controlled trials meeting the inclusion criteria were analyzed. The effects of different exercise modalities, durations, and intensities on a wide range of biomarkers were evaluated. Exercise interventions performed for 12 weeks or longer with 2 to 3 weekly sessions at moderate-to-vigorous intensity, demonstrated substantial effects on several biomarkers. These included a reduction in proinflammatory markers (TNF-α, interleukin 6), an increase in antiinflammatory cytokines (interleukin 10), improved lipid profiles (lower low-density lipoprotein, triglycerides), improved glucose regulation, and favorable changes in hormonal markers such as leptin and brain-derived neurotrophic factor. Additionally, exercise was associated with positive changes in umbilical cord blood cytokines, immunologic composition of breast milk, and placental mineral content. Structured exercise programs during pregnancy, particularly resistance training and aerobic exercise performed in the same session, show promising effects on modulating inflammatory, metabolic, and immunologic biomarkers that may contribute to improved maternal-fetal health outcomes. However, current evidence is limited by methodological heterogeneity and lack of data from early pregnancy.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "The aim of this systematic review was to identify and analyze biomarkers that are influenced by physical exercise during pregnancy and that contribute to maternal-fetal health and development."
        },
        {
          "label": "DATA SOURCES",
          "text": "A comprehensive systematic search of PubMed, Web of Science, and Elton B. Stephens Company Host databases was conducted without time restriction in accordance with Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines (PROSPERO ID: CRD420251017740)."
        },
        {
          "label": "STUDY ELIGIBILITY CRITERIA",
          "text": "Eligible studies were randomized controlled trials examining the effects of exercise interventions during pregnancy on biomarkers measured in maternal serum, umbilical cord blood, breast milk, and placental tissue."
        },
        {
          "label": "STUDY APPRAISAL AND SYNTHESIS METHODS",
          "text": "Eleven randomized controlled trials meeting the inclusion criteria were analyzed. The effects of different exercise modalities, durations, and intensities on a wide range of biomarkers were evaluated."
        },
        {
          "label": "RESULTS",
          "text": "Exercise interventions performed for 12 weeks or longer with 2 to 3 weekly sessions at moderate-to-vigorous intensity, demonstrated substantial effects on several biomarkers. These included a reduction in proinflammatory markers (TNF-α, interleukin 6), an increase in antiinflammatory cytokines (interleukin 10), improved lipid profiles (lower low-density lipoprotein, triglycerides), improved glucose regulation, and favorable changes in hormonal markers such as leptin and brain-derived neurotrophic factor. Additionally, exercise was associated with positive changes in umbilical cord blood cytokines, immunologic composition of breast milk, and placental mineral content."
        },
        {
          "label": "CONCLUSION",
          "text": "Structured exercise programs during pregnancy, particularly resistance training and aerobic exercise performed in the same session, show promising effects on modulating inflammatory, metabolic, and immunologic biomarkers that may contribute to improved maternal-fetal health outcomes. However, current evidence is limited by methodological heterogeneity and lack of data from early pregnancy."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40947085/",
      "pubDate": "2025 Sep 12",
      "doi": "10.1016/j.ajog.2025.09.021",
      "dateReceived": "2025-10-26T23:23:01.059Z",
      "isNew": false,
      "summary": "Structured exercise, especially combined resistance and aerobic training, during pregnancy may improve maternal and fetal health by influencing inflammatory, metabolic, and immune markers, but more research is needed, particularly in early pregnancy."
    },
    {
      "id": "c3d7e587a38a",
      "title": "Comparative efficacy and safety of exercise modalities in knee osteoarthritis: systematic review and network meta-analysis.",
      "journal": "BMJ",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48588298/117890",
      "abstract": "To assess the efficacy and safety of various exercise modalities as therapeutic interventions for managing knee osteoarthritis. Systematic review with network meta-analysis. PubMed, Embase, Cochrane Library, Web of Science, CINAHL, PsycINFO, AMED, PEDro, Scopus, ClinicalTrials.gov, ICTRP, and ClinicalTrialsRegister.eu from database inception to August 2024. Randomised controlled trials comparing different exercise modalities, including aerobic exercise, flexibility exercise, mind-body exercise, neuromotor exercise, strengthening exercise, mixed exercise, and control group for patients with knee osteoarthritis. Primary outcomes included pain, function, gait performance, and quality of life, assessed at short term (four weeks), mid-term (12 weeks), and long term (24 weeks) follow-up. When exact time points were unavailable, data from adjacent time windows were used. 217 randomised controlled trials involving 15 684 participants were included. Moderate certainty evidence showed that, compared with the control group, aerobic exercise probably results in large improvements in pain at short term (standardised mean difference -1.10, 95% confidence interval -1.68 to -0.52) and mid-term follow-up (-1.19, -1.59 to -0.79), function at mid-term (1.78, 1.05 to 2.51), gait performance at mid-term (0.85, 0.55 to 1.14), and quality of life at short term (1.53, 0.47 to 2.59). Mind-body exercise probably results in a large increase in function at short term follow-up (0.88, 0.03 to 1.73; moderate certainty), while neuromotor exercise probably results in a large increase in gait performance at short term follow-up (1.04, 0.51 to 1.57; moderate certainty). Strengthening (0.86, 0.53 to 1.18) and mixed exercise (1.07, 0.68 to 1.46) probably result in a large increase in function at mid-term follow-up, all with moderate certainty evidence. Regarding long term follow-up, flexibility exercise may result in a large reduction in pain (-0.99, -1.63 to -0.36; low certainty); aerobic exercise may result in a large increase in function (0.87, 0.02 to 1.72, low certainty); and mixed exercise may increase function (0.56, 0.26 to 0.86; low certainty) and probably increases gait performance (0.57, 0.21 to 0.92, moderate certainty). Overall, aerobic exercise consistently showed the highest probability of being the best treatment, as reflected by surface under the cumulative ranking curve values (mean 0.72) across outcomes. The safety outcome was reported in a small proportion of studies (40 studies, 18%), and no clear differences were observed between exercise interventions and control. In patients with knee osteoarthritis, aerobic exercise is likely the most beneficial exercise modality for improving pain, function, gait performance, and quality of life, with moderate certainty. PROSPERO CRD42023469762.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess the efficacy and safety of various exercise modalities as therapeutic interventions for managing knee osteoarthritis."
        },
        {
          "label": "DESIGN",
          "text": "Systematic review with network meta-analysis."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, Embase, Cochrane Library, Web of Science, CINAHL, PsycINFO, AMED, PEDro, Scopus, ClinicalTrials.gov, ICTRP, and ClinicalTrialsRegister.eu from database inception to August 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA FOR SELECTING STUDIES",
          "text": "Randomised controlled trials comparing different exercise modalities, including aerobic exercise, flexibility exercise, mind-body exercise, neuromotor exercise, strengthening exercise, mixed exercise, and control group for patients with knee osteoarthritis."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Primary outcomes included pain, function, gait performance, and quality of life, assessed at short term (four weeks), mid-term (12 weeks), and long term (24 weeks) follow-up. When exact time points were unavailable, data from adjacent time windows were used."
        },
        {
          "label": "RESULTS",
          "text": "217 randomised controlled trials involving 15 684 participants were included. Moderate certainty evidence showed that, compared with the control group, aerobic exercise probably results in large improvements in pain at short term (standardised mean difference -1.10, 95% confidence interval -1.68 to -0.52) and mid-term follow-up (-1.19, -1.59 to -0.79), function at mid-term (1.78, 1.05 to 2.51), gait performance at mid-term (0.85, 0.55 to 1.14), and quality of life at short term (1.53, 0.47 to 2.59). Mind-body exercise probably results in a large increase in function at short term follow-up (0.88, 0.03 to 1.73; moderate certainty), while neuromotor exercise probably results in a large increase in gait performance at short term follow-up (1.04, 0.51 to 1.57; moderate certainty). Strengthening (0.86, 0.53 to 1.18) and mixed exercise (1.07, 0.68 to 1.46) probably result in a large increase in function at mid-term follow-up, all with moderate certainty evidence. Regarding long term follow-up, flexibility exercise may result in a large reduction in pain (-0.99, -1.63 to -0.36; low certainty); aerobic exercise may result in a large increase in function (0.87, 0.02 to 1.72, low certainty); and mixed exercise may increase function (0.56, 0.26 to 0.86; low certainty) and probably increases gait performance (0.57, 0.21 to 0.92, moderate certainty). Overall, aerobic exercise consistently showed the highest probability of being the best treatment, as reflected by surface under the cumulative ranking curve values (mean 0.72) across outcomes. The safety outcome was reported in a small proportion of studies (40 studies, 18%), and no clear differences were observed between exercise interventions and control."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In patients with knee osteoarthritis, aerobic exercise is likely the most beneficial exercise modality for improving pain, function, gait performance, and quality of life, with moderate certainty."
        },
        {
          "label": "SYSTEMATIC REVIEW REGISTRATION",
          "text": "PROSPERO CRD42023469762."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41093618/",
      "pubDate": "2025 Oct 15",
      "doi": "10.1136/bmj-2025-085242",
      "dateReceived": "2025-10-26T23:23:01.059Z",
      "isNew": false,
      "summary": "Aerobic exercise is likely the most effective exercise type for improving pain, function, gait, and quality of life in individuals with knee osteoarthritis."
    },
    {
      "id": "7455e3a5ca26",
      "title": "Antibiotic prophylaxis for corneal abrasion.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatric Emergency Medicine",
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/48588298/117855",
      "abstract": "Corneal abrasion is a condition frequently treated by eye care professionals, emergency physicians, and primary care physicians. Topical ophthalmic antibiotics are the most common therapy for corneal abrasion. However, there has been no comprehensive summary and synthesis of the evidence regarding antibiotic prophylaxis in traumatic corneal abrasion. In this review update, we evaluated the current evidence regarding the benefits and harms of antibiotic treatment for this relatively common emergency condition. This is an update of a review published in 2022. To assess the benefits and harms of topical antibiotic prophylaxis for corneal abrasion. We searched CENTRAL, MEDLINE, Embase.com, two other databases, and two trials registries together with reference checking to identify studies that are included in the review. The latest search date was 28 March 2025. We included randomized controlled trials (RCTs) comparing an antibiotic with another antibiotic or with placebo in children and adults with corneal abrasion(s). Outcomes included the following: risk of any ocular infection up to one month following corneal abrasion, proportion of eyes healed within 48 hours, participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, complications of corneal abrasion, and treatment-related adverse events at the longest follow-up. Using the Cochrane risk of bias (RoB) 2 tool, we assessed the RoB for the three reported outcomes. We synthesized results for each outcome using meta-analysis by calculating risk ratios (RR) with 95% confidence intervals (CI) for dichotomous outcomes where possible; otherwise, we summarized the results narratively. We used GRADE to assess the certainty of evidence for prespecified outcomes. We included four RCTs enrolling a total of 998 participants, ranging from 20 to 437 participants. The included studies were published from 1975 to 1998, and conducted in Denmark (1), the Republic of Korea (1), and the UK (2). The length of follow-up was 24 hours to four weeks, or unspecified in two studies. Two studies had industry support. Participants had a mean age of 35 years (range 5 to 80 years) in one study, while the other three studies reported age ranges from 15 to 64 years. Most participants had traumatic corneal abrasions, commonly following foreign body removal. Two studies compared topical antibiotics with placebo (vehicle ointment or sodium hyaluronic acid drops), while three studies compared chloramphenicol ointment with antibiotics from other classes. One study was a three-arm study that compared two antibiotic regimens and one vehicle control. We judged the risk of bias from one study as raising some concerns about two efficacy outcomes, and three studies as having a high risk of overall bias across three outcomes. We classified study interventions into two comparisons: 1) antibiotics versus placebo, and 2) chloramphenicol versus other classes of antibiotics. Overall, we judged the certainty of evidence as very low for all outcomes due to imprecision, indirectness, and risk of bias. Two studies compared antibiotics with placebo. For one study, we combined the data for the sulfacetamide sodium and chloramphenicol ointment groups and compared them with a vehicle control group in a three-arm study. This study suggested that antibiotics may increase the risk of ocular infection (RR 1.32, 95% CI 1.03 to 1.70; 1 study, 320 participants). The same study found little to no difference in healing within 48 hours (RR 0.94, 95% CI 0.88 to 1.00). Another study compared tobramycin with sodium hyaluronic acid and reported complete healing in most eyes by 48 hours, with no incidence of infection; however, the study was not included in the meta-analysis because of unit-of-analysis issues. One study reported severe allergic reactions to medication or other adverse events leading to participant withdrawal. The analysis showed no evidence of a difference in treatment-related adverse events between antibiotics and placebo (RR 0.77, 95% CI 0.40 to 1.47; 1 study, 437 participants). Another study reported no adverse events in both arms but was not included in the analysis because it was unclear how the outcomes were measured. Three studies compared chloramphenicol with other classes of antibiotics (fusidic acid or sulfacetamide sodium). The pooled analysis showed little to no difference in the risk of ocular infection within one month (RR 1.07, 95% CI 0.87 to 1.31; 3 studies, 651 participants). One study reported no positive cultures in either group, although minor inflammatory signs (e.g. conjunctival hyperemia) were noted in the chloramphenicol arm. For corneal healing within 48 hours, three studies assessed cure rates within 24 hours using slightly different definitions, but the pooled analysis again showed no clinically meaningful difference between groups (RR 1.00, 95% CI 0.94 to 1.06; 3 studies, 651 participants). Two studies found no evidence of a difference in the incidence of treatment-related adverse events between groups (RR 1.01, 95% CI 0.47 to 2.17; 2 studies, 677 participants). Another study reported that one-third of participants in both groups experienced discomfort or itching, although these outcomes were not reported separately by each treatment arm. For both comparisons, none of the included studies reported the following prespecified outcomes: participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, and complications of corneal abrasion up to the longest follow-up. Given that the evidence supporting antibiotic use in corneal abrasion is of very low certainty, we are not able to support a specific antibiotic regimen or draw conclusions about the effects of antibiotic prophylaxis in preventing ocular infection or accelerating epithelial healing. Future research could explore adequately powered RCTs or alternative approaches, such as target trial emulation, while focusing on high-risk populations and antibiotic formulations. The Cochrane Eyes and Vision US Project is supported by grant UG1EY020522, National Eye Institute, National Institutes of Health. Protocol (2021) DOI: 10.1002/14651858.CD014617 Original Review (2022) DOI: 10.1002/14651858.CD014617.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "Corneal abrasion is a condition frequently treated by eye care professionals, emergency physicians, and primary care physicians. Topical ophthalmic antibiotics are the most common therapy for corneal abrasion. However, there has been no comprehensive summary and synthesis of the evidence regarding antibiotic prophylaxis in traumatic corneal abrasion. In this review update, we evaluated the current evidence regarding the benefits and harms of antibiotic treatment for this relatively common emergency condition. This is an update of a review published in 2022."
        },
        {
          "label": "OBJECTIVES",
          "text": "To assess the benefits and harms of topical antibiotic prophylaxis for corneal abrasion."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase.com, two other databases, and two trials registries together with reference checking to identify studies that are included in the review. The latest search date was 28 March 2025."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomized controlled trials (RCTs) comparing an antibiotic with another antibiotic or with placebo in children and adults with corneal abrasion(s)."
        },
        {
          "label": "OUTCOMES",
          "text": "Outcomes included the following: risk of any ocular infection up to one month following corneal abrasion, proportion of eyes healed within 48 hours, participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, complications of corneal abrasion, and treatment-related adverse events at the longest follow-up."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Using the Cochrane risk of bias (RoB) 2 tool, we assessed the RoB for the three reported outcomes."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We synthesized results for each outcome using meta-analysis by calculating risk ratios (RR) with 95% confidence intervals (CI) for dichotomous outcomes where possible; otherwise, we summarized the results narratively. We used GRADE to assess the certainty of evidence for prespecified outcomes."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included four RCTs enrolling a total of 998 participants, ranging from 20 to 437 participants. The included studies were published from 1975 to 1998, and conducted in Denmark (1), the Republic of Korea (1), and the UK (2). The length of follow-up was 24 hours to four weeks, or unspecified in two studies. Two studies had industry support. Participants had a mean age of 35 years (range 5 to 80 years) in one study, while the other three studies reported age ranges from 15 to 64 years. Most participants had traumatic corneal abrasions, commonly following foreign body removal. Two studies compared topical antibiotics with placebo (vehicle ointment or sodium hyaluronic acid drops), while three studies compared chloramphenicol ointment with antibiotics from other classes. One study was a three-arm study that compared two antibiotic regimens and one vehicle control. We judged the risk of bias from one study as raising some concerns about two efficacy outcomes, and three studies as having a high risk of overall bias across three outcomes."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "We classified study interventions into two comparisons: 1) antibiotics versus placebo, and 2) chloramphenicol versus other classes of antibiotics. Overall, we judged the certainty of evidence as very low for all outcomes due to imprecision, indirectness, and risk of bias. Two studies compared antibiotics with placebo. For one study, we combined the data for the sulfacetamide sodium and chloramphenicol ointment groups and compared them with a vehicle control group in a three-arm study. This study suggested that antibiotics may increase the risk of ocular infection (RR 1.32, 95% CI 1.03 to 1.70; 1 study, 320 participants). The same study found little to no difference in healing within 48 hours (RR 0.94, 95% CI 0.88 to 1.00). Another study compared tobramycin with sodium hyaluronic acid and reported complete healing in most eyes by 48 hours, with no incidence of infection; however, the study was not included in the meta-analysis because of unit-of-analysis issues. One study reported severe allergic reactions to medication or other adverse events leading to participant withdrawal. The analysis showed no evidence of a difference in treatment-related adverse events between antibiotics and placebo (RR 0.77, 95% CI 0.40 to 1.47; 1 study, 437 participants). Another study reported no adverse events in both arms but was not included in the analysis because it was unclear how the outcomes were measured. Three studies compared chloramphenicol with other classes of antibiotics (fusidic acid or sulfacetamide sodium). The pooled analysis showed little to no difference in the risk of ocular infection within one month (RR 1.07, 95% CI 0.87 to 1.31; 3 studies, 651 participants). One study reported no positive cultures in either group, although minor inflammatory signs (e.g. conjunctival hyperemia) were noted in the chloramphenicol arm. For corneal healing within 48 hours, three studies assessed cure rates within 24 hours using slightly different definitions, but the pooled analysis again showed no clinically meaningful difference between groups (RR 1.00, 95% CI 0.94 to 1.06; 3 studies, 651 participants). Two studies found no evidence of a difference in the incidence of treatment-related adverse events between groups (RR 1.01, 95% CI 0.47 to 2.17; 2 studies, 677 participants). Another study reported that one-third of participants in both groups experienced discomfort or itching, although these outcomes were not reported separately by each treatment arm. For both comparisons, none of the included studies reported the following prespecified outcomes: participant-reported pain intensity reduction of 50% or more at 24 hours, loss of one or more lines of best-corrected visual acuity at one month, change in pain interference from baseline to 24 hours, and complications of corneal abrasion up to the longest follow-up."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Given that the evidence supporting antibiotic use in corneal abrasion is of very low certainty, we are not able to support a specific antibiotic regimen or draw conclusions about the effects of antibiotic prophylaxis in preventing ocular infection or accelerating epithelial healing. Future research could explore adequately powered RCTs or alternative approaches, such as target trial emulation, while focusing on high-risk populations and antibiotic formulations."
        },
        {
          "label": "FUNDING",
          "text": "The Cochrane Eyes and Vision US Project is supported by grant UG1EY020522, National Eye Institute, National Institutes of Health."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2021) DOI: 10.1002/14651858.CD014617 Original Review (2022) DOI: 10.1002/14651858.CD014617.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41017778/",
      "pubDate": "2025 Sep 29",
      "doi": "10.1002/14651858.CD014617.pub3",
      "dateReceived": "2025-10-26T23:23:01.059Z",
      "isNew": false,
      "summary": "Due to the lack of strong evidence, the effectiveness of antibiotics for corneal abrasions in preventing infection or promoting healing remains uncertain."
    }
  ]
}