{
  "updated_at": "2025-12-07T23:24:40.151Z",
  "articles": [
    {
      "id": "32cb959a4fec",
      "title": "Levosimendan to Facilitate Weaning From ECMO in Patients With Severe Cardiogenic Shock: The LEVOECMO Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49222050/118279",
      "abstract": "Levosimendan may facilitate weaning from venoarterial extracorporeal membrane oxygenation (VA-ECMO) and improve survival, but supporting evidence remains limited. To assess whether early administration of levosimendan reduces the time to successful VA-ECMO weaning in patients with severe but potentially reversible cardiogenic shock. Randomized, double-blind, placebo-controlled trial conducted across 11 intensive care units (ICUs) in France. Between August 27, 2021, and September 10, 2024, 205 adult patients with acute cardiogenic shock who had started VA-ECMO in the preceding 48 hours were enrolled. Final follow-up was completed on November 10, 2024. Patients were randomized in a 1:1 ratio to receive levosimendan, 0.15 μg/kg per minute, to be increased to 0.20 μg/kg per minute after 2 hours (n = 101), or placebo (n = 104). The primary outcome was time to successful ECMO weaning within 30 days following randomization. Secondary outcomes included ECMO-, mechanical ventilation-, and organ failure-free days, ICU and hospital lengths of stay, serious adverse events, and all-cause 30- and 60-day mortality. Among the 205 randomized patients (median age, 58 [IQR, 50-67] years; 149 [72.7%] male), main cardiogenic shock etiologies were postcardiotomy (79 [38.5%]), acute myocardial infarction (56 [27.3%]), and myocarditis (28 [13.7%]). Treatment dose was increased to 0.20 ± 0.01 μg/kg per minute in 93% of patients receiving levosimendan and in 96% of those receiving placebo. Within 30 days, 69 of 101 patients (68.3%) had a successful ECMO weaning in the levosimendan group compared with 71 of 104 (68.3%) in the placebo group (risk difference, 0.0% [95% CI, -12.8% to 12.7%]; subdistribution hazard ratio, 1.02 [95% CI, 0.74-1.39]; P = .92). In the levosimendan and placebo groups, respectively, median ECMO duration (5 [IQR, 4-7] days vs 6 [IQR, 4-11] days; P = .53), mean ICU length of stay (18 [SD, 15] days vs 19 [SD, 15] days; P = .42), and 60-day mortality (27.7% vs 25.0%; risk difference, 2.7% [95% CI, -9.0% to 15.3%]; P = .78) did not differ significantly. Ventricular arrhythmias occurred more frequently with levosimendan (18 [17.8%] vs 9 [8.7%]; absolute risk difference, 9.2% [95% CI, 0.4%-18.1%]). Among patients with severe but potentially reversible cardiogenic shock supported by VA-ECMO, early levosimendan administration did not significantly reduce the time to successful weaning of ECMO compared with placebo. ClinicalTrials.gov Identifier: NCT04728932.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Levosimendan may facilitate weaning from venoarterial extracorporeal membrane oxygenation (VA-ECMO) and improve survival, but supporting evidence remains limited."
        },
        {
          "label": "OBJECTIVE",
          "text": "To assess whether early administration of levosimendan reduces the time to successful VA-ECMO weaning in patients with severe but potentially reversible cardiogenic shock."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "Randomized, double-blind, placebo-controlled trial conducted across 11 intensive care units (ICUs) in France. Between August 27, 2021, and September 10, 2024, 205 adult patients with acute cardiogenic shock who had started VA-ECMO in the preceding 48 hours were enrolled. Final follow-up was completed on November 10, 2024."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Patients were randomized in a 1:1 ratio to receive levosimendan, 0.15 μg/kg per minute, to be increased to 0.20 μg/kg per minute after 2 hours (n = 101), or placebo (n = 104)."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was time to successful ECMO weaning within 30 days following randomization. Secondary outcomes included ECMO-, mechanical ventilation-, and organ failure-free days, ICU and hospital lengths of stay, serious adverse events, and all-cause 30- and 60-day mortality."
        },
        {
          "label": "RESULTS",
          "text": "Among the 205 randomized patients (median age, 58 [IQR, 50-67] years; 149 [72.7%] male), main cardiogenic shock etiologies were postcardiotomy (79 [38.5%]), acute myocardial infarction (56 [27.3%]), and myocarditis (28 [13.7%]). Treatment dose was increased to 0.20 ± 0.01 μg/kg per minute in 93% of patients receiving levosimendan and in 96% of those receiving placebo. Within 30 days, 69 of 101 patients (68.3%) had a successful ECMO weaning in the levosimendan group compared with 71 of 104 (68.3%) in the placebo group (risk difference, 0.0% [95% CI, -12.8% to 12.7%]; subdistribution hazard ratio, 1.02 [95% CI, 0.74-1.39]; P = .92). In the levosimendan and placebo groups, respectively, median ECMO duration (5 [IQR, 4-7] days vs 6 [IQR, 4-11] days; P = .53), mean ICU length of stay (18 [SD, 15] days vs 19 [SD, 15] days; P = .42), and 60-day mortality (27.7% vs 25.0%; risk difference, 2.7% [95% CI, -9.0% to 15.3%]; P = .78) did not differ significantly. Ventricular arrhythmias occurred more frequently with levosimendan (18 [17.8%] vs 9 [8.7%]; absolute risk difference, 9.2% [95% CI, 0.4%-18.1%])."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "Among patients with severe but potentially reversible cardiogenic shock supported by VA-ECMO, early levosimendan administration did not significantly reduce the time to successful weaning of ECMO compared with placebo."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT04728932."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41324946/",
      "pubDate": "2025 Dec 01",
      "doi": "10.1001/jama.2025.19843",
      "dateReceived": "2025-12-07T23:24:39.089Z",
      "isNew": true
    },
    {
      "id": "7cca4ad3ea98",
      "title": "Efficacy of Individual-Level Interventions to Mitigate the Risk for Burnout Among Health Care Professionals : A Systematic Review and Meta-analysis of Randomized Controlled Trials.",
      "journal": "Ann Intern Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49128253/118192",
      "abstract": "",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41248503/",
      "pubDate": "2025 Nov 18",
      "doi": "10.7326/ANNALS-25-04275-VS",
      "dateReceived": "2025-12-06T23:25:14.007Z",
      "isNew": true
    },
    {
      "id": "80653a430b29",
      "title": "Percutaneous Mechanical Aspiration Versus Surgical Management of Tricuspid Valve Endocarditis: A Systematic Review and Updated Meta-Analysis.",
      "journal": "Am J Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49210964/118290",
      "abstract": "Tricuspid valve infective endocarditis (TVIE) is increasingly prevalent, especially among intravenous drug users. Surgical intervention is the standard treatment for severe cases, but percutaneous mechanical aspiration (PMA) has emerged as a less invasive alternative in high-risk patients. Comparative data on both strategies remain limited. To evaluate the safety and efficacy of PMA versus surgical management in patients with TVIE through a systematic review and meta-analysis. A comprehensive search of 5 databases (PubMed, Embase, Cochrane, Web of Science, Scopus) through July 2025 identified studies comparing PMA and surgery for TVIE. Outcomes included all-cause mortality (30-day and 1-year), hospital length of stay, in-hospital mortality, and readmission for endocarditis. Risk ratios (RR) and mean differences (MD) were pooled using a random-effects model. Risk of bias was assessed using ROBINS-I. Ten retrospective studies involving 6,035 patients were included (974 treated with PMA and 5,061 treated with surgery). The risk of in-hospital mortality was similar between PMA and surgery (RR = 1.07; p = 0.91). PMA was associated with a higher risk for 30-day mortality (RR = 2.71; 95% CI 1.53 to 4.82; p <0.001) but not for 1-year mortality (RR = 1.13; 95% CI 0.72 to 1.77; p = 0.60) or readmission for endocarditis (RR = 0.82; p = 0.63) compared with surgery. PMA was also associated with a shorter hospital stay (MD = -7.0 days; 95% CI -13.0 to -1.1; p = 0.03). The risk of bias was moderate to serious in all studies. In conclusion, the present systematic review of ten retrospective studies, surgical management of TVIE was associated with better short-term survival compared with PMA although the risks of 1-year mortality and readmission were similar. Randomized trials are required to better define the risk benefit profile of these approaches to TVIE.",
      "structuredAbstract": null,
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41106651/",
      "pubDate": "2025 Dec 15",
      "doi": "10.1016/j.amjcard.2025.09.055",
      "dateReceived": "2025-12-06T23:25:14.006Z",
      "isNew": true
    },
    {
      "id": "9b5249ccbb97",
      "title": "Systemic Corticosteroids, Mortality, and Infections in Pneumonia and Acute Respiratory Distress Syndrome : A Systematic Review and Meta-analysis.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Intensivist/Critical Care"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49210964/118281",
      "abstract": "The benefit-risk profile of systemic corticosteroids in non-COVID-19 pneumonia and acute respiratory distress syndrome (ARDS) remains debated. To assess corticosteroid effects on mortality and infection-related complications in adults with severe pneumonia or ARDS. MEDLINE, EMBASE, Cochrane Central Register of Controlled Trials, Web of Science, ClinicalTrials.gov, and World Health Organization International Clinical Trials Registry Platform through September 2025. Randomized controlled trials comparing systemic corticosteroids with placebo and usual care. Primary analysis: severe pneumonia or ARDS with corticosteroids 3 mg/kg of body weight per day or less (prednisone-equivalent) for 15 days or less, initiated within 7 days. Paired reviewers; consensus for disagreements. From 16 831 screened records, 20 studies (15 severe pneumonia, 5 ARDS) including 3459 participants met criteria. Low-dose, short-course corticosteroids probably reduce short-term mortality in severe pneumonia (15 studies, 2445 participants; risk ratio [RR], 0.73 [95% CI, 0.57 to 0.93];  = 14%; moderate certainty) and ARDS (5 studies, 1014 participants; RR, 0.77 [CI, 0.61 to 0.99];  = 23%; moderate certainty). Corticosteroids may reduce secondary shock in severe pneumonia (9 studies, 1690 participants; RR, 0.49 [CI, 0.26 to 0.92];  = 55%; low certainty). They probably result in little to no difference in hospital-acquired infections (severe pneumonia: 7 studies, 1665 participants; RR, 0.99 [CI, 0.82 to 1.20];  = 0%; moderate certainty; ARDS: 4 studies, 677 participants; RR, 0.97 [CI, 0.59 to 1.59];  = 0%; low certainty) or secondary pneumonia (severe pneumonia: 4 studies, 1011 participants; RR, 0.96 [CI, 0.66 to 1.39];  = 0%; ARDS: 4 studies, 677 participants; RR, 0.88 [CI, 0.43 to 1.79];  = 0%; both low certainty). Evidence is very uncertain for catheter-related and bloodstream infections. Long-term mortality evidence is very uncertain for severe pneumonia. Heterogeneous pneumonia severity classification limiting subgroup precision. In severe pneumonia and ARDS, adjunct corticosteroids probably reduce short-term mortality. In severe pneumonia, they may reduce secondary shock. In both conditions, corticosteroids may have little or no effect on hospital-acquired infections. None. (PROSPERO: CRD42024536301).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The benefit-risk profile of systemic corticosteroids in non-COVID-19 pneumonia and acute respiratory distress syndrome (ARDS) remains debated."
        },
        {
          "label": "PURPOSE",
          "text": "To assess corticosteroid effects on mortality and infection-related complications in adults with severe pneumonia or ARDS."
        },
        {
          "label": "DATA SOURCES",
          "text": "MEDLINE, EMBASE, Cochrane Central Register of Controlled Trials, Web of Science, ClinicalTrials.gov, and World Health Organization International Clinical Trials Registry Platform through September 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Randomized controlled trials comparing systemic corticosteroids with placebo and usual care. Primary analysis: severe pneumonia or ARDS with corticosteroids 3 mg/kg of body weight per day or less (prednisone-equivalent) for 15 days or less, initiated within 7 days."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Paired reviewers; consensus for disagreements."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "From 16 831 screened records, 20 studies (15 severe pneumonia, 5 ARDS) including 3459 participants met criteria. Low-dose, short-course corticosteroids probably reduce short-term mortality in severe pneumonia (15 studies, 2445 participants; risk ratio [RR], 0.73 [95% CI, 0.57 to 0.93];  = 14%; moderate certainty) and ARDS (5 studies, 1014 participants; RR, 0.77 [CI, 0.61 to 0.99];  = 23%; moderate certainty). Corticosteroids may reduce secondary shock in severe pneumonia (9 studies, 1690 participants; RR, 0.49 [CI, 0.26 to 0.92];  = 55%; low certainty). They probably result in little to no difference in hospital-acquired infections (severe pneumonia: 7 studies, 1665 participants; RR, 0.99 [CI, 0.82 to 1.20];  = 0%; moderate certainty; ARDS: 4 studies, 677 participants; RR, 0.97 [CI, 0.59 to 1.59];  = 0%; low certainty) or secondary pneumonia (severe pneumonia: 4 studies, 1011 participants; RR, 0.96 [CI, 0.66 to 1.39];  = 0%; ARDS: 4 studies, 677 participants; RR, 0.88 [CI, 0.43 to 1.79];  = 0%; both low certainty). Evidence is very uncertain for catheter-related and bloodstream infections. Long-term mortality evidence is very uncertain for severe pneumonia."
        },
        {
          "label": "LIMITATION",
          "text": "Heterogeneous pneumonia severity classification limiting subgroup precision."
        },
        {
          "label": "CONCLUSION",
          "text": "In severe pneumonia and ARDS, adjunct corticosteroids probably reduce short-term mortality. In severe pneumonia, they may reduce secondary shock. In both conditions, corticosteroids may have little or no effect on hospital-acquired infections."
        },
        {
          "label": "PRIMARY FUNDING SOURCE",
          "text": "None. (PROSPERO: CRD42024536301)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41325621/",
      "pubDate": "2025 Dec 02",
      "doi": "10.7326/ANNALS-25-03055",
      "dateReceived": "2025-12-06T23:25:14.006Z",
      "isNew": true
    },
    {
      "id": "4ebf1c863a9f",
      "title": "Economic Outcomes and Quality of Life After CABG or PCI for Multivessel Disease: The FAME 3 Trial.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49210964/118241",
      "abstract": "Previous studies have found coronary artery bypass grafting (CABG) to be cost-effective compared with percutaneous coronary intervention (PCI) among patients with multivessel coronary artery disease (CAD), but their comparative effectiveness and economic outcomes may have changed. This study sought to compare the economic and quality of life outcomes of CABG vs PCI and determine their cost-effectiveness in the FAME (Fractional Flow Reserve vs Angiography for Multivessel Evaluation) 3 randomized trial. FAME 3 randomly assigned 1,500 patients with 3-vessel CAD to either CABG or fractional flow reserve-guided PCI using zotarolimus drug-eluting stents. We documented resource use and quality of life over 5 years of follow-up. We calculated costs by applying Medicare reimbursement rates to resources used, assessed quality of life using the EuroQOL EQ-5D, calculated quality-adjusted life-years (QALYs) from EQ-5D utility values, and used multivariable regression to compare outcomes by treatment assignment. We calculated the incremental cost-effectiveness ratio based on 5-year outcomes and also on projected life expectancies, and assessed its variability in 10,000 bootstrap replications. Cumulative costs over 5 years were 30% higher in patients assigned to CABG (95% CI: 16%-46%; P < 0.001). QALYs over 5 years did not differ significantly between the PCI (4.05 ± 0.84) and CABG groups (4.03 ± 0.82), although EQ-5D scores improved more rapidly after PCI. Patients <65 years of age at enrollment assigned to PCI were more likely to be employed at 5 years (56% vs 47%; P = 0.025). PCI had greater economic value than CABG over 5 years, with lower costs and higher QALYs in 66% of replications, and incremental cost-effectiveness ratios for CABG above the $150,000/QALY benchmark in 98% of bootstrap replications. These findings were essentially unchanged in several lifetime projections based on the outcomes documented within the trial follow-up period. Fractional flow reserve-guided PCI using zotarolimus drug-eluting stents provides significantly better long-term value than CABG for treatment of patients with multivessel CAD, with equivalent clinical outcomes at substantially lower cost.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Previous studies have found coronary artery bypass grafting (CABG) to be cost-effective compared with percutaneous coronary intervention (PCI) among patients with multivessel coronary artery disease (CAD), but their comparative effectiveness and economic outcomes may have changed."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study sought to compare the economic and quality of life outcomes of CABG vs PCI and determine their cost-effectiveness in the FAME (Fractional Flow Reserve vs Angiography for Multivessel Evaluation) 3 randomized trial."
        },
        {
          "label": "METHODS",
          "text": "FAME 3 randomly assigned 1,500 patients with 3-vessel CAD to either CABG or fractional flow reserve-guided PCI using zotarolimus drug-eluting stents. We documented resource use and quality of life over 5 years of follow-up. We calculated costs by applying Medicare reimbursement rates to resources used, assessed quality of life using the EuroQOL EQ-5D, calculated quality-adjusted life-years (QALYs) from EQ-5D utility values, and used multivariable regression to compare outcomes by treatment assignment. We calculated the incremental cost-effectiveness ratio based on 5-year outcomes and also on projected life expectancies, and assessed its variability in 10,000 bootstrap replications."
        },
        {
          "label": "RESULTS",
          "text": "Cumulative costs over 5 years were 30% higher in patients assigned to CABG (95% CI: 16%-46%; P < 0.001). QALYs over 5 years did not differ significantly between the PCI (4.05 ± 0.84) and CABG groups (4.03 ± 0.82), although EQ-5D scores improved more rapidly after PCI. Patients <65 years of age at enrollment assigned to PCI were more likely to be employed at 5 years (56% vs 47%; P = 0.025). PCI had greater economic value than CABG over 5 years, with lower costs and higher QALYs in 66% of replications, and incremental cost-effectiveness ratios for CABG above the $150,000/QALY benchmark in 98% of bootstrap replications. These findings were essentially unchanged in several lifetime projections based on the outcomes documented within the trial follow-up period."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Fractional flow reserve-guided PCI using zotarolimus drug-eluting stents provides significantly better long-term value than CABG for treatment of patients with multivessel CAD, with equivalent clinical outcomes at substantially lower cost."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41194756/",
      "pubDate": "2025 Oct 25",
      "doi": "10.1016/j.jacc.2025.10.017",
      "dateReceived": "2025-12-06T23:25:14.006Z",
      "isNew": true
    },
    {
      "id": "c45b835f96b2",
      "title": "Human papillomavirus (HPV) vaccination for the prevention of cervical cancer and other HPV-related diseases: a network meta-analysis.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49201115/118282",
      "dateReceived": "2025-12-05T23:25:46.821Z",
      "isNew": false
    },
    {
      "id": "c9a8593e6211",
      "title": "Effect of Semaglutide on Insulin Sensitivity and Cardiometabolic Risk Factors in Adolescents With Obesity: The STEP TEENS Study.",
      "journal": "Diabetes Care",
      "score": "5/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Pediatrics (General)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49201115/118258",
      "abstract": "This secondary analysis of the Semaglutide Treatment Effect in People with obesity (STEP) TEENS (NCT04102189) study investigated the effect of semaglutide 2.4 mg versus placebo on insulin sensitivity and cardiometabolic risk factors. The STEP TEENS phase 3a randomized study in adolescents (aged 12 to <18 years) with obesity demonstrated that once-weekly subcutaneous semaglutide 2.4 mg provided a significantly greater percentage reduction in BMI than placebo at week 68 (estimated difference -16.7 percentage points; P = 0.0001). This analysis investigated changes in insulin sensitivity and cardiometabolic risk factors from baseline to week 68. Overall, 193 participants without type 2 diabetes were included in the analysis. Participants receiving semaglutide 2.4 mg (n = 129) compared with those receiving placebo (n = 64) had greater reductions from baseline in fasting serum insulin (-33.6% vs. -10.1%; P = 0.0012), homeostatic model assessment for insulin resistance (HOMA-IR) score (-35.0% vs. -5.3%; P = 0.0002), glycemic measures (glycated hemoglobin: P < 0.0001; fasting plasma glucose: P = 0.0181), alanine aminotransferase (ALT; -17.9% vs. -3.3%; P = 0.0232), waist-to-height ratio (P < 0.0001), triglycerides (P < 0.0001), LDL cholesterol (P = 0.0105), and total cholesterol (P < 0.0001). Moreover, greater improvements in insulin sensitivity, glycemic measures, and cardiometabolic risk factors were seen in semaglutide 2.4 mg recipients with BMI reductions of ≥20% versus <20%. These novel data support semaglutide 2.4 mg as an efficacious obesity treatment in adolescents with obesity and advance its application by showing associated improvements in insulin sensitivity, glycemic measures, ALT, and other cardiometabolic risk factors.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "This secondary analysis of the Semaglutide Treatment Effect in People with obesity (STEP) TEENS (NCT04102189) study investigated the effect of semaglutide 2.4 mg versus placebo on insulin sensitivity and cardiometabolic risk factors."
        },
        {
          "label": "RESEARCH DESIGN AND METHODS",
          "text": "The STEP TEENS phase 3a randomized study in adolescents (aged 12 to <18 years) with obesity demonstrated that once-weekly subcutaneous semaglutide 2.4 mg provided a significantly greater percentage reduction in BMI than placebo at week 68 (estimated difference -16.7 percentage points; P = 0.0001). This analysis investigated changes in insulin sensitivity and cardiometabolic risk factors from baseline to week 68."
        },
        {
          "label": "RESULTS",
          "text": "Overall, 193 participants without type 2 diabetes were included in the analysis. Participants receiving semaglutide 2.4 mg (n = 129) compared with those receiving placebo (n = 64) had greater reductions from baseline in fasting serum insulin (-33.6% vs. -10.1%; P = 0.0012), homeostatic model assessment for insulin resistance (HOMA-IR) score (-35.0% vs. -5.3%; P = 0.0002), glycemic measures (glycated hemoglobin: P < 0.0001; fasting plasma glucose: P = 0.0181), alanine aminotransferase (ALT; -17.9% vs. -3.3%; P = 0.0232), waist-to-height ratio (P < 0.0001), triglycerides (P < 0.0001), LDL cholesterol (P = 0.0105), and total cholesterol (P < 0.0001). Moreover, greater improvements in insulin sensitivity, glycemic measures, and cardiometabolic risk factors were seen in semaglutide 2.4 mg recipients with BMI reductions of ≥20% versus <20%."
        },
        {
          "label": "CONCLUSIONS",
          "text": "These novel data support semaglutide 2.4 mg as an efficacious obesity treatment in adolescents with obesity and advance its application by showing associated improvements in insulin sensitivity, glycemic measures, ALT, and other cardiometabolic risk factors."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41296499/",
      "pubDate": "2025 Nov 26",
      "doi": "10.2337/dc25-0824",
      "dateReceived": "2025-12-05T23:25:46.821Z",
      "isNew": false,
      "summary": "Semaglutide 2.4 mg is an effective obesity treatment for adolescents, improving insulin sensitivity, glycemic control, liver function, and other heart health risk factors."
    },
    {
      "id": "6c0ef06b5172",
      "title": "Colchicine for the secondary prevention of cardiovascular events.",
      "journal": "Cochrane Database Syst Rev",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49117264/118212",
      "abstract": "People with cardiovascular disease are at risk of recurrent major adverse cardiovascular events, and chronic low-grade inflammation may be a major underlying factor. Treatment with low-dose colchicine has been proposed for the secondary prevention of cardiovascular events in individuals at high cardiovascular risk. A previous Cochrane review showed considerable uncertainty regarding the benefits and harms of this approach. To evaluate the benefits and harms of low-dose colchicine in the prevention of cardiovascular events in adults with a history of stable CVD or following myocardial infarction or stroke. We conducted a comprehensive search of the literature until February 2025 using Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, EMBASE, the drugs@FDA database, references of key papers, and references of included studies. Randomised controlled trials (RCTs) comparing the use of low-dose colchicine for a minimum of six months versus any control intervention in patients of any age with cardiovascular disease (i.e. history of stable cardiovascular disease, previous myocardial infarction or stroke). Our critical outcomes were all-cause mortality, myocardial infarction, and serious adverse events. Our important outcomes were cardiovascular mortality, stroke, all-cause hospitalisations, coronary revascularisation (percutaneous coronary intervention (PCI)/angioplasty or coronary artery bypass graft (CABG)), quality of life, and gastrointestinal adverse events (i.e. diarrhoea, nausea, abdominal pain, or vomiting). Two authors independently assessed the risk of bias using the Cochrane RoB2 tool. We conducted meta-analyses using the random-effects model. We generated forest plots to facilitate visualisation of the data. We did not perform any subgroup analysis. We used GRADE to assess the certainty of evidence for all critical outcomes and for cardiovascular mortality, stroke, and coronary revascularisation. This was carried out by two review authors working independently. We included 12 studies involving 22,983 randomised participants. The follow-up in the studies ranged from 6 to 80 months. Overall, 11,524 participants were assigned to low-dose colchicine treatment and 11,459 were assigned to a control intervention, which constituted either usual care plus placebo or usual care only. The doses of colchicine used were 0.5 mg once or twice daily. At baseline, the mean age of participants ranged from 57 to 74 years. Most participants (79.4%) were male. There is high-certainty evidence that low-dose colchicine treatment reduces the risk of myocardial infarction, with a risk ratio (RR) of 0.74 (95% confidence interval (CI) 0.57 to 0.96; 22,153 participants, 8 studies; I = 51%), yielding an absolute risk reduction of 9 fewer events (95% CI 16 fewer to 2 fewer) per 1000 patients, when the myocardial infarction rate is about 4% (36 events per 1000 patients) in the control group. There is also high-certainty evidence that low-dose colchicine reduces the risk of stroke with a RR of 0.67 (95% CI 0.47 to 0.95; 22,483 participants, 10 studies; I = 40%), yielding an absolute risk reduction of 8 fewer events (95% CI 12 fewer to 1 fewer) per 1000 patients, when the stroke rate is about 2% (22 events per 1000 patients) in the control group. There is high-certainty evidence that the use of low-dose colchicine does not increase the rate of serious adverse events (RR 0.98, 95% CI 0.94 to 1.02; 15,677 participants, 4 studies; I = 0%). However, gastrointestinal adverse events were more common under treatment with colchicine (RR 1.68, 95% CI 1.11 to 2.57; 22,185 participants, 10 studies; I = 91%). For all other outcomes assessed, the evidence is of moderate certainty. Colchicine probably results in little to no difference in all-cause mortality (RR 1.01, 95% CI 0.84 to 1.21; 22,747 participants, 10 studies; I = 1%; moderate-certainty evidence), in cardiovascular mortality (RR 0.94, 95% CI 0.73 to 1.22; 22,271 participants; 8 studies; I = 13%; moderate-certainty evidence), and coronary revascularisation (RR 0.83, 95% CI 0.64 to 1.08; 13,705 participants, 5 studies; I = 40%; moderate-certainty evidence). There is no evidence about the benefits or harms of colchicine on quality-of-life or on the risk of all-cause hospitalisation. People with cardiovascular disease using low-dose colchicine as secondary prevention for at least six months benefit from reduced rates of myocardial infarction and stroke, without an increase in serious adverse events. Moderate-certainty evidence did not show a benefit from low-dose colchicine for the risk of mortality (i.e. all-cause and cardiovascular mortality) or coronary revascularisation rates. Colchicine use was associated with an increased risk of gastrointestinal adverse events, which were typically described as mild and transient in nature. Additional studies are warranted to investigate the benefits and harms of low-dose colchicine in relevant subgroups and in specific indications, such as long-term use in individuals with stable coronary artery disease versus limited-time use following acute coronary syndrome. Review author FE was supported by the Margot und Erich Goldschmidt & Peter René Jacobson Foundation. Review author CMS was supported by the Janggen Pöhn Foundation and the Swiss National Science Foundation (MD-PhD grant Number: 323530_221860). This review is based on its protocol, which is available via DOI 10.1002/14651858.CD014808, and a previous review, which is available via DOI 10.1002/14651858.CD011047.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "People with cardiovascular disease are at risk of recurrent major adverse cardiovascular events, and chronic low-grade inflammation may be a major underlying factor. Treatment with low-dose colchicine has been proposed for the secondary prevention of cardiovascular events in individuals at high cardiovascular risk. A previous Cochrane review showed considerable uncertainty regarding the benefits and harms of this approach."
        },
        {
          "label": "OBJECTIVES",
          "text": "To evaluate the benefits and harms of low-dose colchicine in the prevention of cardiovascular events in adults with a history of stable CVD or following myocardial infarction or stroke."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We conducted a comprehensive search of the literature until February 2025 using Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, EMBASE, the drugs@FDA database, references of key papers, and references of included studies."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials (RCTs) comparing the use of low-dose colchicine for a minimum of six months versus any control intervention in patients of any age with cardiovascular disease (i.e. history of stable cardiovascular disease, previous myocardial infarction or stroke)."
        },
        {
          "label": "OUTCOMES",
          "text": "Our critical outcomes were all-cause mortality, myocardial infarction, and serious adverse events. Our important outcomes were cardiovascular mortality, stroke, all-cause hospitalisations, coronary revascularisation (percutaneous coronary intervention (PCI)/angioplasty or coronary artery bypass graft (CABG)), quality of life, and gastrointestinal adverse events (i.e. diarrhoea, nausea, abdominal pain, or vomiting)."
        },
        {
          "label": "RISK OF BIAS",
          "text": "Two authors independently assessed the risk of bias using the Cochrane RoB2 tool."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We conducted meta-analyses using the random-effects model. We generated forest plots to facilitate visualisation of the data. We did not perform any subgroup analysis. We used GRADE to assess the certainty of evidence for all critical outcomes and for cardiovascular mortality, stroke, and coronary revascularisation. This was carried out by two review authors working independently."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "We included 12 studies involving 22,983 randomised participants. The follow-up in the studies ranged from 6 to 80 months. Overall, 11,524 participants were assigned to low-dose colchicine treatment and 11,459 were assigned to a control intervention, which constituted either usual care plus placebo or usual care only. The doses of colchicine used were 0.5 mg once or twice daily. At baseline, the mean age of participants ranged from 57 to 74 years. Most participants (79.4%) were male."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "There is high-certainty evidence that low-dose colchicine treatment reduces the risk of myocardial infarction, with a risk ratio (RR) of 0.74 (95% confidence interval (CI) 0.57 to 0.96; 22,153 participants, 8 studies; I = 51%), yielding an absolute risk reduction of 9 fewer events (95% CI 16 fewer to 2 fewer) per 1000 patients, when the myocardial infarction rate is about 4% (36 events per 1000 patients) in the control group. There is also high-certainty evidence that low-dose colchicine reduces the risk of stroke with a RR of 0.67 (95% CI 0.47 to 0.95; 22,483 participants, 10 studies; I = 40%), yielding an absolute risk reduction of 8 fewer events (95% CI 12 fewer to 1 fewer) per 1000 patients, when the stroke rate is about 2% (22 events per 1000 patients) in the control group. There is high-certainty evidence that the use of low-dose colchicine does not increase the rate of serious adverse events (RR 0.98, 95% CI 0.94 to 1.02; 15,677 participants, 4 studies; I = 0%). However, gastrointestinal adverse events were more common under treatment with colchicine (RR 1.68, 95% CI 1.11 to 2.57; 22,185 participants, 10 studies; I = 91%). For all other outcomes assessed, the evidence is of moderate certainty. Colchicine probably results in little to no difference in all-cause mortality (RR 1.01, 95% CI 0.84 to 1.21; 22,747 participants, 10 studies; I = 1%; moderate-certainty evidence), in cardiovascular mortality (RR 0.94, 95% CI 0.73 to 1.22; 22,271 participants; 8 studies; I = 13%; moderate-certainty evidence), and coronary revascularisation (RR 0.83, 95% CI 0.64 to 1.08; 13,705 participants, 5 studies; I = 40%; moderate-certainty evidence). There is no evidence about the benefits or harms of colchicine on quality-of-life or on the risk of all-cause hospitalisation."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "People with cardiovascular disease using low-dose colchicine as secondary prevention for at least six months benefit from reduced rates of myocardial infarction and stroke, without an increase in serious adverse events. Moderate-certainty evidence did not show a benefit from low-dose colchicine for the risk of mortality (i.e. all-cause and cardiovascular mortality) or coronary revascularisation rates. Colchicine use was associated with an increased risk of gastrointestinal adverse events, which were typically described as mild and transient in nature. Additional studies are warranted to investigate the benefits and harms of low-dose colchicine in relevant subgroups and in specific indications, such as long-term use in individuals with stable coronary artery disease versus limited-time use following acute coronary syndrome."
        },
        {
          "label": "FUNDING",
          "text": "Review author FE was supported by the Margot und Erich Goldschmidt & Peter René Jacobson Foundation. Review author CMS was supported by the Janggen Pöhn Foundation and the Swiss National Science Foundation (MD-PhD grant Number: 323530_221860)."
        },
        {
          "label": "REGISTRATION",
          "text": "This review is based on its protocol, which is available via DOI 10.1002/14651858.CD014808, and a previous review, which is available via DOI 10.1002/14651858.CD011047.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41224205/",
      "pubDate": "2025 Nov 13",
      "doi": "10.1002/14651858.CD014808.pub2",
      "dateReceived": "2025-12-05T23:25:46.821Z",
      "isNew": false,
      "summary": "Low-dose colchicine reduces myocardial infarction and stroke in people with cardiovascular disease using it for at least six months, but does not affect mortality or revascularization, and increases mild gastrointestinal side effects."
    },
    {
      "id": "baa8d5d1bcf5",
      "title": "Effect of Acoramidis on Recurrent and Cumulative Cardiovascular Outcomes in ATTR-CM: Exploratory Analysis From ATTRibute-CM.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49117264/118024",
      "abstract": "Transthyretin (TTR) amyloid cardiomyopathy (ATTR-CM) is a progressive disease with a significant burden of recurrent cardiovascular (CV) events. Acoramidis, an approved oral therapy for ATTR-CM, achieves early, near-complete (≥90%) TTR stabilization. In the phase 3 ATTRibute-CM (Efficacy and Safety of Acoramidis in Participants with Transthyretin Amyloid Cardiomyopathy) study, acoramidis significantly reduced the composite of all-cause mortality or first CV-related hospitalization (CVH), with an effect observed at month 3. Its efficacy on the burden of cumulative CV outcome events has not been reported. This study was a post hoc exploratory recurrent-event analysis of the efficacy of acoramidis on the cumulative incidence of CV outcomes from ATTRibute-CM and its open-label extension. Cumulative incidences of centrally adjudicated CV-related mortality (CVM) or recurrent CVH (first and, if applicable, subsequent CVH), recurrent CVH alone (month 30), and CVM (month 42) were measured in the modified intention-to-treat population (acoramidis, n = 409; placebo, n = 202). Mean cumulative events by treatment, and the difference between treatment groups were estimated by using a modified Andersen-Gill model. Acoramidis significantly reduced the cumulative risk of CVM or recurrent CVH through month 30 vs placebo (HR: 0.51; 95% CI: 0.43-0.62; P < 0.0001). A notable proportion of CV outcome events (19% of CVM or recurrent CVH events, 22% of CVH) occurred within the first 6 months. Numerically fewer cumulative events were observed with acoramidis compared with placebo at month 1, and the difference increased progressively, resulting at month 30 in 53 events avoided per 100 treated participants (95% CI: 29-79). At month 42, CVM was reduced with continuous acoramidis vs placebo-to-acoramidis (HR: 0.55; 95% CI: 0.39-0.79; P = 0.0011). The annualized frequency of recurrent CVH was significantly decreased through month 30 (relative risk ratio: 0.50; 95% CI: 0.35-0.69; P < 0.0001). Acoramidis significantly reduced the cumulative burden of CV outcomes in ATTR-CM over 30 months. Numerically fewer events were observed with acoramidis vs placebo by month 1, and the difference increased progressively over time, resulting in 53 events avoided per 100 treated patients at month 30. Almost one-fourth of the cumulative CV events occurred within the first 6 months. These exploratory findings suggest that cumulative event burden may occur early, highlighting the importance of timely evaluation, diagnosis and treatment in ATTR-CM.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Transthyretin (TTR) amyloid cardiomyopathy (ATTR-CM) is a progressive disease with a significant burden of recurrent cardiovascular (CV) events. Acoramidis, an approved oral therapy for ATTR-CM, achieves early, near-complete (≥90%) TTR stabilization. In the phase 3 ATTRibute-CM (Efficacy and Safety of Acoramidis in Participants with Transthyretin Amyloid Cardiomyopathy) study, acoramidis significantly reduced the composite of all-cause mortality or first CV-related hospitalization (CVH), with an effect observed at month 3. Its efficacy on the burden of cumulative CV outcome events has not been reported."
        },
        {
          "label": "OBJECTIVES",
          "text": "This study was a post hoc exploratory recurrent-event analysis of the efficacy of acoramidis on the cumulative incidence of CV outcomes from ATTRibute-CM and its open-label extension."
        },
        {
          "label": "METHODS",
          "text": "Cumulative incidences of centrally adjudicated CV-related mortality (CVM) or recurrent CVH (first and, if applicable, subsequent CVH), recurrent CVH alone (month 30), and CVM (month 42) were measured in the modified intention-to-treat population (acoramidis, n = 409; placebo, n = 202). Mean cumulative events by treatment, and the difference between treatment groups were estimated by using a modified Andersen-Gill model."
        },
        {
          "label": "RESULTS",
          "text": "Acoramidis significantly reduced the cumulative risk of CVM or recurrent CVH through month 30 vs placebo (HR: 0.51; 95% CI: 0.43-0.62; P < 0.0001). A notable proportion of CV outcome events (19% of CVM or recurrent CVH events, 22% of CVH) occurred within the first 6 months. Numerically fewer cumulative events were observed with acoramidis compared with placebo at month 1, and the difference increased progressively, resulting at month 30 in 53 events avoided per 100 treated participants (95% CI: 29-79). At month 42, CVM was reduced with continuous acoramidis vs placebo-to-acoramidis (HR: 0.55; 95% CI: 0.39-0.79; P = 0.0011). The annualized frequency of recurrent CVH was significantly decreased through month 30 (relative risk ratio: 0.50; 95% CI: 0.35-0.69; P < 0.0001)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Acoramidis significantly reduced the cumulative burden of CV outcomes in ATTR-CM over 30 months. Numerically fewer events were observed with acoramidis vs placebo by month 1, and the difference increased progressively over time, resulting in 53 events avoided per 100 treated patients at month 30. Almost one-fourth of the cumulative CV events occurred within the first 6 months. These exploratory findings suggest that cumulative event burden may occur early, highlighting the importance of timely evaluation, diagnosis and treatment in ATTR-CM."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41143759/",
      "pubDate": "2025 Sep 28",
      "doi": "10.1016/j.jacc.2025.09.013",
      "dateReceived": "2025-12-05T23:25:46.821Z",
      "isNew": false,
      "summary": "Acoramidis treatment in ATTR-CM patients significantly reduced cardiovascular event burden over 30 months, with the greatest impact observed early in the treatment period."
    },
    {
      "id": "84ecb6604170",
      "title": "High-Dose vs Standard-Dose Influenza Vaccine in Chronic Kidney Disease: The DANFLU-2 Trial Subgroup Analysis.",
      "journal": "J Am Coll Cardiol",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49201115/118283",
      "abstract": "Influenza-related complications occur frequently in persons with chronic kidney disease (CKD). Limited data exist on the effectiveness of high-dose inactivated influenza vaccine (HD-IIV) in persons with CKD. The purpose of this study was to assess the relative effectiveness (rVE) of HD-IIV vs standard-dose inactivated influenza vaccine (SD-IIV) against severe clinical outcomes in persons with CKD from the elderly general population. DANFLU-2 (A Pragmatic Randomized Trial to Evaluate the Effectiveness of High-Dose Influenza Vaccine vs. Standard-Dose Influenza Vaccine in Older Adults) was a pragmatic, open-label, individually randomized trial conducted in Denmark during the 2022-2023, 2023-2024, and 2024-2025 influenza seasons with the aim of assessing the rVE of HD-IIV vs SD-IIV in an older adult general population. In this prespecified secondary analysis, we assessed the rVE against severe clinical outcomes according to the presence of CKD. CKD was defined using data from laboratory registries and International Classification of Diseases-10th Revision diagnosis codes 10 years before vaccination. Among 332,438 DANFLU-2 participants (mean age 73.7 ± 5.8 years; 48.6% women), 46,788 (14.1%) had CKD at baseline. The effect of HD-IIV vs SD-IIV on hospitalization for influenza or pneumonia differed by CKD status: rVE was 16.9% (95% CI: 3.4%-28.5%) in participants with CKD vs 0.6% (95% CI: -9.6% to 9.9%) in those without CKD (P interaction = 0.046). Absolute risks for hospitalization for influenza or pneumonia were 1.7% with SD-IIV vs 1.3% with HD-IIV in CKD, corresponding to an absolute risk reduction of -0.29% (95% CI: -0.50% to 0.058%; number needed to treat [NNT] = 359). For influenza hospitalizations specifically, the benefit of HD-IIV was also substantially greater in CKD: rVE 68.6% (95% CI: 46.7%-82.3%; NNT = 561) vs 30.6% (95% CI: 7.2%-48.2%; NNT =3,953) in non-CKD (P interaction = 0.0079). Reductions in hospitalizations for cardiorespiratory disease, cardiovascular disease, heart failure, and laboratory-confirmed influenza were consistent regardless of CKD (all P interaction > 0.05). In this prespecified analysis of DANFLU-2, including the largest CKD population ever in an individually randomized vaccine trial, we observed a benefit of HD-IIV vs SD-IIV against hospitalization for influenza or pneumonia, as well as hospitalization for influenza, with suggestion of a greater relative benefit among those with CKD. Furthermore, the beneficial effect of HD-IIV vs SD-IIV on multiple cardiorespiratory outcomes was consistent across participants irrespective of CKD status.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Influenza-related complications occur frequently in persons with chronic kidney disease (CKD). Limited data exist on the effectiveness of high-dose inactivated influenza vaccine (HD-IIV) in persons with CKD."
        },
        {
          "label": "OBJECTIVES",
          "text": "The purpose of this study was to assess the relative effectiveness (rVE) of HD-IIV vs standard-dose inactivated influenza vaccine (SD-IIV) against severe clinical outcomes in persons with CKD from the elderly general population."
        },
        {
          "label": "METHODS",
          "text": "DANFLU-2 (A Pragmatic Randomized Trial to Evaluate the Effectiveness of High-Dose Influenza Vaccine vs. Standard-Dose Influenza Vaccine in Older Adults) was a pragmatic, open-label, individually randomized trial conducted in Denmark during the 2022-2023, 2023-2024, and 2024-2025 influenza seasons with the aim of assessing the rVE of HD-IIV vs SD-IIV in an older adult general population. In this prespecified secondary analysis, we assessed the rVE against severe clinical outcomes according to the presence of CKD. CKD was defined using data from laboratory registries and International Classification of Diseases-10th Revision diagnosis codes 10 years before vaccination."
        },
        {
          "label": "RESULTS",
          "text": "Among 332,438 DANFLU-2 participants (mean age 73.7 ± 5.8 years; 48.6% women), 46,788 (14.1%) had CKD at baseline. The effect of HD-IIV vs SD-IIV on hospitalization for influenza or pneumonia differed by CKD status: rVE was 16.9% (95% CI: 3.4%-28.5%) in participants with CKD vs 0.6% (95% CI: -9.6% to 9.9%) in those without CKD (P interaction = 0.046). Absolute risks for hospitalization for influenza or pneumonia were 1.7% with SD-IIV vs 1.3% with HD-IIV in CKD, corresponding to an absolute risk reduction of -0.29% (95% CI: -0.50% to 0.058%; number needed to treat [NNT] = 359). For influenza hospitalizations specifically, the benefit of HD-IIV was also substantially greater in CKD: rVE 68.6% (95% CI: 46.7%-82.3%; NNT = 561) vs 30.6% (95% CI: 7.2%-48.2%; NNT =3,953) in non-CKD (P interaction = 0.0079). Reductions in hospitalizations for cardiorespiratory disease, cardiovascular disease, heart failure, and laboratory-confirmed influenza were consistent regardless of CKD (all P interaction > 0.05)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this prespecified analysis of DANFLU-2, including the largest CKD population ever in an individually randomized vaccine trial, we observed a benefit of HD-IIV vs SD-IIV against hospitalization for influenza or pneumonia, as well as hospitalization for influenza, with suggestion of a greater relative benefit among those with CKD. Furthermore, the beneficial effect of HD-IIV vs SD-IIV on multiple cardiorespiratory outcomes was consistent across participants irrespective of CKD status."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41295932/",
      "pubDate": "2025 Nov 18",
      "doi": "10.1016/j.jacc.2025.10.005",
      "dateReceived": "2025-12-05T23:25:46.820Z",
      "isNew": false,
      "summary": "High-dose influenza vaccine (HD-IIV) was more effective than standard-dose influenza vaccine (SD-IIV) at preventing influenza-related hospitalizations, especially in individuals with chronic kidney disease (CKD), and showed consistent benefits for cardiorespiratory outcomes regardless of CKD status."
    },
    {
      "id": "76f988cdf1ee",
      "title": "Efficacy and safety of glucagon-like peptide 1 receptor agonists across all health outcomes in type 2 diabetes: An umbrella review and evidence map of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118247",
      "abstract": "Glucagon-like peptide 1 receptor agonists (GLP-1RAs) have been established as effective treatments for type 2 diabetes, offering benefits beyond glycaemic control; however, their associations across multiple health outcomes remain insufficiently assessed. Thus, we conducted an umbrella review of meta-analyses of randomised controlled trials (RCTs) to comprehensively evaluate the broad spectrum of their effects. We conducted a systematic search of PubMed/MEDLINE, Embase, CINAHL, and Google Scholar through June 13, 2025, to identify meta-analyses of RCTs assessing the effects of GLP-1RAs on various health outcomes, including cardiovascular, renal, metabolic, oncologic, gastrointestinal and other domains. Effect sizes were recalculated using random-effects models and converted to equivalent odds ratios (eORs) with 95% confidence intervals (CIs) for consistency. The methodological quality of each review was assessed using the AMSTAR 2, and the certainty of evidence for each association was evaluated according to the Grading of Recommendations, Assessment, Development and Evaluation framework (high, moderate, low or very low certainty). We preregistered our study protocol with PROSPERO (CRD420251112823). After applying predefined inclusion and exclusion criteria, 17 studies comprising 432 RCTs were included, covering 65 unique outcomes across 6 clinical domains. GLP-1RAs use was associated with reduced risks of heart failure (eOR, 0.71 [95% CI, 0.64-0.79]; low certainty) and peripheral artery disease (0.75 [0.67-0.84]; low certainty). Drug-specific analyses exhibited protective effects of liraglutide (eOR, 0.86 [95% CI, 0.80-0.91]), albiglutide (0.65 [0.47-0.89]), and dulaglutide (0.78 [0.68-0.90]) for major cardiovascular events, myocardial infarction and stroke, respectively. Renal outcomes indicated that GLP-1RAs use was associated with reducing the risk of kidney-specific composite outcomes (eOR, 0.76 [95% CI, 0.66-0.87]; low certainty), including nephropathy (0.74 [0.61-0.92]; low certainty) and albuminuria (0.73 [0.55-0.97]; very low certainty). GLP-1RAs were also associated with reductions in body weight (eOR, 0.46 [95% CI, 0.36-0.60]; moderate certainty) and glycated haemoglobin A1c (0.83 [0.71-0.97]; high certainty), but no substantial association with cancer risk was found. Gastrointestinal adverse events, including nausea (9.62 [4.60-20.10]; high certainty), dyspepsia (4.85 [1.52-15.45]; moderate certainty), and constipation (3.39 [1.54-7.47]; high certainty), were consistently reported. GLP-1RAs use was associated with higher lumbar spine (eOR, 1.99 [95% CI, 1.38-2.85]; low certainty) and hip-neck bone mineral density (1.79 [1.08-2.98]; low certainty). In this study, GLP-1RAs were associated with cardiovascular, renal, and metabolic benefits in type 2 diabetes without increasing cancer risk, though gastrointestinal adverse events were common. Our findings support the clinical use of GLP-1RAs, with attention to individual risk profiles and treatment tolerability.",
      "structuredAbstract": [
        {
          "label": "AIM",
          "text": "Glucagon-like peptide 1 receptor agonists (GLP-1RAs) have been established as effective treatments for type 2 diabetes, offering benefits beyond glycaemic control; however, their associations across multiple health outcomes remain insufficiently assessed. Thus, we conducted an umbrella review of meta-analyses of randomised controlled trials (RCTs) to comprehensively evaluate the broad spectrum of their effects."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "We conducted a systematic search of PubMed/MEDLINE, Embase, CINAHL, and Google Scholar through June 13, 2025, to identify meta-analyses of RCTs assessing the effects of GLP-1RAs on various health outcomes, including cardiovascular, renal, metabolic, oncologic, gastrointestinal and other domains. Effect sizes were recalculated using random-effects models and converted to equivalent odds ratios (eORs) with 95% confidence intervals (CIs) for consistency. The methodological quality of each review was assessed using the AMSTAR 2, and the certainty of evidence for each association was evaluated according to the Grading of Recommendations, Assessment, Development and Evaluation framework (high, moderate, low or very low certainty). We preregistered our study protocol with PROSPERO (CRD420251112823)."
        },
        {
          "label": "RESULTS",
          "text": "After applying predefined inclusion and exclusion criteria, 17 studies comprising 432 RCTs were included, covering 65 unique outcomes across 6 clinical domains. GLP-1RAs use was associated with reduced risks of heart failure (eOR, 0.71 [95% CI, 0.64-0.79]; low certainty) and peripheral artery disease (0.75 [0.67-0.84]; low certainty). Drug-specific analyses exhibited protective effects of liraglutide (eOR, 0.86 [95% CI, 0.80-0.91]), albiglutide (0.65 [0.47-0.89]), and dulaglutide (0.78 [0.68-0.90]) for major cardiovascular events, myocardial infarction and stroke, respectively. Renal outcomes indicated that GLP-1RAs use was associated with reducing the risk of kidney-specific composite outcomes (eOR, 0.76 [95% CI, 0.66-0.87]; low certainty), including nephropathy (0.74 [0.61-0.92]; low certainty) and albuminuria (0.73 [0.55-0.97]; very low certainty). GLP-1RAs were also associated with reductions in body weight (eOR, 0.46 [95% CI, 0.36-0.60]; moderate certainty) and glycated haemoglobin A1c (0.83 [0.71-0.97]; high certainty), but no substantial association with cancer risk was found. Gastrointestinal adverse events, including nausea (9.62 [4.60-20.10]; high certainty), dyspepsia (4.85 [1.52-15.45]; moderate certainty), and constipation (3.39 [1.54-7.47]; high certainty), were consistently reported. GLP-1RAs use was associated with higher lumbar spine (eOR, 1.99 [95% CI, 1.38-2.85]; low certainty) and hip-neck bone mineral density (1.79 [1.08-2.98]; low certainty)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this study, GLP-1RAs were associated with cardiovascular, renal, and metabolic benefits in type 2 diabetes without increasing cancer risk, though gastrointestinal adverse events were common. Our findings support the clinical use of GLP-1RAs, with attention to individual risk profiles and treatment tolerability."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41255131/",
      "pubDate": "2025 Nov 19",
      "doi": "10.1111/dom.70298",
      "dateReceived": "2025-12-04T23:26:42.829Z",
      "isNew": false,
      "summary": "GLP-1 receptor agonists (GLP-1RAs) improved cardiovascular, renal, and metabolic health in type 2 diabetes without increasing cancer risk, but frequently caused gastrointestinal side effects."
    },
    {
      "id": "920e6c8a9d8b",
      "title": "Melatonin for sleep and cognitive outcomes in older adults with cognitive impairment: a meta-analysis of randomised controlled trials.",
      "journal": "Age Ageing",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics",
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118239",
      "abstract": "To quantify the effects of melatonin on total sleep time and global cognition, and to examine secondary outcomes (sleep efficiency, circadian markers, neuropsychiatric symptoms, depression, activities of daily living) in older adults with cognitive impairment. Systematic review and meta-analysis of randomised controlled trials (PROSPERO CRD42024539227). PubMed, PsycINFO (via EBSCOhost), CINAHL Plus, Cochrane Library, Web of Science, to October 2024. Randomised controlled trials (RCTs) comparing melatonin versus placebo in adults ≥65 years with mild cognitive impairment or dementia. Two reviewers extracted data; risk of bias was assessed by RoB 2. Random-effects models estimated Hedges' g and mean differences (MD), with Benjamini-Hochberg false discovery rate (FDR) correction for multiple outcomes. Heterogeneity assessed via I2; publication bias via Egger's test. Ten RCTs (n = 516) were included. Melatonin increased total sleep time by MD +12.4 min (95% CI 8.1-16.7; P < .001; I2 = 72%; g = 0.42) and improved Mini-Mental State Examination scores by MD +1.8 points (95% CI 0.9-2.7; P = .002; I2 = 65%; g = 0.47). Neuropsychiatric symptoms decreased (g = -0.23; 95% CI -0.44 to -0.03; P = .02). Effects on sleep efficiency, circadian markers, depression and activities of daily living were small and nonsignificant. Melatonin yields modest improvements in sleep duration and cognition that approach clinically important thresholds but fall short of definitive efficacy. Larger, rigorously designed RCTs with harmonised outcomes and pre-specified primary endpoints are needed to confirm these findings.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To quantify the effects of melatonin on total sleep time and global cognition, and to examine secondary outcomes (sleep efficiency, circadian markers, neuropsychiatric symptoms, depression, activities of daily living) in older adults with cognitive impairment."
        },
        {
          "label": "DESIGN",
          "text": "Systematic review and meta-analysis of randomised controlled trials (PROSPERO CRD42024539227)."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, PsycINFO (via EBSCOhost), CINAHL Plus, Cochrane Library, Web of Science, to October 2024."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "Randomised controlled trials (RCTs) comparing melatonin versus placebo in adults ≥65 years with mild cognitive impairment or dementia."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers extracted data; risk of bias was assessed by RoB 2. Random-effects models estimated Hedges' g and mean differences (MD), with Benjamini-Hochberg false discovery rate (FDR) correction for multiple outcomes. Heterogeneity assessed via I2; publication bias via Egger's test."
        },
        {
          "label": "RESULTS",
          "text": "Ten RCTs (n = 516) were included. Melatonin increased total sleep time by MD +12.4 min (95% CI 8.1-16.7; P < .001; I2 = 72%; g = 0.42) and improved Mini-Mental State Examination scores by MD +1.8 points (95% CI 0.9-2.7; P = .002; I2 = 65%; g = 0.47). Neuropsychiatric symptoms decreased (g = -0.23; 95% CI -0.44 to -0.03; P = .02). Effects on sleep efficiency, circadian markers, depression and activities of daily living were small and nonsignificant."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Melatonin yields modest improvements in sleep duration and cognition that approach clinically important thresholds but fall short of definitive efficacy. Larger, rigorously designed RCTs with harmonised outcomes and pre-specified primary endpoints are needed to confirm these findings."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41240058/",
      "pubDate": "2025 Oct 30",
      "doi": "10.1093/ageing/afaf333",
      "dateReceived": "2025-12-04T23:26:42.829Z",
      "isNew": false,
      "summary": "Melatonin shows small improvements in sleep and thinking that are close to being clinically meaningful, but more research is needed to be certain."
    },
    {
      "id": "4d210195585d",
      "title": "A Multicomponent Intervention to Improve Maternal Infection Outcomes.",
      "journal": "N Engl J Med",
      "score": "5/7",
      "tags": [
        "Infectious Disease",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49105789/118200",
      "abstract": "Maternal infection and sepsis are major causes of maternal death and severe illness worldwide, particularly in low- and middle-income countries. Inconsistent implementation of evidence-based recommendations for infection prevention and management and delays in detection and treatment of maternal sepsis contribute to the number of preventable deaths. We conducted a cluster-randomized trial to assess a multicomponent intervention, the Active Prevention and Treatment of Maternal Sepsis (APT-Sepsis) program. This program was designed to support health care providers in achieving three goals: adherence to World Health Organization (WHO) hand-hygiene standards; adoption of evidence-based practices for maternal infection prevention and management; and early detection of sepsis and use of the FAST-M (fluids, antibiotics, source control, transfer if required, and monitoring) treatment bundle. Usual care was provided in the control group, along with dissemination of guidelines. The primary outcome was a composite of infection-related maternal death, infection-related near-miss event (events in which women survived a life-threatening complication), or severe infection-related illness (deep surgical-site, deep perineal, or body-cavity infection) among women who were pregnant or had recently been pregnant. We randomly assigned 59 health facilities (where 431,394 women gave birth during the trial) in Malawi and Uganda to the intervention group (30 clusters) or the usual-care group (29 clusters). A primary-outcome event occurred in 1.4% of the patients in the intervention group and in 1.9% of those in the usual-care group (risk ratio, 0.68; 95% confidence interval, 0.55 to 0.83; P<0.001). This effect was generally consistent between countries and among facilities of difference sizes and was sustained over time. Implementation of the APT-Sepsis program led to a significantly lower risk of a composite of infection-related maternal death, infection-related near-miss event, or severe infection-related illness than usual care. (Funded by the Joint Global Health Trials scheme and others; APT-Sepsis ISRCTN number, ISRCTN42347014.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Maternal infection and sepsis are major causes of maternal death and severe illness worldwide, particularly in low- and middle-income countries. Inconsistent implementation of evidence-based recommendations for infection prevention and management and delays in detection and treatment of maternal sepsis contribute to the number of preventable deaths."
        },
        {
          "label": "METHODS",
          "text": "We conducted a cluster-randomized trial to assess a multicomponent intervention, the Active Prevention and Treatment of Maternal Sepsis (APT-Sepsis) program. This program was designed to support health care providers in achieving three goals: adherence to World Health Organization (WHO) hand-hygiene standards; adoption of evidence-based practices for maternal infection prevention and management; and early detection of sepsis and use of the FAST-M (fluids, antibiotics, source control, transfer if required, and monitoring) treatment bundle. Usual care was provided in the control group, along with dissemination of guidelines. The primary outcome was a composite of infection-related maternal death, infection-related near-miss event (events in which women survived a life-threatening complication), or severe infection-related illness (deep surgical-site, deep perineal, or body-cavity infection) among women who were pregnant or had recently been pregnant."
        },
        {
          "label": "RESULTS",
          "text": "We randomly assigned 59 health facilities (where 431,394 women gave birth during the trial) in Malawi and Uganda to the intervention group (30 clusters) or the usual-care group (29 clusters). A primary-outcome event occurred in 1.4% of the patients in the intervention group and in 1.9% of those in the usual-care group (risk ratio, 0.68; 95% confidence interval, 0.55 to 0.83; P<0.001). This effect was generally consistent between countries and among facilities of difference sizes and was sustained over time."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Implementation of the APT-Sepsis program led to a significantly lower risk of a composite of infection-related maternal death, infection-related near-miss event, or severe infection-related illness than usual care. (Funded by the Joint Global Health Trials scheme and others; APT-Sepsis ISRCTN number, ISRCTN42347014.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41259754/",
      "pubDate": "2025 Nov 19",
      "doi": "10.1056/NEJMoa2512698",
      "dateReceived": "2025-12-04T23:26:42.829Z",
      "isNew": false,
      "summary": "The APT-Sepsis program significantly reduced the risk of adverse maternal outcomes related to infection compared to standard care."
    },
    {
      "id": "8d4d6126ad71",
      "title": "Cognitive Behavior Therapy With and Without Narrative Assessment and Suicide Attempts: A Systematic Review and Meta-Analysis.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49090042/118222",
      "abstract": "There is currently no evidence-based method to identify the forces that may drive someone to attempt suicide. To examine whether cognitive behavior therapy (CBT) interventions that incorporate a narrative assessment are associated with a greater reduction in suicide attempts than comparable interventions without this component. Studies were identified through version 25.0.1 of the Metapsy Suicide Prevention Database, which includes randomized clinical trials published up to April 2025 retrieved through PubMed, Embase, Web of Science, Scopus, and Cochrane Central, including unpublished studies and references from relevant articles. Included studies were randomized clinical trials of CBT interventions reporting suicide attempts as an outcome. Studies using waiting list controls, reporting only suicidal ideation, or lacking information on the type of assessment used were excluded. Two reviewers independently extracted data and assessed risk of bias using the Cochrane Risk of Bias 2 tool. Meta-analyses were conducted using 3-level models with robust variance estimation. Relative risks (RRs) were pooled using the Mantel-Haenszel method. Analyses followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guidelines. Data were pooled using a random-effects model. The primary outcome was the incidence of suicide attempts. Interventions were grouped by presence or absence of a narrative assessment component. Twenty-three studies with 3262 participants met inclusion criteria. CBT interventions including a narrative assessment were associated with a significantly reduced risk of suicide attempt compared with controls (RR, 0.68; 95% CI, 0.53-0.87; 1764 participants across 14 studies), whereas CBT interventions without this component were not associated with risk of suicide attempt (RR, 1.17; 95% CI, 0.63-2.20; 1498 participants across 9 studies). Subgroup comparison indicated a significant difference between groups (Q1 = 7.27; P = .007; I2 = 86%). Studies without a narrative assessment had significantly younger participants, a lower event rate, and slightly higher risk of bias. In this systematic review and meta-analysis, CBT interventions including a narrative assessment were associated with a reduced risk of suicide attempt, while CBT without this component did not have an association with risk of suicide attempt. Age differences between study populations may partly explain this finding, as interventions in younger populations often show smaller and more inconsistent effect sizes. These results suggest that a narrative assessment may be a simple and effective way to capture the forces that lead to suicide attempts and to direct interventions toward their prevention. Causal conclusions require direct head-to-head trials.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "There is currently no evidence-based method to identify the forces that may drive someone to attempt suicide."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine whether cognitive behavior therapy (CBT) interventions that incorporate a narrative assessment are associated with a greater reduction in suicide attempts than comparable interventions without this component."
        },
        {
          "label": "DATA SOURCES",
          "text": "Studies were identified through version 25.0.1 of the Metapsy Suicide Prevention Database, which includes randomized clinical trials published up to April 2025 retrieved through PubMed, Embase, Web of Science, Scopus, and Cochrane Central, including unpublished studies and references from relevant articles."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Included studies were randomized clinical trials of CBT interventions reporting suicide attempts as an outcome. Studies using waiting list controls, reporting only suicidal ideation, or lacking information on the type of assessment used were excluded."
        },
        {
          "label": "DATA EXTRACTION AND SYNTHESIS",
          "text": "Two reviewers independently extracted data and assessed risk of bias using the Cochrane Risk of Bias 2 tool. Meta-analyses were conducted using 3-level models with robust variance estimation. Relative risks (RRs) were pooled using the Mantel-Haenszel method. Analyses followed Preferred Reporting Items for Systematic Reviews and Meta-Analyses reporting guidelines. Data were pooled using a random-effects model."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was the incidence of suicide attempts. Interventions were grouped by presence or absence of a narrative assessment component."
        },
        {
          "label": "RESULTS",
          "text": "Twenty-three studies with 3262 participants met inclusion criteria. CBT interventions including a narrative assessment were associated with a significantly reduced risk of suicide attempt compared with controls (RR, 0.68; 95% CI, 0.53-0.87; 1764 participants across 14 studies), whereas CBT interventions without this component were not associated with risk of suicide attempt (RR, 1.17; 95% CI, 0.63-2.20; 1498 participants across 9 studies). Subgroup comparison indicated a significant difference between groups (Q1 = 7.27; P = .007; I2 = 86%). Studies without a narrative assessment had significantly younger participants, a lower event rate, and slightly higher risk of bias."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this systematic review and meta-analysis, CBT interventions including a narrative assessment were associated with a reduced risk of suicide attempt, while CBT without this component did not have an association with risk of suicide attempt. Age differences between study populations may partly explain this finding, as interventions in younger populations often show smaller and more inconsistent effect sizes. These results suggest that a narrative assessment may be a simple and effective way to capture the forces that lead to suicide attempts and to direct interventions toward their prevention. Causal conclusions require direct head-to-head trials."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41264269/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.44632",
      "dateReceived": "2025-12-04T23:26:42.829Z",
      "isNew": false,
      "summary": "CBT interventions incorporating narrative assessment were associated with a reduced risk of suicide attempts, unlike CBT without this component."
    },
    {
      "id": "1abc0e7a2825",
      "title": "Effects of SGLT2 inhibitors across the spectrum of albuminuria in cardiovascular-kidney-metabolic conditions: A pooled analysis of randomised trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Endocrine",
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49090042/118214",
      "abstract": "Albuminuria is associated with an increased risk of cardiovascular and kidney events. Sodium glucose co-transporter 2 inhibitors (SGLT2i) reduce albuminuria and improve kidney outcomes in patients with albuminuric chronic kidney disease (CKD). Patients with low- or without albuminuria have been underrepresented in randomised clinical trials (RCTs), and the effects of SGLT2i on cardiovascular and kidney outcomes across the full range of albuminuria require further investigation. To study the effects of SGLT2i on kidney and cardiovascular outcomes across albuminuria levels in populations with different cardiovascular-kidney-metabolic (CKM) risk. Individual-patient data pooled analysis of RCTs across the CKM spectrum. Outcomes were studied across urinary albumin-to-creatinine ratio (UACR) both as categorical and continuous variables using survival and mixed effects models. A total of 26 750 patients were included. The median (pct) baseline UACR was 28 (8-240) mg/g: 13 669 (51.1%) had UACR <30 mg/g, 6904 (25.8%) UACR 30-300 mg/g, and 6177 (23.1%) UACR >300 mg/g. Compared to patients with lower UACR, those with higher UACR were younger, with a more frequent history of hypertension, diabetes, and obesity, and lower eGFR. UACR was linearly associated with kidney and cardiovascular outcomes as well as mortality. Compared to placebo, SGLT2i reduced the risk of kidney events, HF hospitalisations, atherothrombotic events, cardiovascular and all-cause mortality across the full UACR spectrum (Pinteraction >0.1 for all outcomes). Compared to placebo, SGLT2i reduced albuminuria levels by 13%, on average: gMratio 0.87, 95%CI 0.85-0.88, p < 0.001. Higher albuminuria was associated with an increased risk of cardiovascular and kidney outcomes. SGLT2i improved cardiovascular and kidney outcomes across the full range of albuminuria, including normo-albuminuria.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Albuminuria is associated with an increased risk of cardiovascular and kidney events. Sodium glucose co-transporter 2 inhibitors (SGLT2i) reduce albuminuria and improve kidney outcomes in patients with albuminuric chronic kidney disease (CKD). Patients with low- or without albuminuria have been underrepresented in randomised clinical trials (RCTs), and the effects of SGLT2i on cardiovascular and kidney outcomes across the full range of albuminuria require further investigation."
        },
        {
          "label": "AIMS",
          "text": "To study the effects of SGLT2i on kidney and cardiovascular outcomes across albuminuria levels in populations with different cardiovascular-kidney-metabolic (CKM) risk."
        },
        {
          "label": "METHODS",
          "text": "Individual-patient data pooled analysis of RCTs across the CKM spectrum. Outcomes were studied across urinary albumin-to-creatinine ratio (UACR) both as categorical and continuous variables using survival and mixed effects models."
        },
        {
          "label": "RESULTS",
          "text": "A total of 26 750 patients were included. The median (pct) baseline UACR was 28 (8-240) mg/g: 13 669 (51.1%) had UACR <30 mg/g, 6904 (25.8%) UACR 30-300 mg/g, and 6177 (23.1%) UACR >300 mg/g. Compared to patients with lower UACR, those with higher UACR were younger, with a more frequent history of hypertension, diabetes, and obesity, and lower eGFR. UACR was linearly associated with kidney and cardiovascular outcomes as well as mortality. Compared to placebo, SGLT2i reduced the risk of kidney events, HF hospitalisations, atherothrombotic events, cardiovascular and all-cause mortality across the full UACR spectrum (Pinteraction >0.1 for all outcomes). Compared to placebo, SGLT2i reduced albuminuria levels by 13%, on average: gMratio 0.87, 95%CI 0.85-0.88, p < 0.001."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Higher albuminuria was associated with an increased risk of cardiovascular and kidney outcomes. SGLT2i improved cardiovascular and kidney outcomes across the full range of albuminuria, including normo-albuminuria."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208574/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70289",
      "dateReceived": "2025-12-04T23:26:42.829Z",
      "isNew": false,
      "summary": "Increased albuminuria is linked to worse cardiovascular and kidney health, but SGLT2 inhibitors improve outcomes regardless of albuminuria levels."
    },
    {
      "id": "c0a24bccff9e",
      "title": "The ANTICIPATE-NASH Models Stratify Better the Risk of Clinical Events Than Histology in Metabolic Dysfunction-Associated Steatotic Liver Disease Patients With Advanced Chronic Liver Disease.",
      "journal": "Gastroenterology",
      "score": "7/7",
      "tags": [
        "Gastroenterology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49090042/118207",
      "abstract": "The reference for risk stratification and clinical trial selection of metabolic dysfunction-associated steatotic liver disease (MASLD) patients is fibrosis degree by histology. The noninvasive ANTICIPATE-NASH models have been validated for risk prediction of clinically significant portal hypertension (CSPH) and liver-related events (LRE). We assessed whether these models provide better risk stratification of events than histology. A multicenter cohort 1, including 699 biopsy specimen-proven F3-F4 patients with MASLD was evaluated. The end point was LRE (hepatic decompensation, hepatocellular carcinoma, transplantation, or liver-related death). We assessed (Cox regression) whether histology provided added value to ANTICIPATE-NASH and whether model predictions differed in F3/F4 patients. Results were validated in cohort 2 (1396 F3-F4 patients) from 4 clinical trials using the clinical regulatory end point. In cohort 1, F3 and F4 were equally distributed. There were 56 LREs (8.0%) during follow-up, concentrated in F4 (51 LREs). The ANTICIPATE-NASH model showed excellent discrimination (C statistic, 0.93) for LRE, higher than histology (C statistic, 0.67). Model calibration was excellent. Adding histology did not improve model prediction. Thresholds of ANTICIPATE-NASH above which F3 patients developed LREs and below which F4 patients did not were identified. Results were reproduced in cohort 2 with the regulatory end point, with higher model discrimination (C statistic, 0.84) compared with histology (C statistic, 0.64). In MASLD patients with F3/F4, the noninvasive ANTICIPATE-NASH models provide better risk stratification of clinical events than histologic classification. These models could be very useful for clinical trials by selecting patients at risk of clinical events and patients with higher chances of observed cirrhosis regression.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND & AIMS",
          "text": "The reference for risk stratification and clinical trial selection of metabolic dysfunction-associated steatotic liver disease (MASLD) patients is fibrosis degree by histology. The noninvasive ANTICIPATE-NASH models have been validated for risk prediction of clinically significant portal hypertension (CSPH) and liver-related events (LRE). We assessed whether these models provide better risk stratification of events than histology."
        },
        {
          "label": "METHODS",
          "text": "A multicenter cohort 1, including 699 biopsy specimen-proven F3-F4 patients with MASLD was evaluated. The end point was LRE (hepatic decompensation, hepatocellular carcinoma, transplantation, or liver-related death). We assessed (Cox regression) whether histology provided added value to ANTICIPATE-NASH and whether model predictions differed in F3/F4 patients. Results were validated in cohort 2 (1396 F3-F4 patients) from 4 clinical trials using the clinical regulatory end point."
        },
        {
          "label": "RESULTS",
          "text": "In cohort 1, F3 and F4 were equally distributed. There were 56 LREs (8.0%) during follow-up, concentrated in F4 (51 LREs). The ANTICIPATE-NASH model showed excellent discrimination (C statistic, 0.93) for LRE, higher than histology (C statistic, 0.67). Model calibration was excellent. Adding histology did not improve model prediction. Thresholds of ANTICIPATE-NASH above which F3 patients developed LREs and below which F4 patients did not were identified. Results were reproduced in cohort 2 with the regulatory end point, with higher model discrimination (C statistic, 0.84) compared with histology (C statistic, 0.64)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In MASLD patients with F3/F4, the noninvasive ANTICIPATE-NASH models provide better risk stratification of clinical events than histologic classification. These models could be very useful for clinical trials by selecting patients at risk of clinical events and patients with higher chances of observed cirrhosis regression."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212130/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1053/j.gastro.2025.08.020",
      "dateReceived": "2025-12-04T23:26:42.829Z",
      "isNew": false,
      "summary": "In patients with advanced MASLD, the ANTICIPATE-NASH models are superior to liver biopsy for predicting future clinical events and identifying those likely to benefit from treatment."
    },
    {
      "id": "4fe2fb229453",
      "title": "Sex Differences in Mortality and Receipt of Kidney Replacement Therapy Among Adults With Stage 5 Chronic Kidney Disease.",
      "journal": "JAMA Intern Med",
      "score": "6/7",
      "tags": [
        "Nephrology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118262",
      "abstract": "Female individuals typically outlive male individuals in the general population. Whether this survival advantage persists among adults with stage 5 chronic kidney disease (CKD) is unknown. To examine sex differences in mortality and treatment with kidney replacement therapy (KRT; including dialysis and transplant) among adults with incident stage 5 CKD. This population-based cohort study used linked administrative and kidney care program data from Alberta, Canada. Adults 18 years and older with incident non-KRT-dependent stage 5 CKD were identified between April 2005 and March 2019 and observed from study entry until death, out-migration, or March 2021. Data were analyzed from January to August 2025. Sex-specific, age-stratified standardized mortality ratios were calculated using general population mortality data. Five-year probabilities of all-cause death, receipt of maintenance dialysis, and kidney transplant were estimated in incident stage 5 CKD cases using multistate models, stratified by age and presence of diabetes or cardiovascular disease. Among 7506 cohort members, 4121 (54.9%) were male (median [IQR] age, 70 [58-80] years), and 3385 (45.1%) were female (median [IQR] age, 74 [61-83] years). The median (IQR) follow-up was 7.9 (4.7-11.5) years. Compared with the general population, female individuals experienced greater excess mortality than male individuals, particularly at younger ages (eg, among adults younger than 55 years: standardized mortality ratio, 40.9 [95% CI, 34.6-47.3] in female individuals vs 15.9 [95% CI, 13.5-18.2] in male individuals); this difference narrowed with increasing age. Within the stage 5 CKD cohort, 5-year all-cause mortality risks were higher in younger female individuals than male individuals (younger than 55 years: 20.7% vs 14.6%) and similar between sexes at older ages. Irrespective of comorbidity, female individuals younger than 65 years were substantially less likely to receive a kidney transplant, and female individuals 65 years and older were less likely to receive dialysis or a transplant. In this cohort study using data from a universal health care system, across all ages, the female survival advantage observed in the general population was absent or even reversed after developing stage 5 CKD. Fewer female individuals transitioned to KRT treatment, independent of their comorbidities. Younger female individuals experienced the greatest survival disadvantage and were less likely to receive a transplant. These findings suggest that differences in treatment decision-making or inequities in access to KRT may contribute to poorer outcomes in female individuals, especially at younger ages. Further investigations are warranted to understand the potential underlying structural, social, and biological mechanisms.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Female individuals typically outlive male individuals in the general population. Whether this survival advantage persists among adults with stage 5 chronic kidney disease (CKD) is unknown."
        },
        {
          "label": "OBJECTIVE",
          "text": "To examine sex differences in mortality and treatment with kidney replacement therapy (KRT; including dialysis and transplant) among adults with incident stage 5 CKD."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This population-based cohort study used linked administrative and kidney care program data from Alberta, Canada. Adults 18 years and older with incident non-KRT-dependent stage 5 CKD were identified between April 2005 and March 2019 and observed from study entry until death, out-migration, or March 2021. Data were analyzed from January to August 2025."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "Sex-specific, age-stratified standardized mortality ratios were calculated using general population mortality data. Five-year probabilities of all-cause death, receipt of maintenance dialysis, and kidney transplant were estimated in incident stage 5 CKD cases using multistate models, stratified by age and presence of diabetes or cardiovascular disease."
        },
        {
          "label": "RESULTS",
          "text": "Among 7506 cohort members, 4121 (54.9%) were male (median [IQR] age, 70 [58-80] years), and 3385 (45.1%) were female (median [IQR] age, 74 [61-83] years). The median (IQR) follow-up was 7.9 (4.7-11.5) years. Compared with the general population, female individuals experienced greater excess mortality than male individuals, particularly at younger ages (eg, among adults younger than 55 years: standardized mortality ratio, 40.9 [95% CI, 34.6-47.3] in female individuals vs 15.9 [95% CI, 13.5-18.2] in male individuals); this difference narrowed with increasing age. Within the stage 5 CKD cohort, 5-year all-cause mortality risks were higher in younger female individuals than male individuals (younger than 55 years: 20.7% vs 14.6%) and similar between sexes at older ages. Irrespective of comorbidity, female individuals younger than 65 years were substantially less likely to receive a kidney transplant, and female individuals 65 years and older were less likely to receive dialysis or a transplant."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this cohort study using data from a universal health care system, across all ages, the female survival advantage observed in the general population was absent or even reversed after developing stage 5 CKD. Fewer female individuals transitioned to KRT treatment, independent of their comorbidities. Younger female individuals experienced the greatest survival disadvantage and were less likely to receive a transplant. These findings suggest that differences in treatment decision-making or inequities in access to KRT may contribute to poorer outcomes in female individuals, especially at younger ages. Further investigations are warranted to understand the potential underlying structural, social, and biological mechanisms."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41247715/",
      "pubDate": "2025 Nov 17",
      "doi": "10.1001/jamainternmed.2025.5979",
      "dateReceived": "2025-12-04T23:26:42.828Z",
      "isNew": false,
      "summary": "Female patients with stage 5 chronic kidney disease (CKD) experience worse survival outcomes compared to male patients, potentially due to disparities in treatment access or decision-making, particularly in younger individuals."
    },
    {
      "id": "44ecc6ae0817",
      "title": "Real-World Prospective Validation and Economic Evaluation of Deep Learning-Based Diabetic Retinopathy Detection From Fundus Photographs: A Systematic Review and Meta-analysis.",
      "journal": "Diabetes Care",
      "score": "5/7",
      "tags": [
        "Surgery - Ophthalmology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49187732/118257",
      "abstract": "Deep learning (DL) has shown promise in delivering diagnostic and economic benefits for detecting diabetic retinopathy (DR) from fundus photographs (FPs). However, evidence synthesis of model validation in prospective, real-world settings remains limited. To assess the feasibility of implementing DL-DR systems using FPs across different countries by synthesizing prospective validation and economic evidence. Five databases were searched until 13 August 2025. Studies prospectively assessing diagnostic performance and/or studies conducting economic analyses of DL-DR systems using FPs were selected. Characteristics of all studies, performance parameters of prospective validation studies, and economic outcomes of economic analysis studies were extracted. Forty-seven studies were included in the meta-analysis. The pooled performance was the highest in detecting vision-threatening DR (area under the receiver operating characteristic curve [AUROC] 0.974), followed by any DR (AUROC 0.965), then referable DR (RDR) (AUROC 0.959). Study region, clinical pathway, mydriasis, image quality control, sample size, grading criteria, reference standard, and model architecture significantly affected model performance in RDR detection. Fifteen studies were included in the economic commentary, showing that DL-based DR screening was cost-effective in high-income countries, whereas results in middle-income countries were mixed, depending on compliance rates, glycemic control, and initial costs. A paucity of studies assessing multiple severities of DR or diabetic macular edema restricted our ability to perform subgroup analyses. Insights into low-income countries were limited by a lack of studies in these regions. DL-DR systems using FPs had high discriminative performance in prospective real-world settings and hold promise to improve cost-effectiveness, especially in high-income countries.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Deep learning (DL) has shown promise in delivering diagnostic and economic benefits for detecting diabetic retinopathy (DR) from fundus photographs (FPs). However, evidence synthesis of model validation in prospective, real-world settings remains limited."
        },
        {
          "label": "PURPOSE",
          "text": "To assess the feasibility of implementing DL-DR systems using FPs across different countries by synthesizing prospective validation and economic evidence."
        },
        {
          "label": "DATA SOURCES",
          "text": "Five databases were searched until 13 August 2025."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Studies prospectively assessing diagnostic performance and/or studies conducting economic analyses of DL-DR systems using FPs were selected."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Characteristics of all studies, performance parameters of prospective validation studies, and economic outcomes of economic analysis studies were extracted."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Forty-seven studies were included in the meta-analysis. The pooled performance was the highest in detecting vision-threatening DR (area under the receiver operating characteristic curve [AUROC] 0.974), followed by any DR (AUROC 0.965), then referable DR (RDR) (AUROC 0.959). Study region, clinical pathway, mydriasis, image quality control, sample size, grading criteria, reference standard, and model architecture significantly affected model performance in RDR detection. Fifteen studies were included in the economic commentary, showing that DL-based DR screening was cost-effective in high-income countries, whereas results in middle-income countries were mixed, depending on compliance rates, glycemic control, and initial costs."
        },
        {
          "label": "LIMITATIONS",
          "text": "A paucity of studies assessing multiple severities of DR or diabetic macular edema restricted our ability to perform subgroup analyses. Insights into low-income countries were limited by a lack of studies in these regions."
        },
        {
          "label": "CONCLUSIONS",
          "text": "DL-DR systems using FPs had high discriminative performance in prospective real-world settings and hold promise to improve cost-effectiveness, especially in high-income countries."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41259706/",
      "pubDate": "2025 Nov 19",
      "doi": "10.2337/dc25-1493",
      "dateReceived": "2025-12-04T23:26:42.828Z",
      "isNew": false,
      "summary": "DL-DR systems using FPs show strong ability to distinguish between conditions in real-world settings and could improve cost-effectiveness, particularly in wealthier nations."
    },
    {
      "id": "8115cc2e64dc",
      "title": "Benefits and harms of ADHD interventions: umbrella review and platform for shared decision making.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "FM/GP/Mental Health",
        "Pediatrics (General)",
        "Psychiatry"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49177163/118256",
      "abstract": "To assess the effects of and related evidence certainty of interventions for attention deficit/hyperactivity disorder (ADHD) across an individual's lifespan, and to develop a continuously updated web platform for people with lived experience of ADHD as a method to disseminate living evidence synthesis for shared decision making. Umbrella review and platform for shared decision making. Six databases from inception to 19 January 2025. Study authors were contacted for additional information when necessary. Systematic reviews that used meta-analyses of randomised controlled trials were eligible if they compared a drug or non-drug intervention with a passive control in individuals with a diagnosis of ADHD. Primary outcomes were severity of ADHD symptoms, analysed by rater type (clinician-rated, parent-rated, teacher-rated, or self-rated) and time point (short term (12 weeks, or study endpoint), medium term (26 weeks), and long term (52 weeks)),acceptability (participants dropping out for any reason), and tolerability (participants dropping out owing to any side effects). Secondary outcomes included daily functioning, quality of life, comorbid symptoms, and key side effects (decreased sleep and appetite). Eligible meta-analyses were re-estimated with a standardised statistical approach. Methodological quality was assessed using AMSTAR-2. Evidence certainty was evaluated using an algorithmic version of the GRADE framework, adapted for drug and non-drug interventions. 115 of 414 full text articles were deemed eligible and 299 were excluded; the eligible articles comprised 221 unique combinations of participants, interventions, comparators, and outcomes. For each combination, the most recent and methodologically robust meta-analysis was selected for re-estimation, which gave 221 re-estimated meta-analyses in total, derived from 47 meta-analytic reports. In the short term, alpha-2 agonists, amphetamines, atomoxetine, methylphenidate, and viloxazine showed medium to large effect sizes in reducing the severity of ADHD symptoms in children and adolescents, with moderate to high certainty evidence. Methylphenidate showed consistent benefits across raters (standardised mean difference >0.75, 95% confidence interval (CI) 0.56 to 1.03; moderate or high certainty evidence). These interventions showed lower tolerability than the placebo, but this effect was not significant for methylphenidate and atomoxetine. In adults, atomoxetine, cognitive behavioural therapy, methylphenidate (and, when restricting analyses to high quality trials, amphetamines) showed at least moderate certainty evidence of efficacy on ADHD symptoms, with medium effect sizes. Methylphenidate, amphetamines, and atomoxetine had worse tolerability than placebo (methylphenidate, risk ratio 0.50, 95% CI 0.36 to 0.69; amphetamines, 0.40, 0.22 to 0.72; atomoxetine, 0.45, 0.35 to 0.58). Some non-drug interventions (acupuncture and cognitive behavioural therapy in children and adolescents, and mindfulness in adults) showed large effect sizes for ADHD symptoms, but with low certainty evidence. No high certainty, long term evidence was found for any intervention. An online platform showing effects and evidence certainty of each intervention across age groups, time points, and outcomes (https://ebiadhd-database.org/) was developed. This review provides updated evidence to inform patients, practitioners, and guideline developers how best to manage ADHD symptoms. The online platform should facilitate the implementation of shared decision making in daily practice. Open Science Framework https://osf.io/ugqy6/.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To assess the effects of and related evidence certainty of interventions for attention deficit/hyperactivity disorder (ADHD) across an individual's lifespan, and to develop a continuously updated web platform for people with lived experience of ADHD as a method to disseminate living evidence synthesis for shared decision making."
        },
        {
          "label": "DESIGN",
          "text": "Umbrella review and platform for shared decision making."
        },
        {
          "label": "DATA SOURCES",
          "text": "Six databases from inception to 19 January 2025. Study authors were contacted for additional information when necessary."
        },
        {
          "label": "ELIGIBILITY CRITERIA FOR SELECTING STUDIES",
          "text": "Systematic reviews that used meta-analyses of randomised controlled trials were eligible if they compared a drug or non-drug intervention with a passive control in individuals with a diagnosis of ADHD. Primary outcomes were severity of ADHD symptoms, analysed by rater type (clinician-rated, parent-rated, teacher-rated, or self-rated) and time point (short term (12 weeks, or study endpoint), medium term (26 weeks), and long term (52 weeks)),acceptability (participants dropping out for any reason), and tolerability (participants dropping out owing to any side effects). Secondary outcomes included daily functioning, quality of life, comorbid symptoms, and key side effects (decreased sleep and appetite)."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Eligible meta-analyses were re-estimated with a standardised statistical approach. Methodological quality was assessed using AMSTAR-2. Evidence certainty was evaluated using an algorithmic version of the GRADE framework, adapted for drug and non-drug interventions."
        },
        {
          "label": "RESULTS",
          "text": "115 of 414 full text articles were deemed eligible and 299 were excluded; the eligible articles comprised 221 unique combinations of participants, interventions, comparators, and outcomes. For each combination, the most recent and methodologically robust meta-analysis was selected for re-estimation, which gave 221 re-estimated meta-analyses in total, derived from 47 meta-analytic reports. In the short term, alpha-2 agonists, amphetamines, atomoxetine, methylphenidate, and viloxazine showed medium to large effect sizes in reducing the severity of ADHD symptoms in children and adolescents, with moderate to high certainty evidence. Methylphenidate showed consistent benefits across raters (standardised mean difference >0.75, 95% confidence interval (CI) 0.56 to 1.03; moderate or high certainty evidence). These interventions showed lower tolerability than the placebo, but this effect was not significant for methylphenidate and atomoxetine. In adults, atomoxetine, cognitive behavioural therapy, methylphenidate (and, when restricting analyses to high quality trials, amphetamines) showed at least moderate certainty evidence of efficacy on ADHD symptoms, with medium effect sizes. Methylphenidate, amphetamines, and atomoxetine had worse tolerability than placebo (methylphenidate, risk ratio 0.50, 95% CI 0.36 to 0.69; amphetamines, 0.40, 0.22 to 0.72; atomoxetine, 0.45, 0.35 to 0.58). Some non-drug interventions (acupuncture and cognitive behavioural therapy in children and adolescents, and mindfulness in adults) showed large effect sizes for ADHD symptoms, but with low certainty evidence. No high certainty, long term evidence was found for any intervention. An online platform showing effects and evidence certainty of each intervention across age groups, time points, and outcomes (https://ebiadhd-database.org/) was developed."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This review provides updated evidence to inform patients, practitioners, and guideline developers how best to manage ADHD symptoms. The online platform should facilitate the implementation of shared decision making in daily practice."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Open Science Framework https://osf.io/ugqy6/."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41297970/",
      "pubDate": "2025 Nov 26",
      "doi": "10.1136/bmj-2025-085875",
      "dateReceived": "2025-12-03T23:24:38.101Z",
      "isNew": false,
      "summary": "An online platform can help implement shared decision-making for managing ADHD symptoms in daily practice."
    },
    {
      "id": "3a9990f67afa",
      "title": "Comparative Effectiveness and Harm of Seasonal Influenza Vaccines in Adults Who Are Not Pregnant or Immunocompromised: A Rapid Review for the American College of Physicians.",
      "journal": "Ann Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49177163/118191",
      "abstract": "The American College of Physicians (ACP) developed these rapid practice points addressing the comparative effectiveness and harms of trivalent (3 different influenza viruses or viral proteins) and quadrivalent (4 different influenza viruses or viral proteins) influenza vaccines in adults aged 18 years or older who are not pregnant or immunocompromised. These practice points do not address adults aged 18 years or older who are pregnant or immunocompromised. The ACP Population Health and Medical Science Committee (PHMSC) developed the rapid practice points on the basis of a rapid review by the ACP Center for Evidence Reviews at Cochrane Austria. The rapid review was a focused update of the 2024 comprehensive, high-quality systematic review and meta-analysis conducted by the European Centre for Disease Prevention and Control. The ACP PHMSC focused on the comparative effectiveness of influenza vaccines compared with each other because of the established efficacy and safety of the standard influenza vaccines.",
      "structuredAbstract": [
        {
          "label": "DESCRIPTION",
          "text": "The American College of Physicians (ACP) developed these rapid practice points addressing the comparative effectiveness and harms of trivalent (3 different influenza viruses or viral proteins) and quadrivalent (4 different influenza viruses or viral proteins) influenza vaccines in adults aged 18 years or older who are not pregnant or immunocompromised. These practice points do not address adults aged 18 years or older who are pregnant or immunocompromised."
        },
        {
          "label": "METHODS",
          "text": "The ACP Population Health and Medical Science Committee (PHMSC) developed the rapid practice points on the basis of a rapid review by the ACP Center for Evidence Reviews at Cochrane Austria. The rapid review was a focused update of the 2024 comprehensive, high-quality systematic review and meta-analysis conducted by the European Centre for Disease Prevention and Control. The ACP PHMSC focused on the comparative effectiveness of influenza vaccines compared with each other because of the established efficacy and safety of the standard influenza vaccines."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41248504/",
      "pubDate": "2025 Nov 18",
      "doi": "10.7326/ANNALS-25-04056",
      "dateReceived": "2025-12-03T23:24:38.101Z",
      "isNew": false,
      "summary": "For non-pregnant, non-immunocompromised adults, the ACP focused on comparing the effectiveness of trivalent and quadrivalent influenza vaccines."
    },
    {
      "id": "932524d02b9a",
      "title": "Transepidermal Water Loss in Oral Food Challenges in Children With Peanut Allergy: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Allergy and Immunology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118199",
      "abstract": "Food allergy is a prevalent chronic medical condition in children, with limited diagnostic options. Transepidermal water loss (TEWL) is a measure of skin barrier function with emerging utility in atopy and food allergy. To determine whether use of TEWL as a stopping criterion can prevent anaphylaxis during a peanut oral food challenge (OFC). This was a single-center randomized clinical trial of children aged 6 months to 5 years with a history of a clinical peanut allergic reaction and positive peanut skin prick and/or serum immunoglobulin E testing. All participants underwent peanut OFC at an allergy referral clinic. The study began May 1, 2023, and ended August 31, 2024. The intervention was stopping OFC based on a 1 g/m2/h rise in TEWL plus 1 objective allergic symptom observed by the physician during OFC. Standard OFC stopping criteria or the intervention criteria, whichever came first, were used in the intervention group. OFC stopping criteria from standard research were used in the control group. This was a single-intervention study. Rate of anaphylaxis, defined as a Consortium for Food Allergy Research (CoFAR) score of 2 or higher, compared between the intervention and control groups using 4 anaphylaxis criteria approaches: CoFAR, Brighton Collaboration, Food Allergy and Anaphylaxis Network (FAAN), and World Allergy Organization (WAO). A total of 40 participants were included in the final analysis. The mean (SD) age of participants was 31.8 (16.18) months, with a median of 32.5 (range, 9-62) months; 23 (58%) were male. Using CoFAR criteria, among reactors, the anaphylaxis rate was 10 of 16 (63%; 95% CI, 39%-86%) in the intervention group compared with 14 of 14 (100%; 95% CI, 100%-100%) in the control group (P = .02). Using WAO criteria, 2 of 16 participants were reactors in the intervention group (anaphylaxis rate, 13%; 95% CI, 0%-29%) compared with 8 of 14 (57%; 95% CI, 31%-83%) in the control group (P = .02). There was no significant difference when comparing anaphylaxis rates using Brighton or FAAN criteria (eg, rate of 56% [95% CI, 32%-81%] vs 71% [95% CI, 48%-95%] in intervention vs control participants using Brighton criteria [P = .47]). The median CoFAR score in reactors in the intervention vs control groups was 1.8 (IQR, 1.0-2.0) vs 2.6 (IQR, 2.0-3.0) (P = .006). Eight of 16 participants (50%) in the intervention vs 12 of 14 (86%) in the control group required epinephrine (P = .06). In this randomized clinical trial, prospective use of TEWL as a stopping criterion reduced anaphylaxis rates during OFC in children with peanut allergy, suggesting use of TEWL could make OFC safer and more accessible. Replicating this study in a larger, multicenter population is a reasonable next step. ClinicalTrials.gov Identifier: NCT05696236.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Food allergy is a prevalent chronic medical condition in children, with limited diagnostic options. Transepidermal water loss (TEWL) is a measure of skin barrier function with emerging utility in atopy and food allergy."
        },
        {
          "label": "OBJECTIVE",
          "text": "To determine whether use of TEWL as a stopping criterion can prevent anaphylaxis during a peanut oral food challenge (OFC)."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This was a single-center randomized clinical trial of children aged 6 months to 5 years with a history of a clinical peanut allergic reaction and positive peanut skin prick and/or serum immunoglobulin E testing. All participants underwent peanut OFC at an allergy referral clinic. The study began May 1, 2023, and ended August 31, 2024."
        },
        {
          "label": "INTERVENTION",
          "text": "The intervention was stopping OFC based on a 1 g/m2/h rise in TEWL plus 1 objective allergic symptom observed by the physician during OFC. Standard OFC stopping criteria or the intervention criteria, whichever came first, were used in the intervention group. OFC stopping criteria from standard research were used in the control group. This was a single-intervention study."
        },
        {
          "label": "MAIN OUTCOME AND MEASURES",
          "text": "Rate of anaphylaxis, defined as a Consortium for Food Allergy Research (CoFAR) score of 2 or higher, compared between the intervention and control groups using 4 anaphylaxis criteria approaches: CoFAR, Brighton Collaboration, Food Allergy and Anaphylaxis Network (FAAN), and World Allergy Organization (WAO)."
        },
        {
          "label": "RESULTS",
          "text": "A total of 40 participants were included in the final analysis. The mean (SD) age of participants was 31.8 (16.18) months, with a median of 32.5 (range, 9-62) months; 23 (58%) were male. Using CoFAR criteria, among reactors, the anaphylaxis rate was 10 of 16 (63%; 95% CI, 39%-86%) in the intervention group compared with 14 of 14 (100%; 95% CI, 100%-100%) in the control group (P = .02). Using WAO criteria, 2 of 16 participants were reactors in the intervention group (anaphylaxis rate, 13%; 95% CI, 0%-29%) compared with 8 of 14 (57%; 95% CI, 31%-83%) in the control group (P = .02). There was no significant difference when comparing anaphylaxis rates using Brighton or FAAN criteria (eg, rate of 56% [95% CI, 32%-81%] vs 71% [95% CI, 48%-95%] in intervention vs control participants using Brighton criteria [P = .47]). The median CoFAR score in reactors in the intervention vs control groups was 1.8 (IQR, 1.0-2.0) vs 2.6 (IQR, 2.0-3.0) (P = .006). Eight of 16 participants (50%) in the intervention vs 12 of 14 (86%) in the control group required epinephrine (P = .06)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this randomized clinical trial, prospective use of TEWL as a stopping criterion reduced anaphylaxis rates during OFC in children with peanut allergy, suggesting use of TEWL could make OFC safer and more accessible. Replicating this study in a larger, multicenter population is a reasonable next step."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05696236."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41236740/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.43371",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "Using transepidermal water loss (TEWL) as a stopping criterion during oral food challenges (OFC) for peanut allergy in children decreased anaphylaxis rates, potentially making OFC safer."
    },
    {
      "id": "6a23b11c9b26",
      "title": "Fu's Subcutaneous Needling for Pain: A Systematic Review and Meta-Analysis of Randomized Controlled Trials.",
      "journal": "J Pain Res",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118105",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false
    },
    {
      "id": "f108882e43a3",
      "title": "Effects of Glucagon-Like Peptide-1 Receptor Agonists After Treatment Withdrawal: A Systematic Review and Meta-Analysis.",
      "journal": "J Gen Intern Med",
      "score": "5/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118219",
      "abstract": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) effectively promote weight reduction and improve glycemic control, blood pressure, and lipid profiles in individuals with overweight or obesity. This systematic review and meta-analysis evaluates the durability of these therapeutic benefits following treatment discontinuation. We conducted a systematic search of PubMed, Embase, Web of Science, Cochrane Library, CNKI, Wanfang, and VIP from inception to June 2024, to identify randomized controlled trials that assessed the effects of GLP-1RAs with a follow-up period of at least six months after treatment discontinuation. The outcomes were changes in weight, body mass index (BMI), waist circumference (WC), glycemia, blood pressure, and lipid profiles. We screened 10,670 studies and ultimately identified 5 eligible studies, encompassing 719 patients. Compared to the control group, GLP-1RAs were associated with significant reductions in weight (mean difference (MD) = -5.70 kg, 95% confidence interval (CI): -9.52 to -1.88), BMI (MD = -2.94 kg/m, 95% CI: -5.60 to -0.28), WC (MD = -3.66 cm, 95% CI: -4.89 to -2.43), glycated hemoglobin A1c (HbA1c) (standardized mean difference (SMD) = -0.73, 95% CI: -1.14 to -0.32), and systolic blood pressure (SBP) (MD = -3.62 mm Hg, 95% CI: -5.51 to -1.73) after cessation of therapy. After discontinuation, there was a pronounced rebound in weight (MD = 4.13 kg, 95% CI: 1.60 to 6.65), BMI (MD = 0.84 kg/m, 95% CI: 0.37 to 1.32), WC (MD = 3.64 cm, 95% CI: 2.27 to 5.01), and HbA1c (SMD = 0.69, 95% CI: 0.50 to 0.89). From study baseline to the end of follow-up, GLP-1RAs treatment resulted in statistically significant decreases in weight (MD = -2.32 kg, 95% CI: -4.21 to -0.43) and BMI (MD = -0.82 kg/m, 95% CI: -1.47 to -0.17). This meta-analysis demonstrated that although statistically significant weight reduction persists after GLP-1RAs discontinuation, the clinical significance and durability of this effect are limited. To achieve sustained therapeutic benefits, continued treatment with these agents may be necessary.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Glucagon-like peptide-1 receptor agonists (GLP-1RAs) effectively promote weight reduction and improve glycemic control, blood pressure, and lipid profiles in individuals with overweight or obesity. This systematic review and meta-analysis evaluates the durability of these therapeutic benefits following treatment discontinuation."
        },
        {
          "label": "METHODS",
          "text": "We conducted a systematic search of PubMed, Embase, Web of Science, Cochrane Library, CNKI, Wanfang, and VIP from inception to June 2024, to identify randomized controlled trials that assessed the effects of GLP-1RAs with a follow-up period of at least six months after treatment discontinuation. The outcomes were changes in weight, body mass index (BMI), waist circumference (WC), glycemia, blood pressure, and lipid profiles."
        },
        {
          "label": "RESULTS",
          "text": "We screened 10,670 studies and ultimately identified 5 eligible studies, encompassing 719 patients. Compared to the control group, GLP-1RAs were associated with significant reductions in weight (mean difference (MD) = -5.70 kg, 95% confidence interval (CI): -9.52 to -1.88), BMI (MD = -2.94 kg/m, 95% CI: -5.60 to -0.28), WC (MD = -3.66 cm, 95% CI: -4.89 to -2.43), glycated hemoglobin A1c (HbA1c) (standardized mean difference (SMD) = -0.73, 95% CI: -1.14 to -0.32), and systolic blood pressure (SBP) (MD = -3.62 mm Hg, 95% CI: -5.51 to -1.73) after cessation of therapy. After discontinuation, there was a pronounced rebound in weight (MD = 4.13 kg, 95% CI: 1.60 to 6.65), BMI (MD = 0.84 kg/m, 95% CI: 0.37 to 1.32), WC (MD = 3.64 cm, 95% CI: 2.27 to 5.01), and HbA1c (SMD = 0.69, 95% CI: 0.50 to 0.89). From study baseline to the end of follow-up, GLP-1RAs treatment resulted in statistically significant decreases in weight (MD = -2.32 kg, 95% CI: -4.21 to -0.43) and BMI (MD = -0.82 kg/m, 95% CI: -1.47 to -0.17)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "This meta-analysis demonstrated that although statistically significant weight reduction persists after GLP-1RAs discontinuation, the clinical significance and durability of this effect are limited. To achieve sustained therapeutic benefits, continued treatment with these agents may be necessary."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41249646/",
      "pubDate": "2025 Nov 17",
      "doi": "10.1007/s11606-025-09950-4",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "Weight loss from GLP-1RAs persists after stopping the medication, but the effect is small and likely requires continued treatment for lasting benefits."
    },
    {
      "id": "2d9b11fe674e",
      "title": "Efficacy, Immunogenicity, and Safety of Modified mRNA Influenza Vaccine.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118201",
      "abstract": "Influenza remains a major health burden despite the use of licensed vaccines. Nucleoside-modified messenger RNA (modRNA) influenza vaccines have shown promising immunogenicity against influenza and an acceptable safety profile in a phase 1-2 trial. In this phase 3 trial, we randomly assigned healthy adults between the ages of 18 and 64 years to receive either a quadrivalent modRNA influenza vaccine (modRNA group) or a licensed inactivated quadrivalent influenza vaccine (control group) during the 2022-2023 influenza season in the United States, South Africa, and the Philippines. The primary end point was relative efficacy, defined by the reduction in the percentage of participants with laboratory-confirmed influenza associated with influenza-like illness at least 14 days after vaccination with the modRNA vaccine, as compared with the control vaccine, and analyzed for noninferiority and superiority. Immunogenicity was evaluated by means of a hemagglutination inhibition (HAI) assay. We assessed reactogenicity within 7 days after vaccination, adverse events through 1 month, and serious adverse events through 6 months. We assessed vaccine efficacy, immunogenicity, and safety in the modRNA group. A total of 18,476 participants underwent randomization: 9225 were assigned to receive the modRNA vaccine and 9251 to receive the control vaccine. The relative efficacy of the modRNA vaccine as compared with the control vaccine against influenza-like illness was 34.5% (95% confidence interval [CI], 7.4 to 53.9) on the basis of 57 cases in the modRNA group and 87 cases in the control group, a finding that met the criteria for both noninferiority and superiority. Cases of influenza-like illness were caused by A/H3N2 and A/H1N1 strains but almost no B strains. The noninferiority of the antibody response on HAI assay was shown for influenza A strains but not for B strains. Primarily mild or moderate reactogenicity was observed in both vaccine groups but was reported more frequently in the modRNA group (overall local reactions, 70.1% vs. 43.1%; overall systemic events, 65.8% vs. 48.7%). Fever occurred in 5.6% of the participants in the modRNA group and in 1.7% of those in the control group. Adverse event profiles were similar in the two groups. The modRNA vaccine had statistically superior efficacy over the control vaccine, with greater immune responses to A/H3N2 and A/H1N1 strains, but was associated with more reactogenicity events. (Funded by Pfizer; C4781004 ClinicalTrials.gov number, NCT05540522.)See also in : Human clinical trial of a nucleoside-modified mRNA influenza vaccine.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Influenza remains a major health burden despite the use of licensed vaccines. Nucleoside-modified messenger RNA (modRNA) influenza vaccines have shown promising immunogenicity against influenza and an acceptable safety profile in a phase 1-2 trial."
        },
        {
          "label": "METHODS",
          "text": "In this phase 3 trial, we randomly assigned healthy adults between the ages of 18 and 64 years to receive either a quadrivalent modRNA influenza vaccine (modRNA group) or a licensed inactivated quadrivalent influenza vaccine (control group) during the 2022-2023 influenza season in the United States, South Africa, and the Philippines. The primary end point was relative efficacy, defined by the reduction in the percentage of participants with laboratory-confirmed influenza associated with influenza-like illness at least 14 days after vaccination with the modRNA vaccine, as compared with the control vaccine, and analyzed for noninferiority and superiority. Immunogenicity was evaluated by means of a hemagglutination inhibition (HAI) assay. We assessed reactogenicity within 7 days after vaccination, adverse events through 1 month, and serious adverse events through 6 months. We assessed vaccine efficacy, immunogenicity, and safety in the modRNA group."
        },
        {
          "label": "RESULTS",
          "text": "A total of 18,476 participants underwent randomization: 9225 were assigned to receive the modRNA vaccine and 9251 to receive the control vaccine. The relative efficacy of the modRNA vaccine as compared with the control vaccine against influenza-like illness was 34.5% (95% confidence interval [CI], 7.4 to 53.9) on the basis of 57 cases in the modRNA group and 87 cases in the control group, a finding that met the criteria for both noninferiority and superiority. Cases of influenza-like illness were caused by A/H3N2 and A/H1N1 strains but almost no B strains. The noninferiority of the antibody response on HAI assay was shown for influenza A strains but not for B strains. Primarily mild or moderate reactogenicity was observed in both vaccine groups but was reported more frequently in the modRNA group (overall local reactions, 70.1% vs. 43.1%; overall systemic events, 65.8% vs. 48.7%). Fever occurred in 5.6% of the participants in the modRNA group and in 1.7% of those in the control group. Adverse event profiles were similar in the two groups."
        },
        {
          "label": "CONCLUSIONS",
          "text": "The modRNA vaccine had statistically superior efficacy over the control vaccine, with greater immune responses to A/H3N2 and A/H1N1 strains, but was associated with more reactogenicity events. (Funded by Pfizer; C4781004 ClinicalTrials.gov number, NCT05540522.)See also in : Human clinical trial of a nucleoside-modified mRNA influenza vaccine."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41259756/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1056/NEJMoa2416779",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "The modRNA influenza vaccine demonstrated higher efficacy and immune responses compared to the control vaccine, but also caused more adverse reactions."
    },
    {
      "id": "823834fec055",
      "title": "Does Time to Achieve a Targeted Body Temperature Matter for Survivors of Cardiac Arrest? A Systematic Review and Meta-Analysis.",
      "journal": "Crit Care Med",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118197",
      "abstract": "To identify the impact of early hypothermic temperature control (HTC) initiation and achievement on neurologic outcomes after cardiac arrest. Secondary endpoints assessed: 1) overall survival, 2) body temperature at hospital admission, 3) time taken to reach targeted temperature, and 4) adverse events. Subgroup analyses assessed: 1) HTC induction method, 2) presenting rhythms (shockable vs. nonshockable), and 3) timing of HTC initiation (during cardiopulmonary resuscitation [CPR] vs. post-return of spontaneous circulation [ROSC]). PubMed, Cochrane Library, U.S. National Library of Medicine, MedRxiv, BioRxiv. Prospective randomized controlled trials enrolling comatose adult cardiac arrest patients that assessed the efficacy of early cooling (defined by initiation of HTC within 30 min of ROSC) against late cooling. Two reviewers independently conducted study selection, data extraction, and assessment of evidence quality. Full texts were jointly reviewed, with discrepancies resolved by a third reviewer through discussion and consensus. Of 7269 citations, 11 met the inclusion criteria. Early cooling did not improve neurologic outcomes (risk ratio [RR], 1.01; 95% CI, 0.94-1.14) nor survival (RR, 1.01; 95% CI, 0.92-1.11). Nasal evaporative cooling initiated during resuscitation may benefit patients with shockable rhythms (RR, 1.40; 95% CI, 1.00-1.96), while administering cold fluid during CPR was associated with a higher risk of rearrest. Cooling was initiated in the prehospital phase in ten studies, nine of which failed to achieve target temperature (32-34°C) by hospital admission. The median time to reach target temperature ranged from 38 to 360 minutes. Early HTC showed no neurologic nor survival benefit in cardiac arrest survivors. Nasal evaporative cooling during CPR may benefit those with shockable rhythms. Delays in reaching the target temperature may underlie the failure of HTC. Future studies should evaluate whether achieving target temperature, for example, within 30 minutes, rapidly improves outcomes.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVES",
          "text": "To identify the impact of early hypothermic temperature control (HTC) initiation and achievement on neurologic outcomes after cardiac arrest. Secondary endpoints assessed: 1) overall survival, 2) body temperature at hospital admission, 3) time taken to reach targeted temperature, and 4) adverse events. Subgroup analyses assessed: 1) HTC induction method, 2) presenting rhythms (shockable vs. nonshockable), and 3) timing of HTC initiation (during cardiopulmonary resuscitation [CPR] vs. post-return of spontaneous circulation [ROSC])."
        },
        {
          "label": "DATA SOURCES",
          "text": "PubMed, Cochrane Library, U.S. National Library of Medicine, MedRxiv, BioRxiv."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Prospective randomized controlled trials enrolling comatose adult cardiac arrest patients that assessed the efficacy of early cooling (defined by initiation of HTC within 30 min of ROSC) against late cooling."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Two reviewers independently conducted study selection, data extraction, and assessment of evidence quality. Full texts were jointly reviewed, with discrepancies resolved by a third reviewer through discussion and consensus."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Of 7269 citations, 11 met the inclusion criteria. Early cooling did not improve neurologic outcomes (risk ratio [RR], 1.01; 95% CI, 0.94-1.14) nor survival (RR, 1.01; 95% CI, 0.92-1.11). Nasal evaporative cooling initiated during resuscitation may benefit patients with shockable rhythms (RR, 1.40; 95% CI, 1.00-1.96), while administering cold fluid during CPR was associated with a higher risk of rearrest. Cooling was initiated in the prehospital phase in ten studies, nine of which failed to achieve target temperature (32-34°C) by hospital admission. The median time to reach target temperature ranged from 38 to 360 minutes."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Early HTC showed no neurologic nor survival benefit in cardiac arrest survivors. Nasal evaporative cooling during CPR may benefit those with shockable rhythms. Delays in reaching the target temperature may underlie the failure of HTC. Future studies should evaluate whether achieving target temperature, for example, within 30 minutes, rapidly improves outcomes."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41217361/",
      "pubDate": "2025 Nov 11",
      "doi": "10.1097/CCM.0000000000006964",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "Early therapeutic hypothermia did not improve neurological outcomes or survival, but rapid cooling during CPR for shockable rhythms may be beneficial."
    },
    {
      "id": "94b2b752d875",
      "title": "Major Bleeding With Apixaban vs Aspirin: A Subanalysis of the ARTESiA Randomized Clinical Trial.",
      "journal": "JAMA Cardiol",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Hemostasis and Thrombosis"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118155",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false
    },
    {
      "id": "a779b7d23355",
      "title": "Optimal Dose of Aerobic Exercise Programs to Reduce Pain Intensity and Improve Health Status in Patients With Fibromyalgia: A Dose-Response Meta-Analysis.",
      "journal": "Phys Ther",
      "score": "6/7",
      "tags": [
        "Special Interest - Pain -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118147",
      "abstract": "The purpose of this study was to examine the dose-response relationship between aerobic exercise programs and changes in pain intensity and health status in patients with fibromyalgia. Data sources for this study were PubMed, PEDro, Google Scholar, and EBSCO from inception until February 9, 2024. Randomized controlled trials (RCTs) of aerobic exercise in patients with a clinical diagnosis of fibromyalgia were included. Outcome measures were pain intensity (Visual Analog Scale) and health status (Fibromyalgia Impact Questionnaire (FIQ)). The dose-response relationship was evaluated using a restricted cubic spline model. Twenty-three RCTs were included. The meta-analysis showed a significant improvement in pain intensity and functional status. A minimum dose of 50 min per week standardized mean difference (SMD = -0.67; 95% CI = -0.70 to -0.65) and a total duration of 600 min (SMD = -0.65; 95% CI = -0.69 to -0.62) were estimated to effectively reduce pain intensity. The maximum effect was achieved with 90 min per week (SMD = -1.14; 95% CI = -1.19 to -1.09) and 1200 min total duration (SMD = -1.08; 95%CI = -1.13 to -1.02). Additionally, a minimum dose of 65 min per week (SMD = -0.62; 95% CI = -0.6 to -0.69) and a total duration of 950 min (SMD = -0.61; 95% CI = -0.60 to -0.67) were estimated to effectively reduce the FIQ score. While the maximum effect was obtained with 150 min per week (SMD = -1.77; 95% CI = -1.89 to -1.65) and 3000 min of total duration (SMD = -1.43; 95% CI = -1.54 to -1.31). These findings may be useful in optimizing the minimal dose of aerobic exercise to achieve health improvements in people with fibromyalgia.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "The purpose of this study was to examine the dose-response relationship between aerobic exercise programs and changes in pain intensity and health status in patients with fibromyalgia."
        },
        {
          "label": "DATA SOURCES",
          "text": "Data sources for this study were PubMed, PEDro, Google Scholar, and EBSCO from inception until February 9, 2024."
        },
        {
          "label": "STUDY SELECTION",
          "text": "Randomized controlled trials (RCTs) of aerobic exercise in patients with a clinical diagnosis of fibromyalgia were included."
        },
        {
          "label": "DATA EXTRACTION",
          "text": "Outcome measures were pain intensity (Visual Analog Scale) and health status (Fibromyalgia Impact Questionnaire (FIQ)). The dose-response relationship was evaluated using a restricted cubic spline model."
        },
        {
          "label": "DATA SYNTHESIS",
          "text": "Twenty-three RCTs were included. The meta-analysis showed a significant improvement in pain intensity and functional status. A minimum dose of 50 min per week standardized mean difference (SMD = -0.67; 95% CI = -0.70 to -0.65) and a total duration of 600 min (SMD = -0.65; 95% CI = -0.69 to -0.62) were estimated to effectively reduce pain intensity. The maximum effect was achieved with 90 min per week (SMD = -1.14; 95% CI = -1.19 to -1.09) and 1200 min total duration (SMD = -1.08; 95%CI = -1.13 to -1.02). Additionally, a minimum dose of 65 min per week (SMD = -0.62; 95% CI = -0.6 to -0.69) and a total duration of 950 min (SMD = -0.61; 95% CI = -0.60 to -0.67) were estimated to effectively reduce the FIQ score. While the maximum effect was obtained with 150 min per week (SMD = -1.77; 95% CI = -1.89 to -1.65) and 3000 min of total duration (SMD = -1.43; 95% CI = -1.54 to -1.31)."
        },
        {
          "label": "CONCLUSION",
          "text": "These findings may be useful in optimizing the minimal dose of aerobic exercise to achieve health improvements in people with fibromyalgia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/40272395/",
      "pubDate": "2025 Jun 02",
      "doi": "10.1093/ptj/pzaf057",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "Aerobic exercise can be optimized to achieve health improvements in people with fibromyalgia."
    },
    {
      "id": "a6fb7822f7cb",
      "title": "Stratified treatment of myocardial infarction with non-obstructive coronary arteries: the PROMISE trial.",
      "journal": "Eur Heart J",
      "score": "6/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118138",
      "abstract": "Myocardial infarction with non-obstructive coronary arteries (MINOCA) is associated with a significant risk of mortality, rehospitalisation, and angina burden. Despite its clinical impact, no randomized clinical trials have hitherto evaluated optimal management strategy for MINOCA. The PROMISE trial was designed to assess whether a stratified treatment improves clinical outcomes in patients with MINOCA as compared to standard care. PROMISE is a multicentre randomised trial. Patients with MINOCA were randomised 1:1 to either a stratified treatment based on a comprehensive diagnostic workup aimed at identifying the underlying aetiology, or to standard care. The primary endpoint was the between-group difference in the change in angina status at 12 months, assessed by the Seattle Angina Questionnaire summary score (SAQSS). The secondary endpoint was the incidence of major adverse cardiovascular events (MACE), defined as the composite of all-cause mortality, myocardial infarction, stroke, heart failure hospitalization and repeated coronary angiography. The trial was terminated early upon recommendation by the Data and Safety Monitoring Board due to clear benefits observed in the intervention group and potential harm in the control group. Of 101 randomized patients, 92 were confirmed as MINOCA and included in the final analysis (mean age 62±13 years, 48% women; stratified treatment n=45; standard care n=47). At 12-month follow-up, SAQSS was significantly higher in the stratified treatment than in standard care group, with a mean between-group difference of +9.38 in favour of the stratified treatment (95% confidence interval 6.81 to 11.95; p<0.001). MACE occurred in 1 patient (2.2%) in the stratified treatment and in 4 patients (8.5%) in the standard care group, though the difference was not statistically significant (p= 0.18). In this first randomized trial of treatment strategies in MINOCA, a stratified treatment, based on comprehensive diagnostic assessment and aetiology-guided therapy, led to a significant improvement in angina-related health status. While the study findings provide the first evidence supporting individualized management in this heterogeneous and often under-recognized patient population, these results require confirmation in a larger prospective study with longer follow-up.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND AND AIMS",
          "text": "Myocardial infarction with non-obstructive coronary arteries (MINOCA) is associated with a significant risk of mortality, rehospitalisation, and angina burden. Despite its clinical impact, no randomized clinical trials have hitherto evaluated optimal management strategy for MINOCA. The PROMISE trial was designed to assess whether a stratified treatment improves clinical outcomes in patients with MINOCA as compared to standard care."
        },
        {
          "label": "METHODS",
          "text": "PROMISE is a multicentre randomised trial. Patients with MINOCA were randomised 1:1 to either a stratified treatment based on a comprehensive diagnostic workup aimed at identifying the underlying aetiology, or to standard care. The primary endpoint was the between-group difference in the change in angina status at 12 months, assessed by the Seattle Angina Questionnaire summary score (SAQSS). The secondary endpoint was the incidence of major adverse cardiovascular events (MACE), defined as the composite of all-cause mortality, myocardial infarction, stroke, heart failure hospitalization and repeated coronary angiography. The trial was terminated early upon recommendation by the Data and Safety Monitoring Board due to clear benefits observed in the intervention group and potential harm in the control group."
        },
        {
          "label": "RESULTS",
          "text": "Of 101 randomized patients, 92 were confirmed as MINOCA and included in the final analysis (mean age 62±13 years, 48% women; stratified treatment n=45; standard care n=47). At 12-month follow-up, SAQSS was significantly higher in the stratified treatment than in standard care group, with a mean between-group difference of +9.38 in favour of the stratified treatment (95% confidence interval 6.81 to 11.95; p<0.001). MACE occurred in 1 patient (2.2%) in the stratified treatment and in 4 patients (8.5%) in the standard care group, though the difference was not statistically significant (p= 0.18)."
        },
        {
          "label": "CONCLUSIONS",
          "text": "In this first randomized trial of treatment strategies in MINOCA, a stratified treatment, based on comprehensive diagnostic assessment and aetiology-guided therapy, led to a significant improvement in angina-related health status. While the study findings provide the first evidence supporting individualized management in this heterogeneous and often under-recognized patient population, these results require confirmation in a larger prospective study with longer follow-up."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41150941/",
      "pubDate": "2025 Oct 28",
      "doi": "10.1093/eurheartj/ehaf917",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "A stratified, etiology-guided treatment approach in MINOCA patients significantly improved angina-related health status."
    },
    {
      "id": "a515536a8222",
      "title": "Maternal paracetamol (acetaminophen) use during pregnancy and risk of autism spectrum disorder and attention deficit/hyperactivity disorder in offspring: umbrella review of systematic reviews.",
      "journal": "BMJ",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118115",
      "abstract": "To assess the quality, biases, and validity of evidence on maternal paracetamol (acetaminophen) use during pregnancy and the risk of autism spectrum disorder (referred to as autism) and attention deficit/hyperactivity disorder (ADHD) in offspring. Umbrella review of systematic reviews. Medline, Embase, PsycINFO, and the Cochrane Database of Systematic Reviews, along with grey literature, Epistemonikos, and the reference lists of included studies (inception to 30 September 2025). Systematic reviews of randomised trials and cohort, case-control, or cross sectional studies that reported maternal paracetamol use during pregnancy and the diagnosis of autism or ADHD in offspring. Details of the primary studies included in the reviews are reported, including adjustments for key confounders (maternal characteristics, indication for paracetamol use, and familial factors) and unmeasured confounders and ascertainment of outcomes. Nine reviews (40 studies) reporting on autism (six studies) and ADHD (17 studies) in offspring were included. Four reviews undertook meta-analysis. The overlap of primary studies included in the reviews was very high (corrected covered area 23%). The reviews reported a possible to strong association between maternal paracetamol intake and autism or ADHD or both in offspring. Seven of the nine reviews advised caution when interpreting the findings owing to the potential risk of bias and confounding in the included studies. Confidence in the findings of the reviews was low (two reviews) to critically low (seven reviews) based on the AMSTAR 2 (A MeaSurement Tool to Assess Systematic Reviews) criteria. Only one review included studies (n=2) reporting autism and ADHD in offspring that appropriately adjusted for familial factors and unmeasured confounding through sibling controlled analyses. In both studies, the increased risk of autism in offspring (one study, hazard ratio 1.05, 95% confidence interval 1.02 to 1.08) and ADHD (two studies, 1.07, 1.05 to 1.10 and 2.02, 1.17 to 3.25 ) observed in the whole cohort analyses did not persist in sibling controlled analyses for autism (0.98, 0.93 to 1.04) and ADHD (0.98, 0.94 to 1.02 and 1.06, 0.51 to 2.05). Existing evidence does not clearly link maternal paracetamol use during pregnancy with autism or ADHD in offspring. PROSPERO CRD420251154052.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To assess the quality, biases, and validity of evidence on maternal paracetamol (acetaminophen) use during pregnancy and the risk of autism spectrum disorder (referred to as autism) and attention deficit/hyperactivity disorder (ADHD) in offspring."
        },
        {
          "label": "DESIGN",
          "text": "Umbrella review of systematic reviews."
        },
        {
          "label": "DATA SOURCES",
          "text": "Medline, Embase, PsycINFO, and the Cochrane Database of Systematic Reviews, along with grey literature, Epistemonikos, and the reference lists of included studies (inception to 30 September 2025)."
        },
        {
          "label": "INCLUSION CRITERIA",
          "text": "Systematic reviews of randomised trials and cohort, case-control, or cross sectional studies that reported maternal paracetamol use during pregnancy and the diagnosis of autism or ADHD in offspring. Details of the primary studies included in the reviews are reported, including adjustments for key confounders (maternal characteristics, indication for paracetamol use, and familial factors) and unmeasured confounders and ascertainment of outcomes."
        },
        {
          "label": "RESULTS",
          "text": "Nine reviews (40 studies) reporting on autism (six studies) and ADHD (17 studies) in offspring were included. Four reviews undertook meta-analysis. The overlap of primary studies included in the reviews was very high (corrected covered area 23%). The reviews reported a possible to strong association between maternal paracetamol intake and autism or ADHD or both in offspring. Seven of the nine reviews advised caution when interpreting the findings owing to the potential risk of bias and confounding in the included studies. Confidence in the findings of the reviews was low (two reviews) to critically low (seven reviews) based on the AMSTAR 2 (A MeaSurement Tool to Assess Systematic Reviews) criteria. Only one review included studies (n=2) reporting autism and ADHD in offspring that appropriately adjusted for familial factors and unmeasured confounding through sibling controlled analyses. In both studies, the increased risk of autism in offspring (one study, hazard ratio 1.05, 95% confidence interval 1.02 to 1.08) and ADHD (two studies, 1.07, 1.05 to 1.10 and 2.02, 1.17 to 3.25 ) observed in the whole cohort analyses did not persist in sibling controlled analyses for autism (0.98, 0.93 to 1.04) and ADHD (0.98, 0.94 to 1.02 and 1.06, 0.51 to 2.05)."
        },
        {
          "label": "CONCLUSION",
          "text": "Existing evidence does not clearly link maternal paracetamol use during pregnancy with autism or ADHD in offspring."
        },
        {
          "label": "SYSTEMATIC REVIEW REGISTRATION",
          "text": "PROSPERO CRD420251154052."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41207796/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1136/bmj-2025-088141",
      "dateReceived": "2025-12-02T23:26:07.334Z",
      "isNew": false,
      "summary": "Current research does not definitively show a connection between a mother taking paracetamol during pregnancy and autism or ADHD in her child."
    },
    {
      "id": "6720003fd7ca",
      "title": "Validation of the European Society of Cardiology 0/1-hour algorithm for chest pain triage in Asian emergency departments: a multinational stepped-wedge cluster-randomised trial.",
      "journal": "Heart",
      "score": "5/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118228",
      "dateReceived": "2025-12-02T23:26:07.333Z",
      "isNew": false
    },
    {
      "id": "9cf51224f975",
      "title": "Medical Management and Revascularization for Asymptomatic Carotid Stenosis.",
      "journal": "N Engl J Med",
      "score": "6/7",
      "tags": [
        "Neurology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118225",
      "abstract": "Improvements in medical therapy, carotid-artery stenting, and carotid endarterectomy call into question the preferred management of asymptomatic carotid stenosis. Whether adding revascularization to intensive medical management would provide greater benefit than intensive medical management alone is unclear. We conducted two parallel, observer-blinded clinical trials that enrolled patients with high-grade (≥70%) asymptomatic carotid stenosis across 155 centers in five countries. The stenting trial compared intensive medical management alone (medical-therapy group) with carotid-artery stenting plus intensive medical management (stenting group); the endarterectomy trial compared intensive medical management alone (medical-therapy group) with carotid endarterectomy plus intensive medical management (endarterectomy group). The primary outcome was a composite of any stroke or death, assessed from randomization to 44 days, or ipsilateral ischemic stroke, assessed during the remaining follow-up period up to 4 years. A total of 1245 patients underwent randomization in the stenting trial and 1240 in the endarterectomy trial. In the stenting trial, the 4-year incidence of primary-outcome events was 6.0% (95% confidence interval [CI], 3.8 to 8.3) in the medical-therapy group and 2.8% (95% CI, 1.5 to 4.3) in the stenting group (P = 0.02 for the absolute difference). In the endarterectomy trial, the 4-year incidence of primary-outcome events was 5.3% (95% CI, 3.3 to 7.4) in the medical-therapy group and 3.7% (95% CI, 2.1 to 5.5) in the endarterectomy group (P = 0.24 for the absolute difference). From day 0 to 44, in the stenting trial, no strokes or deaths occurred in the medical-therapy group and seven strokes and one death occurred in the stenting group; in the endarterectomy trial, three strokes occurred in the medical-therapy group and nine strokes occurred in the endarterectomy group. Among patients with high-grade stenosis without recent symptoms, the addition of stenting led to a lower risk of a composite of perioperative stroke or death or ipsilateral stroke within 4 years than intensive medical management alone. Carotid endarterectomy did not lead to a significant benefit. (Funded by the National Institute of Neurological Disorders and Stroke and others; CREST-2 ClinicalTrials.gov number, NCT02089217.).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Improvements in medical therapy, carotid-artery stenting, and carotid endarterectomy call into question the preferred management of asymptomatic carotid stenosis. Whether adding revascularization to intensive medical management would provide greater benefit than intensive medical management alone is unclear."
        },
        {
          "label": "METHODS",
          "text": "We conducted two parallel, observer-blinded clinical trials that enrolled patients with high-grade (≥70%) asymptomatic carotid stenosis across 155 centers in five countries. The stenting trial compared intensive medical management alone (medical-therapy group) with carotid-artery stenting plus intensive medical management (stenting group); the endarterectomy trial compared intensive medical management alone (medical-therapy group) with carotid endarterectomy plus intensive medical management (endarterectomy group). The primary outcome was a composite of any stroke or death, assessed from randomization to 44 days, or ipsilateral ischemic stroke, assessed during the remaining follow-up period up to 4 years."
        },
        {
          "label": "RESULTS",
          "text": "A total of 1245 patients underwent randomization in the stenting trial and 1240 in the endarterectomy trial. In the stenting trial, the 4-year incidence of primary-outcome events was 6.0% (95% confidence interval [CI], 3.8 to 8.3) in the medical-therapy group and 2.8% (95% CI, 1.5 to 4.3) in the stenting group (P = 0.02 for the absolute difference). In the endarterectomy trial, the 4-year incidence of primary-outcome events was 5.3% (95% CI, 3.3 to 7.4) in the medical-therapy group and 3.7% (95% CI, 2.1 to 5.5) in the endarterectomy group (P = 0.24 for the absolute difference). From day 0 to 44, in the stenting trial, no strokes or deaths occurred in the medical-therapy group and seven strokes and one death occurred in the stenting group; in the endarterectomy trial, three strokes occurred in the medical-therapy group and nine strokes occurred in the endarterectomy group."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Among patients with high-grade stenosis without recent symptoms, the addition of stenting led to a lower risk of a composite of perioperative stroke or death or ipsilateral stroke within 4 years than intensive medical management alone. Carotid endarterectomy did not lead to a significant benefit. (Funded by the National Institute of Neurological Disorders and Stroke and others; CREST-2 ClinicalTrials.gov number, NCT02089217.)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41269206/",
      "pubDate": "2025 Nov 21",
      "doi": "10.1056/NEJMoa2508800",
      "dateReceived": "2025-12-02T23:26:07.333Z",
      "isNew": false,
      "summary": "For patients with high-grade carotid stenosis without recent symptoms, carotid artery stenting reduced the risk of stroke or death compared to intensive medical management alone, while endarterectomy did not show a significant benefit."
    },
    {
      "id": "7ae75e26f1e6",
      "title": "Biweekly dosing of efsubaglutide alfa maintains glycaemic and continuous glucose monitoring control in type 2 diabetes: A randomised multicentre trial.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Endocrine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118213",
      "abstract": "To compare the glycaemic efficacy, continuous glucose monitoring (CGM) metrics, and safety of biweekly efsubaglutide alfa 3 mg (Q2W) versus weekly 1 mg (QW) in adults with type 2 diabetes inadequately controlled with lifestyle intervention. In this multicentre, randomised, open-label trial, 59 adults were allocated 1:1 to efsubaglutide alfa 3 mg Q2W or 1 mg QW for 12 weeks after a 1-week 1 mg run-in. The primary endpoint was change in HbA1c from baseline to week 13 (end of 12-week treatment). Secondary endpoints included fasting plasma glucose (FPG), CGM time in range (TIR, 3.9-10.0 mmol/L) and tight TIR (3.9-7.8 mmol/L), 24-h mean glucose, weight, lipids, and adverse events. Continuous outcomes were analysed using a mixed model for repeated measures (MMRM); categorical outcomes used stratified Mantel-Haenszel tests; p values/CI were descriptive. HbA1c decreased by -1.45% (SE 0.14) with Q2W and -1.53% (0.14) with QW; LS mean difference (Q2W-QW) 0.09% (95% CI -0.32, 0.50). FPG fell similarly (-2.07 vs. -2.22 mmol/L). TIR increased from 45.0% to 77.2% with Q2W and 75.1% with QW; tight TIR reached 53.8% and 48.8%, respectively. End-of-treatment 24-h mean CGM glucose was 8.12 versus 8.66 mmol/L (Q2W vs. QW). At week 13, HbA1c <7.0% was achieved by 55.2% (Q2W) and 65.5% (QW); ≤6.5% by 37.9% and 24.1%. Gastrointestinal adverse events predominated and were mostly mild to moderate; no hypoglycaemia or cardiovascular events occurred. Over 12 weeks, efsubaglutide alfa 3 mg Q2W provided glycaemic and CGM benefits comparable to 1 mg QW with favourable tolerability. These findings support the feasibility of a biweekly regimen as an alternative to weekly dosing; larger, longer-duration confirmatory trials in more diverse populations are warranted.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To compare the glycaemic efficacy, continuous glucose monitoring (CGM) metrics, and safety of biweekly efsubaglutide alfa 3 mg (Q2W) versus weekly 1 mg (QW) in adults with type 2 diabetes inadequately controlled with lifestyle intervention."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "In this multicentre, randomised, open-label trial, 59 adults were allocated 1:1 to efsubaglutide alfa 3 mg Q2W or 1 mg QW for 12 weeks after a 1-week 1 mg run-in. The primary endpoint was change in HbA1c from baseline to week 13 (end of 12-week treatment). Secondary endpoints included fasting plasma glucose (FPG), CGM time in range (TIR, 3.9-10.0 mmol/L) and tight TIR (3.9-7.8 mmol/L), 24-h mean glucose, weight, lipids, and adverse events. Continuous outcomes were analysed using a mixed model for repeated measures (MMRM); categorical outcomes used stratified Mantel-Haenszel tests; p values/CI were descriptive."
        },
        {
          "label": "RESULTS",
          "text": "HbA1c decreased by -1.45% (SE 0.14) with Q2W and -1.53% (0.14) with QW; LS mean difference (Q2W-QW) 0.09% (95% CI -0.32, 0.50). FPG fell similarly (-2.07 vs. -2.22 mmol/L). TIR increased from 45.0% to 77.2% with Q2W and 75.1% with QW; tight TIR reached 53.8% and 48.8%, respectively. End-of-treatment 24-h mean CGM glucose was 8.12 versus 8.66 mmol/L (Q2W vs. QW). At week 13, HbA1c <7.0% was achieved by 55.2% (Q2W) and 65.5% (QW); ≤6.5% by 37.9% and 24.1%. Gastrointestinal adverse events predominated and were mostly mild to moderate; no hypoglycaemia or cardiovascular events occurred."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Over 12 weeks, efsubaglutide alfa 3 mg Q2W provided glycaemic and CGM benefits comparable to 1 mg QW with favourable tolerability. These findings support the feasibility of a biweekly regimen as an alternative to weekly dosing; larger, longer-duration confirmatory trials in more diverse populations are warranted."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208635/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70262",
      "dateReceived": "2025-12-02T23:26:07.333Z",
      "isNew": false,
      "summary": "Efsubaglutide alfa 3 mg administered every two weeks demonstrated similar glycemic control and continuous glucose monitoring benefits compared to weekly dosing, with good tolerability, suggesting a potential alternative dosing schedule."
    },
    {
      "id": "d296d565de08",
      "title": "Oral itraconazole versus oral voriconazole for treatment-naive patients with chronic pulmonary aspergillosis in India (VICTOR-CPA trial): a single-centre, open-label, randomised, controlled, superiority trial.",
      "journal": "Lancet Infect Dis",
      "score": "6/7",
      "tags": [
        "Infectious Disease"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49157796/118203",
      "dateReceived": "2025-12-02T23:26:07.333Z",
      "isNew": false
    },
    {
      "id": "63bc3ea45353",
      "title": "Use of inhaled/nebulised ipratropium bromide in addition to standard first-line treatment with inhaled/nebulised short-acting beta 2-agonist and systemic steroid in the management of acute asthma exacerbations: a systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Arch Dis Child",
      "score": "5/7",
      "tags": [
        "Emergency Medicine",
        "Pediatric Emergency Medicine",
        "Pediatrics (General)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49071894/118167",
      "abstract": "The role of inhaled/nebulised ipratropium bromide (IB) in asthma is unclear. To assess the efficacy and safety of inhaled/nebulised IB for asthma management in children. We searched MEDLINE, EMBASE, CINAHL, the Cochrane Central Register of Controlled Trials and the Web of Science until July 2024. We included randomised controlled trials (RCTs) and followed international guidelines for reporting systematic reviews. Outcomes included morbidity, escalation of care, length of hospital stay, mortality, adverse events and lung function. We included 24 studies (total participants n=3238). The hospitalisation rate (risk ratio (RR) 0.84, 95% CI 0.70 to 1.00, I 30%), hospital stay in hours (MD 1.75, 95% CI -0.87 to 4.36, I 15%) and paediatric intensive care (PICU) admission (RR 0.91, 95% CI 0.35 to 2.32, I 0%) were similar. The hospitalisation rate was lower in patients who received IB nebuliser (RR 0.76, 95% CI 0.64 to 0.90, I 0%).The asthma severity score was significantly better in the IB group (MD -0.38, 95% CI -0.63 to -0.12, I 59%). No serious adverse events were reported. This review found high-certainty evidence that the IB nebuliser leads to a lower hospitalisation rate. However, when inhaled/nebulised IBs were analysed together, the hospitalisation rate was similar, with moderate certainty evidence. IB improved asthma clinical scores, with low certainty evidence. No difference was reported in other prespecified outcomes.Considering the current evidence and safety profile, inhaled/nebulised IB needs to be considered as an additional treatment for acute asthma exacerbation. CRD42023405023.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "The role of inhaled/nebulised ipratropium bromide (IB) in asthma is unclear."
        },
        {
          "label": "AIMS",
          "text": "To assess the efficacy and safety of inhaled/nebulised IB for asthma management in children."
        },
        {
          "label": "METHODS",
          "text": "We searched MEDLINE, EMBASE, CINAHL, the Cochrane Central Register of Controlled Trials and the Web of Science until July 2024. We included randomised controlled trials (RCTs) and followed international guidelines for reporting systematic reviews. Outcomes included morbidity, escalation of care, length of hospital stay, mortality, adverse events and lung function."
        },
        {
          "label": "RESULTS",
          "text": "We included 24 studies (total participants n=3238). The hospitalisation rate (risk ratio (RR) 0.84, 95% CI 0.70 to 1.00, I 30%), hospital stay in hours (MD 1.75, 95% CI -0.87 to 4.36, I 15%) and paediatric intensive care (PICU) admission (RR 0.91, 95% CI 0.35 to 2.32, I 0%) were similar. The hospitalisation rate was lower in patients who received IB nebuliser (RR 0.76, 95% CI 0.64 to 0.90, I 0%).The asthma severity score was significantly better in the IB group (MD -0.38, 95% CI -0.63 to -0.12, I 59%). No serious adverse events were reported."
        },
        {
          "label": "CONCLUSION",
          "text": "This review found high-certainty evidence that the IB nebuliser leads to a lower hospitalisation rate. However, when inhaled/nebulised IBs were analysed together, the hospitalisation rate was similar, with moderate certainty evidence. IB improved asthma clinical scores, with low certainty evidence. No difference was reported in other prespecified outcomes.Considering the current evidence and safety profile, inhaled/nebulised IB needs to be considered as an additional treatment for acute asthma exacerbation."
        },
        {
          "label": "PROSPERO REGISTRATION NUMBER",
          "text": "CRD42023405023."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41224524/",
      "pubDate": "2025 Nov 12",
      "doi": "10.1136/archdischild-2024-327898",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": false,
      "summary": "Nebulized inhaled beta-agonists (IB) reduce hospitalizations for acute asthma exacerbations, but when combined with other inhaled IBs, the effect on hospitalization is not significant."
    },
    {
      "id": "8cae940cceb0",
      "title": "Digital Detection of Dementia in Primary Care: A Randomized Clinical Trial.",
      "journal": "JAMA Netw Open",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)",
        "Geriatrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49062791/118160",
      "abstract": "Detection of Alzheimer disease and related dementias (ADRD) is a challenge in primary care settings. The Quick Dementia Rating System (QDRS) and the Passive Digital Marker (PDM) were developed as 2 scalable tools for early detection of ADRD. The QDRS is a patient-reported outcome measure, while the PDM is a machine learning algorithm that uses electronic health record (EHR) data. Both can be embedded in the EHR for ease of use. To evaluate the effect of the combined approach of QDRS plus PDM in improving the annual rate of new documented ADRD diagnoses in primary care practices. This randomized clinical trial was performed between July 2, 2022, and July 1, 2024. Nine federally qualified primary health care clinics in Indianapolis, Indiana, were randomized to usual care (no routine screening for ADRD), PDM only, or QDRS plus PDM. Participants were treated as per the randomization arm. Participants included adults 65 years and older, without a diagnosis of mild cognitive impairment, dementia, or severe mental illness. Data analysis was based on intention to treat and was performed between November 1, 2024, and August 20, 2025. Randomization of clinic to usual care, PDM only, or QDRS plus PDM. The primary outcome was 12-month cumulative incidence of ADRD diagnoses; the secondary outcome was any ADRD diagnostic workup, such as laboratory tests, neuropsychological testing, or brain imaging. The study included 5325 patients (mean [SD] age, 71.1 [5.9] years), 3312 (62.2%) of whom were female. Compared with the usual care clinics (12-month incidence, 213 of 1724 [12.4%]), the odds of an incident ADRD diagnosis were higher in the clinics randomized to QDRS plus PDM (12-month incidence, 355 of 2301 [15.4%]; adjusted odds ratio [AOR], 1.31; 95% CI, 1.05-1.64) but not the clinics randomized to PDM only (12-month incidence, 134 of 1300 [10.3%]; AOR, 0.84; 95% CI, 0.63-1.11]). Compared with the usual care clinics (12-month incidence, 500 of 1724 [29.0%]), the odds of ADRD diagnostic assessments were higher in the QDRS plus PDM clinics (12-month incidence, 844 of 2301 [36.7%]; AOR, 1.41; 95% CI, 1.12-1.77) but not the PDM clinics (12-month incidence, 362 of 1300 [27.8%]; AOR, 0.94; 95% CI, 0.72-1.22). This randomized clinical trial found that the combined approach was effective at scale for the early detection of ADRD in primary care settings. This is an important feature in busy primary care settings that can benefit both the health care system and patients. ClinicalTrials.gov Identifier: NCT05231954.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "Detection of Alzheimer disease and related dementias (ADRD) is a challenge in primary care settings. The Quick Dementia Rating System (QDRS) and the Passive Digital Marker (PDM) were developed as 2 scalable tools for early detection of ADRD. The QDRS is a patient-reported outcome measure, while the PDM is a machine learning algorithm that uses electronic health record (EHR) data. Both can be embedded in the EHR for ease of use."
        },
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effect of the combined approach of QDRS plus PDM in improving the annual rate of new documented ADRD diagnoses in primary care practices."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This randomized clinical trial was performed between July 2, 2022, and July 1, 2024. Nine federally qualified primary health care clinics in Indianapolis, Indiana, were randomized to usual care (no routine screening for ADRD), PDM only, or QDRS plus PDM. Participants were treated as per the randomization arm. Participants included adults 65 years and older, without a diagnosis of mild cognitive impairment, dementia, or severe mental illness. Data analysis was based on intention to treat and was performed between November 1, 2024, and August 20, 2025."
        },
        {
          "label": "INTERVENTION",
          "text": "Randomization of clinic to usual care, PDM only, or QDRS plus PDM."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary outcome was 12-month cumulative incidence of ADRD diagnoses; the secondary outcome was any ADRD diagnostic workup, such as laboratory tests, neuropsychological testing, or brain imaging."
        },
        {
          "label": "RESULTS",
          "text": "The study included 5325 patients (mean [SD] age, 71.1 [5.9] years), 3312 (62.2%) of whom were female. Compared with the usual care clinics (12-month incidence, 213 of 1724 [12.4%]), the odds of an incident ADRD diagnosis were higher in the clinics randomized to QDRS plus PDM (12-month incidence, 355 of 2301 [15.4%]; adjusted odds ratio [AOR], 1.31; 95% CI, 1.05-1.64) but not the clinics randomized to PDM only (12-month incidence, 134 of 1300 [10.3%]; AOR, 0.84; 95% CI, 0.63-1.11]). Compared with the usual care clinics (12-month incidence, 500 of 1724 [29.0%]), the odds of ADRD diagnostic assessments were higher in the QDRS plus PDM clinics (12-month incidence, 844 of 2301 [36.7%]; AOR, 1.41; 95% CI, 1.12-1.77) but not the PDM clinics (12-month incidence, 362 of 1300 [27.8%]; AOR, 0.94; 95% CI, 0.72-1.22)."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "This randomized clinical trial found that the combined approach was effective at scale for the early detection of ADRD in primary care settings. This is an important feature in busy primary care settings that can benefit both the health care system and patients."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05231954."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41212562/",
      "pubDate": "2025 Nov 03",
      "doi": "10.1001/jamanetworkopen.2025.42222",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": false,
      "summary": "The combined approach effectively detected early ADRD in primary care settings."
    },
    {
      "id": "4d4ad54c4ba4",
      "title": "DASH-Patterned Groceries and Effects on Blood Pressure: The GoFresh Randomized Clinical Trial.",
      "journal": "JAMA",
      "score": "5/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49062791/118129",
      "abstract": "The Dietary Approaches to Stop Hypertension (DASH) eating plan lowered blood pressure (BP) among Black adults in a controlled environment, but to date, there are no grocery shopping strategies that replicated its health effects in a community setting. The Groceries for Black Residents of Boston to Stop Hypertension (GoFresh) trial was conducted to determine the effects of low sodium-DASH groceries on systolic BP. This parallel-group randomized clinical trial was conducted in Boston from August 2022 to September 2025 among Black residents of urban communities with few grocery stores, a systolic BP of 120 to less than 150 mm Hg, a diastolic BP less than 100 mm Hg, and no hypertension treatment. Data were analyzed from June through October 2025. Participants were randomly assigned to 12 weeks of home-delivered, DASH-patterned groceries ordered weekly with dietitian counseling without emphasizing cost or three $500 stipends every 4 weeks intended for self-directed grocery shopping. The primary comparison was the difference in the 3-month change in model-estimated office systolic BP (based on 3 measurements over at least 2 visits) between interventions. Adherence was assessed via 24-hour urine collection. Secondary outcomes included diastolic BP, body mass index (BMI), hemoglobin A1c levels, and low-density lipoprotein (LDL) cholesterol. Maintenance of effects was assessed 3 months after intervention cessation. Among 180 participants, (mean [SD] age, 46.1 [13.3] years; 102 female [56.7%]; 180 self-reported Black [100%]; 12 Hispanic [6.7%]), 175 individuals (97.2%) completed the primary outcome assessment. Mean (SD) baseline systolic BP and diastolic BP were 130.0 (6.7) mm Hg and 79.8 (8.1) mm Hg. At 3 months, the mean systolic BP changed -5.7 mm Hg (95% CI, -7.4, to-3.9 mm Hg) in the DASH-patterned group and -2.3 mm Hg (95% CI, -4.1 to -0.4 mm Hg) in the self-directed group (difference in changes, -3.4 mm Hg; 95% CI, -5.9 to -0.8 mm Hg; P = .009). Compared with the self-directed group, after 3 months the DASH-patterned group changed mean diastolic BP by -2.4 mm Hg (95% CI, -4.2 to -0.5 mm Hg), urine sodium level by -545 mg/24 h (95% CI, -1041 to -50 mg/24 h), and LDL cholesterol by -8.0 mg/dL (95% CI, -13.7 to -2.3 mg/dL) (to convert LDL cholesterol to millimoles per liter, multiply by 0.0259). Effects were not maintained 6 months after the intervention was initiated. No effects occurred in BMI or hemoglobin A1c level. In this study, a program of home-delivered, DASH-style groceries plus dietitian counseling decreased BP and LDL cholesterol levels beyond comparable monetary compensation. However, effects were not maintained after the intervention ended. ClinicalTrials.gov Identifier: NCT05121337.",
      "structuredAbstract": [
        {
          "label": "IMPORTANCE",
          "text": "The Dietary Approaches to Stop Hypertension (DASH) eating plan lowered blood pressure (BP) among Black adults in a controlled environment, but to date, there are no grocery shopping strategies that replicated its health effects in a community setting."
        },
        {
          "label": "OBJECTIVE",
          "text": "The Groceries for Black Residents of Boston to Stop Hypertension (GoFresh) trial was conducted to determine the effects of low sodium-DASH groceries on systolic BP."
        },
        {
          "label": "DESIGN, SETTING, AND PARTICIPANTS",
          "text": "This parallel-group randomized clinical trial was conducted in Boston from August 2022 to September 2025 among Black residents of urban communities with few grocery stores, a systolic BP of 120 to less than 150 mm Hg, a diastolic BP less than 100 mm Hg, and no hypertension treatment. Data were analyzed from June through October 2025."
        },
        {
          "label": "INTERVENTIONS",
          "text": "Participants were randomly assigned to 12 weeks of home-delivered, DASH-patterned groceries ordered weekly with dietitian counseling without emphasizing cost or three $500 stipends every 4 weeks intended for self-directed grocery shopping."
        },
        {
          "label": "MAIN OUTCOMES AND MEASURES",
          "text": "The primary comparison was the difference in the 3-month change in model-estimated office systolic BP (based on 3 measurements over at least 2 visits) between interventions. Adherence was assessed via 24-hour urine collection. Secondary outcomes included diastolic BP, body mass index (BMI), hemoglobin A1c levels, and low-density lipoprotein (LDL) cholesterol. Maintenance of effects was assessed 3 months after intervention cessation."
        },
        {
          "label": "RESULTS",
          "text": "Among 180 participants, (mean [SD] age, 46.1 [13.3] years; 102 female [56.7%]; 180 self-reported Black [100%]; 12 Hispanic [6.7%]), 175 individuals (97.2%) completed the primary outcome assessment. Mean (SD) baseline systolic BP and diastolic BP were 130.0 (6.7) mm Hg and 79.8 (8.1) mm Hg. At 3 months, the mean systolic BP changed -5.7 mm Hg (95% CI, -7.4, to-3.9 mm Hg) in the DASH-patterned group and -2.3 mm Hg (95% CI, -4.1 to -0.4 mm Hg) in the self-directed group (difference in changes, -3.4 mm Hg; 95% CI, -5.9 to -0.8 mm Hg; P = .009). Compared with the self-directed group, after 3 months the DASH-patterned group changed mean diastolic BP by -2.4 mm Hg (95% CI, -4.2 to -0.5 mm Hg), urine sodium level by -545 mg/24 h (95% CI, -1041 to -50 mg/24 h), and LDL cholesterol by -8.0 mg/dL (95% CI, -13.7 to -2.3 mg/dL) (to convert LDL cholesterol to millimoles per liter, multiply by 0.0259). Effects were not maintained 6 months after the intervention was initiated. No effects occurred in BMI or hemoglobin A1c level."
        },
        {
          "label": "CONCLUSIONS AND RELEVANCE",
          "text": "In this study, a program of home-delivered, DASH-style groceries plus dietitian counseling decreased BP and LDL cholesterol levels beyond comparable monetary compensation. However, effects were not maintained after the intervention ended."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "ClinicalTrials.gov Identifier: NCT05121337."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41206973/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1001/jama.2025.21112",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": false,
      "summary": "Home-delivered DASH groceries and dietitian counseling effectively lowered blood pressure and LDL cholesterol, but these benefits were not sustained after the program concluded."
    },
    {
      "id": "dbee1cf143c5",
      "title": "Risk of infection and wound dehiscence after use of prophylactic antibiotics in episiotomy or second degree tear (REPAIR study): single centre, double blind, placebo controlled randomised trial.",
      "journal": "BMJ",
      "score": "5/7",
      "tags": [
        "Obstetrics"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49062791/118035",
      "abstract": "To evaluate the effect of prophylactic antibiotics on the risk of wound complications after episiotomy or second degree tear. Single centre, double blind, placebo controlled randomised trial. One university hospital in the Capital Region of Denmark. Participants were enrolled between March and December 2023. All initial clinical consultations were conducted between March 2023 and January 2024, and all long term follow-up consultations were conducted between March and November 2024. This article reports only data from the first consultation. 442 women with episiotomies or second degree tears were consecutively recruited at delivery. Exclusion criteria included treatment allergy (or risk of cross reactivity with related antibiotics), antibiotic use within 24 hours of delivery, non-Danish speakers, caesarean section, or episiotomy extension. A computer generated program randomised participants to either three doses of amoxicillin (500 mg) with clavulanic acid (125 mg) or placebo starting within six hours post partum and repeated at eight hour intervals. Follow-up was conducted four to 14 days post partum. Physicians, the steering committee, and participants were blinded. Wound complications (primary outcome) and clinically relevant wound complications (secondary outcome). The study ended as planned, in December 2024. 433 women completed follow-up and were included in the primary analysis. No significant difference was observed in overall wound complications (antibiotic 47/218, 22%; placebo 62/215, 29%; P=0.10), with a risk difference of -7.2% (95% confidence interval (CI) -15.4% to 0.8%) and a relative risk of 0.75 (0.54 to 1.04). For clinically relevant wound complications, significantly fewer events occurred in the treatment group (19/218, 9%  36/215, 17%; P=0.01), with a risk difference of -8.0% (95% CI -14.3% to -1.8%) and a relative risk of 0.52 (0.31 to 0.88). For clinically relevant wound complications, the number needed to treat was 12 (95% CI 7 to 56). Exploratory outcomes show that the treatment group reported better self-evaluated health, received fewer additional antibiotic treatments, and had smaller average wound dehiscence among patients with dehiscence. No serious adverse reactions occurred. Although no significant effect was seen for overall wound complications, prophylactic antibiotics significantly reduced the risk of clinically relevant wound complications in women with episiotomies and second degree tears and should be considered in postpartum care. Clinical Trials Information System (euclinicaltrials.eu) 2022-501930-49-00 and ClinicalTrials.gov NCT05830162.",
      "structuredAbstract": [
        {
          "label": "OBJECTIVE",
          "text": "To evaluate the effect of prophylactic antibiotics on the risk of wound complications after episiotomy or second degree tear."
        },
        {
          "label": "DESIGN",
          "text": "Single centre, double blind, placebo controlled randomised trial."
        },
        {
          "label": "SETTING",
          "text": "One university hospital in the Capital Region of Denmark. Participants were enrolled between March and December 2023. All initial clinical consultations were conducted between March 2023 and January 2024, and all long term follow-up consultations were conducted between March and November 2024. This article reports only data from the first consultation."
        },
        {
          "label": "PARTICIPANTS",
          "text": "442 women with episiotomies or second degree tears were consecutively recruited at delivery. Exclusion criteria included treatment allergy (or risk of cross reactivity with related antibiotics), antibiotic use within 24 hours of delivery, non-Danish speakers, caesarean section, or episiotomy extension."
        },
        {
          "label": "INTERVENTION",
          "text": "A computer generated program randomised participants to either three doses of amoxicillin (500 mg) with clavulanic acid (125 mg) or placebo starting within six hours post partum and repeated at eight hour intervals. Follow-up was conducted four to 14 days post partum. Physicians, the steering committee, and participants were blinded."
        },
        {
          "label": "MAIN OUTCOME MEASURES",
          "text": "Wound complications (primary outcome) and clinically relevant wound complications (secondary outcome)."
        },
        {
          "label": "RESULTS",
          "text": "The study ended as planned, in December 2024. 433 women completed follow-up and were included in the primary analysis. No significant difference was observed in overall wound complications (antibiotic 47/218, 22%; placebo 62/215, 29%; P=0.10), with a risk difference of -7.2% (95% confidence interval (CI) -15.4% to 0.8%) and a relative risk of 0.75 (0.54 to 1.04). For clinically relevant wound complications, significantly fewer events occurred in the treatment group (19/218, 9%  36/215, 17%; P=0.01), with a risk difference of -8.0% (95% CI -14.3% to -1.8%) and a relative risk of 0.52 (0.31 to 0.88). For clinically relevant wound complications, the number needed to treat was 12 (95% CI 7 to 56). Exploratory outcomes show that the treatment group reported better self-evaluated health, received fewer additional antibiotic treatments, and had smaller average wound dehiscence among patients with dehiscence. No serious adverse reactions occurred."
        },
        {
          "label": "CONCLUSION",
          "text": "Although no significant effect was seen for overall wound complications, prophylactic antibiotics significantly reduced the risk of clinically relevant wound complications in women with episiotomies and second degree tears and should be considered in postpartum care."
        },
        {
          "label": "TRIAL REGISTRATION",
          "text": "Clinical Trials Information System (euclinicaltrials.eu) 2022-501930-49-00 and ClinicalTrials.gov NCT05830162."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41161737/",
      "pubDate": "2025 Oct 29",
      "doi": "10.1136/bmj-2025-084312",
      "dateReceived": "2025-12-01T23:26:47.004Z",
      "isNew": false,
      "summary": "Prophylactic antibiotics significantly reduce clinically relevant wound complications in women with episiotomies and second-degree tears."
    },
    {
      "id": "12e950a3003e",
      "title": "Incremental Value of Cardiac Myosin-Binding Protein C for the Early Diagnosis of Acute Myocardial Infarction.",
      "journal": "J Am Coll Cardiol",
      "score": "6/7",
      "tags": [
        "Cardiology",
        "Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49138101/118154",
      "abstract": "Cardiac myosin-binding protein C (cMyC) is a cardiac-specific sarcomeric protein with faster release kinetics compared with those of high-sensitivity cardiac troponin (hs-cTn). The aim of this study was to compare the diagnostic performance of cMyC, measured with a novel prototype automated immunoassay, with high-sensitivity cardiac troponin T (hs-cTnT) and high-sensitivity cardiac troponin I (hs-cTnI) for the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI). Furthermore, we derived a single blood draw dual-biomarker strategy combining hs-cTn and cMyC and compared it with the hs-cTnT/I-only strategy endorsed by the European Society of Cardiology. This was a secondary analysis from an international prospective study recruiting adult patients presenting to the emergency department (ED) with suspected NSTEMI. cMyC, hs-cTnT, and hs-cTnI concentrations were measured upon ED presentation. Final diagnoses were centrally adjudicated by 2 independent cardiologists blinded to cMyC values. To compare the single- and dual-biomarker strategy, safety (defined as the sensitivity and negative predictive value for ruling out index NSTEMI) and triage efficacy (defined as the proportion of patients triaged to either rule-out or rule-in) were assessed. The diagnostic endpoint was index NSTEMI. The prognostic endpoint was 30-day, 1-year, and 5-year cardiovascular death or MI. Findings were externally validated in an independent international cohort. Among 4,735 eligible patients, 854 (18%) were diagnosed with NSTEMI. The discrimination for NSTEMI at presentation was higher for cMyC (area under the curve [AUC]: 0.943; 95% CI: 0.936-0.95) than for hs-cTnT (AUC: 0.936; 95% CI: 0.929-0.944; P = 0.008). Differences were mainly driven by patients with chest pain onset ≤3 hours (AUC of 0.939 [95% CI: 0.928-0.951] vs 0.921 [95% CI: 0.907-0.936], respectively; P < 0.001). The dual-biomarker strategy increased overall triage efficacy from 26.8% (hs-cTnT only) to 60.0% (hs-cTnT and cMyC), without compromising safety during the index visit. Despite identifying up to 3 times more patients for rule-out, the dual-biomarker strategy showed comparable cumulative incidences of cardiovascular death or myocardial infarction at 30 days, 1 year, and 5 years. Similar results were observed with hs-cTnI and in the external validation cohort. CMyC adds significant incremental value to hs-cTn values in the early diagnosis of NSTEMI, improving diagnostic discrimination and enabling more patients to be safely and immediately ruled out for NSTEMI. The single blood draw dual-biomarker strategy is particularly attractive in busy ED settings due to its simplicity and quick time-to-decision. (Advantageous Predictors of Acute Coronary Syndromes Evaluation [APACE]; NCT00470587).",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Cardiac myosin-binding protein C (cMyC) is a cardiac-specific sarcomeric protein with faster release kinetics compared with those of high-sensitivity cardiac troponin (hs-cTn)."
        },
        {
          "label": "OBJECTIVES",
          "text": "The aim of this study was to compare the diagnostic performance of cMyC, measured with a novel prototype automated immunoassay, with high-sensitivity cardiac troponin T (hs-cTnT) and high-sensitivity cardiac troponin I (hs-cTnI) for the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI). Furthermore, we derived a single blood draw dual-biomarker strategy combining hs-cTn and cMyC and compared it with the hs-cTnT/I-only strategy endorsed by the European Society of Cardiology."
        },
        {
          "label": "METHODS",
          "text": "This was a secondary analysis from an international prospective study recruiting adult patients presenting to the emergency department (ED) with suspected NSTEMI. cMyC, hs-cTnT, and hs-cTnI concentrations were measured upon ED presentation. Final diagnoses were centrally adjudicated by 2 independent cardiologists blinded to cMyC values. To compare the single- and dual-biomarker strategy, safety (defined as the sensitivity and negative predictive value for ruling out index NSTEMI) and triage efficacy (defined as the proportion of patients triaged to either rule-out or rule-in) were assessed. The diagnostic endpoint was index NSTEMI. The prognostic endpoint was 30-day, 1-year, and 5-year cardiovascular death or MI. Findings were externally validated in an independent international cohort."
        },
        {
          "label": "RESULTS",
          "text": "Among 4,735 eligible patients, 854 (18%) were diagnosed with NSTEMI. The discrimination for NSTEMI at presentation was higher for cMyC (area under the curve [AUC]: 0.943; 95% CI: 0.936-0.95) than for hs-cTnT (AUC: 0.936; 95% CI: 0.929-0.944; P = 0.008). Differences were mainly driven by patients with chest pain onset ≤3 hours (AUC of 0.939 [95% CI: 0.928-0.951] vs 0.921 [95% CI: 0.907-0.936], respectively; P < 0.001). The dual-biomarker strategy increased overall triage efficacy from 26.8% (hs-cTnT only) to 60.0% (hs-cTnT and cMyC), without compromising safety during the index visit. Despite identifying up to 3 times more patients for rule-out, the dual-biomarker strategy showed comparable cumulative incidences of cardiovascular death or myocardial infarction at 30 days, 1 year, and 5 years. Similar results were observed with hs-cTnI and in the external validation cohort."
        },
        {
          "label": "CONCLUSIONS",
          "text": "CMyC adds significant incremental value to hs-cTn values in the early diagnosis of NSTEMI, improving diagnostic discrimination and enabling more patients to be safely and immediately ruled out for NSTEMI. The single blood draw dual-biomarker strategy is particularly attractive in busy ED settings due to its simplicity and quick time-to-decision. (Advantageous Predictors of Acute Coronary Syndromes Evaluation [APACE]; NCT00470587)."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41222525/",
      "pubDate": "2025 Oct 13",
      "doi": "10.1016/j.jacc.2025.09.008",
      "dateReceived": "2025-12-01T23:26:47.003Z",
      "isNew": false,
      "summary": "Combining cardiac myosin-binding protein C (cMyC) with high-sensitivity cardiac troponin (hs-cTn) improves the early diagnosis of non-ST-segment elevation myocardial infarction (NSTEMI) and allows for safer and faster rule-out decisions."
    },
    {
      "id": "6e31164457c1",
      "title": "Orforglipron, an oral small-molecule GLP-1 receptor agonist, for the treatment of obesity in people with type 2 diabetes (ATTAIN-2): a phase 3, double-blind, randomised, multicentre, placebo-controlled trial.",
      "journal": "Lancet",
      "score": "6/7",
      "tags": [
        "Endocrine",
        "Family Medicine (FM)/General Practice (GP)",
        "Special Interest - Obesity -- Physician"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49117264/118227",
      "abstract": "Obesity is a chronic disease that significantly contributes to type 2 diabetes and its complications. We aimed to evaluate orforglipron, an oral small-molecule (non-peptide) GLP-1 receptor agonist, for obesity treatment in adults with type 2 diabetes. This 72-week, phase 3, double-blind, placebo-controlled trial was conducted across 136 sites in ten countries. Participants with a BMI of 27 kg/m or higher and glycated haemoglobin (HbA) of 7-10% (53-86 mmol/mol) were randomly assigned (1:1:1:2) to once-daily orforglipron 6 mg, 12 mg, 36 mg, or placebo. The primary endpoint was the mean percent change in bodyweight from baseline to week 72. The treatment regimen estimand (using data from all randomly assigned participants, regardless of intercurrent events) was the primary estimand, with the efficacy estimand considered supportive. Safety was assessed in all patients who received at least one dose of study drug. This trial was registered at ClinicalTrials.gov (NCT05872620) and is completed. From June 5, 2023, to Feb 15, 2024, 2859 participants were screened, and 1613 (757 [46·9%] female) were randomly assigned, following a dose-escalation phase, to receive orforglipron 6 mg (n=329), 12 mg (n=332), 36 mg (n=322), or placebo (n=630), as an adjunct to lifestyle modification; 1444 (89·5%) completed the study. Baseline bodyweight was 101·4 kg (SD 22·5), BMI 35·6 kg/m (SD 6·6), and HbA 8·05% (SD 0·75; 64·4 mmol/mol [SD 8·2]). For the treatment regimen estimand, the mean percent change in bodyweight from baseline to week 72 was -5·1% (95% CI -6·0 to -4·2) with 6 mg (estimated treatment difference [ETD] -2·7 [95% CI -3·7 to -1·6]; p<0·0001), -7·0% (-7·8 to -6·2) with 12 mg (ETD -4·5 [-5·5 to -3·6]; p<0·0001), and -9·6% (-10·5 to -8·7) with 36 mg orforglipron (ETD -7·1 [-8·2 to -6·1]; p<0·0001), versus -2·5% (-3·0 to -1·9) with placebo (all p<0·0001 compared with placebo). All prespecified weight and cardiometabolic measures including HbA statistically significantly improved with orforglipron. Treatment discontinuations due to adverse events (mainly gastrointestinal-related) were higher for orforglipron (6·1-9·9%) versus placebo (4·1%). The most common adverse events with orforglipron were mild-to-moderate gastrointestinal events, predominantly occurring during dose escalation. Ten deaths were reported during the study: six with orforglipron and four with placebo. Investigators deemed all deaths unrelated to the study treatment, except for one case in the placebo group and one case in the 12 mg orforglipron group. For the case in the orforglipron group, no treatment-related association was reported. In adults with obesity or overweight and type 2 diabetes, statistically superior reduction in bodyweight compared with placebo was demonstrated by once-daily orforglipron as an adjunct to lifestyle modification, with a safety profile similar to other GLP-1 receptor agonists. Eli Lilly and Company.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "Obesity is a chronic disease that significantly contributes to type 2 diabetes and its complications. We aimed to evaluate orforglipron, an oral small-molecule (non-peptide) GLP-1 receptor agonist, for obesity treatment in adults with type 2 diabetes."
        },
        {
          "label": "METHODS",
          "text": "This 72-week, phase 3, double-blind, placebo-controlled trial was conducted across 136 sites in ten countries. Participants with a BMI of 27 kg/m or higher and glycated haemoglobin (HbA) of 7-10% (53-86 mmol/mol) were randomly assigned (1:1:1:2) to once-daily orforglipron 6 mg, 12 mg, 36 mg, or placebo. The primary endpoint was the mean percent change in bodyweight from baseline to week 72. The treatment regimen estimand (using data from all randomly assigned participants, regardless of intercurrent events) was the primary estimand, with the efficacy estimand considered supportive. Safety was assessed in all patients who received at least one dose of study drug. This trial was registered at ClinicalTrials.gov (NCT05872620) and is completed."
        },
        {
          "label": "FINDINGS",
          "text": "From June 5, 2023, to Feb 15, 2024, 2859 participants were screened, and 1613 (757 [46·9%] female) were randomly assigned, following a dose-escalation phase, to receive orforglipron 6 mg (n=329), 12 mg (n=332), 36 mg (n=322), or placebo (n=630), as an adjunct to lifestyle modification; 1444 (89·5%) completed the study. Baseline bodyweight was 101·4 kg (SD 22·5), BMI 35·6 kg/m (SD 6·6), and HbA 8·05% (SD 0·75; 64·4 mmol/mol [SD 8·2]). For the treatment regimen estimand, the mean percent change in bodyweight from baseline to week 72 was -5·1% (95% CI -6·0 to -4·2) with 6 mg (estimated treatment difference [ETD] -2·7 [95% CI -3·7 to -1·6]; p<0·0001), -7·0% (-7·8 to -6·2) with 12 mg (ETD -4·5 [-5·5 to -3·6]; p<0·0001), and -9·6% (-10·5 to -8·7) with 36 mg orforglipron (ETD -7·1 [-8·2 to -6·1]; p<0·0001), versus -2·5% (-3·0 to -1·9) with placebo (all p<0·0001 compared with placebo). All prespecified weight and cardiometabolic measures including HbA statistically significantly improved with orforglipron. Treatment discontinuations due to adverse events (mainly gastrointestinal-related) were higher for orforglipron (6·1-9·9%) versus placebo (4·1%). The most common adverse events with orforglipron were mild-to-moderate gastrointestinal events, predominantly occurring during dose escalation. Ten deaths were reported during the study: six with orforglipron and four with placebo. Investigators deemed all deaths unrelated to the study treatment, except for one case in the placebo group and one case in the 12 mg orforglipron group. For the case in the orforglipron group, no treatment-related association was reported."
        },
        {
          "label": "INTERPRETATION",
          "text": "In adults with obesity or overweight and type 2 diabetes, statistically superior reduction in bodyweight compared with placebo was demonstrated by once-daily orforglipron as an adjunct to lifestyle modification, with a safety profile similar to other GLP-1 receptor agonists."
        },
        {
          "label": "FUNDING",
          "text": "Eli Lilly and Company."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41275875/",
      "pubDate": "2025 Nov 20",
      "doi": "10.1016/S0140-6736(25)02165-8",
      "dateReceived": "2025-12-01T23:26:47.003Z",
      "isNew": false,
      "summary": "Orforglipron, a GLP-1 receptor agonist, demonstrated statistically significant weight loss in adults with type 2 diabetes over 72 weeks, with higher doses leading to greater weight reduction."
    },
    {
      "id": "765f9b1081f8",
      "title": "Electronic cigarettes for smoking cessation.",
      "journal": "Cochrane Database Syst Rev",
      "score": "6/7",
      "tags": [
        "Family Medicine (FM)/General Practice (GP)"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49038460/118195",
      "abstract": "There is limited guidance on how to stop using nicotine-containing vapes (otherwise known as e-cigarettes) and ensure long-term abstinence, whilst minimising the risk of tobacco smoking and other unintended consequences. Treatments could include pharmacological interventions, behavioural interventions, or both. To conduct a living systematic review assessing the benefits and harms of interventions to help people stop vaping compared to each other, placebo or no intervention. To assess how these interventions affect the use of combustible tobacco, and whether effects vary based on participant characteristics. We searched CENTRAL, MEDLINE, Embase, PsycINFO, ClinicalTrials.gov and WHO International Clinical Trials Registry Platform from 1 January 2004 to 1 July 2025. We also searched the references of eligible studies and abstracts from the Society for Research on Nicotine and Tobacco conferences, and contacted study authors. We included randomised controlled trials (RCTs) recruiting people of any age using nicotine-containing vapes, regardless of tobacco smoking status. Studies had to test an intervention designed to support people to quit vaping, and plan to measure at least one of our outcomes. Critical outcomes: vaping cessation at six months or longer; change in combustible tobacco use at six months or longer; number of participants reporting serious adverse events (SAEs) at one week or longer. We used Cochrane's RoB 1 tool to assess risk of bias in the included studies. We followed standard Cochrane methods. We grouped studies by comparisons and outcomes, and calculated individual study and pooled effects, as appropriate. We used random-effects Mantel-Haenszel methods to calculate risk ratios (RRs) with 95% confidence intervals (CIs) and random-effects inverse variance methods to calculate mean differences (MDs) and 95% CIs. We used GRADE to assess the certainty of evidence for our critical outcomes. Fifteen studies (six new to this updated version) involving 5800 participants are included. Fourteen studies included some participants who had previously smoked tobacco; in seven studies, participants were not smoking at baseline. Twelve studies only included participants aged 18 or older (five exclusively included people between 18 and 29); two included some participants under 18 years; and one included 13- to 17-year-olds only. Fourteen studies were conducted in the USA and one in Italy. We judged five studies at low, six at high, and four at unclear risk of bias. Pharmacological interventions Studies assessed our critical outcomes in relation to combination nicotine replacement therapy (NRT), cytisine, and varenicline compared to placebo or no/minimal support. For combination NRT versus no/minimal support, there was no clear evidence of benefit for vaping cessation rates at six months or longer, with the CI incorporating the possibility of reduced and increased cessation rates (very low-certainty evidence due to imprecision and risk of bias; RR 0.96, 95% CI 0.73 to 1.25; I² = 0%; 2 studies, 214 participants). One study investigating cytisine versus placebo did not report vaping cessation at six months or longer. When compared to placebo, varenicline increased vaping cessation rates at six months, but evidence was of low certainty due to imprecision (RR 2.71, 95% CI 1.33 to 5.49; I = 48%; 2 studies, 315 participants). One study comparing combination NRT versus no/minimal support reported combustible tobacco cessation. There was no clear evidence of higher tobacco cessation in either arm, and CIs were imprecise. The evidence was of very low certainty due to imprecision and risk of bias (RR 0.99, 95% CI 0.71 to 1.37; 198 participants). Zero participants reported SAEs in the two studies investigating combination NRT versus no/minimal support (706 participants; very low-certainty evidence due to risk of bias and imprecision) and in the one study investigating cytisine versus placebo (159 participants; low-certainty evidence due to imprecision). Four studies evaluating varenicline versus placebo measured SAEs, with zero events reported in two studies. Thus, our effect estimate was based on two studies (RR 2.82, 95% CI 0.45 to 17.59; 304 participants; low-certainty evidence due to imprecision). Behavioural interventions Studies assessed our critical outcomes in relation to reducing nicotine/vaping behaviour and text message-based interventions compared to no/minimal support. There was no clear evidence that nicotine/vaping reduction increased vaping cessation at six months compared to minimal support (RR 3.38, 95% CI 0.43 to 26.30; 1 study, 17 participants; very low-certainty evidence due to imprecision and risk of bias). There was low-certainty evidence (due to indirectness) that text message-based interventions may increase vaping cessation rates compared to no/minimal support in 13- to 24-year-olds specifically (RR 1.32, 95% CI 1.19 to 1.47; I = 0%; 2 studies, 4091 participants). There was very low-certainty evidence (due to indirectness and imprecision) that text message-based interventions for vaping cessation may result in little to no difference in smoking uptake (RR 1.04, 95% CI 0.81 to 1.33; 1 study, 1036 participants) or cessation (RR 1.03, 95% CI 0.90 to 1.19; 1 study, 793 participants) compared to no/minimal support. The one study investigating nicotine/vaping behaviour reduction versus minimal support did not report SAEs. Three studies investigating text message-based interventions reported SAEs; however, zero events were reported (2082 participants; low-certainty evidence due to imprecision). Low-certainty evidence suggests that text message-based interventions to help people stop nicotine vaping may help more youths and young adults to successfully stop compared to no/minimal support, with very uncertain evidence regarding their effect on smoking behaviours. Low-certainty evidence suggests that varenicline may help people quit vaping. Data exploring the effectiveness of combination NRT, cytisine, and nicotine/vaping behaviour reduction are inconclusive due to risk of bias and imprecision. Most studies that measured SAEs reported that none had occurred; however, more data are needed to draw clear conclusions. Studies that have investigated these interventions for quitting smoking have not demonstrated serious concerns about SAEs. It is important that future studies measure combustible tobacco outcomes so the complete risk profile of relevant interventions can be considered. Further RCTs are underway. To ensure this review continues to provide up-to-date information to decision-makers, we will maintain it as a living systematic review by running searches monthly and updating the review when relevant new evidence that will strengthen or change our conclusions emerges. Cancer Research UK (PICCTR-2024/100012); National Institute for Health and Care Research (NIHR206123). Protocol (2024) DOI: 10.1002/14651858.CD016058 Original review (2025) DOI: 10.1002/14651858.CD016058.pub2.",
      "structuredAbstract": [
        {
          "label": "RATIONALE",
          "text": "There is limited guidance on how to stop using nicotine-containing vapes (otherwise known as e-cigarettes) and ensure long-term abstinence, whilst minimising the risk of tobacco smoking and other unintended consequences. Treatments could include pharmacological interventions, behavioural interventions, or both."
        },
        {
          "label": "OBJECTIVES",
          "text": "To conduct a living systematic review assessing the benefits and harms of interventions to help people stop vaping compared to each other, placebo or no intervention. To assess how these interventions affect the use of combustible tobacco, and whether effects vary based on participant characteristics."
        },
        {
          "label": "SEARCH METHODS",
          "text": "We searched CENTRAL, MEDLINE, Embase, PsycINFO, ClinicalTrials.gov and WHO International Clinical Trials Registry Platform from 1 January 2004 to 1 July 2025. We also searched the references of eligible studies and abstracts from the Society for Research on Nicotine and Tobacco conferences, and contacted study authors."
        },
        {
          "label": "ELIGIBILITY CRITERIA",
          "text": "We included randomised controlled trials (RCTs) recruiting people of any age using nicotine-containing vapes, regardless of tobacco smoking status. Studies had to test an intervention designed to support people to quit vaping, and plan to measure at least one of our outcomes."
        },
        {
          "label": "OUTCOMES",
          "text": "Critical outcomes: vaping cessation at six months or longer; change in combustible tobacco use at six months or longer; number of participants reporting serious adverse events (SAEs) at one week or longer."
        },
        {
          "label": "RISK OF BIAS",
          "text": "We used Cochrane's RoB 1 tool to assess risk of bias in the included studies."
        },
        {
          "label": "SYNTHESIS METHODS",
          "text": "We followed standard Cochrane methods. We grouped studies by comparisons and outcomes, and calculated individual study and pooled effects, as appropriate. We used random-effects Mantel-Haenszel methods to calculate risk ratios (RRs) with 95% confidence intervals (CIs) and random-effects inverse variance methods to calculate mean differences (MDs) and 95% CIs. We used GRADE to assess the certainty of evidence for our critical outcomes."
        },
        {
          "label": "INCLUDED STUDIES",
          "text": "Fifteen studies (six new to this updated version) involving 5800 participants are included. Fourteen studies included some participants who had previously smoked tobacco; in seven studies, participants were not smoking at baseline. Twelve studies only included participants aged 18 or older (five exclusively included people between 18 and 29); two included some participants under 18 years; and one included 13- to 17-year-olds only. Fourteen studies were conducted in the USA and one in Italy. We judged five studies at low, six at high, and four at unclear risk of bias."
        },
        {
          "label": "SYNTHESIS OF RESULTS",
          "text": "Pharmacological interventions Studies assessed our critical outcomes in relation to combination nicotine replacement therapy (NRT), cytisine, and varenicline compared to placebo or no/minimal support. For combination NRT versus no/minimal support, there was no clear evidence of benefit for vaping cessation rates at six months or longer, with the CI incorporating the possibility of reduced and increased cessation rates (very low-certainty evidence due to imprecision and risk of bias; RR 0.96, 95% CI 0.73 to 1.25; I² = 0%; 2 studies, 214 participants). One study investigating cytisine versus placebo did not report vaping cessation at six months or longer. When compared to placebo, varenicline increased vaping cessation rates at six months, but evidence was of low certainty due to imprecision (RR 2.71, 95% CI 1.33 to 5.49; I = 48%; 2 studies, 315 participants). One study comparing combination NRT versus no/minimal support reported combustible tobacco cessation. There was no clear evidence of higher tobacco cessation in either arm, and CIs were imprecise. The evidence was of very low certainty due to imprecision and risk of bias (RR 0.99, 95% CI 0.71 to 1.37; 198 participants). Zero participants reported SAEs in the two studies investigating combination NRT versus no/minimal support (706 participants; very low-certainty evidence due to risk of bias and imprecision) and in the one study investigating cytisine versus placebo (159 participants; low-certainty evidence due to imprecision). Four studies evaluating varenicline versus placebo measured SAEs, with zero events reported in two studies. Thus, our effect estimate was based on two studies (RR 2.82, 95% CI 0.45 to 17.59; 304 participants; low-certainty evidence due to imprecision). Behavioural interventions Studies assessed our critical outcomes in relation to reducing nicotine/vaping behaviour and text message-based interventions compared to no/minimal support. There was no clear evidence that nicotine/vaping reduction increased vaping cessation at six months compared to minimal support (RR 3.38, 95% CI 0.43 to 26.30; 1 study, 17 participants; very low-certainty evidence due to imprecision and risk of bias). There was low-certainty evidence (due to indirectness) that text message-based interventions may increase vaping cessation rates compared to no/minimal support in 13- to 24-year-olds specifically (RR 1.32, 95% CI 1.19 to 1.47; I = 0%; 2 studies, 4091 participants). There was very low-certainty evidence (due to indirectness and imprecision) that text message-based interventions for vaping cessation may result in little to no difference in smoking uptake (RR 1.04, 95% CI 0.81 to 1.33; 1 study, 1036 participants) or cessation (RR 1.03, 95% CI 0.90 to 1.19; 1 study, 793 participants) compared to no/minimal support. The one study investigating nicotine/vaping behaviour reduction versus minimal support did not report SAEs. Three studies investigating text message-based interventions reported SAEs; however, zero events were reported (2082 participants; low-certainty evidence due to imprecision)."
        },
        {
          "label": "AUTHORS' CONCLUSIONS",
          "text": "Low-certainty evidence suggests that text message-based interventions to help people stop nicotine vaping may help more youths and young adults to successfully stop compared to no/minimal support, with very uncertain evidence regarding their effect on smoking behaviours. Low-certainty evidence suggests that varenicline may help people quit vaping. Data exploring the effectiveness of combination NRT, cytisine, and nicotine/vaping behaviour reduction are inconclusive due to risk of bias and imprecision. Most studies that measured SAEs reported that none had occurred; however, more data are needed to draw clear conclusions. Studies that have investigated these interventions for quitting smoking have not demonstrated serious concerns about SAEs. It is important that future studies measure combustible tobacco outcomes so the complete risk profile of relevant interventions can be considered. Further RCTs are underway. To ensure this review continues to provide up-to-date information to decision-makers, we will maintain it as a living systematic review by running searches monthly and updating the review when relevant new evidence that will strengthen or change our conclusions emerges."
        },
        {
          "label": "FUNDING",
          "text": "Cancer Research UK (PICCTR-2024/100012); National Institute for Health and Care Research (NIHR206123)."
        },
        {
          "label": "REGISTRATION",
          "text": "Protocol (2024) DOI: 10.1002/14651858.CD016058 Original review (2025) DOI: 10.1002/14651858.CD016058.pub2."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41288132/",
      "pubDate": "2025 Nov 25",
      "doi": "10.1002/14651858.CD016058.pub3",
      "dateReceived": "2025-11-30T23:24:52.415Z",
      "isNew": false,
      "summary": "Text message interventions and varenicline may help young people quit vaping, but more research is needed on other interventions and serious adverse events."
    },
    {
      "id": "d7b1ec7e3125",
      "title": "Complete versus culprit lesion-only revascularisation for acute myocardial infarction (Complete Revascularisation Trialists` Collaboration): an individual patient data meta-analysis of randomised trials.",
      "journal": "Lancet",
      "score": "7/7",
      "tags": [
        "Cardiology"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49038460/118157",
      "abstract": "In patients presenting with acute coronary syndromes and multivessel coronary artery disease, the question of whether to undertake a strategy of complete revascularisation in cases in which percutaneous coronary intervention (PCI) is performed routinely on non-culprit lesions (in addition to the culprit lesion) or whether to restrict PCI only to the culprit lesion is a common dilemma. The Complete Revascularisation Trialists' Collaboration aimed to determine, based on the totality of data from randomised trials, the effect of a complete revascularisation strategy on major cardiovascular events and whether it reduces cardiovascular death. In this individual patient data meta-analysis, trials were included if they enrolled at least 250 patients, compared a complete revascularisation strategy (with PCI) to a culprit lesion-only PCI strategy, and enrolled patients presenting with acute ST-segment elevation myocardial infarction or non-ST-segment elevation myocardial infarction. To ensure that no trials were overlooked, we searched Ovid MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) for randomised controlled trials published between 1996 and Sept 15, 2025. The primary outcomes were the composite of cardiovascular death or new myocardial infarction and cardiovascular death alone. Hierarchical testing of cardiovascular death alone was planned contingent on reduction in cardiovascular death or new myocardial infarction based on the prespecified alpha level of 0·04. A one-stage individual patient data meta-analysis was performed using a Cox frailty model. All-cause death was the secondary outcome; non-cardiovascular death and new myocardial infarction were additional outcomes. All analyses included all randomly assigned patients. The meta-analysis was registered in PROSPERO, CRD420251124098. Six randomised controlled trials involving 8836 individuals were included. The median age was 65·8 years (IQR 57·0-76·0), and 2088 (23·6%) patients were female and 6748 (76·4%) were male. Overall, 7768 (87·9%) patients presented with ST-segment elevation myocardial infarction and 1068 (12·1%) with non-ST-segment elevation myocardial infarction. At a median follow-up of 36·0 months (IQR 30·6-48·0), cardiovascular death or new myocardial infarction occurred in 382 (9·0%) of 4259 patients in the complete revascularisation group compared with 528 (11·5%) of 4577 patients in the culprit lesion-only group (hazard ratio [HR] 0·76 [95% CI 0·67-0·87], p<0·0001). There were 155 (3·6%) cardiovascular deaths in the complete revascularisation group compared with 209 (4·6%) in the culprit lesion-only group (HR 0·76 [95% CI 0·62-0·93], p=0·0091). All-cause death occurred in 308 (7·2%) patients in the complete revascularisation group compared with 370 (8·1%) patients in the culprit lesion-only group (HR 0·85 [95% CI 0·73-0·99], p=0·039). Non-cardiovascular death was similar between the groups (153 [3·6%] in the complete revascularisation group vs 161 [3·5%] in the culprit lesion-only group; HR 0·98 [95% CI 0·78-1·22], p=0·85). Complete revascularisation reduced new myocardial infarctions compared with culprit lesion-only PCI (255 [6·0%] vs 357 [7·8%]; HR 0·76 [95% CI 0·65-0·90], p=0·0011). In patients presenting with acute myocardial infarction and multivessel disease, complete revascularisation reduced the composite of cardiovascular death or new myocardial infarction as well as cardiovascular death alone compared with a culprit lesion-only PCI strategy. In addition, all-cause death was lower with complete revascularisation. These data provide the strongest and most robust evidence to date that complete revascularisation improves important cardiovascular clinical outcomes. None.",
      "structuredAbstract": [
        {
          "label": "BACKGROUND",
          "text": "In patients presenting with acute coronary syndromes and multivessel coronary artery disease, the question of whether to undertake a strategy of complete revascularisation in cases in which percutaneous coronary intervention (PCI) is performed routinely on non-culprit lesions (in addition to the culprit lesion) or whether to restrict PCI only to the culprit lesion is a common dilemma. The Complete Revascularisation Trialists' Collaboration aimed to determine, based on the totality of data from randomised trials, the effect of a complete revascularisation strategy on major cardiovascular events and whether it reduces cardiovascular death."
        },
        {
          "label": "METHODS",
          "text": "In this individual patient data meta-analysis, trials were included if they enrolled at least 250 patients, compared a complete revascularisation strategy (with PCI) to a culprit lesion-only PCI strategy, and enrolled patients presenting with acute ST-segment elevation myocardial infarction or non-ST-segment elevation myocardial infarction. To ensure that no trials were overlooked, we searched Ovid MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) for randomised controlled trials published between 1996 and Sept 15, 2025. The primary outcomes were the composite of cardiovascular death or new myocardial infarction and cardiovascular death alone. Hierarchical testing of cardiovascular death alone was planned contingent on reduction in cardiovascular death or new myocardial infarction based on the prespecified alpha level of 0·04. A one-stage individual patient data meta-analysis was performed using a Cox frailty model. All-cause death was the secondary outcome; non-cardiovascular death and new myocardial infarction were additional outcomes. All analyses included all randomly assigned patients. The meta-analysis was registered in PROSPERO, CRD420251124098."
        },
        {
          "label": "FINDINGS",
          "text": "Six randomised controlled trials involving 8836 individuals were included. The median age was 65·8 years (IQR 57·0-76·0), and 2088 (23·6%) patients were female and 6748 (76·4%) were male. Overall, 7768 (87·9%) patients presented with ST-segment elevation myocardial infarction and 1068 (12·1%) with non-ST-segment elevation myocardial infarction. At a median follow-up of 36·0 months (IQR 30·6-48·0), cardiovascular death or new myocardial infarction occurred in 382 (9·0%) of 4259 patients in the complete revascularisation group compared with 528 (11·5%) of 4577 patients in the culprit lesion-only group (hazard ratio [HR] 0·76 [95% CI 0·67-0·87], p<0·0001). There were 155 (3·6%) cardiovascular deaths in the complete revascularisation group compared with 209 (4·6%) in the culprit lesion-only group (HR 0·76 [95% CI 0·62-0·93], p=0·0091). All-cause death occurred in 308 (7·2%) patients in the complete revascularisation group compared with 370 (8·1%) patients in the culprit lesion-only group (HR 0·85 [95% CI 0·73-0·99], p=0·039). Non-cardiovascular death was similar between the groups (153 [3·6%] in the complete revascularisation group vs 161 [3·5%] in the culprit lesion-only group; HR 0·98 [95% CI 0·78-1·22], p=0·85). Complete revascularisation reduced new myocardial infarctions compared with culprit lesion-only PCI (255 [6·0%] vs 357 [7·8%]; HR 0·76 [95% CI 0·65-0·90], p=0·0011)."
        },
        {
          "label": "INTERPRETATION",
          "text": "In patients presenting with acute myocardial infarction and multivessel disease, complete revascularisation reduced the composite of cardiovascular death or new myocardial infarction as well as cardiovascular death alone compared with a culprit lesion-only PCI strategy. In addition, all-cause death was lower with complete revascularisation. These data provide the strongest and most robust evidence to date that complete revascularisation improves important cardiovascular clinical outcomes."
        },
        {
          "label": "FUNDING",
          "text": "None."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41223860/",
      "pubDate": "2025 Nov 09",
      "doi": "10.1016/S0140-6736(25)02170-1",
      "dateReceived": "2025-11-30T23:24:52.415Z",
      "isNew": false,
      "summary": "Complete revascularization with PCI in patients with acute coronary syndromes and multivessel disease significantly reduced the composite of cardiovascular death or new myocardial infarction."
    },
    {
      "id": "9a98d8207e12",
      "title": "Early subcutaneous basal insulin with intravenous insulin infusion for diabetic ketoacidosis management: A systematic review and meta-analysis of randomised controlled trials.",
      "journal": "Diabetes Obes Metab",
      "score": "6/7",
      "tags": [
        "Emergency Medicine",
        "Endocrine",
        "Pediatric Emergency Medicine"
      ],
      "evidenceAlertsUrl": "https://plus.mcmaster.ca/EvidenceAlerts/LFE/Article/ce4e8711-d28c-49a6-8652-021a3edd4e7e/49138101/118215",
      "abstract": "To evaluate the effectiveness and safety of early initiation of subcutaneous (SC) basal insulin in combination with intravenous insulin infusion (IVII), compared with IVII alone, for the management of diabetic ketoacidosis (DKA). A systematic search of PubMed, Embase, Scopus, and the Cochrane Library was conducted to identify randomised controlled trials (RCTs) comparing early initiation of long- or ultra-long-acting basal insulin plus IVII versus IVII alone in DKA management. Studies published up to 6 September 2025, were included. Meta-analysis was performed using mean difference (MD) for continuous outcomes and risk ratio for dichotomous outcomes, both with a 95% confidence interval (CI). The primary outcome was time to DKA resolution. Secondary outcomes included total intravenous insulin use, rebound hyperglycemia, hypoglycemia, hypokalemia, length of hospital stay (LOS), and mortality. A one-stage individual participant data meta-analysis was also conducted when individual-level data were available. Eight RCTs including 468 participants (256 receiving early SC basal insulin plus IVII; 212 receiving IVII alone) were included. Baseline characteristics were comparable across studies. Early SC basal insulin significantly reduced time to DKA resolution (MD -4.02 h, 95%CI -5.52 to -2.52, p <0.001) and total intravenous insulin dose until DKA resolution (MD -19.2 units, 95%CI -28.99 to -9.26, p <0.001). No significant differences were observed between groups for rebound hyperglycemia, safety outcomes, LOS, or in-hospital mortality. Early SC basal insulin in combination with IVII significantly accelerates DKA resolution and reduces total IVII requirements, without increasing the risk of adverse events, including hypoglycemia or hypokalemia.",
      "structuredAbstract": [
        {
          "label": "AIMS",
          "text": "To evaluate the effectiveness and safety of early initiation of subcutaneous (SC) basal insulin in combination with intravenous insulin infusion (IVII), compared with IVII alone, for the management of diabetic ketoacidosis (DKA)."
        },
        {
          "label": "MATERIALS AND METHODS",
          "text": "A systematic search of PubMed, Embase, Scopus, and the Cochrane Library was conducted to identify randomised controlled trials (RCTs) comparing early initiation of long- or ultra-long-acting basal insulin plus IVII versus IVII alone in DKA management. Studies published up to 6 September 2025, were included. Meta-analysis was performed using mean difference (MD) for continuous outcomes and risk ratio for dichotomous outcomes, both with a 95% confidence interval (CI). The primary outcome was time to DKA resolution. Secondary outcomes included total intravenous insulin use, rebound hyperglycemia, hypoglycemia, hypokalemia, length of hospital stay (LOS), and mortality. A one-stage individual participant data meta-analysis was also conducted when individual-level data were available."
        },
        {
          "label": "RESULTS",
          "text": "Eight RCTs including 468 participants (256 receiving early SC basal insulin plus IVII; 212 receiving IVII alone) were included. Baseline characteristics were comparable across studies. Early SC basal insulin significantly reduced time to DKA resolution (MD -4.02 h, 95%CI -5.52 to -2.52, p <0.001) and total intravenous insulin dose until DKA resolution (MD -19.2 units, 95%CI -28.99 to -9.26, p <0.001). No significant differences were observed between groups for rebound hyperglycemia, safety outcomes, LOS, or in-hospital mortality."
        },
        {
          "label": "CONCLUSIONS",
          "text": "Early SC basal insulin in combination with IVII significantly accelerates DKA resolution and reduces total IVII requirements, without increasing the risk of adverse events, including hypoglycemia or hypokalemia."
        }
      ],
      "pubmedUrl": "https://pubmed.ncbi.nlm.nih.gov/41208563/",
      "pubDate": "2025 Nov 10",
      "doi": "10.1111/dom.70276",
      "dateReceived": "2025-11-30T23:24:52.414Z",
      "isNew": false,
      "summary": "Early subcutaneous basal insulin combined with intravenous insulin infusion effectively resolves diabetic ketoacidosis faster and lowers total insulin needs, without increasing the risk of complications."
    }
  ]
}