{
  "updated_at": "2025-08-15T09:41:18.164Z",
  "clusters": [
    {
      "id": "cluster_84",
      "coverage": 3,
      "updated_at": "Thu, 14 Aug 2025 15:49:57 +0000",
      "title": "The Apple Watch Is Finally Getting Blood Oxygen Sensing Back",
      "neutral_headline": "The Apple Watch Is Finally Getting Blood Oxygen Sensing Back",
      "bullet_summary": [
        "Reported by Wired Tech, Ars Technica, TechCrunch"
      ],
      "items": [
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/apple-watch-blood-oxygen-sensing-is-back/",
          "published_at": "Thu, 14 Aug 2025 15:49:57 +0000",
          "title": "The Apple Watch Is Finally Getting Blood Oxygen Sensing Back",
          "standfirst": "The feature was removed on select smartwatches due to a patent-infringement lawsuit, but Apple has “redesigned” it.",
          "content": "The feature was removed on select smartwatches due to a patent-infringement lawsuit, but Apple has “redesigned” it.",
          "feed_position": 9
        },
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/08/redesigned-blood-oxygen-monitoring-returns-to-apple-watch-following-patent-dispute/",
          "published_at": "Thu, 14 Aug 2025 14:44:25 +0000",
          "title": "Apple Watch gets reformulated, non-patent-infringing blood oxygen monitoring",
          "standfirst": "Feature had been removed from US Apple Watches after Apple lost a patent fight.",
          "content": "In early 2024, Apple removed a blood oxygen monitoring feature from its then-current Apple Watch Series 9 and Ultra 2 watches, following a ruling that the feature violated light-based pulse oximetry patents from a California-based company called Masimo. Removing the feature allowed Apple to circumvent an import ban and continue selling the Series 9 and Ultra 2 (and, later, the Series 10) in the US. Today, Apple announced that it's restoring a version of the blood oxygen monitoring feature to affected Series 9, Series 10, and Ultra 2 watches. Apple says these updates were \"enabled by a recent U.S. Customs ruling.\" The feature has been redesigned, presumably to get around the Masimo patents that prompted the import ban in the first place. Apple says that sensor data from your watch will be sent to your iPhone for processing, and you can find the data in the Respiratory section of the Health app on your phone. The old version of the feature allowed results to be viewed directly on the Apple Watch, as shown in Apple's documentation.Read full article Comments",
          "feed_position": 8
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/08/14/apples-blood-oxygen-monitoring-returns-to-its-latest-apple-watches/",
          "published_at": "Thu, 14 Aug 2025 13:51:23 +0000",
          "title": "Apple&#8217;s blood oxygen monitoring returns to its latest Apple Watches",
          "standfirst": "The change doesn’t affect previously sold models with the original version of the feature or units bought outside the U.S.",
          "content": "The change doesn’t affect previously sold models with the original version of the feature or units bought outside the U.S.",
          "feed_position": 17
        }
      ],
      "popularity_score": 3002.144121111111
    },
    {
      "id": "cluster_56",
      "coverage": 2,
      "updated_at": "Thu, 14 Aug 2025 14:35:01 -0400",
      "title": "Sources: xAI was part of a US government AI initiative alongside OpenAI, Anthropic, and Google, but was removed after Grok posted antisemitic content in July (Wired)",
      "neutral_headline": "XAI Was About to Land a Major Government Contract. Then Grok Praised Hitler",
      "bullet_summary": [
        "Reported by TechMeme, Wired Tech"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/250814/p32#a250814p32",
          "published_at": "Thu, 14 Aug 2025 14:35:01 -0400",
          "title": "Sources: xAI was part of a US government AI initiative alongside OpenAI, Anthropic, and Google, but was removed after Grok posted antisemitic content in July (Wired)",
          "standfirst": "Wired: Sources: xAI was part of a US government AI initiative alongside OpenAI, Anthropic, and Google, but was removed after Grok posted antisemitic content in July &mdash; Internal emails obtained by WIRED show a hasty process to onboard OpenAI, Anthropic, and other AI providers to the federal government. xAI &hellip;",
          "content": "Wired: Sources: xAI was part of a US government AI initiative alongside OpenAI, Anthropic, and Google, but was removed after Grok posted antisemitic content in July &mdash; Internal emails obtained by WIRED show a hasty process to onboard OpenAI, Anthropic, and other AI providers to the federal government. xAI &hellip;",
          "feed_position": 13
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/xai-grok-government-contract-hitler/",
          "published_at": "Thu, 14 Aug 2025 17:34:53 +0000",
          "title": "xAI Was About to Land a Major Government Contract. Then Grok Praised Hitler",
          "standfirst": "Internal emails obtained by WIRED show a hasty process to onboard OpenAI, Anthropic, and other AI providers to the federal government. xAI was on the list—until MechaHilter happened.",
          "content": "Internal emails obtained by WIRED show a hasty process to onboard OpenAI, Anthropic, and other AI providers to the federal government. xAI was on the list—until MechaHilter happened.",
          "feed_position": 8
        }
      ],
      "popularity_score": 2004.8952322222221
    },
    {
      "id": "cluster_57",
      "coverage": 2,
      "updated_at": "2025-08-14T14:33:14-04:00",
      "title": "Airbnb now lets you ‘pay later’ on vacation rentals",
      "neutral_headline": "Airbnb now lets you ‘pay later’ on vacation rentals",
      "bullet_summary": [
        "Reported by The Verge, TechCrunch"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/759637/airbnb-reserve-now-pay-later-stays",
          "published_at": "2025-08-14T14:33:14-04:00",
          "title": "Airbnb now lets you ‘pay later’ on vacation rentals",
          "standfirst": "Airbnb has introduced a new “reserve now, pay later” option that lets users in the US book a reservation without paying right away. Instead, users can put off their payment to a later date before check-in. Airbnb says it will require payment before the end of a stay’s free cancellation period, ensuring “hosts have time [&#8230;]",
          "content": "Airbnb has introduced a new “reserve now, pay later” option that lets users in the US book a reservation without paying right away. Instead, users can put off their payment to a later date before check-in. Airbnb says it will require payment before the end of a stay’s free cancellation period, ensuring “hosts have time to secure another booking even if a guest cancels.” The option is only available for stays in the US with a moderate or flexible cancellation policy. Airbnb also notes that it will still charge upfront for travel insurance, climate contribution, or other optional add-ons. While Airbnb already offers a “pay part now, pay later” option, which allows users to pay part of their bill at checkout and the rest before check-in, this new method means users don’t have to make a payment at the time of booking at all. Airbnb offers payments with the buy now pay later service, Klarna, as well.",
          "feed_position": 5
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/08/14/airbnb-will-allow-us-users-to-book-stays-without-paying-up-front/",
          "published_at": "Thu, 14 Aug 2025 13:00:00 +0000",
          "title": "Airbnb will allow US users to book stays without paying up front",
          "standfirst": "Airbnb has launched a new feature called \"Reserve Now, Pay Later\" that lets users in the U.S. reserve a property without paying up front, potentially allowing people to cancel their bookings with less hassle if their plans change.",
          "content": "Airbnb has launched a new feature called \"Reserve Now, Pay Later\" that lets users in the U.S. reserve a property without paying up front, potentially allowing people to cancel their bookings with less hassle if their plans change.",
          "feed_position": 18
        }
      ],
      "popularity_score": 2004.86551
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 22:18:06 +0000",
      "title": "Dedicated volunteer exposes “single largest self-promotion operation in Wikipedia’s history”",
      "neutral_headline": "Dedicated volunteer exposes “single largest self-promotion operation...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/08/why-was-the-most-translated-wikipedia-article-in-the-world-about-a-lover-of-aryan-culture/",
          "published_at": "Thu, 14 Aug 2025 22:18:06 +0000",
          "title": "Dedicated volunteer exposes “single largest self-promotion operation in Wikipedia’s history”",
          "standfirst": "Ten years of work to boost one man's reputation.",
          "content": "Quick—what are the top entries in the category \"Wikipedia articles written in the greatest number of languages\"? The answer is countries. Turkey tops the list with Wikipedia entries in 332 different languages, while the US is second with 327 and Japan is third with 324. Other common words make their appearance as one looks down the list. \"Dog\" (275 languages) tops \"cat\" (273). Jesus (274) beats \"Adolf Hitler\" (242). And all of them beat \"sex\" (122), which is also bested by \"fever,\" \"Chiang Kai-Shek,\" and the number \"13.\"Read full article Comments",
          "feed_position": 0
        }
      ],
      "popularity_score": 341.61328777777777
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 20:04:22 +0000",
      "title": "Google releases pint-size Gemma open AI model",
      "neutral_headline": "Google releases pint-size Gemma open AI model",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/08/google-releases-pint-size-gemma-open-ai-model/",
          "published_at": "Thu, 14 Aug 2025 20:04:22 +0000",
          "title": "Google releases pint-size Gemma open AI model",
          "standfirst": "The new Gemma model is a fraction of the size of most new models.",
          "content": "Big tech has spent the last few years creating ever-larger AI models, leveraging rack after rack of expensive GPUs to provide generative AI as a cloud service. But tiny AI matters, too. Google has announced a tiny version of its Gemma open model designed to run on local devices. Google says the new Gemma 3 270M can be tuned in a snap and maintains robust performance despite its small footprint. Google released its first Gemma 3 open models earlier this year, featuring between 1 billion and 27 billion parameters. In generative AI, the parameters are the learned variables that control how the model processes inputs to estimate output tokens. Generally, the more parameters in a model, the better it performs. With just 270 million parameters, the new Gemma 3 can run on devices like smartphones or even entirely inside a web browser. Running an AI model locally has numerous benefits, including enhanced privacy and lower latency. Gemma 3 270M was designed with these kinds of use cases in mind. In testing with a Pixel 9 Pro, the new Gemma was able to run 25 conversations on the Tensor G4 chip and use just 0.75 percent of the device's battery. That makes it by far the most efficient Gemma model.Read full article Comments",
          "feed_position": 3
        }
      ],
      "popularity_score": 333.3843988888889
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 21:11:06 +0000",
      "title": "US government agency drops Grok after MechaHitler backlash, report says",
      "neutral_headline": "US government agency drops Grok after MechaHitler backlash, report says",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/08/us-government-agency-drops-grok-after-mechahitler-backlash-report-says/",
          "published_at": "Thu, 14 Aug 2025 21:11:06 +0000",
          "title": "US government agency drops Grok after MechaHitler backlash, report says",
          "standfirst": "It appears Grok’s antisemitic rants stopped it from becoming feds’ go-to chatbot.",
          "content": "xAI apparently lost a government contract after a tweak to Grok's prompting triggered an antisemitic meltdown where the chatbot praised Hitler and declared itself MechaHitler last month. Despite the scandal, xAI announced that its products would soon be available for federal workers to purchase through the General Services Administration. At the time, xAI claimed this was an \"important milestone\" for its government business. But Wired reviewed emails and spoke to government insiders, which revealed that GSA leaders abruptly decided to drop xAI's Grok from their contract offering. That decision to pull the plug came after leadership allegedly rushed staff to make Grok available as soon as possible following a persuasive sales meeting with xAI in June.Read full article Comments",
          "feed_position": 1
        }
      ],
      "popularity_score": 330.4966211111111
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 20:32:02 +0000",
      "title": "Starlink tries to block Virginia’s plan to bring fiber Internet to residents",
      "neutral_headline": "Starlink tries to block Virginia’s plan to bring fiber Internet to residents",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/08/starlink-tries-to-block-virginias-plan-to-bring-fiber-internet-to-residents/",
          "published_at": "Thu, 14 Aug 2025 20:32:02 +0000",
          "title": "Starlink tries to block Virginia’s plan to bring fiber Internet to residents",
          "standfirst": "SpaceX wants more money, asks Trump admin to reject state's broadband grant plan.",
          "content": "Starlink operator SpaceX is fighting Virginia's plan to deploy fiber Internet service to residents, claiming that federal grant money should be given to Starlink instead. SpaceX is already in line to win over $3 million in grant money in the state but is seeking $60 million. Starlink is poised to benefit from the Trump administration rewriting rules for the $42 billion Broadband Equity, Access, and Deployment (BEAD) grant program. While the Biden administration decided that states should prioritize fiber in order to build more future-proof networks, the Trump administration ordered states to revise their plans with a \"tech-neutral approach\" and lower the average cost of serving each location. With the Trump administration backing its attempt to obtain more federal funding for Starlink, SpaceX is likely to object to state plans that still include significant fiber builds. That's what happened yesterday when SpaceX filed comments on Virginia's final proposal, which will be reviewed by the National Telecommunications and Information Administration (NTIA).Read full article Comments",
          "feed_position": 2
        }
      ],
      "popularity_score": 319.84551
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 16:31:01 +0000",
      "title": "Meta backtracks on rules letting chatbots be creepy to kids",
      "neutral_headline": "Meta backtracks on rules letting chatbots be creepy to kids",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/08/meta-backtracks-on-rules-letting-chatbots-be-creepy-to-kids/",
          "published_at": "Thu, 14 Aug 2025 16:31:01 +0000",
          "title": "Meta backtracks on rules letting chatbots be creepy to kids",
          "standfirst": "Meta drops AI rules letting chatbots generate innuendo and profess love to kids.",
          "content": "After what was arguably Meta's biggest purge of child predators from Facebook and Instagram earlier this summer, the company now faces backlash after its own chatbots appeared to be allowed to creep on kids. After reviewing an internal document that Meta verified as authentic, Reuters revealed that by design, Meta allowed its chatbots to engage kids in \"sensual\" chat. Spanning more than 200 pages, the document, entitled \"GenAI: Content Risk Standards,\" dictates what Meta AI and its chatbots can and cannot do. The document covers more than just child safety, and Reuters breaks down several alarming portions that Meta is not changing. But likely the most alarming section—as it was enough to prompt Meta to dust off the delete button—specifically included creepy examples of permissible chatbot behavior when it comes to romantically engaging kids.Read full article Comments",
          "feed_position": 4
        }
      ],
      "popularity_score": 295.82856555555554
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 16:10:09 +0000",
      "title": "Incan numerical recordkeeping system may have been widely used",
      "neutral_headline": "Incan numerical recordkeeping system may have been widely used",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/08/recent-study-shows-even-commoners-used-elaborate-inca-recordkeeping-knots/",
          "published_at": "Thu, 14 Aug 2025 16:10:09 +0000",
          "title": "Incan numerical recordkeeping system may have been widely used",
          "standfirst": "The Inca Empire hung by a thread—literally.",
          "content": "Inca bureaucrats recorded all the goings-on in their bustling empire using knotted cords called khipu, where the position and order of the knots represented numbers. They relied on the khipu system to track people, taxes, produce, livestock, and products like woven cloth and beer. Because khipu were so vital to the Inca government, and because the khipu itself is such a sophisticated way of recording numbers, colonial writers decided that these tools must be the exclusive knowledge of a very specialized, elite class of bureaucrats. But a recent study, analyzing hair from a khipu made around 1498 CE, suggests that even common folk had a good grasp of this intricate way of recording numbers. A lasting signature on a gorgeous piece of work University of St. Andrews archaeologist Sabine Hyland and her colleagues recently analyzed a stand of hair from a 500-year-old khipu—one they expected to be the handiwork of an especially high-ranking member of the Inca empire, based on how beautifully it was crafted.Read full article Comments",
          "feed_position": 5
        }
      ],
      "popularity_score": 285.4807877777778
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 15:44:44 +0000",
      "title": "Ice discs slingshot across a metal surface all on their own",
      "neutral_headline": "Ice discs slingshot across a metal surface all on their own",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/08/ice-discs-slingshot-across-a-metal-surface-all-on-their-own/",
          "published_at": "Thu, 14 Aug 2025 15:44:44 +0000",
          "title": "Ice discs slingshot across a metal surface all on their own",
          "standfirst": "VA Tech experiment was inspired by Death Valley's mysterious \"sailing stones\" at Racetrack Playa.",
          "content": "Scientists have figured out how to make frozen discs of ice self-propel across a patterned metal surface, according to a new paper published in the journal ACS Applied Materials and Interfaces. It's the latest breakthrough to come out of the Virginia Tech lab of mechanical engineer Jonathan Boreyko. A few years ago, Boreyko's lab experimentally demonstrated a three-phase Leidenfrost effect in water vapor, liquid water, and ice. The Leidenfrost effect is what happens when you dash a few drops of water onto a very hot, sizzling skillet. The drops levitate, sliding around the pan with wild abandon. If the surface is at least 400° Fahrenheit (well above the boiling point of water), cushions of water vapor, or steam, form underneath them, keeping them levitated. The effect also works with other liquids, including oils and alcohol, but the temperature at which it manifests will be different. Boreyko's lab discovered that this effect can also be achieved in ice simply by placing a thin, flat disc of ice on a heated aluminum surface. When the plate was heated above 150° C (302° F), the ice did not levitate on a vapor the way liquid water does. Instead, there was a significantly higher threshold of 550° Celsius (1,022° F) for levitation of the ice to occur. Unless that critical threshold is reached, the meltwater below the ice just keeps boiling in direct contact with the surface. Cross that critical point and you will get a three-phase Leidenfrost effect.Read full article Comments",
          "feed_position": 6
        }
      ],
      "popularity_score": 275.0571766666667
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 15:28:50 +0000",
      "title": "Misunderstood “photophoresis” effect could loft metal sheets to exosphere",
      "neutral_headline": "Misunderstood “photophoresis” effect could loft metal sheets to exosphere",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/08/misunderstood-photophoresis-effect-could-loft-metal-sheets-to-exosphere/",
          "published_at": "Thu, 14 Aug 2025 15:28:50 +0000",
          "title": "Misunderstood “photophoresis” effect could loft metal sheets to exosphere",
          "standfirst": "Photophoresis can generate a tiny bit of lift without any moving parts.",
          "content": "Most people would recognize the device in the image above, although they probably wouldn't know it by its formal name: the Crookes radiometer. As its name implies, placing the radiometer in light produces a measurable change: the blades start spinning. Unfortunately, many people misunderstand the physics of its operation (which we'll return to shortly). The actual forces that drive the blades to spin, called photophoresis, can act on a variety of structures as long as they're placed in a sufficiently low-density atmosphere. Now, a team of researchers has figured out that it may be possible to use the photophoretic effect to loft thin sheets of metal into the upper atmosphere of Earth and other planets. While their idea is to use it to send probes to the portion of the atmosphere that's too high for balloons and too low for satellites, they have tested some working prototypes a bit closer to the Earth's surface. Photophoresis It's quite common—and quite wrong—to see explanations of the Crookes radiometer that involve radiation pressure. Supposedly, the dark sides of the blades absorb more photons, each of which carries a tiny bit of momentum, giving the dark side of the blades a consistent push. The problem with this explanation is that photons are bouncing off the silvery side, which imparts even more momentum. If the device were spinning due to radiation pressure, it would be turning in the opposite direction than it actually does.Read full article Comments",
          "feed_position": 7
        }
      ],
      "popularity_score": 264.79217666666665
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 13:16:08 +0000",
      "title": "Upcoming DeepSeek AI model failed to train using Huawei’s chips",
      "neutral_headline": "Upcoming DeepSeek AI model failed to train using Huawei’s chips",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/08/deepseek-delays-next-ai-model-due-to-poor-performance-of-chinese-made-chips/",
          "published_at": "Thu, 14 Aug 2025 13:16:08 +0000",
          "title": "Upcoming DeepSeek AI model failed to train using Huawei’s chips",
          "standfirst": "Startup encountered persistent technical issues using Huawei Ascend chips.",
          "content": "Chinese artificial intelligence company DeepSeek delayed the release of its new model after failing to train it using Huawei’s chips, highlighting the limits of Beijing’s push to replace US technology. DeepSeek was encouraged by authorities to adopt Huawei’s Ascend processor rather than use Nvidia’s systems after releasing its R1 model in January, according to three people familiar with the matter. But the Chinese startup encountered persistent technical issues during its R2 training process using Ascend chips, prompting it to use Nvidia chips for training and Huawei’s for inference, said the people.Read full article Comments",
          "feed_position": 9
        }
      ],
      "popularity_score": 258
    },
    {
      "id": "cluster_124",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 20:28:20 +0000",
      "title": "Is AI really trying to escape human control and blackmail people?",
      "neutral_headline": "Is AI really trying to escape human control and blackmail people",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/08/is-ai-really-trying-to-escape-human-control-and-blackmail-people/",
          "published_at": "Wed, 13 Aug 2025 20:28:20 +0000",
          "title": "Is AI really trying to escape human control and blackmail people?",
          "standfirst": "Opinion: Theatrical testing scenarios explain why AI models produce alarming outputs—and why we fall for it.",
          "content": "In June, headlines read like science fiction: AI models \"blackmailing\" engineers and \"sabotaging\" shutdown commands. Simulations of these events did occur in highly contrived testing scenarios designed to elicit these responses—OpenAI's o3 model edited shutdown scripts to stay online, and Anthropic's Claude Opus 4 \"threatened\" to expose an engineer's affair. But the sensational framing obscures what's really happening: design flaws dressed up as intentional guile. And still, AI doesn't have to be \"evil\" to potentially do harmful things. These aren't signs of AI awakening or rebellion. They're symptoms of poorly understood systems and human engineering failures we'd recognize as premature deployment in any other context. Yet companies are racing to integrate these systems into critical applications. Consider a self-propelled lawnmower that follows its programming: If it fails to detect an obstacle and runs over someone's foot, we don't say the lawnmower \"decided\" to cause injury or \"refused\" to stop. We recognize it as faulty engineering or defective sensors. The same principle applies to AI models—which are software tools—but their internal complexity and use of language make it tempting to assign human-like intentions where none actually exist.Read full article Comments",
          "feed_position": 13
        }
      ],
      "popularity_score": 148
    },
    {
      "id": "cluster_122",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 21:38:49 +0000",
      "title": "Report: Apple’s smart home ambitions include “tabletop robot,” cameras, and more",
      "neutral_headline": "Report: Apple’s smart home ambitions include “tabletop robot,” cameras, and more",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/08/report-apples-smart-home-ambitions-include-tabletop-robot-cameras-and-more/",
          "published_at": "Wed, 13 Aug 2025 21:38:49 +0000",
          "title": "Report: Apple’s smart home ambitions include “tabletop robot,” cameras, and more",
          "standfirst": "Apple has purportedly been working on new smart home devices for years now.",
          "content": "Rumors about a touchscreen-equipped smart home device from Apple have been circulating for years, periodically bolstered by leaked references in Apple's software updates. But a report from Bloomberg's Mark Gurman indicates that Apple's ambitions might extend beyond HomePods with screens attached. Gurman claims that Apple is working on a \"tabletop robot\" that \"resembles an iPad mounted on a movable limb that can swivel and reposition itself to follow users in a room.\" The device will also turn toward people who are addressing it or toward people whose attention it's trying to get. Prototypes have used a 7-inch display similar in size to an iPad mini, with a built-in camera for FaceTime calls. Apple is reportedly targeting a 2027 launch for some version of this robot, although, as with any unannounced Apple product, it could come out earlier, later, or not at all. Gurman reported in January that a different smart home device—essentially a HomePod with a screen, without the moving robot parts—was being planned for 2025, but has said more recently that Apple has bumped it to 2026. The robot could be a follow-up to or a fancier, more expensive version of that device, and it sounds like both will run the same software.Read full article Comments",
          "feed_position": 12
        }
      ],
      "popularity_score": 145
    },
    {
      "id": "cluster_127",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 18:40:18 +0000",
      "title": "Google Gemini will now learn from your chats—unless you tell it not to",
      "neutral_headline": "Google Gemini will now learn from your chats—unless you tell it not to",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/08/google-gemini-will-now-learn-from-your-chats-unless-you-tell-it-not-to/",
          "published_at": "Wed, 13 Aug 2025 18:40:18 +0000",
          "title": "Google Gemini will now learn from your chats—unless you tell it not to",
          "standfirst": "Gemini will remember this, so it's time to check your privacy settings.",
          "content": "As Gemini is increasingly woven into the fabric of Google, the way the chatbot accesses and interacts with your data is in a constant state of flux. Today, Google is announcing several big changes to how its AI adapts to you, giving it the ability to remember more details about your chats for improved answers. If that's a concern, Google also has a new temporary chat option that won't affect the way Gemini thinks about you. You might recall several months back when Google added a \"personalization\" option to the Gemini model selector. This mode leaned on your Google search history to customize responses, a feature that did not seem to appeal to many Gemini users. Google later dropped that mode, but a new attempt at customization is now rolling out. Gemini is getting an option called Personal Context. When enabled, the chatbot will remember details about your past conversations, adapting its replies without being specifically prompted. Google claims Personal Context will produce more relevant responses, particularly when you ask the chatbot to make recommendations. This is separate from the saved instructions feature, which allows you to provide explicit instructions for Gemini to be used in crafting outputs. This does have the potential to make Gemini feel more engaging, but that's not always a good thing. AI chatbots that get too friendly with the user can reinforce misconceptions and lead to delusional thinking, something we've seen distressingly often with AI models.Read full article Comments",
          "feed_position": 15
        }
      ],
      "popularity_score": 145
    },
    {
      "id": "cluster_132",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 17:45:16 +0000",
      "title": "After first operational launch, here’s the next big test for ULA’s Vulcan rocket",
      "neutral_headline": "After first operational launch, here’s the next big test for ULA’s Vulcan rocket",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/08/after-first-operational-launch-heres-the-next-big-test-for-ulas-vulcan-rocket/",
          "published_at": "Wed, 13 Aug 2025 17:45:16 +0000",
          "title": "After first operational launch, here’s the next big test for ULA’s Vulcan rocket",
          "standfirst": "This launch was a big success, but it doesn't necessarily quash anxieties about ULA's ability to deliver.",
          "content": "United Launch Alliance delivered multiple US military satellites into a high-altitude orbit after a prime-time launch Tuesday night, marking an important transition from development to operations for the company's new Vulcan rocket. This mission, officially designated USSF-106 by the US Space Force, was the first flight of ULA's Vulcan rocket to carry national security payloads. Two test flights of the Vulcan rocket last year gave military officials enough confidence to certify it for launching the Pentagon's medium-to-large space missions. United Launch Alliance's third 202-foot-tall (61.6-meter) Vulcan rocket lifted off from Cape Canaveral Space Force Station, Florida, at 8:56 pm EDT Tuesday (00:56 UTC Wednesday). Two methane-burning BE-4 main engines, supplied by Jeff Bezos' space company Blue Origin, and four solid-fueled boosters from Northrop Grumman powered the rocket off the launch pad with nearly 3 million pounds of thrust.Read full article Comments",
          "feed_position": 16
        }
      ],
      "popularity_score": 138
    },
    {
      "id": "cluster_108",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 11:00:36 +0000",
      "title": "Sam Altman finally stood up to Elon Musk after years of X trolling",
      "neutral_headline": "Sam Altman finally stood up to Elon Musk after years of X trolling",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/08/a-brief-history-of-elon-musk-and-sam-altmans-ai-feud/",
          "published_at": "Thu, 14 Aug 2025 11:00:36 +0000",
          "title": "Sam Altman finally stood up to Elon Musk after years of X trolling",
          "standfirst": "Elon Musk and Sam Altman are beefing. But their relationship is complicated.",
          "content": "Much attention was paid to OpenAI's Sam Altman and xAI's Elon Musk trading barbs on X this week after Musk threatened to sue Apple over supposedly biased App Store rankings privileging ChatGPT over Grok. But while the heated social media exchanges were among the most tense ever seen between the two former partners who cofounded OpenAI—more on that below—it seems likely that their jabs were motivated less by who's in the lead on Apple's \"Must Have\" app list than by an impending order in a lawsuit that landed in the middle of their public beefing. Yesterday, a court ruled that OpenAI can proceed with claims that Musk was so incredibly stung by OpenAI's success after his exit didn't doom the nascent AI company that he perpetrated a \"years-long harassment campaign\" to take down OpenAI.Read full article Comments",
          "feed_position": 10
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_118",
      "coverage": 1,
      "updated_at": "Thu, 14 Aug 2025 00:45:35 +0000",
      "title": "Trump orders cull of regulations governing commercial rocket launches",
      "neutral_headline": "Trump orders cull of regulations governing commercial rocket launches",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/08/trump-orders-cull-of-regulations-governing-commercial-rocket-launches/",
          "published_at": "Thu, 14 Aug 2025 00:45:35 +0000",
          "title": "Trump orders cull of regulations governing commercial rocket launches",
          "standfirst": "The head of the FAA's commercial spaceflight division will become a political appointee.",
          "content": "President Donald Trump signed an executive order Wednesday directing government agencies to \"eliminate or expedite\" environmental reviews for commercial launch and reentry licenses. The Federal Aviation Administration (FAA), part of the Department of Transportation (DOT), grants licenses for commercial launch and reentry operations. The FAA is charged with ensuring launch and reentries comply with environmental laws, comport with US national interests, and don't endanger the public. The drive toward deregulation will be welcome news for companies like SpaceX, led by onetime Trump ally Elon Musk; SpaceX conducts nearly all of the commercial launches and reentries licensed by the FAA.Read full article Comments",
          "feed_position": 11
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_125",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 18:51:17 +0000",
      "title": "Polestar sets production car record for longest drive on a single charge",
      "neutral_headline": "Polestar sets production car record for longest drive on a single charge",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/08/polestar-sets-production-car-record-for-longest-drive-on-a-single-charge/",
          "published_at": "Wed, 13 Aug 2025 18:51:17 +0000",
          "title": "Polestar sets production car record for longest drive on a single charge",
          "standfirst": "581 miles on a single charge is impressive, but haven't other drives gone farther?",
          "content": "Ars recently reviewed the Polestar 3, the large electric SUV from the performance-oriented Volvo spinoff. There is a lot to like about the big Polestar, particularly the way it drives: sharp enough to give Porsche cause for concern. Among the handful of things I wasn't so keen on was its reluctance to drive slowly. Like a racehorse champing at the bit, the twin-motor Polestar 3 wanted to deliver lots of power with not much pedal travel, and it took a while, and some conscious effort, to adapt. So I was doubly impressed to see that, over in the UK, a single-motor version of the Polestar 3 just set a world record for the farthest drive in an electric car on a single charge. Three \"professional efficiency drivers,\" Sam Clarke, Kevin Booker, and Richard Parker, drove 581.3 miles (935.4 km), taking 22 hours and 57 minutes to complete the task. That's an efficiency of 5.1 miles/kWh (12.1 kWh/100 km)—more than 40 percent better than I saw in day-to-day driving in the twin-motor version.Read full article Comments",
          "feed_position": 14
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_138",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 16:58:13 +0000",
      "title": "Drag x Drive is a uniquely fun and frustrating showcase for Switch 2 mouse mode",
      "neutral_headline": "Drag x Drive is a uniquely fun and frustrating showcase for Switch 2 mouse mode",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/08/drag-x-drive-is-a-uniquely-fun-and-frustrating-showcase-for-switch-2-mouse-mode/",
          "published_at": "Wed, 13 Aug 2025 16:58:13 +0000",
          "title": "Drag x Drive is a uniquely fun and frustrating showcase for Switch 2 mouse mode",
          "standfirst": "Dual mouse controls work surprisingly well—if you find somewhere to use them.",
          "content": "In my decades as a video game player and reviewer, I've used the humble PC mouse in hundreds of games for everything from first-person aiming and third-person character movement to basic menu navigation and unit selection. In all that time, I can't recall a game that required the use of two mice at once. That was true until I spent some time with Nintendo’s utterly unique Drag x Drive. The game asks you to take a Switch 2 Joy-Con in each hand, turn them both so the narrow edge lies on a flat-ish surface, and then slide them around to power a game of full-contact wheelchair basketball. It’s a fresh control scheme that comes with its share of issues, mostly stemming from the lack of convenient mouse surfaces in most living rooms. With a little bit of practice, a good playing surface, and some online friends to play with, though, I found myself enjoying the high-impact, full-contact, precision positional gameplay enabled by holding a mouse in each hand for the first time.Read full article Comments",
          "feed_position": 18
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_139",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 16:35:15 +0000",
      "title": "Bat colony checks in to hotel; 200 guests check out, unaware of rabies scare",
      "neutral_headline": "Bat colony checks in to hotel; 200 guests check out, unaware of rabies scare",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/08/bat-colony-checks-in-to-hotel-200-guests-check-out-unaware-of-rabies-scare/",
          "published_at": "Wed, 13 Aug 2025 16:35:15 +0000",
          "title": "Bat colony checks in to hotel; 200 guests check out, unaware of rabies scare",
          "standfirst": "The risk is likely low for most, but rabies is nearly 100 percent fatal.",
          "content": "Health officials in Wyoming are sinking their teeth into a meaty task. Over 200 people who stayed in a hotel in Grand Teton National Park between May and July may have unknowingly been exposed to rabies, according to Wyoming Public Radio. In an announcement on Friday, the National Park Service reported finding evidence of a bat colony in the attic. The discovery was made after there had been at least eight incidents in which guests encountered winged mammals inside the hotel.Read full article Comments",
          "feed_position": 19
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_133",
      "coverage": 1,
      "updated_at": "Wed, 13 Aug 2025 17:36:32 +0000",
      "title": "The case for commuting by motorcycle",
      "neutral_headline": "The case for commuting by motorcycle",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/08/the-case-for-commuting-by-motorcycle/",
          "published_at": "Wed, 13 Aug 2025 17:36:32 +0000",
          "title": "The case for commuting by motorcycle",
          "standfirst": "Despite the reputation, it's better, more practical transit than you might think.",
          "content": "America has a motorcycle problem. Whereas the rest of the world views two-wheeled motorized transportation as transportation, the US sees motorcycles and scooters as toys. They're not something you use to commute to work or run errands. Instead, they're for riding to the coffee shop on weekends. This is a flawed line of thinking, and I'll tell you why, using two motorcycles as examples. But first, hear me out. I live in Los Angeles, which is famous for its hellacious traffic. For motorcyclists, it's also famous because you get the ability to legally split lanes (i.e., ride between cars on the lane-dividing lines) and filter (i.e., ride between vehicles at a stoplight to get to the front), as well as its consistently gorgeous climate with a 365-day riding season. These factors aren't the case in every major city, but many of the benefits of motorcycling still apply elsewhere with the right gear and a can-do attitude. The Italian First, the 2025 Ducati Monster SP. This Italian beauty seemingly has everything you'd want in a fun motorcycle. It's lightweight, at just 412 lbs (187 kg) fueled. It's powerful, with a 937cc L-twin that produces 111 hp (83 kW) and 69 ft-lb (94 Nm) of torque. It features an upright and comfortable riding position, along with very good suspension and brakes courtesy of Ohlins and Brembo, respectively.Read full article Comments",
          "feed_position": 17
        }
      ],
      "popularity_score": 130
    }
  ]
}