{
  "updated_at": "2026-01-25T19:17:17.790Z",
  "clusters": [
    {
      "id": "cluster_41",
      "coverage": 3,
      "updated_at": "Sun, 25 Jan 2026 10:07:40 +0000",
      "title": "Our first astronaut's moving Australian of the Year message",
      "neutral_headline": "Our first astronaut's moving Australian of the Year message",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australian-of-the-year-2026-awards-winners-named/dbe1d247-7606-47cb-a4fa-b9f0019b433c",
          "published_at": "Sun, 25 Jan 2026 10:07:40 +0000",
          "title": "Our first astronaut's moving Australian of the Year message",
          "standfirst": "Australia didn&#x27;t even have a space agency when she dreamed of going to space. It didn&#x27;t matter.",
          "content": "When Katherine Bennell-Pegg was asked at school to write down three career options, she chose just one: astronaut.Australia didn&#x27;t even have a space agency at the time but it didn&#x27;t matter. In 2024 she became the first Australian to qualify as an astronaut under Australia&#x27;s space program.Now she can add one more honour to her already impressive CV: Australian of the Year 2026.\"As a kid, I used to lie on the dry grass in my backyard and gaze up at the stars in awe,\" she said tonight.\"That imperative to look to the sky and wonder, to innovate and explore is an ancient one on this continent.\"Australia&#x27;s first nations, people&#x27;s deep connection to Sky Country reminds us that, looking up, has always been part of who we are.\"Bennell-Pegg said her childhood dream felt so far away but paid tribute to \"incredible Australians\" Dr Paul Scully-Power and Dr Andy Thomas, who went to space with another nation&#x27;s flag on their arm.\"So at the astronaut centre, when I received my blue flight suit, and right there, bright on the left shoulder was the Australian flag, it was quite emotional, because it marked something so, so much greater than myself.\"It said that the door has opened for Australia to take our place at the forefront of human endeavour, a chance to collaborate with other nations at the cutting edge of the cutting edge, showcase what we&#x27;re made of, and access the collective discoveries and benefits that all involved countries will make.\"And it gave me hope, hope that one day, more of the flags on spacesuits will follow.\"But Bennell-Pegg warned the nation was \"leaving too much talent on the launchpad\" as young people turned away from STEM subjects.\"A wonderful part of our culture, I think, is how we give it a go in sports, even if we&#x27;re the weakest on the field,\" she said.\"But when it comes to maths and science, if we&#x27;re not top of the class, or we don&#x27;t fit the stereotype, we often shy away. We&#x27;re even encouraged away.\"So if I may be allowed another dream beyond being an astronaut, it&#x27;s this that we bring that same \"give it a go\" spirit from the sports field to the STEM fields, backing each other and ourselves with the trust that we can do hard, important things. \"Imagine what more we would discover, what great problems we would solve, how our horizons would expand.\"YOUNG AUSTRALIAN OF THE YEAR Nedd Brockman was named Young Australian of the Year for 2026 after capturing the nation&#x27;s hearts and minds with an almost 4000-kilometre run across Australia on his mission to end homelessness.After the 23-year-old electrician spent 46 days running from Perth&#x27;s Cottesloe Beach to Bondi Beach in 2022, raising $2.6 million, he&#x27;s shown no signs of slowing down.Later, he ran 1000 miles (1600 kilometres) around Sydney Olympic Park, a gruelling feat he joked probably shaved about 20 years off his live.READ MORE: K&#x27;gari pack of dingoes to be euthanisedSince starting Nedd&#x27;s Uncomfortable Challenge in 2024, Brockmann and his team have raised more than $8 million for those experiencing homelessness.Admitting that he was a \"blubbering mess\", Brockmann called out singer John Farnham&#x27;s 1987 Australian of the Year acceptance speech, in which he spoke about the importance of making sure our national pride encompasses humanity.\"Ever the eternal optimist, I think I see a bit of what I hope for in those words myself,\" Brockmann said tonight.\"We should be proud of this amazing country. We are so lucky to call it home. \"But unfortunately, not everyone feels that way in a country as prosperous as Australia, why is it that 122,000 Australians sleep rough every night? \"That number should stop us all in our tracks.\"READ MORE: Fire doubles in size as state endures once in 20-year heatwave2026 SENIOR AUSTRALIAN OF THE YEAR A psychiatrist whose father&#x27;s Alzheimer&#x27;s disease diagnosis kickstarted a life dedicated to fighting dementia was recognised with the Senior Australian of the Year award.Professor Henry Brodaty AO dementia treatment research revolutionised his own field along with the lives of many people living with the disease and their families.His Centre for Healthy Brain Ageing, founded in 2012, has led internationally significant research and his Maintain Your Brain trial showed what a major difference simple preventions could make.\"Almost half the cost of dementia is caused by preventable factors that we can modify in our lifestyle,\" he said tonight.\"Now, our randomised control trial of an intensive online lifestyle coaching program had the best results yet in the world in maintaining cognition.\"We did a cost benefit analysis. The program paid for itself in reducing health costs, we designed this a decade ago. We can do better. We can do a lot better.\"Brodaty dedicated the award to all older Australians, especially those and their families affected by dementia. \"Oer four decades, we have moved from hopelessness to hope, from stigma to science and I&#x27;m proud to have been part of this transformation,\" he said.\"There is so much we can do. There&#x27;s so much we must do.\"2026 AUSTRALIAN LOCAL HERO Indigenous business owner Frank Mitchell was crowned Australia&#x27;s Local Hero in the first award of the night.The proud Whadjuk-Yued Noongar knew it was a huge opportunity when he was offered an electrical apprenticeship as a young, single father who&#x27;d been affected by suicide but wasn&#x27;t sure if he could complete it.When he started his own business in 2015, he pledged to offer the same opportunities to fellow Indigenous people.Wilco Electrical started with eight staff and $1.5 million turnover, created more than 70 Indigenous upskilling positions and awarded more than $11 million to indigenous subcontractors. His four companies now employ more than 200 full-time staff.\"I used to advocate for organisations to simply give Mob a job, but I know now opportunity alone is not enough,\" he said.\"If workplaces are not not culturally safe, Mob may survive, but they are unlikely to thrive.\"Wilco, Kardan, Baldja and Bilyaa are places where Mob are given a chance to feel safe, and it still does not always work, because people&#x27;s lives are complex, and there is no one size fits all approach, but when it does work, the impacts are powerful.\"That&#x27;s what I represent standing here before you today. And I am just one success story among many.\"READ MORE: Police respond to potential sighting of accused triple murderer2026 AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Professor Rose McGready (Thailand)Professor Rose McGready, 61, has spent three decades providing health services to displaced people in the border region between Thailand and Myanmar.Arriving as a young doctor, Rose discovered that refugees who had fled persecution in Myanmar had difficulty accessing medical assistance in Thailand. In response, Rose established training for local staff to focus on services for expectant mothers and in the critical period of childbirth. Over the past 31 years, she has built a network of locally run clinics and out-patient services which have saved thousands of lives.Rose&#x27;s research has also led to new treatments being developed to tackle maternal malaria. Her findings have been adopted by the World Health Organisation as the global standard for combatting the disease, helping to treat millions of women around the world.Rose&#x27;s commitment, compassion and clinical expertise provide life-saving aid to some of the most vulnerable communities in the world. New South Wales - Dr Alison Thompson OAM (Sutherland Shire)Dr Alison Thompson has deployed over 30,000 volunteers to the world&#x27;s worst disaster zones - bringing humanitarian assistance and medical aid to over 18 million people.It started on September 11, 2001, when as an investment banker, Alison rushed to New York&#x27;s World Trade Centre with her first aid kit. She stayed nine months, offering disaster relief arm-in-arm with ordinary, like-minded people.Galvanising grassroots momentum, Alison founded Third Wave Volunteers - a global movement of first responder volunteers who bring relief to the world&#x27;s disaster and war zones, including Ukraine, Syria, Afghanistan, and Sri Lanka. Following the 2004 tsunami, she set up the first Tsunami Early-Warning Centre and education museum, which continues to thrive.By mobilising everyday people, 61-year-old Alison is building resilience in local communities through sustainable, locally driven disaster prevention and recovery. Drawing from her upbringing as a pastor&#x27;s child, Alison believes that each person&#x27;s small skills add up to drive big changes.Northern Territory - Dr Felix Ho ASM (Darwin)Dr Felix Ho tirelessly serves remote communities in the Northern Territory as a medical practitioner. But for Felix, that&#x27;s not enough – he also volunteers thousands of his hours building the St John Youth Program and helps at public events as a St John first responder.Since joining as a St John cadet in 1995 at the age of 13, Felix has faithfully served others, including overseas as an Intensive Care Paramedic on a United Nations mission to Timor-Leste.In 2020, he took on national leadership of the youth portfolio for St John Ambulance Australia, where he&#x27;s a guiding force for over 3,000 young people, equipping the next generation of first responders. Aligned with clinical standards, Felix developed interactive, accessible and engaging training for youth and cadets across Australia.Now 43, Felix brings people together across geography and generations, to equip Australia&#x27;s youth to save lives through first aid in an emergency.Queensland - Dr Rolf Gomes (Kenmore Hills)When Dr Rolf Gomes, 52, was confronted with how differently cardiac patients were treated in rural and remote Australia, he decided to do something about it. He designed and launched the first Heart of Australia mobile &#x27;Heart Trucks&#x27; to visit remote communities.Today the Heart Trucks bring regular specialist clinics to over 30 towns in rural Australia, providing early diagnostic services that would otherwise be out of reach. Since 2014, the trucks have treated more than 20,000 patients and saved countless lives. The truck fleet will expand to 11 trucks by 2027 to provide services nationally, adding new diagnostic services for a wide range of early intervention health screenings, including for lung cancer.Rolf&#x27;s vision, ingenuity and tenacity have had a far-reaching impact on rural health and medicine in Australia, helping to save lives and ensure that rural patients have access to clinical services without having to travel long distances.South Australia - Katherine Bennell-Pegg (West Beach)Katherine Bennell-Pegg is making history as the first Australian to qualify as an astronaut under Australia&#x27;s space program, opening pathways for others to follow.Katherine graduated from Basic Astronaut Training in 2024 as part of a class of six trained by the European Astronaut Centre in Germany – the first international candidate to do so. She was initially chosen for the program from a field of over 22,500 applicants.Katherine has harboured ambitions of becoming an astronaut since she was a young child. As a space engineer, she has advanced multiple space missions and technologies.Alongside her career achievements, Katherine is an energetic champion for Australia&#x27;s space program, regularly presenting to audiences of schoolchildren and industry leaders to inspire the next generation and create new opportunities.Katherine, 41, is a genuine trailblazer in Australia&#x27;s emerging space industry. With her determination and drive to succeed, she is a powerful example for young Australians.Tasmania - Dr Jorian (Jo) Kippax (Ridgeway)Dr Jo Kippax was part of a specialist team of rescuers tasked to free a whitewater rafter who was trapped in perilous rapids on the Franklin River in 2024.Lithuanian whitewater rafter, Valdas Bieliauskas, was retrieved from freezing water by Jo and his team.The clinical team performed an operation to amputate Valdas&#x27;s leg underwater, allowing him to be freed and ultimately saving his life. Throughout the rescue, Jo was instrumental in guiding the team with professionalism, courage and remarkable calmness under pressure.For this life-saving act, the President of Lithuania, Gitanas Nausėda awarded the country&#x27;s Life Saving Cross award to Jo, which he humbly accepted on behalf of his team.The rescue of Valdas is just one chapter in Jo&#x27;s long career in emergency medicine, disaster response, and search and rescue. Demonstrating outstanding skill, courage and team leadership in the aid of others, 55-year-old Jo displays selfless dedication to saving lives in often very challenging circumstances.Victoria - Carrie Bickmore OAM (Melbourne)Carrie Bickmore is a radio and television presenter who has changed the way that brain cancer research is funded in Australia.Brain cancer kills more Australian children than any other disease, and more people aged under 40 than any other cancer – including Carrie&#x27;s late husband Greg, who passed away in 2010.Since 2015, Carrie has raised over $27 million. In 2021, she established The Brain Cancer Centre to bring together the brightest minds in research to find a cure.The Brain Cancer Centre has leveraged investment by Carrie&#x27;s Foundation to secure another $45 million of research funding. This supports research projects across the country and is delivering specific clinical trials for brain cancer patients that are the first of their kind in the world.Carrie is striving to ensure that every Australian diagnosed with brain cancer can access the best treatments and has real hope of a positive outcome.Western Australia - Dr Daniela Vecchio (Parklands)Dr Daniela Vecchio is head of mental health and addiction services at Fiona Stanley Hospital. She is the pioneer in establishing the first publicly funded gaming disorder clinic in Australia in 2022.She has seen increasing numbers of young people with addiction to video games and social media and was quick to recognise the distress and harms caused to them and their families. The clinic is unique worldwide in providing early detection and intervention in an acute hospital setting.Daniela, 57, has driven the development of holistic assessments and a wide range of personalised treatments for her clients. She has fostered extensive collaborations, including internationally with Korea, Germany and Dubai, nationally with experts in the field, and locally with health, education and police services.As a director of the Australian Gaming and Screens Alliance, she is promoting education and research into harmful online use and influencing national policy.2026 SENIOR AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Heather Reid AM (Kiels Mountain)New South Wales - Professor Henry Brodaty AO (Double Bay)Northern Territory - Jenny Duggan OAM (Katherine)Queensland - Cheryl Harris OAM (Sunshine Coast)South Australia - Malcolm Benoy (Mount Osmond)South Australia - James Currie (Carrickalinga)Tasmania - Julie Dunbabin (Taroona)Victoria - Bryan Lipmann AM (Richmond)Western Australia - Professor Kingsley Dixon AO (Waroona)2026 YOUNG AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Sita Sargeant (Canberra)New South Wales - Nedd Brockmann (Randwick)Queensland - Jarib Branfield-Bradshaw (Cunnamulla)South Australia - Chloe Wyatt-Jasper (Gawler South)Tasmania - Alyssia Kennedy (Heybridge)Victoria - Abraham Kuol (Narre Warren)Western Australia - Dr Haseeb Riaz and Gareth Shanthikumar (Peppermint Grove& City Beach)",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/b62e5af0-58b9-4dd0-92bb-65a9ee7dd11a"
        },
        {
          "source": "Canberra Times",
          "url": "https://www.canberratimes.com.au/story/9160378/astronaut-katherine-bennell-pegg-is-2026-australian-of-the-year/",
          "published_at": "Sun, 25 Jan 2026 20:47:00 +1100",
          "title": "'So much greater than myself': our first astronaut is a true blue inspiration",
          "standfirst": "2026 Australian of the Year is astronaut Katherine Bennell-Pegg.",
          "content": "2026 Australian of the Year is astronaut Katherine Bennell-Pegg.",
          "feed_position": 0,
          "image_url": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/LCCM7haWhjq8sXGapHMpfU/1fd1f9c0-427f-4549-a1a9-a3edf226f16d.jpg/r0_259_5000_3076_w600_h338_fmax.jpg"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/australian-of-the-year-awards-2026/106267536",
          "published_at": "Sun, 25 Jan 2026 08:48:03 +0000",
          "title": "Space industry trailblazer named Australian of the Year",
          "standfirst": "Katherine Bennell-Pegg has been named 2026 Australian of the Year for making history as the first Australian to qualify as an astronaut under the nation's space program.",
          "content": "Katherine Bennell-Pegg has been named 2026 Australian of the Year for making history as the first Australian to qualify as an astronaut under the nation's space program.",
          "feed_position": 0
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/b62e5af0-58b9-4dd0-92bb-65a9ee7dd11a",
      "popularity_score": 3010.839502777778
    },
    {
      "id": "cluster_2",
      "coverage": 2,
      "updated_at": "Sun, 25 Jan 2026 19:06:43 +0000",
      "title": "ICE agents urged to leave Minneapolis after second fatal shooting",
      "neutral_headline": "ICE agents urged to leave Minneapolis after second fatal shooting",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/minneapolis-ice-alex-pretti-shooting-democrats/106268614",
          "published_at": "Sun, 25 Jan 2026 19:06:43 +0000",
          "title": "ICE agents urged to leave Minneapolis after second fatal shooting",
          "standfirst": "It is the second death in Minneapolis linked to the Trump administration's immigration crackdown.",
          "content": "It is the second death in Minneapolis linked to the Trump administration's immigration crackdown.",
          "feed_position": 6
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/ice-minneapolis-after-alex-pretti-shooting-protesters-demand-immigration-agents-leave/f3c69b16-6764-4988-bce1-8846ac9b53c7",
          "published_at": "Sun, 25 Jan 2026 14:06:14 +0000",
          "title": "Protesters demand immigration agents leave US city after man shot dead",
          "standfirst": "After the shooting, an angry crowd gathered and protesters clashed with federal officers, who wielded batons and deployed flash bangs.",
          "content": "Democrats have demanded that federal immigration officers leave Minnesota after a US Border Patrol agent fatally shot a man in Minneapolis, drawing hundreds of protesters onto the frigid streets and increasing tensions in a city already shaken by another shooting death weeks earlier.Family members identified the man who was killed as Alex Pretti, a 37-year-old intensive care unit nurse who protested President Donald Trump&#x27;s immigration crackdown in his city.After the shooting, an angry crowd gathered and protesters clashed with federal officers, who wielded batons and deployed flash bangs.READ MORE: K&#x27;gari pack of dingoes to be euthanisedA federal judge has already ruled that officers participating in the federal immigration enforcement surge in Minnesota can&#x27;t detain or tear gas peaceful protesters who aren&#x27;t obstructing authorities, including when these people are observing the agents.That decision came in a case brought by the American Civil Liberties Union on behalf of Minnesota activists.Minnesota and its two largest cities, Minneapolis and St Paul, have also sued the Trump administration making similar arguments that the federal officers are violating the constitutional rights of Twin Cities residents.The Minnesota National Guard was assisting local police at the direction of Governor Tim Walz, officials said.Guard troops were sent to both the shooting site and a federal building where officers have squared off with demonstrators daily.Information about what led up to the shooting was limited, Police Chief Brian O&#x27;Hara said.READ MORE: Fire doubles in size as state endures once in 20-year heatwaveDepartment of Homeland Security spokesperson Tricia McLaughlin said in a statement that federal officers were conducting an operation and fired \"defence shots\" after a man with a handgun approached them and \"violently resisted\" when they tried to disarm him.In bystander videos of the shooting that emerged soon after, Pretti is seen with a phone in his hand but none appears to show him with a visible weapon.O&#x27;Hara said police believe he was a \"lawful gun owner with a permit to carry\".DHS Secretary Kristi Noem said during a news conference that Pretti had shown up to \"impede a law enforcement operation\".She questioned why he was armed but did not offer details about whether Pretti drew the weapon or brandished it at officers.The officer who shot him is an eight-year Border Patrol veteran, federal officials said.READ MORE: Police respond to potential sighting of accused triple murdererTrump blames DemocratsThe president weighed in on social media by lashing out at Walz and the Minneapolis mayor.He shared images of the gun that immigration officials said was recovered and said: \"What is that all about? Where are the local Police? Why weren&#x27;t they allowed to protect ICE Officers?\"Trump, a Republican, said the Democratic governor and mayor are \"are inciting insurrection, with their pompous, dangerous, and arrogant rhetoric\".Representative Alexandria Ocasio-Cortez of New York was among several Democratic politicians demanding federal immigration authorities leave Minnesota.She also urged Democrats to refuse to vote to fund US Immigration and Customs Enforcement.\"We have a responsibility to protect Americans from tyranny,\" she said, on social media.Senate Democratic Leader Chuck Schumer later said that Democrats will not vote for a spending package that includes money for DHS, which oversees ICE.Schumer&#x27;s statement increases the possibility that the government could partially shut down on January 30 when funding runs out.Pretti was shot a little more than a mile (1.6 kilometres) from where an ICE officer killed 37-year-old Renee Good on January 7, sparking widespread protests.Pretti&#x27;s family released a statement Saturday evening saying they are \"heartbroken but also very angry\" and calling him a kindhearted soul who wanted to make a difference in the world through his work as a nurse.\"The sickening lies told about our son by the administration are reprehensible and disgusting. Alex is clearly not holding a gun when attacked by Trump&#x27;s murdering and cowardly ICE thugs.He has his phone in his right hand and his empty left hand is raised above his head while trying to protect the woman ICE just pushed down all while being pepper sprayed,\" the family statement said.\"Please get the truth out about our son. He was a good man.\"Video shows officers, man who was shotIn a bystander video obtained by The Associated Press, protesters are heard blowing whistles and shouting profanities at federal officers on Nicollet Avenue.An officer shoves a person who is wearing a brown jacket, skirt and black tights and carrying a water bottle. That person reaches out for a man, and the two link up, embracing.The man, wearing a brown jacket and black hat, seems to be holding his phone up toward the officer.The same officer shoves the man in his chest and the two, still embracing, fall back.The video shifts to a different part of the street and then comes back to the two individuals unlinking from each other. It shifts focus again and then shows three officers surrounding the man. Soon at least seven officers surround him.One is on his back, and another who appears to have a canister in his hand strikes a blow to his chest.Several officers try to bring the man&#x27;s arms behind his back as he appears to resist. As they pull his arms, his face is briefly visible. The officer with the canister strikes him near his head several times.A shot rings out, but with officers surrounding the man, it&#x27;s not clear where it came from. Multiple officers back off. More shots are heard. Officers back away, and the man lies motionless on the street.The police chief appealed for calm, both from the public and from federal law enforcement.\"Our demand today is for those federal agencies that are operating in our city to do so with the same discipline, humanity and integrity that effective law enforcement in this country demands,\" the chief said.\"We urge everyone to remain peaceful.\"Gregory Bovino of US Border Patrol, who has commanded the administration&#x27;s big-city immigration campaign, said the officer who shot the man had extensive training as a range safety officer and in using less-lethal force.\"This is only the latest attack on law enforcement. Across the country, the men and women of DHS have been attacked, shot at,\" he said.Walz said he had no confidence in federal officials and the state would lead the investigation into the shooting.But Drew Evans, superintendent of the Minnesota Bureau of Criminal Apprehension, said during a news conference that federal officers blocked his agency from the scene even after it obtained a signed judicial warrant.Protests continueDemonstrations broke out in several cities across the country including New York, Washington and Los Angeles.In Minneapolis, protesters converged at the scene of the shooting in Minneapolis despite dangerously cold weather — by the afternoon the worst of an extreme cold wave was over, but the temperature was still minus 6 degrees Celsius.An angry crowd gathered after the shooting and screamed profanities at federal officers, calling them \"cowards\" and telling them to go home.One officer responded mockingly as he walked away, telling them: \"Boo hoo.\"Agents elsewhere shoved a yelling protester into a car.Protesters dragged garbage dumpsters from alleyways to block streets, and people chanted \"ICE out now\" and \"Observing ICE is not a crime.\"As dark fell hundreds of people mourned quietly by a growing memorial at the site of the shooting. Some carried signs saying \"Justice for Alex Pretti\". Others chanted Pretti&#x27;s and Good&#x27;s names.A doughnut shop and a clothing store nearby stayed open, offering protesters a warm place as well as water, coffee and snacks.Caleb Spike said he came from a nearby suburb to show his support and his frustration.\"It feels like every day something crazier happens,\" he said.\"What&#x27;s happening in our community is wrong, it&#x27;s sickening, it&#x27;s disgusting.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/2b44e30f-b4c3-46d9-a3b3-9c0f3fbc1edf"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/explainer-here-s-what-we-know-about-the-minneapolis-shooting/106267266",
          "published_at": "Sun, 25 Jan 2026 06:32:28 +0000",
          "title": "What we know about the second fatal federal shooting in Minneapolis",
          "standfirst": "The death of 37-year-old US citizen Alex Pretti has prompted a fierce political debate and further protests in an already tense city. This is what we know about the situation so far.",
          "content": "The death of 37-year-old US citizen Alex Pretti has prompted a fierce political debate and further protests in an already tense city. This is what we know about the situation so far.",
          "feed_position": 7
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/police-chief-calls-for-calm-after-minneapolis-shooting/106266626",
          "published_at": "Sat, 24 Jan 2026 21:16:37 +0000",
          "title": "Protests erupt in Minneapolis after second US citizen shot dead by agents",
          "standfirst": "This is the second fatal shooting involving federal agents this month during a surge in immigration enforcement in the northern US city.",
          "content": "This is the second fatal shooting involving federal agents this month during a surge in immigration enforcement in the northern US city.",
          "feed_position": 23
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/2b44e30f-b4c3-46d9-a3b3-9c0f3fbc1edf",
      "popularity_score": 2019.8236694444445
    },
    {
      "id": "cluster_4",
      "coverage": 2,
      "updated_at": "Sun, 25 Jan 2026 18:41:00 +0000",
      "title": "Extreme Australia Day heatwave predicted in several states",
      "neutral_headline": "Extreme Australia Day heatwave predicted in several states",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/heatwave-conditions-across-australia/106267024",
          "published_at": "Sun, 25 Jan 2026 18:41:00 +0000",
          "title": "Extreme Australia Day heatwave predicted in several states",
          "standfirst": "Record-breaking temperatures above 40 degrees Celsius will be experienced in several parts of Australia from today.",
          "content": "Record-breaking temperatures above 40 degrees Celsius will be experienced in several parts of Australia from today.",
          "feed_position": 5
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/weather-warnings-victoria-heatwave-queensland-flooding/89cf0ec6-6297-47bc-9c05-0ce55711a720",
          "published_at": "Sat, 24 Jan 2026 10:04:37 +0000",
          "title": "Temperatures nudge close to 50 degrees as multiple states brace for record-breaking heat",
          "standfirst": "And the one state that&#x27;s facing a record-breaking run of heatwave conditions beyond the Australia Day long weekend and into next week.",
          "content": "Victoria is facing a record-breaking run of heatwave conditions over this Australia Day long weekend and into next week.Adelaide ticked over 41.5 degrees today, while in other parts of the state, temperatures nudged towards 50 degrees with 48.2 degrees recorded in Tarcoola.Melbourne followed closely, with the city sweltering in 40 degree heat, halting play at the Australian Open.READ MORE: NSW beaches closed after shark attacks set to reopen in time for Australia Day long weekendThe heat also sparked emergency level bushfires in Victoria&#x27;s south-west, with multiple evacuation orders in place as firefighters attempt to contain the blaze.A total fire ban is in place for the entire state of Victoria, while South Australians face catastrophic fire danger on the Yorke and Eyre Peninsulas.In South Australia, south-westerly winds will knock temperatures back a few degrees tomorrow - down to 37 degrees in the city - but Adelaide could hit 45 degrees on Monday, making it the hottest Australia Day on record.Some relief may be on the way for Victoria but it won&#x27;t last long, with Tuesday looking even hotter.\"We&#x27;ve got a trough that&#x27;s pushing into south western parts of the state,\" Bureau of Meteorology senior meteorologist Sarah Scully said.\"The gusty north-westerly winds can keep the temperatures really elevated ahead of that cooler south-westerly change.\"Bureau of Meteorology senior meteorologist Christie Johnson said northern parts of Victoria could see temperatures into the 40s for potentially five or six days in a row.Johnson said Tuesday could be a day of concern with near-record temperatures of about 48 degrees.\"It could definitely be one of the hottest days that we&#x27;ve ever seen over Victoria,\" she said.Water police will be out in force with hundreds expected to pack beaches across the coast over the long weekend.\" Take care on our beaches, take care on our waterways and take care on our roads,\" Victoria Police acting superintendent Brett Coloe said.\"It&#x27;s going to be a very, very busy period.\"Residents have been warned to take care as the blistering sun can be deadly.\"Hot weather not only creates its own emergencies with people becoming dehydrated and leading to heat stress and stroke, but it can exacerbate normal medical problems as well, which increases our workload,\" Ambulance Victoria&#x27;s Andrew Burns said.&#x27;Catastrophic fire dangers&#x27; Scully told Today there&#x27;s the potential for temperature records to be broken, amid increased fire dangers.\"What this means is if any fires are ignited, they will most likely be impossible to control,\" Scully said this morning.\"Now, broadly speaking, when we do have catastrophic fire dangers in place, it&#x27;s recommended that people leave early.\"However, it&#x27;s important for any of the residents within these areas to listen to the advice from local emergency services. \"Tennis impacted Australian Open matches in Melbourne were halted after the Heat Stress Index reached five. Matches at the tournament had started half an hour early, so players could avoid the sweltering conditions .\"We&#x27;re assuming that the heat is not going to go away and we need to keep players safe,\" Chief Medical Officer for Tennis Australia , Caroline Broderick, told Today.READ MORE: Police open fire in Melbourne after police car allegedly rammed\"When the heat stress scale hits three, we have additional cooling measures on court.\"When it hits four, we have these rest breaks between the second and third set in women&#x27;s tennis and the men&#x27;s tennis.\"Heat stress scale hits five, we cancel or postpone all play on outside courts and close the roofs on our stadium courts.\"South Australia on track for record-breaking heat South Australia has sweltered through a day of extreme heat with some parts of the state, reaching close to 50 degrees.The extreme conditions have seen events cancelled across the state, with the latest casualty the Australia Day fireworks at Elder Park. Aus Lights on the river&#x27;s been scrapped for the first time in its history but the Mourning ceremony should still go ahead. \"Make no mistake, the state is set to bake for much of the next week,\" the Bureau of Meteorology&#x27;s John Fisher said.READ MORE: Family of Piper James given preliminary autopsy results Emergency Services Minister Rhiannon Pearce said additional aircraft, including a large aerial tanker, would be deployed if required across the state.Those planning long weekend road trips have been asked to think twice.\"Don&#x27;t go into the highest risk fire areas, and if you are and you have accommodation booked, please be sensible about it,\" Loughlin said.High electricity demand could also cause significant strain, making power outages a possibility.\"Common sense - we can do this, we can get through this hot weather if we work together and we make sensible decisions,\" Loughlin said.Tropical Cyclone crosses WA costOn the west coast of Australia, residents along the west Kimberley coast are feeling the effects of Tropical Cyclone Luana.The Category 2 storm crossed the WA coast north of Broome - between Beagle Bay and Cape Leveque - this afternoon [AWST] bringing destructive winds of up to 130km/h and heavy rainfall.A warning zone extends from Broome to Kuri Bay, including Derby and adjacent inland areas , with a severe weather warning in place for heavy rainfall and flash flooding about the central and northern Kimberley.The bureau warns of six-hour totals of up to 120 millimetres, with heavy falls bringing possible 24-hour totals of up to 200mm along the coastal fringes.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 11,
          "image_url": "https://prod.static9.net.au/fs/c363c411-1934-4875-a972-1a9fcd98cb86"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/c363c411-1934-4875-a972-1a9fcd98cb86",
      "popularity_score": 2019.3950583333333
    },
    {
      "id": "cluster_39",
      "coverage": 2,
      "updated_at": "Sun, 25 Jan 2026 11:00:32 +0000",
      "title": "Cathy Freeman 'humbled' as she receives Australia's highest honour",
      "neutral_headline": "Australia Day 2026 Honours: Complete list of recipients",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/2026-australia-day-honours-list/106258634",
          "published_at": "Sun, 25 Jan 2026 11:00:32 +0000",
          "title": "Cathy Freeman 'humbled' as she receives Australia's highest honour",
          "standfirst": "From champion athletes to those working to help our most vulnerable, the 2026 Australia Day Honours List showcases the very best of the nation.",
          "content": "From champion athletes to those working to help our most vulnerable, the 2026 Australia Day Honours List showcases the very best of the nation.",
          "feed_position": 2
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australia-day-2026-honours-complete-list-of-recipients/61ccdce8-028f-430a-9967-cb3484fd1b39",
          "published_at": "Sun, 25 Jan 2026 11:00:00 +0000",
          "title": "Australia Day 2026 Honours: Complete list of recipients",
          "standfirst": "Sporting legend Cathy Freeman has been awarded Australia&#x27;s highest honour, a little more than 25 years after she sent the nation into a frenzy with her Olympic gold medal at Sydney 2000.",
          "content": "Sporting legend Cathy Freeman has been awarded Australia&#x27;s highest honour, a little more than 25 years after she sent the nation into a frenzy with her Olympic gold medal at Sydney 2000.Other notable names to be appointed as a companion of the Order of Australia (AC) tonight include former premiers Kristina Keneally, Annastacia Palaszcuk and Steven Marshall, and former federal finance minister Mathias Cormann. In all, nearly 1000 Australians were recognised in the Australia Day 2026 Honours List, including awards in the Order of Australia (General and Military Divisions), meritorious awards, and recognition for distinguished and conspicuous service.READ MORE: K&#x27;gari pack of dingoes to be euthanisedIt&#x27;s just the latest in a glittering list of achievements and awards for Freeman, undoubtedly one of Australia&#x27;s greatest athletes, responsible for the country&#x27;s most iconic sporting moment. She already counted Australian of the Year, Young Australian of the Year, Sport Australia Hall of Fame Legend status and the Order of Australia Medal alongside her Olympic gold and silver medals and three Commonwealth Games golds in her trophy cabinet.The Kuku Yalanji and Birra Gubba woman was recognised for \"eminent service to athletics as an international competitor and ambassador, to positive social impact across the community, to the reconciliation movement in the spirit of unity and inclusion, and as a role model to youth.\"Freeman told The Sydney Morning Herald she intended to use the honour as a platform to unite Australia.\"Mum said this is a gift from the Australian people and I wouldn&#x27;t have looked at it that way, but my mum has incredible wisdom. So I sort of just stopped overthinking it and took it in the spirit it&#x27;s supposed to be received in,\" she said, adding her mum was \"all about unity\".\"I just want to be who I am, be authentic. My achievement and my story is always going to touch on things like Aboriginal/Torres Strait Islander perspectives, Olympism, track and field, elite sport, women in sport, the themes are diverse and varied.\"Freeman described the award as \"quite mind-bending\".\"I set out to be the best athlete that I could be for myself and then all of a sudden this whole world unfolded right before my very eyes, and it just continues to expand, and it continues to be a wild ride, let me tell ya,\" she said.Palaszczuk, who won widespread support among Queenslanders but angered many in the rest of the country by limiting the local impact of the COVID-19 pandemic through harsh border restrictions, was praised for her recognition to public health.She was also recognised more generally for her time as premier and service to educational equity and multiculturalism.READ MORE: Fire doubles in size as state endures once in 20-year heatwaveRob Hirst, the Midnight Oil drummer who died just days ago follow an almost three-year battle with pancreatic cancer, was appointed a member of the order for his service to music. The Council of the Order of Australia highlighted former federal finance minister Cormann for his contributions to government reform, multilateral affairs and international economic development.The Belgian-born Australian politician became secretary-general of the Organisation for Economic Co-operation and Development (OECD) shortly after leaving the Senate.Former NSW leader Kristina Keneally was recognised for her services as premier, as well as her later years as a federal senator.Former South Australian premier Steven Marshall was recognised for his service to business, people with disability, governance and board positions. In addition to the 680 recipients of awards in the General Division of the Order of Australia (10 AC, 38 AO, 160 AM and 472 OAM), today&#x27;s Honours list includes: 22 recipients of awards in the Military Division of the Order of Australia.187 Meritorious awards 60 Distinguished and Conspicuous awardsYou can search the table below for the full list of honourees. READ MORE: Police respond to potential sighting of accused triple murdererGovernor-General Sam Mostyn said the honourees reflected Australia&#x27;s values for service, community, kindness, curiosity, tenacity, and care.\"Congratulations to everyone recognised in the Australia Day 2026 Honours List,\" she said.\"As the list so vividly showcases, so many Australians continue to give the best of themselves across many endeavours, in the interest of others. It is rewarding to see an increase in the number of awards, which reflects more nominations and recognition of the many Australians who inspire the best in all of us.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 2,
          "image_url": "https://prod.static9.net.au/fs/692b4ac4-94ab-4de1-aaf8-713251a5927a"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/692b4ac4-94ab-4de1-aaf8-713251a5927a",
      "popularity_score": 2011.720613888889
    },
    {
      "id": "cluster_1",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 19:11:19 +0000",
      "title": "Elderly man charged with murder of 77-year-old woman in Melbourne's north",
      "neutral_headline": "Elderly man charged with murder of 77-year-old woman in Melbourne's north",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/vic-wollert-murder-charge/106268654",
          "published_at": "Sun, 25 Jan 2026 19:11:19 +0000",
          "title": "Elderly man charged with murder of 77-year-old woman in Melbourne's north",
          "standfirst": "An 80-year-old man will face court today charged with murdering the woman at a property in Wollert, in Melbourne's north.",
          "content": "An 80-year-old man will face court today charged with murdering the woman at a property in Wollert, in Melbourne's north.",
          "feed_position": 0
        }
      ],
      "popularity_score": 358.90033611111113
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:38:07 +0000",
      "title": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
      "neutral_headline": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/moderate-liberals-rock-solid-ley-leadership-challenge/106267314",
          "published_at": "Sun, 25 Jan 2026 18:38:07 +0000",
          "title": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
          "standfirst": "While conservatives Angus Taylor and Andrew Hastie canvass support to challenge for the Liberal leadership, moderates say there is no mood for turning on Sussan Ley — meaning a spill would likely result in another divided vote.",
          "content": "While conservatives Angus Taylor and Andrew Hastie canvass support to challenge for the Liberal leadership, moderates say there is no mood for turning on Sussan Ley — meaning a spill would likely result in another divided vote.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.3470027777778
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 08:55:01 +0000",
      "title": "'That's when he's got me': Sole survivor of regional NSW shooting speaks out",
      "neutral_headline": "'That's when he's got me': Sole survivor of regional NSW shooting speaks out",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/lake-cargelligo-shooting-survivor-kaleb-macqueen-speaks/106265692",
          "published_at": "Sun, 25 Jan 2026 08:55:01 +0000",
          "title": "'That's when he's got me': Sole survivor of regional NSW shooting speaks out",
          "standfirst": "Nineteen-year-old Kaleb Macqueen was working on his car in the quiet NSW outback town of Lake Cargelligo last Thursday when violence erupted.",
          "content": "Nineteen-year-old Kaleb Macqueen was working on his car in the quiet NSW outback town of Lake Cargelligo last Thursday when violence erupted.",
          "feed_position": 3
        }
      ],
      "popularity_score": 312.6286694444444
    },
    {
      "id": "cluster_16",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:00:00 +0000",
      "title": "As the 'rules-based world order' is threatened old economic ideas are revisited",
      "neutral_headline": "As the 'rules-based world order' is threatened old economic ideas are revisited",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/trump-us-dollar-keynes-bretton-woods-economy/106260832",
          "published_at": "Sun, 25 Jan 2026 18:00:00 +0000",
          "title": "As the 'rules-based world order' is threatened old economic ideas are revisited",
          "standfirst": "In the wake of Trump, the world will now have to revisit the conference that set the \"rules-based world order\" up.",
          "content": "In the wake of Trump, the world will now have to revisit the conference that set the \"rules-based world order\" up.",
          "feed_position": 4
        }
      ],
      "popularity_score": 311.711725
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:30:00 +0000",
      "title": "Predicting the future isn't easy. In 1959 these Adelaidians gave it a shot",
      "neutral_headline": "Predicting the future isn't easy. In 1959 these Adelaidians gave it a shot",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/if-youre-listening-future-predictions-adelaide-history-radio/106256170",
          "published_at": "Sun, 25 Jan 2026 18:30:00 +0000",
          "title": "Predicting the future isn't easy. In 1959 these Adelaidians gave it a shot",
          "standfirst": "I had been trawling absent-mindedly through the ABC's internal digital archive in a vague search for inspiration and clicked on this file called \"Letters to the Unborn\" at random.",
          "content": "I had been trawling absent-mindedly through the ABC's internal digital archive in a vague search for inspiration and clicked on this file called \"Letters to the Unborn\" at random.",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.211725
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 07:42:26 +0000",
      "title": "English veteran stars as Scorchers cruise to record-extending sixth BBL title",
      "neutral_headline": "English veteran stars as Scorchers cruise to record-extending sixth BBL title",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/scorchers-claim-sixth-bbl-title-against-sixers/106265840",
          "published_at": "Sun, 25 Jan 2026 07:42:26 +0000",
          "title": "English veteran stars as Scorchers cruise to record-extending sixth BBL title",
          "standfirst": "The Perth Scorchers have easily accounted for a meek Sydney Sixers in the BBL final, cruising to a six-wicket triumph at a raucous Perth Stadium.",
          "content": "The Perth Scorchers have easily accounted for a meek Sydney Sixers in the BBL final, cruising to a six-wicket triumph at a raucous Perth Stadium.",
          "feed_position": 9
        }
      ],
      "popularity_score": 251.41894722222222
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:30:00 +0000",
      "title": "'Quitting isn't failure': When to scrap or adjust life goals",
      "neutral_headline": "'Quitting isn't failure': When to scrap or adjust life goals",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/new-year-resolutions-goals/106205930",
          "published_at": "Sun, 25 Jan 2026 18:30:00 +0000",
          "title": "'Quitting isn't failure': When to scrap or adjust life goals",
          "standfirst": "Experts say knowing when to abandon or change your goals may be just as important as persistence.",
          "content": "Experts say knowing when to abandon or change your goals may be just as important as persistence.",
          "feed_position": 13
        }
      ],
      "popularity_score": 152.211725
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:30:00 +0000",
      "title": "History quiz: Do you know where the Beatles played their last show?",
      "neutral_headline": "History quiz: Do you know where the Beatles played their last show",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/this-week-in-history-quiz/106265668",
          "published_at": "Sun, 25 Jan 2026 18:30:00 +0000",
          "title": "History quiz: Do you know where the Beatles played their last show?",
          "standfirst": "Who was David Letterman's first guest on the Late Night show? Who celebrates Republic Day today?",
          "content": "Who was David Letterman's first guest on the Late Night show? Who celebrates Republic Day today?",
          "feed_position": 14
        }
      ],
      "popularity_score": 152.211725
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 07:16:02 +0000",
      "title": "Man charged after allegedly sending threatening letter to Sydney mosque",
      "neutral_headline": "Man charged after allegedly sending threatening letter to Sydney mosque",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-25/man-70-charged-alleged-threatening-letter-lakemba-mosque/106266730",
          "published_at": "Sun, 25 Jan 2026 07:16:02 +0000",
          "title": "Man charged after allegedly sending threatening letter to Sydney mosque",
          "standfirst": "Police seized more than 100 letters, stamps, notepads and several electronic devices after a raid on the 70-year-old's Belmore home.",
          "content": "Police seized more than 100 letters, stamps, notepads and several electronic devices after a raid on the 70-year-old's Belmore home.",
          "feed_position": 13
        }
      ],
      "popularity_score": 146.97894722222222
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 07:06:27 +0000",
      "title": "'Get out while you can': Police crackdown on illicit tobacco in South West",
      "neutral_headline": "'Get out while you can': Police crackdown on illicit tobacco in South West",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-25/illicit-tobacco-crackdown-in-southwest-wa/106267262",
          "published_at": "Sun, 25 Jan 2026 07:06:27 +0000",
          "title": "'Get out while you can': Police crackdown on illicit tobacco in South West",
          "standfirst": "Tens of thousands of cigarettes and vapes, and almost $90,000 cash, has been seized during a week-long crackdown on illicit tobacco in WA's South West.",
          "content": "Tens of thousands of cigarettes and vapes, and almost $90,000 cash, has been seized during a week-long crackdown on illicit tobacco in WA's South West.",
          "feed_position": 14
        }
      ],
      "popularity_score": 140.819225
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 06:09:18 +0000",
      "title": "Kangaroo causes crash chaos as Jay Vine taken out on final TDU stage",
      "neutral_headline": "Kangaroo causes crash chaos as Jay Vine taken out on final TDU stage",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/kangaroo-crashes-into-tour-down-under-peloton-as-jay-vine-wins/106267096",
          "published_at": "Sun, 25 Jan 2026 06:09:18 +0000",
          "title": "Kangaroo causes crash chaos as Jay Vine taken out on final TDU stage",
          "standfirst": "Jay Vine was taken out by a pair of kangaroos and lost yet another teammate to injury, but was still able to hang on and claim a second career Tour Down Under victory.",
          "content": "Jay Vine was taken out by a pair of kangaroos and lost yet another teammate to injury, but was still able to hang on and claim a second career Tour Down Under victory.",
          "feed_position": 20
        }
      ],
      "popularity_score": 139.866725
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 05:42:19 +0000",
      "title": "Foo Fighters and Beaconsfield miner reunite at Launceston concert",
      "neutral_headline": "Foo Fighters and Beaconsfield miner reunite at Launceston concert",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/foo-fighters-concert-launceston/106267426",
          "published_at": "Sun, 25 Jan 2026 05:42:19 +0000",
          "title": "Foo Fighters and Beaconsfield miner reunite at Launceston concert",
          "standfirst": "Foo Fighters frontman Dave Grohl says it was a \"profound moment\" when a pair of miners requested the rock band's music to lift their spirits while trapped underground in 2006.",
          "content": "Foo Fighters frontman Dave Grohl says it was a \"profound moment\" when a pair of miners requested the rock band's music to lift their spirits while trapped underground in 2006.",
          "feed_position": 24
        }
      ],
      "popularity_score": 139.41700277777778
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 05:39:22 +0000",
      "title": "Australian Scotty James claims eighth X-Games gold on eve of Olympics",
      "neutral_headline": "Australian Scotty James claims eighth X-Games gold on eve of Olympics",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-25/scotty-james-wins-x-games-gold/106267420",
          "published_at": "Sun, 25 Jan 2026 05:39:22 +0000",
          "title": "Australian Scotty James claims eighth X-Games gold on eve of Olympics",
          "standfirst": "Scotty James has matched snowboard legend Shaun White by claiming his eighth superpipe gold medal at the X-Games Aspen 2026, making him a sure favourite for Olympic gold in Milano Cortina next month.",
          "content": "Scotty James has matched snowboard legend Shaun White by claiming his eighth superpipe gold medal at the X-Games Aspen 2026, making him a sure favourite for Olympic gold in Milano Cortina next month.",
          "feed_position": 18
        }
      ],
      "popularity_score": 139.3678361111111
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 05:15:39 +0000",
      "title": "'Me being me': Sabalenka's basic approach to being world number one",
      "neutral_headline": "'Me being me': Sabalenka's basic approach to being world number one",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-25/australian-open-aryna-sabalenka-wins-fourth-round/106267374",
          "published_at": "Sun, 25 Jan 2026 05:15:39 +0000",
          "title": "'Me being me': Sabalenka's basic approach to being world number one",
          "standfirst": "As another Australian Open title beckons, Aryna Sabalenka reveals why she has not changed since topping the world rankings.",
          "content": "As another Australian Open title beckons, Aryna Sabalenka reveals why she has not changed since topping the world rankings.",
          "feed_position": 19
        }
      ],
      "popularity_score": 138.97255833333332
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 05:03:42 +0000",
      "title": "Bull shark tagging, extra drones for NSW beaches after attacks",
      "neutral_headline": "Bull shark tagging, extra drones for NSW beaches after attacks",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/sydney-bull-shark-tagging-program-and-extra-drones-nsw-beaches/106266896",
          "published_at": "Sun, 25 Jan 2026 05:03:42 +0000",
          "title": "Bull shark tagging, extra drones for NSW beaches after attacks",
          "standfirst": "NSW coast and Sydney Harbour beachgoers can expect to see more drones in the sky after a $4.2 million investment into the state's shark management program in the wake of four shark attacks, including one fatal.",
          "content": "NSW coast and Sydney Harbour beachgoers can expect to see more drones in the sky after a $4.2 million investment into the state's shark management program in the wake of four shark attacks, including one fatal.",
          "feed_position": 18
        }
      ],
      "popularity_score": 138.77339166666667
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 04:52:39 +0000",
      "title": "Next generation players usher in new era in Australian cricket",
      "neutral_headline": "Next generation players usher in new era in Australian cricket",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-25/next-generation-players-new-era-australian-cricket/106265608",
          "published_at": "Sun, 25 Jan 2026 04:52:39 +0000",
          "title": "Next generation players usher in new era in Australian cricket",
          "standfirst": "While Australian punters and pundits alike have been wringing their hands over an aging national cricket squad, the next generation has been quietly getting to work, proving they are ready to fill the shoes of retiring stars.",
          "content": "While Australian punters and pundits alike have been wringing their hands over an aging national cricket squad, the next generation has been quietly getting to work, proving they are ready to fill the shoes of retiring stars.",
          "feed_position": 21
        }
      ],
      "popularity_score": 138.589225
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 07:35:58 +0000",
      "title": "Search for missing 12yo boy at Victorian beach",
      "neutral_headline": "Search for missing 12yo boy at Victorian beach",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/missing-12yo-boy-venus-bay-victoria-gippsland-coast-search/106267850",
          "published_at": "Sun, 25 Jan 2026 07:35:58 +0000",
          "title": "Search for missing 12yo boy at Victorian beach",
          "standfirst": "Police and the community have mounted a search for 12-year-old Danny, who was last seen swimming at a beach in Venus Bay on Sunday afternoon.",
          "content": "Police and the community have mounted a search for 12-year-old Danny, who was last seen swimming at a beach in Venus Bay on Sunday afternoon.",
          "feed_position": 11
        }
      ],
      "popularity_score": 138.31116944444443
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 04:27:09 +0000",
      "title": "American rock climber reaches top of Taipei 101 skyscraper without ropes",
      "neutral_headline": "American rock climber reaches top of Taipei 101 skyscraper without ropes",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/alex-honnold-climbs-taipei-101-without-ropes/106267428",
          "published_at": "Sun, 25 Jan 2026 04:27:09 +0000",
          "title": "American rock climber reaches top of Taipei 101 skyscraper without ropes",
          "standfirst": "It took Alex Honnold about 90 minutes to reach the top of the 508-metre-tall building.",
          "content": "It took Alex Honnold about 90 minutes to reach the top of the 508-metre-tall building.",
          "feed_position": 19
        }
      ],
      "popularity_score": 138.164225
    },
    {
      "id": "cluster_57",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 04:06:26 +0000",
      "title": "'We build what we want to be': Kevin McCloud on his dream home",
      "neutral_headline": "'We build what we want to be': Kevin McCloud on his dream home",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/kevin-mccloud-tim-ross-grand-designs-architecture/106157748",
          "published_at": "Sun, 25 Jan 2026 04:06:26 +0000",
          "title": "'We build what we want to be': Kevin McCloud on his dream home",
          "standfirst": "What makes a house a home? Grand Designs' Kevin McCloud and design enthusiast Tim Ross say it's as simple as a building that \"puts you in contact with other people\".",
          "content": "What makes a house a home? Grand Designs' Kevin McCloud and design enthusiast Tim Ross say it's as simple as a building that \"puts you in contact with other people\".",
          "feed_position": 15
        }
      ],
      "popularity_score": 137.81894722222222
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 04:00:14 +0000",
      "title": "Last-ditch push to land hospitals deal as states fight back",
      "neutral_headline": "Last-ditch push to land hospitals deal as states fight back",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-25/national-cabinet-hospital-ndis-funding-deal/106267184",
          "published_at": "Sun, 25 Jan 2026 04:00:14 +0000",
          "title": "Last-ditch push to land hospitals deal as states fight back",
          "standfirst": "The Commonwealth will try to force a deal on hospital funding at a National Cabinet meeting this week, after months of stalled negotiations with angry state leaders, who say the federal government is not contributing its fair share.",
          "content": "The Commonwealth will try to force a deal on hospital funding at a National Cabinet meeting this week, after months of stalled negotiations with angry state leaders, who say the federal government is not contributing its fair share.",
          "feed_position": 24
        }
      ],
      "popularity_score": 137.7156138888889
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 03:29:39 +0000",
      "title": "Dingoes involved in death of Canadian backpacker euthanased",
      "neutral_headline": "Dingoes involved in death of Canadian backpacker euthanased",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/dingoes-involved-in-k-gari-backpacker-death-euthanised/106267322",
          "published_at": "Sun, 25 Jan 2026 03:29:39 +0000",
          "title": "Dingoes involved in death of Canadian backpacker euthanased",
          "standfirst": "Queensland government officials euthanase six dingoes involved in the death of a Canadian backpacker on K'gari, with more to be put down in the coming days.",
          "content": "Queensland government officials euthanase six dingoes involved in the death of a Canadian backpacker on K'gari, with more to be put down in the coming days.",
          "feed_position": 21
        }
      ],
      "popularity_score": 137.20589166666667
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 01:58:25 +0000",
      "title": "US snowstorm triggers flight cancellations and power outages",
      "neutral_headline": "US snowstorm triggers flight cancellations and power outages",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/us-winter-storm-power-outages-thousands-of-flight-cancellations/106267082",
          "published_at": "Sun, 25 Jan 2026 01:58:25 +0000",
          "title": "US snowstorm triggers flight cancellations and power outages",
          "standfirst": "A monster snowstorm is moving across the US, cancelling thousands of flights, knocking out power and snarling major roadways with ice.",
          "content": "A monster snowstorm is moving across the US, cancelling thousands of flights, knocking out power and snarling major roadways with ice.",
          "feed_position": 17
        }
      ],
      "popularity_score": 135.6853361111111
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 01:14:11 +0000",
      "title": "Trump praises UK troops as 'brave' warriors, day after 'front line' slur",
      "neutral_headline": "Trump praises UK troops as 'brave' warriors, day after 'front line' slur",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/donald-trump-praises-uk-troops-as-brave-warriors/106266908",
          "published_at": "Sun, 25 Jan 2026 01:14:11 +0000",
          "title": "Trump praises UK troops as 'brave' warriors, day after 'front line' slur",
          "standfirst": "The US President has praised British soldiers, after remarks he made earlier this week about NATO troops in Afghanistan were described as \"insulting and appalling\" by the UK's Prime Minister Keir Starmer.",
          "content": "The US President has praised British soldiers, after remarks he made earlier this week about NATO troops in Afghanistan were described as \"insulting and appalling\" by the UK's Prime Minister Keir Starmer.",
          "feed_position": 22
        }
      ],
      "popularity_score": 134.94811388888888
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Sat, 24 Jan 2026 23:30:47 +0000",
      "title": "De Minaur demolishes Bublik to storm into quarterfinal date with Alcaraz",
      "neutral_headline": "De Minaur demolishes Bublik to storm into quarterfinal date with Alcaraz",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/australian-open-live-blog-day-eight-results-updates/106266662",
          "published_at": "Sat, 24 Jan 2026 23:30:47 +0000",
          "title": "De Minaur demolishes Bublik to storm into quarterfinal date with Alcaraz",
          "standfirst": "Alex de Minaur obliterates Alexander Bublik in straight sets on Rod Laver Arena, after superstars Aryna Sabalenka and Carlos Alcaraz progressed through to the last eight of the Australian Open.",
          "content": "Alex de Minaur obliterates Alexander Bublik in straight sets on Rod Laver Arena, after superstars Aryna Sabalenka and Carlos Alcaraz progressed through to the last eight of the Australian Open.",
          "feed_position": 10
        }
      ],
      "popularity_score": 133.22478055555555
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Sat, 24 Jan 2026 20:27:14 +0000",
      "title": "Fire threatens homes in Victoria's Otways ahead of possible record heat",
      "neutral_headline": "Fire threatens homes in Victoria's Otways ahead of possible record heat",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/victorian-otways-fire-threatens-communities-heatwave/106265690",
          "published_at": "Sat, 24 Jan 2026 20:27:14 +0000",
          "title": "Fire threatens homes in Victoria's Otways ahead of possible record heat",
          "standfirst": "An out-of-control bushfire has threatened communities in Victoria's Otways, as heatwave conditions continue in some parts of the state.",
          "content": "An out-of-control bushfire has threatened communities in Victoria's Otways, as heatwave conditions continue in some parts of the state.",
          "feed_position": 12
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Sat, 24 Jan 2026 18:00:00 +0000",
      "title": "Some accept the risk of shark bites. Others quietly wrestle with fear",
      "neutral_headline": "Some accept the risk of shark bites. Others quietly wrestle with fear",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-25/horror-week-shark-bites-attack-nsw-facts-fears-risk/106260980",
          "published_at": "Sat, 24 Jan 2026 18:00:00 +0000",
          "title": "Some accept the risk of shark bites. Others quietly wrestle with fear",
          "standfirst": "As a devoted ocean swimmer, I've learned to accept the risk of exploring an ocean that is not my natural habitat.",
          "content": "As a devoted ocean swimmer, I've learned to accept the risk of exploring an ocean that is not my natural habitat.",
          "feed_position": 16
        }
      ],
      "popularity_score": 133
    }
  ]
}