{
  "updated_at": "2025-12-28T23:19:46.271Z",
  "clusters": [
    {
      "id": "cluster_17",
      "coverage": 3,
      "updated_at": "Sun, 28 Dec 2025 20:31:52 +0000",
      "title": "'We demand answers': Bondi victims' families scathing letter to PM",
      "neutral_headline": "Families of Bondi victims call for royal commission",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/bondi-beach-terror-attack-scathing-letter-from-victims-families-to-anthony-albanese-calls-for-royal-commission/397e89fe-67f5-4f35-bbbc-4c3e6e4e1b3f",
          "published_at": "Sun, 28 Dec 2025 20:31:52 +0000",
          "title": "'We demand answers': Bondi victims' families scathing letter to PM",
          "standfirst": "T he families of multiple people killed in the Bondi Beach terror attack have called for a royal commission.",
          "content": "T he families of 11 of the Bondi Beach terror attack victims have called for a federal royal commission in a scathing letter to Prime Minister Anthony Albanese.The grieving families have demanded a commission examine \"the rapid rise of antisemitism in Australia following Hamas&#x27; attack on October 7, 2023, and the law enforcement, intelligence, and policy failures that led to the Bondi Beach massacre\", in a letter published in full in Nine newspapers.\"We demand answers and solutions,\" they wrote.READ MORE: Three teens charged with murdering man in shopping centre car park on Christmas Eve\" We need to know why clear warning signs were ignored, how antisemitic hatred and Islamic extremism were allowed to dangerously grow unchecked, and what changes must be made to protect all Australians going forward.\"The prime minister has so far resisted calls for a royal commission, citing the need to push forward with more immediate reforms and changes.The government has ordered an independent review into the attack and the circumstances surrounding it, which will be due in April next year.SYDNEY TO HOBART: Master Lock Comanche crew celebrates &#x27;redemption&#x27; victory \"Announcements made so far by the federal government in response to the Bondi massacre are not nearly enough,\" the families wrote.\"Prime Minister, how can you not support a royal commission into the deadliest terrorist attack on Australian soil? Royal commissions have been established for banks and for aged care.\"The NSW government is holding a state-based royal commission, and the letter-writers said there was \"unprecedented\" support for a federal one as the problem of rising antisemitism extended far beyond state borders.READ MORE: Father charged after allegedly showing Nazi tattoos on Newcastle beach \"You owe us answers. You owe us accountability. And you owe Australians the truth,\" they wrote.Albanese has previously defended his stance by pointing out that no federal royal commissions were held in the wake of the 1996 Port Arthur massacre or the 2014 Lindt Cafe siege.However, critics - including the families who signed the letter - say that there have been years of escalating attacks on the Jewish community without sufficient response from authorities.You can read the letter from the victims&#x27; families in full below.The families of those murdered at Bondi call for a commonwealth royal commissionWe, the families of those killed and injured in the Bondi Beach massacre, call on the Prime Minister to immediately establish a Commonwealth Royal Commission into the rapid rise of antisemitism in Australia following Hamas&#x27; attack on October 7, 2023, and the law enforcement, intelligence, and policy failures that led to the Bondi Beach massacre.We demand answers and solutions.We need to know why clear warning signs were ignored, how antisemitic hatred and Islamic extremism were allowed to dangerously grow unchecked, and what changes must be made to protect all Australians going forward.As proud Australians and proud Jews, we have endured more than two and a half years of relentless attacks. Our children feel unsafe at school and university. Our homes, workplaces, sporting fields, and public spaces no longer feel secure. It is an intolerable situation that no Australian should have to endure.Announcements made so far by the federal government in response to the Bondi massacre are not nearly enough.Prime Minister, how can you not support a Royal Commission into the deadliest terrorist attack on Australian soil? Royal Commissions have been established for banks and for aged care.We have lost parents, spouses, children, and grandparents.Our loved ones were celebrating Chanukah at Bondi Beach, a festival of light and joy, in an iconic public space that should have been safe.You owe us answers. You owe us accountability. And you owe Australians the truth.Senior legal, security, and political leaders from across the country have come together in an unprecedented display of public support for a Commonwealth Royal Commission. The rise of antisemitism in Australia goes far beyond one state jurisdiction. It is a national crisis that demands a powerful national response.In just the past few days following the Bondi attack, a Jewish family&#x27;s car was firebombed, and a man in Western Australia was arrested after posting messages of support following the Bondi attack while stockpiling weapons and in possession of Hamas and Hezbollah flags. This threat is real, and it is escalating.The dangerous rise of antisemitism and radicalism in Australia is not going away.We need strong action now. We need leadership now.You cannot bring back our loved ones. But with a well-led Commonwealth Royal Commission and strong action, you may be able to save many more.Abesidon FamilyAmzalak FamilyBritvan FamilyBrutman FamilyGoldhirsch FamilyGurman FamilyGutnick FamilyJoseph FamilyKastel FamilyKleytman FamilyLevitan FamilyMorrison FamilySchlanger FamilyTetelroyd FamilyTretiak FamilyUlman FamilyWeitzen Family",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/7743900d-6dfb-47e2-bd26-168feedc2c38"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/families-of-bondi-victims-call-for-royal-commission-20251229-p5nqfm.html",
          "published_at": "Mon, 29 Dec 2025 06:48:54 +1100",
          "title": "Families of Bondi victims call for royal commission",
          "standfirst": "The families of 11 of the Bondi terror attack victims have called for a royal commission in a letter to Prime Minister Anthony Albanese.",
          "content": "The families of 11 of the Bondi terror attack victims have called for a royal commission in a letter to Prime Minister Anthony Albanese.",
          "feed_position": 12,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/c5607c7be9d370871d5486fdd1223c675a5621b9"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/bondi-beach-victim-families-call-for-federal-royal-comission/106183188",
          "published_at": "Sun, 28 Dec 2025 13:01:12 +0000",
          "title": "Families of Bondi victims call for federal royal commission",
          "standfirst": "Loved ones of those killed and injured in the Bondi Beach attack say rising antisemitism requires a \"powerful national response\", piling pressure on Anthony Albanese for a royal commission.",
          "content": "Loved ones of those killed and injured in the Bondi Beach attack say rising antisemitism requires a \"powerful national response\", piling pressure on Anthony Albanese for a royal commission.",
          "feed_position": 1
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/7743900d-6dfb-47e2-bd26-168feedc2c38",
      "popularity_score": 3017.201591388889
    },
    {
      "id": "cluster_47",
      "coverage": 3,
      "updated_at": "Mon, 29 Dec 2025 04:56:17 +1100",
      "title": "French 1960s sex symbol Brigitte Bardot has died at 91",
      "neutral_headline": "French 1960s sex symbol Brigitte Bardot has died at 91",
      "items": [
        {
          "source": "Canberra Times",
          "url": "https://www.canberratimes.com.au/story/9142426/french-1960s-sex-symbol-brigitte-bardot-has-died-at-91/",
          "published_at": "Mon, 29 Dec 2025 04:56:17 +1100",
          "title": "French 1960s sex symbol Brigitte Bardot has died at 91",
          "standfirst": "A month after being hospitalised, French 1960s sex symbol Brigitte Bardot has died at age 91 at her home in the south of France.",
          "content": "A month after being hospitalised, French 1960s sex symbol Brigitte Bardot has died at age 91 at her home in the south of France.",
          "feed_position": 7,
          "image_url": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/9ac51b05-cb17-4ccd-95a7-e260fcec1597.jpg/r0_75_800_526_w600_h338_fmax.jpg"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/brigitte-bardot-death-1960s-sex-symbol-turned-militant-animal-rights-activist-dies-aged-91/6def262c-0bbf-446c-bdb8-328054e794bc",
          "published_at": "Sun, 28 Dec 2025 12:13:56 +0000",
          "title": "French film star Brigitte Bardot dies, aged 91",
          "standfirst": "Screen icon Brigitte Bardot, who became a sex symbol in the 1960s and later a militant animal rights activist, has died at the age of 91.",
          "content": "Brigitte Bardot, the French 1960s sex symbol who became one of the greatest screen sirens of the 20th century and later a militant animal rights activist, has died. She was 91.Bardot died Sunday at her home in southern France, according to Bruno Jacquelin, of the Brigitte Bardot Foundation for the protection of animals.Speaking to The Associated Press, he gave no cause of death, and said no arrangements have yet been made for funeral or memorial services. READ MORE: Russia hits Kyiv in deadly strike a day before key Trump-Zelenksyy meeting She had been hospitalised last month.Bardot became an international celebrity as a sexualized teen bride in the 1956 movie And God Created Woman. Directed by her then-husband, Roger Vadim, it triggered a scandal with scenes of the long-legged beauty dancing on tables naked.At the height of a cinema career that spanned some 28 films and three marriages, Bardot came to symbolise a nation bursting out of bourgeois respectability. Her tousled, blond hair, voluptuous figure and pouty irreverence made her one of France&#x27;s best-known stars.Such was her widespread appeal that in 1969 her features were chosen to be the model for \"Marianne\", a bare-breasted statue representing the French Republic, and the official Gallic seal. Bardot&#x27;s face appeared on statues, postage stamps and even on coins.&#x27;&#x27;We are mourning a legend,&#x27;&#x27; French President Emmanuel Macron wrote Sunday on X.Bardot&#x27;s second career as an animal rights activist was equally sensational. She travelled to the Arctic to blow the whistle on the slaughter of baby seals; she condemned the use of animals in laboratory experiments; and she opposed Muslim slaughter rituals.\"Man is an insatiable predator,\" Bardot told The Associated Press on her 73rd birthday, in 2007.\"I don&#x27;t care about my past glory. That means nothing in the face of an animal that suffers, since it has no power, no words to defend itself.\"Her activism earned her compatriots&#x27; respect and, in 1985, she was awarded the Legion of Honour, the nation&#x27;s highest honour.A turn to the far rightLater, however, she fell from public grace as her animal protection diatribes took on a decidedly extremist tone. She frequently decried the influx of immigrants into France, especially Muslims.She was convicted and fined five times in French courts of inciting racial hatred, in incidents inspired by her opposition to the Muslim practice of slaughtering sheep during annual religious holidays.Bardot&#x27;s 1992 marriage to fourth husband Bernard d&#x27;Ormale, a onetime adviser to former National Front leader Jean-Marie Le Pen, contributed to her political shift. She described the outspoken nationalist as a \"lovely, intelligent man\".In 2012, she wrote a letter in support of the presidential bid of Marine Le Pen, who now leads her father&#x27;s renamed National Rally party. Le Pen paid homage Sunday to an \"exceptional woman\" who was \"incredibly French\".In 2018, at the height of the #MeToo movement, Bardot said in an interview that most actors protesting sexual harassment in the film industry were \"hypocritical\" and \"ridiculous\" because many played \"the teases\" with producers to land parts.She said she had never had been a victim of sexual harassment and found it \"charming to be told that I was beautiful or that I had a nice little ass\".A privileged, but &#x27;difficult&#x27; upbringingBrigitte Anne-Marie Bardot was born September 28, 1934, to a wealthy industrialist. A shy, secretive child, she studied classical ballet and was discovered by a family friend who put her on the cover of Elle magazine at age 14.Bardot once described her childhood as \"difficult\" and said her father was a strict disciplinarian who would sometimes punish her with a horse whip.But it was French movie producer Vadim, whom she married in 1952, who saw her potential and wrote And God Created Woman to showcase her provocative sensuality, an explosive cocktail of childlike innocence and raw sexuality.The film, which portrayed Bardot as a bored newlywed who beds her brother-in-law, had a decisive influence on New Wave directors Jean-Luc Godard and Francois Truffaut, and came to embody the hedonism and sexual freedom of the 1960s.The film was a box-office hit, and it made Bardot a superstar. Her girlish pout, tiny waist and generous bust were often more appreciated than her talent.\"It&#x27;s an embarrassment to have acted so badly,\" Bardot said of her early films.\"I suffered a lot in the beginning. I was really treated like someone less than nothing.\"Bardot&#x27;s unabashed, off-screen love affair with co-star Jean-Louis Trintignant further shocked the nation. It eradicated the boundaries between her public and private life and turned her into a hot prize for paparazzi.Bardot never adjusted to the limelight. She blamed the constant press attention for the suicide attempt that followed 10 months after the birth of her only child, Nicolas. Photographers had broke into her house only two weeks before she gave birth to snap a picture of her pregnant.Nicolas&#x27; father was Jacques Charrier, a handsome French actor whom she married in 1959 but who never felt comfortable in his role as Monsieur Bardot. Bardot soon gave up her son to his father, and later said she had been chronically depressed and unready for the duties of being a mother.\"I was looking for roots then,\" she said in an interview. \"I had none to offer.\"In her 1996 autobiography Initiales B.B., she likened her pregnancy to \"a tumour growing inside me,\" and described Charrier as \"temperamental and abusive\".Bardot married her third husband, West German millionaire playboy Gunther Sachs, in 1966, but the relationship again ended in divorce three years later.Among her films were A Parisian (1957); In Case of Misfortune, in which she starred in 1958 with screen legend Jean Gabin; The Truth (1960); Private Life (1962); A Ravishing Idiot (1964); Shalako (1968); Women (1969); The Bear And The Doll (1970); Rum Boulevard (1971); and Don Juan (1973).With the exception of 1963&#x27;s critically acclaimed Contempt, directed by Godard, Bardot&#x27;s films were rarely complicated by plots. Often they were vehicles to display Bardot&#x27;s curves and legs in scanty dresses or frolicking nude in the sun.\"It was never a great passion of mine,\" she said of filmmaking.\"And it can be deadly sometimes. Marilyn [Monroe] perished because of it.\"Bardot retired to her Riviera villa in St. Tropez at the age of 39 in 1973 after The Woman Grabber.Reinventing herself in middle ageShe emerged a decade later with a new persona: An animal rights lobbyist, her face was wrinkled and her voice was deep following years of heavy smoking. She abandoned her jet-set life and sold off movie memorabilia and jewellery to create a foundation devoted exclusively to the prevention of animal cruelty.Her activism knew no borders. She urged South Korea to ban the sale of dog meat and once wrote to US President Bill Clinton asking why the US Navy recaptured two dolphins it had released into the wild.She attacked centuries-old French and Italian sporting traditions including the Palio, a free-for-all horse race, and campaigned on behalf of wolves, rabbits, kittens and turtle doves.Following news of her death, PETA Founder Ingrid Newkirk praised her activism and labelled the late actress \"a strong voice for all species\".\"From her rescued pigeons in Saint-Tropez to her beloved dogs, PETA will miss Brigitte, an angel for animals who went to bat and to court to protect them all,\" Newkirk said in a statement. By the late 1990s, Bardot was making headlines that would lose her many fans. She was convicted and fined five times between 1997 and 2008 for inciting racial hatred in incidents inspired by her anger at Muslim animal slaughtering rituals.\"It&#x27;s true that sometimes I get carried away, but when I see how slowly things move forward ... and despite all the promises that have been made to me by all different governments put together — my distress takes over,\" Bardot told the AP.In 1997, several towns removed Bardot-inspired statues of Marianne after the actress voiced anti-immigrant sentiment. Also that year, she received death threats after calling for a ban on the sale of horse meat.Bardot once said that she identified with the animals that she was trying to save.\"I can understand hunted animals because of the way I was treated,\" Bardot said.\"What happened to me was inhuman. I was constantly surrounded by the world press.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 11,
          "image_url": "https://prod.static9.net.au/fs/1d43fdd7-def0-49f1-8b5d-50f094e33c76"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/brigitte-bardot-dies-age-91/102626484",
          "published_at": "Sun, 28 Dec 2025 10:19:07 +0000",
          "title": "Iconic French star Brigitte Bardot dies aged 91",
          "standfirst": "The French actor and singer was a screen siren of the 1950s and 1960s who in later life became a prominent animal rights campaigner.",
          "content": "The French actor and singer was a screen siren of the 1950s and 1960s who in later life became a prominent animal rights campaigner.",
          "feed_position": 24
        }
      ],
      "featured_image": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/9ac51b05-cb17-4ccd-95a7-e260fcec1597.jpg/r0_75_800_526_w600_h338_fmax.jpg",
      "popularity_score": 3014.6085358333335
    },
    {
      "id": "cluster_54",
      "coverage": 3,
      "updated_at": "Sun, 28 Dec 2025 05:31:47 GMT",
      "title": "Australian cruise ship investigated after leaving passenger behind runs aground off PNG with 120 people on board",
      "neutral_headline": "Australian cruise ship runs aground off PNG",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/world/2025/dec/28/australian-cruise-ship-investigated-after-leaving-passenger-behind-runs-aground-off-png-with-120-people-on-board",
          "published_at": "Sun, 28 Dec 2025 05:31:47 GMT",
          "title": "Australian cruise ship investigated after leaving passenger behind runs aground off PNG with 120 people on board",
          "standfirst": "Coral Adventurer says passengers and crew are safe while team tries to refloat ship and inspects the hullGet our breaking news email, free app or daily news podcastAn Australian cruise ship being investigated after allegedly leaving behind a passenger who died alone has run aground off the coast of Papua New Guinea with more than 120 people aboard.The Coral Adventurer ran aground early on Saturday morning, about 30km from PNG’s second-largest city, Lae. The vessel’s operator, Coral Expeditions, said no one was hurt in the incident. Continue reading...",
          "content": "Coral Adventurer says passengers and crew are safe while team tries to refloat ship and inspects the hullGet our breaking news email, free app or daily news podcastAn Australian cruise ship being investigated after allegedly leaving behind a passenger who died alone has run aground off the coast of Papua New Guinea with more than 120 people aboard.The Coral Adventurer ran aground early on Saturday morning, about 30km from PNG’s second-largest city, Lae. The vessel’s operator, Coral Expeditions, said no one was hurt in the incident. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/cruise-ship-coral-adventurer-runs-aground-off-papua-new-guinea/106182788",
          "published_at": "Sun, 28 Dec 2025 03:18:24 +0000",
          "title": "Australian cruise ship runs aground off PNG",
          "standfirst": "The Coral Adventurer has run aground off the coast of Papua New Guinea with more than 120 people aboard, two months after the death of a passenger allegedly left behind on a Great Barrier Reef island.",
          "content": "The Coral Adventurer has run aground off the coast of Papua New Guinea with more than 120 people aboard, two months after the death of a passenger allegedly left behind on a Great Barrier Reef island.",
          "feed_position": 24
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/coral-adventurer-cruise-ship-hits-coral-reef-two-months-after-passenger-died-left-behind-lizard-island/a6be1a50-1555-4823-9a69-634f879b67b7",
          "published_at": "Sat, 27 Dec 2025 20:53:34 +0000",
          "title": "Cruise ship runs aground on first trip since passenger's death",
          "standfirst": "The Coral Adventurer ran into trouble during its first trip back at sea, two months after the death of an 80-year-old passenger on Lizard Island.",
          "content": "An embattled Cairns-based cruise ship has run aground while sailing around the South Pacific. The vessel ran into trouble on Saturday morning, during its first trip back at sea after the death of an 80-year-old passenger on Lizard Island in October.Australian-flagged vessel, the Coral Adventurer, hit a coral reef and ran aground off the Papua New Guinea coast, stuck around 30 kilometres from the city of Lae. READ MORE: Body found inside a car on the Gold Coast Crew alerted relevant authorities around 6am. 9News understands there are 123 people on board the luxury cruise ship, including 80 passengers and 43 crew. The Australian Maritime Safety Authority (AMSA) said in a statement \"there are no injuries among the passengers and crew onboard\". The PNG Maritime Rescue Coordination Centre also confirmed an officer has boarded the vessel and is assisting with the incident.READ MORE: Further delays expected to remove snapped crane hovering over caravan park Crews were waiting for high tide to help re-float the ship, to assess if there&#x27;s any damage.It&#x27;s been troubled waters for the luxury cruise ship that&#x27;s already navigated a turbulent two months after it made headlines in October.Suzanne Rees, an 80-year-old New South Wales tourist, was found dead on remote Lizard Island several hours after being left behind by the Coral Adventurer.The tragedy ultimately sparked several investigations, including by the AMSA and Workplace Health and Safety Queensland, which remains ongoing. This latest 12-night cruise, which costs $13,280 per person, departed from Cairns on December 18, reaching Papua New Guinea last Saturday on December 20. It&#x27;s then been cruising up the coastline over the past week before this latest bungle happened on December 27. Passengers were due to disembark on December 30. Coral Expeditions responded on Saturday evening, saying an initial inspection has found no damage to the vessel and further investigations will be undertaken. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 13,
          "image_url": "https://prod.static9.net.au/fs/c22070db-5fca-4262-aeaa-f4825a1e0ef7"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/c22070db-5fca-4262-aeaa-f4825a1e0ef7",
      "popularity_score": 3002.2002025
    },
    {
      "id": "cluster_0",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 10:03:23 +1100",
      "title": "US, Ukraine ‘a lot closer’ on peace deal, Trump says after Zelensky meeting",
      "neutral_headline": "US, Ukraine ‘a lot closer’ on peace deal, Trump says after Zelensky meeting",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/north-america/watch-trump-meets-with-zelensky-us-president-reports-very-productive-call-with-putin-20251229-p5nqfa.html",
          "published_at": "Mon, 29 Dec 2025 10:03:23 +1100",
          "title": "US, Ukraine ‘a lot closer’ on peace deal, Trump says after Zelensky meeting",
          "standfirst": "The US president said it would be clear “in a few weeks” whether negotiations to end the war would succeed.",
          "content": "The US president said it would be clear “in a few weeks” whether negotiations to end the war would succeed.",
          "feed_position": 0,
          "image_url": "https://static.ffx.io/images/$zoom_0.4113%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/a06ac50ccd04f70ea69e32d2882b263b8c44863c"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/russia-ukraine-conflict-updates-volodymyr-zelenskyy-donald-trump-florida-meeting-peace-talks/0ee3f044-fe6a-40dc-863a-37201408b5bb",
          "published_at": "Sun, 28 Dec 2025 19:36:20 +0000",
          "title": "Trump, Zelenskyy meet in Florida as US confirms call with Putin",
          "standfirst": "Donald Trump called Volodymyr Zelenskyy and the Ukrainian people \"brave\" and said all sides sought peace.",
          "content": "US President Donald Trump said he believed both Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin truly want peace, as he welcomed the \"brave\" Ukrainian leader for talks at his Florida resort.\"The two leaders want it to end,\" Trump said at the outset of the meeting at Mar-a-Lago.Before Zelenskyy arrived, Trump spoke with Putin by phone for more than an hour, and planned to speak with him again soon after.READ MORE: &#x27;Full-scale war&#x27;: Iran leader&#x27;s chilling statement to nationGreeting Zelenskyy at Mar-a-Lago, Trump said of him: \"This gentleman has worked very hard, and is very brave, and his people are very brave.\"Zelenskyy, by Trump&#x27;s side, said he&#x27;d discuss issues of territorial concessions with Trump, which have so far been a red line for his country.He said his negotiators and Trump&#x27;s \"have discussed how to move step by step and bring peace closer\" and would continue to do so in the meeting.Russia intensified its attacks on Ukraine&#x27;s capital in the days before the meeting.Putin&#x27;s foreign affairs adviser Yuri Ushakov said the call was initiated by the US side and lasted over an hour, and was \"friendly, benevolent, and businesslike\".Ushakov said Trump and Putin agreed to speak again \"promptly\" after Trump&#x27;s meeting with Zelenskyy.Trump and Zelenskyy met at Trump&#x27;s private club in Palm Beach, where the US president is spending the holidays.Zelenskyy, who arrived in Miami in the morning, said the two planned to discuss security and economic agreements in their early afternoon meeting.He said he would raise \"territorial issues\" as Moscow and Kyiv remain fiercely at odds over the fate of the Donbas region in eastern Ukraine.In overnight developments, three guided aerial bombs launched by Russia struck private homes in the eastern city of Sloviansk, according to the head of the local military administration, Vadym Lakh.Three people were injured and one man died, Lakh said in a post on the Telegram messenger app.The strike came the day after Russia attacked Ukraine&#x27;s capital with ballistic missiles and drones on Saturday, killing at least one person and wounding 27, a day before planned talks between the leaders of Ukraine and the US, Ukrainian authorities said.Explosions boomed across Kyiv as the attack began in the early morning and continued for hours.In advance of his meeting with Trump, Zelenskyy said that he spoke on the phone with British Prime Minister Keir Starmer, filling him in \"on the situation on the frontline and on the consequences of Russian strikes.\"He posted on X: \"Thank you, Keir, for the constant coordination!\" Zelenskyy&#x27;s office said he would speak by phone with allies after the meeting with Trump.In a meeting on Saturday with Canadian Prime Minister Mark Carney in Halifax, Nova Scotia, Zelenskyy said the key to peace iwa \"pressure on Russia and sufficient, strong support for Ukraine.\"To that end, Carney announced more economic assistance from his government to help Ukraine rebuild.Denouncing the \"barbarism\" of Russia&#x27;s latest attacks on Kyiv, Carney credited both Zelenskyy and Trump with creating the conditions for a \"just and lasting peace\" at a crucial moment.\"Ukraine is willing to do whatever it takes to stop this war,\" Zelenskyy posted on Saturday. \"We need to be strong at the negotiating table.\"In response to the attacks, he wrote: \"We want peace, and Russia demonstrates a desire to continue the war. If the whole world — Europe and America — is on our side, together we will stop\" Russian President Vladimir Putin.Trump and Zelenskyy sitting down face-to-face also underscored the apparent progress made by Trump&#x27;s top negotiators in recent weeks as the sides traded draft peace plans and continued to shape a proposal to end the fighting.Zelenskyy told reporters on Friday that the 20-point draft proposal negotiators have discussed is \"about 90 per cent ready\" — echoing a figure, and the optimism, that US officials conveyed when Trump&#x27;s chief negotiators met with Zelenskyy in Berlin earlier this month.During the recent talks, the US agreed to offer certain security guarantees to Ukraine similar to those offered to other members of NATO. The proposal came as Zelenskyy said he was prepared to drop his country&#x27;s bid to join the security alliance if Ukraine received NATO-like protection that would be designed to safeguard it against future Russian attacks.&#x27;Intensive&#x27; weeks aheadZelenskyy also spoke on Christmas Day with US special envoy Steve Witkoff and Jared Kushner, Trump&#x27;s son-in-law. The Ukrainian leader said they discussed \"certain substantive details\" and cautioned \"there is still work to be done on sensitive issues\" and \"the weeks ahead may also be intensive.\"The US president has been working to end the war in Ukraine for much of his first year back in office, showing irritation with both Zelenskyy and Putin while publicly acknowledging the difficulty of ending the conflict. Long gone are the days when, as a candidate in 2024, he boasted that he could resolve the fighting in a day.After hosting Zelenskyy at the White House in October, Trump demanded that both Russia and Ukraine halt fighting and \"stop at the battle line,\" implying that Moscow should be able to keep the territory it has seized from Ukraine.Zelenskyy said last week that he would be willing to withdraw troops from Ukraine&#x27;s eastern industrial heartland as part of a plan to end the war, if Russia also pulls back and the area becomes a demilitarised zone monitored by international forces.Kremlin spokesman Dmitry Peskov told reporters Friday that the Kremlin had already been in contact with US.\"It was agreed upon to continue the dialogue,\" he said.Putin wants Russian gains kept, and morePutin has publicly said he wants all the areas in four key regions that have been captured by his forces, as well as the Crimean Peninsula, illegally annexed in 2014, to be recognised as Russian territory. He also has insisted that Ukraine withdraw from some areas in eastern Ukraine that Moscow&#x27;s forces haven&#x27;t captured. Kyiv has publicly rejected all those demands.The Kremlin also wants Ukraine to abandon its bid to join NATO. It warned that it wouldn&#x27;t accept the deployment of any troops from members of the military alliance and would view them as a \"legitimate target.\"Putin also has said Ukraine must limit the size of its army and give official status to the Russian language, demands he has made from the outset of the conflict.Putin&#x27;s foreign affairs adviser, Yuri Ushakov, told the business daily Kommersant this month that Russian police and national guard would stay in parts of Donetsk -– one of the two major areas, along with Luhansk, that make up the Donbas region — even if they become a demilitarised zone under a prospective peace plan.Ushakov cautioned that trying to reach a compromise could take a long time. He said US proposals that took into account Russian demands had been \"worsened\" by alterations proposed by Ukraine and its European allies.Trump has been somewhat receptive to Putin&#x27;s demands, making the case that the Russian president can be persuaded to end the war if Kyiv agrees to cede Ukrainian land in the Donbas region and if Western powers offer economic incentives to bring Russia back into the global economy.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/b15f34d4-e3ec-48dc-860e-5b92748f209d"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/trump-zelenskyy-meet-in-us-20251229-p5nqfh.html",
          "published_at": "Mon, 29 Dec 2025 06:33:29 +1100",
          "title": "Trump, Zelenskyy meet in US",
          "standfirst": "US President Donald Trump and Ukrainian President Volodymyr Zelenskyy are meeting in the US to discuss a peace plan to end the war with Russia.",
          "content": "US President Donald Trump and Ukrainian President Volodymyr Zelenskyy are meeting in the US to discuss a peace plan to end the war with Russia.",
          "feed_position": 14,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/7d8060e68f4a896b3b7f0b213eab20048f7dfdec"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/russia-ukraine-conflict-updates-russia-launches-mass-attack-on-kyiv-ahead-of-trump-zelenskyy-peace-talks/8b8a9c20-a221-4536-a422-671cf4f7deeb",
          "published_at": "Sat, 27 Dec 2025 12:42:12 +0000",
          "title": "Russia launches mass attack on Kyiv ahead of Trump-Zelenskyy peace talks",
          "standfirst": "Russia launched a large-scale overnight attack on Kyiv after Ukraine&#x27;s President Volodymyr Zelenskyy said he plans to meet his US counterpart Donald Trump in Florida Sunday.",
          "content": "Russia launched a large-scale overnight attack on Kyiv after Ukraine&#x27;s President Volodymyr Zelenskyy said he plans to meet his US counterpart Donald Trump in Florida Sunday, as efforts continue to end the nearly four-year war in Eastern Europe.The aerial attack killed at least one person – a 71-year-old – and injured 32 more, including two children, according to Kyiv police.Kyiv&#x27;s mayor Vitali Klitschko said more than 2600 residential buildings are currently without heating, as well as 187 kindergartens, 138 schools and 22 social institutions in the capital, amid freezing temperatures.READ MORE: At least 15 injured in a knife and chemical attack at a factory in Japan The attack lasted nearly 10 hours in total, making it one of the longest of the year.Speaking on board a plane bound for the United States Saturday, Zelenskyy repeated calls for the bolstering of Ukraine&#x27;s air defences, saying the country needed more missiles amid Russia&#x27;s relentless attacks. \"The support of Europeans is important to us today. We do not have enough additional air defence systems,\" he said.Ahead of meeting Trump, Zelenskyy is stopping in Canada for talks with President Mark Carney.On Friday, Zelenskyy told reporters that the 20-point peace plan hammered out by Ukrainian and US officials is \"90 per cent ready\" and that he planned to discuss with Trump how Ukraine&#x27;s allies could guarantee its security in the future.Trump said in an interview with Politico that he expects the meeting to \"go good,\" but cautioned that Zelenskyy \"doesn&#x27;t have anything until I approve it\". He added that he also expects to speak with Russian President Vladimir Putin \"soon, as much as I want\".In total, Russia launched nearly 500 drones and 40 missiles at Ukraine overnight, Zelenskyy said on Saturday morning, adding that while Russian officials are engaging in talks to end fighting, the ongoing violence speaks for itself.The most recent strikes primarily targeted energy and civilian infrastructure in the capital city, Kyiv, Zelenskyy said.\"In some districts of the capital and the region, electricity and heating are currently unavailable,\" he said. \"Firefighting efforts are underway.\"A CNN reporter in the capital heard attack drones flying overhead and a series of explosions early on Saturday, when Air Force warnings were in place.Fires broke out across the city, engulfing a car repair shop and several residential buildings, and forcing elderly residents to evacuate a care home as flames spread, according to Kyiv Emergency Service.Pointing to Russia&#x27;s recent engagement in talks with US representatives to end fighting in the country, Zelenskyy wrote on X in the wake of the attack that \"Russian representatives engage in lengthy talks, but in reality, Kinzhals and &#x27;shaheds&#x27; speak for them.\"He added, \"This is the true attitude of Putin and his inner circle.\"In response to the attacks, Poland scrambled fighter jets and temporarily closed two airports, Reuters reported, citing a post by the Polish Air Navigation Services Agency on X.The shutdowns of Rzeszow and Lublin airports, in the country&#x27;s southeast, were triggered by \"unplanned military activity related to ensuring state security,\" according to a Notice to Airmen (NOTAM) posted on the US Federal Aviation Administration&#x27;s website.US officials said they were hopeful that Sunday&#x27;s Zelenskyy-Trump meeting would be productive after a week of intensive efforts between US and Ukrainian negotiators. While officials did not cite a specific goal for the meeting, Zelenskyy told Axios on Friday that he wanted to conclude a framework to end the war.The meeting is not expected to include any European leaders, according to US and European officials. However, European Commission President Ursula von der Leyen will join a call on Saturday with Zelenskyy, Trump and other European leaders, a commission spokesperson told Reuters.The Ukrainians have been pushing for a meeting between Zelenskyy and Trump for months, European officials said. The Europeans expect a positive meeting because they describe the current dynamic between the US and Ukraine as productive. Still, they acknowledge that the outcome of any meeting with Trump is unpredictable.\"There is no low-risk scenario with Trump,\" said one NATO official.In preparation for Sunday&#x27;s meeting, Zelenskyy said on Friday that he had spoken with the leaders of NATO, Canada, Germany, Finland, Denmark and Estonia to coordinate their positions. \"Ukraine has never been and will never be an obstacle to peace, and we will continue working efficiently to ensure all necessary documents are prepared as quickly as possible,\" he said.Zelenskyy&#x27;s announcement comes after he offered to compromise on some of the thorniest issues that have so far stalled the US-mediated peace process with Russia. It is not clear, however, whether Zelenskyy&#x27;s concessions will satisfy the Kremlin.Asked about Zelenskyy&#x27;s potential willingness to consider territorial concessions for a peace deal, Kremlin spokesperson Dmitry Peskov told CNN that \"giving up the rest of Donetsk could contribute significantly.\"The initial 28-point peace plan, which emerged in November following talks between the United States and Russia, was criticised by Ukraine&#x27;s allies as heavily favouring Moscow. Following weeks of talks between Ukrainian and US officials, that draft has been slimmed down to the current 20-point plan, which Zelenskyy has said can serve as a \"foundational document on ending the war.\"Latest on peace negotiationsZelenskyy told reporters that Ukraine had not received an official response from the Kremlin to the latest proposal. He said Kyiv is negotiating exclusively with Washington, which in turn is communicating with Moscow.If Russia does not agree to the peace plan drafted by Ukraine and the United States, Zelenskyy suggested that more should be done to force Moscow&#x27;s hand. \"If Ukraine shows its position, it is constructive – and Russia, for example, does not agree, then the (existing) pressure is not enough,\" Zelenskyy said, adding that he wants to discuss this with Trump.Russia&#x27;s central demands are for Ukraine to abandon its ambition to join NATO – which was a distant prospect before Moscow launched its all-out invasion of the country in February 2022 – and for Kyiv&#x27;s military to withdraw fully from Ukraine&#x27;s eastern Donetsk and Luhansk regions, a vast area known as the Donbas. It was here that the Kremlin started destabilising Ukraine in 2014, helping pro-Russian separatists gain control of most of the area. The Donbas was eventually illegally annexed by Russia in September 2022.Zelenskyy has offered concessions on both issues. During a wide-ranging press conference on Tuesday to discuss the new 20-point peace plan, Zelenskyy said Ukraine was seeking security guarantees from its allies that would \"mirror\" NATO&#x27;s Article 5 – which requires all members to defend any member that has come under attack – but would no longer pursue full membership of the military alliance.Zelenskyy also said Ukraine would be willing to withdraw its troops from parts of the Donetsk region not currently occupied by Russian forces. The Ukrainian leader said any withdrawal of troops would have to be reciprocal, with Moscow giving up as much Ukrainian territory as that ceded by Kyiv and those pockets of the Donbas becoming demilitarised as a result. Earlier this month, Zelenskyy noted that US negotiators wanted these territories to become \"free economic zones\" once all troops were withdrawn.Ukraine&#x27;s constitution requires any changes to the country&#x27;s borders to be approved in a referendum. Zelenskyy reiterated on Friday that \"the fate of Ukraine should be decided by the people of Ukraine\" and said Ukraine&#x27;s allies \"have enough power to force Russia or to negotiate with the Russians\" to ensure that any such plebiscite could be carried out safely.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 17,
          "image_url": "https://prod.static9.net.au/fs/ad886ff9-30ca-462d-85e9-112040fb03c7"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.4113%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/a06ac50ccd04f70ea69e32d2882b263b8c44863c",
      "popularity_score": 2019.7268691666666
    },
    {
      "id": "cluster_8",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 08:58:15 +1100",
      "title": "Flood, rain warnings in place in Queensland",
      "neutral_headline": "Flood, rain warnings in place in Queensland",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/flood-rain-warnings-in-place-in-queensland-20251229-p5nqge.html",
          "published_at": "Mon, 29 Dec 2025 08:58:15 +1100",
          "title": "Flood, rain warnings in place in Queensland",
          "standfirst": "A huge monsoon trough is bringing heavy rain to northern Queensland, with warnings of life-threatening floods.",
          "content": "A huge monsoon trough is bringing heavy rain to northern Queensland, with warnings of life-threatening floods.",
          "feed_position": 6,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/b3735081157406937e01ae5e624ddaa0522fd699"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/queensland-weather-monsoon-trough-to-bring-up-to-600mm-of-rainfall/48edbd5f-a5c6-4348-b9de-6a9ff9e1da2d",
          "published_at": "Sun, 28 Dec 2025 21:34:57 +0000",
          "title": "Life-threatening floods warned as Queensland braces for downpour",
          "standfirst": "T he system is expected to strengthen as it moves from the north-west to the south-east over the coming days.",
          "content": "Queenslanders have been urged to prepare for life-threatening flash flooding with hundreds of millimetres of rain forecast in the coming days.A severe weather warning is in place for practically the entirety of the state&#x27;s north, from the Gulf of Carpentaria to the east coast.Six-hourly total s of up to 260mm are possible, with almost 200mm falling in the six hours to 8pm overnight at South Mission Beach.READ MORE: &#x27;We demand answers&#x27;: Bondi victims&#x27; families scathing letter to PM The risk of flash flooding will be heaviest today between Cairns and Townsville, but flood warnings are in place for about 20 catchments in North Queensland.The weather system has drawn comparisons to the devastating 2019 flood events, with the SES now deploying in readiness.\"This does look comparable to rainfall we had in early 2019, where we saw around 400mm to 700mm, particularly inland to the north-east of Mount Isa,\" Shane Kennedy from the Bureau of Meteorology said.The Bureau of Meteorology said the monsoon trough contains a low-pressure system, which is expected to continue strengthening as it moves from the northwest to the southeast from tonight into next week.It is forecast to batter Cairns, Innisfail, Tully, Ingham, Mount Isa, Cloncurry, Burketown, Mornington Island, Normanton, Doomadgee, Richmond, Julia Creek, Camooweal and Croydon. READ MORE: What the weather will be like in your city on New Year&#x27;s EveThe system could cause heavy rainfall of up to 260mm, which could cause flash flooding between Cairns and north of Townsville from tonight into tomorrow.And up to 170mm and flash flooding are forecast in parts of the Gulf Country, Northern Goldfields and Upper Flinders, North West and Central West Forecast Districts.Meanwhile, in the northeast tropical coast, winds are picking up speed and damage.Together, the monsoon trough and winds are expected to spur widespread heavy rainfall.In the 24 hours to 9am today, 217mm of rainfall was already recorded in Cardwell Gap, making it the wettest place in Australia. Consequently, there are flood warnings in place for the Nicholson, Leichhardt, Norman, Gilbert and Diamantin catchments and flood watches for much of the state.The Gregory River in northwest Queensland is already at major flood levels.Senior meteorologist Jonathan How warned conditions could continue for a prolonged time and particularly affect outback and remote communities.\"Heavy rainfall will lead to road closures and community isolation, and this could last for quite some period of time, especially for outback and more remote communities as well,\" he said.\"We are expecting impacts to agriculture, particularly to cattle and livestock, with low temperatures and flood waters expected to last for an extended period of time.\"READ MORE: Over a dozen Aussies charged and 92 children rescued over &#x27;horrific&#x27; operation in the PhilippinesHow said rainfall totals will climb over 300mm through the western parts of the state tomorrow and could reach beyond 600mm by Wednesday.\"We are expecting those four-day totals to reach in excess of, even breaching, 700 millimetres,\" he said.\"And rainfall won&#x27;t end there.\"The monsoon trough and low will then continue to move across the eastern parts of Queensland.The Bureau of Meteorology will have a clearer understanding of where the rainfall is expected later next week. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 8,
          "image_url": "https://prod.static9.net.au/fs/7ca34b68-83ca-421f-b373-494473a99681"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/b3735081157406937e01ae5e624ddaa0522fd699",
      "popularity_score": 2018.6413136111112
    },
    {
      "id": "cluster_16",
      "coverage": 2,
      "updated_at": "Sun, 28 Dec 2025 21:00:28 +0000",
      "title": "One dead after two helicopters collide midair",
      "neutral_headline": "One dead after two helicopters collide midair",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/new-jersey-helicopter-crash-two-dead-after-midair-collision/ef54d83f-c302-409e-872f-08781851b0f7",
          "published_at": "Sun, 28 Dec 2025 21:00:28 +0000",
          "title": "One dead after two helicopters collide midair",
          "standfirst": "Flames engulfed one of the chopper&#x27;s after it crashed into the ground following the collision.",
          "content": "Two helicopters crashed midair in southern New Jersey in the US on Sunday (Monday AEDT), leaving one person dead and leaving another fighting for life.The aircraft, an Enstrom F-28A and an Enstrom 280C helicopter, \"collided in mid-air\" about 11.25am near Hammonton Municipal Airport, the Federal Aviation Administration said.Only the pilots were on board the helicopters when they collided, according to the statement.READ MORE: Marilyn&#x27;s retirement fund and her husband&#x27;s life insurance payout were drained without warning in devastating super collapse Hammonton Police Chief Kevin Friel told the Associated Press responding crews extinguished flames that engulfed one of the helicopters.The helicopters came down in a field in Hammonton and both victims were flown to the trauma centre, Hammonton Fire Department Chief Sean Macri told CNN.The National Transportation Safety Board will lead the investigation into the crash.READ MORE: Trump, Zelenskyy meet in Florida as US confirms call with Putin Investigators will likely first look to review any communications between the two pilots and whether they were able to see each other, said Alan Diehl, a former crash investigator for the FAA and NTSB.\"Virtually all midair collisions are a failure to what they call &#x27;see and avoid&#x27;,\" Diehl said.\"Clearly they&#x27;ll be looking at the out-of-cockpit views of the two aircraft and seeing if one pilot was approaching from the blind side.\"Although it was mostly cloudy at the time of the crash, winds were light and visibility was good, according to the weather forecasting company AccuWeather.Hammonton, located in Atlantic County, is about 56km from Philadelphia and sits near the New Jersey Pine Barrens, a vast area of forested wilderness.The Hammonton Fire Department has asked bystanders to avoid the area while emergency services respond to the incident.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/6ca0018b-7c71-4b82-8de1-d905362cf0cd"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/one-dead-after-midair-helicopter-collision-20251229-p5nqfr.html",
          "published_at": "Mon, 29 Dec 2025 07:27:15 +1100",
          "title": "One dead after midair helicopter collision",
          "standfirst": "One person is dead and another is fighting for life after two helicopters collided in midair in southern New Jersey.",
          "content": "One person is dead and another is fighting for life after two helicopters collided in midair in southern New Jersey.",
          "feed_position": 10,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/ab9360c8d4019169fa04ba259901d47e9d027982"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/6ca0018b-7c71-4b82-8de1-d905362cf0cd",
      "popularity_score": 2017.6782580555555
    },
    {
      "id": "cluster_31",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 06:21:44 +1100",
      "title": "‘Normal, happy family’: Two dead, man charged with murder following Sydney stabbing",
      "neutral_headline": "Man charged over alleged domestic violence double murder in Sydney",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/nsw/two-dead-man-arrested-after-sydney-stabbing-20251228-p5nqcx.html",
          "published_at": "Mon, 29 Dec 2025 06:21:44 +1100",
          "title": "‘Normal, happy family’: Two dead, man charged with murder following Sydney stabbing",
          "standfirst": "Anaseini Waqavuki, 38, has been identified as one of the victims in what police are treating as a domestic violence incident.",
          "content": "Anaseini Waqavuki, 38, has been identified as one of the victims in what police are treating as a domestic violence incident.",
          "feed_position": 15,
          "image_url": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_198/t_crop_custom/q_86%2Cf_auto/86fa5b980e67c5eada34bf454f03611a8d24688d"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/quakers-hill-stabbing-woman-killed-man-fighting-for-life-another-man-arrested-sydney/a1b0aa29-ffd0-40eb-a879-79ebe69a7d4f",
          "published_at": "Sun, 28 Dec 2025 08:57:32 +0000",
          "title": "Man charged over alleged domestic violence double murder in Sydney",
          "standfirst": "A man has been charged with two counts of murder after a woman and her partner were allegedly stabbed to death in north-west Sydney this morning.",
          "content": "A man has been charged with two counts of murder after a woman and her partner were allegedly stabbed to death in north-west Sydney this morning.Police are investigating whether the incident is a love triangle gone wrong, with the 47-year-old accused a former partner of the 38-year-old woman. Just before 5am, emergency services were called to a home in Illabo Street in Quakers Hill after reports of a disturbance.READ MORE: Soccer coach, children missing after tour boat sinks in IndonesiaPolice found a 30-year-old man on the footpath who had suffered apparent stab wounds to his stomach and hands.The man was taken to Liverpool Hospital in a critical condition but he died from his injuries later this morning. He is yet to be identified. The woman, Anasaini Waqavuki, was found dead inside the home, allegedly stabbed to death in the kitchen.Police said Waqavuki was previously in a relationship with the alleged killer, and they are working on the belief the incident is domestic violence-related. READ MORE: Russia hits Kyiv in deadly strike a day before key Trump-Zelenksyy meetingSuperintendent Jason Joyce said the scene was challenging for police and paramedics.\"It was a very traumatic incident,\" he said.\"Very sad in terms of the time of the year, my sympathy goes out to the family of the deceased.\"Very confronting for my police and emergency services that attended. Obviously not a nice thing to see.\"Neighbours recalled hearing screams coming from the home in the early hours of the morning but were shocked by the news.\"They seemed to be happy, she was always laughing, they seemed like a normal, happy family,\" neighbour Wayne Spalding said. The 47-year-old man was arrested after he handed himself in to Blacktown Police Station about 5.30am and was charged with two counts of murder this evening.He&#x27;s been denied bail and will front court tomorrow.Multiple crime scenes have been declared, including at the Illabo Street home and at a service station in Woodcroft, where a knife used in the alleged attack was located.A crime scene has also been declared at a home in Blacktown, where the suspect lives, and at Liverpool Hospital.Police have urged any witnesses or anyone with CCTV or dashcam footage between 4.30am and 5.30am to contact Crime Stoppers.Support is available from the National Sexual Assault, Domestic and Family Violence Counselling Service at 1800RESPECT (1800 737 732).DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 7,
          "image_url": "https://prod.static9.net.au/fs/afde1776-e16d-4bed-90ee-ab750d0a9886"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_198/t_crop_custom/q_86%2Cf_auto/86fa5b980e67c5eada34bf454f03611a8d24688d",
      "popularity_score": 2016.0327025
    },
    {
      "id": "cluster_32",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 06:20:17 +1100",
      "title": "Kyrgios beats Sabalenka in exhibition clash",
      "neutral_headline": "Kyrgios beats Sabalenka in exhibition clash",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/sport/tennis/kyrgios-beats-sabalenka-in-exhibition-clash-20251229-p5nqfe.html",
          "published_at": "Mon, 29 Dec 2025 06:20:17 +1100",
          "title": "Kyrgios beats Sabalenka in exhibition clash",
          "standfirst": "Nick Kyrgios defeats women's world No.1 Aryna Sabalenka in the latest version of Battle of the Sexes.",
          "content": "Nick Kyrgios defeats women's world No.1 Aryna Sabalenka in the latest version of Battle of the Sexes.",
          "feed_position": 16,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/8901565bdf1c7fa85899389ff5837eb316d605d3"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/nick-kyrgios-aryna-sabalenka-battle-of-the-sexes-live-blog/106182808",
          "published_at": "Sun, 28 Dec 2025 14:33:28 +0000",
          "title": "'Happy it's over': Kyrgios defeats Sabalenka in new 'battle of the sexes'",
          "standfirst": "Australia's Nick Kyrgios defeated women's world number one Aryna Sabalenka in the latest \"battle of the sexes\". The Aussie, who has fallen outside the ATP top 600 after barely playing for three years, won 6-3, 6-3.",
          "content": "Australia's Nick Kyrgios defeated women's world number one Aryna Sabalenka in the latest \"battle of the sexes\". The Aussie, who has fallen outside the ATP top 600 after barely playing for three years, won 6-3, 6-3.",
          "feed_position": 4
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/8901565bdf1c7fa85899389ff5837eb316d605d3",
      "popularity_score": 2016.0085358333333
    },
    {
      "id": "cluster_1",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 23:03:04 +0000",
      "title": "Debate about colouring old films is not black and white",
      "neutral_headline": "Debate about colouring old films is not black and white",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-29/revitalising-vintage-films/105721412",
          "published_at": "Sun, 28 Dec 2025 23:03:04 +0000",
          "title": "Debate about colouring old films is not black and white",
          "standfirst": "Would those classic black-and-white films be the same if viewed in full colour?",
          "content": "Would those classic black-and-white films be the same if viewed in full colour?",
          "feed_position": 0
        }
      ],
      "popularity_score": 352.7215913888889
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 22:41:00 +0000",
      "title": "How food security was shored up in FNQ this flood season",
      "neutral_headline": "How food security was shored up in FNQ this flood season",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-29/flooded-roads-cause-food-insecurity-in-far-north-queensland/106176990",
          "published_at": "Sun, 28 Dec 2025 22:41:00 +0000",
          "title": "How food security was shored up in FNQ this flood season",
          "standfirst": "Across northern Queensland, intense rainfall is triggering multiple warnings and flooding roads. Earlier this year, a once-in-a-century flood devastated Ingham and cut the main supply route between Cairns and Townsville. Communities are now taking steps to prevent another food shortage.",
          "content": "Across northern Queensland, intense rainfall is triggering multiple warnings and flooding roads. Earlier this year, a once-in-a-century flood devastated Ingham and cut the main supply route between Cairns and Townsville. Communities are now taking steps to prevent another food shortage.",
          "feed_position": 1
        }
      ],
      "popularity_score": 350.3538136111111
    },
    {
      "id": "cluster_27",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:33:37 +0000",
      "title": "Zelenskyy says progress made on peace deal, but Trump says 'thorny issues' remain",
      "neutral_headline": "Zelenskyy says progress made on peace deal, but Trump says 'thorny issues' remain",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/trump-meets-zelenskyy-to-discuss-ukraine-peace-plan/106183658",
          "published_at": "Sun, 28 Dec 2025 19:33:37 +0000",
          "title": "Zelenskyy says progress made on peace deal, but Trump says 'thorny issues' remain",
          "standfirst": "Volodymyr Zelenskyy says a security guarantee between Ukraine and the US as part of a peace deal is \"100 per cent agreed\", while Donald Trump says there are still one or two \"thorny issues\" to finalise in the deal.",
          "content": "Volodymyr Zelenskyy says a security guarantee between Ukraine and the US as part of a peace deal is \"100 per cent agreed\", while Donald Trump says there are still one or two \"thorny issues\" to finalise in the deal.",
          "feed_position": 0
        }
      ],
      "popularity_score": 349.23075805555555
    },
    {
      "id": "cluster_13",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 21:27:45 +0000",
      "title": "Broome residents told to prepare as cyclone forms off WA's north",
      "neutral_headline": "Broome residents told to prepare as cyclone forms off WA's north",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/cyclone-hayley-forms-off-wa-coast-broome-in-watch-zone/106182876",
          "published_at": "Sun, 28 Dec 2025 21:27:45 +0000",
          "title": "Broome residents told to prepare as cyclone forms off WA's north",
          "standfirst": "Residents in WA's north are on alert following the formation of Tropical Cyclone Hayley off the coast overnight.",
          "content": "Residents in WA's north are on alert following the formation of Tropical Cyclone Hayley off the coast overnight.",
          "feed_position": 2
        }
      ],
      "popularity_score": 331.1329802777778
    },
    {
      "id": "cluster_18",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 20:31:07 +0000",
      "title": "Certainty in the rearview mirror as 2025 economy goes wild",
      "neutral_headline": "Certainty in the rearview mirror as 2025 economy goes",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/end-of-year-economics-analysis-wrap/106176480",
          "published_at": "Sun, 28 Dec 2025 20:31:07 +0000",
          "title": "Certainty in the rearview mirror as 2025 economy goes wild",
          "standfirst": "This year saw economies survive tariff shocks and markets burst through record highs, but it doesn't feel like a party because so many people aren't invited.",
          "content": "This year saw economies survive tariff shocks and markets burst through record highs, but it doesn't feel like a party because so many people aren't invited.",
          "feed_position": 3
        }
      ],
      "popularity_score": 330.18909138888887
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:30:58 +0000",
      "title": "After Sarah Larcombe fell off Arapiles, healing her bones was just the beginning",
      "neutral_headline": "After Sarah Larcombe fell off Arapiles, healing her bones was just the beginning",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/sarah-larcombe-paraclimbing-injury-arapiles-world-championships/106018328",
          "published_at": "Sun, 28 Dec 2025 18:30:58 +0000",
          "title": "After Sarah Larcombe fell off Arapiles, healing her bones was just the beginning",
          "standfirst": "When Sarah Larcombe fell off Mount Arapiles in February, she thought she just sprained her ankle. What followed was months of ups and downs ending in a stunning world championships result.",
          "content": "When Sarah Larcombe fell off Mount Arapiles in February, she thought she just sprained her ankle. What followed was months of ups and downs ending in a stunning world championships result.",
          "feed_position": 5
        }
      ],
      "popularity_score": 298.18659138888887
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:33:27 +0000",
      "title": "NGOs fear life-saving aid program blockage in Gaza under new Israeli rules",
      "neutral_headline": "NGOs fear life-saving aid program blockage in Gaza under new Israeli rules",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/aid-agencies-fear-lifesaving-program-blockage-into-gaza-/106181964",
          "published_at": "Sun, 28 Dec 2025 18:33:27 +0000",
          "title": "NGOs fear life-saving aid program blockage in Gaza under new Israeli rules",
          "standfirst": "The Israeli government has introduced new rules for aid organisations, including that they must not engage in any activities or criticism which \"delegitimise\" the state of Israel.",
          "content": "The Israeli government has introduced new rules for aid organisations, including that they must not engage in any activities or criticism which \"delegitimise\" the state of Israel.",
          "feed_position": 6
        }
      ],
      "popularity_score": 288.22798027777776
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:47:19 +0000",
      "title": "'Pesky Aussie laws' comment sparks scrutiny of weight-loss treatment marketing",
      "neutral_headline": "'Pesky Aussie laws' comment sparks scrutiny of weight-loss treatment marketing",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/juniper-telehealth-concerns-weight-loss-treatment-glp1/106114626",
          "published_at": "Sun, 28 Dec 2025 19:47:19 +0000",
          "title": "'Pesky Aussie laws' comment sparks scrutiny of weight-loss treatment marketing",
          "standfirst": "Eating disorder bodies are raising concerns about weight-loss treatments being prescribed by telehealth companies, one of which ran a Black Friday sale to promote its services.",
          "content": "Eating disorder bodies are raising concerns about weight-loss treatments being prescribed by telehealth companies, one of which ran a Black Friday sale to promote its services.",
          "feed_position": 7
        }
      ],
      "popularity_score": 279.4590913888889
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:01:01 +0000",
      "title": "Caravan customers furious ASIC ignored whistleblower before collapse",
      "neutral_headline": "Caravan customers furious ASIC ignored whistleblower before collapse",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/furious-customers-asic-whistleblower-zone-rv-caravan-collapse/106169334",
          "published_at": "Sun, 28 Dec 2025 19:01:01 +0000",
          "title": "Caravan customers furious ASIC ignored whistleblower before collapse",
          "standfirst": "Anger is growing after revelations the corporate watchdog failed to investigate allegations against luxury caravan manufacturer Zone RV.",
          "content": "Anger is growing after revelations the corporate watchdog failed to investigate allegations against luxury caravan manufacturer Zone RV.",
          "feed_position": 8
        }
      ],
      "popularity_score": 268.6874247222222
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:26:08 +0000",
      "title": "'Beat them by a minute': Nervous wait for overall Sydney to Hobart winner",
      "neutral_headline": "'Beat them by a minute': Nervous wait for overall Sydney to Hobart winner",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/sydney-to-hobart-yacht-race-enters-day-four/106183294",
          "published_at": "Sun, 28 Dec 2025 19:26:08 +0000",
          "title": "'Beat them by a minute': Nervous wait for overall Sydney to Hobart winner",
          "standfirst": "The yacht race has entered the fourth day, after Master Lock Comanche claimed line honours late on Sunday.",
          "content": "The yacht race has entered the fourth day, after Master Lock Comanche claimed line honours late on Sunday.",
          "feed_position": 9
        }
      ],
      "popularity_score": 265.10603583333335
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 20:11:44 +0000",
      "title": "Low voter turnout for first Myanmar elections since military coup",
      "neutral_headline": "Low voter turnout for first Myanmar elections since military coup",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/voter-turnout-low-myanmar-first-election-2020/106183648",
          "published_at": "Sun, 28 Dec 2025 20:11:44 +0000",
          "title": "Low voter turnout for first Myanmar elections since military coup",
          "standfirst": "Myanmar's election has been widely dismissed as a sham by many governments and human rights activists who have said the military will use proxy candidates to legitimise their rule.",
          "content": "Myanmar's election has been widely dismissed as a sham by many governments and human rights activists who have said the military will use proxy candidates to legitimise their rule.",
          "feed_position": 17
        }
      ],
      "popularity_score": 161.86603583333334
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 20:04:26 +0000",
      "title": "Northern and western Queenslanders warned to prepare for significant flooding",
      "neutral_headline": "Northern and western Queenslanders warned to prepare for significant flooding",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/northern-and-western-queensland-brace-for-flooding/106183228",
          "published_at": "Sun, 28 Dec 2025 20:04:26 +0000",
          "title": "Northern and western Queenslanders warned to prepare for significant flooding",
          "standfirst": "Intense rainfall across the north and west of Queensland is forecast to cause widespread flooding with damaging winds and risks to livestock.",
          "content": "Intense rainfall across the north and west of Queensland is forecast to cause widespread flooding with damaging winds and risks to livestock.",
          "feed_position": 20
        }
      ],
      "popularity_score": 157.74436916666667
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:32:25 +0000",
      "title": "Drink driver crashes car into living room of house in Melbourne's west",
      "neutral_headline": "Drink driver crashes car into living room of house in Melbourne's west",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/drink-driver-crashes-car-into-house-kurunjang/106183644",
          "published_at": "Sun, 28 Dec 2025 19:32:25 +0000",
          "title": "Drink driver crashes car into living room of house in Melbourne's west",
          "standfirst": "A 24-year-old man was taken to hospital after crashing his car into a house in Kurunjang. He failed a breath test at the scene.",
          "content": "A 24-year-old man was taken to hospital after crashing his car into a house in Kurunjang. He failed a breath test at the scene.",
          "feed_position": 16
        }
      ],
      "popularity_score": 155.21075805555554
    },
    {
      "id": "cluster_14",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 21:21:38 +0000",
      "title": "This queer Perth boxing class is a hit in tackling loneliness",
      "neutral_headline": "This queer Perth boxing class is a hit in tackling loneliness",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/lgbtqia-boxing-class-tackling-loneliness/106034550",
          "published_at": "Sun, 28 Dec 2025 21:21:38 +0000",
          "title": "This queer Perth boxing class is a hit in tackling loneliness",
          "standfirst": "One in three adults experience social isolation in what experts say is a \"dangerous\" issue in society. One suburban boxing group is working to tackle the issue, focused on the LGBTQIA+ community more at risk of loneliness.",
          "content": "One in three adults experience social isolation in what experts say is a \"dangerous\" issue in society. One suburban boxing group is working to tackle the issue, focused on the LGBTQIA+ community more at risk of loneliness.",
          "feed_position": 18
        }
      ],
      "popularity_score": 151.03103583333333
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 21:12:29 +0000",
      "title": "Half of Canberra's beehives could be wiped out in two years. Here's why",
      "neutral_headline": "Half of Canberra's beehives could be wiped out in two years. Here's why",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/act-varroa-mite-wipe-out-half-bees-two-years/106148658",
          "published_at": "Sun, 28 Dec 2025 21:12:29 +0000",
          "title": "Half of Canberra's beehives could be wiped out in two years. Here's why",
          "standfirst": "A fast-spreading parasite is expected to devastate local bee colonies over the next two years, affecting commercial and backyard crops.",
          "content": "A fast-spreading parasite is expected to devastate local bee colonies over the next two years, affecting commercial and backyard crops.",
          "feed_position": 12
        }
      ],
      "popularity_score": 150.87853583333333
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:49:54 +0000",
      "title": "'More than just tea and scones': Why young members are joining city's CWA",
      "neutral_headline": "'More than just tea and scones': Why young members are joining city's CWA",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/country-womens-association-cwa-in-sydney-young-women-joining/105941208",
          "published_at": "Sun, 28 Dec 2025 19:49:54 +0000",
          "title": "'More than just tea and scones': Why young members are joining city's CWA",
          "standfirst": "More young women are joining the Country Women's Association's city branches, with a passion for jams and scones along with social connection and purpose.",
          "content": "More young women are joining the Country Women's Association's city branches, with a passion for jams and scones along with social connection and purpose.",
          "feed_position": 22
        }
      ],
      "popularity_score": 149.50214694444443
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:02:12 +0000",
      "title": "Experiment shows uncertain future for courtesy wave",
      "neutral_headline": "Experiment shows uncertain future for courtesy wave",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/australian-drivers-truckies-courtesy-wave/106152822",
          "published_at": "Sun, 28 Dec 2025 19:02:12 +0000",
          "title": "Experiment shows uncertain future for courtesy wave",
          "standfirst": "For generations, the courtesy wave has been etched into the Australian culture, but is it on the verge of dying?",
          "content": "For generations, the courtesy wave has been etched into the Australian culture, but is it on the verge of dying?",
          "feed_position": 11
        }
      ],
      "popularity_score": 148.70714694444445
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:34:19 +0000",
      "title": "Inside Big Ben, a London icon that's been ringing since 1859",
      "neutral_headline": "Inside Big Ben, a London icon that's been ringing since 1859",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/inside-big-ben-the-bell-ringing-in-new-years-day/106172402",
          "published_at": "Sun, 28 Dec 2025 18:34:19 +0000",
          "title": "Inside Big Ben, a London icon that's been ringing since 1859",
          "standfirst": "It's among the world's most photographed landmarks, a symbol of the United Kingdom and an engineering marvel. And for London's Big Ben the most important night of the year is fast approaching.",
          "content": "It's among the world's most photographed landmarks, a symbol of the United Kingdom and an engineering marvel. And for London's Big Ben the most important night of the year is fast approaching.",
          "feed_position": 14
        }
      ],
      "popularity_score": 148.2424247222222
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:30:00 +0000",
      "title": "Quiz: How well do you remember this week in history?",
      "neutral_headline": "Quiz: How well do you remember this week in history",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/this-week-in-history-quiz-december-29/106174918",
          "published_at": "Sun, 28 Dec 2025 18:30:00 +0000",
          "title": "Quiz: How well do you remember this week in history?",
          "standfirst": "Test your knowledge with questions about Shane Warne, Frank Sinatra and Australia's first stamp.",
          "content": "Test your knowledge with questions about Shane Warne, Frank Sinatra and Australia's first stamp.",
          "feed_position": 13
        }
      ],
      "popularity_score": 148.17048027777778
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:22:30 +0000",
      "title": "Why a growing number of older women are living out their surf dream",
      "neutral_headline": "Why a growing number of older women are living out their surf dream",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/older-women-surfing-trends/105867538",
          "published_at": "Sun, 28 Dec 2025 18:22:30 +0000",
          "title": "Why a growing number of older women are living out their surf dream",
          "standfirst": "When Katie Pahlow turned 60, she decided to finally bite the bullet and book herself in for some surf lessons.",
          "content": "When Katie Pahlow turned 60, she decided to finally bite the bullet and book herself in for some surf lessons.",
          "feed_position": 15
        }
      ],
      "popularity_score": 148.04548027777778
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 20:20:22 +0000",
      "title": "Travis Head not fazed on opening role in future",
      "neutral_headline": "Travis Head not fazed on opening role in future",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/australias-travis-head-not-fazed-on-opening-role-in-future/106183666",
          "published_at": "Sun, 28 Dec 2025 20:20:22 +0000",
          "title": "Travis Head not fazed on opening role in future",
          "standfirst": "Australia star Travis Head says he is not precious about continuing to open the batting beyond this Ashes and will bat wherever the coaches tell him to.",
          "content": "Australia star Travis Head says he is not precious about continuing to open the batting beyond this Ashes and will bat wherever the coaches tell him to.",
          "feed_position": 19
        }
      ],
      "popularity_score": 147.00992472222222
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 10:38:18 +0000",
      "title": "Brigitte Bardot, the French star you 'had to see to believe'",
      "neutral_headline": "Brigitte Bardot, the French star you 'had to see to believe'",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/brigitte-bardot-sex-symbol-fashion-darling-and-french-icon/105927998",
          "published_at": "Sun, 28 Dec 2025 10:38:18 +0000",
          "title": "Brigitte Bardot, the French star you 'had to see to believe'",
          "standfirst": "Few epitomised French chic like Brigitte Bardot, the doe-eyed beauty whose sensuality rocked a post-war world.",
          "content": "Few epitomised French chic like Brigitte Bardot, the doe-eyed beauty whose sensuality rocked a post-war world.",
          "feed_position": 10
        }
      ],
      "popularity_score": 140.3088136111111
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 03:43:29 +0000",
      "title": "SA independent MP Nick McBride charged with assault",
      "neutral_headline": "SA independent MP Nick McBride charged with assault",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/sa-independent-mp-nick-mcbride-charged/106182668",
          "published_at": "Sun, 28 Dec 2025 03:43:29 +0000",
          "title": "SA independent MP Nick McBride charged with assault",
          "standfirst": "Police say they responded to reports of a domestic assault at a home in South Australia's south-east on Saturday.",
          "content": "Police say they responded to reports of a domestic assault at a home in South Australia's south-east on Saturday.",
          "feed_position": 23
        }
      ],
      "popularity_score": 133.3952025
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 02:41:42 +0000",
      "title": "MCC boss defends curator Matt Page after two-day Ashes Test",
      "neutral_headline": "MCC boss defends curator Matt Page after two-day Ashes Test",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/mcc-boss-defends-curator-after-two-day-ashes-test/106182802",
          "published_at": "Sun, 28 Dec 2025 02:41:42 +0000",
          "title": "MCC boss defends curator Matt Page after two-day Ashes Test",
          "standfirst": "MCC boss Stuart Fox staunchly defends chief curator Matt Page after a wild Boxing Day Test finishes within two days.",
          "content": "MCC boss Stuart Fox staunchly defends chief curator Matt Page after a wild Boxing Day Test finishes within two days.",
          "feed_position": 21
        }
      ],
      "popularity_score": 133
    }
  ]
}