{
  "updated_at": "2025-08-26T07:19:07.940Z",
  "clusters": [
    {
      "id": "cluster_0",
      "coverage": 5,
      "updated_at": "Tue, 26 Aug 2025 17:16:13 +1000",
      "title": "Australia news LIVE: PM reveals Iran behind two antisemitic attacks in Melbourne, Sydney; Australia Post temporarily suspends US deliveries",
      "neutral_headline": "Australia Expels Iranian Ambassador Over Antisemitic Attacks",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/australia-news-live-at-least-20-killed-in-twin-gaza-strikes-10-million-telco-clampdown-looming-20250826-p5mprx.html",
          "published_at": "Tue, 26 Aug 2025 17:16:13 +1000",
          "title": "Australia news LIVE: PM reveals Iran behind two antisemitic attacks in Melbourne, Sydney; Australia Post temporarily suspends US deliveries",
          "standfirst": "Follow live as we bring you the news from Australia and beyond.",
          "content": "Follow live as we bring you the news from Australia and beyond.",
          "feed_position": 0,
          "image_url": "https://static.ffx.io/images/$zoom_0.2388%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/e68e3a0c291051dc312c5cd757e6bfcec8ec1cc9"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/26/iran-ambassador-expelled-australia-antisemitic-attacks-ntwnfb",
          "published_at": "Tue, 26 Aug 2025 07:03:47 GMT",
          "title": "Iranian ambassador expelled over ‘credible intelligence’ Iran directed antisemitic attacks on Australian soil",
          "standfirst": "Australia’s spy agency finds Iran behind incidents including arson attack on Adass Israel Synagogue in MelbourneFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIran directed at least two attacks against Australia’s Jewish community, the domestic spy agency has determined, prompting the Albanese government to expel Tehran’s ambassador to Canberra from Australia.The prime minister announced on Tuesday that the Australian Security and Intelligence Organisation (Asio) had “credible intelligence” to determine the Iranian government was behind the attacks against the Adass Israel synagogue in Melbourne and Lewis’s Continental Kitchen in Bondi in Sydney. Continue reading...",
          "content": "Australia’s spy agency finds Iran behind incidents including arson attack on Adass Israel Synagogue in MelbourneFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIran directed at least two attacks against Australia’s Jewish community, the domestic spy agency has determined, prompting the Albanese government to expel Tehran’s ambassador to Canberra from Australia.The prime minister announced on Tuesday that the Australian Security and Intelligence Organisation (Asio) had “credible intelligence” to determine the Iranian government was behind the attacks against the Adass Israel synagogue in Melbourne and Lewis’s Continental Kitchen in Bondi in Sydney. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/26/iran-directed-arson-attacks-in-australia-spy-chief-says-ntwnfb",
          "published_at": "Tue, 26 Aug 2025 06:48:01 GMT",
          "title": "Iran directed arson attacks in Australia and ‘fanned the flames’ of antisemitism, country’s spy chief says",
          "standfirst": "Iranian ambassador expelled from Canberra as Albanese government announces it will list IRGC as terrorist organisationThe Iranian government “lit the matches and fanned the flames” of antisemitism in Australia, directing at least two arson attacks in the last year – on a Melbourne synagogue and a Sydney Jewish restaurant – Australia’s spy chief has said.The Islamic Revolutionary Guard Corps (IRGC), Tehran’s paramilitary defenders of the 1979 revolution, will be proscribed by Australia as a terrorist organisation. Continue reading...",
          "content": "Iranian ambassador expelled from Canberra as Albanese government announces it will list IRGC as terrorist organisationThe Iranian government “lit the matches and fanned the flames” of antisemitism in Australia, directing at least two arson attacks in the last year – on a Melbourne synagogue and a Sydney Jewish restaurant – Australia’s spy chief has said.The Islamic Revolutionary Guard Corps (IRGC), Tehran’s paramilitary defenders of the 1979 revolution, will be proscribed by Australia as a terrorist organisation. Continue reading...",
          "feed_position": 5
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/politics/federal/iran-suspected-of-involvement-in-synagogue-arson-attack-20250826-p5mpx8.html",
          "published_at": "Tue, 26 Aug 2025 16:08:38 +1000",
          "title": "‘Extraordinary and dangerous acts’: Iran blamed for two antisemitic attacks on Australian soil",
          "standfirst": "Iran’s ambassador to Australia has been expelled and the Australian embassy in Tehran shuttered after the stunning revelation.",
          "content": "Iran’s ambassador to Australia has been expelled and the Australian embassy in Tehran shuttered after the stunning revelation.",
          "feed_position": 16,
          "image_url": "https://static.ffx.io/images/$zoom_0.23200267567948174%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_101%2C$y_75/t_crop_custom/q_86%2Cf_auto/beee02ec1bfd715d2c0751c0bf8c39492c8a1ddc"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/iran-orchestrated-at-least-two-antisemitic-attacks-in-australia-anthony-albanese-says/d0cede9a-6c94-4f68-b86d-29099be3f514",
          "published_at": "Tue, 26 Aug 2025 05:24:35 +0000",
          "title": "Iran orchestrated at least two antisemitic attacks on Australian soil: PM",
          "standfirst": "The prime minister has expelled the ambassador and declared the Islamic Revolutionary Guard as a terrorist organisation.",
          "content": "Iran orchestrated at least two alleged antisemitic firebombings on Australian soil last year by hiring criminals to do their bidding, in what authorities described as an \"unprecedented attack\".Prime Minister Anthony Albanese said spy agency ASIO has determined Iran was behind the fires that gutted the Lewis&#x27; Continental Kitchen in Sydney on October 20 and the Adass Israel Synagogue in Melbourne on December 6.Iran&#x27;s Ambassador to Australia, Ahmad Sadeghi, as well as three other Iranian officials, have been expelled, the Australian embassy in Tehran has been closed, and Iran&#x27;s Revolutionary Guard Corps (IRGC) will be declared a terrorist organisation.READ MORE: Police officer injured, grave fears for two others after shooting at rural property Today was the first time Canberra has declared a foreign ambassador persona non grata since the end of World War II. \"These were extraordinary and dangerous acts of aggression orchestrated by a foreign nation on Australian soil,\" Albanese said.\"They were attempts to undermine social cohesion and sow discord in our community.\"ASIO Director-General Mike Burgess said his investigation uncovered links between the two incidents and the IRGC.\"The IRGC used a complex web of proxies to hide its involvement,\" he said.The IRGC was found to have used people in the criminal world to direct these alleged attacks, some of whom were paid to do so.\"It&#x27;s a series of chains,\" Burgess said.\"There&#x27;s an organised crime element offshore in this, but that&#x27;s not to suggest organised crime are doing it. \"They&#x27;re just using cut-outs.\" ASIO is currently investigating Iran&#x27;s potential involvement in a number of other attacks.Home Affairs Minister Tony Burke said Iran&#x27;s actions were an \"unprecedented attack\" on Australia.\"It&#x27;s aimed at creating fear, stoking internal divisions, and eroding social cohesion. It&#x27;s true that no one was injured in these attacks, it&#x27;s not true that no one was harmed,\" he said.READ MORE: Former cop to plead not guilty to double murder Australia expels ambassador, pulls out of Iran Australia has notified Iran&#x27;s Ambassador to Australia, Ahmad Sadeghi, and three other Iranian officials that they have been expelled and have seven days to leave Australia. No Iranian diplomats have been accused of being directly involved in the two attacks.The last ambassador to be expelled was Japan&#x27;s Tatsuo Kawai in 1942, a year after Australia declared war on Japan.Australia has suspended operations at its embassy in Tehran, with all staff pulled from the country. All diplomats are safe in a third country.Albanese announced his government will introduce legislation to list the Revolutionary Guard as a terrorist organisation.\"Any attack on our social cohesion is an attack on Australia,\" he said.\"We are proud of the country that we&#x27;ve built. A country where people can live overwhelmingly side by side of different faith, of different background, in harmony.\"We cherish it. We protect it. We defend it. And that&#x27;s what we&#x27;re doing here today.\"The opposition supported the federal government&#x27;s measures in parliament.\"These acts of egregious foreign interference are brazen attempts to cleave apart our social cohesion, to turn neighbour against neighbour and Australian against Australian,\" Opposition Leader Sussan Ley said. \"While we sit opposite the government in this chamber, we&#x27;re entirely united on the measures announced today to expel the Iranian ambassador and list the Iranian Revolutionary Guard Corps as a terrorist organisation.\" READ MORE: Millions thrown at preparing for deadly outbreak that will &#x27;almost certainly&#x27; reach AustraliaAustralians told to leave IranForeign Minister Penny Wong acknowledged that it was a distressing time for Australia.\"I know many Australians have family connections in Iran, but I urge any Australian who may be considering travelling to Iran, please do not do so,\" she said.\"If you&#x27;re an Australian in Iran, leave now if it is safe to do so.\"The Department of Foreign Affairs has updated its travel advice for Iran, urging Australians not to travel and to leave the country.\" Foreigners in Iran, including Australians and dual Australian-Iranian nationals, are at a high risk of arbitrary detention or arrest,\" a statement from Smarttraveller said.\"Our ability to provide consular assistance in Iran is extremely limited.\"Australians in need of consular assistance should call the Australian Government 24-hour Consular Emergency Centre on 1300 555 135 in Australia or +61 2 6261 3305 outside Australia.READ MORE: Australia put on notice by Donald Trump&#x27;s latest tech tariff threatAustralian Jewish community feeling &#x27;great anxiety&#x27; NSW Jewish Board of Deputies president David Ossip said today&#x27;s announcement was \"chilling and deeply concerning\".\"It is difficult to overstate the significance of this unprecedented news,\" he said.\"These incidents were nothing less than an attack on Australia by a foreign state, primarily targeting the Jewish community and designed to unravel our social cohesion by legitimising and normalising attacks on the Jewish community.\"Ossip said the community had been gaslit about the extent of the threat against them.\"Those who sought to downplay the threat against the Jewish community or dismiss the campaign of terror targeting our community as a criminal con-job or hoax owe the Jewish community an apology,\" he said.Executive Council of Australian Jewry president Daniel Aghion said the community may find some solace in the breakthrough.\"Yet there will be great anxiety that we have been targeted in such a callous and calculated way, by a ruthless and violent foreign force, because of who we are,\" he said. READ MORE: &#x27;This is a wake-up call&#x27;: Australia breaks tragic drowning recordThe incidents Iran orchestrated in AustraliaLewis&#x27; Continental Kitchen in Sydney was destroyed in an alleged firebombing on October 20.Former Nomads bikie boss Sayed Moosawi, 32, was one of more than a dozen people charged over two alleged antisemitic attacks, including the one on Lewis&#x27; Continental Kitchen.Police alleged he set the deli alight after the two criminals he hired to do his bidding wrongly targeted a nearby brewery.Moosawi has denied the allegations against him and remains before the court.NSW Premier Chris Minns said state police will work closely with federal agencies to ensure the safety of places of worship, businesses, and community members. \"Our message is clear: hate has no place in NSW, and those who seek to divide us will not succeed,\" he said off the back of today&#x27;s announcement. The Adass Israel Synagogue in Melbourne was also gutted after a firebombing on December 6, rocking the local Jewish community.Two men, 20 and 21, were charged with deliberately setting fire to the building. A third man, 20, was charged with stealing a car used to drive to the synagogue. Investigations remain ongoing, and the trio are set to face court.No one was injured in either incident, but millions of dollars in damages were caused. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/91d9383d-4c9a-4a70-80c2-b8e0a9c65f1e"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/iran-behind-antisemitic-attacks-asio-says/105697762",
          "published_at": "Tue, 26 Aug 2025 03:16:46 +0000",
          "title": "Australia expels Iranian ambassador after ASIO says it directed antisemitic attacks",
          "standfirst": "Iran was behind at least two antisemitic attacks on Australian soil, ASIO believes.",
          "content": "Iran was behind at least two antisemitic attacks on Australian soil, ASIO believes.",
          "feed_position": 22
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/26/victoria-child-safety-laws-working-with-children-wwcc-what-we-know-ntwnfb",
          "published_at": "Tue, 26 Aug 2025 00:43:51 GMT",
          "title": "Victoria will fast-track new child safety laws as part of a system ‘overhaul’. Here’s what we know",
          "standfirst": "The power to immediately suspend an individual’s working with children check during an investigation is among changes expected to pass parliament this weekFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAuthorities in Victoria will have the power to immediately suspend an individual’s working with children check during an investigation, under new laws to be fast-tracked through the parliament this week.The premier, Jacinta Allan, said the laws, to be introduced to parliament on Tuesday, were just one part of an “overhaul” of the child safety system in the state, after a review by the former South Australian premier Jay Weatherill and the senior bureacrat Pamela White. Continue reading...",
          "content": "The power to immediately suspend an individual’s working with children check during an investigation is among changes expected to pass parliament this weekFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAuthorities in Victoria will have the power to immediately suspend an individual’s working with children check during an investigation, under new laws to be fast-tracked through the parliament this week.The premier, Jacinta Allan, said the laws, to be introduced to parliament on Tuesday, were just one part of an “overhaul” of the child safety system in the state, after a review by the former South Australian premier Jay Weatherill and the senior bureacrat Pamela White. Continue reading...",
          "feed_position": 6
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/federal-politics-live-aug-26-prime-minister-albanese-penny-wong/105695890",
          "published_at": "Mon, 25 Aug 2025 21:26:33 +0000",
          "title": "Live: PM joins ABC blog to answer your questions after bombshell Iranian attacks intelligence",
          "standfirst": "Prime Minister Anthony Albanese says the Iranian government has directed antisemitic attacks on Australian soil. Follow live.",
          "content": "Prime Minister Anthony Albanese says the Iranian government has directed antisemitic attacks on Australian soil. Follow live.",
          "feed_position": 0
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/26/consultancy-firms-win-nearly-1bn-australia-contracts-research-shows",
          "published_at": "Mon, 25 Aug 2025 15:00:06 GMT",
          "title": "Consultancy firms win nearly $1bn in Australian contracts in past year despite new outsourcing rules, research shows",
          "standfirst": "Greens senator Barbara Pocock says figures do not match Labor government’s rhetoric about cutting back on use of consultantsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe federal government signed contracts worth almost $1bn with consultants last financial year – a 48% increase on the previous one – despite committing to slash their use, according to research conducted by the parliamentary library.The analysis, commissioned by the Greens, shows that while the value of contracts with the big four consultancy firms fell from $138m to $114m, contracts with all firms increased from $653m to $968m. Continue reading...",
          "content": "Greens senator Barbara Pocock says figures do not match Labor government’s rhetoric about cutting back on use of consultantsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe federal government signed contracts worth almost $1bn with consultants last financial year – a 48% increase on the previous one – despite committing to slash their use, according to research conducted by the parliamentary library.The analysis, commissioned by the Greens, shows that while the value of contracts with the big four consultancy firms fell from $138m to $114m, contracts with all firms increased from $653m to $968m. Continue reading...",
          "feed_position": 8
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/26/australian-university-arts-degrees-to-cost-50000-until-at-least-2027",
          "published_at": "Mon, 25 Aug 2025 15:00:06 GMT",
          "title": "Arts degrees to cost $50,000 until at least 2027 despite Albanese reform promises, vice-chancellor says",
          "standfirst": "Australia needs critical thinkers who develop ‘philosophy about the world’ by studying the arts, university warnsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastStudents will be paying $50,000 for arts degrees until at least 2027, says one university vice-chancellor, despite the Albanese government labelling the controversial job-ready graduates scheme (JRG) that included an increase to some fees a “failure” and promising to reform it.The Morrison government program increased the price of university degrees including arts, humanities and law, while reducing the cost for Stem degrees including mathematics and essential worker degrees including teaching and nursing. Continue reading...",
          "content": "Australia needs critical thinkers who develop ‘philosophy about the world’ by studying the arts, university warnsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastStudents will be paying $50,000 for arts degrees until at least 2027, says one university vice-chancellor, despite the Albanese government labelling the controversial job-ready graduates scheme (JRG) that included an increase to some fees a “failure” and promising to reform it.The Morrison government program increased the price of university degrees including arts, humanities and law, while reducing the cost for Stem degrees including mathematics and essential worker degrees including teaching and nursing. Continue reading...",
          "feed_position": 9
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.2388%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/e68e3a0c291051dc312c5cd757e6bfcec8ec1cc9",
      "popularity_score": 5019.951405833333,
      "ai_summary": [
        "Australia expelled Iran's ambassador due to Iran's involvement in antisemitic attacks.",
        "The Australian Security and Intelligence Organisation found Iran directed the attacks.",
        "The attacks included arson on a synagogue and a Jewish restaurant.",
        "The government will list the IRGC as a terrorist organization.",
        "The Iranian ambassador was expelled from Canberra."
      ]
    },
    {
      "id": "cluster_3",
      "coverage": 3,
      "updated_at": "Tue, 26 Aug 2025 17:09:32 +1000",
      "title": "Victoria Police shooting LIVE updates: Two officers shot dead and one wounded after ambush in High Country",
      "neutral_headline": "Two Police Officers Dead After Shooting in Rural Victoria",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/victoria-police-shooting-live-updates-one-officer-shot-and-two-others-missing-after-ambush-in-high-country-20250826-p5mpwv.html",
          "published_at": "Tue, 26 Aug 2025 17:09:32 +1000",
          "title": "Victoria Police shooting LIVE updates: Two officers shot dead and one wounded after ambush in High Country",
          "standfirst": "Two officers are dead and another wounded after a shooting at a rural property in Porepunkah, about 300 kilometres north-east of Melbourne. Follow our live updates.",
          "content": "Two officers are dead and another wounded after a shooting at a rural property in Porepunkah, about 300 kilometres north-east of Melbourne. Follow our live updates.",
          "feed_position": 3,
          "image_url": "https://static.ffx.io/images/$zoom_0.1293%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_28/t_crop_custom/q_86%2Cf_auto/dc275b50a4669f59455480778372abc230be01a23d36f0529bd0bd5d6e770df5"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/two-police-officers-dead-and-another-injured-after-shooting-in-rural-victoria-20250826-p5mq1g.html",
          "published_at": "Tue, 26 Aug 2025 17:07:01 +1000",
          "title": "Two police officers dead and another injured after shooting in rural Victoria",
          "standfirst": "Two police officers are dead and another wounded after being shot on a property in Porepunkah, in north-eastern Victoria.",
          "content": "Two police officers are dead and another wounded after being shot on a property in Porepunkah, in north-eastern Victoria.",
          "feed_position": 4,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/7a3dac422dddd3f683270b459f96af4d6ead6511"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/live/2025/aug/26/porepunkah-shooting-live-updates-victoria-police-active-incident-latest-news-ntwnfb",
          "published_at": "Tue, 26 Aug 2025 07:05:36 GMT",
          "title": "Victoria police shooting live updates: ‘Significant search’ underway for alleged offender after two officers dead, one injured while executing search warrant at rural property",
          "standfirst": "Follow live updatesPorepunkah shooting: two Victoria police officers dead, one injured in attack at rural propertyWhat we know so far about the shooting in rural AustraliaWangaratta police have confirmed there is still an “active incident” ongoing and are continuing to urge people to avoid the area.In a statement published to its social media page a moment ago, the local police service said Victoria police “continues to respond to an incident at a property in Porepunkah”.This is still an active incident and we will provide more information when it’s operationally safe to do so.We ask people avoid the area.Tonight’s Ordinary Council Meeting has also been postponed, and will be rescheduled for two weeks’ time. Further details will be provided at a later date.We thank you for your patience and understanding. Continue reading...",
          "content": "Follow live updatesPorepunkah shooting: two Victoria police officers dead, one injured in attack at rural propertyWhat we know so far about the shooting in rural AustraliaWangaratta police have confirmed there is still an “active incident” ongoing and are continuing to urge people to avoid the area.In a statement published to its social media page a moment ago, the local police service said Victoria police “continues to respond to an incident at a property in Porepunkah”.This is still an active incident and we will provide more information when it’s operationally safe to do so.We ask people avoid the area.Tonight’s Ordinary Council Meeting has also been postponed, and will be rescheduled for two weeks’ time. Further details will be provided at a later date.We thank you for your patience and understanding. Continue reading...",
          "feed_position": 0
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/26/victoria-police-shooting-what-we-know-so-far-ntwnfb",
          "published_at": "Tue, 26 Aug 2025 07:02:22 GMT",
          "title": "Victoria police shooting – what we know so far",
          "standfirst": "Two police officers have been killed and another wounded at a shooting in the regional Victorian town of Porepunkah, about 300km north-east of Melbourne, AustraliaVictoria police shooting live updatesPorepunkah shooting: two police officers dead, one injured in attackGet our breaking news email, free app or daily news podcastTwo police officers have been killed and another wounded at a shooting in the Victorian town of Porepunkah, which is home to about 1,000 people. Continue reading...",
          "content": "Two police officers have been killed and another wounded at a shooting in the regional Victorian town of Porepunkah, about 300km north-east of Melbourne, AustraliaVictoria police shooting live updatesPorepunkah shooting: two police officers dead, one injured in attackGet our breaking news email, free app or daily news podcastTwo police officers have been killed and another wounded at a shooting in the Victorian town of Porepunkah, which is home to about 1,000 people. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/victorian-police-commissioner-confirms-two-officers-shot-dead-20250826-p5mq1d.html",
          "published_at": "Tue, 26 Aug 2025 16:59:24 +1000",
          "title": "Victorian police commissioner confirms two officers shot dead",
          "standfirst": "Victorian police commissioner confirms two officers shot dead in Porepunkah",
          "content": "Victorian police commissioner confirms two officers shot dead in Porepunkah",
          "feed_position": 9,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/4e8215e2e8f2009b07e9ffeaa25ab04d64304beb"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/officer-shot-and-two-missing-after-ambush-at-alpine-property-20250826-p5mpw4.html",
          "published_at": "Tue, 26 Aug 2025 16:51:38 +1000",
          "title": "Porepunkah shooting: Two officers dead and another wounded after shooting at High Country property",
          "standfirst": "The alleged gunman, believed to be a self-proclaimed “sovereign citizen”, is on the run with family members, including children.",
          "content": "The alleged gunman, believed to be a self-proclaimed “sovereign citizen”, is on the run with family members, including children.",
          "feed_position": 10,
          "image_url": "https://static.ffx.io/images/$zoom_0.7337176842684269%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_110%2C$y_146/t_crop_custom/q_86%2Cf_auto/d9b1c928c6a9a088678b7365ffb8dd2e92b829e3"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/porepunkah-victoria-police-shooting-live-updates-latest-news-headlines/7dcdf6e1-5c00-4554-8d22-cc74f2e1f007",
          "published_at": "Tue, 26 Aug 2025 06:11:12 +0000",
          "title": "Two officers killed, one injured in shooting at rural Victorian property",
          "standfirst": "The suspect is still on the run, police say.",
          "content": "The suspect is still on the run, police say.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/cf6b94a5-9038-4c16-8f0b-55a0df2795e5"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/porepunkah-victoria-police-officer-shooting-at-rural-property/fdd5dcce-fb0f-4c32-9d6a-2910db764fe7",
          "published_at": "Tue, 26 Aug 2025 06:09:34 +0000",
          "title": "What we know about the fatal police shooting in Porepunkah",
          "standfirst": "Locals have been told to stay indoors after two officers were killed and a third wounded on a property in Porepunkah, near Bright.",
          "content": "Two police officers have been killed and a third has been injured in a shooting on a rural property in north-east Victoria. It is understood one officer was shot in the thigh while serving a warrant for historical sex abuse allegations at a home in Porepunkah in Victoria&#x27;s alpine region, located around 300km from Melbourne.Two other officers, who were initially unaccounted for, have died.LIVE UPDATES: Search for gunman after police officers shot dead The accused gunman, a so-called sovereign citizen, is still on the run, and is believed to have family members with him.Here is what we know so far. What happened?Police were at a rural property in Porepunkah this morning to execute a warrant for historical sex abuse allegations, when the ambush unfolded.An urgent call for assistance was made from the property about 10.55am.What exactly happened next is unknown, but two police officers have died.A third police officer has been airlifted to The Alfred Hospital with serious lower body injuries.His condition is unknown but it is understood he was shot in the thigh.Police officers from the Special Operations Group have headed to the property, according to the police union.\"The Police Association Victoria is aware of a critical incident that has unfolded in northeastern Victoria impacting our members.\" a spokesperson said.\"We have sent critical incident support teams to the area to assist and support the impacted members, their families and colleagues.\"A Porepunkah local told 9News she heard two or three gunshots ring out between 9.30 and 10.30am.The woman said she thought the gunfire had come from deer hunters, but thought it was strange for people to be hunting in daylight.Where is Porepunkah?Porepunkah is located on the Great Alpine Road, at the foot of Mount Buffalo, about 300km north-east of Melbourne.The remoteness of the town means police resources are currently limited. It has a population of 1024, according to the 2021 Census.The nearest town, Bright, is located 5km away. Is the situation still active?The gunman remains on the run and there are reports there are several family members, including children, with him.In an updated statement, Wangaratta Police said police are still responding to an \"active incident\" at a property in Porepunkah.Roadblocks have been established in and out of the town, meaning some locals are unable to return home. What is the advice in the local area? Locals have been asked to stay indoors as the incident unfolds.\"Police are currently at a property in Porepunkah,\" Victoria Police said in a statement.\"This is still an active incident and we will provide more information when it&#x27;s operationally safe to do so.\"We ask people to avoid the area. \"Porepunkah Primary School has been put into lockdown.The principal told The Age th e children were all fine and watching movies to pass the time.READ MORE: Australia Post suspends deliveries to the US after Trump tariffsOne local told 9news.com.au Porepunkah is a \"pretty quiet community\".He said several police cars were seen heading across the town.Alpine Shire Council, the local council servicing Porepunkah, said in a statement it was closing all council facilities \"immediately\".\" This includes all Transfer Stations, Libraries and Visitor Information Centres and Depots across the Shire, Council&#x27;s Customer Service Centre in Bright, and Bright Sports Centre,\" the statement reads.\"Tonight&#x27;s Ordinary Council Meeting has also been postponed, and will be rescheduled for two weeks&#x27; time.\"Further details will be provided at a later date. We thank you for your patience and understanding. We&#x27;ll update the community when our services resume.\"Reactions to the police shootingVictoria Premier Jacinta Allan spoke about the shooting during Question Time in Victorian parliament.Allan urged people to stay away from the scene as police do their job.\"I do ask the Victorian community, particularly those in that beautiful part of the north-east of our state, to follow the advice of Victoria Police and avoid the area,\" she said.Prime Minister Anthony Albanese said he was \"very concerned\" for the police officers involved.\"Our thoughts are with the police for the work they do, each and every day. The men and women who wear our uniform, wear the uniform of the police take risks each and every day,\" the PM told media in Canberra.\"The Victorian Police Commissioner will be providing updates during the afternoon as more facts that are able to be released become clear.\"Australian Federal Police Commissioner Reece Kershaw joined Albanese and said there were \"grave fears\" for the officers as the incident unfolds.\"Just from the police blue family, the wider family across Australia, and overseas, our thoughts and prayers are with Victoria Police right now,\" Kershaw said.\"And we hope that they are all safe and well, however, we&#x27;re hearing there are some grave concerns for some of those police officers and our hearts go out to the community.\"Victoria&#x27;s Opposition Leader Brad Battin told reporters at parliament that events like this \"impact each and every police officer across Victoria and across Australia\".\"We&#x27;re seeing news, tragic news is happening up in the north of Victoria, and we want to send our thoughts and our strength out to Victoria police members who are hearing some of the news coming through at the moment,\" Battin said.\"We know that when Victoria police members get out of bed every day and go to work, they go to work with risk.\"Each and every day, Victoria police members go out in the face of danger.\"Each and every day they know the risks, and today, we want to send out our thanks to all of them, but more importantly, our thoughts to everyone as events unfold up in the north.\"More to come.",
          "feed_position": 8,
          "image_url": "https://prod.static9.net.au/fs/125f697b-2f22-4cf4-86e4-229ba9f084ce"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.1293%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_28/t_crop_custom/q_86%2Cf_auto/dc275b50a4669f59455480778372abc230be01a23d36f0529bd0bd5d6e770df5",
      "popularity_score": 3019.8400169444444,
      "ai_summary": [
        "Two police officers were killed and one wounded in a shooting in Porepunkah, Victoria.",
        "The shooting occurred during the execution of a search warrant.",
        "A \"significant search\" is underway for the alleged offender.",
        "The incident is being treated as an active and ongoing situation.",
        "Local authorities are urging people to avoid the area."
      ]
    },
    {
      "id": "cluster_54",
      "coverage": 2,
      "updated_at": "Tue, 26 Aug 2025 01:42:11 +0000",
      "title": "Former police officer pleads not guilty to murdering Sydney couple",
      "neutral_headline": "Former police officer pleads not guilty to murdering Sydney couple",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/beau-lamarre-condon-pleads-not-guilty-over-alleged-double-murder/105697242",
          "published_at": "Tue, 26 Aug 2025 01:42:11 +0000",
          "title": "Former police officer pleads not guilty to murdering Sydney couple",
          "standfirst": "Beau Lamarre-Condon has been in custody since last February, when he was arrested after attending a Bondi police station following the disappearance of Jesse Baird and Luke Davies.",
          "content": "Beau Lamarre-Condon has been in custody since last February, when he was arrested after attending a Bondi police station following the disappearance of Jesse Baird and Luke Davies.",
          "feed_position": 7
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/beau-lamarre-condon-pleads-not-guilty-to-murders-of-jesse-baird-luke-davies-sydney/73f8698c-aa7b-4d82-8a0b-2525c8097e8e",
          "published_at": "Tue, 26 Aug 2025 01:16:23 +0000",
          "title": "Former cop to plead not guilty to double murder",
          "standfirst": "B eau Lamarre-Condon is accused of the murders of Sydney couple Luke Davies and Jesse Baird in February 2024.",
          "content": "A former police officer will fight accusations he murdered two men with his service weapon, his lawyer says.Beaumont Lamarre-Condon will plead not guilty to two counts of murder over the deaths of flight attendant Luke Davies, 29, and TV presenter Jesse Baird, 26, in February 2024.Lamarre-Condon is accused of shooting the couple at Baird&#x27;s Paddington home in Sydney&#x27;s east, before bundling their bodies in surfboard bags and dumping them at a rural property.READ MORE: Dangerous inmate only cell contact for mushroom killerThey were found after Lamarre-Condon, 29, handed himself in.Today, the former police officer&#x27;s lawyer indicated he would plead not guilty to the murder charges at the Downing Centre Local Court and his matter will proceed to trial.Lamarre-Condon&#x27;s lawyer, Benjamin Archbold, who is his third legal representative in the matter, told the court of the pleas.READ MORE: Australia Post suspends deliveries to the US after Trump tariffsThe former cop, who remains in custody, was initially not on an audiovisual link when Archbold appeared on his behalf.His mother attended court today.The matter was listed for the NSW Supreme Court on October 3.Lamarre-Condon is facing two counts of domestic violence-related murder and aggravated break and enter.READ MORE: &#x27;A lot&#x27; of Americans would &#x27;like a dictator&#x27;, Trump saysNSW Police allege the attack was premeditated and followed a months-long campaign of \"predatory behaviour\" targeting Baird.Lamarre-Condon briefly dated the TV presenter before Baird began a relationship with Davies.Police allege the former senior constable used his service weapon to shoot the couple before attempting to dispose of their bodies.Lamarre-Condon was sacked by the NSW Police Force in March 2024.He joined the force in 2019 and previously ran a celebrity blog, posing in photos with dozens of A-listers including Taylor Swift, Selena Gomez, Katy Perry, Miley Cyrus and Harry Styles.The case was littered with delays before the not guilty pleas were entered.Crown prosecutor Brendan Donnelly had previously opposed further delays in the matter because Lamarre-Condon has had \"plenty of opportunity\" to enter pleas.Charges against the former police officer were certified in July 2024.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/18b9e76a-4b0f-47be-90fa-92a76fbca4e9"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/18b9e76a-4b0f-47be-90fa-92a76fbca4e9",
      "popularity_score": 2014.3841836111112,
      "ai_summary": [
        "Beau Lamarre-Condon has pleaded not guilty to the murders of Luke Davies and Jesse Baird.",
        "He was arrested after attending a Bondi police station in February.",
        "The accused is a former police officer.",
        "The murders occurred in Sydney.",
        "The case involves the disappearance of a couple."
      ]
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 03:22:49 +0000",
      "title": "Live: Police hunt for shooter after officers serving sex crimes warrant shot dead",
      "neutral_headline": "Police hunt for shooter after officers serving sex crimes warrant shot dead",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/blog-porepunkah-shooting-victoria-police-august-26/105698794",
          "published_at": "Tue, 26 Aug 2025 03:22:49 +0000",
          "title": "Live: Police hunt for shooter after officers serving sex crimes warrant shot dead",
          "standfirst": "The public is being asked to avoid the scene, which has been described as an \"active and ongoing incident which may present a significant risk to members of the public\".",
          "content": "The public is being asked to avoid the scene, which has been described as an \"active and ongoing incident which may present a significant risk to members of the public\".",
          "feed_position": 1
        }
      ],
      "popularity_score": 349.06140555555555,
      "ai_summary": [
        "Police are searching for a shooter after officers were shot dead.",
        "The officers were serving a sex crimes warrant.",
        "The incident is described as an active and ongoing situation.",
        "The public is asked to avoid the scene.",
        "The incident presents a significant risk to the public."
      ]
    },
    {
      "id": "cluster_14",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 06:45:03 +0000",
      "title": "Police security officer pleads not guilty to domestic violence charges",
      "neutral_headline": "Police security officer pleads not guilty to domestic violence charges",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/police-security-officer-pleads-not-guilty-to-dv-firearm-charges/105699370",
          "published_at": "Tue, 26 Aug 2025 06:45:03 +0000",
          "title": "Police security officer pleads not guilty to domestic violence charges",
          "standfirst": "A police security officer has pleaded not guilty to three domestic violence-related charges, including an offence which allegedly involved the use of a firearm.",
          "content": "A police security officer has pleaded not guilty to three domestic violence-related charges, including an offence which allegedly involved the use of a firearm.",
          "feed_position": 2
        }
      ],
      "popularity_score": 332.4319613888889,
      "ai_summary": [
        "A police security officer has pleaded not guilty to domestic violence charges.",
        "The charges include an offense involving the use of a firearm.",
        "The case involves domestic violence allegations.",
        "The officer is facing legal proceedings.",
        "The details of the charges are related to domestic violence."
      ]
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 21:22:16 +0000",
      "title": "Australia Post halts most parcel postage to US immediately",
      "neutral_headline": "Australia Post halts most parcel postage to US immediately",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/australia-post-commercial-shipping-suspension-us-tariffs/105696336",
          "published_at": "Mon, 25 Aug 2025 21:22:16 +0000",
          "title": "Australia Post halts most parcel postage to US immediately",
          "standfirst": "Australia Post is taking the extraordinary step of immediately suspending many forms of shipping to the United States, as a Trump administration tariff deadline approaches on Friday.",
          "content": "Australia Post is taking the extraordinary step of immediately suspending many forms of shipping to the United States, as a Trump administration tariff deadline approaches on Friday.",
          "feed_position": 2
        }
      ],
      "popularity_score": 323.0522388888889,
      "ai_summary": [
        "Australia Post is suspending many forms of shipping to the United States.",
        "The suspension is due to an approaching Trump administration tariff deadline.",
        "The move is an extraordinary step by Australia Post.",
        "The suspension affects parcel postage to the US.",
        "The tariff deadline is set for Friday."
      ]
    },
    {
      "id": "cluster_18",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 06:35:37 +0000",
      "title": "82yo former teacher given limited term for child sex offences",
      "neutral_headline": "82yo former teacher given limited term for child sex offences",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/former-teacher-john-ernest-spinks-jailed-historical-sex-abuse/105681658",
          "published_at": "Tue, 26 Aug 2025 06:35:37 +0000",
          "title": "82yo former teacher given limited term for child sex offences",
          "standfirst": "John Ernest Spinks, 85, has been sentenced for sexually abusing three boys between the 1970s and 1990s, and will be referred to the Mental Health Review Tribunal.",
          "content": "John Ernest Spinks, 85, has been sentenced for sexually abusing three boys between the 1970s and 1990s, and will be referred to the Mental Health Review Tribunal.",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.2747391666667,
      "ai_summary": [
        "John Ernest Spinks, 85, was sentenced for sexually abusing three boys.",
        "The abuse occurred between the 1970s and 1990s.",
        "He will be referred to the Mental Health Review Tribunal.",
        "The sentence is for a limited term.",
        "The case involves child sex offenses."
      ]
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 04:38:26 +0000",
      "title": "Prosecutor says phone taps 'revealed Matt Wright's true state of mind' – as it happened",
      "neutral_headline": "Prosecutor discusses phone taps in Matt Wright trial",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/matt-wright-trial-nt-court-prosecution-starts-closing-arguments/105697620",
          "published_at": "Tue, 26 Aug 2025 04:38:26 +0000",
          "title": "Prosecutor says phone taps 'revealed Matt Wright's true state of mind' – as it happened",
          "standfirst": "The prosecution has begun its closing address in the trial of Netflix star Matt Wright, now in its fourth week in the Northern Territory Supreme Court.",
          "content": "The prosecution has begun its closing address in the trial of Netflix star Matt Wright, now in its fourth week in the Northern Territory Supreme Court.",
          "feed_position": 3
        }
      ],
      "popularity_score": 320.32168333333334,
      "ai_summary": [
        "The prosecution presented its closing address in the Matt Wright trial in Northern Territory Supreme Court.",
        "The trial has been ongoing for four weeks, focusing on the Netflix star.",
        "Phone taps were presented as evidence, revealing Wright's state of mind.",
        "The case involves legal proceedings and the interpretation of evidence.",
        "The prosecution is summarizing its case to the court."
      ]
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 06:07:24 +0000",
      "title": "Cricket legend Andrew Symonds honoured with Gold Coast oval",
      "neutral_headline": "Gold Coast oval honors cricket legend Andrew Symonds",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/gold-coast-oval-named-after-cricket-player-andrew-symonds/105697222",
          "published_at": "Tue, 26 Aug 2025 06:07:24 +0000",
          "title": "Cricket legend Andrew Symonds honoured with Gold Coast oval",
          "standfirst": "The legendary all-rounder had a lasting impact on community cricket in the city where he grew up.",
          "content": "The legendary all-rounder had a lasting impact on community cricket in the city where he grew up.",
          "feed_position": 4
        }
      ],
      "popularity_score": 311.8044613888889,
      "ai_summary": [
        "An oval on the Gold Coast will be named in honor of Andrew Symonds.",
        "Symonds had a significant impact on community cricket in the city.",
        "The tribute recognizes his contributions to the sport.",
        "The Gold Coast is where Symonds grew up and played cricket.",
        "The oval will serve as a lasting memorial to the cricket legend."
      ]
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 05:05:16 +0000",
      "title": "ANU admits 'much work to do' while defending leadership, financial position",
      "neutral_headline": "ANU addresses concerns, defends leadership and finances",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/act-anu-defend-position-higher-education-regulator-concerns/105698626",
          "published_at": "Tue, 26 Aug 2025 05:05:16 +0000",
          "title": "ANU admits 'much work to do' while defending leadership, financial position",
          "standfirst": "The Australian National University responds to concerns raised by Australia's higher education regulator after it demanded the university defend the conduct of its council members, while admitting there's \"much work to do\".",
          "content": "The Australian National University responds to concerns raised by Australia's higher education regulator after it demanded the university defend the conduct of its council members, while admitting there's \"much work to do\".",
          "feed_position": 4
        }
      ],
      "popularity_score": 310.76890555555553,
      "ai_summary": [
        "The Australian National University responded to concerns from the higher education regulator.",
        "The regulator requested the university defend its council members' conduct.",
        "ANU admitted there is \"much work to do\" regarding the issues.",
        "The university is addressing its financial position and leadership.",
        "The response follows scrutiny from the Australian higher education regulator."
      ]
    },
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 06:01:16 +0000",
      "title": "With Iran exposed, the regime could now turn its attention to new targets",
      "neutral_headline": "With Iran exposed, the regime could now turn its attention to new targets",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/iran-antisemitic-attacks-asio-intelligence-anthony-albanese/105698844",
          "published_at": "Tue, 26 Aug 2025 06:01:16 +0000",
          "title": "With Iran exposed, the regime could now turn its attention to new targets",
          "standfirst": "Australia's actions in revealing Iran's activities may result in the Islamic Revolutionary Guard Corps turning its attention to new targets.",
          "content": "Australia's actions in revealing Iran's activities may result in the Islamic Revolutionary Guard Corps turning its attention to new targets.",
          "feed_position": 5
        }
      ],
      "popularity_score": 301.7022391666667,
      "ai_summary": [
        "Australia's actions may cause the Islamic Revolutionary Guard Corps to shift focus.",
        "The regime could target new locations or individuals.",
        "The revelation of Iran's activities has consequences.",
        "The situation involves potential shifts in geopolitical strategy.",
        "The focus is on the potential for retaliatory actions."
      ]
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 04:52:30 +0000",
      "title": "ASIC sues Equity Trustees Superannuation for alleged role in $160m investment scheme",
      "neutral_headline": "ASIC sues Equity Trustees Superannuation over investment scheme",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/corporate-watchdog-asic-sues-equity-trustees-superannuation/105698892",
          "published_at": "Tue, 26 Aug 2025 04:52:30 +0000",
          "title": "ASIC sues Equity Trustees Superannuation for alleged role in $160m investment scheme",
          "standfirst": "Over 2023 and 2024, Equity Trustees oversaw the investment of retirement savings into Shield, which collapsed last year.",
          "content": "Over 2023 and 2024, Equity Trustees oversaw the investment of retirement savings into Shield, which collapsed last year.",
          "feed_position": 5
        }
      ],
      "popularity_score": 300.55612777777776,
      "ai_summary": [
        "ASIC is suing Equity Trustees Superannuation for its role in a $160 million investment scheme.",
        "The scheme involved retirement savings invested in Shield.",
        "Shield collapsed last year, leading to the legal action.",
        "Equity Trustees oversaw the investments between 2023 and 2024.",
        "The lawsuit alleges wrongdoing related to the investment scheme."
      ]
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 00:13:20 +0000",
      "title": "Israel's response to killing of journalists highlights Trump's influence",
      "neutral_headline": "Israel's response to killing of journalists highlights Trump's influence",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/netanyahu-comment-on-nasser-hospital-strike-follows-trump-anger/105696672",
          "published_at": "Tue, 26 Aug 2025 00:13:20 +0000",
          "title": "Israel's response to killing of journalists highlights Trump's influence",
          "standfirst": "If you ever need an indication of how quickly utterances from Donald Trump can ricochet from Washington to Jerusalem, his intervention in the latest devastating attack on a hospital in Gaza is a case in point.",
          "content": "If you ever need an indication of how quickly utterances from Donald Trump can ricochet from Washington to Jerusalem, his intervention in the latest devastating attack on a hospital in Gaza is a case in point.",
          "feed_position": 6
        }
      ],
      "popularity_score": 285.90335,
      "ai_summary": [
        "Donald Trump's statements can quickly influence events in Israel.",
        "His intervention in a Gaza hospital attack is a case in point.",
        "The article discusses the impact of Trump's words.",
        "The focus is on the speed of influence from Washington to Jerusalem.",
        "The situation highlights the impact of political figures."
      ]
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 05:34:38 +0000",
      "title": "Eagles get 'everything we want' in Reid, as Harley re-signs until 2028",
      "neutral_headline": "Eagles get 'everything we want' in Reid, as Harley re-signs until 2028",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/harley-reid-re-signs-west-coast-eagles/105699834",
          "published_at": "Tue, 26 Aug 2025 05:34:38 +0000",
          "title": "Eagles get 'everything we want' in Reid, as Harley re-signs until 2028",
          "standfirst": "Harley Reid has signed a contract extension with the West Coast Eagles, with the club securing his services until the end of the 2028 AFL season.",
          "content": "Harley Reid has signed a contract extension with the West Coast Eagles, with the club securing his services until the end of the 2028 AFL season.",
          "feed_position": 7
        }
      ],
      "popularity_score": 281.25835027777777,
      "ai_summary": [
        "Harley Reid has signed a contract extension with the West Coast Eagles.",
        "The contract secures Reid's services until the end of the 2028 AFL season.",
        "The club is pleased with the contract extension.",
        "The deal ensures Reid will remain with the Eagles for several years.",
        "The contract is a significant move for the West Coast Eagles."
      ]
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 03:05:38 +0000",
      "title": "Sussan Ley plays down argument over net zero at Coalition partyroom meeting",
      "neutral_headline": "Sussan Ley downplays net zero argument in Coalition meeting",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/sussan-ley-plays-down-net-zero-argument-partyroom-coalition/105698378",
          "published_at": "Tue, 26 Aug 2025 03:05:38 +0000",
          "title": "Sussan Ley plays down argument over net zero at Coalition partyroom meeting",
          "standfirst": "Opposition Leader Sussan Ley has played down tensions within the Coalition over its position on net zero, after a reportedly chaotic partyroom meeting where a number of MPs argued over the Coalition's climate position.",
          "content": "Opposition Leader Sussan Ley has played down tensions within the Coalition over its position on net zero, after a reportedly chaotic partyroom meeting where a number of MPs argued over the Coalition's climate position.",
          "feed_position": 8
        }
      ],
      "popularity_score": 268.77501666666666,
      "ai_summary": [
        "Sussan Ley played down tensions within the Coalition.",
        "The tensions arose over the Coalition's position on net zero.",
        "The discussion occurred during a partyroom meeting.",
        "Several MPs argued over the climate position.",
        "Ley is attempting to manage internal disagreements."
      ]
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 05:08:37 +0000",
      "title": "NRL clears Smith to play despite impending drug-supply charges",
      "neutral_headline": "NRL clears Smith to play despite drug-supply charges",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/nrl-allows-brandon-smith-rabbitohs-selection-drug-supply-charges/105699414",
          "published_at": "Tue, 26 Aug 2025 05:08:37 +0000",
          "title": "NRL clears Smith to play despite impending drug-supply charges",
          "standfirst": "Brandon Smith is free to play for the South Sydney Rabbitohs next week despite being charged by Queensland police over supplying dangerous drugs.",
          "content": "Brandon Smith is free to play for the South Sydney Rabbitohs next week despite being charged by Queensland police over supplying dangerous drugs.",
          "feed_position": 9
        }
      ],
      "popularity_score": 265.8247391666667,
      "ai_summary": [
        "Brandon Smith is cleared to play for the South Sydney Rabbitohs.",
        "He was charged by Queensland police over supplying dangerous drugs.",
        "The NRL has allowed him to play next week.",
        "The charges do not prevent his participation in the sport.",
        "The decision allows Smith to continue playing."
      ]
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 05:01:00 +0000",
      "title": "Fast-tracked housing approval set to double country town's population",
      "neutral_headline": "Fast-tracked housing approval set to double country town's population",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/riddells-creek-population-to-double-housing-development-macedon/105697374",
          "published_at": "Tue, 26 Aug 2025 05:01:00 +0000",
          "title": "Fast-tracked housing approval set to double country town's population",
          "standfirst": "A 1,360-home housing estate in the Macedon Ranges is approved by the Victorian government, but nearby residents fear it will change the character of their town.",
          "content": "A 1,360-home housing estate in the Macedon Ranges is approved by the Victorian government, but nearby residents fear it will change the character of their town.",
          "feed_position": 11
        }
      ],
      "popularity_score": 160.69779444444444,
      "ai_summary": [
        "A 1,360-home housing estate was approved in the Macedon Ranges.",
        "The Victorian government approved the housing estate.",
        "Nearby residents fear the development will change their town.",
        "The approval is expected to significantly increase the population.",
        "The project involves a large-scale housing development."
      ]
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 07:06:34 +0000",
      "title": "Teenage driver cries as judge jails him over deadly, high-speed crash",
      "neutral_headline": "Teenage driver jailed after deadly, high-speed crash",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/teenage-driver-jailed-over-fatal-burwood-crash/105700096",
          "published_at": "Tue, 26 Aug 2025 07:06:34 +0000",
          "title": "Teenage driver cries as judge jails him over deadly, high-speed crash",
          "standfirst": "A delinquent teenager has been ordered to serve more than seven years behind bars for killing a man in a high-speed crash in Melbourne's south-east last year.",
          "content": "A delinquent teenager has been ordered to serve more than seven years behind bars for killing a man in a high-speed crash in Melbourne's south-east last year.",
          "feed_position": 13
        }
      ],
      "popularity_score": 152.7905725,
      "ai_summary": [
        "A teenage driver was sentenced to over seven years in jail.",
        "The sentence is for a deadly, high-speed crash.",
        "The crash resulted in the death of a man.",
        "The crash occurred in Melbourne's south-east last year.",
        "The judge delivered the sentence to the delinquent teenager."
      ]
    },
    {
      "id": "cluster_10",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 06:59:26 +0000",
      "title": "US Federal Reserve governor refuses to stand down after Trump 'firing'",
      "neutral_headline": "US Federal Reserve governor refuses to stand down after Trump 'firing",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/trump-says-hes-firing-federal-govenor-lisa-cook/105699090",
          "published_at": "Tue, 26 Aug 2025 06:59:26 +0000",
          "title": "US Federal Reserve governor refuses to stand down after Trump 'firing'",
          "standfirst": "US Federal Reserve governor Lisa Cook is refusing to stand down after President Donald Trump said he was firing her.",
          "content": "US Federal Reserve governor Lisa Cook is refusing to stand down after President Donald Trump said he was firing her.",
          "feed_position": 14
        }
      ],
      "popularity_score": 152.67168361111112,
      "ai_summary": [
        "US Federal Reserve governor Lisa Cook is refusing to resign.",
        "Donald Trump said he was firing her from her position.",
        "Cook is maintaining her position despite Trump's statement.",
        "The situation involves a political dispute.",
        "The focus is on the governor's response to Trump's actions."
      ]
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 06:00:58 +0000",
      "title": "This little hardware shop outlasted two Bunnings stores, but now its closing",
      "neutral_headline": "Hardware shop closing after outlasting two Bunnings stores",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/mt-lawley-hardware-shop-closes-perth/105699128",
          "published_at": "Tue, 26 Aug 2025 06:00:58 +0000",
          "title": "This little hardware shop outlasted two Bunnings stores, but now its closing",
          "standfirst": "One of a handful of independent hardware stores remaining in Perth will close its doors in a few weeks, amid tough competition, including from the internet, operators say.",
          "content": "One of a handful of independent hardware stores remaining in Perth will close its doors in a few weeks, amid tough competition, including from the internet, operators say.",
          "feed_position": 17
        }
      ],
      "popularity_score": 151.69723916666666,
      "ai_summary": [
        "An independent hardware store in Perth is closing.",
        "The store has outlasted two Bunnings stores.",
        "The closure is due to tough competition.",
        "Competition includes the internet and other operators.",
        "The store will close in a few weeks."
      ]
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 05:03:02 +0000",
      "title": "NT department fined for destroying sacred tree during road construction",
      "neutral_headline": "NT department fined for destroying sacred tree",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/nt-infrastructure-department-fined-for-destroying-sacred-tree/105695218",
          "published_at": "Tue, 26 Aug 2025 05:03:02 +0000",
          "title": "NT department fined for destroying sacred tree during road construction",
          "standfirst": "The NT Department of Infrastructure and Logistics has been fined $26,000 for destroying a sacred \"lightning tree\" during construction of a road near a remote Central Australian community.",
          "content": "The NT Department of Infrastructure and Logistics has been fined $26,000 for destroying a sacred \"lightning tree\" during construction of a road near a remote Central Australian community.",
          "feed_position": 21
        }
      ],
      "popularity_score": 150.73168333333334,
      "ai_summary": [
        "The NT Department of Infrastructure and Logistics was fined.",
        "The fine is for destroying a sacred \"lightning tree\".",
        "The destruction occurred during road construction.",
        "The road construction was near a remote community.",
        "The fine was $26,000."
      ]
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 04:41:04 +0000",
      "title": "Rio Ngumoha, the English prodigy who's scored a Premier League winner at 16",
      "neutral_headline": "Rio Ngumoha, the English prodigy who's scored a Premier League winner at 16",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/football-rio-ngumoha-liverpool-explainer-chelsea-youth-goal/105698298",
          "published_at": "Tue, 26 Aug 2025 04:41:04 +0000",
          "title": "Rio Ngumoha, the English prodigy who's scored a Premier League winner at 16",
          "standfirst": "Rio Ngumoha officially hits the football mainstream at 16 years of age after scoring a winner minutes into his English Premier League debut for reigning champions Liverpool.",
          "content": "Rio Ngumoha officially hits the football mainstream at 16 years of age after scoring a winner minutes into his English Premier League debut for reigning champions Liverpool.",
          "feed_position": 24
        }
      ],
      "popularity_score": 150.36557222222223,
      "ai_summary": [
        "Rio Ngumoha scored a winning goal in his Premier League debut.",
        "He is 16 years old and plays for Liverpool.",
        "The goal came minutes into his debut.",
        "Ngumoha is now in the football mainstream.",
        "The focus is on his achievement at a young age."
      ]
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 04:12:04 +0000",
      "title": "'I was lucky': How social media helped me find community in my teens",
      "neutral_headline": "Social media aided teen's community search, author reflects",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/how-online-friendships-saved-me-in-my-teens/105681774",
          "published_at": "Tue, 26 Aug 2025 04:12:04 +0000",
          "title": "'I was lucky': How social media helped me find community in my teens",
          "standfirst": "Laura's struggles as a teenager were helped by friendships forged online. She wonders how things would have looked if a social media ban existed then.",
          "content": "Laura's struggles as a teenager were helped by friendships forged online. She wonders how things would have looked if a social media ban existed then.",
          "feed_position": 15
        }
      ],
      "popularity_score": 149.88223888888888,
      "ai_summary": [
        "Laura found online friendships helpful during teenage struggles.",
        "She reflects on how things might have differed with a social media ban.",
        "The article discusses the impact of social media on her life.",
        "It highlights the role of online communities in her development.",
        "The author shares personal experiences and reflections."
      ]
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 04:07:46 +0000",
      "title": "Youngest senator tells parliament something 'I've only told a handful'",
      "neutral_headline": "Youngest senator shares personal experiences in parliament",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/labor-senator-charlotte-walker-makes-candid-speech-to-parliament/105697906",
          "published_at": "Tue, 26 Aug 2025 04:07:46 +0000",
          "title": "Youngest senator tells parliament something 'I've only told a handful'",
          "standfirst": "Australia's youngest senator opens up about her experiences with depression and bullying as well as her concerns about her home state's algal bloom during a passionate and personal speech to federal parliament.",
          "content": "Australia's youngest senator opens up about her experiences with depression and bullying as well as her concerns about her home state's algal bloom during a passionate and personal speech to federal parliament.",
          "feed_position": 15
        }
      ],
      "popularity_score": 149.81057222222222,
      "ai_summary": [
        "Australia's youngest senator discussed depression and bullying.",
        "She expressed concerns about algal blooms in her home state.",
        "The speech was described as passionate and personal.",
        "The senator shared experiences with federal parliament.",
        "She spoke about her experiences with mental health."
      ]
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 03:52:40 +0000",
      "title": "Potato trade restrictions 'likely' as Tasmanian detects second case of virus",
      "neutral_headline": "Potato trade restrictions likely after virus detection",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/potato-mop-top-virus-at-second-tasmanian-site/105697510",
          "published_at": "Tue, 26 Aug 2025 03:52:40 +0000",
          "title": "Potato trade restrictions 'likely' as Tasmanian detects second case of virus",
          "standfirst": "Tracing operations are underway to determine the potential distribution of potato mop-top virus after a second case in a month has been detected in the state.",
          "content": "Tracing operations are underway to determine the potential distribution of potato mop-top virus after a second case in a month has been detected in the state.",
          "feed_position": 23
        }
      ],
      "popularity_score": 149.55890555555555,
      "ai_summary": [
        "Tasmania detected a second case of potato mop-top virus.",
        "Tracing operations are underway to determine distribution.",
        "The virus detection could impact potato trade.",
        "The second case was detected within a month.",
        "Authorities are investigating the spread of the virus."
      ]
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 03:28:09 +0000",
      "title": "Queensland's victims' commissioner resigns after report into DV helpline",
      "neutral_headline": "Queensland victims' commissioner resigns after report",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/qld-victims-commissioner-beck-oconnor-resigns/105697766",
          "published_at": "Tue, 26 Aug 2025 03:28:09 +0000",
          "title": "Queensland's victims' commissioner resigns after report into DV helpline",
          "standfirst": "Beck O'Connor has resigned following a report that laid bare issues at DVConnect during some of her time leading the helpline.",
          "content": "Beck O'Connor has resigned following a report that laid bare issues at DVConnect during some of her time leading the helpline.",
          "feed_position": 18
        }
      ],
      "popularity_score": 149.15029444444446,
      "ai_summary": [
        "Beck O'Connor resigned as victims' commissioner.",
        "The resignation followed a report on DVConnect issues.",
        "The report covered issues during her leadership.",
        "The report highlighted problems at the DV helpline.",
        "O'Connor's resignation was a direct result of the report."
      ]
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 03:25:31 +0000",
      "title": "'Heart-sinking moment' sees Olympic medallist Montag ruled out of world champs",
      "neutral_headline": "Olympic medallist Montag ruled out of world championships",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/athletics-jemima-montag-ruled-out-tokyo-world-championships/105698614",
          "published_at": "Tue, 26 Aug 2025 03:25:31 +0000",
          "title": "'Heart-sinking moment' sees Olympic medallist Montag ruled out of world champs",
          "standfirst": "Jemima Montag makes the tough decision to sit out the World Athletics Championships in Tokyo after having recurring hamstring issues.",
          "content": "Jemima Montag makes the tough decision to sit out the World Athletics Championships in Tokyo after having recurring hamstring issues.",
          "feed_position": 19
        }
      ],
      "popularity_score": 149.10640555555557,
      "ai_summary": [
        "Jemima Montag will miss the World Athletics Championships.",
        "She made the decision due to recurring hamstring issues.",
        "Montag is an Olympic medallist in race walking.",
        "The championships will be held in Tokyo.",
        "The decision was described as a \"heart-sinking moment\"."
      ]
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 03:17:27 +0000",
      "title": "Artificial intelligence targeting short-stay rentals without permits",
      "neutral_headline": "Artificial intelligence targets short-stay rentals without permits",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/hobart-city-council-using-ai-to-clamp-down-on-illegal-airbnb/105697744",
          "published_at": "Tue, 26 Aug 2025 03:17:27 +0000",
          "title": "Artificial intelligence targeting short-stay rentals without permits",
          "standfirst": "A capital city council is employing AI to scrape the internet each day to find every short-term rental — and check if it has been listed without the required permits.",
          "content": "A capital city council is employing AI to scrape the internet each day to find every short-term rental — and check if it has been listed without the required permits.",
          "feed_position": 21
        }
      ],
      "popularity_score": 148.9719611111111,
      "ai_summary": [
        "A city council is using AI to find unpermitted rentals.",
        "The AI scrapes the internet daily for listings.",
        "The council checks for rentals without required permits.",
        "The initiative aims to enforce permit regulations.",
        "The AI identifies short-term rental properties."
      ]
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 02:49:42 +0000",
      "title": "'World's largest chocolate fountain' dropped from developer plans at Cadbury",
      "neutral_headline": "World's largest chocolate fountain\" dropped from plans",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-26/cadbury-chocolate-fountain-dropped-from-plans/105697068",
          "published_at": "Tue, 26 Aug 2025 02:49:42 +0000",
          "title": "'World's largest chocolate fountain' dropped from developer plans at Cadbury",
          "standfirst": "The dream of the \"world's largest chocolate fountain\" promised by the Tasmanian Liberal government in March last year has melted away from a project given $12 million in taxpayer funds.",
          "content": "The dream of the \"world's largest chocolate fountain\" promised by the Tasmanian Liberal government in March last year has melted away from a project given $12 million in taxpayer funds.",
          "feed_position": 24
        }
      ],
      "popularity_score": 148.5094611111111,
      "ai_summary": [
        "The chocolate fountain project was dropped from plans.",
        "The project was promised by the Tasmanian government.",
        "$12 million in taxpayer funds were allocated.",
        "The project was to be part of a Cadbury development.",
        "The fountain was to be the world's largest."
      ]
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 18:47:21 +0000",
      "title": "He's at the centre of a major fraud investigation. We tracked him down in an elevator",
      "neutral_headline": "Fraud investigation subject tracked down in an elevator",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/david-mcwilliams-alammc-sda-fraud-investigation-four-corners/105694222",
          "published_at": "Mon, 25 Aug 2025 18:47:21 +0000",
          "title": "He's at the centre of a major fraud investigation. We tracked him down in an elevator",
          "standfirst": "David McWilliams took millions of dollars from investors by saying he was building houses for people with profound disabilities. Despite having his assets frozen, Four Corners can reveal he is still living a lavish lifestyle.",
          "content": "David McWilliams took millions of dollars from investors by saying he was building houses for people with profound disabilities. Despite having his assets frozen, Four Corners can reveal he is still living a lavish lifestyle.",
          "feed_position": 12
        }
      ],
      "popularity_score": 148.47029444444445,
      "ai_summary": [
        "David McWilliams is at the center of a fraud investigation.",
        "He allegedly took millions from investors.",
        "McWilliams claimed to build houses for disabled people.",
        "Despite asset freezes, he lives a lavish lifestyle.",
        "Four Corners tracked him down in an elevator."
      ]
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 02:17:57 +0000",
      "title": "'Devastating' fire burns down Marshall Islands parliament building",
      "neutral_headline": "Fire destroys Marshall Islands parliament building",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/marshall-islands-parliament-fire/105697758",
          "published_at": "Tue, 26 Aug 2025 02:17:57 +0000",
          "title": "'Devastating' fire burns down Marshall Islands parliament building",
          "standfirst": "Fire crews were unable to save the building despite an hours-long effort to stop the blaze.",
          "content": "Fire crews were unable to save the building despite an hours-long effort to stop the blaze.",
          "feed_position": 11
        }
      ],
      "popularity_score": 147.98029444444444,
      "ai_summary": [
        "A fire destroyed the parliament building.",
        "Fire crews tried for hours to stop the blaze.",
        "The building was located in the Marshall Islands.",
        "The fire caused significant damage to the structure.",
        "The cause of the fire is currently unknown."
      ]
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 18:50:19 +0000",
      "title": "The irony of being unable to attend an accessibility event due to inaccessible transport",
      "neutral_headline": "Accessibility event missed due to inaccessible transport",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/people-with-disability-air-travel-aviation-standards-drag/105610372",
          "published_at": "Mon, 25 Aug 2025 18:50:19 +0000",
          "title": "The irony of being unable to attend an accessibility event due to inaccessible transport",
          "standfirst": "Jono Bredin was excited to be invited to speak at an inclusive housing summit, but soon found out there were no flights on any airline that could safely get him there.",
          "content": "Jono Bredin was excited to be invited to speak at an inclusive housing summit, but soon found out there were no flights on any airline that could safely get him there.",
          "feed_position": 19
        }
      ],
      "popularity_score": 145.5197388888889,
      "ai_summary": [
        "Jono Bredin could not attend an accessibility event.",
        "He was invited to speak at an inclusive housing summit.",
        "No airline flights could safely transport him.",
        "The lack of accessible transport prevented attendance.",
        "Bredin was excited to speak at the summit."
      ]
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 23:00:00 +0000",
      "title": "New dietary guidelines are expected in 2026. Here's what they might contain",
      "neutral_headline": "New dietary guidelines expected in 2026. Here's what they might contain:",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/health/2025-08-26/dietary-guidelines-environmental-health-nutrition-balanced-diet/105670278",
          "published_at": "Mon, 25 Aug 2025 23:00:00 +0000",
          "title": "New dietary guidelines are expected in 2026. Here's what they might contain",
          "standfirst": "There's a growing trend for dietary guidelines around the world to take into account not just human health, but also the health of the planet.",
          "content": "There's a growing trend for dietary guidelines around the world to take into account not just human health, but also the health of the planet.",
          "feed_position": 22
        }
      ],
      "popularity_score": 144.6811277777778,
      "ai_summary": [
        "Dietary guidelines are increasingly considering planetary health.",
        "Guidelines are evolving to include environmental factors.",
        "The new guidelines are expected in 2026.",
        "The trend considers both human and environmental health.",
        "The guidelines will address broader health concerns."
      ]
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Tue, 26 Aug 2025 00:56:56 +0000",
      "title": "Musk's AI startup xAI sues Apple and ChatGPT maker",
      "neutral_headline": "Musk's AI startup xAI sues Apple and ChatGPT maker:",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/musk-xai-sues-chatgpt-and-apple-over-competition-threat/105697582",
          "published_at": "Tue, 26 Aug 2025 00:56:56 +0000",
          "title": "Musk's AI startup xAI sues Apple and ChatGPT maker",
          "standfirst": "The lawsuit alleges that Apple and OpenAI have \"locked up markets to maintain their monopolies\".",
          "content": "The lawsuit alleges that Apple and OpenAI have \"locked up markets to maintain their monopolies\".",
          "feed_position": 20
        }
      ],
      "popularity_score": 143.63001666666668,
      "ai_summary": [
        "xAI, Elon Musk's AI startup, is suing Apple and OpenAI.",
        "The lawsuit alleges market monopolization by Apple and OpenAI.",
        "The lawsuit claims Apple and OpenAI are locking up markets.",
        "The lawsuit concerns the AI and tech industries.",
        "The suit was filed by Musk's AI startup."
      ]
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 20:01:44 +0000",
      "title": "Millions of Australians will not have a say in who inherits their superannuation",
      "neutral_headline": "Millions of Australians will not have a say in who inherits their superannuation:",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/who-gets-your-superannuation-when-you-die-binding-death-benefits/105678326",
          "published_at": "Mon, 25 Aug 2025 20:01:44 +0000",
          "title": "Millions of Australians will not have a say in who inherits their superannuation",
          "standfirst": "At least 6.5 million Australians will have no say in who inherits their superannuation, according to new research from Super Consumers Australia. It is urging people to make sure they have a legally \"binding\" nomination to ensure their super goes to the people they want it to.",
          "content": "At least 6.5 million Australians will have no say in who inherits their superannuation, according to new research from Super Consumers Australia. It is urging people to make sure they have a legally \"binding\" nomination to ensure their super goes to the people they want it to.",
          "feed_position": 10
        }
      ],
      "popularity_score": 141.71001666666666,
      "ai_summary": [
        "At least 6.5 million Australians lack superannuation inheritance control.",
        "Super Consumers Australia research revealed this statistic.",
        "People are urged to make legally binding nominations.",
        "This ensures superannuation goes to chosen beneficiaries.",
        "The research highlights the importance of nominations."
      ]
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 18:57:35 +0000",
      "title": "University students overthrew their country's dictator. Now comes the hard part",
      "neutral_headline": "University students overthrew their country's dictator. Now comes the hard part:",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/bangladesh-student-protesters-seeking-power-in-election/105686430",
          "published_at": "Mon, 25 Aug 2025 18:57:35 +0000",
          "title": "University students overthrew their country's dictator. Now comes the hard part",
          "standfirst": "Bangladesh's student uprising forced their prime minister to flee. Now they're trying to become a force for change from within the political system.",
          "content": "Bangladesh's student uprising forced their prime minister to flee. Now they're trying to become a force for change from within the political system.",
          "feed_position": 16
        }
      ],
      "popularity_score": 140.64085,
      "ai_summary": [
        "Bangladeshi students ousted their prime minister.",
        "They now aim to effect change within the political system.",
        "The students' uprising forced the prime minister to flee.",
        "They are working to become a force for change.",
        "The students are now navigating the political system."
      ]
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Mon, 25 Aug 2025 18:52:25 +0000",
      "title": "How China is outmanoeuvring Trump on tariffs",
      "neutral_headline": "How China is outmanoeuvring Trump on tariffs:",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-26/forget-the-deteriorating-us-economy-rates-are-going-to-be-cut/105695076",
          "published_at": "Mon, 25 Aug 2025 18:52:25 +0000",
          "title": "How China is outmanoeuvring Trump on tariffs",
          "standfirst": "When Jerome Powell let slip that US monetary policy was restricting the economy, Donald Trump unleashed a wave of buying on both stock and debt markets.",
          "content": "When Jerome Powell let slip that US monetary policy was restricting the economy, Donald Trump unleashed a wave of buying on both stock and debt markets.",
          "feed_position": 18
        }
      ],
      "popularity_score": 137.5547388888889,
      "ai_summary": [
        "Jerome Powell's comments impacted US monetary policy.",
        "Donald Trump's actions influenced stock and debt markets.",
        "China is navigating trade strategies effectively.",
        "The article discusses China's tariff strategies.",
        "The article analyzes Trump's response to Powell's comments."
      ]
    }
  ]
}