{
  "updated_at": "2025-12-16T23:19:57.352Z",
  "clusters": [
    {
      "id": "cluster_1",
      "coverage": 3,
      "updated_at": "Wed, 17 Dec 2025 10:15:49 +1100",
      "title": "Prime Minister speaks outside St Vincent's Hospital",
      "neutral_headline": "Prime Minister speaks outside St Vincent's Hospital",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/prime-minister-speaks-outside-st-vincents-hospital-20251217-p5nodo.html",
          "published_at": "Wed, 17 Dec 2025 10:15:49 +1100",
          "title": "Prime Minister speaks outside St Vincent's Hospital",
          "standfirst": "Prime Minister Anthony Albanese speaks outside St Vincent's Hospital where five of the Bondi attack victims are being treated.",
          "content": "Prime Minister Anthony Albanese speaks outside St Vincent's Hospital where five of the Bondi attack victims are being treated.",
          "feed_position": 1,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/aa49e6bcd286bdbf252aa66a4c284deecaf03a0d"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/bondi-beach-shooting-images-show-terror-attack-at-iconic-sydney-beach/9401f46c-39a3-4a3d-9995-1b27d33bc8b5",
          "published_at": "Tue, 16 Dec 2025 04:57:51 +0000",
          "title": "Prime Minister visits terror attack hero",
          "standfirst": "Prime Minister Anthony Albanese has visited Bondi hero Ahmed el-Ahmed in hospital.",
          "content": "Prime Minister Anthony Albanese has visited Bondi hero Ahmed el-Ahmed in hospital.",
          "feed_position": 16,
          "image_url": "https://prod.static9.net.au/fs/614e1d9b-c627-4f87-b0aa-46c78e8e9d85"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2025/dec/16/prime-minister-meets-the-australian-hero-ahmed-al-ahmed-in-hospital-video",
          "published_at": "Tue, 16 Dec 2025 02:50:39 GMT",
          "title": "Prime minister meets the ‘Australian hero’ Ahmed al-Ahmed in hospital – video",
          "standfirst": "Anthony Albanese visited 43-year-old Ahmed al-Ahmed, who tackled and wrested a gun from an alleged shooter at Bondi beach. Speaking to the media outside St George hospital, where Ahmed is being treated, the PM said, ‘It was a great honour to met Ahmed al-Ahmed. He is a true Australian hero’‘It was a matter of conscience’: Ahmed al-Ahmed’s family reveal why he risked his life to disarm alleged Bondi shooter Continue reading...",
          "content": "Anthony Albanese visited 43-year-old Ahmed al-Ahmed, who tackled and wrested a gun from an alleged shooter at Bondi beach. Speaking to the media outside St George hospital, where Ahmed is being treated, the PM said, ‘It was a great honour to met Ahmed al-Ahmed. He is a true Australian hero’‘It was a matter of conscience’: Ahmed al-Ahmed’s family reveal why he risked his life to disarm alleged Bondi shooter Continue reading...",
          "feed_position": 16
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/aa49e6bcd286bdbf252aa66a4c284deecaf03a0d",
      "popularity_score": 3019.931013611111
    },
    {
      "id": "cluster_9",
      "coverage": 3,
      "updated_at": "Tue, 16 Dec 2025 22:59:54 +0000",
      "title": "Alleged 'onshore' Sydney crime boss charged with conspiracy to murder rival",
      "neutral_headline": "Alleged 'onshore' Sydney crime boss charged with conspiracy to murder rival",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/taskforce-falcon-charges-alameddine-alleged-onshore-leader/106151918",
          "published_at": "Tue, 16 Dec 2025 22:59:54 +0000",
          "title": "Alleged 'onshore' Sydney crime boss charged with conspiracy to murder rival",
          "standfirst": "The alleged \"onshore leader\" of Sydney's fracturing Alameddine crime family has been charged with alleged conspiring to murder two underworld adversaries.",
          "content": "The alleged \"onshore leader\" of Sydney's fracturing Alameddine crime family has been charged with alleged conspiring to murder two underworld adversaries.",
          "feed_position": 15
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/ringleader-of-criminal-gang-charged-in-alleged-double-murder-conspiracy-20251217-p5nocb.html",
          "published_at": "Wed, 17 Dec 2025 08:33:45 +1100",
          "title": "Ringleader of criminal gang charged in alleged double murder conspiracy",
          "standfirst": "Police in Sydney have charged an alleged criminal gang leader with soliciting and conspiracy to murder two men.",
          "content": "Police in Sydney have charged an alleged criminal gang leader with soliciting and conspiracy to murder two men.",
          "feed_position": 13,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/16e6af742ecb806c90c64fc70af795e725770779"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/sydney-crime-nsw-police-murder/5136e55e-0dcc-4535-b201-a54795ad3c0e",
          "published_at": "Tue, 16 Dec 2025 21:29:56 +0000",
          "title": "Ringleader of criminal gang charged in alleged double murder conspiracy",
          "standfirst": "During the searches, large amounts of cash and a white powdered product were found.",
          "content": "Police in Sydney have charged a man they describe as the ringleader of an organised criminal network with soliciting and conspiracy to murder two men.An investigation that began in September last year found the leader of an organised criminal network was allegedly responsible for soliciting the murder of a 27-year-old man who had defected from the group, as well as conspiring to murder one of his associates in Kogarah Bay in August.As a result, authorities arrested and charged six people across the state yesterday, executing search warrants across Sydney.LIVE UPDATES: Three patients still fighting for life after horror at BondiDuring the searches, large amounts of cash and a white powder product were found.The ringleader of the gang, a 32-year-old man, was arrested at a Croydon Park house; he was taken to Burwood Police Station, where he was charged with multiple offences.These include conspiring and agreeing to murder, soliciting, encouraging and persuading to murder, and recruiting a child to carry out or assist criminal activity.He was refused bail to appear in Burwood Local Court today.A man and a woman, both aged 34, were arrested in Austral in Sydney&#x27;s south-west, and were taken to Liverpool Police Station.READ MORE: Trump insider says he has an &#x27;alcoholic&#x27;s personality&#x27;They were both charged with multiple offences, including drug and criminal activity charges. The pair were refused bail to appear at Liverpool Local Court today.Two other men, a 34-year-old and a 40-year-old, were arrested in Lidcombe and Merrylands respectively, where they were given multiple charges, and were refused bail to appear in court today.Police also arrested a 23-year-old man at Wagga Wagga Police Station in the state&#x27;s south, where he was hit with multiple charges, including possessing an unregistered pistol and reckless wounding in company.He was refused bail and will appear at Parramatta Local Court tomorrow.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 5,
          "image_url": "https://prod.static9.net.au/fs/00a601d6-40d4-4556-8d24-4a08b80b6d89"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/16e6af742ecb806c90c64fc70af795e725770779",
      "popularity_score": 3019.665735833333
    },
    {
      "id": "cluster_21",
      "coverage": 3,
      "updated_at": "Wed, 17 Dec 2025 09:04:09 +1100",
      "title": "Rob Reiner’s son to be charged with murder of his parents",
      "neutral_headline": "Rob Reiner’s son to be charged with murder of his parents",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/north-america/rob-reiner-s-son-to-be-charged-with-murder-of-his-parents-20251217-p5noc8.html",
          "published_at": "Wed, 17 Dec 2025 09:04:09 +1100",
          "title": "Rob Reiner’s son to be charged with murder of his parents",
          "standfirst": "Nick Reiner will be charged with two counts of first-degree murder.",
          "content": "Nick Reiner will be charged with two counts of first-degree murder.",
          "feed_position": 11,
          "image_url": "https://static.ffx.io/images/$zoom_1.0846025034854823%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1477%2C$y_1049/t_crop_custom/q_86%2Cf_auto/aa0e5e4861468b3bcafdf66bd6fd99ea7385d5a9"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/prosecutors-will-charge-rob-reiners-son-nick-with-2-counts-of-murder-in-killing-of-his-parents/e433fe8b-f365-43a7-9e39-630f97e4404b",
          "published_at": "Tue, 16 Dec 2025 21:51:54 +0000",
          "title": "Rob Reiner's son to be charged with murdering his parents",
          "standfirst": "Rob Reiner’s son Nick Reiner will be charged with two counts of first-degree murder in the killing of his parents.",
          "content": "Rob Reiner’s son Nick Reiner will be charged with two counts of first-degree murder in the killing of his parents, Los Angeles County prosecutors said.Nick Reiner, 32, will be charged in the death of the 78-year-old actor and director Rob Reiner and his wife Michele Singer Reiner, District Attorney Nathan Hochman announced at a news conference with LA Police Chief Jim McDonnell.Prosecutors plan to file the charges, two counts of first degree murder special circumstances of multiple murders, later today. READ MORE: Reiner and son had fight at celebrity party hours before murder They will also include a special allegation that he used a dangerous weapon, a knife.The announcement of the charges came two days after the couple was found dead from apparent stab wounds in their home in the upscale Brentwood neighbourhood of Los Angeles. Nick Reiner was arrested on suspicion of the killing and jailed hours later.Nick Reiner had been expected to make an initial court appearance earlier today, but his attorney Alan Jackson said he was not brought from the jail to the courthouse for medical reasons and the appearance would not come before tomorrow.Jackson did not comment further on the case, and Nick Reiner has not yet entered a plea.Representatives for the Reiner family did not respond to requests for comment.Nick Reiner’s attorney Alan Jackson said his client will not be in court today for medical reasons. Jackson told reporters outside the courthouse that he did not know what the medical issue was, but he said Reiner will not appear before tomorrow.READ MORE: Trump chief of staff Susie Wiles says president &#x27;has an alcoholic&#x27;s personality&#x27; He was arrested several hours after his parents were found dead in their home in the upscale Brentwood neighbourhood of Los Angeles on Sunday, police said.Rob Reiner was the Emmy-winning star of the sitcom All in the Family who went on to direct films including When Harry Met Sally... and The Princess Bride. He was an outspoken liberal activist for decades. Michele Singer Reiner was a photographer, movie producer and advocate for LGBTQ+ rights. They had been married for 36 years.Representatives for the Reiner family did not respond to requests for comment. Police haven’t said anything about a motive for the killings.Nick Reiner&#x27;s attorney didn&#x27;t comment further about the case today. Jackson is a high-profile lawyer who represented Harvey Weinstein at his Los Angeles trial and Karen Read at her trial in Massachusetts. He was a central figure in the HBO documentary on the Read case.Investigators believe Rob and Michele Singer Reiner died from stab wounds, a law enforcement official told The Associated Press. The official, who was briefed on the investigation, could not publicly discuss the details and spoke to the AP on condition of anonymity.READ MORE: Trump mocks slain actor Rob Reiner The killings were especially shocking given the warm comic legacy of the family. Rob Reiner was the son of comedy legend Carl Reiner, who died in 2020 at age 98.Kathy Bates, who won an Oscar as the star of Rob Reiner&#x27;s 1990 film Misery, was among those paying tribute to the couple.“I loved Rob,” Bates said in a statement. “He was brilliant and kind, a man who made films of every genre to challenge himself as an artist. He also fought courageously for his political beliefs. He changed the course of my life. Michele was a gifted photographer.”Bill Clinton called the couple “good, generous people who made everyone who knew them better”.“Hillary and I are heartbroken by the tragic deaths of our friends Rob and Michele Reiner,” he said in a statement. “They inspired and uplifted millions through their work in film and television.”Three months ago, Nick Reiner was photographed with his parents and siblings at the premiere of his father&#x27;s film Spinal Tap 2: The End Continues.He had spoken publicly of his struggles with addiction, cycling in and out of treatment facilities with bouts of homelessness in between through his teen years. Rob and Nick Reiner explored — and seemed to improve — their relationship through the making of the 2016 film, Being Charlie.Nick Reiner co-wrote and Rob Reiner directed the film about the struggles of an addicted son and a famous father. It was not autobiographical but included several elements of their lives.“It forced us to understand ourselves better than we had,” Rob Reiner told the AP in 2016. “I told Nick while we were making it, I said, ‘You know it doesn’t matter, whatever happens to this thing, we won already.’”Rob Reiner was long one of the most prolific directors in Hollywood, and his work included some of the most memorable and endlessly watchable movies of the 1980s and ’90s, including This is Spinal Tap and A Few Good Men.He met Michele Singer Reiner on the set of When Harry Met Sally..., and their meeting would inspire the film&#x27;s shift to a happy ending, with stars Billy Crystal — one of Reiner&#x27;s closest friends for decades — and Meg Ryan ending up together on New Year&#x27;s Eve.The Reiners were outspoken advocates for liberal causes and major Democratic donors.President Donald Trump on Monday blamed Rob Reiner’s outspoken opposition to the president for the actor-director’s killing, delivering the unsubstantiated claim in a social media post that seemed intent on decrying his opponents even in the face of a tragedy.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/1548cb78-07b4-4348-b974-76d631adc1da"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/nick-reiner-charged-over-rob-reiner-and-michele-deaths/106152000",
          "published_at": "Tue, 16 Dec 2025 21:25:28 +0000",
          "title": "Nick Reiner to be charged over Rob Reiner's death",
          "standfirst": "Prosecutors will charge the son of film director Rob Reiner and Michele Singer Reiner with two counts of murder.",
          "content": "Prosecutors will charge the son of film director Rob Reiner and Michele Singer Reiner with two counts of murder.",
          "feed_position": 8
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_1.0846025034854823%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1477%2C$y_1049/t_crop_custom/q_86%2Cf_auto/aa0e5e4861468b3bcafdf66bd6fd99ea7385d5a9",
      "popularity_score": 3018.736569166667
    },
    {
      "id": "cluster_4",
      "coverage": 2,
      "updated_at": "Wed, 17 Dec 2025 10:11:34 +1100",
      "title": "The Ashes 2025 third Test day one: Steve Smith out of crucial third Test, Usman Khawaja in at No.4 as Australia win the toss and bat",
      "neutral_headline": "The Ashes 2025 third Test day one: Steve Smith out of crucial third Test, Usman Khawaja in at...",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/sport/cricket/the-ashes-2025-third-test-day-one-live-coverage-20251217-p5nobi.html",
          "published_at": "Wed, 17 Dec 2025 10:11:34 +1100",
          "title": "The Ashes 2025 third Test day one: Steve Smith out of crucial third Test, Usman Khawaja in at No.4 as Australia win the toss and bat",
          "standfirst": "Everything is on the line in Adelaide: England must win to stay alive, while an Australian victory will seal the series. Follow live from the Adelaide Oval.",
          "content": "Everything is on the line in Adelaide: England must win to stay alive, while an Australian victory will seal the series. Follow live from the Adelaide Oval.",
          "feed_position": 3,
          "image_url": "https://static.ffx.io/images/$zoom_0.16400805327551493%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_14/t_crop_custom/q_86%2Cf_auto/94f9419c344182faec559c2dfab6347a798e102a"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/ashes-live-adelaide-oval-third-test-australia-england/106151318",
          "published_at": "Tue, 16 Dec 2025 22:41:20 +0000",
          "title": "Live: 'Unwell' Steve Smith missing third Ashes Test, leaving Adelaide Oval before play",
          "standfirst": "Australia captain Pat Cummins is back from injury, but superstar batter Steve Smith is ruled out as Australia takes a 2-0 Ashes lead into the third Test against England at the Adelaide Oval. Follow live.",
          "content": "Australia captain Pat Cummins is back from injury, but superstar batter Steve Smith is ruled out as Australia takes a 2-0 Ashes lead into the third Test against England at the Adelaide Oval. Follow live.",
          "feed_position": 4
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.16400805327551493%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_14/t_crop_custom/q_86%2Cf_auto/94f9419c344182faec559c2dfab6347a798e102a",
      "popularity_score": 2019.8601802777778
    },
    {
      "id": "cluster_12",
      "coverage": 2,
      "updated_at": "Wed, 17 Dec 2025 09:53:57 +1100",
      "title": "Bondi shooting live updates: Security ramped up ahead of Rabbi’s funeral in Sydney; shooters’ Philippines trip, links to Islamic State probed by police; three victims remain in critical condition",
      "neutral_headline": "Reasons for Bondi suspects’ Philippines trip remain unclear, but...",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/nsw/bondi-shooting-live-updates-shooters-philippines-trip-links-to-islamic-state-probed-by-police-more-victims-named-three-remain-in-critical-condition-20251216-p5no9z.html",
          "published_at": "Wed, 17 Dec 2025 09:53:57 +1100",
          "title": "Bondi shooting live updates: Security ramped up ahead of Rabbi’s funeral in Sydney; shooters’ Philippines trip, links to Islamic State probed by police; three victims remain in critical condition",
          "standfirst": "Australia is waking to fresh developments in the investigation of Sunday’s deadly shooting, with police confirming one of the alleged gunmen has regained consciousness. Follow our live coverage.",
          "content": "Australia is waking to fresh developments in the investigation of Sunday’s deadly shooting, with police confirming one of the alleged gunmen has regained consciousness. Follow our live coverage.",
          "feed_position": 6,
          "image_url": "https://static.ffx.io/images/$zoom_0.19063906390639063%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_29/t_crop_custom/q_86%2Cf_auto/a73837900acd2cdae66c10a75f2b56c078c6c584"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/dec/17/bondi-beach-terror-attack-indian-family-of-sajid-akram-ntwnfb",
          "published_at": "Tue, 16 Dec 2025 21:30:28 GMT",
          "title": "Bondi beach terror attack: Indian family of Sajid Akram unaware of alleged ‘radical mindset’, local officials say",
          "standfirst": "The first funerals for the 15 people killed in Sunday’s mass shooting will be held on Wednesday, as investigations continue into the alleged gunmenVictims of Bondi beach shootingWhat we know so far about the Bondi terror attack Follow the latest live updatesThe alleged gunman shot dead by police during Sunday’s attack on Australia’s Bondi beach was originally from the southern Indian city of Hyderabad and his family there seemed unaware of his alleged “radical mindset”, Indian police said on Tuesday.Meanwhile the second alleged gunman who was hospitalised after also being shot by police has awoken from a coma and may be charged as early as today, Seven News has reported. Continue reading...",
          "content": "The first funerals for the 15 people killed in Sunday’s mass shooting will be held on Wednesday, as investigations continue into the alleged gunmenVictims of Bondi beach shootingWhat we know so far about the Bondi terror attack Follow the latest live updatesThe alleged gunman shot dead by police during Sunday’s attack on Australia’s Bondi beach was originally from the southern Indian city of Hyderabad and his family there seemed unaware of his alleged “radical mindset”, Indian police said on Tuesday.Meanwhile the second alleged gunman who was hospitalised after also being shot by police has awoken from a coma and may be charged as early as today, Seven News has reported. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/dec/16/bondi-beach-attack-police-focus-visit-philippines",
          "published_at": "Tue, 16 Dec 2025 13:19:07 GMT",
          "title": "Reasons for Bondi suspects’ Philippines trip remain unclear, but Islamic State is active there",
          "standfirst": "Investigators examine IS link after finding flags in car registered to one of the alleged gunmenFull report: Bondi terror attackVictims of Bondi beach shootingWhat we know so far about the Bondi terror attackTwo major lines of inquiry have emerged in the investigation into the antisemitic terrorist attack in Sydney on Sunday.One is the trip made by the alleged attackers to the Philippines just before the massacre, in which 15 were killed and dozens injured. Continue reading...",
          "content": "Investigators examine IS link after finding flags in car registered to one of the alleged gunmenFull report: Bondi terror attackVictims of Bondi beach shootingWhat we know so far about the Bondi terror attackTwo major lines of inquiry have emerged in the investigation into the antisemitic terrorist attack in Sydney on Sunday.One is the trip made by the alleged attackers to the Philippines just before the massacre, in which 15 were killed and dozens injured. Continue reading...",
          "feed_position": 11
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/dec/16/anthony-albanese-strength-navigating-path-ahead-important-bravery-bondi-ntwnfb",
          "published_at": "Tue, 16 Dec 2025 08:59:14 GMT",
          "title": "Albanese’s own strength navigating the path ahead will be just as important as the bravery seen at Bondi",
          "standfirst": "The prime minister needs to ask tough questions and stare down opponents to achieve real action in the wake of the terror attack in SydneyFull report: Bondi terror attack Victims of Bondi beach shootingWhat we know so far about the Bondi terror attack Follow the latest live updatesVisiting Ahmed al-Ahmed’s hospital room on Tuesday, Anthony Albanese appeared humbled. Faced with the unfolding terror of Sunday’s Bondi shooting, Ahmed was heroic, running towards danger and tackling one of the gunmen.Despite being weak from bullet wounds and facing serious surgery this week, the 44-year-old, Albanese said, was strong. “Your heart is strong,” the prime minister told Ahmed. Continue reading...",
          "content": "The prime minister needs to ask tough questions and stare down opponents to achieve real action in the wake of the terror attack in SydneyFull report: Bondi terror attack Victims of Bondi beach shootingWhat we know so far about the Bondi terror attack Follow the latest live updatesVisiting Ahmed al-Ahmed’s hospital room on Tuesday, Anthony Albanese appeared humbled. Faced with the unfolding terror of Sunday’s Bondi shooting, Ahmed was heroic, running towards danger and tackling one of the gunmen.Despite being weak from bullet wounds and facing serious surgery this week, the 44-year-old, Albanese said, was strong. “Your heart is strong,” the prime minister told Ahmed. Continue reading...",
          "feed_position": 8
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/dec/16/anthony-albanese-ready-for-the-fight-to-tighten-firearms-laws-as-national-party-and-gun-groups-push-back-ntwnfb",
          "published_at": "Tue, 16 Dec 2025 06:23:43 GMT",
          "title": "Anthony Albanese ‘ready for the fight’ to tighten firearms laws as National party and gun groups push back",
          "standfirst": "The Nationals leader, David Littleproud, claimed ‘this isn’t a gun problem, it’s an ideology problem’Full report: Bondi terror attack Victims of Bondi beach shootingWhat we know so far about the Bondi terror attack Follow the latest live updatesAnthony Albanese says he is “ready for the fight” to tighten Australia’s firearms laws after the Bondi beach terror attack, as the gun lobby and the National party push back against changes they claim are attempts to divert attention from radicalisation.Former Liberal prime minister John Howard, who introduced sweeping gun control measures after the 1996 Port Arthur massacre, said he’d support tightening firearms laws and there were too many guns in Australia, but claimed Albanese was focusing on the wrong issue. Continue reading...",
          "content": "The Nationals leader, David Littleproud, claimed ‘this isn’t a gun problem, it’s an ideology problem’Full report: Bondi terror attack Victims of Bondi beach shootingWhat we know so far about the Bondi terror attack Follow the latest live updatesAnthony Albanese says he is “ready for the fight” to tighten Australia’s firearms laws after the Bondi beach terror attack, as the gun lobby and the National party push back against changes they claim are attempts to divert attention from radicalisation.Former Liberal prime minister John Howard, who introduced sweeping gun control measures after the 1996 Port Arthur massacre, said he’d support tightening firearms laws and there were too many guns in Australia, but claimed Albanese was focusing on the wrong issue. Continue reading...",
          "feed_position": 9
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/news/video/2025/dec/15/bondi-shooting-what-we-know-about-antisemitic-terror-attack-in-sydney-the-latest",
          "published_at": "Mon, 15 Dec 2025 14:47:07 GMT",
          "title": "Bondi shooting: what we know about antisemitic terror attack in Sydney | The Latest",
          "standfirst": "Australia suffered one of the deadliest massacres in its modern history on Sunday when two gunmen opened fire on a Jewish celebration at Bondi in Sydney. At least 16 people died, including one of the alleged gunmen, with more than 40 left wounded. The victims include a 10-year-old child, a Holocaust survivor and a London-born rabbi. The alleged gunmen behind the attack are a father-son duo, suspected of using legally obtained firearms to commit the massacre. Naveed Akram, 24, was known to New South Wales police and security agencies and had been linked with an Islamic State cell. The Australian prime minister, Anthony Albanese, is facing questions about gun law reform and security failings as Australians reel from the attack. Lucy Hough talks to the Guardian Australia senior reporter Ben Doherty Continue reading...",
          "content": "Australia suffered one of the deadliest massacres in its modern history on Sunday when two gunmen opened fire on a Jewish celebration at Bondi in Sydney. At least 16 people died, including one of the alleged gunmen, with more than 40 left wounded. The victims include a 10-year-old child, a Holocaust survivor and a London-born rabbi. The alleged gunmen behind the attack are a father-son duo, suspected of using legally obtained firearms to commit the massacre. Naveed Akram, 24, was known to New South Wales police and security agencies and had been linked with an Islamic State cell. The Australian prime minister, Anthony Albanese, is facing questions about gun law reform and security failings as Australians reel from the attack. Lucy Hough talks to the Guardian Australia senior reporter Ben Doherty Continue reading...",
          "feed_position": 17
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/global/video/2025/dec/15/bondi-beach-shooting-witness-share-experiences-video-ntwnfb",
          "published_at": "Mon, 15 Dec 2025 01:45:00 GMT",
          "title": "'The biggest gun I've ever seen': Bondi beach shooting witnesses share their experience - video",
          "standfirst": "Witnesses who saw the Bondi shooting unfold firsthand have spoken to Guardian Australia about their experiences. Bridget was on the back of her partner's Vespa when she saw an alleged gunman exit the backseat of a car. 'I thought he was picking up crutches and I felt sorry for him,' she said. 'And he just picks up the biggest gun I've ever seen and instantly opens fire.' Bridget says there were 'hundreds' of people at Bondi when the incident unfolded. 'I just go to my partner Tommy, 'Drive, he's got a gun!',' she says. 'All I could think was, I'm going to get shot in the back'. Jacob Barnfield ran onto the foot bridge where one of the alleged shooters was arrested. 'When [police] started clearing people off, they said, 'live grenade, live explosive on the bridge, everyone get off!' he recallsHolocaust survivor, London-born rabbi and 10-year-old girl among victims of Bondi beach terror attackBondi beach terror attack: 16 people including one child died in antisemitic shooting Continue reading...",
          "content": "Witnesses who saw the Bondi shooting unfold firsthand have spoken to Guardian Australia about their experiences. Bridget was on the back of her partner's Vespa when she saw an alleged gunman exit the backseat of a car. 'I thought he was picking up crutches and I felt sorry for him,' she said. 'And he just picks up the biggest gun I've ever seen and instantly opens fire.' Bridget says there were 'hundreds' of people at Bondi when the incident unfolded. 'I just go to my partner Tommy, 'Drive, he's got a gun!',' she says. 'All I could think was, I'm going to get shot in the back'. Jacob Barnfield ran onto the foot bridge where one of the alleged shooters was arrested. 'When [police] started clearing people off, they said, 'live grenade, live explosive on the bridge, everyone get off!' he recallsHolocaust survivor, London-born rabbi and 10-year-old girl among victims of Bondi beach terror attackBondi beach terror attack: 16 people including one child died in antisemitic shooting Continue reading...",
          "feed_position": 20
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.19063906390639063%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_29/t_crop_custom/q_86%2Cf_auto/a73837900acd2cdae66c10a75f2b56c078c6c584",
      "popularity_score": 2019.5665691666666
    },
    {
      "id": "cluster_28",
      "coverage": 2,
      "updated_at": "Wed, 17 Dec 2025 08:18:57 +1100",
      "title": "Remembering Matilda, the youngest victim of the Bondi terror attack",
      "neutral_headline": "Remembering Matilda, the youngest victim of the Bondi terror attack",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/remembering-matilda-the-youngest-victim-of-the-bondi-terror-attack-20251217-p5noc0.html",
          "published_at": "Wed, 17 Dec 2025 08:18:57 +1100",
          "title": "Remembering Matilda, the youngest victim of the Bondi terror attack",
          "standfirst": "The youngest victim of the Bondi terror attack Matilda's aunt Lina Chernykh speaks after tragedy.",
          "content": "The youngest victim of the Bondi terror attack Matilda's aunt Lina Chernykh speaks after tragedy.",
          "feed_position": 15,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/64557b67274c03e61b89f97634f53fcf5d8d92f0"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/bondi-beach-shooting-matildas-family-break-down-as-they-farewell-10-year-old-at-vigil/eefccef9-1e1c-417a-b368-aae65fc41a33",
          "published_at": "Tue, 16 Dec 2025 18:35:45 +0000",
          "title": "Matilda's grieving family break down as they speak at Bondi vigil",
          "standfirst": "The family of the Bondi terror attack&#x27;s youngest victim have slammed her attackers for targeting the 10-year-old.",
          "content": "The grieving family of 10-year-old Matilda, the youngest victim of the Bondi Beach terror attack, have spoken through their tears as they paid tribute to her at a vigil last night.Matilda had her face painted, petted farm animals and played with her younger sister as her family celebrated the first day of Hanukkah at Australia&#x27;s most popular beach on Sunday.But when accused father and son terrorists peppered bullets on the Jewish community, Matilda was one of 15 people shot dead.READ MORE: What we know about the 15 people killed in the Bondi Beach terror attackLast night, her family attended a menorah lighting ceremony at Bondi Pavilion, where hundreds of people gathered to pay their respects to the victims of the horrific incident.The family came to Australia as immigrants from Ukraine before the Russian invasion. Matilda&#x27;s mother Valentyna and Michael (surnames withheld) and her brother all spoke at the ceremony .Valentyna was visibly emotional and spoke through her sobs as she questioned what could have driven the gunmen to murder her daughter.\"I can&#x27;t imagine what monster stands on that bridge, and seeing a little girl running for her father, to hide with him, and he just pulled his trigger on her,\" she said.Michael said he did not expect to address the crowd, and fought through tears to pay tribute to his daughter. \"It wasn&#x27;t just a bullet from a stray, it wasn&#x27;t an accident. It was a bullet that was fired on her,\" he said.\"We came here from the Ukraine … and I named her Matilda because she was our firstborn in Australia. And I thought that Matilda was the most Australian name that could ever exist.\"So just remember... remember her name.\"READ MORE: The five questions Australia is asking after the Bondi terror attackMatilda&#x27;s brother said he was comforted by her memory.\"The one thing that brings me comfort is that whenever I would ask Matilda if she knew that I loved her, she would immediately say &#x27;yes&#x27;,\" he said.\"She knew she was loved. She wasn&#x27;t alone.\"The family embraced and sobbed as they laid a framed photo of the smiling girl, her shoes and flowers to the growing pile of flowers and tributes at Bondi Pavilion. Matilda had been fatally shot in front of her six-year-old sister.She was rushed to hospital, but could not be saved.READ MORE: Powerful acts of heroism shaped the Bondi terror tragedy Her aunt, Lina Chernykh, shared footage of Matilda smiling and posing with her sister hours before she was killed.She said the heartbroken family will never recover from their loss.\"A happy kid,\" she told 9News.\"She was open-hearted. Everywhere she goes, she was like a sun.\"La Perouse Public School said Matilda was their \"little ray of sunshine\" as they paid tribute to their pupil, who was \"deeply respected and loved\" by students and staff alike.\"She is genuinely the most kind, caring and compassionate young girl, who brightened everyone&#x27;s day with her radiant smile and infectious laugh,\" the school wrote in a statement.READ MORE: How to escape the flood of Bondi shooting videos online\"Matilda has an incredible gift for bringing joy to those around her.\"Matilda had just won the school&#x27;s Soroptimist International Literacy Award on Friday, just two days before the shooting.La Perouse School said they will always cherish and remember Matilda&#x27;s strength and joy for life.Matilda has been remembered as a \"bright, joyful, and spirited child who brought light to everyone around her\" by her language teacher Irina Goodhew, who has launched a fundraising appeal for her family.\"Her memory will live on in our hearts,\" she wrote on the fundraising site. If you have been impacted by the terror attack in Bondi there is support available.To contact Lifeline Australia, call 13 11 14 or text 0477 13 11 14. For people under 25 years old, you can contact Kids Helpline at 1800 55 1800. Both of these are available on a 24/7 basis.If you wish to donate blood, you can find your nearest donor centre here.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 10,
          "image_url": "https://prod.static9.net.au/fs/737b3292-6e76-4d4c-be1f-1d0bfefd4f42"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/64557b67274c03e61b89f97634f53fcf5d8d92f0",
      "popularity_score": 2017.9832358333333
    },
    {
      "id": "cluster_35",
      "coverage": 2,
      "updated_at": "Wed, 17 Dec 2025 07:45:09 +1100",
      "title": "Jewish and Muslim community leaders call for unity after Bondi mass shooting",
      "neutral_headline": "Jewish and Muslim community leaders call for unity after Bondi mass shooting",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/jewish-and-muslim-community-leaders-call-for-unity-after-bondi-mass-shooting-20251217-p5nobp.html",
          "published_at": "Wed, 17 Dec 2025 07:45:09 +1100",
          "title": "Jewish and Muslim community leaders call for unity after Bondi mass shooting",
          "standfirst": "Jewish and Muslim community leaders are calling for unity in the wake of the Bondi terror attack.",
          "content": "Jewish and Muslim community leaders are calling for unity in the wake of the Bondi terror attack.",
          "feed_position": 19,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/e399ca663e0db9d5ee532a2868083068e1f439f0"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/bondi-beach-shooting-five-key-questions-answered/ea43e596-5ede-44ac-be31-65423acdb565",
          "published_at": "Tue, 16 Dec 2025 06:56:16 +0000",
          "title": "The five questions Australia is asking after the Bondi terror attack",
          "standfirst": "Almost 48 hours after the shooting, these are the answers we have.",
          "content": "Two days on from the horrific terror attack targeting the Jewish community on Bondi Beach, questions have been raised about how the despicable shooting was able to occur in Australia, in the middle of one of the country&#x27;s most iconic destinations.Those queries have ranged from how the shooters escaped the watchful eye of security agencies and were able to have so many guns, to the government response to antisemitism.Almost 48 hours after the attack, these are the answers we have to some of those questions.LIVE UPDATES: Accused gunman awake in hospital as police investigate overseas military training trip How did the shooters escape the attention of authorities? Of the father-son pair that carried out the attack, one was known to authorities: 24-year-old Naveed Akram, who had been investigated by ASIO in 2019.Both the Sydney Morning Herald and the ABC have reported he came to the attention of the security agency following the July 2019 arrest of Isaac el Matari, the self-appointed leader of Islamic State in Australia who is currently in jail for planning to carry out a terror attack on Australian soil.However, while Naveed was investigated for six months, he was not considered by authorities to pose a threat.\"He was examined on the basis of being associated with others,\" Prime Minister Anthony Albanese said yesterday.READ MORE: &#x27;Caring&#x27; woman who dedicated life to fighting discrimination named as victim of Bondi attack \"The assessment was made that there was no indication of any ongoing threat or threat of him engaging in violence.\"Naveed is currently in hospital in a critical condition but is expected to be charged over the Bondi attack.The older gunman, 50-year-old Sajid Akram, was killed during the shooting. He had arrived in Australia in 1998 on a student visa, transferred to a partner visa three years later, and was on a resident-return visa at the time of the attack.He was not on authorities&#x27; radar.How did they get access to guns? A member of a gun club, Sajid Akram held an AB licence – which covers single-shot rifles and shotguns, as well as some higher-powered firearms – and legally owned the guns used in the attack. All six of the firearms linked to his licence have now been seized by police.Sajid was first approved for a gun licence in 2015, but that application lapsed because he didn&#x27;t get a photo taken for it.He then applied again in 2020 – after ASIO began investigating his son over ties to IS – and the licence was eventually issued in 2023.NSW Premier Chris Minns said this morning it is \"too early\" to say whether there was an intelligence failure that led to that gun licence being granted.READ MORE: Powerful acts of heroism shaped the Bondi terror tragedy Why wasn&#x27;t there more security at the event? While there was a police presence at the Chanukah by the Sea event targeted by the shooters, authorities have been questioned whether that was adequate, given the rise in antisemitic attacks in Sydney and across Australia since October 7, 2023.Police were on the scene in five minutes and took down the shooters in nine.The police response is being examined in a critical incident investigation, but Commissioner Mal Lanyon has defended the staffing levels at Bondi.\"We base our policing response on the threat that exists at the time,\" he said. \"A lot of work is done between ourselves and the Jewish community. \"Bondi Beach is a large and public area. We regularly patrol that area as we did on that day.\"Both he and Minns have acknowledged that the presence would have been larger had there been intelligence about an attack.\"I don&#x27;t think there&#x27;s any doubt that if we had our time again, of course we would do things differently,\" the premier said.READ MORE: Bondi attack &#x27;inspired by Islamic State&#x27;, two homemade flags found in car \"I can&#x27;t take back Sunday. Nobody can,\" he added. \"But what we can do is ensure that, in the future, we are putting security in place so that we rebuild trust with the Jewish community.\"Minns did, however, strongly defend the actions of police, saying officers acted with \"bravery and integrity\".\"They engaged the gunman on the footbridge with handguns,\" he said. \"The offenders had long-range rifles, and NSW Police officers were responsible for killing one of them and shooting the other one and, as a result, saving many, many people&#x27;s lives. \"There are two officers in critical care in New South Wales hospitals. They weren&#x27;t shot in the back as they were running away. They were shot in the front. \"I&#x27;m sorry to be graphic about it, but if there&#x27;s any suggestion that NSW Police didn&#x27;t live up to their responsibilities to the people of this state, it should be rejected because it&#x27;s not consistent with the facts.\"READ MORE: Plans for festive events uncertain as Sydney mourns Bondi terror attack Why didn&#x27;t the government act on antisemitic advice given to them months ago? The federal government has been criticised for not doing enough to combat the rise in antisemitism over the last two years, including by special envoy Jillian Segal, Opposition Leader Sussan Ley and former prime minister John Howard.\"(Prime Minister Anthony Albanese&#x27;s) greatest failure is not to provide the moral leadership that a prime minister can in denouncing antisemitism,\" Howard said, while stressing the people responsible for the attack were the two shooters.\"The impression I had was that every time he got onto the subject, he would equate it with discrimination generally.\"In particular, the government has been under fire for not adopting the recommendations to combat antisemitism handed down by Segal in August.READ MORE: After the Bondi attack, Australia&#x27;s terror level remains at &#x27;probable&#x27;. What does that mean? \"The leadership has not been there for Jewish Australians,\" Ley said.The government has defended its actions. While it hasn&#x27;t yet formally adopted Segal&#x27;s recommendations, Albanese pointed to several that it has acted on, including banning the Nazi salute and hate symbols, criminalising doxxing, and millions of dollars in education funding.Home Affairs Minister Tony Burke also pointed to the deportation of people with antisemitic views as action the government has taken.\"We have acted and will continue to act on the implementation of the plan… we&#x27;ll continue to work at the levels with the envoy, including a number of the recommendations for state governments to implement as well,\" Albanese said.The matter has been complicated by the heavy criticism Segal&#x27;s recommendations received, in part for relying on a controversial definition of antisemitism.\"The blueprint falls short in a range of areas essential to good public policy,\" human rights expert Louise Chappell said after their release. \"This is due to its biased arguments, weak evidence and recommendation overreach.\"READ MORE: &#x27;We forever remember your smile&#x27;: Heartbreaking footage of youngest Bondi victim Can we stop this from happening again? Both the federal and NSW governments have promised legal reform in response to the shooting, particularly around stronger gun controls.Investigations into the attack – at least an inquest is likely, and there are already calls for a royal commission – will provide recommendations on how to prevent future incidents.However, it&#x27;s worth noting that ASIO has been warning about the threat posed by lone wolf attacks for years.This was Director-General Mike Burgess at the start of 2024:\"ASIO remains concerned about a lone actor moving from talk to action without warning…\"ASIO remains concerned about lone actors, though – the potential for an individual or small group under the radar of authorities to use readily available weapons to carry out an act of terrorism. READ MORE: Bystanders shown fighting with accused Bondi gunmen in new footage \"And this is a concern across the spectrum of motivations – religious and ideological.\"And this was Burgess early this year:\"The most likely perpetrator of a terrorist attack is a lone actor, from a family previously unconnected to extremism…\"All (terror matters investigated last year) were lone actors or small groups. \"Almost all the individuals were unknown to ASIO or the police and it is fair to say they allegedly moved towards violence more quickly than we have seen before.\"It&#x27;s also crucial to note that ASIO is effective at detecting and stopping terror attacks.But the reality is they cannot monitor every person in the country.\"They do a marvellous job: ASIO, the AFP, their state ministry counterparts,\" former home affairs secretary Mike Pezzullo said yesterday, who added that \"not every cell is intercepted\" by authorities.\"They can&#x27;t be everywhere. And frankly, if they were, we&#x27;d be a police state.\"If you have been impacted by the terror attack in Bondi there is support available.To contact Lifeline Australia, call 13 11 14 or text 0477 13 11 14.For people under 25 years old, you can contact Kids Helpline at 1800 55 1800.Both of these are available on a 24/7 basis.If you wish to donate blood, you can find your nearest donor centre here.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 11,
          "image_url": "https://prod.static9.net.au/fs/e5911755-586c-4c9d-bd50-ea459a110bda"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australia-terrorism-threat-level-probable-what-does-that-mean-explainer/9263a225-47d7-4154-a88f-60b8d96f6e10",
          "published_at": "Tue, 16 Dec 2025 03:28:01 +0000",
          "title": "After the Bondi attack, Australia's terror level remains at 'probable'. What does that mean?",
          "standfirst": "The Bondi shooting is the worst mass shooting since Port Arthur and the deadliest terror attack on Australian soil.",
          "content": "The Bondi shooting is the worst mass shooting since Port Arthur and the deadliest terror attack on Australian soil.Prior to the attack, officials said the national terror level was \"probable\", which indicated there was a 50-50 chance of a terror attack on Australian soil. So what does Australia&#x27;s &#x27;probable&#x27; actually mean?LIVE UPDATES: Australia mourns as Bondi victims fight for life; Philippines trip by alleged shooters probedWhat is Australia&#x27;s current terrorism threat level?Australia&#x27;s current national terrorism threat level is probable.The federal government raised the level from \"possible\" to \"probable\" in August last year.What does the &#x27;probable&#x27; mean? Under the national terrorism advisory system, probable is defined as \"a terrorist attack is probable and the government has concerns of a plausible threat\".When the alert level was raised, Australians were told there \"is a greater than 50 per cent chance of an onshore attack or attack planning in the next 12 months\".However, Prime Minister Anthony Albanese said a \"probable\" alert does not mean \"inevitable\".Why was the terrorism threat level changed?At the time, intelligence experts said the decision to raise the threat level was not triggered by any single ideology or issue, but an overall rise in polarisation in Australia and other Western nations.The terror threat level was last changed in 2022, when it was lowered to \"possible\".\"The advice that we have received is that more Australians are embracing a more diverse range of extreme ideologies and it is our responsibility to be vigilant,\" Albanese said in August last year.READ MORE: Bondi hero would &#x27;do it again&#x27; despite being &#x27;riddled with bullets&#x27;\"To be clear, this is the same threat level that was in place in Australia for more than eight years before it was lowered in November of 2022.\"At that time, we said as a government, it&#x27;s does not mean the threat from terrorism is extinguished.\"The national terrorism threat level is a warning tool to provide the government and the public an indication of what ASIO is seeing and anticipates in the near future.Will the terrorism threat level change? In the hours after the attack, Australian Security Intelligence Organisation (ASIO) Director-General Mike Burgess maintained the threat level would likely not change from \"probable\".\"I don&#x27;t see that changing at this stage,\" he said.\"One incident by itself does not necessarily raise the threat level at the national level, but we keep that under constant review.Burgess confirmed investigations are ongoing into any other possible threats, after father and son Sajid and Naveed Akram were named as the shooters.\"We&#x27;re looking to see if there&#x27;s anyone in the community that has similar intent,\" he said. \"It&#x27;s important to stress at this point, we have no indications to that fact, but that is something we have active investigations on.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 13,
          "image_url": "https://prod.static9.net.au/fs/88acc440-ce37-4ed8-824b-7c4d20a47540"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/e399ca663e0db9d5ee532a2868083068e1f439f0",
      "popularity_score": 2017.4199025
    },
    {
      "id": "cluster_37",
      "coverage": 2,
      "updated_at": "Tue, 16 Dec 2025 20:28:42 GMT",
      "title": "Man who stabbed 11-year-old Australian girl in central London to be detained indefinitely",
      "neutral_headline": "Man who stabbed 11yo Aussie tourist in London to be detained indefinitely",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/dec/17/man-who-stabbed-11-year-old-australian-girl-in-central-london-to-be-detained-indefinitely",
          "published_at": "Tue, 16 Dec 2025 20:28:42 GMT",
          "title": "Man who stabbed 11-year-old Australian girl in central London to be detained indefinitely",
          "standfirst": "Mother told court she ‘relives the moment over and over’ when she thought her daughter was being killed in front of herA man who “furiously and repeatedly” stabbed an 11-year-old Australian girl in a random knife attack in London’s Leicester Square has been detained indefinitely.The child, who cannot be named for legal reasons, told police she thought she was going to die after she was targeted by Ioan Pintaru in the city’s West End on the morning of August 12 last year while on holiday with her mother. Continue reading...",
          "content": "Mother told court she ‘relives the moment over and over’ when she thought her daughter was being killed in front of herA man who “furiously and repeatedly” stabbed an 11-year-old Australian girl in a random knife attack in London’s Leicester Square has been detained indefinitely.The child, who cannot be named for legal reasons, told police she thought she was going to die after she was targeted by Ioan Pintaru in the city’s West End on the morning of August 12 last year while on holiday with her mother. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/ioan-alexandru-pintaru-to-be-detained-indefinitely/106151690",
          "published_at": "Tue, 16 Dec 2025 19:05:10 +0000",
          "title": "Man who stabbed 11yo Aussie tourist in London to be detained indefinitely",
          "standfirst": "A judge at the Old Bailey rules Ioan Alexandru-Pintaru, who stabbed a young Australian girl in Leicester Square last year, will be detained at a mental hospital indefinitely.",
          "content": "A judge at the Old Bailey rules Ioan Alexandru-Pintaru, who stabbed a young Australian girl in Leicester Square last year, will be detained at a mental hospital indefinitely.",
          "feed_position": 13
        }
      ],
      "popularity_score": 2017.1457358333332
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:01:10 +0000",
      "title": "First of Bondi terror attack funerals to be held today",
      "neutral_headline": "First of Bondi terror attack funerals to be held today",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/bondi-beach-shooting-terrorist-attack-islamic-state-live-blog/106151426",
          "published_at": "Tue, 16 Dec 2025 17:01:10 +0000",
          "title": "First of Bondi terror attack funerals to be held today",
          "standfirst": "Investigators are continuing to probe suspected links to Islamic State and a trip the father and son took to the Philippines prior to Sunday's attack. Follow live.",
          "content": "Investigators are continuing to probe suspected links to Islamic State and a trip the father and son took to the Philippines prior to Sunday's attack. Follow live.",
          "feed_position": 0
        }
      ],
      "popularity_score": 346.68684666666667
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:30:37 +0000",
      "title": "Crisis teams offer psychological first aid to those affected by Bondi shooting",
      "neutral_headline": "Crisis teams offer psychological first aid to those affected by Bondi shooting",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/crisis-teams-provide-psychological-first-aid-to-those-affected/106151216",
          "published_at": "Tue, 16 Dec 2025 21:30:37 +0000",
          "title": "Crisis teams offer psychological first aid to those affected by Bondi shooting",
          "standfirst": "In the chaotic hours after the Bondi shooting, bystanders, surf lifesavers and emergency services rushed to the victims to provide first aid.",
          "content": "In the chaotic hours after the Bondi shooting, bystanders, surf lifesavers and emergency services rushed to the victims to provide first aid.",
          "feed_position": 1
        }
      ],
      "popularity_score": 341.17768027777777
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 22:48:48 +0000",
      "title": "Brother of injured Bondi volunteer feels 'betrayed'",
      "neutral_headline": "Brother of injured Bondi volunteer feels 'betrayed'",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/injured-bondi-volunteer-yaakov-super-identitified/106151280",
          "published_at": "Tue, 16 Dec 2025 22:48:48 +0000",
          "title": "Brother of injured Bondi volunteer feels 'betrayed'",
          "standfirst": "The rabbi brother of a healthcare volunteer shot in the Bondi Beach terror attack, damaging his lungs, urges Jewish Australians not to \"cower\".",
          "content": "The rabbi brother of a healthcare volunteer shot in the Bondi Beach terror attack, damaging his lungs, urges Jewish Australians not to \"cower\".",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.4807358333333
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 10:00:28 +0000",
      "title": "Coalition launches antisemitism taskforce after Bondi terror attack",
      "neutral_headline": "Coalition launches antisemitism taskforce after Bondi terror attack",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-16/coalition-launches-antisemitism-taskforce-after-bondi-terror-att/106151212",
          "published_at": "Tue, 16 Dec 2025 10:00:28 +0000",
          "title": "Coalition launches antisemitism taskforce after Bondi terror attack",
          "standfirst": "Opposition Leader Sussan Ley will head the internal group aiming to intensify scrutiny of the federal government's response to antisemitism.",
          "content": "Opposition Leader Sussan Ley will head the internal group aiming to intensify scrutiny of the federal government's response to antisemitism.",
          "feed_position": 2
        }
      ],
      "popularity_score": 319.67518
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 09:35:43 +0000",
      "title": "'Threw ourselves into that pit': How a mother saved her daughter at Bondi",
      "neutral_headline": "'Threw ourselves into that pit': How a mother saved her daughter at Bondi",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-16/bondi-beach-terrorism-survivor-tells-of-15-minutes-of-terror/106150322",
          "published_at": "Tue, 16 Dec 2025 09:35:43 +0000",
          "title": "'Threw ourselves into that pit': How a mother saved her daughter at Bondi",
          "standfirst": "A mother throws herself and her daughter into a pit to avoid bullets as her husband goes searching for her among the bodies of the dead at Bondi.",
          "content": "A mother throws herself and her daughter into a pit to avoid bullets as her husband goes searching for her among the bodies of the dead at Bondi.",
          "feed_position": 3
        }
      ],
      "popularity_score": 309.26268
    },
    {
      "id": "cluster_42",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:11:21 +0000",
      "title": "Live: Chalmers to hand down mid-year budget update",
      "neutral_headline": "Budget update to show $8.4b improvement to bottom line",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/federal-politics-live-blog-dec-17/106151730",
          "published_at": "Tue, 16 Dec 2025 20:11:21 +0000",
          "title": "Live: Chalmers to hand down mid-year budget update",
          "standfirst": "Treasurer Jim Chalmers will today hand down a Mid-Year Economic and Fiscal Outlook showing an $8.4 billion improvement to the budget bottom line. Follow live.",
          "content": "Treasurer Jim Chalmers will today hand down a Mid-Year Economic and Fiscal Outlook showing an $8.4 billion improvement to the budget bottom line. Follow live.",
          "feed_position": 5
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-16/myefo-budget-update-show-deficit-improvement/106150778",
          "published_at": "Tue, 16 Dec 2025 11:30:11 +0000",
          "title": "Budget update to show $8.4b improvement to bottom line",
          "standfirst": "A combination of savings and higher tax takes have delivered an $8.4 billion improvement to the federal budget's bottom line, the mid-year update is expected to show when it is released on Wednesday.",
          "content": "A combination of savings and higher tax takes have delivered an $8.4 billion improvement to the federal budget's bottom line, the mid-year update is expected to show when it is released on Wednesday.",
          "feed_position": 6
        }
      ],
      "popularity_score": 306.85656916666665
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 22:29:27 +0000",
      "title": "Conditional release for teen who ran over man in caravan theft",
      "neutral_headline": "Conditional release for teen who ran over man in caravan theft",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/teenager-halls-creek-service-station-car-theft/106144328",
          "published_at": "Tue, 16 Dec 2025 22:29:27 +0000",
          "title": "Conditional release for teen who ran over man in caravan theft",
          "standfirst": "A 15-year-old boy who left an elderly tourist in a coma after a Kimberley car theft has escaped immediate jail time.",
          "content": "A 15-year-old boy who left an elderly tourist in a coma after a Kimberley car theft has escaped immediate jail time.",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.1582358333333
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:30:51 +0000",
      "title": "Woman rescued after rip warning sign stolen from WA beach",
      "neutral_headline": "Woman rescued after rip warning sign stolen from WA beach",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/rip-warning-sign-taken-from-beach-near-bremer-bay/106144784",
          "published_at": "Tue, 16 Dec 2025 21:30:51 +0000",
          "title": "Woman rescued after rip warning sign stolen from WA beach",
          "standfirst": "Road signs are commonly taken from the popular tourist town of Bremer Bay, but the local shire is warning the theft of a rip warning sign at a local beach meant visitors did not get crucial safety information.",
          "content": "Road signs are commonly taken from the popular tourist town of Bremer Bay, but the local shire is warning the theft of a rip warning sign at a local beach meant visitors did not get crucial safety information.",
          "feed_position": 6
        }
      ],
      "popularity_score": 291.1815691666667
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 23:04:05 +0000",
      "title": "Tom Silvagni, son of AFL star, to be sentenced over rape",
      "neutral_headline": "Tom Silvagni, son of AFL star, to be sentenced over rape",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/tom-silvagni-rape-court-sentencing/106149996",
          "published_at": "Tue, 16 Dec 2025 23:04:05 +0000",
          "title": "Tom Silvagni, son of AFL star, to be sentenced over rape",
          "standfirst": "Tom Silvagni, son of former AFL star Stephen Silvagni, was found guilty of raping a woman by a jury earlier this month.",
          "content": "Tom Silvagni, son of former AFL star Stephen Silvagni, was found guilty of raping a woman by a jury earlier this month.",
          "feed_position": 7
        }
      ],
      "popularity_score": 287.73545805555557
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 19:36:58 +0000",
      "title": "'Alternative' school branded 'cult-like' faces abuse allegations",
      "neutral_headline": "'Alternative' school branded 'cult-like' faces abuse allegations",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/fitzroy-community-school-parents-consider-legal-action/106129242",
          "published_at": "Tue, 16 Dec 2025 19:36:58 +0000",
          "title": "'Alternative' school branded 'cult-like' faces abuse allegations",
          "standfirst": "The school that inspired author John Marsden is facing potential legal action from parents over allegations of physical abuse.",
          "content": "The school that inspired author John Marsden is facing potential legal action from parents over allegations of physical abuse.",
          "feed_position": 9
        }
      ],
      "popularity_score": 259.2835133333333
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:37:23 +0000",
      "title": "Live: Westpac removes rate cut call, now sees RBA on 'extended hold' in 2026",
      "neutral_headline": "Live: Westpac removes rate cut call, now sees RBA on 'extended hold' in 2026",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/asx-markets-business-live-news-dec-17/106151834",
          "published_at": "Tue, 16 Dec 2025 20:37:23 +0000",
          "title": "Live: Westpac removes rate cut call, now sees RBA on 'extended hold' in 2026",
          "standfirst": "Major bank economics teams are rushing to change their cash rate calls ahead of next year. The ASX is on track to open relatively flat as it follows a mostly negative session on Wall Street, while the price of oil has dropped to its lowest level in four years. Follow live.",
          "content": "Major bank economics teams are rushing to change their cash rate calls ahead of next year. The ASX is on track to open relatively flat as it follows a mostly negative session on Wall Street, while the price of oil has dropped to its lowest level in four years. Follow live.",
          "feed_position": 11
        }
      ],
      "popularity_score": 160.29045805555555
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 19:42:40 +0000",
      "title": "Man arrested after fatal assault in Melbourne's south-east",
      "neutral_headline": "Man arrested after fatal assault in Melbourne's south-east",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/vic-police-investigate-cheltenham-death/106151724",
          "published_at": "Tue, 16 Dec 2025 19:42:40 +0000",
          "title": "Man arrested after fatal assault in Melbourne's south-east",
          "standfirst": "A man is in custody following the fatal assault of a man in Cheltenham on Tuesday night.",
          "content": "A man is in custody following the fatal assault of a man in Cheltenham on Tuesday night.",
          "feed_position": 17
        }
      ],
      "popularity_score": 155.37851361111112
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 23:10:46 +0000",
      "title": "Water bottle, 'makeshift poncho' found in search for Celine Cremer",
      "neutral_headline": "Water bottle, 'makeshift poncho' found in search for Celine Cremer",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/celine-cremer-tourist-search-in-tasmania-water-bottle-found/106151898",
          "published_at": "Tue, 16 Dec 2025 23:10:46 +0000",
          "title": "Water bottle, 'makeshift poncho' found in search for Celine Cremer",
          "standfirst": "Searchers find a water bottle and a garbage bag that may have been used as a poncho in the Tasmanian bushland where Belgian tourist Celine Cremer went missing.",
          "content": "Searchers find a water bottle and a garbage bag that may have been used as a poncho in the Tasmanian bushland where Belgian tourist Celine Cremer went missing.",
          "feed_position": 10
        }
      ],
      "popularity_score": 152.84684694444445
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:27:05 +0000",
      "title": "FIFA offers pool of lower-priced World Cup tickets following backlash",
      "neutral_headline": "FIFA offers pool of lower-priced World Cup tickets following backlash",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/fifa-cuts-world-cup-ticket-prices-for-2026-tournament/106151914",
          "published_at": "Tue, 16 Dec 2025 21:27:05 +0000",
          "title": "FIFA offers pool of lower-priced World Cup tickets following backlash",
          "standfirst": "FIFA backtracks on high-priced World Cup tickets, with a limited amount of seats to be made available for less than $100.",
          "content": "FIFA backtracks on high-priced World Cup tickets, with a limited amount of seats to be made available for less than $100.",
          "feed_position": 20
        }
      ],
      "popularity_score": 151.1187913888889
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:15:15 +0000",
      "title": "WA's only Jewish MP felt increased risk before Bondi terror attack",
      "neutral_headline": "WA's only Jewish MP felt increased risk before Bondi terror attack",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/simon-ehrenfeld-details-wa-jewish-community-grief-after-bondi/106151184",
          "published_at": "Tue, 16 Dec 2025 21:15:15 +0000",
          "title": "WA's only Jewish MP felt increased risk before Bondi terror attack",
          "standfirst": "The only Jewish MP serving in Western Australia's parliament says he has felt a greater sense of risk when attending events recently, given what he feels is an increase in antisemitism in the country.",
          "content": "The only Jewish MP serving in Western Australia's parliament says he has felt a greater sense of risk when attending events recently, given what he feels is an increase in antisemitism in the country.",
          "feed_position": 10
        }
      ],
      "popularity_score": 150.92156916666667
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:13:03 +0000",
      "title": "Doctor who helped supply ketamine to Matthew Perry sentenced to home detention",
      "neutral_headline": "Doctor who helped supply ketamine to Matthew Perry sentenced to home detention",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/matthew-perry-ketamine-supply-doctor-eight-months-home-detention/106151902",
          "published_at": "Tue, 16 Dec 2025 21:13:03 +0000",
          "title": "Doctor who helped supply ketamine to Matthew Perry sentenced to home detention",
          "standfirst": "A doctor involved in supplying ketamine to Friends actor Matthew Perry before his overdose death is sentenced to eight months of home confinement.",
          "content": "A doctor involved in supplying ketamine to Friends actor Matthew Perry before his overdose death is sentenced to eight months of home confinement.",
          "feed_position": 22
        }
      ],
      "popularity_score": 150.8849025
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:00:42 +0000",
      "title": "Thousands of Australians unaware they have serious lung condition",
      "neutral_headline": "Thousands of Australians unaware they have serious lung condition",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/drop-in-testing-behind-underdiagnosis-of-copd-lung-foundation/106115100",
          "published_at": "Tue, 16 Dec 2025 21:00:42 +0000",
          "title": "Thousands of Australians unaware they have serious lung condition",
          "standfirst": "Experts call for urgent action to turn around an \"unacceptable\" decline in testing for a disease that kills 20 people every day.",
          "content": "Experts call for urgent action to turn around an \"unacceptable\" decline in testing for a disease that kills 20 people every day.",
          "feed_position": 12
        }
      ],
      "popularity_score": 150.67906916666666
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:14:57 +0000",
      "title": "Aussie makes history as highest-priced overseas IPL player in record deal",
      "neutral_headline": "Aussie makes history as highest-priced overseas IPL player in record deal",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/ipl-cam-green-breaks-record-as-most-expensive-overseas-player/106151784",
          "published_at": "Tue, 16 Dec 2025 20:14:57 +0000",
          "title": "Aussie makes history as highest-priced overseas IPL player in record deal",
          "standfirst": "Cameron Green earns a massive payday on the eve of the Adelaide Test, creating history in the Indian Premier League.",
          "content": "Cameron Green earns a massive payday on the eve of the Adelaide Test, creating history in the Indian Premier League.",
          "feed_position": 19
        }
      ],
      "popularity_score": 149.91656916666668
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 19:40:59 +0000",
      "title": "Apex predator returns to major river system, 100 years after extinction event",
      "neutral_headline": "Apex predator returns to major river system, 100 years after extinction event",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-17/mary-river-cod-brisbane-river-cod-catchment-apex-predator-bremer/106146520",
          "published_at": "Tue, 16 Dec 2025 19:40:59 +0000",
          "title": "Apex predator returns to major river system, 100 years after extinction event",
          "standfirst": "An important apex predator died out 100 years ago due to overfishing and land clearing. Now, a close relative is bringing balance back to the habitat.",
          "content": "An important apex predator died out 100 years ago due to overfishing and land clearing. Now, a close relative is bringing balance back to the habitat.",
          "feed_position": 18
        }
      ],
      "popularity_score": 149.35045805555555
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 19:32:04 +0000",
      "title": "Calls to stop females being given nappies for periods at NSW hospitals",
      "neutral_headline": "Calls to stop females being given nappies for periods at NSW hospitals",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/groups-call-for-free-period-products-in-nsw-hospitals/106148444",
          "published_at": "Tue, 16 Dec 2025 19:32:04 +0000",
          "title": "Calls to stop females being given nappies for periods at NSW hospitals",
          "standfirst": "Share the Dignity and the Australian Society of Psychological Medicine back calls for vending machines providing pads, tampons and underwear in NSW hospitals.",
          "content": "Share the Dignity and the Australian Society of Psychological Medicine back calls for vending machines providing pads, tampons and underwear in NSW hospitals.",
          "feed_position": 16
        }
      ],
      "popularity_score": 149.20184666666665
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 19:15:01 +0000",
      "title": "Hope for Australia's sea lions amid more pup deaths",
      "neutral_headline": "Hope for Australia's sea lions amid more pup deaths",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/significant-jump-in-sea-lion-pup-deaths-on-sa-island/106000790",
          "published_at": "Tue, 16 Dec 2025 19:15:01 +0000",
          "title": "Hope for Australia's sea lions amid more pup deaths",
          "standfirst": "Australia's sea lion population has had a tough winter with rising pup mortalities amid the algal bloom, but dedicated researchers are doing everything they can to help their survival as a species.",
          "content": "Australia's sea lion population has had a tough winter with rising pup mortalities amid the algal bloom, but dedicated researchers are doing everything they can to help their survival as a species.",
          "feed_position": 18
        }
      ],
      "popularity_score": 148.91768
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 19:01:13 +0000",
      "title": "Student ‘devastated’ by ATAR outcome now on path to dream job",
      "neutral_headline": "Student ‘devastated’ by ATAR outcome now on path to dream job",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/nsw-university-pathways-in-spotlight-amid-atar-result-release/106130518",
          "published_at": "Tue, 16 Dec 2025 19:01:13 +0000",
          "title": "Student ‘devastated’ by ATAR outcome now on path to dream job",
          "standfirst": "A south-west Sydney graduate who received disappointing final exam results is now pursuing a career in social work, encouraging high school students to avoid pinning their future goals to their grades.",
          "content": "A south-west Sydney graduate who received disappointing final exam results is now pursuing a career in social work, encouraging high school students to avoid pinning their future goals to their grades.",
          "feed_position": 24
        }
      ],
      "popularity_score": 148.68768
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 18:52:42 +0000",
      "title": "Security guards 'on phones', absent when needed, hospital review finds",
      "neutral_headline": "Security guards 'on phones', absent when needed, hospital review finds",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/security-guards-tasmania-public-hospitals-emergency-department/106136802",
          "published_at": "Tue, 16 Dec 2025 18:52:42 +0000",
          "title": "Security guards 'on phones', absent when needed, hospital review finds",
          "standfirst": "The nurses' union in Tasmania wants to see private security guards in public hospitals replaced with support officers trained in de-escalation, after a review found \"overwhelming dissatisfaction\" among staff.",
          "content": "The nurses' union in Tasmania wants to see private security guards in public hospitals replaced with support officers trained in de-escalation, after a review found \"overwhelming dissatisfaction\" among staff.",
          "feed_position": 21
        }
      ],
      "popularity_score": 148.54573555555555
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 18:50:08 +0000",
      "title": "Here's when the Christmas forecast moves from an educated guess to something useful",
      "neutral_headline": "Here's when the Christmas forecast moves from an educated guess to something useful",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/bom-christmas-forecast-accuracy/106135952",
          "published_at": "Tue, 16 Dec 2025 18:50:08 +0000",
          "title": "Here's when the Christmas forecast moves from an educated guess to something useful",
          "standfirst": "Some forecasts will tell you the weather 28 days from now. But is it accurate?",
          "content": "Some forecasts will tell you the weather 28 days from now. But is it accurate?",
          "feed_position": 14
        }
      ],
      "popularity_score": 148.50295777777777
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 18:30:00 +0000",
      "title": "The 51-hour secret North Korea was desperate to protect",
      "neutral_headline": "The 51-hour secret North Korea was desperate to protect",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/today-in-history-december-17-kim-jong-il-s-death-kept-secret/106138030",
          "published_at": "Tue, 16 Dec 2025 18:30:00 +0000",
          "title": "The 51-hour secret North Korea was desperate to protect",
          "standfirst": "The death of North Korean leader Kim Jong-il was such a closely guarded secret that few outside the North Korean elite would even have guessed anything was amiss.",
          "content": "The death of North Korean leader Kim Jong-il was such a closely guarded secret that few outside the North Korean elite would even have guessed anything was amiss.",
          "feed_position": 17
        }
      ],
      "popularity_score": 148.16740222222222
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:21:52 +0000",
      "title": "Sailors rescued from yacht off Victoria's coast",
      "neutral_headline": "Sailors rescued from yacht off Victoria's coast",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/sailors-rescued-from-yacht-off-victorias-coast/106151752",
          "published_at": "Tue, 16 Dec 2025 20:21:52 +0000",
          "title": "Sailors rescued from yacht off Victoria's coast",
          "standfirst": "Police release video showing two men being winched to safety after abandoning their yacht in rough seas off Lakes Entrance.",
          "content": "Police release video showing two men being winched to safety after abandoning their yacht in rough seas off Lakes Entrance.",
          "feed_position": 23
        }
      ],
      "popularity_score": 147.03184694444445
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 16:02:04 +0000",
      "title": "Ukraine peace deal could be presented to Russia within days: Zelenskyy",
      "neutral_headline": "Ukraine peace deal could be presented to Russia within days: Zelenskyy",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-17/ukraine-war-wrap-deal-could-be-presented-to-russia-in-days/106151590",
          "published_at": "Tue, 16 Dec 2025 16:02:04 +0000",
          "title": "Ukraine peace deal could be presented to Russia within days: Zelenskyy",
          "standfirst": "Marathon talks between the US and Ukraine led to \"not perfect\" but \"very workable\" framework that could bring to an end Russia's near four-year-old invasion, the Ukrainian president says.",
          "content": "Marathon talks between the US and Ukraine led to \"not perfect\" but \"very workable\" framework that could bring to an end Russia's near four-year-old invasion, the Ukrainian president says.",
          "feed_position": 12
        }
      ],
      "popularity_score": 145.70184666666665
    }
  ]
}