{
  "updated_at": "2026-01-26T07:28:26.540Z",
  "clusters": [
    {
      "id": "cluster_12",
      "coverage": 3,
      "updated_at": "Mon, 26 Jan 2026 17:50:31 +1100",
      "title": "Australia Day 2026 LIVE: Police line on Spring Street keeps Invasion Day crowd from March for Australia rally",
      "neutral_headline": "Man arrested for alleged neo-Nazi hate speech at protest",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/australia-day-2026-live-melbourne-rallies-to-take-place-outside-parliament-house-flinders-street-station-20260126-p5nwyi.html",
          "published_at": "Mon, 26 Jan 2026 17:50:31 +1100",
          "title": "Australia Day 2026 LIVE: Police line on Spring Street keeps Invasion Day crowd from March for Australia rally",
          "standfirst": "Invasion Day activists and anti-immigration protesters will converge on Melbourne CBD as part of Australia Day demonstrations. Follow updates live.",
          "content": "Invasion Day activists and anti-immigration protesters will converge on Melbourne CBD as part of Australia Day demonstrations. Follow updates live.",
          "feed_position": 10,
          "image_url": "https://static.ffx.io/images/$zoom_0.174320987654321%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_106/t_crop_custom/q_86%2Cf_auto/746f3b9b85a81da5b0028e3e9a381a5644a98c5c"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/invasion-day-australia-day-protests-thousands-expected-to-rally-in-capital-cities/95d2cf97-18d5-41e1-87b3-3d1ddec8e12a",
          "published_at": "Mon, 26 Jan 2026 06:46:41 +0000",
          "title": "Man arrested for alleged neo-Nazi hate speech at protest",
          "standfirst": "Thousands of people have joined rallies in cities across Australia, with Invasion Day events and March for Australia anti-immigration demonstrations taking place.",
          "content": "Thousands of people have joined protests in cities around Australia today, with Invasion Day rallies and counter March for Australia demonstrations taking place.January 26, the day Governor Arthur Phillip ran up the British flag at Sydney Cove, is officially Australia Day, but mark the date as Invasion Day, recognising the dispossession of Indigenous Australians.Protests were organised in every Australian capital today, with NSW Police announcing recently they had tweaked the extended protest ban in place after the Bondi Beach attack in order to allow activists to march in certain areas of Sydney.Warning: This article contains the name and image of an Indigenous person who has died. READ MORE: Hundreds flee homes as Victoria bushfire breaks containmentMan arrested over alleged neo-Nazi speech in SydneyA man has been arrested over alleged neo-Nazi comments he made during an open-mic session during Sydney&#x27;s March for Australia protest at Moore Park.The 31-year-old was stopped on nearby Bourke Street in Surry Hills after his comments and taken into custody.He was assisting police with inquiries, with charges expected to be laid soon. Operation Australia Day Commander Brett McFadden alleged the man engaged in hate speech aligned with neo-Nazi ideology.\"We arrested a 31-year-old male who engaged in what we will allege is a hate speech during an open mic session at Moore Park,\" he told reporters.\"We will allege that the language he used, his presence, was clearly and unequivocally aligned with neo-Nazi ideology and his presence and language incited a response from the crowd, generating hate towards a particular group in our community.\"NSW Premier Chris Minns said police were on high alert for any protesters who violate federal legislation during the marches in Sydney.\"There will be no tolerance for violence or hate speech on Sydney streets,\" he said.\"We live in a beautiful multicultural community with people from around the world, but we will not tolerate a situation where, on Australia&#x27;s national day, it&#x27;s been pulled down by divisive language, hate speech or racism.\"Minns said he has not ruled out introducing stricter legislation, saying people have a right to enjoy the city. \"I do believe we have to confront this idea that the centre of Sydney can be dominated weekend after weekend after weekend by the same protest,\" he said.\"People have got a right to protest, but other Australians have a right to enjoy the city.\"My responsibility is to keep the people of NSW safe, and to balance those rights.\"Two others were arrested under Operation Australia Day.A 17-year-old man was arrested in Bondi for allegedly assaulting police and is being questioned by police.A 28-year-old was charged with domestic violence offences at Victoria Park, which were unrelated to the protests.McFadden said despite the few incidents, the overwhelming majority of the crowds were respectful.About 18,000 people turned up for the Invasion Day rally in Sydney, while 2000 attended the March for Australia rally. The Invasion Day protest kicked off with a heavy police presence in Hyde Park about 10am.The rally began with a moving tribute to Sophie Quinn, an Indigenous woman who was allegedly shot dead by her former partner in Lake Cargelligo in NSW last week.Quinn&#x27;s aunt Neruda and her friend John Harris were also killed in the shooting. Protesters at today&#x27;s rally are holding signs that read \"Stop killing us\" and \"sovereignty never ceded\".Members of the Palestine Action Group also showed their support at the rally.Later, the March for Australia anti-immigration rally kicked off at Cleveland Street to Moore Park.Tensions flared between opposing groups.In one instance, residents were involved in an \"exchange of views\" with March for Australia protesters.McFadden said police intervened and de-escalated the situation before anything could happen. Another protester was seen carrying a sign that called to \"free Joel Davis\", the neo-Nazi leader who is accused of allegedly urging followers to \"rhetorically rape\" Wentworth MP Allegra Spender.A brief scuffle broke out between Invasion Day demonstrators and a group of men with Australian flags, The Sydney Morning Herald reported. Police officers intervened again before the rally continued towards Broadway.Aerial images show twin rally crowd sizes in MelbourneThere were also opposing protests being held on the steps of Victorian Parliament in Melbourne&#x27;s CBD and outside the Flinders Street train station.A smoking ceremony took place outside parliament to mark the beginning of the Invasion Day protest. Meanwhile, March for Australia protesters waved the national flag as they walked through the CBD. Aerial vision from the 9News helicopter showed thousands of people part of the Invasion Day rally, while there was a visibly smaller turnout for the opposing March for Australia rally outside Flinders Street station.Some demonstrators could be heard chanting \"always was, always will be, Aboriginal land\".9News captured footage of a confrontation between opposing protesters near the steps of parliament , which led to one woman being knocked to the ground.Police were on the ground monitoring the situation.They have not been able to share a firm crowd figure for either of the protests.Captain Cook statue under guardA security guard kept an eye on a Captain Cook memorial statue in St Kilda after the monument was toppled by vandals on Australia Day two years ago.Port Phillip Council hired a guard to protect the statue from potential defacement today.The sculpture was sawn off at the ankles and painted with the words \"the colony will fall\" in 2024. In 2022, red paint was also thrown across the statue over three consecutive days.Pauline Hanson speaks to crowd in BrisbaneOne Nation Senator Pauline Hanson made an appearance at an Australia Day march in Brisbane&#x27;s Botanic Gardens in the CBD.The Hoodoo Gurus anthem What&#x27;s My Scene? played as she was welcomed to the stage.She decried \"mass migration\" in Australia during her speech and said Anthony Albanese was the \"worst prime minister I have ever known\".March for Australia protesters in CanberraMeanwhile, in Canberra, an opposing March for Australia protest took place outside Parliament House.The Australian Federal Police was out in full force as protesters waved Australian flags and marched towards Lennox Gardens in Yarralumla.An Invasion Day protest also began at 10am in Canberra and is expected to finish at Old Parliament House.Police warned the protests could cause traffic disruptions in the capital today. &#x27;Zero tolerance&#x27; for hate speech , violenceNSW Premier Chris Minns said police were on high alert for any protesters who violate federal legislation during the marches in Sydney.\"There will be no tolerance for violence or hate speech on Sydney streets,\" he said.\"We live in a beautiful multicultural community with people from around the world, but we will not tolerate a situation where, on Australia&#x27;s national day, it&#x27;s been pulled down by divisive language, hate speech or racism.\"Minns said he was confident protesters would respect exclusion zones and that police had been liaising with organisers for weeks to ensure today goes ahead without incident.When asked about his plans to tighten protest laws further in NSW, the premier said he had not ruled out introducing stricter legislation.Minns said he has not ruled out introducing stricter legislation, saying people have a right to enjoy the city. \"I do believe we have to confront this idea that the centre of Sydney can be dominated weekend after weekend after weekend by the same protest,\" he said.\"People have got a right to protest, but other Australians have a right to enjoy the city.\"My responsibility is to keep the people of NSW safe, and to balance those rights.\"He said the state government would also look at changing the scope of hate slogan laws in the wake of federal laws, which were passed in parliament last week. Support for Australia Day rising Recent polls, including from Resolve and Roy Morgan, indicate that support for keeping Australia Day on January 26 is rising.Roy Morgan found that 72 per cent of respondents agreed Australia Day should retain its current name and date, compared to 28 per cent who disagreed.\"This is the highest support for Australia Day recorded by Roy Morgan,\" chief executive Michele Levine said.\"There is majority support for Australia Day retaining its name and date across all age groups, genders, and all states. \"However, there remains a political divide, with most Labor and Greens voters saying the date should be changed, while Liberal, National, and One Nation voters hugely supported it.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/79184210-eb50-425c-8282-94ddea2d102e"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/march-for-australia-anti-immigration-rally/106269414",
          "published_at": "Mon, 26 Jan 2026 06:20:06 +0000",
          "title": "Neo-Nazis ejected from March for Australia rally in Sydney",
          "standfirst": "A 31-year-old was arrested by police, who accused the man of hate speech at an open mic session at the anti-immigration rally.",
          "content": "A 31-year-old was arrested by police, who accused the man of hate speech at an open mic session at the anti-immigration rally.",
          "feed_position": 2
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.174320987654321%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_106/t_crop_custom/q_86%2Cf_auto/746f3b9b85a81da5b0028e3e9a381a5644a98c5c",
      "popularity_score": 3019.3679055555554
    },
    {
      "id": "cluster_39",
      "coverage": 3,
      "updated_at": "Mon, 26 Jan 2026 03:49:51 +0000",
      "title": "Talent is being 'left on the launch pad', new Australian of the Year warns",
      "neutral_headline": "Talent is being 'left on the launch pad', new Australian of the Year warns",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/australian-of-the-year-katherine-bennell-pegg-on-space-and-stem/106269082",
          "published_at": "Mon, 26 Jan 2026 03:49:51 +0000",
          "title": "Talent is being 'left on the launch pad', new Australian of the Year warns",
          "standfirst": "The 2026 Australian of the Year — astronaut and space engineer Katherine Bennell-Pegg — is a strong advocate for STEM education, but fears too much talent is being left on the \"launch pad\".",
          "content": "The 2026 Australian of the Year — astronaut and space engineer Katherine Bennell-Pegg — is a strong advocate for STEM education, but fears too much talent is being left on the \"launch pad\".",
          "feed_position": 10
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australian-of-the-year-2026-awards-winners-named/dbe1d247-7606-47cb-a4fa-b9f0019b433c",
          "published_at": "Sun, 25 Jan 2026 10:07:40 +0000",
          "title": "Our first astronaut's moving Australian of the Year message",
          "standfirst": "Australia didn&#x27;t even have a space agency when she dreamed of going to space. It didn&#x27;t matter.",
          "content": "When Katherine Bennell-Pegg was asked at school to write down three career options, she chose just one: astronaut.Australia didn&#x27;t even have a space agency at the time but it didn&#x27;t matter. In 2024 she became the first Australian to qualify as an astronaut under Australia&#x27;s space program.Now she can add one more honour to her already impressive CV: Australian of the Year 2026.\"As a kid, I used to lie on the dry grass in my backyard and gaze up at the stars in awe,\" she said tonight.\"That imperative to look to the sky and wonder, to innovate and explore is an ancient one on this continent.\"Australia&#x27;s first nations, people&#x27;s deep connection to Sky Country reminds us that, looking up, has always been part of who we are.\"Bennell-Pegg said her childhood dream felt so far away but paid tribute to \"incredible Australians\" Dr Paul Scully-Power and Dr Andy Thomas, who went to space with another nation&#x27;s flag on their arm.\"So at the astronaut centre, when I received my blue flight suit, and right there, bright on the left shoulder was the Australian flag, it was quite emotional, because it marked something so, so much greater than myself.\"It said that the door has opened for Australia to take our place at the forefront of human endeavour, a chance to collaborate with other nations at the cutting edge of the cutting edge, showcase what we&#x27;re made of, and access the collective discoveries and benefits that all involved countries will make.\"And it gave me hope, hope that one day, more of the flags on spacesuits will follow.\"But Bennell-Pegg warned the nation was \"leaving too much talent on the launchpad\" as young people turned away from STEM subjects.\"A wonderful part of our culture, I think, is how we give it a go in sports, even if we&#x27;re the weakest on the field,\" she said.\"But when it comes to maths and science, if we&#x27;re not top of the class, or we don&#x27;t fit the stereotype, we often shy away. We&#x27;re even encouraged away.\"So if I may be allowed another dream beyond being an astronaut, it&#x27;s this that we bring that same \"give it a go\" spirit from the sports field to the STEM fields, backing each other and ourselves with the trust that we can do hard, important things. \"Imagine what more we would discover, what great problems we would solve, how our horizons would expand.\"YOUNG AUSTRALIAN OF THE YEAR Nedd Brockman was named Young Australian of the Year for 2026 after capturing the nation&#x27;s hearts and minds with an almost 4000-kilometre run across Australia on his mission to end homelessness.After the 23-year-old electrician spent 46 days running from Perth&#x27;s Cottesloe Beach to Bondi Beach in 2022, raising $2.6 million, he&#x27;s shown no signs of slowing down.Later, he ran 1000 miles (1600 kilometres) around Sydney Olympic Park, a gruelling feat he joked probably shaved about 20 years off his live.READ MORE: K&#x27;gari pack of dingoes to be euthanisedSince starting Nedd&#x27;s Uncomfortable Challenge in 2024, Brockmann and his team have raised more than $8 million for those experiencing homelessness.Admitting that he was a \"blubbering mess\", Brockmann called out singer John Farnham&#x27;s 1987 Australian of the Year acceptance speech, in which he spoke about the importance of making sure our national pride encompasses humanity.\"Ever the eternal optimist, I think I see a bit of what I hope for in those words myself,\" Brockmann said tonight.\"We should be proud of this amazing country. We are so lucky to call it home. \"But unfortunately, not everyone feels that way in a country as prosperous as Australia, why is it that 122,000 Australians sleep rough every night? \"That number should stop us all in our tracks.\"READ MORE: Fire doubles in size as state endures once in 20-year heatwave2026 SENIOR AUSTRALIAN OF THE YEAR A psychiatrist whose father&#x27;s Alzheimer&#x27;s disease diagnosis kickstarted a life dedicated to fighting dementia was recognised with the Senior Australian of the Year award.Professor Henry Brodaty AO dementia treatment research revolutionised his own field along with the lives of many people living with the disease and their families.His Centre for Healthy Brain Ageing, founded in 2012, has led internationally significant research and his Maintain Your Brain trial showed what a major difference simple preventions could make.\"Almost half the cost of dementia is caused by preventable factors that we can modify in our lifestyle,\" he said tonight.\"Now, our randomised control trial of an intensive online lifestyle coaching program had the best results yet in the world in maintaining cognition.\"We did a cost benefit analysis. The program paid for itself in reducing health costs, we designed this a decade ago. We can do better. We can do a lot better.\"Brodaty dedicated the award to all older Australians, especially those and their families affected by dementia. \"Oer four decades, we have moved from hopelessness to hope, from stigma to science and I&#x27;m proud to have been part of this transformation,\" he said.\"There is so much we can do. There&#x27;s so much we must do.\"2026 AUSTRALIAN LOCAL HERO Indigenous business owner Frank Mitchell was crowned Australia&#x27;s Local Hero in the first award of the night.The proud Whadjuk-Yued Noongar knew it was a huge opportunity when he was offered an electrical apprenticeship as a young, single father who&#x27;d been affected by suicide but wasn&#x27;t sure if he could complete it.When he started his own business in 2015, he pledged to offer the same opportunities to fellow Indigenous people.Wilco Electrical started with eight staff and $1.5 million turnover, created more than 70 Indigenous upskilling positions and awarded more than $11 million to indigenous subcontractors. His four companies now employ more than 200 full-time staff.\"I used to advocate for organisations to simply give Mob a job, but I know now opportunity alone is not enough,\" he said.\"If workplaces are not not culturally safe, Mob may survive, but they are unlikely to thrive.\"Wilco, Kardan, Baldja and Bilyaa are places where Mob are given a chance to feel safe, and it still does not always work, because people&#x27;s lives are complex, and there is no one size fits all approach, but when it does work, the impacts are powerful.\"That&#x27;s what I represent standing here before you today. And I am just one success story among many.\"READ MORE: Police respond to potential sighting of accused triple murderer2026 AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Professor Rose McGready (Thailand)Professor Rose McGready, 61, has spent three decades providing health services to displaced people in the border region between Thailand and Myanmar.Arriving as a young doctor, Rose discovered that refugees who had fled persecution in Myanmar had difficulty accessing medical assistance in Thailand. In response, Rose established training for local staff to focus on services for expectant mothers and in the critical period of childbirth. Over the past 31 years, she has built a network of locally run clinics and out-patient services which have saved thousands of lives.Rose&#x27;s research has also led to new treatments being developed to tackle maternal malaria. Her findings have been adopted by the World Health Organisation as the global standard for combatting the disease, helping to treat millions of women around the world.Rose&#x27;s commitment, compassion and clinical expertise provide life-saving aid to some of the most vulnerable communities in the world. New South Wales - Dr Alison Thompson OAM (Sutherland Shire)Dr Alison Thompson has deployed over 30,000 volunteers to the world&#x27;s worst disaster zones - bringing humanitarian assistance and medical aid to over 18 million people.It started on September 11, 2001, when as an investment banker, Alison rushed to New York&#x27;s World Trade Centre with her first aid kit. She stayed nine months, offering disaster relief arm-in-arm with ordinary, like-minded people.Galvanising grassroots momentum, Alison founded Third Wave Volunteers - a global movement of first responder volunteers who bring relief to the world&#x27;s disaster and war zones, including Ukraine, Syria, Afghanistan, and Sri Lanka. Following the 2004 tsunami, she set up the first Tsunami Early-Warning Centre and education museum, which continues to thrive.By mobilising everyday people, 61-year-old Alison is building resilience in local communities through sustainable, locally driven disaster prevention and recovery. Drawing from her upbringing as a pastor&#x27;s child, Alison believes that each person&#x27;s small skills add up to drive big changes.Northern Territory - Dr Felix Ho ASM (Darwin)Dr Felix Ho tirelessly serves remote communities in the Northern Territory as a medical practitioner. But for Felix, that&#x27;s not enough – he also volunteers thousands of his hours building the St John Youth Program and helps at public events as a St John first responder.Since joining as a St John cadet in 1995 at the age of 13, Felix has faithfully served others, including overseas as an Intensive Care Paramedic on a United Nations mission to Timor-Leste.In 2020, he took on national leadership of the youth portfolio for St John Ambulance Australia, where he&#x27;s a guiding force for over 3,000 young people, equipping the next generation of first responders. Aligned with clinical standards, Felix developed interactive, accessible and engaging training for youth and cadets across Australia.Now 43, Felix brings people together across geography and generations, to equip Australia&#x27;s youth to save lives through first aid in an emergency.Queensland - Dr Rolf Gomes (Kenmore Hills)When Dr Rolf Gomes, 52, was confronted with how differently cardiac patients were treated in rural and remote Australia, he decided to do something about it. He designed and launched the first Heart of Australia mobile &#x27;Heart Trucks&#x27; to visit remote communities.Today the Heart Trucks bring regular specialist clinics to over 30 towns in rural Australia, providing early diagnostic services that would otherwise be out of reach. Since 2014, the trucks have treated more than 20,000 patients and saved countless lives. The truck fleet will expand to 11 trucks by 2027 to provide services nationally, adding new diagnostic services for a wide range of early intervention health screenings, including for lung cancer.Rolf&#x27;s vision, ingenuity and tenacity have had a far-reaching impact on rural health and medicine in Australia, helping to save lives and ensure that rural patients have access to clinical services without having to travel long distances.South Australia - Katherine Bennell-Pegg (West Beach)Katherine Bennell-Pegg is making history as the first Australian to qualify as an astronaut under Australia&#x27;s space program, opening pathways for others to follow.Katherine graduated from Basic Astronaut Training in 2024 as part of a class of six trained by the European Astronaut Centre in Germany – the first international candidate to do so. She was initially chosen for the program from a field of over 22,500 applicants.Katherine has harboured ambitions of becoming an astronaut since she was a young child. As a space engineer, she has advanced multiple space missions and technologies.Alongside her career achievements, Katherine is an energetic champion for Australia&#x27;s space program, regularly presenting to audiences of schoolchildren and industry leaders to inspire the next generation and create new opportunities.Katherine, 41, is a genuine trailblazer in Australia&#x27;s emerging space industry. With her determination and drive to succeed, she is a powerful example for young Australians.Tasmania - Dr Jorian (Jo) Kippax (Ridgeway)Dr Jo Kippax was part of a specialist team of rescuers tasked to free a whitewater rafter who was trapped in perilous rapids on the Franklin River in 2024.Lithuanian whitewater rafter, Valdas Bieliauskas, was retrieved from freezing water by Jo and his team.The clinical team performed an operation to amputate Valdas&#x27;s leg underwater, allowing him to be freed and ultimately saving his life. Throughout the rescue, Jo was instrumental in guiding the team with professionalism, courage and remarkable calmness under pressure.For this life-saving act, the President of Lithuania, Gitanas Nausėda awarded the country&#x27;s Life Saving Cross award to Jo, which he humbly accepted on behalf of his team.The rescue of Valdas is just one chapter in Jo&#x27;s long career in emergency medicine, disaster response, and search and rescue. Demonstrating outstanding skill, courage and team leadership in the aid of others, 55-year-old Jo displays selfless dedication to saving lives in often very challenging circumstances.Victoria - Carrie Bickmore OAM (Melbourne)Carrie Bickmore is a radio and television presenter who has changed the way that brain cancer research is funded in Australia.Brain cancer kills more Australian children than any other disease, and more people aged under 40 than any other cancer – including Carrie&#x27;s late husband Greg, who passed away in 2010.Since 2015, Carrie has raised over $27 million. In 2021, she established The Brain Cancer Centre to bring together the brightest minds in research to find a cure.The Brain Cancer Centre has leveraged investment by Carrie&#x27;s Foundation to secure another $45 million of research funding. This supports research projects across the country and is delivering specific clinical trials for brain cancer patients that are the first of their kind in the world.Carrie is striving to ensure that every Australian diagnosed with brain cancer can access the best treatments and has real hope of a positive outcome.Western Australia - Dr Daniela Vecchio (Parklands)Dr Daniela Vecchio is head of mental health and addiction services at Fiona Stanley Hospital. She is the pioneer in establishing the first publicly funded gaming disorder clinic in Australia in 2022.She has seen increasing numbers of young people with addiction to video games and social media and was quick to recognise the distress and harms caused to them and their families. The clinic is unique worldwide in providing early detection and intervention in an acute hospital setting.Daniela, 57, has driven the development of holistic assessments and a wide range of personalised treatments for her clients. She has fostered extensive collaborations, including internationally with Korea, Germany and Dubai, nationally with experts in the field, and locally with health, education and police services.As a director of the Australian Gaming and Screens Alliance, she is promoting education and research into harmful online use and influencing national policy.2026 SENIOR AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Heather Reid AM (Kiels Mountain)New South Wales - Professor Henry Brodaty AO (Double Bay)Northern Territory - Jenny Duggan OAM (Katherine)Queensland - Cheryl Harris OAM (Sunshine Coast)South Australia - Malcolm Benoy (Mount Osmond)South Australia - James Currie (Carrickalinga)Tasmania - Julie Dunbabin (Taroona)Victoria - Bryan Lipmann AM (Richmond)Western Australia - Professor Kingsley Dixon AO (Waroona)2026 YOUNG AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Sita Sargeant (Canberra)New South Wales - Nedd Brockmann (Randwick)Queensland - Jarib Branfield-Bradshaw (Cunnamulla)South Australia - Chloe Wyatt-Jasper (Gawler South)Tasmania - Alyssia Kennedy (Heybridge)Victoria - Abraham Kuol (Narre Warren)Western Australia - Dr Haseeb Riaz and Gareth Shanthikumar (Peppermint Grove& City Beach)",
          "feed_position": 11,
          "image_url": "https://prod.static9.net.au/fs/b62e5af0-58b9-4dd0-92bb-65a9ee7dd11a"
        },
        {
          "source": "Canberra Times",
          "url": "https://www.canberratimes.com.au/story/9160378/astronaut-katherine-bennell-pegg-is-2026-australian-of-the-year/",
          "published_at": "Sun, 25 Jan 2026 20:47:00 +1100",
          "title": "'So much greater than myself': our first astronaut is a true blue inspiration",
          "standfirst": "2026 Australian of the Year is astronaut Katherine Bennell-Pegg.",
          "content": "2026 Australian of the Year is astronaut Katherine Bennell-Pegg.",
          "feed_position": 0,
          "image_url": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/LCCM7haWhjq8sXGapHMpfU/1fd1f9c0-427f-4549-a1a9-a3edf226f16d.jpg/r0_259_5000_3076_w600_h338_fmax.jpg"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/b62e5af0-58b9-4dd0-92bb-65a9ee7dd11a",
      "popularity_score": 3016.3567944444444
    },
    {
      "id": "cluster_0",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 18:26:41 +1100",
      "title": "Great Ocean Road towns urged to evacuate; Victoria braces for record heat",
      "neutral_headline": "Great Ocean Road towns urged to evacuate; Victoria braces for record heat",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/victoria-set-to-reach-49-degrees-as-communities-brace-for-week-long-heatwave-20260125-p5nwue.html",
          "published_at": "Mon, 26 Jan 2026 18:26:41 +1100",
          "title": "Great Ocean Road towns urged to evacuate; Victoria braces for record heat",
          "standfirst": "Residents have been told to get out of the Otways danger zone by sunset, before a day of extreme heat that has triggered a statewide total fire ban.",
          "content": "Residents have been told to get out of the Otways danger zone by sunset, before a day of extreme heat that has triggered a statewide total fire ban.",
          "feed_position": 0,
          "image_url": "https://static.ffx.io/images/$zoom_0.51708984375%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_127/t_crop_custom/q_86%2Cf_auto/f7ff35cc856f4fb052d334037b7bfcc1428311b4ff7c50b1b9e6f4f055d672ae"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/more-than-1100-properties-evacuated-near-otways-fire-20260126-p5nx4v.html",
          "published_at": "Mon, 26 Jan 2026 18:19:51 +1100",
          "title": "More than 1100 properties evacuated near Otways fire",
          "standfirst": "Residents near an out-of-control bushfire in the Victorian Otways have been told to get out before sunset as the state braces for potentially record-breaking heat.",
          "content": "Residents near an out-of-control bushfire in the Victorian Otways have been told to get out before sunset as the state braces for potentially record-breaking heat.",
          "feed_position": 3,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/2b0e5e3985da44bebe0d9ead86792d2b2972ef9d"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/vic-otways-fire-not-contained/106267634",
          "published_at": "Sun, 25 Jan 2026 21:44:58 +0000",
          "title": "More than 1,100 properties told to evacuate near Vic Otways fire",
          "standfirst": "Residents from more than 1,100 properties near Victoria's Otways bushfire have been asked to evacuate before sunset ahead of extreme fire conditions on Tuesday.",
          "content": "Residents from more than 1,100 properties near Victoria's Otways bushfire have been asked to evacuate before sunset ahead of extreme fire conditions on Tuesday.",
          "feed_position": 2
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.51708984375%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_127/t_crop_custom/q_86%2Cf_auto/f7ff35cc856f4fb052d334037b7bfcc1428311b4ff7c50b1b9e6f4f055d672ae",
      "popularity_score": 2019.9706833333332
    },
    {
      "id": "cluster_2",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 18:23:41 +1100",
      "title": "Police scour coastline for missing boy last seen on Victorian beach",
      "neutral_headline": "Police scour coastline for missing boy last seen on Victorian beach",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/police-scour-coastline-for-missing-boy-last-seen-on-victorian-beach-20260126-p5nx4x.html",
          "published_at": "Mon, 26 Jan 2026 18:23:41 +1100",
          "title": "Police scour coastline for missing boy last seen on Victorian beach",
          "standfirst": "Authorities are continuing to scour waters on Victoria's east coast after a 12-year-old Melbourne boy disappeared while swimming.",
          "content": "Authorities are continuing to scour waters on Victoria's east coast after a 12-year-old Melbourne boy disappeared while swimming.",
          "feed_position": 2,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/1b140f0c6703745cbbd15c90978957d6e9b149ea"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/missing-swimmer-desperate-search-for-melbourne-boy-missing-at-venus-bay-on-victorias-coast/22eba6b4-cca6-485e-94ad-83c90158139d",
          "published_at": "Mon, 26 Jan 2026 03:35:59 +0000",
          "title": "Police continue to scour waters for missing boy last seen on Victorian beach",
          "standfirst": "Danny was last seen swimming at the beach about 11.30am yesterday, when his family lost sight of him in the water.",
          "content": "Authorities are continuing to scour waters on Victoria&#x27;s east coast after a 12-year-old Melbourne boy disappeared while swimming.Danny was last seen swimming at No. 4 Beach in Venus Bay, about 120 kilometres south-east of Melbourne, around 11.30am yesterday.His family, from Taylors Hill, and members of the public, started searching for him after losing sight of him about 11.30am.READ MORE: Three shot dead in NSW town &#x27;related&#x27; to alleged killer, police sayThe Air Wing, water police, the coast guard, SES, Life Saving Victoria, uniform police and other beachgoers searched for Danny until the late hours of the night, but were unable to find any trace of him.The search of No. 4 Beach resumed at 5am today, with a large vessel from Melbourne expected to arrive this afternoon to assist search efforts.\"His family are obviously distraught, as any parent wuold be in a situation like this ,\" Acting Senior Sergeant Matt Wade said.\" We&#x27;ll continue to search today whilst it&#x27;s safe to do so and whilst we&#x27;ve got light.\"Danny was described as about 170 centimetres tall with a thin build, dark, short hair and dark eyes.He was wearing a navy blue rash vest and navy blue boardshorts with a white stripe when he disappeared. Police are urging anyone who&#x27;s seen Danny to contact Wonthaggi Police.Venus Bay&#x27;s tiny population of 500 can surge into the thousands as anglers, surfers and families arrive for holidays, according to Visit Melbourne.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/3f6d1037-0ac3-495b-8c54-9c6482826855"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/1b140f0c6703745cbbd15c90978957d6e9b149ea",
      "popularity_score": 2019.9206833333333
    },
    {
      "id": "cluster_6",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 07:14:12 +0000",
      "title": "Temperature record shattered as historic heatwave smothers states",
      "neutral_headline": "Temperature record shattered as historic heatwave smothers states",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/weather-australians-sweat-through-blistering-longweekend-heatwave/f4b3024c-aec2-4468-b14d-6fed7cabeb5d",
          "published_at": "Mon, 26 Jan 2026 07:14:12 +0000",
          "title": "Temperature record shattered as historic heatwave smothers states",
          "standfirst": "A remote South Australian town has recorded its hottest day on record as a \"historic\" heatwave pushes temperatures near 50 degrees across several states .",
          "content": "A remote South Australian town has recorded its hottest day on record as a historic heatwave pushes temperatures near 50 degrees across several states .Effects of the ex-tropical cyclone Luna and a high-pressure system in the Tasman Sea are creating a prolonged heat mass over South Australia, Victoria, New South Wales and Queensland.The system caused temperatures to soar, Australia Day events to be cancelled in Adelaide, and a heightened bushfire threat across Victoria.READ MORE: Thousands join protests around the country on Australia Day Ceduna, a small town about 780km from Adelaide , had its hottest day on record after it reached 49.1 degrees today, beating its previous record of 48.9 degrees in December 2019.The Bureau of Meteorology&#x27;s Dean Narramore said the record-breaking temperature could nudge higher still.Wudinna Airfield recorded the hottest January day on record at 48.4 degrees, which was equal to the temperatures recorded in December 2019.The rest of the affected states reached past 45 degrees.\"Just huge areas of inland Australia, pretty much at and above 44 or 45 degrees today,\" Narramore said.He added the high temperatures were unusual for this time of year.\"That&#x27;s pretty record-breaking. It&#x27;s a very unusual, record-breaking heatwave, and in some way, historic heatwave for parts of inland and south-eastern Australia,\" he said.Several Australia Day events were cancelled in Adelaide as the mercury hit 45 degrees.READ MORE: Popular Sydney beach closed over second shark sighting The Aus Lights on the River and the evening fireworks have been cancelled because of the heat; usually about 25,000 spectators take part in the annual event.The mercury is forecast to remain above 40 degrees tomorrow, with the city of churches set to experience maximum temperatures above 30 degrees all the way until Saturday. Parts of Victoria are also set to swelter, with Melbourne reaching 44 degrees tomorrow, and parts of the state getting close to 50 degrees.Mildura in Victoria&#x27;s north-west is expected to have temperatures of 48 degrees tomorrow, which would break the town&#x27;s record of 47.2 degrees, set back in 1939.Victoria&#x27;s heat is intensifying the threat of bushfires that have been burning across the state all weekend, with fires in several areas of the state burning out of control.Residents in parts of the Otway ranges, the Dargo area and near Walwa are being told to prepare for an evacuation as fire conditions continue to be severe.READ MORE: Sydney woman charged after allegedly trying to smuggle $36 million of methBrisbane will also see hot weather this week, after a top of 36 degrees today, while Canberra will soar to 42 degrees on Wednesday. Emergency services were forced to issue an urgent reminder not to leave children, pets or older people unattended in vehicles after paramedics responded to 11 cases of children locked in hot cars across Melbourne and regional Victoria.\"The temperature inside a vehicle can double and become deadly within minutes,\" Ambulance Victoria Director of Emergency Management Dale Armstrong said.\"It is particularly dangerous for children to be left inside vehicles, as a child&#x27;s body temperature rises three to five times faster than an adult.\"\"If you are on the coast you will see a bit of relief coming through on Tuesday, but that does mean we are expecting some very hot days on the way,\" the Bureau of Meteorology&#x27;s Jonathan How said.\"Anywhere inland, unfortunately relief only comes at the end of the week, even into next weekend, so we are looking at a run of five to seven days above 40 degrees and some locations even above 45 degrees, even pushing towards 50 degrees.\"READ MORE: Sussan Ley&#x27;s right-hand man dismisses speculation of leadership spillNarramore said there will likely be more records broken this week as the hot weather system moves across to Victoria, New South Wales and then Queensland.\"We could see many locations in eastern South Australia, western and south-western Victoria break January record and a few places could also have their hottest day on record, \" he said.While Australians on the east coast prepare to sweat through the week, those in the west are dealing with the impact of a second tropical cyclone in a matter of weeks.Ex-tropical Cyclone Luana made landfall as a Category 2 system when it made landfall along the Dampier Peninsula north of Broome.Wind gusts up to 106km/h were recorded north of Broome, in Lombadina, along with more than 100 millimetres of rain since midnight on Saturday.The storm has since weakened to a tropical low, but could still bring falls of up to 200mm in parts of WA.Residents along the Kimberley coast should expect heavy rainfall and damaging winds over the long weekend, which is only expected to ease from Tuesday.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 5,
          "image_url": "https://prod.static9.net.au/fs/297cd8e9-02d2-48f7-9f34-ae9435e4db63"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/south-east-australia-weather-hit-close-to-50c-worst-heatwave/106270302",
          "published_at": "Mon, 26 Jan 2026 06:56:27 +0000",
          "title": "'Heat dome' to shatter records as south-east soars to nearly 50C",
          "standfirst": "A record heatwave across south-east Australia will peak during the coming days, leading to extreme fire danger and temperatures close to 50 degrees Celsius in multiple states.",
          "content": "A record heatwave across south-east Australia will peak during the coming days, leading to extreme fire danger and temperatures close to 50 degrees Celsius in multiple states.",
          "feed_position": 1
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/weather-warnings-victoria-heatwave-queensland-flooding/89cf0ec6-6297-47bc-9c05-0ce55711a720",
          "published_at": "Sat, 24 Jan 2026 10:04:37 +0000",
          "title": "Temperatures nudge close to 50 degrees as multiple states brace for record-breaking heat",
          "standfirst": "And the one state that&#x27;s facing a record-breaking run of heatwave conditions beyond the Australia Day long weekend and into next week.",
          "content": "Victoria is facing a record-breaking run of heatwave conditions over this Australia Day long weekend and into next week.Adelaide ticked over 41.5 degrees today, while in other parts of the state, temperatures nudged towards 50 degrees with 48.2 degrees recorded in Tarcoola.Melbourne followed closely, with the city sweltering in 40 degree heat, halting play at the Australian Open.READ MORE: NSW beaches closed after shark attacks set to reopen in time for Australia Day long weekendThe heat also sparked emergency level bushfires in Victoria&#x27;s south-west, with multiple evacuation orders in place as firefighters attempt to contain the blaze.A total fire ban is in place for the entire state of Victoria, while South Australians face catastrophic fire danger on the Yorke and Eyre Peninsulas.In South Australia, south-westerly winds will knock temperatures back a few degrees tomorrow - down to 37 degrees in the city - but Adelaide could hit 45 degrees on Monday, making it the hottest Australia Day on record.Some relief may be on the way for Victoria but it won&#x27;t last long, with Tuesday looking even hotter.\"We&#x27;ve got a trough that&#x27;s pushing into south western parts of the state,\" Bureau of Meteorology senior meteorologist Sarah Scully said.\"The gusty north-westerly winds can keep the temperatures really elevated ahead of that cooler south-westerly change.\"Bureau of Meteorology senior meteorologist Christie Johnson said northern parts of Victoria could see temperatures into the 40s for potentially five or six days in a row.Johnson said Tuesday could be a day of concern with near-record temperatures of about 48 degrees.\"It could definitely be one of the hottest days that we&#x27;ve ever seen over Victoria,\" she said.Water police will be out in force with hundreds expected to pack beaches across the coast over the long weekend.\" Take care on our beaches, take care on our waterways and take care on our roads,\" Victoria Police acting superintendent Brett Coloe said.\"It&#x27;s going to be a very, very busy period.\"Residents have been warned to take care as the blistering sun can be deadly.\"Hot weather not only creates its own emergencies with people becoming dehydrated and leading to heat stress and stroke, but it can exacerbate normal medical problems as well, which increases our workload,\" Ambulance Victoria&#x27;s Andrew Burns said.&#x27;Catastrophic fire dangers&#x27; Scully told Today there&#x27;s the potential for temperature records to be broken, amid increased fire dangers.\"What this means is if any fires are ignited, they will most likely be impossible to control,\" Scully said this morning.\"Now, broadly speaking, when we do have catastrophic fire dangers in place, it&#x27;s recommended that people leave early.\"However, it&#x27;s important for any of the residents within these areas to listen to the advice from local emergency services. \"Tennis impacted Australian Open matches in Melbourne were halted after the Heat Stress Index reached five. Matches at the tournament had started half an hour early, so players could avoid the sweltering conditions .\"We&#x27;re assuming that the heat is not going to go away and we need to keep players safe,\" Chief Medical Officer for Tennis Australia , Caroline Broderick, told Today.READ MORE: Police open fire in Melbourne after police car allegedly rammed\"When the heat stress scale hits three, we have additional cooling measures on court.\"When it hits four, we have these rest breaks between the second and third set in women&#x27;s tennis and the men&#x27;s tennis.\"Heat stress scale hits five, we cancel or postpone all play on outside courts and close the roofs on our stadium courts.\"South Australia on track for record-breaking heat South Australia has sweltered through a day of extreme heat with some parts of the state, reaching close to 50 degrees.The extreme conditions have seen events cancelled across the state, with the latest casualty the Australia Day fireworks at Elder Park. Aus Lights on the river&#x27;s been scrapped for the first time in its history but the Mourning ceremony should still go ahead. \"Make no mistake, the state is set to bake for much of the next week,\" the Bureau of Meteorology&#x27;s John Fisher said.READ MORE: Family of Piper James given preliminary autopsy results Emergency Services Minister Rhiannon Pearce said additional aircraft, including a large aerial tanker, would be deployed if required across the state.Those planning long weekend road trips have been asked to think twice.\"Don&#x27;t go into the highest risk fire areas, and if you are and you have accommodation booked, please be sensible about it,\" Loughlin said.High electricity demand could also cause significant strain, making power outages a possibility.\"Common sense - we can do this, we can get through this hot weather if we work together and we make sensible decisions,\" Loughlin said.Tropical Cyclone crosses WA costOn the west coast of Australia, residents along the west Kimberley coast are feeling the effects of Tropical Cyclone Luana.The Category 2 storm crossed the WA coast north of Broome - between Beagle Bay and Cape Leveque - this afternoon [AWST] bringing destructive winds of up to 130km/h and heavy rainfall.A warning zone extends from Broome to Kuri Bay, including Derby and adjacent inland areas , with a severe weather warning in place for heavy rainfall and flash flooding about the central and northern Kimberley.The bureau warns of six-hour totals of up to 120 millimetres, with heavy falls bringing possible 24-hour totals of up to 200mm along the coastal fringes.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 16,
          "image_url": "https://prod.static9.net.au/fs/c363c411-1934-4875-a972-1a9fcd98cb86"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/297cd8e9-02d2-48f7-9f34-ae9435e4db63",
      "popularity_score": 2019.7626277777779
    },
    {
      "id": "cluster_13",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 06:47:27 GMT",
      "title": "Invasion Day: police clear Perth protest site amid reports of ‘threat’ as huge marches held across Australia",
      "neutral_headline": "Crowds warned to stay away as security threat mars Perth’s Invasion Day rally",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2026/jan/26/invasion-day-police-clear-perth-protest-site-due-to-threat-as-tens-of-thousands-march-across-australia-ntwnfb",
          "published_at": "Mon, 26 Jan 2026 06:47:27 GMT",
          "title": "Invasion Day: police clear Perth protest site amid reports of ‘threat’ as huge marches held across Australia",
          "standfirst": "Anti-immigration protesters clashed with First Nations people and supporters in Melbourne and Canberra at otherwise peaceful ralliesPolice in Western Australia have shut down the location of a planned Invasion Day rally after receiving reports of a threat targeting the Perth CBD.WA Police issued a warning on Monday afternoon urging the public to stay away from the area and await further advice, saying they had deployed “significant police resources” to and set up an exclusion zone around Forrest Place. One person is in custody, they said. Continue reading...",
          "content": "Anti-immigration protesters clashed with First Nations people and supporters in Melbourne and Canberra at otherwise peaceful ralliesPolice in Western Australia have shut down the location of a planned Invasion Day rally after receiving reports of a threat targeting the Perth CBD.WA Police issued a warning on Monday afternoon urging the public to stay away from the area and await further advice, saying they had deployed “significant police resources” to and set up an exclusion zone around Forrest Place. One person is in custody, they said. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/invasion-day-rallies-australia-january-26-australia-day/106267560",
          "published_at": "Mon, 26 Jan 2026 02:14:58 +0000",
          "title": "Crowds warned to stay away as security threat mars Perth’s Invasion Day rally",
          "standfirst": "Police say significant resources have been deployed to Perth's rally after there was a \"risk to safety',\" however there's been peaceful protests in all capital cities with thousands turning out to local events.",
          "content": "Police say significant resources have been deployed to Perth's rally after there was a \"risk to safety',\" however there's been peaceful protests in all capital cities with thousands turning out to local events.",
          "feed_position": 17
        }
      ],
      "popularity_score": 2019.3167944444444
    },
    {
      "id": "cluster_48",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 02:22:51 +0000",
      "title": "There's no one way to mark Australia Day — as communities across the nation have made clear",
      "neutral_headline": "PM calls for nation to 'come together' on Australia Day, millions celebrate",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/australia-day-celebrations-across-country-community-events/106268794",
          "published_at": "Mon, 26 Jan 2026 02:22:51 +0000",
          "title": "There's no one way to mark Australia Day — as communities across the nation have made clear",
          "standfirst": "Communities across the country are marking Australia Day with citizenship ceremonies, traditional dances, smoking ceremonies and fun runs, as the prime minister calls for \"unity not division\" during a speech in Canberra.",
          "content": "Communities across the country are marking Australia Day with citizenship ceremonies, traditional dances, smoking ceremonies and fun runs, as the prime minister calls for \"unity not division\" during a speech in Canberra.",
          "feed_position": 16
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australia-day-celebrations-anthony-albanese-sydney/33d03822-f01a-4c0f-b534-e03708ea78a9",
          "published_at": "Sun, 25 Jan 2026 23:06:29 +0000",
          "title": "PM calls for nation to 'come together' on Australia Day, millions celebrate",
          "standfirst": "Millions of people are set to celebrate Australia Day, with citizenship ceremonies, barbecues and special events to mark the national holiday.",
          "content": "Anthony Albanese has called for unity on Australia Day, saying today should be a reminder of why Australia is the \"best country on earth\".Millions of people are set to celebrate Australia Day, with citizenship ceremonies, barbecues and special events to mark the national holiday.Albanese said today was an opportunity for the nation to reflect on what makes the country great.READ MORE: Man charged with murder after elderly woman found dead in Melbourne \"The great gift of Australia Day is that it gives us the perfect opportunity to come together to celebrate everything that unites us as a nation and makes us the best country on earth,\" Anthony Albanese told The Australian.\"We are all lucky to call Australia home, whether you&#x27;re Australian by birth or by choice, whether your ancestors have loved and cared for this land for 65,000 years and or whether you&#x27;re joining our Australian family at citizenship ceremonies across our nation today, pledging your loyalty to our people, our values and our democracy.\"There will also be Invasion Day protests around the country, and a March for Australia in Sydney.The major cities around Australia will be hosting their own events to mark Australia Day.READ MORE: Obama blasts &#x27;lawless and cruel&#x27; tactics after federal officers kill nurseSydneyA WugulOra Morning Ceremony took place at Barangaroo, with several leaders, including NSW Premier Chris Minns, being present.A First Nations artwork by Garry Purchase called Dancing in the Moonlight was projected on the sails of the Sydney Opera House.READ MORE: Two men charged after allegedly attempting to import $750,000 of cocaine There will be a wide-scale citizenship ceremony at Circular Quay at around 10.30am, with the annual Ferrython, a race between four Sydney ferries, happening at about midday.The celebrations in Sydney will conclude tonight with an Australia Day live concert on the Sydney Opera House forecourt, with Cody Simpson one of many artists to be performing.The concert will begin at 7.30pm.CanberraThe main event in the nation&#x27;s capital on Australia Day is the National Citizenship and Flag Raising Ceremony on Lake Burley Griffin.The Prime Minister and Governor General will attend, alongside the Australian of the Year recipients, as the country welcomes some of its new citizens in an eye-catching ceremony.READ MORE: Hundreds flee homes as Victoria bushfire breaks containmentIt features a helicopter fly-past and a bomber fly-over, as well as a 21-gun salute.After the ceremony, a free event at Regatta Point will allow Canberra to come together to celebrate Australia Day, and will include a barbecue, live music and other entertainment.MelbourneFederation Square will be hosting an all-day event with activities for the family, food and music.Melburnians will be able to find a spot on the grass to have a picnic, and will be able to watch the Australian Open on the big screen.There will also be an official flag-raising ceremony, and an open day at Government House.AdelaideThe extreme heat in Adelaide has seen the cancellation of the Aus Lights on the River and Aus Lights Parade, with temperatures soaring above 40 degrees.The Mourning in the Morning Ceremony still went ahead as planned.PerthPerth will have several Australia Day activities, with the festivities concluding in the evening with a drone and fireworks show.READ MORE: Protesters demand immigration agents leave US city after man shot deadThis will take place over the Swan River, with the 30-minute show beginning at 8.30pm.BrisbaneBrisbane will host a food ceremony this afternoon, which will also feature music and live entertainment.Called \"Great Australian Bites\", it will begin at 2pm on Riverside Green at South Bank Parklands and will have pop-up stalls and food trucks sharing food from across the nation, reflecting Australia&#x27;s multiculturalism.There will also be a silent disco and live cooking demonstrations. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 10,
          "image_url": "https://prod.static9.net.au/fs/8bcb5432-4e96-4779-9001-b4f7657317d0"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/8bcb5432-4e96-4779-9001-b4f7657317d0",
      "popularity_score": 2014.9067944444444
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 22:13:25 +0000",
      "title": "How hot is it? Track Australia Day heatwave temperatures live",
      "neutral_headline": "How hot is it? Track Australia Day heatwave temperatures live",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/temperatures-heatwave-tracker-australia-day/106268950",
          "published_at": "Sun, 25 Jan 2026 22:13:25 +0000",
          "title": "How hot is it? Track Australia Day heatwave temperatures live",
          "standfirst": "Use our tracker to keep an eye on temperatures as a heatwave moves across much of the country.",
          "content": "Use our tracker to keep an eye on temperatures as a heatwave moves across much of the country.",
          "feed_position": 3
        }
      ],
      "popularity_score": 323.74957222222224
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 05:18:44 +0000",
      "title": "Traditional owners heartbroken by dingo cull after Piper James's death",
      "neutral_headline": "Traditional owners heartbroken by dingo cull after Piper James's death",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/traditional-owners-heartbroken-at-decision-to-cull-kgari-dingoes/106269824",
          "published_at": "Mon, 26 Jan 2026 05:18:44 +0000",
          "title": "Traditional owners heartbroken by dingo cull after Piper James's death",
          "standfirst": "The Queensland government euthanises six dingoes involved in Piper James's death on K'gari, and is expected to cull more in the coming days.",
          "content": "The Queensland government euthanises six dingoes involved in Piper James's death on K'gari, and is expected to cull more in the coming days.",
          "feed_position": 4
        }
      ],
      "popularity_score": 310.83818333333335
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 23:49:09 +0000",
      "title": "Live: Aussie doubles pair win thriller as double tweener lights up the Open",
      "neutral_headline": "Live: Aussie doubles pair win thriller as double tweener lights up the Open",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/australian-open-2026-live-jannik-sinner-maddison-inglis-swiatek/106268840",
          "published_at": "Sun, 25 Jan 2026 23:49:09 +0000",
          "title": "Live: Aussie doubles pair win thriller as double tweener lights up the Open",
          "standfirst": "Defending Australian Open champion Madison Keys is beaten by friend and Player's Box podcast co-host Jessica Pegula on Rod Laver Arena to start day nine of the Australian Open. Follow live.",
          "content": "Defending Australian Open champion Madison Keys is beaten by friend and Player's Box podcast co-host Jessica Pegula on Rod Laver Arena to start day nine of the Australian Open. Follow live.",
          "feed_position": 5
        }
      ],
      "popularity_score": 305.3451277777778
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 05:36:26 +0000",
      "title": "Madison Keys's world hasn't ended now Aus Open defence is over",
      "neutral_headline": "Madison Keys's world hasn't ended now Aus Open defence is over",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/australian-open-madison-keys-jessica-pegula-fourth-round/106270864",
          "published_at": "Mon, 26 Jan 2026 05:36:26 +0000",
          "title": "Madison Keys's world hasn't ended now Aus Open defence is over",
          "standfirst": "There were no tears or tantrums once Madison Keys left Rod Laver Arena, knowing her Australian Open title defence had come to an end.",
          "content": "There were no tears or tantrums once Madison Keys left Rod Laver Arena, knowing her Australian Open title defence had come to an end.",
          "feed_position": 5
        }
      ],
      "popularity_score": 301.13318333333336
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 05:32:35 +0000",
      "title": "SA town hits 49C as Adelaide records hottest Australia Day",
      "neutral_headline": "SA town hits 49C as Adelaide records hottest Australia Day",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/adelaide-records-australia-day-heat-record/106270456",
          "published_at": "Mon, 26 Jan 2026 05:32:35 +0000",
          "title": "SA town hits 49C as Adelaide records hottest Australia Day",
          "standfirst": "As Adelaide sets a new record for its hottest Australia Day, other parts of SA are enduring conditions that are even more sweltering, with the mercury climbing above 49C in Ceduna.",
          "content": "As Adelaide sets a new record for its hottest Australia Day, other parts of SA are enduring conditions that are even more sweltering, with the mercury climbing above 49C in Ceduna.",
          "feed_position": 6
        }
      ],
      "popularity_score": 291.06901666666664
    },
    {
      "id": "cluster_76",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:38:07 +0000",
      "title": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
      "neutral_headline": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/moderate-liberals-rock-solid-ley-leadership-challenge/106267314",
          "published_at": "Sun, 25 Jan 2026 18:38:07 +0000",
          "title": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
          "standfirst": "While conservatives Angus Taylor and Andrew Hastie canvass support to challenge for the Liberal leadership, moderates say there is no mood for turning on Sussan Ley — meaning a spill would likely result in another divided vote.",
          "content": "While conservatives Angus Taylor and Andrew Hastie canvass support to challenge for the Liberal leadership, moderates say there is no mood for turning on Sussan Ley — meaning a spill would likely result in another divided vote.",
          "feed_position": 6
        }
      ],
      "popularity_score": 280.1612388888889
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 00:30:01 +0000",
      "title": "Paying 'money just to breathe' in one the world's most polluted cities",
      "neutral_headline": "Paying 'money just to breathe' in one the world's most polluted cities",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/delhi-india-air-pollution-residents-struggle-breathing/106085882",
          "published_at": "Mon, 26 Jan 2026 00:30:01 +0000",
          "title": "Paying 'money just to breathe' in one the world's most polluted cities",
          "standfirst": "Poor air quality in Delhi has impacted nearly all aspects of life with residents saying they have lost many of the \"simple joys\" such as opening a window or going for a walk outside.",
          "content": "Poor air quality in Delhi has impacted nearly all aspects of life with residents saying they have lost many of the \"simple joys\" such as opening a window or going for a walk outside.",
          "feed_position": 7
        }
      ],
      "popularity_score": 276.0262388888889
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 01:48:54 +0000",
      "title": "Wild winter storm leaves hundreds of thousands of Americans without power",
      "neutral_headline": "Winter storm leaves hundreds of thousands of Americans without power",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/snow-sleet-and-freezing-rain-cause-havoc-across-united-states/106268992",
          "published_at": "Mon, 26 Jan 2026 01:48:54 +0000",
          "title": "Wild winter storm leaves hundreds of thousands of Americans without power",
          "standfirst": "A massive winter storm across much of the US, spreading from Texas all the way to New England, affects powerlines, traffic and air travel.",
          "content": "A massive winter storm across much of the US, spreading from Texas all the way to New England, affects powerlines, traffic and air travel.",
          "feed_position": 8
        }
      ],
      "popularity_score": 267.3409611111111
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:14:53 +0000",
      "title": "The collateral damage from Trump's quest to deport immigrants",
      "neutral_headline": "The collateral damage from Trump's quest to deport immigrants",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/us-citizens-collateral-damage-in-trump-s-immigration-crackdown/106269166",
          "published_at": "Mon, 26 Jan 2026 02:14:53 +0000",
          "title": "The collateral damage from Trump's quest to deport immigrants",
          "standfirst": "Minneapolis has become the flashpoint of an aggressive immigration enforcement operation ordered by the Trump administration and pitched as a campaign against undocumented criminals.",
          "content": "Minneapolis has become the flashpoint of an aggressive immigration enforcement operation ordered by the Trump administration and pitched as a campaign against undocumented criminals.",
          "feed_position": 9
        }
      ],
      "popularity_score": 257.7740166666667
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 07:09:05 +0000",
      "title": "Human remains found near Charters Towers belong to Jayden Penno-Tompsett",
      "neutral_headline": "Human remains found near Charters Towers belong to Jayden Penno-Tompsett",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/jayden-penno-tompsett-remains-confirmed-north-queensland/105919904",
          "published_at": "Mon, 26 Jan 2026 07:09:05 +0000",
          "title": "Human remains found near Charters Towers belong to Jayden Penno-Tompsett",
          "standfirst": "Human remains found in north Queensland belong to a missing New South Wales man last seen eight years ago, according to police.",
          "content": "Human remains found in north Queensland belong to a missing New South Wales man last seen eight years ago, according to police.",
          "feed_position": 15
        }
      ],
      "popularity_score": 152.67735
    },
    {
      "id": "cluster_16",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 06:19:54 +0000",
      "title": "Call for memorial to Beaumont children, 60 years after they vanished",
      "neutral_headline": "Call for memorial to Beaumont children, 60 years after they vanished",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/beaumont-children-missing-60-years-today-memorial/106269224",
          "published_at": "Mon, 26 Jan 2026 06:19:54 +0000",
          "title": "Call for memorial to Beaumont children, 60 years after they vanished",
          "standfirst": "Politician Frank Pangallo is calling for a permanent memorial to be installed at an Adelaide beach to acknowledge the disappearance of the Beaumont children in 1966.",
          "content": "Politician Frank Pangallo is calling for a permanent memorial to be installed at an Adelaide beach to acknowledge the disappearance of the Beaumont children in 1966.",
          "feed_position": 22
        }
      ],
      "popularity_score": 151.8576277777778
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 06:07:49 +0000",
      "title": "Five quick and easy burger recipes for stress-free summer dinners",
      "neutral_headline": "Five quick and easy burger recipes for stress-free summer dinners",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/quick-and-easy-burger-recipes-for-stress-free-summer-dinners/106136826",
          "published_at": "Mon, 26 Jan 2026 06:07:49 +0000",
          "title": "Five quick and easy burger recipes for stress-free summer dinners",
          "standfirst": "From chargrilled beef patties and beer-battered fish to vegetarian parmigiana and cheeseburger tray bake, we have burgers to suit all tastes and diets.",
          "content": "From chargrilled beef patties and beer-battered fish to vegetarian parmigiana and cheeseburger tray bake, we have burgers to suit all tastes and diets.",
          "feed_position": 17
        }
      ],
      "popularity_score": 151.65623888888888
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 04:22:42 +0000",
      "title": "The 150 Indigenous kids who made a movie without Hollywood's permission",
      "neutral_headline": "The 150 Indigenous kids who made a movie without Hollywood's permission",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/imagine-movie-jack-manning-bancroft-aime-indigenous-mentoring/106256658",
          "published_at": "Mon, 26 Jan 2026 04:22:42 +0000",
          "title": "The 150 Indigenous kids who made a movie without Hollywood's permission",
          "standfirst": "The beautifully animated, crowdsourced movie Imagine introduces a wealth of Indigenous knowledge to audiences in the funniest way possible and hopes to generate real change.",
          "content": "The beautifully animated, crowdsourced movie Imagine introduces a wealth of Indigenous knowledge to audiences in the funniest way possible and hopes to generate real change.",
          "feed_position": 24
        }
      ],
      "popularity_score": 149.90429444444445
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 04:18:04 +0000",
      "title": "Patriots, Seahawks to face off in San Francisco for Super Bowl LX",
      "neutral_headline": "Patriots, Seahawks to face off in San Francisco for Super Bowl LX",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/super-bowl-lx-match-up-seattle-new-england/106270308",
          "published_at": "Mon, 26 Jan 2026 04:18:04 +0000",
          "title": "Patriots, Seahawks to face off in San Francisco for Super Bowl LX",
          "standfirst": "New England survived a Denver blizzard and Seattle outlasted Los Angeles in an offensive shootout to set up a bumper clash for Super Bowl LX.",
          "content": "New England survived a Denver blizzard and Seattle outlasted Los Angeles in an offensive shootout to set up a bumper clash for Super Bowl LX.",
          "feed_position": 20
        }
      ],
      "popularity_score": 149.82707222222223
    },
    {
      "id": "cluster_42",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 03:04:19 +0000",
      "title": "Home invasion in Sale could be a case of 'mistaken identity', police say",
      "neutral_headline": "Home invasion in Sale could be a case of 'mistaken identity', police say",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/sale-ross-street-home-invasion-woman-assaulted-police/106123750",
          "published_at": "Mon, 26 Jan 2026 03:04:19 +0000",
          "title": "Home invasion in Sale could be a case of 'mistaken identity', police say",
          "standfirst": "Wellington Crime Investigation detectives turn to the public for help as they continue to investigate a 2025 home invasion where they allege three men broke in and assaulted a woman.",
          "content": "Wellington Crime Investigation detectives turn to the public for help as they continue to investigate a 2025 home invasion where they allege three men broke in and assaulted a woman.",
          "feed_position": 11
        }
      ],
      "popularity_score": 148.59790555555554
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:58:41 +0000",
      "title": "'Dog in the driver's seat' sparks police call for witnesses on beach",
      "neutral_headline": "'Dog in the driver's seat' sparks police call for witnesses on beach",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/dog-in-driver-seat-of-ute-on-tasmanian-beach/106270074",
          "published_at": "Mon, 26 Jan 2026 02:58:41 +0000",
          "title": "'Dog in the driver's seat' sparks police call for witnesses on beach",
          "standfirst": "Reports of a \"dog in the driver's seat\" of a ute driving on a Tasmanian beach have prompted police to ask for witnesses to come forward.",
          "content": "Reports of a \"dog in the driver's seat\" of a ute driving on a Tasmanian beach have prompted police to ask for witnesses to come forward.",
          "feed_position": 12
        }
      ],
      "popularity_score": 148.50401666666667
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:56:01 +0000",
      "title": "Gold's record run rolls on as prices surge past $US5,000",
      "neutral_headline": "Gold's record run rolls on as prices surge past $US5,000",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/gold-record-run-continues-price-surges-past-us-5000/106269850",
          "published_at": "Mon, 26 Jan 2026 02:56:01 +0000",
          "title": "Gold's record run rolls on as prices surge past $US5,000",
          "standfirst": "Gold surges to a record high above $US5,000 an ounce, extending a historic rally as investors pile into the safe-haven asset amid rising geopolitical tensions.",
          "content": "Gold surges to a record high above $US5,000 an ounce, extending a historic rally as investors pile into the safe-haven asset amid rising geopolitical tensions.",
          "feed_position": 12
        }
      ],
      "popularity_score": 148.45957222222222
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:46:08 +0000",
      "title": "Woman allegedly sexually assaulted by stranger on Qld walking track",
      "neutral_headline": "Woman allegedly sexually assaulted by stranger on Qld walking track",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/rockhampton-police-investigate-alleged-sexual-assault/106269804",
          "published_at": "Mon, 26 Jan 2026 02:46:08 +0000",
          "title": "Woman allegedly sexually assaulted by stranger on Qld walking track",
          "standfirst": "Police have taken a 27-year-old man into custody as part of their investigations after a woman was allegedly attacked on a popular walkway.",
          "content": "Police have taken a 27-year-old man into custody as part of their investigations after a woman was allegedly attacked on a popular walkway.",
          "feed_position": 14
        }
      ],
      "popularity_score": 148.29485
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:33:04 +0000",
      "title": "Bodies recovered after ferry sinks in the Philippines",
      "neutral_headline": "Bodies recovered after ferry sinks in the Philippines",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/rescue-efforts-after-ferry-sinks-in-southern-philippines/106269480",
          "published_at": "Mon, 26 Jan 2026 02:33:04 +0000",
          "title": "Bodies recovered after ferry sinks in the Philippines",
          "standfirst": "Rescuers are searching for missing passengers and at least 15 are dead, after a ferry with more than 300 people onboard sunk in the southern Philippines.",
          "content": "Rescuers are searching for missing passengers and at least 15 are dead, after a ferry with more than 300 people onboard sunk in the southern Philippines.",
          "feed_position": 15
        }
      ],
      "popularity_score": 148.07707222222223
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 01:41:22 +0000",
      "title": "Police officer shoots alleged drug dealer's dog after toddler was attacked",
      "neutral_headline": "Police officer shoots alleged drug dealer's dog after toddler was attacked",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/moama-dog-attack-shot-cannabis-cash-toddler-drugs/106269076",
          "published_at": "Mon, 26 Jan 2026 01:41:22 +0000",
          "title": "Police officer shoots alleged drug dealer's dog after toddler was attacked",
          "standfirst": "The man is charged with nine offences, including drug possession and supply and dealing with the proceeds of crime.",
          "content": "The man is charged with nine offences, including drug possession and supply and dealing with the proceeds of crime.",
          "feed_position": 20
        }
      ],
      "popularity_score": 147.21540555555555
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 00:39:29 +0000",
      "title": "'Ray of hope' for missing man's parents after meeting with police minister",
      "neutral_headline": "'Ray of hope' for missing man's parents after meeting with police minister",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/missing-man-jack-mclennan-queensland-police-minister-meeting/106269360",
          "published_at": "Mon, 26 Jan 2026 00:39:29 +0000",
          "title": "'Ray of hope' for missing man's parents after meeting with police minister",
          "standfirst": "The parents of missing Jack McLennan say they have drawn some comfort from a meeting with Queensland Police Minister Dan Purdie.",
          "content": "The parents of missing Jack McLennan say they have drawn some comfort from a meeting with Queensland Police Minister Dan Purdie.",
          "feed_position": 23
        }
      ],
      "popularity_score": 146.18401666666668
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 00:24:31 +0000",
      "title": "Why a US 18yo rejects the 'underdog' tag against world No.1 Sabalenka",
      "neutral_headline": "Why a US 18yo rejects the 'underdog' tag against world No.1 Sabalenka",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/australian-open-tennis-iva-jovic-aryna-sabalenka/106269176",
          "published_at": "Mon, 26 Jan 2026 00:24:31 +0000",
          "title": "Why a US 18yo rejects the 'underdog' tag against world No.1 Sabalenka",
          "standfirst": "Iva Jović refuses to be intimidated about facing two-time Australian Open champion Aryna Sabalenka in the quarterfinals at Melbourne Park.",
          "content": "Iva Jović refuses to be intimidated about facing two-time Australian Open champion Aryna Sabalenka in the quarterfinals at Melbourne Park.",
          "feed_position": 23
        }
      ],
      "popularity_score": 145.93457222222222
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 23:53:34 +0000",
      "title": "Two men drowned, another taken to hospital in NSW river tragedy",
      "neutral_headline": "Two men drowned, another taken to hospital in NSW river tragedy",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/two-men-dead-bellingen-drowning/106269014",
          "published_at": "Sun, 25 Jan 2026 23:53:34 +0000",
          "title": "Two men drowned, another taken to hospital in NSW river tragedy",
          "standfirst": "Two men have drowned and another remains in a stable condition in hospital after a mishap in a river on the New South Wales Mid North Coast.",
          "content": "Two men have drowned and another remains in a stable condition in hospital after a mishap in a river on the New South Wales Mid North Coast.",
          "feed_position": 24
        }
      ],
      "popularity_score": 145.4187388888889
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 22:27:52 +0000",
      "title": "'Gentle and kind': Tributes flow for Lake Cargelligo shooting victims",
      "neutral_headline": "'Gentle and kind': Tributes flow for Lake Cargelligo shooting victims",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/lake-cargelligo-manhunt-police-mount-hope-nsw/106268762",
          "published_at": "Sun, 25 Jan 2026 22:27:52 +0000",
          "title": "'Gentle and kind': Tributes flow for Lake Cargelligo shooting victims",
          "standfirst": "A pregnant woman who was one of three people shot dead in a suspected domestic violence attack in a remote NSW town has been remembered as a gentle and kind person.",
          "content": "A pregnant woman who was one of three people shot dead in a suspected domestic violence attack in a remote NSW town has been remembered as a gentle and kind person.",
          "feed_position": 14
        }
      ],
      "popularity_score": 143.99040555555555
    },
    {
      "id": "cluster_70",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 21:58:37 +0000",
      "title": "Pub joey a story of the challenges facing country WA's 'underground' wildlife carers",
      "neutral_headline": "Pub joey a story of the challenges facing country WA's 'underground' wildlife carers",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/underground-kangaroo-carer-boddington-wa/106196684",
          "published_at": "Sun, 25 Jan 2026 21:58:37 +0000",
          "title": "Pub joey a story of the challenges facing country WA's 'underground' wildlife carers",
          "standfirst": "Roofus is one of many orphaned kangaroos taken under the wing of unofficial wildlife carers, a vocation one Boddington local found in his adolescence.",
          "content": "Roofus is one of many orphaned kangaroos taken under the wing of unofficial wildlife carers, a vocation one Boddington local found in his adolescence.",
          "feed_position": 16
        }
      ],
      "popularity_score": 143.50290555555554
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 21:51:04 +0000",
      "title": "Bystander videos show violent takedown before fatal shooting in Minneapolis",
      "neutral_headline": "Bystander videos show violent takedown before fatal shooting in Minneapolis",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/minneapolis-videos-shooting-alex-pretti/106268710",
          "published_at": "Sun, 25 Jan 2026 21:51:04 +0000",
          "title": "Bystander videos show violent takedown before fatal shooting in Minneapolis",
          "standfirst": "Multiple videos have emerged of nurse Alex Pretti before he was shot dead by federal agents in Minneapolis. The videos appear to contradict statements by the Trump administration, which said the shots were fired \"defensively\" against Mr Pretti as he \"approached\" authorities with a gun. In bystander videos, Mr Pretti is seen with only a phone in his hand, before US federal agents use pepper spray and wrestle him to the ground before opening fire.",
          "content": "Multiple videos have emerged of nurse Alex Pretti before he was shot dead by federal agents in Minneapolis. The videos appear to contradict statements by the Trump administration, which said the shots were fired \"defensively\" against Mr Pretti as he \"approached\" authorities with a gun. In bystander videos, Mr Pretti is seen with only a phone in his hand, before US federal agents use pepper spray and wrestle him to the ground before opening fire.",
          "feed_position": 10
        }
      ],
      "popularity_score": 143.3770722222222
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 19:38:26 +0000",
      "title": "A discreet intellectual network has been reshaping the world for 70 years. Here's how",
      "neutral_headline": "A discreet intellectual network has been reshaping the world for 70 years. Here's how",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/atlas-network-mont-pelerin-society-neoliberal-think-tanks/105700628",
          "published_at": "Sun, 25 Jan 2026 19:38:26 +0000",
          "title": "A discreet intellectual network has been reshaping the world for 70 years. Here's how",
          "standfirst": "A constant battle of ideas reshapes the world we live in, and few groups have been more successful in winning the war than the little-known Atlas Network.",
          "content": "A constant battle of ideas reshapes the world we live in, and few groups have been more successful in winning the war than the little-known Atlas Network.",
          "feed_position": 11
        }
      ],
      "popularity_score": 141.16651666666667
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 19:32:54 +0000",
      "title": "Rental deemed 'not habitable' by tribunal still being leased out",
      "neutral_headline": "Rental deemed 'not habitable' by tribunal still being leased out",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/sharesorted-homes-up-for-rent-despite-not-habitable-ncat-ruling/106135310",
          "published_at": "Sun, 25 Jan 2026 19:32:54 +0000",
          "title": "Rental deemed 'not habitable' by tribunal still being leased out",
          "standfirst": "Furnished accommodation company ShareSorted was found in breach of its obligations related to at least two properties, but a lack of regulation allows them to continue to operate.",
          "content": "Furnished accommodation company ShareSorted was found in breach of its obligations related to at least two properties, but a lack of regulation allows them to continue to operate.",
          "feed_position": 13
        }
      ],
      "popularity_score": 141.07429444444443
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:30:00 +0000",
      "title": "How to know if you're 'stuck' on unhealthy life goals",
      "neutral_headline": "How to know if you're 'stuck' on unhealthy life goals",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/new-year-resolutions-goals/106205930",
          "published_at": "Sun, 25 Jan 2026 18:30:00 +0000",
          "title": "How to know if you're 'stuck' on unhealthy life goals",
          "standfirst": "Experts say knowing when to abandon or change your goals may be just as important as persistence.",
          "content": "Experts say knowing when to abandon or change your goals may be just as important as persistence.",
          "feed_position": 18
        }
      ],
      "popularity_score": 140.02596111111112
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:30:00 +0000",
      "title": "I found a trove of letters from 1959. Their predictions were eerily familiar",
      "neutral_headline": "I found a trove of letters from 1959. Their predictions were eerily familiar",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/if-youre-listening-future-predictions-adelaide-history-radio/106256170",
          "published_at": "Sun, 25 Jan 2026 18:30:00 +0000",
          "title": "I found a trove of letters from 1959. Their predictions were eerily familiar",
          "standfirst": "I had been trawling absent-mindedly through the ABC's internal digital archive in a vague search for inspiration and clicked on this file called \"Letters to the Unborn\" at random.",
          "content": "I had been trawling absent-mindedly through the ABC's internal digital archive in a vague search for inspiration and clicked on this file called \"Letters to the Unborn\" at random.",
          "feed_position": 21
        }
      ],
      "popularity_score": 140.02596111111112
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:00:00 +0000",
      "title": "Trump's economic chaos makes Keynes's idea look attractive",
      "neutral_headline": "Trump's economic chaos makes Keynes's idea look attractive",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/trump-us-dollar-keynes-bretton-woods-economy/106260832",
          "published_at": "Sun, 25 Jan 2026 18:00:00 +0000",
          "title": "Trump's economic chaos makes Keynes's idea look attractive",
          "standfirst": "In the wake of Trump, the world will now have to revisit the conference that set up the \"rules-based world order\".",
          "content": "In the wake of Trump, the world will now have to revisit the conference that set up the \"rules-based world order\".",
          "feed_position": 19
        }
      ],
      "popularity_score": 139.52596111111112
    }
  ]
}