{
  "updated_at": "2025-10-07T03:30:26.567Z",
  "clusters": [
    {
      "id": "cluster_23",
      "coverage": 4,
      "updated_at": "Tue, 07 Oct 2025 02:32:25 +0000",
      "title": "Police investigating after students told their degrees were revoked",
      "neutral_headline": "[Multiple Topics]",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/western-sydney-university-email-cybersecurity-breach/7a83afdc-3b08-425f-b9fd-b284654c3623",
          "published_at": "Tue, 07 Oct 2025 02:32:25 +0000",
          "title": "Police investigating after students told their degrees were revoked",
          "standfirst": "Reports surfaced on Monday of two different emails being sent from accounts seeming to have an affiliation with the university.",
          "content": "Western Sydney University has been hit by a major scam after mass emails were sent to students and alumni, including some claiming that degrees had been \"revoked\".Two different emails appear to have been sent from accounts where students and alumni were falsely told their degrees were no longer valid and that they would be excluded from further study.\"We regret to inform you that, following a thorough review, the decision has been made to permanently exclude you from any further study at Western Sydney University,\" one email sent to students and seen by 9news.com.au said. READ MORE: Half of Aussies think it&#x27;s OK to commit this &#x27;risky&#x27; work from home breach in summer\"As a result, any existing certificates or awards previously issued to you are hereby revoked. \"Please be advised that, pursuant to university policy, the decision of the Board of Trustees is final and binding.\"Students who received the email were told their enrolments in all units would be immediately cancelled, and their access to any student systems would be revoked. Do you have more to add to the story? Contact reporter Patrick Brischetto at patrick.brischetto@nine.com.au.Some impacted individuals said they received emails despite already officially graduating or having not completed their studies at the university.Students at the university also received an email from an apparent official address called \"Parking Permits\", which outlined an alleged breach by a student who was able to exploit vulnerabilities to create a false parking permit and access the email address.\"This is a glaring indication of the fundamental security weaknesses that still exist within WSU&#x27;s systems,\" the email, a screenshot of which was posted online, claimed.It is not known how many people received the emails, and whether other personal data is at risk or has been accessed in the breach.9news.com.au has received various reports of the mental stress and anxiety the fraudulent emails have caused current and former students.Parents have also expressed how it has affected their children who study at the university and feared they had lost their place. \"The email said they were revoking my degree, which would have put my entire academic and teaching career in jeopardy,\" one impacted person said.\"This email has caused immense undue stress and panic.\"Those impacted also expressed concern that the emails contained official university links and had correct personal information, such as student numbers. The university told 9news.com.au it was aware of the \"fraudulent\" emails.\"Western Sydney University is aware of fraudulent emails sent to students and graduates, with some falsely claiming that they have been excluded from the University or that their qualifications have been revoked,\" a spokesperson from Western Sydney University said.\"These emails are not legitimate and were not issued by the university. We are reaching out to inform people that the email is fraudulent and have informed NSW Police.\"We sincerely apologise for any concern this may have caused.\" However, some students claim to have received no contact from the university, saying they were first informed about the emails being fake through media reports. Others have claimed to be unable to contact the university via phone and instead being stuck on hold. \" The uni has done nothing so far and it&#x27;s 10.30am. Not even an email,\" a current student told 9news.com.au.\"Despite repeated attempts to contact the university, we have received no meaningful response or support,\" another email response said.\"They are now being left to suffer in silence.\"The university said it couldn&#x27;t give any further comment due to the incident being part of an ongoing police investigation. NSW Police confirmed it was investigating the incident.\"Cybercrime Squad detectives are investigating an alleged data breach involving Western Sydney University,\" it told 9news.com.au in a statement.\"Anyone who believes their details may have been compromised is urged to contact ReportCyber.\"Western Sydney University was involved in another data breach earlier this year, when the personal data of around 10,000 students ended up on the dark web.A former student was charged over the attack and fronted court in August.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 6,
          "image_url": "https://prod.static9.net.au/fs/dd06887a-96ee-42e0-a018-1bc610df2ced"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/07/supermoon-on-the-horizon-how-australians-can-experience-tuesdays-harvest-moon",
          "published_at": "Tue, 07 Oct 2025 02:31:34 GMT",
          "title": "Supermoon on the horizon: how Australians can experience the ‘harvest moon’",
          "standfirst": "Looking east at sunset on Tuesday, viewers will be able to catch the moon appear at its largest, one expert saysFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIf you look up to a clear night sky Tuesday evening, a dramatic full moon – seemingly closer and brighter than usual – will be shining.For Australians, the best viewing of this year’s first supermoon – a “harvest moon” – will be at around sunset, where it will appear large and bright on the eastern horizon. Continue reading...",
          "content": "Looking east at sunset on Tuesday, viewers will be able to catch the moon appear at its largest, one expert saysFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIf you look up to a clear night sky Tuesday evening, a dramatic full moon – seemingly closer and brighter than usual – will be shining.For Australians, the best viewing of this year’s first supermoon – a “harvest moon” – will be at around sunset, where it will appear large and bright on the eastern horizon. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/07/australia-post-dash-cam-footage-posties-hit-by-cars-urges-drivers-keep-eye-out",
          "published_at": "Tue, 07 Oct 2025 02:22:07 GMT",
          "title": "Australia Post releases footage of posties being hit by cars as it urges drivers to ‘keep an eye out’",
          "standfirst": "More than 280 delivery workers injured in traffic collisions over past year, suffering everything from broken limbs to lacerationsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAt least five posties are injured each week on Australia’s roads, according to data released by Australia Post as the service published video of collisions and urged motorists to “keep an eye out”.More than 280 posties sustained broken limbs, concussions or serious trauma from third-party road crashes in the past financial year. Continue reading...",
          "content": "More than 280 delivery workers injured in traffic collisions over past year, suffering everything from broken limbs to lacerationsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAt least five posties are injured each week on Australia’s roads, according to data released by Australia Post as the service published video of collisions and urged motorists to “keep an eye out”.More than 280 posties sustained broken limbs, concussions or serious trauma from third-party road crashes in the past financial year. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/07/man-charged-alleged-shooting-croydon-park-sydney-inner-west-ntwnfb",
          "published_at": "Tue, 07 Oct 2025 01:41:02 GMT",
          "title": "Man charged over alleged Sydney shooting spree picks barrister to represent him after confusion in court",
          "standfirst": "Artemios Mintzas, 60, charged with 25 offences, including 18 counts of shooting with intent to murder after Croydon Park incident on SundayFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA court hearing for a man charged over an alleged shooting spree in Sydney’s inner west on Sunday night has been delayed by a dispute over which of two lawyers was representing him.Artemios Mintzas, 60, appeared in the Burwood local court on Tuesday after he allegedly shot “about 50” high-powered rifle rounds at pedestrians, cars and buildings in Croydon Park over two hours before he was apprehended by tactical officers. Continue reading...",
          "content": "Artemios Mintzas, 60, charged with 25 offences, including 18 counts of shooting with intent to murder after Croydon Park incident on SundayFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA court hearing for a man charged over an alleged shooting spree in Sydney’s inner west on Sunday night has been delayed by a dispute over which of two lawyers was representing him.Artemios Mintzas, 60, appeared in the Burwood local court on Tuesday after he allegedly shot “about 50” high-powered rifle rounds at pedestrians, cars and buildings in Croydon Park over two hours before he was apprehended by tactical officers. Continue reading...",
          "feed_position": 3
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/nsw/he-s-doing-ok-sydney-trains-worker-faces-court-over-alleged-grand-final-night-shooting-spree-20251007-p5n0ld.html",
          "published_at": "Tue, 07 Oct 2025 12:37:03 +1100",
          "title": "‘He’s doing OK’: Sydney Trains worker faces court over alleged grand final night shooting spree",
          "standfirst": "Artemios Mintzas, 60, has been charged with 25 offences after allegedly spraying bullets at police, pedestrians and cars in Sydney’s inner west.",
          "content": "Artemios Mintzas, 60, has been charged with 25 offences after allegedly spraying bullets at police, pedestrians and cars in Sydney’s inner west.",
          "feed_position": 14,
          "image_url": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/1f8fce446e464db0ae5722880d3a2c4387e1d33a"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/nsw-western-sydney-university-data-breach-emails-degrees-revoked/105861146",
          "published_at": "Tue, 07 Oct 2025 01:15:20 +0000",
          "title": "University students told degrees 'revoked' in 'fraudulent' emails",
          "standfirst": "Western Sydney University has apologised to current and former students who received emails claiming their degrees have been \"revoked\", saying the messages are \"not legitimate\".",
          "content": "Western Sydney University has apologised to current and former students who received emails claiming their degrees have been \"revoked\", saying the messages are \"not legitimate\".",
          "feed_position": 3
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/global/video/2025/oct/07/dashcam-video-captures-postal-workers-being-hit-on-australian-roads-video",
          "published_at": "Tue, 07 Oct 2025 00:53:13 GMT",
          "title": "Dashcam video captures postal workers being hit on Australian roads – video",
          "standfirst": "At least five postal workers are injured every week on Australia's roads. Australia Post has released dashcam footage showing the frequency with which postal workers are hit by distracted drivers. More than 280 posties have been injured in the last year, with many needing hospital treatment and time off work, while some are suffering psychological trauma. New data shows that the postal service's slightly larger electric delivery vehicles [eDVs] provide more protection than motorcycles, with Australia Post saying it will move to speed up the replacement of its motorcycle fleet with eDVs. Australia Post's general manager of safety, Russell Munro, said the corporation will take measures to protect its workforce but called out ‘unsafe driver behaviour’ that is putting posties at risk. Australia Post releases footage of posties being hit by cars as it urges drivers to ‘keep an eye out’ Continue reading...",
          "content": "At least five postal workers are injured every week on Australia's roads. Australia Post has released dashcam footage showing the frequency with which postal workers are hit by distracted drivers. More than 280 posties have been injured in the last year, with many needing hospital treatment and time off work, while some are suffering psychological trauma. New data shows that the postal service's slightly larger electric delivery vehicles [eDVs] provide more protection than motorcycles, with Australia Post saying it will move to speed up the replacement of its motorcycle fleet with eDVs. Australia Post's general manager of safety, Russell Munro, said the corporation will take measures to protect its workforce but called out ‘unsafe driver behaviour’ that is putting posties at risk. Australia Post releases footage of posties being hit by cars as it urges drivers to ‘keep an eye out’ Continue reading...",
          "feed_position": 4
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/07/western-sydney-university-graduates-sent-fraudulent-emails-claiming-degrees-were-revoked",
          "published_at": "Tue, 07 Oct 2025 00:44:49 GMT",
          "title": "Western Sydney University graduates sent ‘fraudulent’ emails claiming degrees were ‘revoked’",
          "standfirst": "University apologised to recipients, saying emails were referred to police and were not legitimateFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastCurrent and former students at Western Sydney University (WSU) have received “fraudulent” emails, including one warning that some students’ degrees had been revoked.WSU confirmed this morning that fraudulent emails had been sent to students and graduates over the past 24 hours, saying some were “falsely claiming that they have been excluded from the university or that their qualifications have been revoked”. Continue reading...",
          "content": "University apologised to recipients, saying emails were referred to police and were not legitimateFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastCurrent and former students at Western Sydney University (WSU) have received “fraudulent” emails, including one warning that some students’ degrees had been revoked.WSU confirmed this morning that fraudulent emails had been sent to students and graduates over the past 24 hours, saying some were “falsely claiming that they have been excluded from the university or that their qualifications have been revoked”. Continue reading...",
          "feed_position": 5
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/06/australia-lacks-legitimate-objective-in-fast-tracking-nauru-deportations-labor-led-committee-finds",
          "published_at": "Mon, 06 Oct 2025 04:44:05 GMT",
          "title": "Australia lacks ‘legitimate objective’ in fast-tracking Nauru deportations, Labor-led committee finds",
          "standfirst": "Parliamentary committee warns international human rights obligations could be breached under new regimeFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe Albanese government does not have a “legitimate objective” in denying fair hearings to those set to be deported to Nauru and could place Australia in breach of international human rights obligations, a Labor-chaired committee has found.The joint human rights committee’s scrutiny of the law said the changes would “likely exacerbate the underlying human rights concerns” with the regime to off-load more than 350 NZYQ-affected noncitizens to Nauru as part of a $2.5bn deal. Continue reading...",
          "content": "Parliamentary committee warns international human rights obligations could be breached under new regimeFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe Albanese government does not have a “legitimate objective” in denying fair hearings to those set to be deported to Nauru and could place Australia in breach of international human rights obligations, a Labor-chaired committee has found.The joint human rights committee’s scrutiny of the law said the changes would “likely exacerbate the underlying human rights concerns” with the regime to off-load more than 350 NZYQ-affected noncitizens to Nauru as part of a $2.5bn deal. Continue reading...",
          "feed_position": 7
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/06/over-half-of-australians-support-sanctions-on-israel-and-its-leaders-for-ongoing-attacks-on-gaza-poll-shows",
          "published_at": "Sun, 05 Oct 2025 14:00:37 GMT",
          "title": "Over half of Australians support sanctions on Israel and its leaders for ongoing attacks on Gaza, poll shows",
          "standfirst": "Survey finds 57% of respondents agreed government should impose similar sanctions on Israel as those against Russia for its invasion of UkraineFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAustralians are supportive of placing tough sanctions on Israel and its leaders for their role in attacking Gaza, with a new poll finding more than half of voters agree the federal government should extend sanctions placed on Russia to Israel.The YouGov poll, commissioned by the Australia Palestine Advocacy Network (APAN) and released Monday, shows the majority of Australians want Israel to end its assault on Gaza, with 69% agreeing – 53% “strongly” agreeing – the Netanyahu government’s military campaign should stop. Fourteen per cent disagreed. Continue reading...",
          "content": "Survey finds 57% of respondents agreed government should impose similar sanctions on Israel as those against Russia for its invasion of UkraineFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAustralians are supportive of placing tough sanctions on Israel and its leaders for their role in attacking Gaza, with a new poll finding more than half of voters agree the federal government should extend sanctions placed on Russia to Israel.The YouGov poll, commissioned by the Australia Palestine Advocacy Network (APAN) and released Monday, shows the majority of Australians want Israel to end its assault on Gaza, with 69% agreeing – 53% “strongly” agreeing – the Netanyahu government’s military campaign should stop. Fourteen per cent disagreed. Continue reading...",
          "feed_position": 9
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/dd06887a-96ee-42e0-a018-1bc610df2ced",
      "popularity_score": 4019.0328983333334,
      "ai_summary": [
        "Reports surfaced of students being told their degrees were revoked.",
        "Australians can view the \"harvest moon\" at sunset on Tuesday.",
        "Australia Post released footage of posties being hit by cars.",
        "Over 280 delivery workers were injured in traffic collisions.",
        "A man was charged over a Sydney shooting spree."
      ]
    },
    {
      "id": "cluster_7",
      "coverage": 2,
      "updated_at": "Tue, 07 Oct 2025 03:13:23 +0000",
      "title": "Disgust over 'gutless' antisemitic graffiti",
      "neutral_headline": "Antisemitic Graffiti Condemned on October 7 Anniversary",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/pro-hamas-graffiti-on-building-in-fitzroy-melbourne/fe8388c2-2e7b-4048-8203-892fa9819ba8",
          "published_at": "Tue, 07 Oct 2025 03:13:23 +0000",
          "title": "Disgust over 'gutless' antisemitic graffiti",
          "standfirst": "Deputy Prime Minister Richard Marles described the vandalism on the second anniversary of the October 7 terrorist attack as \"disgraceful\".",
          "content": "An inner-city Melbourne billboard has been vandalised with pro-Hamas messaging on the second anniversary of the October 7 terrorist attack, prompting a furious response from the prime minister.Police are investigating after the words \"Glory to Hamas\" were spraypainted onto a billboard overlooking the busy intersection of Alexandra Parade and Brunswick Street in Fitzroy.Just 500 metres away, vandals also targeted Fitzroy Officeworks on Alexandra Parade with the words \"Oct 7, do it again\" and \"glory to the martyrs\".READ MORE: Dezi Freeman&#x27;s brother reveals theory on accused cop killerThis graffiti has since been painted over.Police believe the graffiti appeared in the early hours of this morning.\"There is absolutely no place at all in our society for antisemitic or hate-based symbols and behaviour,\" a police spokesperson said.Anyone who witnesse the incident or who has information is urged to contact police or Crime Stoppers on 1800 333 000. Prime Minister Anthony Albanese said police would work with their federal counterparts find the people responsible for the graffiti.\"The terrorist propaganda defacing a Melbourne billboard on the anniversary of the October 7 murders is abhorrent,\" the PM said.\"The people responsible must face the full force of the law. The AFP will work with Victorian Police to bring them to justice.\" Deputy Prime Minister and Defence Minister Richard Marles described the vandalism as \"disgraceful\" and \"deeply offensive\".\"This day can only be one thing, and that is a day of commemoration and remembrance,\" Marles told ABC Melbourne.\"It&#x27;s a deeply solemn day, and to have that message scrawled in that way is obviously disgraceful, and we need to be a society which is cohesive, which looks out for each other, and that is obviously a message of division.\"READ MORE: Sydney dad accused of &#x27;indiscriminately&#x27; firing at passersby chargedCaufield MP David Southwick said the graffiti was \"triggering\" for the Jewish community.\"On a day when we remember the victims and stand with their families, this kind of hate has no place anywhere,\" Southwick said.\"These people responsible are gutless cowards and need to face consequences. \"READ MORE: Half of Aussies think it&#x27;s OK to commit this &#x27;risky&#x27; WFH breachToday marks the second anniversary of the October 7 attack.The Israel-Hamas conflict erupted on this day in 2023 when Hamas fighters murdered 1200 people and took another 250 hostage. The move triggered Israel&#x27;s invasion of Gaza, which a United Nations inquiry has labelled genocide.Albanese earlier said today should not be a day of protest and any demonstrations would be \"deeply disrespectful\". DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/ad304626-5254-4666-968c-8fe9f7d46121"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/vandals-scrawl-antisemitic-graffiti-on-fitzroy-billboard-20251007-p5n0jz.html",
          "published_at": "Tue, 07 Oct 2025 13:42:54 +1100",
          "title": "‘Terrorist propaganda’: PM condemns antisemitic graffiti on anniversary of October 7 attacks",
          "standfirst": "Antisemitic and pro-Hamas messages were painted on a storefront and billboard in Fitzroy, coinciding with the second anniversary of the October 7 massacre.",
          "content": "Antisemitic and pro-Hamas messages were painted on a storefront and billboard in Fitzroy, coinciding with the second anniversary of the October 7 massacre.",
          "feed_position": 7,
          "image_url": "https://static.ffx.io/images/$zoom_0.1802%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_39/t_crop_custom/q_86%2Cf_auto/2d5d91a27063a4e296479aadbe53d3bc7b7d95d9"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/ad304626-5254-4666-968c-8fe9f7d46121",
      "popularity_score": 2019.7156761111112,
      "ai_summary": [
        "Antisemitic graffiti appeared on the second anniversary of the attacks.",
        "The graffiti was described as \"disgraceful\" by the Deputy Prime Minister.",
        "Pro-Hamas messages were also painted on a storefront.",
        "The graffiti was painted in Fitzroy, Australia.",
        "The graffiti coincided with the October 7 massacre anniversary."
      ]
    },
    {
      "id": "cluster_21",
      "coverage": 2,
      "updated_at": "Tue, 07 Oct 2025 02:34:23 +0000",
      "title": "'Quite lovely': Albanese reveals surprise gift from White House",
      "neutral_headline": "Albanese Reveals Surprise Gift from White House",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/anthony-albanese-latter-white-house-donald-trump-meeting/506dc901-6729-4e52-90c4-3e292b8adf51",
          "published_at": "Tue, 07 Oct 2025 02:34:23 +0000",
          "title": "'Quite lovely': Albanese reveals surprise gift from White House",
          "standfirst": "Anthony Albanese says he isn&#x27;t feeling at all nervous about this month&#x27;s visit to the White House to meet US President Donald Trump.",
          "content": "Prime Minister Anthony Albanese says he isn&#x27;t feeling at all nervous about this month&#x27;s visit to the White House to meet US President Donald Trump.While some world leaders have been subjected to an Oval Office ambush this year – most infamously Ukrainian President Volodymyr Zelensky – Albanese said he wasn&#x27;t concerned about his October 20 meeting, pointing to a \"quite lovely\" letter he received from the Trump administration.\"Not at all,\" he said when asked if he was nervous about the meeting on Today this morning. READ MORE: Aussies still in custody as Israel deports Greta Thunberg \"I&#x27;ve had really warm discussions with President Trump and I received a quite lovely letter, I&#x27;ve got to say, of invitation to attend the White House.\"While the US under Trump has pressured Australia to increase its level of defence spending, Albanese is expected to receive good defence news ahead of his visit, with a Pentagon review expected to lock in the future of the AUKUS deal, despite earlier concerns the pact might have been on the chopping block.\"Our defence and security relationship is so important through the AUKUS agreements,\" Albanese said. \"I&#x27;ve just been in the UK talking with Prime Minister (Sir Keir) Starmer and the Defence Minister (John) Healey and others there as well, about how important that is.\"READ MORE: Australia finally inks landmark alliance with closest neighbour The prime minister will also be armed with a good-news story of his own making for his trip to Washington, following the signing of a defence agreement with Papua New Guinea that will limit China&#x27;s ability to gain a military foothold in the largest Pacific Islands nation.\"It&#x27;s a fantastic deal, as Prime Minister (James) Marape put it in this very corridor here just yesterday, the idea of one fence, two neighbours,\" Albanese said.\"And it really strengthens the national sovereignty of both of our countries.\"It is our first alliance in more than seven decades, so it&#x27;s a very big deal.\"It says that should there be a common threat, we will combine our efforts to defend our respective nations and help each other out.\"READ MORE: &#x27;Cold, lonely, fearful&#x27;: Brother believes accused cop killer is dead But ahead of the diplomatic visit, Albanese was also keen to push an economic message as well.He pointed to the US&#x27;s trade surplus with Australia – a clear and obvious reminder directed to the White House, where Trump has railed against nations with which Washington has a trade deficit.\"We have an important economic relationship as well,\" Albanese said. \"They&#x27;re major investors here in Australia, America enjoys a trade surplus with Australia.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 2,
          "image_url": "https://prod.static9.net.au/fs/1c76ad78-6009-4408-ba4e-fc0906894a1d"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/albanese-received-quite-lovely-letter-from-white-house-20251007-p5n0oy.html",
          "published_at": "Tue, 07 Oct 2025 13:02:09 +1100",
          "title": "Albanese received 'quite lovely' letter from White House",
          "standfirst": "Anthony Albanese has revealed he received a \"quite lovely\" letter from the White House ahead of his meeting with Donald Trump.",
          "content": "Anthony Albanese has revealed he received a \"quite lovely\" letter from the White House ahead of his meeting with Donald Trump.",
          "feed_position": 12,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/5bf0a9fe5bfa222663b8f3ef050a569a3b651f8b"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/1c76ad78-6009-4408-ba4e-fc0906894a1d",
      "popularity_score": 2019.065676111111,
      "ai_summary": [
        "Anthony Albanese received a letter from the White House.",
        "Albanese will meet with Donald Trump this month.",
        "Albanese described the letter as \"quite lovely\".",
        "Albanese is not feeling nervous about the White House visit.",
        "The meeting will take place in the United States."
      ]
    },
    {
      "id": "cluster_36",
      "coverage": 2,
      "updated_at": "Tue, 07 Oct 2025 01:33:26 +0000",
      "title": "ICAC fugitive found 'hiding in a cupboard' dragged before hearing",
      "neutral_headline": "ICAC Fugitive Appears After Months on the Run",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/nsw-icac-ibrahim-helmy-cupboard-transport-police/105861674",
          "published_at": "Tue, 07 Oct 2025 01:33:26 +0000",
          "title": "ICAC fugitive found 'hiding in a cupboard' dragged before hearing",
          "standfirst": "Ibrahim Helmy, who vanished before an inquiry into transport kickbacks, watched the first day of the Independent Commission Against Corruption public hearings via live stream.",
          "content": "Ibrahim Helmy, who vanished before an inquiry into transport kickbacks, watched the first day of the Independent Commission Against Corruption public hearings via live stream.",
          "feed_position": 10
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/nsw/icac-fugitive-hauled-before-corruption-inquiry-after-months-on-run-from-police-20251003-p5mzvx.html",
          "published_at": "Tue, 07 Oct 2025 12:22:21 +1100",
          "title": "ICAC fugitive hauled before corruption inquiry after months on run from police",
          "standfirst": "Sacked transport official Ibrahim Helmy is appearing for the first time at a public inquiry into corruption, almost two weeks after he was taken into custody.",
          "content": "Sacked transport official Ibrahim Helmy is appearing for the first time at a public inquiry into corruption, almost two weeks after he was taken into custody.",
          "feed_position": 18,
          "image_url": "https://static.ffx.io/images/$zoom_2.118%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/a63ca2927e2513d02d178b91d0111f62b102caf347400eeb67dc371180826825"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_2.118%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/a63ca2927e2513d02d178b91d0111f62b102caf347400eeb67dc371180826825",
      "popularity_score": 2018.0498427777777,
      "ai_summary": [
        "Ibrahim Helmy, a former transport official, appeared at a public inquiry into corruption.",
        "Helmy was taken into custody almost two weeks prior to his appearance.",
        "He vanished before an Independent Commission Against Corruption inquiry into transport kickbacks.",
        "Helmy was found \"hiding in a cupboard\" before being brought before the hearing.",
        "He watched the first day of hearings via live stream before being apprehended."
      ]
    },
    {
      "id": "cluster_39",
      "coverage": 2,
      "updated_at": "Tue, 07 Oct 2025 12:27:52 +1100",
      "title": "Fake Madeleine McCann contacted girl’s mother 60 times in one day, court told",
      "neutral_headline": "Woman Claiming to Be Madeleine McCann Faces Court",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/europe/fake-madeleine-mccann-contacted-girl-s-mother-60-times-in-one-day-court-told-20251007-p5n0jj.html",
          "published_at": "Tue, 07 Oct 2025 12:27:52 +1100",
          "title": "Fake Madeleine McCann contacted girl’s mother 60 times in one day, court told",
          "standfirst": "Julia Wandelt, who is on trial for stalking, was obsessed with the idea she was Kate McCann’s missing three-year-old when she allegedly bombarded the British mother with calls, messages and home visits.",
          "content": "Julia Wandelt, who is on trial for stalking, was obsessed with the idea she was Kate McCann’s missing three-year-old when she allegedly bombarded the British mother with calls, messages and home visits.",
          "feed_position": 16,
          "image_url": "https://static.ffx.io/images/$zoom_0.4446%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_120/t_crop_custom/q_86%2Cf_auto/93a985c7b82417161f99e1a9a02b17686dfcbeea"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/woman-claiming-to-be-madeleine-mccann-stalked-parents-uk-court/105860736",
          "published_at": "Mon, 06 Oct 2025 21:35:22 +0000",
          "title": "Woman claiming to be Madeleine McCann faces court",
          "standfirst": "A 24-year-old woman who claims to be Madeleine McCann is on trial charged with stalking the missing child's parents over the past three years.",
          "content": "A 24-year-old woman who claims to be Madeleine McCann is on trial charged with stalking the missing child's parents over the past three years.",
          "feed_position": 23
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.4446%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_120/t_crop_custom/q_86%2Cf_auto/93a985c7b82417161f99e1a9a02b17686dfcbeea",
      "popularity_score": 2017.957065,
      "ai_summary": [
        "Julia Wandelt is on trial for stalking Kate McCann, Madeleine's mother.",
        "Wandelt allegedly contacted McCann over sixty times in one day.",
        "Wandelt was obsessed with the idea she was the missing child.",
        "The trial concerns Wandelt's actions over the past three years.",
        "Wandelt is 24 years old and claims to be Madeleine McCann."
      ]
    },
    {
      "id": "cluster_3",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 03:24:00 +0000",
      "title": "Breaking: Helicopter crashes on California freeway",
      "neutral_headline": "Helicopter Crashes on California Freeway; Injuries Reported",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/helicopter-crashes-on-sacramento-freeway/105862402",
          "published_at": "Tue, 07 Oct 2025 03:24:00 +0000",
          "title": "Breaking: Helicopter crashes on California freeway",
          "standfirst": "At least three people have sustained critical injuries after a helicopter crashed on a Sacramento freeway in the US.",
          "content": "At least three people have sustained critical injuries after a helicopter crashed on a Sacramento freeway in the US.",
          "feed_position": 0
        }
      ],
      "popularity_score": 359.89262055555554,
      "ai_summary": [
        "A helicopter crashed on a freeway in Sacramento, California.",
        "At least three people sustained critical injuries in the crash.",
        "Details regarding the cause of the crash are currently unavailable.",
        "Emergency services responded to the scene to provide assistance.",
        "The incident caused significant disruption to traffic flow."
      ]
    },
    {
      "id": "cluster_70",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 20:01:05 +0000",
      "title": "'I feel like I'm dying': Father loses eye after hospital's delayed diagnosis",
      "neutral_headline": "Father Loses Eye After Delayed Diagnosis, Sues Hospital",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/barwon-health-sued-after-victorian-man-loses-left-eye-infection/105858504",
          "published_at": "Mon, 06 Oct 2025 20:01:05 +0000",
          "title": "'I feel like I'm dying': Father loses eye after hospital's delayed diagnosis",
          "standfirst": "A young father who lost his eye after contracting a rare infection is suing the hospital that treated him, alleging it ignored his requests to investigate his condition properly.",
          "content": "A young father who lost his eye after contracting a rare infection is suing the hospital that treated him, alleging it ignored his requests to investigate his condition properly.",
          "feed_position": 0
        }
      ],
      "popularity_score": 345.5106758333333,
      "ai_summary": [
        "A young father lost an eye due to a rare infection.",
        "He is suing the hospital that treated him.",
        "The father alleges the hospital ignored his requests for proper investigation.",
        "The father claims the hospital's delayed diagnosis led to his condition worsening.",
        "The lawsuit seeks compensation for medical negligence."
      ]
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 03:17:12 +0000",
      "title": "Venezuela thwarts terror attack threat against US embassy, Maduro says",
      "neutral_headline": "Venezuela thwarts terror attack threat against US embassy, Maduro says",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/venezuela-foils-terror-attack-threat-against-us-embassy/105861982",
          "published_at": "Tue, 07 Oct 2025 03:17:12 +0000",
          "title": "Venezuela thwarts terror attack threat against US embassy, Maduro says",
          "standfirst": "Venezuela has alerted the Trump administration of a foiled \"false flag operation\" threatening to target the United States embassy in Caracas with explosives.",
          "content": "Venezuela has alerted the Trump administration of a foiled \"false flag operation\" threatening to target the United States embassy in Caracas with explosives.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.77928722222225,
      "ai_summary": [
        "Venezuela alerted the United States of a foiled \"false flag operation\".",
        "The operation threatened to target the US embassy in Caracas with explosives.",
        "Venezuelan President Maduro made the announcement.",
        "The Venezuelan government claims to have prevented the attack.",
        "The US government has not yet commented on the claims."
      ]
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:10:30 +0000",
      "title": "Results of drone searches for 4yo Gus on SA property 'being analysed'",
      "neutral_headline": "Drone Searches Conducted for Missing Four-Year-Old Boy",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/significant-aerial-search-for-missing-boy-gus-police-say/105861608",
          "published_at": "Tue, 07 Oct 2025 01:10:30 +0000",
          "title": "Results of drone searches for 4yo Gus on SA property 'being analysed'",
          "standfirst": "Police say they have conducted a \"significant\" aerial search of a property in South Australia's mid-north, where a four-year-old boy went missing 10 days ago.",
          "content": "Police say they have conducted a \"significant\" aerial search of a property in South Australia's mid-north, where a four-year-old boy went missing 10 days ago.",
          "feed_position": 1
        }
      ],
      "popularity_score": 340.66762027777776,
      "ai_summary": [
        "Police are analyzing results from drone searches.",
        "The searches were conducted on a property in South Australia.",
        "A four-year-old boy, Gus, went missing ten days ago.",
        "The aerial search was described as \"significant\" by police.",
        "The property is located in South Australia's mid-north region."
      ]
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 02:15:41 +0000",
      "title": "Lawyers’ spat as alleged Croydon Park gunman fronts court",
      "neutral_headline": "Alleged Croydon Park Gunman Appears in Court",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/croydon-park-shooting-artemios-mintzas-faces-court/105861858",
          "published_at": "Tue, 07 Oct 2025 02:15:41 +0000",
          "title": "Lawyers’ spat as alleged Croydon Park gunman fronts court",
          "standfirst": "The 60-year-old accused of shooting at over a dozen random members of the public in suburban Sydney has faced a magistrate after two lawyers got into an argument over who was representing him.",
          "content": "The 60-year-old accused of shooting at over a dozen random members of the public in suburban Sydney has faced a magistrate after two lawyers got into an argument over who was representing him.",
          "feed_position": 2
        }
      ],
      "popularity_score": 331.7540094444444,
      "ai_summary": [
        "A 60-year-old man faced a magistrate in court.",
        "He is accused of shooting at random members of the public.",
        "Two lawyers argued over who would represent the accused.",
        "The shooting occurred in suburban Sydney.",
        "The accused faces multiple charges related to the shootings."
      ]
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 20:10:43 +0000",
      "title": "Live: Coalition says delay to triple-0 custodian reform 'not acceptable'",
      "neutral_headline": "Coalition Criticizes Delay in Triple-0 Custodian Reform",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/federal-politics-live-blog-oct-7/105858176",
          "published_at": "Mon, 06 Oct 2025 20:10:43 +0000",
          "title": "Live: Coalition says delay to triple-0 custodian reform 'not acceptable'",
          "standfirst": "The government is criticised for taking two years to act on recommendations from a review into an Optus outage. Follow live.",
          "content": "The government is criticised for taking two years to act on recommendations from a review into an Optus outage. Follow live.",
          "feed_position": 4
        }
      ],
      "popularity_score": 315.6712313888889,
      "ai_summary": [
        "The government is criticized for taking two years to act.",
        "The criticism stems from recommendations from an Optus outage review.",
        "The review focused on the triple-0 custodian reform.",
        "The Coalition considers the delay \"not acceptable\".",
        "The government has not yet fully implemented the recommendations."
      ]
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 02:39:26 +0000",
      "title": "Inside the dramatic rescue of Indonesian teens buried alive under their school",
      "neutral_headline": "Dramatic Rescue of Indonesian Teens Buried Alive",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/efforts-to-rescue-indonesian-students-buried-under-school/105857382",
          "published_at": "Tue, 07 Oct 2025 02:39:26 +0000",
          "title": "Inside the dramatic rescue of Indonesian teens buried alive under their school",
          "standfirst": "Rescue teams worked around the clock through narrow gaps in the rubble of Sidoarjo's Al Khoziny Islamic Boarding School while risking further collapse to reach anyone still alive.",
          "content": "Rescue teams worked around the clock through narrow gaps in the rubble of Sidoarjo's Al Khoziny Islamic Boarding School while risking further collapse to reach anyone still alive.",
          "feed_position": 5
        }
      ],
      "popularity_score": 312.1498427777778,
      "ai_summary": [
        "Rescue teams worked around the clock to save trapped teens.",
        "The teens were buried under the rubble of a school.",
        "The school was the Al Khoziny Islamic Boarding School.",
        "Rescuers risked further collapse to reach survivors.",
        "The rescue took place in Sidoarjo, Indonesia."
      ]
    },
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 03:05:07 +0000",
      "title": "Planning can help save you money this festive season",
      "neutral_headline": "Planning Can Help Save Money This Festive Season",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/preparing-financially-for-christmas-and-holidays/105795388",
          "published_at": "Tue, 07 Oct 2025 03:05:07 +0000",
          "title": "Planning can help save you money this festive season",
          "standfirst": "Australians estimate Christmas costs them about $800 a year, on average, but planning ahead can reduce the financial burden.",
          "content": "Australians estimate Christmas costs them about $800 a year, on average, but planning ahead can reduce the financial burden.",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.57789833333334,
      "ai_summary": [
        "Australians estimate Christmas costs around $800 annually.",
        "Planning ahead can reduce the financial burden of Christmas.",
        "The information is based on average spending estimates.",
        "The festive season is a period of increased spending.",
        "Financial planning can help manage holiday expenses."
      ]
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 03:10:26 +0000",
      "title": "Teen found with violent extremist material driven by 'teenage bravado'",
      "neutral_headline": "Teen found with violent extremist material driven by 'teenage bravado",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/teen-with-violent-extremist-material-driven-by-bravado-court/105861716",
          "published_at": "Tue, 07 Oct 2025 03:10:26 +0000",
          "title": "Teen found with violent extremist material driven by 'teenage bravado'",
          "standfirst": "The 17-year-old was arrested when police found a large number of videos and messages on his phone and laptop depicting violent extremist acts, many of which were highly disturbing.",
          "content": "The 17-year-old was arrested when police found a large number of videos and messages on his phone and laptop depicting violent extremist acts, many of which were highly disturbing.",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.66650944444444,
      "ai_summary": [
        "A 17-year-old was arrested by police.",
        "Police found violent extremist material on his devices.",
        "The material included videos and messages.",
        "The material depicted violent extremist acts.",
        "The teen's actions were attributed to \"teenage bravado\"."
      ]
    },
    {
      "id": "cluster_14",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 02:47:33 +0000",
      "title": "How to prevent falls becoming an inevitable part of ageing",
      "neutral_headline": "How to prevent falls becoming an inevitable part of ageing",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/high-rates-of-falls-for-older-people-injury-matters-report/105859552",
          "published_at": "Tue, 07 Oct 2025 02:47:33 +0000",
          "title": "How to prevent falls becoming an inevitable part of ageing",
          "standfirst": "Data shows one in three people aged over 65 will have a fall every year. But a Perth not-for-profit wants to send a message that falls are not an inevitable part of ageing.",
          "content": "Data shows one in three people aged over 65 will have a fall every year. But a Perth not-for-profit wants to send a message that falls are not an inevitable part of ageing.",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.2851205555556,
      "ai_summary": [
        "Data shows one in three people over 65 fall annually.",
        "A Perth not-for-profit is addressing the issue.",
        "Falls are not considered an inevitable part of ageing.",
        "The organization aims to raise awareness about fall prevention.",
        "The focus is on promoting strategies to reduce falls."
      ]
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:11:23 +0000",
      "title": "Owner says 'obscene' demand from energy retailer threatens Australia's last paper mill",
      "neutral_headline": "Owner says 'obscene' demand from energy retailer threatens Australia's last paper mill",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/boyer-pulp-mill-power-security-meeting/105860990",
          "published_at": "Tue, 07 Oct 2025 01:11:23 +0000",
          "title": "Owner says 'obscene' demand from energy retailer threatens Australia's last paper mill",
          "standfirst": "Aurora Energy is seeking a $7 million bank guarantee to cover energy costs for the Boyer Mill in southern Tasmania, but the paper mill's owner says the request is \"obscene\".",
          "content": "Aurora Energy is seeking a $7 million bank guarantee to cover energy costs for the Boyer Mill in southern Tasmania, but the paper mill's owner says the request is \"obscene\".",
          "feed_position": 7
        }
      ],
      "popularity_score": 280.6823425,
      "ai_summary": [
        "Aurora Energy seeks a $7 million bank guarantee.",
        "The guarantee is to cover energy costs for the Boyer Mill.",
        "The Boyer Mill is in southern Tasmania.",
        "The paper mill owner calls the demand \"obscene\".",
        "The mill is Australia's last remaining paper mill."
      ]
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 18:44:40 +0000",
      "title": "After two years of war, some Israelis feel a 'reckoning' is coming",
      "neutral_headline": "After two years of war, some Israelis feel a 'reckoning' is coming",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/israel-gaza-war-impacts-on-society-after-two-years/105856702",
          "published_at": "Mon, 06 Oct 2025 18:44:40 +0000",
          "title": "After two years of war, some Israelis feel a 'reckoning' is coming",
          "standfirst": "A fractured but defiant Israel is struggling to assert itself at home and abroad, on the anniversary of a Hamas attack that triggered the current war in Gaza.",
          "content": "A fractured but defiant Israel is struggling to assert itself at home and abroad, on the anniversary of a Hamas attack that triggered the current war in Gaza.",
          "feed_position": 8
        }
      ],
      "popularity_score": 264.2370647222222,
      "ai_summary": [
        "Israel is struggling at home and abroad.",
        "The war was triggered by a Hamas attack.",
        "The anniversary marks two years of conflict.",
        "Some Israelis feel a \"reckoning\" is approaching.",
        "Israel is described as fractured but defiant."
      ]
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:59:02 +0000",
      "title": "Australian sentenced to jail by Russian court for fighting in Ukraine",
      "neutral_headline": "Australian sentenced to jail by Russian court for fighting in Ukraine",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/australian-soldier-sentenced-russian-court-fighting-ukraine-jail/105861764",
          "published_at": "Tue, 07 Oct 2025 01:59:02 +0000",
          "title": "Australian sentenced to jail by Russian court for fighting in Ukraine",
          "standfirst": "The Australian man is accused of breaching Russia's criminal code by participating as a mercenary in an armed conflict.",
          "content": "The Australian man is accused of breaching Russia's criminal code by participating as a mercenary in an armed conflict.",
          "feed_position": 9
        }
      ],
      "popularity_score": 261.47650944444445,
      "ai_summary": [
        "An Australian man was sentenced to jail.",
        "The sentencing occurred in a Russian court.",
        "He was accused of fighting as a mercenary.",
        "He is accused of breaching Russia's criminal code.",
        "The conflict involved armed participation in Ukraine."
      ]
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 22:41:39 +0000",
      "title": "Live: Gold hits record high, local market slips lower",
      "neutral_headline": "Gold prices reach record high, Australian market declines",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/asx-markets-business-live-news-october-7/104980306",
          "published_at": "Mon, 06 Oct 2025 22:41:39 +0000",
          "title": "Live: Gold hits record high, local market slips lower",
          "standfirst": "Australia's share market has lost ground after a mixed night on Wall Street, as the US government shutdown continues. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
          "content": "Australia's share market has lost ground after a mixed night on Wall Street, as the US government shutdown continues. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
          "feed_position": 12
        }
      ],
      "popularity_score": 158.18678694444444,
      "ai_summary": [
        "Gold prices reached a record high, reflecting market uncertainty and economic concerns.",
        "Australia's share market experienced a downturn following mixed performance on Wall Street.",
        "The US government shutdown continues, impacting market sentiment and investor confidence.",
        "Business reporters provide live updates and insights on the ABC News live markets blog.",
        "The market's performance reflects the current economic climate and global events."
      ]
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 22:07:31 +0000",
      "title": "Live: Saints and Suns reach Flanders agreement as Dons reveal draft raid",
      "neutral_headline": "AFL Trade Period: Flanders to Saints, Oliver update, Carlton moves",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/afl-trade-period-day-two-live-updates-merrett-curnow-petracca/105859160",
          "published_at": "Mon, 06 Oct 2025 22:07:31 +0000",
          "title": "Live: Saints and Suns reach Flanders agreement as Dons reveal draft raid",
          "standfirst": "Sam Flanders makes the move to St Kilda in exchange for a draft pick, Adelaide pulls out of the race to sign Clayton Oliver, while Carlton makes the first official move of the trade period. Follow live.",
          "content": "Sam Flanders makes the move to St Kilda in exchange for a draft pick, Adelaide pulls out of the race to sign Clayton Oliver, while Carlton makes the first official move of the trade period. Follow live.",
          "feed_position": 22
        }
      ],
      "popularity_score": 157.61789805555554,
      "ai_summary": [
        "Sam Flanders is moving from Gold Coast to St Kilda in exchange for a draft pick.",
        "Adelaide has withdrawn from the race to acquire Clayton Oliver from Melbourne.",
        "Carlton has made the first official move of the AFL trade period.",
        "The trade period involves player transfers between Australian Football League teams.",
        "Updates are available live, tracking the latest developments in player movements."
      ]
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:30:37 +0000",
      "title": "Far north of WA sees 2.7 million hectares burnt, double the size of Sydney",
      "neutral_headline": "Bushfires burn 2.7 million hectares in Western Australia",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/kimberley-bushfires-millions-burnt-hectares/105835854",
          "published_at": "Tue, 07 Oct 2025 01:30:37 +0000",
          "title": "Far north of WA sees 2.7 million hectares burnt, double the size of Sydney",
          "standfirst": "This year's northern bushfire season has been dubbed \"one of the toughest on record\", with blazes having burnt through about 2.7 million hectares of land in WA's Kimberley region.",
          "content": "This year's northern bushfire season has been dubbed \"one of the toughest on record\", with blazes having burnt through about 2.7 million hectares of land in WA's Kimberley region.",
          "feed_position": 15
        }
      ],
      "popularity_score": 157.00289805555556,
      "ai_summary": [
        "The northern bushfire season in Western Australia is described as one of the toughest on record.",
        "Approximately 2.7 million hectares of land have been burned in the Kimberley region.",
        "The affected area is more than double the size of Sydney, highlighting the scale of the fires.",
        "The fires have caused significant environmental damage and pose ongoing risks.",
        "Authorities are working to manage and contain the blazes across the region."
      ]
    },
    {
      "id": "cluster_10",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 03:09:02 +0000",
      "title": "What the Health of the Nation report tells us about GPs by numbers",
      "neutral_headline": "What the Health of the Nation report tells us about GPs by numbers:",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/health-of-the-nation-gp-report-by-numbers/105861118",
          "published_at": "Tue, 07 Oct 2025 03:09:02 +0000",
          "title": "What the Health of the Nation report tells us about GPs by numbers",
          "standfirst": "These five charts give us a glimpse into what the current state of general practice looks like in Australia.",
          "content": "These five charts give us a glimpse into what the current state of general practice looks like in Australia.",
          "feed_position": 15
        }
      ],
      "popularity_score": 152.6431761111111,
      "ai_summary": [
        "The report provides insights into the current state of general practice in Australia.",
        "Five charts offer a glimpse into the data and statistics related to GPs.",
        "The charts cover various aspects of general practice, including patient care.",
        "The report aims to inform and provide data on the healthcare landscape.",
        "The information is relevant to healthcare professionals and policymakers."
      ]
    },
    {
      "id": "cluster_11",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 03:05:27 +0000",
      "title": "As big business backs out, Qld extends faith in coal-fired power",
      "neutral_headline": "Queensland extends faith in coal-fired power as business backs out",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/power-stations-extended-callide-energy-road-map-policy/105843616",
          "published_at": "Tue, 07 Oct 2025 03:05:27 +0000",
          "title": "As big business backs out, Qld extends faith in coal-fired power",
          "standfirst": "In Biloela, locals have seen it all — from \"coal is king\" to renewables and a short-lived nuclear proposal. Now the Queensland government is extending coal-fired power, but how long will the reprieve last?",
          "content": "In Biloela, locals have seen it all — from \"coal is king\" to renewables and a short-lived nuclear proposal. Now the Queensland government is extending coal-fired power, but how long will the reprieve last?",
          "feed_position": 20
        }
      ],
      "popularity_score": 152.5834538888889,
      "ai_summary": [
        "The Queensland government is extending the use of coal-fired power in Biloela.",
        "Locals in Biloela have experienced shifts from coal to renewables and nuclear proposals.",
        "Big businesses are backing out of coal-fired power projects in the region.",
        "The decision raises questions about the long-term energy strategy for Queensland.",
        "The government's move reflects a complex interplay of economic and environmental factors."
      ]
    },
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 02:33:13 +0000",
      "title": "Body recovered during search for 15yo swimmer in Tamworth",
      "neutral_headline": "Body recovered in search for missing swimmer in Tamworth",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/body-found-in-search-for-swimmer-peel-river-tamworth/105860868",
          "published_at": "Tue, 07 Oct 2025 02:33:13 +0000",
          "title": "Body recovered during search for 15yo swimmer in Tamworth",
          "standfirst": "A multi-agency search of the Peel River began on Monday night after police were told the teen had entered the water and failed to resurface.",
          "content": "A multi-agency search of the Peel River began on Monday night after police were told the teen had entered the water and failed to resurface.",
          "feed_position": 21
        }
      ],
      "popularity_score": 152.04623166666667,
      "ai_summary": [
        "A multi-agency search was conducted in the Peel River in Tamworth.",
        "The search began after a 15-year-old swimmer failed to resurface.",
        "The search involved police and other emergency services personnel.",
        "The body of the missing swimmer was recovered from the river.",
        "The incident is under investigation, and support is being offered to the family."
      ]
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 02:11:02 +0000",
      "title": "These whales were hunted to 150 individuals. Now there's 50,000 of them",
      "neutral_headline": "Humpback whale population rebounds after near extinction",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/science/2025-10-07/humpback-whales-eastern-population-numbers-rebound-estimate/105843256",
          "published_at": "Tue, 07 Oct 2025 02:11:02 +0000",
          "title": "These whales were hunted to 150 individuals. Now there's 50,000 of them",
          "standfirst": "Once hunted almost to extinction, the population of humpback whales currently migrating down Australia's east coast has bounced back and is now greater than before whaling.",
          "content": "Once hunted almost to extinction, the population of humpback whales currently migrating down Australia's east coast has bounced back and is now greater than before whaling.",
          "feed_position": 13
        }
      ],
      "popularity_score": 151.67650944444443,
      "ai_summary": [
        "Humpback whales were once hunted to near extinction, with only 150 individuals.",
        "The current population of humpback whales migrating down the east coast is 50,000.",
        "The population has rebounded and is now greater than before whaling.",
        "This represents a significant conservation success story for the species.",
        "The recovery highlights the effectiveness of conservation efforts."
      ]
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:36:14 +0000",
      "title": "Mother of Australian from Gaza flotilla pleads: 'Stand up for my son'",
      "neutral_headline": "Mother of Australian from Gaza flotilla pleads: 'Stand up for my son':",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/calls-to-bring-australians-from-gaza-flotilla-home-from-israel/105858482",
          "published_at": "Tue, 07 Oct 2025 01:36:14 +0000",
          "title": "Mother of Australian from Gaza flotilla pleads: 'Stand up for my son'",
          "standfirst": "Jacinta McEwan calls for the Australian government to help her son amid reports he has been physically abused after being arrested on a flotilla trying to break Israel's naval blockade of Gaza.",
          "content": "Jacinta McEwan calls for the Australian government to help her son amid reports he has been physically abused after being arrested on a flotilla trying to break Israel's naval blockade of Gaza.",
          "feed_position": 17
        }
      ],
      "popularity_score": 151.09650944444445,
      "ai_summary": [
        "Jacinta McEwan is calling for Australian government assistance for her son.",
        "Her son was arrested on a flotilla attempting to break Israel's naval blockade of Gaza.",
        "Reports indicate her son has been physically abused after his arrest.",
        "She is seeking help from the Australian government to address the situation.",
        "The case involves international relations and human rights concerns."
      ]
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:28:49 +0000",
      "title": "Trent Dalton's latest is about how far a journalist will go for a story",
      "neutral_headline": "Trent Dalton's latest is about how far a journalist will go for a story:",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/trent-dalton-new-book-gravity-let-me-go-boy-swallows-universe/105806326",
          "published_at": "Tue, 07 Oct 2025 01:28:49 +0000",
          "title": "Trent Dalton's latest is about how far a journalist will go for a story",
          "standfirst": "In Gravity Let Me Go, a struggling crime journalist lands the scoop of a lifetime, to the detriment of his loved ones. That's something Trent Dalton understands intimately.",
          "content": "In Gravity Let Me Go, a struggling crime journalist lands the scoop of a lifetime, to the detriment of his loved ones. That's something Trent Dalton understands intimately.",
          "feed_position": 16
        }
      ],
      "popularity_score": 150.97289805555556,
      "ai_summary": [
        "Trent Dalton's new book, \"Gravity Let Me Go,\" explores journalistic ethics.",
        "The story follows a struggling crime journalist seeking a career-defining scoop.",
        "The journalist's pursuit of the story negatively impacts his loved ones.",
        "Dalton draws on his own experiences to inform the narrative.",
        "The book delves into the complexities of relationships and ambition."
      ]
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:15:40 +0000",
      "title": "NT parents referred to income management if kids fail to attend class",
      "neutral_headline": "NT parents face income management for school absenteeism",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/nt-government-school-truancy-plan-backlash-education/105856318",
          "published_at": "Tue, 07 Oct 2025 01:15:40 +0000",
          "title": "NT parents referred to income management if kids fail to attend class",
          "standfirst": "Parents in the NT who frequently fail to send their children to school, without a valid reason, may have their income managed by the Commonwealth.",
          "content": "Parents in the NT who frequently fail to send their children to school, without a valid reason, may have their income managed by the Commonwealth.",
          "feed_position": 17
        }
      ],
      "popularity_score": 150.7537313888889,
      "ai_summary": [
        "Parents in the Northern Territory may have their income managed.",
        "This action is taken if children frequently miss school without valid reasons.",
        "The Commonwealth government will manage the income of affected parents.",
        "The policy aims to improve school attendance rates in the NT.",
        "The measure is intended to support children's education and well-being."
      ]
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:00:50 +0000",
      "title": "Erinsborough High bags, Dr Karl’s briefcase among tv props sent to op shop",
      "neutral_headline": "Neighbours props sent to op shop after 40 years",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/neighbours-fans-rush-to-find-props-donated-to-melbourne-op-shops/105858078",
          "published_at": "Tue, 07 Oct 2025 01:00:50 +0000",
          "title": "Erinsborough High bags, Dr Karl’s briefcase among tv props sent to op shop",
          "standfirst": "Neighbours fans rush to Melbourne op shops after 40 years of props, furniture and Ramsay Street relics were donated to charities.",
          "content": "Neighbours fans rush to Melbourne op shops after 40 years of props, furniture and Ramsay Street relics were donated to charities.",
          "feed_position": 16
        }
      ],
      "popularity_score": 150.50650916666666,
      "ai_summary": [
        "Props from the television show \"Neighbours\" have been donated to op shops.",
        "Items include Erinsborough High bags and Dr. Karl's briefcase.",
        "The donation follows the show's 40-year run and its conclusion.",
        "Fans are visiting Melbourne op shops to acquire memorabilia.",
        "The event reflects the show's cultural impact and popularity."
      ]
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 00:55:19 +0000",
      "title": "Midlife loneliness on the rise in Canberra as financial pressures bite",
      "neutral_headline": "Midlife loneliness increases in Canberra due to financial pressures",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/midlife-loneliness-rises-canberra-as-cost-of-living-bites/105860924",
          "published_at": "Tue, 07 Oct 2025 00:55:19 +0000",
          "title": "Midlife loneliness on the rise in Canberra as financial pressures bite",
          "standfirst": "Loneliness is rising fastest among Canberrans in their 30s and 40s, with new research showing this cohort is now more likely than younger people to report feeling lonely in the ACT.",
          "content": "Loneliness is rising fastest among Canberrans in their 30s and 40s, with new research showing this cohort is now more likely than younger people to report feeling lonely in the ACT.",
          "feed_position": 22
        }
      ],
      "popularity_score": 150.41456472222222,
      "ai_summary": [
        "Loneliness is rising fastest among Canberrans in their 30s and 40s.",
        "This age group is now more likely to report feeling lonely.",
        "Financial pressures are contributing to the rise in loneliness.",
        "The research highlights a growing social issue in the ACT.",
        "The findings underscore the need for support and intervention."
      ]
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 00:16:24 +0000",
      "title": "UEFA makes 'regrettable' decision to allow Italian Serie A match in Perth",
      "neutral_headline": "UEFA makes 'regrettable' decision to allow Italian Serie A match in Perth:",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/ac-milan-to-play-in-perth-as-uefa-says-it-is-regrettable/105861238",
          "published_at": "Tue, 07 Oct 2025 00:16:24 +0000",
          "title": "UEFA makes 'regrettable' decision to allow Italian Serie A match in Perth",
          "standfirst": "AC Milan will host a Serie A match in Perth next year, as UEFA's hand appears to have been forced to allow the game to go ahead.",
          "content": "AC Milan will host a Serie A match in Perth next year, as UEFA's hand appears to have been forced to allow the game to go ahead.",
          "feed_position": 24
        }
      ],
      "popularity_score": 149.76595361111112,
      "ai_summary": [
        "AC Milan will host a Serie A match in Perth next year.",
        "UEFA's decision to allow the game is described as \"regrettable.\"",
        "The decision appears to have been forced upon UEFA.",
        "The match will bring a major European football event to Australia.",
        "The event has implications for the sport's global reach."
      ]
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 23:50:14 +0000",
      "title": "Why has France gone through five prime ministers in two years?",
      "neutral_headline": "France experiences five prime ministers in two years",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/france-political-chaos-explainer-fifth-pm-in-two-years/105860746",
          "published_at": "Mon, 06 Oct 2025 23:50:14 +0000",
          "title": "Why has France gone through five prime ministers in two years?",
          "standfirst": "The sudden resignation of France's prime minister — the country's fifth in two years — has put President Emmanuel Macron in a bind.",
          "content": "The sudden resignation of France's prime minister — the country's fifth in two years — has put President Emmanuel Macron in a bind.",
          "feed_position": 18
        }
      ],
      "popularity_score": 149.32984249999998,
      "ai_summary": [
        "France has seen five prime ministers in the last two years.",
        "The current prime minister's resignation has put President Macron in a bind.",
        "The frequent changes reflect political instability in France.",
        "The situation raises questions about the government's stability.",
        "The political landscape is marked by challenges and shifts."
      ]
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 00:33:55 +0000",
      "title": "Roaming cats cause carnage as law revamp stalls",
      "neutral_headline": "Roaming cats cause carnage as law revamp stalls",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-07/native-animals-die-local-government-cat-laws-thrown-out/105794048",
          "published_at": "Tue, 07 Oct 2025 00:33:55 +0000",
          "title": "Roaming cats cause carnage as law revamp stalls",
          "standfirst": "Concerned carers in WA say roaming pet cats will kill thousands of native animals while the state government debates changes to cat laws.",
          "content": "Concerned carers in WA say roaming pet cats will kill thousands of native animals while the state government debates changes to cat laws.",
          "feed_position": 23
        }
      ],
      "popularity_score": 147.05789805555554,
      "ai_summary": [
        "Concerned carers in Western Australia are worried about roaming cats.",
        "They claim roaming cats will kill thousands of native animals.",
        "The state government is debating changes to cat laws.",
        "The debate is focused on the impact of cats on wildlife.",
        "The issue involves animal welfare and environmental protection."
      ]
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Tue, 07 Oct 2025 01:33:52 +0000",
      "title": "Country's most disaster-prone state urged to prepare as severe weather looms",
      "neutral_headline": "Disaster-prone state urged to prepare for severe weather",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/queensland-fires-floods-storm-seasonemergency-season-prep/105860906",
          "published_at": "Tue, 07 Oct 2025 01:33:52 +0000",
          "title": "Country's most disaster-prone state urged to prepare as severe weather looms",
          "standfirst": "Parts of the state are still reeling from last season's flooding, storms and rainfall, with the majority of council areas disaster-declared already.",
          "content": "Parts of the state are still reeling from last season's flooding, storms and rainfall, with the majority of council areas disaster-declared already.",
          "feed_position": 11
        }
      ],
      "popularity_score": 146.057065,
      "ai_summary": [
        "The state is still recovering from last season's floods, storms, and heavy rainfall.",
        "Most council areas in the state have already been declared disaster zones.",
        "Authorities are urging residents to prepare for potential severe weather events.",
        "Specific details about the impending weather threats were not provided in the article.",
        "The article focuses on the need for preparedness in a disaster-prone region."
      ]
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 20:04:09 +0000",
      "title": "Singapore PM warns of 'huge consequences' in ending current world order",
      "neutral_headline": "Singapore PM warns of consequences in ending world order",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/singapore-wants-to-expand-its-military-ties-with-australia/105856094",
          "published_at": "Mon, 06 Oct 2025 20:04:09 +0000",
          "title": "Singapore PM warns of 'huge consequences' in ending current world order",
          "standfirst": "Singapore wants to expand its military ties with Australia, including through a greater Australian troop presence in the island state as part of an upgraded trade and defence relationship, according to Prime Minister Lawrence Wong.",
          "content": "Singapore wants to expand its military ties with Australia, including through a greater Australian troop presence in the island state as part of an upgraded trade and defence relationship, according to Prime Minister Lawrence Wong.",
          "feed_position": 14
        }
      ],
      "popularity_score": 145.56178694444444,
      "ai_summary": [
        "Singapore's Prime Minister warned of \"huge consequences\" regarding the current world order.",
        "Singapore seeks to expand military ties with Australia, including troop presence.",
        "This expansion is part of an upgraded trade and defense relationship.",
        "The article does not specify the exact nature of the consequences.",
        "The focus is on strengthening ties between Singapore and Australia."
      ]
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 20:03:32 +0000",
      "title": "GP says fees will go up at his clinic when bulk-billing incentives come in",
      "neutral_headline": "GP says fees will increase when bulk-billing incentives start",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/bulk-billing-low-as-gps-spend-longer-with-patients-racgp/105856332",
          "published_at": "Mon, 06 Oct 2025 20:03:32 +0000",
          "title": "GP says fees will go up at his clinic when bulk-billing incentives come in",
          "standfirst": "An industry survey finds GPs are managing conditions typically handled by specialists due to high costs and only 12 per cent can afford to bulk-bill all patients.",
          "content": "An industry survey finds GPs are managing conditions typically handled by specialists due to high costs and only 12 per cent can afford to bulk-bill all patients.",
          "feed_position": 19
        }
      ],
      "popularity_score": 145.55150916666668,
      "ai_summary": [
        "A general practitioner stated fees will increase when bulk-billing incentives are implemented.",
        "An industry survey found GPs manage conditions typically handled by specialists.",
        "High costs are a factor in GPs managing specialist conditions.",
        "Only 12 percent of GPs can afford to bulk-bill all patients.",
        "The article highlights challenges in the current healthcare system."
      ]
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Mon, 06 Oct 2025 15:48:46 +0000",
      "title": "Hundreds of hikers still missing after Mount Everest blizzard",
      "neutral_headline": "Hundreds of hikers still missing after Mount Everest blizzard",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-07/hundreds-rescued-from-mount-everest-blizzard-as-search-continues/105860278",
          "published_at": "Mon, 06 Oct 2025 15:48:46 +0000",
          "title": "Hundreds of hikers still missing after Mount Everest blizzard",
          "standfirst": "Villagers have joined rescue crews in attempting to save those who have become stuck in heavy snow on Mount Everest in Tibet.",
          "content": "Villagers have joined rescue crews in attempting to save those who have become stuck in heavy snow on Mount Everest in Tibet.",
          "feed_position": 24
        }
      ],
      "popularity_score": 141.30539805555554,
      "ai_summary": [
        "Hundreds of hikers remain missing after a blizzard on Mount Everest.",
        "The blizzard occurred in the Tibet region of Mount Everest.",
        "Villagers are assisting rescue crews in the search efforts.",
        "Rescue teams are attempting to save those stranded in heavy snow.",
        "The article focuses on the ongoing rescue operation."
      ]
    }
  ]
}