{
  "updated_at": "2026-01-26T19:23:37.542Z",
  "clusters": [
    {
      "id": "cluster_51",
      "coverage": 3,
      "updated_at": "Mon, 26 Jan 2026 09:24:35 +0000",
      "title": "Man arrested for alleged neo-Nazi hate speech at protest",
      "neutral_headline": "Man arrested for alleged neo-Nazi hate speech at protest",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/invasion-day-australia-day-protests-thousands-expected-to-rally-in-capital-cities/95d2cf97-18d5-41e1-87b3-3d1ddec8e12a",
          "published_at": "Mon, 26 Jan 2026 09:24:35 +0000",
          "title": "Man arrested for alleged neo-Nazi hate speech at protest",
          "standfirst": "Thousands of people have joined rallies in cities across Australia, with Invasion Day events and March for Australia anti-immigration demonstrations taking place.",
          "content": "Thousands of people have joined protests in cities around Australia today, with Invasion Day rallies and counter March for Australia demonstrations taking place.January 26, the day Governor Arthur Phillip ran up the British flag at Sydney Cove, is officially Australia Day, but many mark the date as Invasion Day, recognising the dispossession of Indigenous Australians.Protests were organised in every Australian capital today, with NSW Police announcing recently they had tweaked the extended protest ban in place after the Bondi Beach attack in order to allow activists to march in certain areas of Sydney.Warning: This article contains the name and image of an Indigenous person who has died. READ MORE: Hundreds flee homes as Victoria bushfire breaks containmentDevice thrown at Perth crowd In Perth, Invasion Day rally crowds were sent fleeing after an apparent explosives device was thrown towards a stage where speeches were about to take place. A 31-year-old man was taken into police custody.Police Commissioner Col Blanch said officers worked with organisers to immediately evacuate 2000 people amid fears of a potential mass-casualty event.He said the \"very rudimentary device\" was about the size of a medium coffee cup. \"The device that was located just in front of the stage area contained ball bearings, contained screws and those items were wrapped around an unknown-at-this-stage liquid in a glass container,\" he said.Forensic tests are expected to reveal tomorrow whether the device contained explosives. \"This is a very, very serious incident ,\" Blanch said.\"This is un-Australian and the exact opposite of what we all wanted today to be. \"Man arrested over alleged neo-Nazi speech in SydneyA man has been arrested over alleged neo-Nazi comments he made during an open-mic session during Sydney&#x27;s March for Australia protest at Moore Park.The 31-year-old was stopped on nearby Bourke Street in Surry Hills after his comments and taken into custody.He was charged with \"publicly incite hatred on ground of race causing fear\".Operation Australia Day Commander Brett McFadden alleged the man engaged in hate speech aligned with neo-Nazi ideology.\"We arrested a 31-year-old male who engaged in what we will allege is a hate speech during an open mic session at Moore Park,\" he told reporters.\"We will allege that the language he used, his presence, was clearly and unequivocally aligned with neo-Nazi ideology and his presence and language incited a response from the crowd, generating hate towards a particular group in our community.\"NSW Premier Chris Minns said police were on high alert for any protesters who violate federal legislation during the marches in Sydney.\"There will be no tolerance for violence or hate speech on Sydney streets,\" he said.\"We live in a beautiful multicultural community with people from around the world, but we will not tolerate a situation where, on Australia&#x27;s national day, it&#x27;s been pulled down by divisive language, hate speech or racism.\"Minns said he has not ruled out introducing stricter legislation, saying people have a right to enjoy the city. \"I do believe we have to confront this idea that the centre of Sydney can be dominated weekend after weekend after weekend by the same protest,\" he said.\"People have got a right to protest, but other Australians have a right to enjoy the city.\"My responsibility is to keep the people of NSW safe, and to balance those rights.\"Two others were arrested under Operation Australia Day.A 17-year-old man was arrested in Bondi for allegedly assaulting police and is being questioned by police.A 28-year-old was charged with domestic violence offences at Victoria Park, which were unrelated to the protests.McFadden said despite the few incidents, the overwhelming majority of the crowds were respectful.About 18,000 people turned up for the Invasion Day rally in Sydney, while 2000 attended the March for Australia rally. The Invasion Day protest kicked off with a heavy police presence in Hyde Park about 10am.The rally began with a moving tribute to Sophie Quinn, an Indigenous woman who was allegedly shot dead by her former partner in Lake Cargelligo in NSW last week.Quinn&#x27;s aunt Neruda and her friend John Harris were also killed in the shooting. Protesters at today&#x27;s rally are holding signs that read \"Stop killing us\" and \"sovereignty never ceded\".Members of the Palestine Action Group also showed their support at the rally.Later, the March for Australia anti-immigration rally kicked off at Cleveland Street to Moore Park.Tensions flared between opposing groups.In one instance, residents were involved in an \"exchange of views\" with March for Australia protesters.McFadden said police intervened and de-escalated the situation before anything could happen. Another protester was seen carrying a sign that called to \"free Joel Davis\", the neo-Nazi leader who is accused of allegedly urging followers to \"rhetorically rape\" Wentworth MP Allegra Spender.A brief scuffle broke out between Invasion Day demonstrators and a group of men with Australian flags, The Sydney Morning Herald reported. Police officers intervened again before the rally continued towards Broadway.Invasion Day protest dwarfs March for Australia in MelbourneAbout 19,000 people descended on Melbourne&#x27;s CBD in opposing protests being held on the steps of Victorian Parliament and outside the Flinders Street train station.A smoking ceremony took place outside parliament to mark the beginning of the Invasion Day protest, which attracted 17,000 marchers.Meanwhile, 2000 March for Australia protesters waved the national flag as they walked through the CBD. Aerial vision from the 9News helicopter showed thousands of people part of the Invasion Day rally, while there was a visibly smaller turnout for the opposing March for Australia rally outside Flinders Street station.Some demonstrators could be heard chanting \"always was, always will be, Aboriginal land\".9News captured footage of a confrontation between opposing protesters near the steps of parliament , which led to one woman being knocked to the ground.Police were on the ground monitoring the situation. There was \"minimal conflict\" between the two groups, according to police, although a handful of incidents were reported. One man was sprayed in the face \"by an unknown substance\" on the corner of Swanston and Bourke streets by someone wearing an Australian flag as a cape, police said.Another man, who police believe was part of the March for Australia group, was assaulted at a licensed premises on Bourke Street.The offenders fled and the victim did not want to make a statement.Separately, a male and female were racially abused by four while they were packing up their car near the intersection of Westwood Place and Little Collins Street, police said.The attackers chased the victims&#x27; car and smashed the back window with what police believe was a stolen broken boom gate.Police allege one of the men performed a Nazi salute during the attack. The offenders fled the scene.All of the matters are being investigated by police. Captain Cook statue under guardA security guard kept an eye on a Captain Cook memorial statue in St Kilda after the monument was toppled by vandals on Australia Day two years ago.Port Phillip Council hired a guard to protect the statue from potential defacement today.The sculpture was sawn off at the ankles and painted with the words \"the colony will fall\" in 2024. In 2022, red paint was also thrown across the statue over three consecutive days.Pauline Hanson speaks to crowd in BrisbaneOne Nation Senator Pauline Hanson made an appearance at an Australia Day march in Brisbane&#x27;s Botanic Gardens in the CBD.The Hoodoo Gurus anthem What&#x27;s My Scene? played as she was welcomed to the stage.She decried \"mass migration\" in Australia during her speech and said Anthony Albanese was the \"worst prime minister I have ever known\".March for Australia protesters in CanberraMeanwhile, in Canberra, an opposing March for Australia protest took place outside Parliament House.The Australian Federal Police was out in full force as protesters waved Australian flags and marched towards Lennox Gardens in Yarralumla.An Invasion Day protest also began at 10am in Canberra and is expected to finish at Old Parliament House.Police warned the protests could cause traffic disruptions in the capital today. &#x27;Zero tolerance&#x27; for hate speech , violenceNSW Premier Chris Minns said police were on high alert for any protesters who violate federal legislation during the marches in Sydney.\"There will be no tolerance for violence or hate speech on Sydney streets,\" he said.\"We live in a beautiful multicultural community with people from around the world, but we will not tolerate a situation where, on Australia&#x27;s national day, it&#x27;s been pulled down by divisive language, hate speech or racism.\"Minns said he was confident protesters would respect exclusion zones and that police had been liaising with organisers for weeks to ensure today goes ahead without incident.When asked about his plans to tighten protest laws further in NSW, the premier said he had not ruled out introducing stricter legislation.Minns said he has not ruled out introducing stricter legislation, saying people have a right to enjoy the city. \"I do believe we have to confront this idea that the centre of Sydney can be dominated weekend after weekend after weekend by the same protest,\" he said.\"People have got a right to protest, but other Australians have a right to enjoy the city.\"My responsibility is to keep the people of NSW safe, and to balance those rights.\"He said the state government would also look at changing the scope of hate slogan laws in the wake of federal laws, which were passed in parliament last week. Support for Australia Day rising Recent polls, including from Resolve and Roy Morgan, indicate that support for keeping Australia Day on January 26 is rising.Roy Morgan found that 72 per cent of respondents agreed Australia Day should retain its current name and date, compared to 28 per cent who disagreed.\"This is the highest support for Australia Day recorded by Roy Morgan,\" chief executive Michele Levine said.\"There is majority support for Australia Day retaining its name and date across all age groups, genders, and all states. \"However, there remains a political divide, with most Labor and Greens voters saying the date should be changed, while Liberal, National, and One Nation voters hugely supported it.",
          "feed_position": 2,
          "image_url": "https://prod.static9.net.au/fs/79184210-eb50-425c-8282-94ddea2d102e"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2026/jan/26/tens-of-thousands-join-invasion-day-protests-across-australia-video",
          "published_at": "Mon, 26 Jan 2026 09:15:07 GMT",
          "title": "Tens of thousands join Invasion Day protests across Australia – video",
          "standfirst": "Thousands of First Nations people and their allies gather across Australia on Invasion Day, a day that marks the ongoing fight against racism and dispossession of Aboriginal and Torres Strait Islander people. Yorta Yorta man Jye Charles says even though the day is 'heavy ... it's a pretty good time for mob to get together and non-Indigenous people to show their solidarity'. Anti-immigration protests are also held, with Pauline Hanson addressing a March for Australia in Brisbane Invasion Day: police clear Perth protest site amid reports of ‘threat’ as huge marches held across AustraliaA short explainer on Invasion Day's very long history Continue reading...",
          "content": "Thousands of First Nations people and their allies gather across Australia on Invasion Day, a day that marks the ongoing fight against racism and dispossession of Aboriginal and Torres Strait Islander people. Yorta Yorta man Jye Charles says even though the day is 'heavy ... it's a pretty good time for mob to get together and non-Indigenous people to show their solidarity'. Anti-immigration protests are also held, with Pauline Hanson addressing a March for Australia in Brisbane Invasion Day: police clear Perth protest site amid reports of ‘threat’ as huge marches held across AustraliaA short explainer on Invasion Day's very long history Continue reading...",
          "feed_position": 4
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2026/jan/26/invasion-day-police-clear-perth-protest-site-due-to-threat-as-tens-of-thousands-march-across-australia-ntwnfb",
          "published_at": "Mon, 26 Jan 2026 08:55:29 GMT",
          "title": "Invasion Day: police investigate ‘device’ thrown into Perth crowd as huge marches held across Australia",
          "standfirst": "Anti-immigration protesters clash with First Nations people and supporters in Melbourne and Canberra at otherwise peaceful ralliesGet our breaking news email, free app or daily news podcastPolice in Western Australia are investigating a “device” thrown into the crowd at the city’s Invasion Day rally, sparking a security scare that ended the protest.Speaking to the media on Monday afternoon, the WA police commissioner, Col Blanch, said a 31-year-old man had been arrested after allegedly throwing the device. Continue reading...",
          "content": "Anti-immigration protesters clash with First Nations people and supporters in Melbourne and Canberra at otherwise peaceful ralliesGet our breaking news email, free app or daily news podcastPolice in Western Australia are investigating a “device” thrown into the crowd at the city’s Invasion Day rally, sparking a security scare that ended the protest.Speaking to the media on Monday afternoon, the WA police commissioner, Col Blanch, said a 31-year-old man had been arrested after allegedly throwing the device. Continue reading...",
          "feed_position": 5
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/march-for-australia-anti-immigration-rally/106269414",
          "published_at": "Mon, 26 Jan 2026 06:20:06 +0000",
          "title": "Man charged with publicly inciting hatred at March for Australia rally",
          "standfirst": "A 31-year-old has been arrested and charged by police for allegedly using hate speech \"aligned with Neo-Nazi ideology\" at an open mic session at the anti-immigration rally.",
          "content": "A 31-year-old has been arrested and charged by police for allegedly using hate speech \"aligned with Neo-Nazi ideology\" at an open mic session at the anti-immigration rally.",
          "feed_position": 22
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/79184210-eb50-425c-8282-94ddea2d102e",
      "popularity_score": 3010.0159608333333
    },
    {
      "id": "cluster_1",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 19:13:56 +0000",
      "title": "Man charged with rape, attempted murder of woman on walking track",
      "neutral_headline": "Man charged with rape, attempted murder of woman on walking track",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/alleged-rape-attempted-murder-yeppen-lagoon-rockhampton-queensland-man-charged/0801fe7f-b32d-4624-a4c5-2f4054594fb0",
          "published_at": "Mon, 26 Jan 2026 19:13:56 +0000",
          "title": "Man charged with rape, attempted murder of woman on walking track",
          "standfirst": "T he 27-year-old man will face court in Queensland today after the alleged attack on Sunday morning.",
          "content": "A man has been charged with three counts of rape and one count of attempted murder after an alleged attack on a woman in Rockhampton, Queensland.Police allege the woman was attacked and sexually assaulted by the man near a popular walking track around Yeppen Lagoon, at 10.30am on Sunday.The matter was reported to police at about 11am, and the woman taken to hospital.READ MORE: Firefighters brace for heatwave peak as out-of-control blaze rages She is receiving treatment and professional support.After establishing a crime scene, police appealed to the public for information, and yesterday at 11am arrested and charged a 27-year-old Victorian Man at Boat Harbour Drive in Hervey Bay. He was refused bail and will appear in court today.The investigation continues, with police particularly seeking information or vision of a dark blue 2008 Toyota two-door hatchback from the Yeppen Lagoon area around the time of the alleged offence.Anybody with information is urged to contact Crime Stoppers on 1800 333 000 or online. Support is available from the National Sexual Assault, Domestic and Family Violence Counselling Service at 1800RESPECT (1800 737 732).",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/1af9c89d-80d1-433c-831b-dd37c762baa9"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/man-charged-over-alleged-rape-attempted-murder-in-queensland-20260127-p5nx6p.html",
          "published_at": "Tue, 27 Jan 2026 05:57:56 +1100",
          "title": "Man charged over alleged rape, attempted murder in Queensland",
          "standfirst": "A man has been charged with three counts of rape and one count of attempted murder after an alleged attack on a woman in Rockhampton, Queensland.",
          "content": "A man has been charged with three counts of rape and one count of attempted murder after an alleged attack on a woman in Rockhampton, Queensland.",
          "feed_position": 2,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/8738aec47e4ef7b31dd0d5d11f4ec8b2bdf69f5b"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/1af9c89d-80d1-433c-831b-dd37c762baa9",
      "popularity_score": 2019.8384608333333
    },
    {
      "id": "cluster_42",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 14:00:05 GMT",
      "title": "Services Australia has not applied child support law properly and some parents are owed money, report finds",
      "neutral_headline": "Government agency deliberately broke law for years, federal watchdog finds",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2026/jan/27/services-australia-has-not-applied-child-support-law-properly-and-some-parents-are-owed-money-report-finds",
          "published_at": "Mon, 26 Jan 2026 14:00:05 GMT",
          "title": "Services Australia has not applied child support law properly and some parents are owed money, report finds",
          "standfirst": "Ombudsman says agency knew for years that part of its child support processing not in line with lawGet our breaking news email, free app or daily news podcastServices Australia knew its internal practices relating to child support payments conflict with the law but did nothing about it for six years, a report from the commonwealth ombudsman has found.In 2019, the agency identified that its child support practice that stipulated that parents with less than 35% care of a child do not receive financial support was not aligned with the law. Continue reading...",
          "content": "Ombudsman says agency knew for years that part of its child support processing not in line with lawGet our breaking news email, free app or daily news podcastServices Australia knew its internal practices relating to child support payments conflict with the law but did nothing about it for six years, a report from the commonwealth ombudsman has found.In 2019, the agency identified that its child support practice that stipulated that parents with less than 35% care of a child do not receive financial support was not aligned with the law. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/services-australia-knowingly-broke-law-for-years/106261814",
          "published_at": "Mon, 26 Jan 2026 13:02:37 +0000",
          "title": "Government agency deliberately broke law for years, federal watchdog finds",
          "standfirst": "Services Australia has known it was not fully complying with new child support laws since 2019, according to a scathing report released by the Commonwealth Ombudsman.",
          "content": "Services Australia has known it was not fully complying with new child support laws since 2019, according to a scathing report released by the Commonwealth Ombudsman.",
          "feed_position": 0
        }
      ],
      "popularity_score": 2014.6076275
    },
    {
      "id": "cluster_50",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 10:15:50 +0000",
      "title": "Crowds flee as suspected explosives device thrown into Perth Invasion Day rally",
      "neutral_headline": "Crowds flee as suspected explosives device thrown into Perth Invasion Day rally",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/wa-police-responds-threats-in-perth-cbd/13c46a62-f937-4fa7-8e0b-d73ee2dae546",
          "published_at": "Mon, 26 Jan 2026 10:15:50 +0000",
          "title": "Crowds flee as suspected explosives device thrown into Perth Invasion Day rally",
          "standfirst": "A man is in police custody after a device was thrown as speeches were about to begin, forcing thousands to evacuate.",
          "content": "A man is in police custody after a device was thrown into a crowd during an Invasion Day rally in Perth, forcing thousands of marchers to evacuate over bomb fears.WA Police confirmed a device was thrown into the protest crowd on Forrest Place in the CBD, just as speeches were starting about 30 minutes after the rally&#x27;s 12pm kick off.\"Members of the public that were situated on the upper level on the eastern side of Forrest Place observed a male throw an object down in front of the stage area,\" Police Commissioner Col Blanch said.READ MORE: Hundreds flee homes as Victoria bushfire breaks containmentREAD MORE: &#x27;Terrible nightmares&#x27;: Sole survivor of NSW shooting relives tragedy\"Police immediately responded. They arrested the person who threw the device and that male indicated that that device may contain explosives.\"Police worked with organisers to immediately evacuate 2000 people amid fears of a potential mass-casualty event, Blanch said.The commissioner said the \"very rudimentary device\" was about the size of a medium coffee cup. \"The device that was located just in front of the stage area contained ball bearings, contained screws and those items were wrapped around an unknown-at-this-stage liquid in a glass container,\" he said.A 31-year-old man from Warwick was in police custody over the matter and was assisting police with their enquiries.A house was being searched by police.\"This is a very, very serious incident ,\" Blanch said.\"This is un-Australian and the exact opposite of what we all wanted today to be. \"The device did not detonate and no injuries were reported. They do not believe there is an ongoing threat to the public. Forensics are being undertaken to determine whether the device contained explosives, which Blanch said they would find out by tomorrow. Premier Roger Cook slammed incident as \"completely unacceptable\".\"This Australia Day should be about unity, not division. That a peaceful protest was targeted in this fashion runs against the very heart of what it means to be Australian,\" Cook said.\"We can&#x27;t let hate win.\"Two separate rallies were scheduled to take place in the Perth CBD to mark Australia Day.The Invasion Day rally began at 12pm (3pm AEDT) in Forrest Place and protesters gathered for a March for Australia demonstration in Wellington Square at the same time.The suspended rally was eventually able to resume, where protesters marched through the streets calling for justice for First Nations peoples.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/ce176404-1761-45f9-aa03-ae63d26a0e24"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/invasion-day-rallies-australia-january-26-australia-day/106267560",
          "published_at": "Mon, 26 Jan 2026 02:14:58 +0000",
          "title": "Potential explosive device thrown into crowd at Perth Invasion Day rally, police say",
          "standfirst": "Police say they are investigating whether a device thrown into an Invasion Day rally crowd in Perth contained explosives, in addition to ball bearings and screws found inside.",
          "content": "Police say they are investigating whether a device thrown into an Invasion Day rally crowd in Perth contained explosives, in addition to ball bearings and screws found inside.",
          "feed_position": 13
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/ce176404-1761-45f9-aa03-ae63d26a0e24",
      "popularity_score": 2010.8701275
    },
    {
      "id": "cluster_53",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 07:53:13 +0000",
      "title": "Our first astronaut's moving Australian of the Year message",
      "neutral_headline": "Our first astronaut's moving Australian of the Year message",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australian-of-the-year-2026-awards-winners-named/dbe1d247-7606-47cb-a4fa-b9f0019b433c",
          "published_at": "Mon, 26 Jan 2026 07:53:13 +0000",
          "title": "Our first astronaut's moving Australian of the Year message",
          "standfirst": "Australia didn&#x27;t even have a space agency when she dreamed of going to space. It didn&#x27;t matter.",
          "content": "When Katherine Bennell-Pegg was asked at school to write down three career options, she chose just one: astronaut.Australia didn&#x27;t even have a space agency at the time but it didn&#x27;t matter. In 2024 she became the first Australian to qualify as an astronaut under Australia&#x27;s space program.Now she can add one more honour to her already impressive CV: Australian of the Year 2026.\"As a kid, I used to lie on the dry grass in my backyard and gaze up at the stars in awe,\" she said tonight.\"That imperative to look to the sky and wonder, to innovate and explore is an ancient one on this continent.\"Australia&#x27;s first nations, people&#x27;s deep connection to Sky Country reminds us that, looking up, has always been part of who we are.\"Bennell-Pegg said her childhood dream felt so far away but paid tribute to \"incredible Australians\" Dr Paul Scully-Power and Dr Andy Thomas, who went to space with another nation&#x27;s flag on their arm.\"So at the astronaut centre, when I received my blue flight suit, and right there, bright on the left shoulder was the Australian flag, it was quite emotional, because it marked something so, so much greater than myself.\"It said that the door has opened for Australia to take our place at the forefront of human endeavour, a chance to collaborate with other nations at the cutting edge of the cutting edge, showcase what we&#x27;re made of, and access the collective discoveries and benefits that all involved countries will make.\"And it gave me hope, hope that one day, more of the flags on spacesuits will follow.\"But Bennell-Pegg warned the nation was \"leaving too much talent on the launchpad\" as young people turned away from STEM subjects.\"A wonderful part of our culture, I think, is how we give it a go in sports, even if we&#x27;re the weakest on the field,\" she said.\"But when it comes to maths and science, if we&#x27;re not top of the class, or we don&#x27;t fit the stereotype, we often shy away. We&#x27;re even encouraged away.\"So if I may be allowed another dream beyond being an astronaut, it&#x27;s this that we bring that same \"give it a go\" spirit from the sports field to the STEM fields, backing each other and ourselves with the trust that we can do hard, important things. \"Imagine what more we would discover, what great problems we would solve, how our horizons would expand.\"YOUNG AUSTRALIAN OF THE YEAR Nedd Brockman was named Young Australian of the Year for 2026 after capturing the nation&#x27;s hearts and minds with an almost 4000-kilometre run across Australia on his mission to end homelessness.After the 23-year-old electrician spent 46 days running from Perth&#x27;s Cottesloe Beach to Bondi Beach in 2022, raising $2.6 million, he&#x27;s shown no signs of slowing down.Later, he ran 1000 miles (1600 kilometres) around Sydney Olympic Park, a gruelling feat he joked probably shaved about 20 years off his live.READ MORE: K&#x27;gari pack of dingoes to be euthanisedSince starting Nedd&#x27;s Uncomfortable Challenge in 2024, Brockmann and his team have raised more than $8 million for those experiencing homelessness.Admitting that he was a \"blubbering mess\", Brockmann called out singer John Farnham&#x27;s 1987 Australian of the Year acceptance speech, in which he spoke about the importance of making sure our national pride encompasses humanity.\"Ever the eternal optimist, I think I see a bit of what I hope for in those words myself,\" Brockmann said tonight.\"We should be proud of this amazing country. We are so lucky to call it home. \"But unfortunately, not everyone feels that way in a country as prosperous as Australia, why is it that 122,000 Australians sleep rough every night? \"That number should stop us all in our tracks.\"READ MORE: Fire doubles in size as state endures once in 20-year heatwave2026 SENIOR AUSTRALIAN OF THE YEAR A psychiatrist whose father&#x27;s Alzheimer&#x27;s disease diagnosis kickstarted a life dedicated to fighting dementia was recognised with the Senior Australian of the Year award.Professor Henry Brodaty AO dementia treatment research revolutionised his own field along with the lives of many people living with the disease and their families.His Centre for Healthy Brain Ageing, founded in 2012, has led internationally significant research and his Maintain Your Brain trial showed what a major difference simple preventions could make.\"Almost half the cost of dementia is caused by preventable factors that we can modify in our lifestyle,\" he said tonight.\"Now, our randomised control trial of an intensive online lifestyle coaching program had the best results yet in the world in maintaining cognition.\"We did a cost benefit analysis. The program paid for itself in reducing health costs, we designed this a decade ago. We can do better. We can do a lot better.\"Brodaty dedicated the award to all older Australians, especially those and their families affected by dementia. \"Oer four decades, we have moved from hopelessness to hope, from stigma to science and I&#x27;m proud to have been part of this transformation,\" he said.\"There is so much we can do. There&#x27;s so much we must do.\"2026 AUSTRALIAN LOCAL HERO Indigenous business owner Frank Mitchell was crowned Australia&#x27;s Local Hero in the first award of the night.The proud Whadjuk-Yued Noongar knew it was a huge opportunity when he was offered an electrical apprenticeship as a young, single father who&#x27;d been affected by suicide but wasn&#x27;t sure if he could complete it.When he started his own business in 2015, he pledged to offer the same opportunities to fellow Indigenous people.Wilco Electrical started with eight staff and $1.5 million turnover, created more than 70 Indigenous upskilling positions and awarded more than $11 million to indigenous subcontractors. His four companies now employ more than 200 full-time staff.\"I used to advocate for organisations to simply give Mob a job, but I know now opportunity alone is not enough,\" he said.\"If workplaces are not not culturally safe, Mob may survive, but they are unlikely to thrive.\"Wilco, Kardan, Baldja and Bilyaa are places where Mob are given a chance to feel safe, and it still does not always work, because people&#x27;s lives are complex, and there is no one size fits all approach, but when it does work, the impacts are powerful.\"That&#x27;s what I represent standing here before you today. And I am just one success story among many.\"READ MORE: Police respond to potential sighting of accused triple murderer2026 AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Professor Rose McGready (Thailand)Professor Rose McGready, 61, has spent three decades providing health services to displaced people in the border region between Thailand and Myanmar.Arriving as a young doctor, Rose discovered that refugees who had fled persecution in Myanmar had difficulty accessing medical assistance in Thailand. In response, Rose established training for local staff to focus on services for expectant mothers and in the critical period of childbirth. Over the past 31 years, she has built a network of locally run clinics and out-patient services which have saved thousands of lives.Rose&#x27;s research has also led to new treatments being developed to tackle maternal malaria. Her findings have been adopted by the World Health Organisation as the global standard for combatting the disease, helping to treat millions of women around the world.Rose&#x27;s commitment, compassion and clinical expertise provide life-saving aid to some of the most vulnerable communities in the world. New South Wales - Dr Alison Thompson OAM (Sutherland Shire)Dr Alison Thompson has deployed over 30,000 volunteers to the world&#x27;s worst disaster zones - bringing humanitarian assistance and medical aid to over 18 million people.It started on September 11, 2001, when as an investment banker, Alison rushed to New York&#x27;s World Trade Centre with her first aid kit. She stayed nine months, offering disaster relief arm-in-arm with ordinary, like-minded people.Galvanising grassroots momentum, Alison founded Third Wave Volunteers - a global movement of first responder volunteers who bring relief to the world&#x27;s disaster and war zones, including Ukraine, Syria, Afghanistan, and Sri Lanka. Following the 2004 tsunami, she set up the first Tsunami Early-Warning Centre and education museum, which continues to thrive.By mobilising everyday people, 61-year-old Alison is building resilience in local communities through sustainable, locally driven disaster prevention and recovery. Drawing from her upbringing as a pastor&#x27;s child, Alison believes that each person&#x27;s small skills add up to drive big changes.Northern Territory - Dr Felix Ho ASM (Darwin)Dr Felix Ho tirelessly serves remote communities in the Northern Territory as a medical practitioner. But for Felix, that&#x27;s not enough – he also volunteers thousands of his hours building the St John Youth Program and helps at public events as a St John first responder.Since joining as a St John cadet in 1995 at the age of 13, Felix has faithfully served others, including overseas as an Intensive Care Paramedic on a United Nations mission to Timor-Leste.In 2020, he took on national leadership of the youth portfolio for St John Ambulance Australia, where he&#x27;s a guiding force for over 3,000 young people, equipping the next generation of first responders. Aligned with clinical standards, Felix developed interactive, accessible and engaging training for youth and cadets across Australia.Now 43, Felix brings people together across geography and generations, to equip Australia&#x27;s youth to save lives through first aid in an emergency.Queensland - Dr Rolf Gomes (Kenmore Hills)When Dr Rolf Gomes, 52, was confronted with how differently cardiac patients were treated in rural and remote Australia, he decided to do something about it. He designed and launched the first Heart of Australia mobile &#x27;Heart Trucks&#x27; to visit remote communities.Today the Heart Trucks bring regular specialist clinics to over 30 towns in rural Australia, providing early diagnostic services that would otherwise be out of reach. Since 2014, the trucks have treated more than 20,000 patients and saved countless lives. The truck fleet will expand to 11 trucks by 2027 to provide services nationally, adding new diagnostic services for a wide range of early intervention health screenings, including for lung cancer.Rolf&#x27;s vision, ingenuity and tenacity have had a far-reaching impact on rural health and medicine in Australia, helping to save lives and ensure that rural patients have access to clinical services without having to travel long distances.South Australia - Katherine Bennell-Pegg (West Beach)Katherine Bennell-Pegg is making history as the first Australian to qualify as an astronaut under Australia&#x27;s space program, opening pathways for others to follow.Katherine graduated from Basic Astronaut Training in 2024 as part of a class of six trained by the European Astronaut Centre in Germany – the first international candidate to do so. She was initially chosen for the program from a field of over 22,500 applicants.Katherine has harboured ambitions of becoming an astronaut since she was a young child. As a space engineer, she has advanced multiple space missions and technologies.Alongside her career achievements, Katherine is an energetic champion for Australia&#x27;s space program, regularly presenting to audiences of schoolchildren and industry leaders to inspire the next generation and create new opportunities.Katherine, 41, is a genuine trailblazer in Australia&#x27;s emerging space industry. With her determination and drive to succeed, she is a powerful example for young Australians.Tasmania - Dr Jorian (Jo) Kippax (Ridgeway)Dr Jo Kippax was part of a specialist team of rescuers tasked to free a whitewater rafter who was trapped in perilous rapids on the Franklin River in 2024.Lithuanian whitewater rafter, Valdas Bieliauskas, was retrieved from freezing water by Jo and his team.The clinical team performed an operation to amputate Valdas&#x27;s leg underwater, allowing him to be freed and ultimately saving his life. Throughout the rescue, Jo was instrumental in guiding the team with professionalism, courage and remarkable calmness under pressure.For this life-saving act, the President of Lithuania, Gitanas Nausėda awarded the country&#x27;s Life Saving Cross award to Jo, which he humbly accepted on behalf of his team.The rescue of Valdas is just one chapter in Jo&#x27;s long career in emergency medicine, disaster response, and search and rescue. Demonstrating outstanding skill, courage and team leadership in the aid of others, 55-year-old Jo displays selfless dedication to saving lives in often very challenging circumstances.Victoria - Carrie Bickmore OAM (Melbourne)Carrie Bickmore is a radio and television presenter who has changed the way that brain cancer research is funded in Australia.Brain cancer kills more Australian children than any other disease, and more people aged under 40 than any other cancer – including Carrie&#x27;s late husband Greg, who passed away in 2010.Since 2015, Carrie has raised over $27 million. In 2021, she established The Brain Cancer Centre to bring together the brightest minds in research to find a cure.The Brain Cancer Centre has leveraged investment by Carrie&#x27;s Foundation to secure another $45 million of research funding. This supports research projects across the country and is delivering specific clinical trials for brain cancer patients that are the first of their kind in the world.Carrie is striving to ensure that every Australian diagnosed with brain cancer can access the best treatments and has real hope of a positive outcome.Western Australia - Dr Daniela Vecchio (Parklands)Dr Daniela Vecchio is head of mental health and addiction services at Fiona Stanley Hospital. She is the pioneer in establishing the first publicly funded gaming disorder clinic in Australia in 2022.She has seen increasing numbers of young people with addiction to video games and social media and was quick to recognise the distress and harms caused to them and their families. The clinic is unique worldwide in providing early detection and intervention in an acute hospital setting.Daniela, 57, has driven the development of holistic assessments and a wide range of personalised treatments for her clients. She has fostered extensive collaborations, including internationally with Korea, Germany and Dubai, nationally with experts in the field, and locally with health, education and police services.As a director of the Australian Gaming and Screens Alliance, she is promoting education and research into harmful online use and influencing national policy.2026 SENIOR AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Heather Reid AM (Kiels Mountain)New South Wales - Professor Henry Brodaty AO (Double Bay)Northern Territory - Jenny Duggan OAM (Katherine)Queensland - Cheryl Harris OAM (Sunshine Coast)South Australia - Malcolm Benoy (Mount Osmond)South Australia - James Currie (Carrickalinga)Tasmania - Julie Dunbabin (Taroona)Victoria - Bryan Lipmann AM (Richmond)Western Australia - Professor Kingsley Dixon AO (Waroona)2026 YOUNG AUSTRALIAN OF THE YEAR NOMINEESAustralian Capital Territory - Sita Sargeant (Canberra)New South Wales - Nedd Brockmann (Randwick)Queensland - Jarib Branfield-Bradshaw (Cunnamulla)South Australia - Chloe Wyatt-Jasper (Gawler South)Tasmania - Alyssia Kennedy (Heybridge)Victoria - Abraham Kuol (Narre Warren)Western Australia - Dr Haseeb Riaz and Gareth Shanthikumar (Peppermint Grove& City Beach)",
          "feed_position": 12,
          "image_url": "https://prod.static9.net.au/fs/b62e5af0-58b9-4dd0-92bb-65a9ee7dd11a"
        },
        {
          "source": "Canberra Times",
          "url": "https://www.canberratimes.com.au/story/9160378/astronaut-katherine-bennell-pegg-is-2026-australian-of-the-year/",
          "published_at": "Sun, 25 Jan 2026 20:47:00 +1100",
          "title": "'So much greater than myself': our first astronaut is a true blue inspiration",
          "standfirst": "2026 Australian of the Year is astronaut Katherine Bennell-Pegg.",
          "content": "2026 Australian of the Year is astronaut Katherine Bennell-Pegg.",
          "feed_position": 0,
          "image_url": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/LCCM7haWhjq8sXGapHMpfU/1fd1f9c0-427f-4549-a1a9-a3edf226f16d.jpg/r0_259_5000_3076_w600_h338_fmax.jpg"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/b62e5af0-58b9-4dd0-92bb-65a9ee7dd11a",
      "popularity_score": 2008.4931830555556
    },
    {
      "id": "cluster_57",
      "coverage": 2,
      "updated_at": "Mon, 26 Jan 2026 07:14:12 +0000",
      "title": "Temperature record shattered as historic heatwave smothers states",
      "neutral_headline": "Temperature record shattered as historic heatwave smothers states",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/weather-australians-sweat-through-blistering-longweekend-heatwave/f4b3024c-aec2-4468-b14d-6fed7cabeb5d",
          "published_at": "Mon, 26 Jan 2026 07:14:12 +0000",
          "title": "Temperature record shattered as historic heatwave smothers states",
          "standfirst": "A remote South Australian town has recorded its hottest day on record as a \"historic\" heatwave pushes temperatures near 50 degrees across several states .",
          "content": "A remote South Australian town has recorded its hottest day on record as a historic heatwave pushes temperatures near 50 degrees across several states .Effects of the ex-tropical cyclone Luna and a high-pressure system in the Tasman Sea are creating a prolonged heat mass over South Australia, Victoria, New South Wales and Queensland.The system caused temperatures to soar, Australia Day events to be cancelled in Adelaide, and a heightened bushfire threat across Victoria.READ MORE: Thousands join protests around the country on Australia Day Ceduna, a small town about 780km from Adelaide , had its hottest day on record after it reached 49.5 degrees today, beating its previous record of 48.9 degrees in December 2019.The Bureau of Meteorology&#x27;s Dean Narramore said the record-breaking temperature could nudge higher still.Wudinna Airfield recorded the hottest January day on record at 48.4 degrees, which was equal to the temperatures recorded in December 2019.The rest of the affected states reached past 45 degrees.\"Just huge areas of inland Australia, pretty much at and above 44 or 45 degrees today,\" Narramore said.He added the high temperatures were unusual for this time of year.\"That&#x27;s pretty record-breaking. It&#x27;s a very unusual, record-breaking heatwave, and in some way, historic heatwave for parts of inland and south-eastern Australia,\" he said.Several Australia Day events were cancelled in Adelaide as the mercury hit 45 degrees.READ MORE: Popular Sydney beach closed over second shark sighting The Aus Lights on the River and the evening fireworks have been cancelled because of the heat; usually about 25,000 spectators take part in the annual event.The mercury is forecast to remain above 40 degrees tomorrow, with the city of churches set to experience maximum temperatures above 30 degrees all the way until Saturday. Parts of Victoria are also set to swelter, with Melbourne reaching 44 degrees tomorrow, and parts of the state getting close to 50 degrees.Mildura in Victoria&#x27;s north-west is expected to have temperatures of 48 degrees tomorrow, which would break the town&#x27;s record of 47.2 degrees, set back in 1939.Victoria&#x27;s heat is intensifying the threat of bushfires that have been burning across the state all weekend, with fires in several areas of the state burning out of control.Residents in parts of the Otway ranges, the Dargo area and near Walwa are being told to prepare for an evacuation as fire conditions continue to be severe.READ MORE: Sydney woman charged after allegedly trying to smuggle $36 million of methBrisbane will also see hot weather this week, after a top of 36 degrees today, while Canberra will soar to 42 degrees on Wednesday. Emergency services were forced to issue an urgent reminder not to leave children, pets or older people unattended in vehicles after paramedics responded to 11 cases of children locked in hot cars across Melbourne and regional Victoria.\"The temperature inside a vehicle can double and become deadly within minutes,\" Ambulance Victoria Director of Emergency Management Dale Armstrong said.\"It is particularly dangerous for children to be left inside vehicles, as a child&#x27;s body temperature rises three to five times faster than an adult.\"\"If you are on the coast you will see a bit of relief coming through on Tuesday, but that does mean we are expecting some very hot days on the way,\" the Bureau of Meteorology&#x27;s Jonathan How said.\"Anywhere inland, unfortunately relief only comes at the end of the week, even into next weekend, so we are looking at a run of five to seven days above 40 degrees and some locations even above 45 degrees, even pushing towards 50 degrees.\"READ MORE: Sussan Ley&#x27;s right-hand man dismisses speculation of leadership spillNarramore said there will likely be more records broken this week as the hot weather system moves across to Victoria, New South Wales and then Queensland.\"We could see many locations in eastern South Australia, western and south-western Victoria break January record and a few places could also have their hottest day on record, \" he said.While Australians on the east coast prepare to sweat through the week, those in the west are dealing with the impact of a second tropical cyclone in a matter of weeks.Ex-tropical Cyclone Luana made landfall as a Category 2 system when it made landfall along the Dampier Peninsula north of Broome.Wind gusts up to 106km/h were recorded north of Broome, in Lombadina, along with more than 100 millimetres of rain since midnight on Saturday.The storm has since weakened to a tropical low, but could still bring falls of up to 200mm in parts of WA.Residents along the Kimberley coast should expect heavy rainfall and damaging winds over the long weekend, which is only expected to ease from Tuesday.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 5,
          "image_url": "https://prod.static9.net.au/fs/297cd8e9-02d2-48f7-9f34-ae9435e4db63"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/south-east-australia-weather-hit-close-to-50c-worst-heatwave/106270302",
          "published_at": "Mon, 26 Jan 2026 06:56:27 +0000",
          "title": "'Heat dome' to shatter records as south-east soars to nearly 50C",
          "standfirst": "A record heatwave across south-east Australia will peak during the coming days, leading to extreme fire danger and temperatures close to 50 degrees Celsius in multiple states.",
          "content": "A record heatwave across south-east Australia will peak during the coming days, leading to extreme fire danger and temperatures close to 50 degrees Celsius in multiple states.",
          "feed_position": 21
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/297cd8e9-02d2-48f7-9f34-ae9435e4db63",
      "popularity_score": 2007.8429052777778
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 19:17:43 +0000",
      "title": "Quiz: How well do you know your way around the world?",
      "neutral_headline": "Quiz: How well do you know your way around the world",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-27/travel-quiz/106251022",
          "published_at": "Mon, 26 Jan 2026 19:17:43 +0000",
          "title": "Quiz: How well do you know your way around the world?",
          "standfirst": "Which food is thrown in the re-enactment of a medieval food fight? And which airport is the world's busiest?",
          "content": "Which food is thrown in the re-enactment of a medieval food fight? And which airport is the world's busiest?",
          "feed_position": 0
        }
      ],
      "popularity_score": 352.90151638888887
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 19:13:55 +0000",
      "title": "Five quick hits: An Italian tantrum, masterful Musetti and a tennis ball straight to the face",
      "neutral_headline": "Five quick hits: An Italian tantrum, masterful Musetti and a tennis...",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-27/australian-open-day-nine-quick-hits/106269988",
          "published_at": "Mon, 26 Jan 2026 19:13:55 +0000",
          "title": "Five quick hits: An Italian tantrum, masterful Musetti and a tennis ball straight to the face",
          "standfirst": "Sabalenka and Alcaraz denied fitness tracking devices, Darderi has a tantrum and Siegemund cops a tennis ball to the face. Here are the quick hits from the Australian Open.",
          "content": "Sabalenka and Alcaraz denied fitness tracking devices, Darderi has a tantrum and Siegemund cops a tennis ball to the face. Here are the quick hits from the Australian Open.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.83818305555553
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 14:11:52 +0000",
      "title": "Trump sends 'border czar' to Minnesota after shooting of nurse Alex Pretti",
      "neutral_headline": "Trump sends 'border czar' to Minnesota after shooting of nurse Alex Pretti",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/republicans-express-shock-over-minneapolis-shooting/106271792",
          "published_at": "Mon, 26 Jan 2026 14:11:52 +0000",
          "title": "Trump sends 'border czar' to Minnesota after shooting of nurse Alex Pretti",
          "standfirst": "An American citizen, Alex Pretti, was shot by federal agents during a continuing Trump administration immigration crackdown in the city.",
          "content": "An American citizen, Alex Pretti, was shot by federal agents during a continuing Trump administration immigration crackdown in the city.",
          "feed_position": 1
        }
      ],
      "popularity_score": 337.8040163888889
    },
    {
      "id": "cluster_3",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 19:09:59 +0000",
      "title": "Strong winds put SA on fire alert as heatwave continues",
      "neutral_headline": "Strong winds put SA on fire alert as heatwave continues",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-27/extreme-fire-danger-as-heatwave-persists-in-sa/106270164",
          "published_at": "Mon, 26 Jan 2026 19:09:59 +0000",
          "title": "Strong winds put SA on fire alert as heatwave continues",
          "standfirst": "Authorities are urging South Australians to be vigilant and \"make good choices\" as \"extreme\" fire danger is forecast for the southern half of the state.",
          "content": "Authorities are urging South Australians to be vigilant and \"make good choices\" as \"extreme\" fire danger is forecast for the southern half of the state.",
          "feed_position": 2
        }
      ],
      "popularity_score": 332.7726275
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 14:04:54 +0000",
      "title": "Remains of last Israeli hostage in Gaza found, Netanyahu confirms",
      "neutral_headline": "Remains of last Israeli hostage in Gaza found, Netanyahu confirms",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/remains-of-last-israeli-hostage-in-gaza-ran-gvili-found/106271998",
          "published_at": "Mon, 26 Jan 2026 14:04:54 +0000",
          "title": "Remains of last Israeli hostage in Gaza found, Netanyahu confirms",
          "standfirst": "Israeli Prime Minister Benjamin Netanyahu confirmed that the remains of 24-year-old Ran Gvili had been found and identified.",
          "content": "Israeli Prime Minister Benjamin Netanyahu confirmed that the remains of 24-year-old Ran Gvili had been found and identified.",
          "feed_position": 2
        }
      ],
      "popularity_score": 327.68790527777776
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:57:54 +0000",
      "title": "China's aging population is saving its way towards economic stagnation",
      "neutral_headline": "China's aging population is saving its way towards economic stagnation",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/chinas-aging-population-is-saving-towards-economic-stagnation/106270300",
          "published_at": "Mon, 26 Jan 2026 18:57:54 +0000",
          "title": "China's aging population is saving its way towards economic stagnation",
          "standfirst": "Unlike many Western economies, Chinese households stash away more than 40 per cent of their income. But the pressure to boost local consumption is mounting for Beijing.",
          "content": "Unlike many Western economies, Chinese households stash away more than 40 per cent of their income. But the pressure to boost local consumption is mounting for Beijing.",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.5712386111111
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:55:09 +0000",
      "title": "Alcaraz 'suffocates' rivals, but de Minaur feels he has room to breathe",
      "neutral_headline": "Alcaraz 'suffocates' rivals, but de Minaur feels he has room to breathe",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/australian-open-alex-de-minaur-carlos-alcaraz-quarterfinal/106269964",
          "published_at": "Mon, 26 Jan 2026 18:55:09 +0000",
          "title": "Alcaraz 'suffocates' rivals, but de Minaur feels he has room to breathe",
          "standfirst": "World number one Carlos Alcaraz has defeated Alex de Minaur each time they have played, but the Australian is not overawed ahead of their quarterfinal clash.",
          "content": "World number one Carlos Alcaraz has defeated Alex de Minaur each time they have played, but the Australian is not overawed ahead of their quarterfinal clash.",
          "feed_position": 4
        }
      ],
      "popularity_score": 312.5254052777778
    },
    {
      "id": "cluster_13",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:45:34 +0000",
      "title": "How hot is it? Track heatwave temperatures live",
      "neutral_headline": "How hot is it? Track heatwave temperatures live",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/temperatures-heatwave-tracker-live/106270976",
          "published_at": "Mon, 26 Jan 2026 18:45:34 +0000",
          "title": "How hot is it? Track heatwave temperatures live",
          "standfirst": "Use our tracker to keep an eye on temperatures as a heatwave moves across much of the country.",
          "content": "Use our tracker to keep an eye on temperatures as a heatwave moves across much of the country.",
          "feed_position": 5
        }
      ],
      "popularity_score": 309.36568305555556
    },
    {
      "id": "cluster_11",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:47:16 +0000",
      "title": "Tiny country town could be one of the hottest places on Earth today",
      "neutral_headline": "Tiny country town could be one of the hottest places on Earth today",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-27/record-temperatures-in-ouyen-as-victorian-heatwave-continues/106268770",
          "published_at": "Mon, 26 Jan 2026 18:47:16 +0000",
          "title": "Tiny country town could be one of the hottest places on Earth today",
          "standfirst": "The mercury in Ouyen, in Victoria's north-west, is tipped to hit 49C amid what could be a record-breaking heatwave in the state.",
          "content": "The mercury in Ouyen, in Victoria's north-west, is tipped to hit 49C amid what could be a record-breaking heatwave in the state.",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.3940163888889
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 17:02:08 +0000",
      "title": "Private jet crashes as major winter storm kills 13 across US",
      "neutral_headline": "Private jet crashes as major winter storm kills 13 across US",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/deaths-reported-as-winter-storm-barrels-across-us/106271804",
          "published_at": "Mon, 26 Jan 2026 17:02:08 +0000",
          "title": "Private jet crashes as major winter storm kills 13 across US",
          "standfirst": "Almost 200 million Americans are under cold weather alerts as snow, sleet and freezing rain affects swathes of the country from Texas to New England, with temperatures set to fall dangerously low this week.",
          "content": "Almost 200 million Americans are under cold weather alerts as snow, sleet and freezing rain affects swathes of the country from Texas to New England, with temperatures set to fall dangerously low this week.",
          "feed_position": 6
        }
      ],
      "popularity_score": 290.64179416666667
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 17:10:53 +0000",
      "title": "Russia, Ukraine and US plan further trilateral talks on ending war",
      "neutral_headline": "Russia, Ukraine and US plan further trilateral talks on ending war",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/major-challenges-ukraine-russia-kremlin/106272110",
          "published_at": "Mon, 26 Jan 2026 17:10:53 +0000",
          "title": "Russia, Ukraine and US plan further trilateral talks on ending war",
          "standfirst": "Volodymyr Zelenskyy said discussions between envoys from Ukraine, Russia and the US in Abu Dhabi last week aimed at ending Moscow's invasion left some political issues unresolved.",
          "content": "Volodymyr Zelenskyy said discussions between envoys from Ukraine, Russia and the US in Abu Dhabi last week aimed at ending Moscow's invasion left some political issues unresolved.",
          "feed_position": 7
        }
      ],
      "popularity_score": 280.7876275
    },
    {
      "id": "cluster_10",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:52:00 +0000",
      "title": "How a purge at the top of China's military could impact Taiwan",
      "neutral_headline": "How a purge at the top of China's military could impact Taiwan",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/what-does-chinas-military-investigation-into-zhang-youxia-mean/106272224",
          "published_at": "Mon, 26 Jan 2026 18:52:00 +0000",
          "title": "How a purge at the top of China's military could impact Taiwan",
          "standfirst": "Another two senior generals are under investigation for alleged corruption in China and that has big consequences for President Xi Jinping.",
          "content": "Another two senior generals are under investigation for alleged corruption in China and that has big consequences for President Xi Jinping.",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.4729052777778
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:23:40 +0000",
      "title": "'Ticket' policy for pokies introduces money-laundering risk, expert warns",
      "neutral_headline": "'Ticket' policy for pokies introduces money-laundering risk, expert warns",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-27/money-laundering-risk-in-tasmania-pokies-policy/106268878",
          "published_at": "Mon, 26 Jan 2026 18:23:40 +0000",
          "title": "'Ticket' policy for pokies introduces money-laundering risk, expert warns",
          "standfirst": "Tasmania is looking to introduce a 'ticket-in, ticket-out' pokies system. But experiences in New South Wales show the proposal carries money-laundering risks, an expert says.",
          "content": "Tasmania is looking to introduce a 'ticket-in, ticket-out' pokies system. But experiences in New South Wales show the proposal carries money-laundering risks, an expert says.",
          "feed_position": 9
        }
      ],
      "popularity_score": 262.00068305555556
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 00:30:01 +0000",
      "title": "Paying 'money just to breathe' in one the world's most polluted cities",
      "neutral_headline": "Paying 'money just to breathe' in one the world's most polluted cities",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/delhi-india-air-pollution-residents-struggle-breathing/106085882",
          "published_at": "Mon, 26 Jan 2026 00:30:01 +0000",
          "title": "Paying 'money just to breathe' in one the world's most polluted cities",
          "standfirst": "Poor air quality in Delhi has impacted nearly all aspects of life with residents saying they have lost many of the \"simple joys\" such as opening a window or going for a walk outside.",
          "content": "Poor air quality in Delhi has impacted nearly all aspects of life with residents saying they have lost many of the \"simple joys\" such as opening a window or going for a walk outside.",
          "feed_position": 9
        }
      ],
      "popularity_score": 244.10651638888888
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:22:46 +0000",
      "title": "Extreme bushfire conditions to hit Victoria as communities evacuated",
      "neutral_headline": "Extreme bushfire conditions to hit Victoria as communities evacuated",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-27/victoria-bushfires-otways-heatwave-soaring-temperatures/106270362",
          "published_at": "Mon, 26 Jan 2026 18:22:46 +0000",
          "title": "Extreme bushfire conditions to hit Victoria as communities evacuated",
          "standfirst": "Authorities are urging residents in Victoria's Otways to remain on alert with temperatures above 40C and extreme fire danger conditions set to fan bushfires on Tuesday.",
          "content": "Authorities are urging residents in Victoria's Otways to remain on alert with temperatures above 40C and extreme fire danger conditions set to fan bushfires on Tuesday.",
          "feed_position": 10
        }
      ],
      "popularity_score": 159.98568305555557
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:30:00 +0000",
      "title": "Tips for getting your finances in order in 2026",
      "neutral_headline": "Tips for getting your finances in order in 2026",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/how-to-set-new-year-financial-habits/106125752",
          "published_at": "Mon, 26 Jan 2026 18:30:00 +0000",
          "title": "Tips for getting your finances in order in 2026",
          "standfirst": "It might be time to devote some of your energy and good intentions towards your finances.",
          "content": "It might be time to devote some of your energy and good intentions towards your finances.",
          "feed_position": 16
        }
      ],
      "popularity_score": 149.1062386111111
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 14:24:48 +0000",
      "title": "Elite marines among 42 people missing in Indonesian landslide",
      "neutral_headline": "Elite marines among 42 people missing in Indonesian landslide",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-27/west-java-landslide-buries-indonesian-marines/106271942",
          "published_at": "Mon, 26 Jan 2026 14:24:48 +0000",
          "title": "Elite marines among 42 people missing in Indonesian landslide",
          "standfirst": "The search is ongoing for survivors after the pre-dawn landslide on the slopes of Mount Burangrang in West Java province killed at least two dozen people at the weekend.",
          "content": "The search is ongoing for survivors after the pre-dawn landslide on the slopes of Mount Burangrang in West Java province killed at least two dozen people at the weekend.",
          "feed_position": 14
        }
      ],
      "popularity_score": 148.01957194444444
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 10:53:01 +0000",
      "title": "Police investigating man's death in custody in Kalgoorlie",
      "neutral_headline": "Police investigating man's death in custody in Kalgoorlie",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/south-kalgoorlie-death-in-custody-police-investigation/106271730",
          "published_at": "Mon, 26 Jan 2026 10:53:01 +0000",
          "title": "Police investigating man's death in custody in Kalgoorlie",
          "standfirst": "A 43-year-old man has died after an incident involving WA Police officers in South Kalgoorlie.",
          "content": "A 43-year-old man has died after an incident involving WA Police officers in South Kalgoorlie.",
          "feed_position": 18
        }
      ],
      "popularity_score": 144.48984972222223
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 11:41:19 +0000",
      "title": "Armed attackers kill 11 at soccer field in Mexico",
      "neutral_headline": "Armed attackers kill 11 at soccer field in Mexico",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/mexico-shooting-soccer-field-salamanca/106271736",
          "published_at": "Mon, 26 Jan 2026 11:41:19 +0000",
          "title": "Armed attackers kill 11 at soccer field in Mexico",
          "standfirst": "Authorities say gunmen opened fire in the city of Salamanca, killing at least 11 people and wounding 12 at the end of a soccer match.",
          "content": "Authorities say gunmen opened fire in the city of Salamanca, killing at least 11 people and wounding 12 at the end of a soccer match.",
          "feed_position": 17
        }
      ],
      "popularity_score": 142.2948497222222
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 08:11:45 +0000",
      "title": "Travellers stranded on Nullarbor as fire shuts Eyre Highway",
      "neutral_headline": "Travellers stranded on Nullarbor as fire shuts Eyre Highway",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/eyre-highway-closed-bushfire-travellers-stranded/106270912",
          "published_at": "Mon, 26 Jan 2026 08:11:45 +0000",
          "title": "Travellers stranded on Nullarbor as fire shuts Eyre Highway",
          "standfirst": "A fire near Caiguna has blocked the major road link between Western Australia and the east coast.",
          "content": "A fire near Caiguna has blocked the major road link between Western Australia and the east coast.",
          "feed_position": 19
        }
      ],
      "popularity_score": 141.80207194444444
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 07:09:05 +0000",
      "title": "Human remains found near Charters Towers belong to Jayden Penno-Tompsett",
      "neutral_headline": "Human remains found near Charters Towers belong to Jayden Penno-Tompsett",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/jayden-penno-tompsett-remains-confirmed-north-queensland/105919904",
          "published_at": "Mon, 26 Jan 2026 07:09:05 +0000",
          "title": "Human remains found near Charters Towers belong to Jayden Penno-Tompsett",
          "standfirst": "Human remains found in north Queensland belong to a missing New South Wales man last seen eight years ago, according to police.",
          "content": "Human remains found in north Queensland belong to a missing New South Wales man last seen eight years ago, according to police.",
          "feed_position": 22
        }
      ],
      "popularity_score": 140.7576275
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 06:19:54 +0000",
      "title": "Call for memorial to Beaumont children, 60 years after they vanished",
      "neutral_headline": "Call for memorial to Beaumont children, 60 years after they vanished",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-26/beaumont-children-missing-60-years-today-memorial/106269224",
          "published_at": "Mon, 26 Jan 2026 06:19:54 +0000",
          "title": "Call for memorial to Beaumont children, 60 years after they vanished",
          "standfirst": "Politician Frank Pangallo is calling for a permanent memorial to be installed at an Adelaide beach to acknowledge the disappearance of the Beaumont children in 1966.",
          "content": "Politician Frank Pangallo is calling for a permanent memorial to be installed at an Adelaide beach to acknowledge the disappearance of the Beaumont children in 1966.",
          "feed_position": 23
        }
      ],
      "popularity_score": 139.9379052777778
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 06:07:49 +0000",
      "title": "Five quick and easy burger recipes for stress-free summer dinners",
      "neutral_headline": "Five quick and easy burger recipes for stress-free summer dinners",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/quick-and-easy-burger-recipes-for-stress-free-summer-dinners/106136826",
          "published_at": "Mon, 26 Jan 2026 06:07:49 +0000",
          "title": "Five quick and easy burger recipes for stress-free summer dinners",
          "standfirst": "From chargrilled beef patties and beer-battered fish to vegetarian parmigiana and cheeseburger tray bake, we have burgers to suit all tastes and diets.",
          "content": "From chargrilled beef patties and beer-battered fish to vegetarian parmigiana and cheeseburger tray bake, we have burgers to suit all tastes and diets.",
          "feed_position": 20
        }
      ],
      "popularity_score": 139.7365163888889
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 05:18:44 +0000",
      "title": "Traditional owners heartbroken by dingo cull after Piper James's death",
      "neutral_headline": "Traditional owners heartbroken by dingo cull after Piper James's death",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/traditional-owners-heartbroken-at-decision-to-cull-kgari-dingoes/106269824",
          "published_at": "Mon, 26 Jan 2026 05:18:44 +0000",
          "title": "Traditional owners heartbroken by dingo cull after Piper James's death",
          "standfirst": "The Queensland government euthanises six dingoes involved in Piper James's death on K'gari, and is expected to cull more in the coming days.",
          "content": "The Queensland government euthanises six dingoes involved in Piper James's death on K'gari, and is expected to cull more in the coming days.",
          "feed_position": 12
        }
      ],
      "popularity_score": 138.91846083333334
    },
    {
      "id": "cluster_65",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 04:22:42 +0000",
      "title": "The 150 Indigenous kids who made a movie without Hollywood's permission",
      "neutral_headline": "The 150 Indigenous kids who made a movie without Hollywood's permission",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/imagine-movie-jack-manning-bancroft-aime-indigenous-mentoring/106256658",
          "published_at": "Mon, 26 Jan 2026 04:22:42 +0000",
          "title": "The 150 Indigenous kids who made a movie without Hollywood's permission",
          "standfirst": "The beautifully animated, crowdsourced movie Imagine introduces a wealth of Indigenous knowledge to audiences in the funniest way possible and hopes to generate real change.",
          "content": "The beautifully animated, crowdsourced movie Imagine introduces a wealth of Indigenous knowledge to audiences in the funniest way possible and hopes to generate real change.",
          "feed_position": 23
        }
      ],
      "popularity_score": 137.98457194444444
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:56:01 +0000",
      "title": "Gold's record run rolls on as prices surge past $US5,000",
      "neutral_headline": "Gold's record run rolls on as prices surge past $US5,000",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/gold-record-run-continues-price-surges-past-us-5000/106269850",
          "published_at": "Mon, 26 Jan 2026 02:56:01 +0000",
          "title": "Gold's record run rolls on as prices surge past $US5,000",
          "standfirst": "Gold surges to a record high above $US5,000 an ounce, extending a historic rally as investors pile into the safe-haven asset amid rising geopolitical tensions.",
          "content": "Gold surges to a record high above $US5,000 an ounce, extending a historic rally as investors pile into the safe-haven asset amid rising geopolitical tensions.",
          "feed_position": 17
        }
      ],
      "popularity_score": 136.53984972222221
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 02:14:53 +0000",
      "title": "The collateral damage from Trump's quest to deport immigrants",
      "neutral_headline": "The collateral damage from Trump's quest to deport immigrants",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/us-citizens-collateral-damage-in-trump-s-immigration-crackdown/106269166",
          "published_at": "Mon, 26 Jan 2026 02:14:53 +0000",
          "title": "The collateral damage from Trump's quest to deport immigrants",
          "standfirst": "Minneapolis has become the flashpoint of an aggressive immigration enforcement operation ordered by the Trump administration and pitched as a campaign against undocumented criminals.",
          "content": "Minneapolis has become the flashpoint of an aggressive immigration enforcement operation ordered by the Trump administration and pitched as a campaign against undocumented criminals.",
          "feed_position": 15
        }
      ],
      "popularity_score": 135.85429416666668
    },
    {
      "id": "cluster_76",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 23:49:09 +0000",
      "title": "All top six seeds make quarterfinals for first time in the Open Era",
      "neutral_headline": "All top six seeds make quarterfinals for first time in the Open Era",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/australian-open-2026-live-jannik-sinner-maddison-inglis-swiatek/106268840",
          "published_at": "Sun, 25 Jan 2026 23:49:09 +0000",
          "title": "All top six seeds make quarterfinals for first time in the Open Era",
          "standfirst": "The 2026 Australian Open will be the first grand slam that all top six seeds in the men's and women's singles have reached the quarterfinals in the Open Era.",
          "content": "The 2026 Australian Open will be the first grand slam that all top six seeds in the men's and women's singles have reached the quarterfinals in the Open Era.",
          "feed_position": 10
        }
      ],
      "popularity_score": 133.42540527777777
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 22:27:52 +0000",
      "title": "'Gentle and kind': Tributes flow for Lake Cargelligo shooting victims",
      "neutral_headline": "'Gentle and kind': Tributes flow for Lake Cargelligo shooting victims",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/lake-cargelligo-manhunt-police-mount-hope-nsw/106268762",
          "published_at": "Sun, 25 Jan 2026 22:27:52 +0000",
          "title": "'Gentle and kind': Tributes flow for Lake Cargelligo shooting victims",
          "standfirst": "A pregnant woman who was one of three people shot dead in a suspected domestic violence attack in a remote NSW town has been remembered as a gentle and kind person.",
          "content": "A pregnant woman who was one of three people shot dead in a suspected domestic violence attack in a remote NSW town has been remembered as a gentle and kind person.",
          "feed_position": 19
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 21:51:04 +0000",
      "title": "Bystander videos show violent takedown before fatal shooting in Minneapolis",
      "neutral_headline": "Bystander videos show violent takedown before fatal shooting in Minneapolis",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/minneapolis-videos-shooting-alex-pretti/106268710",
          "published_at": "Sun, 25 Jan 2026 21:51:04 +0000",
          "title": "Bystander videos show violent takedown before fatal shooting in Minneapolis",
          "standfirst": "Multiple videos have emerged of nurse Alex Pretti before he was shot dead by federal agents in Minneapolis. The videos appear to contradict statements by the Trump administration, which said the shots were fired \"defensively\" against Mr Pretti as he \"approached\" authorities with a gun. In bystander videos, Mr Pretti is seen with only a phone in his hand, before US federal agents use pepper spray and wrestle him to the ground before opening fire.",
          "content": "Multiple videos have emerged of nurse Alex Pretti before he was shot dead by federal agents in Minneapolis. The videos appear to contradict statements by the Trump administration, which said the shots were fired \"defensively\" against Mr Pretti as he \"approached\" authorities with a gun. In bystander videos, Mr Pretti is seen with only a phone in his hand, before US federal agents use pepper spray and wrestle him to the ground before opening fire.",
          "feed_position": 21
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 19:32:54 +0000",
      "title": "Rental deemed 'not habitable' by tribunal still being leased out",
      "neutral_headline": "Rental deemed 'not habitable' by tribunal still being leased out",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/sharesorted-homes-up-for-rent-despite-not-habitable-ncat-ruling/106135310",
          "published_at": "Sun, 25 Jan 2026 19:32:54 +0000",
          "title": "Rental deemed 'not habitable' by tribunal still being leased out",
          "standfirst": "Furnished accommodation company ShareSorted was found in breach of its obligations related to at least two properties, but a lack of regulation allows them to continue to operate.",
          "content": "Furnished accommodation company ShareSorted was found in breach of its obligations related to at least two properties, but a lack of regulation allows them to continue to operate.",
          "feed_position": 18
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:38:07 +0000",
      "title": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
      "neutral_headline": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/moderate-liberals-rock-solid-ley-leadership-challenge/106267314",
          "published_at": "Sun, 25 Jan 2026 18:38:07 +0000",
          "title": "Moderate Liberals 'rock solid' behind Sussan Ley amid leadership whispers",
          "standfirst": "While conservatives Angus Taylor and Andrew Hastie canvass support to challenge for the Liberal leadership, moderates say there is no mood for turning on Sussan Ley — meaning a spill would likely result in another divided vote.",
          "content": "While conservatives Angus Taylor and Andrew Hastie canvass support to challenge for the Liberal leadership, moderates say there is no mood for turning on Sussan Ley — meaning a spill would likely result in another divided vote.",
          "feed_position": 11
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 18:30:00 +0000",
      "title": "How to know if you're 'stuck' on unhealthy life goals",
      "neutral_headline": "How to know if you're 'stuck' on unhealthy life goals",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-26/new-year-resolutions-goals/106205930",
          "published_at": "Sun, 25 Jan 2026 18:30:00 +0000",
          "title": "How to know if you're 'stuck' on unhealthy life goals",
          "standfirst": "Experts say knowing when to abandon or change your goals may be just as important as persistence.",
          "content": "Experts say knowing when to abandon or change your goals may be just as important as persistence.",
          "feed_position": 24
        }
      ],
      "popularity_score": 133
    }
  ]
}