{
  "updated_at": "2025-12-28T19:16:16.533Z",
  "clusters": [
    {
      "id": "cluster_41",
      "coverage": 3,
      "updated_at": "Sun, 28 Dec 2025 08:21:11 +0000",
      "title": "Father charged after allegedly showing Nazi tattoos on Newcastle beach",
      "neutral_headline": "Father charged after allegedly showing Nazi tattoos on Newcastle beach",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/nazi-tattoos-father-arrested-newcastle-coffs-harbour/9750d12c-92a4-4219-b6f8-5d5d48168c90",
          "published_at": "Sun, 28 Dec 2025 08:21:11 +0000",
          "title": "Father charged after allegedly showing Nazi tattoos on Newcastle beach",
          "standfirst": "A beachgoer noticed the alleged hate symbols on the back of the 36-year-old&#x27;s legs and sent photos to police.",
          "content": "A 36-year-old man will front court next month after allegedly displaying Nazi tattoos on a beach in Newcastle.Andrew Lorant was on a family trip to Bar Beach on Christmas Eve, when a beachgoer noticed tattoos on his legs that were allegedly hate symbols.He had two tattoos on the back of his legs that allegedly depicted SS bolts, a Nazi symbol, and the words \"white power\".READ MORE: PM promotes plan to &#x27;unite community&#x27; after Bondi Beach attackUnder NSW law, it is a criminal offence to publicly display a Nazi symbol.The beachgoer who took the photos shared them on social media and also reported them to police.About 6.30pm yesterday, Lorant was arrested at his home in Urunga, south of Coffs HarbourHe was taken to Coffs Harbour Police Station where he was charged with knowingly display by public act Nazi symbol without excuse and cause prohibited Nazi symbol to be displayed in public place.He could face up to 12 months imprisonment as well as a fine of $11,000.READ MORE: Police to carry guns &#x27;you haven&#x27;t seen before&#x27; at Sydney NYE celebrationsPremier Chris Minns condemned the symbols allegedly depicted.\"There&#x27;s no place for it. People who are propagating that or are responsible for tattooing it, they should be ashamed of themselves,\" he said.\"We&#x27;re going to do everything we can to stamp out hate in our community.\"Lorant was granted strict bail to appear at Newcastle Local Court on January 22.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/216b8ab9-2f14-4838-b33f-a226fe8822fd"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/dec/28/man-charged-with-displaying-nazi-hate-symbol-after-showing-off-tattoos-at-nsw-beach-ntwnfb",
          "published_at": "Sun, 28 Dec 2025 00:36:28 GMT",
          "title": "Man charged with displaying Nazi hate symbol after showing off tattoos at NSW beach",
          "standfirst": "Man spotted at beach in Newcastle on Wednesday with tattoos linked to white supremacist ideologyGet our breaking news email, free app or daily news podcastA man who allegedly displayed Nazi hate symbols by showing off his tattoos at a popular beach in New South Wales has been charged.Ben Parsons was at Bar beach in Newcastle on 24 December with his children, when he noticed a man with tattoos linked to white supremacist ideology, including symbols associated with the Nazi SS. Continue reading...",
          "content": "Man spotted at beach in Newcastle on Wednesday with tattoos linked to white supremacist ideologyGet our breaking news email, free app or daily news podcastA man who allegedly displayed Nazi hate symbols by showing off his tattoos at a popular beach in New South Wales has been charged.Ben Parsons was at Bar beach in Newcastle on 24 December with his children, when he noticed a man with tattoos linked to white supremacist ideology, including symbols associated with the Nazi SS. Continue reading...",
          "feed_position": 5
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/man-charged-for-allegedly-displaying-antisemitic-tattoos/106182526",
          "published_at": "Sun, 28 Dec 2025 00:13:12 +0000",
          "title": "Man charged for allegedly displaying hate symbol tattoos at NSW beach",
          "standfirst": "A man has been charged for allegedly displaying what police have called \"hate symbol\" tattoos at a beach in Newcastle.",
          "content": "A man has been charged for allegedly displaying what police have called \"hate symbol\" tattoos at a beach in Newcastle.",
          "feed_position": 23
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/216b8ab9-2f14-4838-b33f-a226fe8822fd",
      "popularity_score": 3009.081796388889
    },
    {
      "id": "cluster_46",
      "coverage": 3,
      "updated_at": "Sun, 28 Dec 2025 05:31:47 GMT",
      "title": "Australian cruise ship investigated after leaving passenger behind runs aground off PNG with 120 people on board",
      "neutral_headline": "Australian cruise ship runs aground off PNG",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/world/2025/dec/28/australian-cruise-ship-investigated-after-leaving-passenger-behind-runs-aground-off-png-with-120-people-on-board",
          "published_at": "Sun, 28 Dec 2025 05:31:47 GMT",
          "title": "Australian cruise ship investigated after leaving passenger behind runs aground off PNG with 120 people on board",
          "standfirst": "Coral Adventurer says passengers and crew are safe while team tries to refloat ship and inspects the hullGet our breaking news email, free app or daily news podcastAn Australian cruise ship being investigated after allegedly leaving behind a passenger who died alone has run aground off the coast of Papua New Guinea with more than 120 people aboard.The Coral Adventurer ran aground early on Saturday morning, about 30km from PNG’s second-largest city, Lae. The vessel’s operator, Coral Expeditions, said no one was hurt in the incident. Continue reading...",
          "content": "Coral Adventurer says passengers and crew are safe while team tries to refloat ship and inspects the hullGet our breaking news email, free app or daily news podcastAn Australian cruise ship being investigated after allegedly leaving behind a passenger who died alone has run aground off the coast of Papua New Guinea with more than 120 people aboard.The Coral Adventurer ran aground early on Saturday morning, about 30km from PNG’s second-largest city, Lae. The vessel’s operator, Coral Expeditions, said no one was hurt in the incident. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/cruise-ship-coral-adventurer-runs-aground-off-papua-new-guinea/106182788",
          "published_at": "Sun, 28 Dec 2025 03:18:24 +0000",
          "title": "Australian cruise ship runs aground off PNG",
          "standfirst": "The Coral Adventurer has run aground off the coast of Papua New Guinea with more than 120 people aboard, two months after the death of a passenger allegedly left behind on a Great Barrier Reef island.",
          "content": "The Coral Adventurer has run aground off the coast of Papua New Guinea with more than 120 people aboard, two months after the death of a passenger allegedly left behind on a Great Barrier Reef island.",
          "feed_position": 7
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/coral-adventurer-cruise-ship-hits-coral-reef-two-months-after-passenger-died-left-behind-lizard-island/a6be1a50-1555-4823-9a69-634f879b67b7",
          "published_at": "Sat, 27 Dec 2025 20:53:34 +0000",
          "title": "Cruise ship runs aground on first trip since passenger's death",
          "standfirst": "The Coral Adventurer ran into trouble during its first trip back at sea, two months after the death of an 80-year-old passenger on Lizard Island.",
          "content": "An embattled Cairns-based cruise ship has run aground while sailing around the South Pacific. The vessel ran into trouble on Saturday morning, during its first trip back at sea after the death of an 80-year-old passenger on Lizard Island in October.Australian-flagged vessel, the Coral Adventurer, hit a coral reef and ran aground off the Papua New Guinea coast, stuck around 30 kilometres from the city of Lae. READ MORE: Body found inside a car on the Gold Coast Crew alerted relevant authorities around 6am. 9News understands there are 123 people on board the luxury cruise ship, including 80 passengers and 43 crew. The Australian Maritime Safety Authority (AMSA) said in a statement \"there are no injuries among the passengers and crew onboard\". The PNG Maritime Rescue Coordination Centre also confirmed an officer has boarded the vessel and is assisting with the incident.READ MORE: Further delays expected to remove snapped crane hovering over caravan park Crews were waiting for high tide to help re-float the ship, to assess if there&#x27;s any damage.It&#x27;s been troubled waters for the luxury cruise ship that&#x27;s already navigated a turbulent two months after it made headlines in October.Suzanne Rees, an 80-year-old New South Wales tourist, was found dead on remote Lizard Island several hours after being left behind by the Coral Adventurer.The tragedy ultimately sparked several investigations, including by the AMSA and Workplace Health and Safety Queensland, which remains ongoing. This latest 12-night cruise, which costs $13,280 per person, departed from Cairns on December 18, reaching Papua New Guinea last Saturday on December 20. It&#x27;s then been cruising up the coastline over the past week before this latest bungle happened on December 27. Passengers were due to disembark on December 30. Coral Expeditions responded on Saturday evening, saying an initial inspection has found no damage to the vessel and further investigations will be undertaken. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 11,
          "image_url": "https://prod.static9.net.au/fs/c22070db-5fca-4262-aeaa-f4825a1e0ef7"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/c22070db-5fca-4262-aeaa-f4825a1e0ef7",
      "popularity_score": 3006.2584630555557
    },
    {
      "id": "cluster_16",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 05:20:37 +1100",
      "title": "Trump meets with Zelensky, reports ‘very productive call’ with Putin",
      "neutral_headline": "Trump meets with Zelensky, reports ‘very productive call’ with Putin",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/north-america/watch-trump-meets-with-zelensky-us-president-reports-very-productive-call-with-putin-20251229-p5nqfa.html",
          "published_at": "Mon, 29 Dec 2025 05:20:37 +1100",
          "title": "Trump meets with Zelensky, reports ‘very productive call’ with Putin",
          "standfirst": "The US president is meeting with Volodymyr Zelensky to try to close out a peace agreement that would end nearly four years of war sparked by Moscow’s invasion of Ukraine.",
          "content": "The US president is meeting with Volodymyr Zelensky to try to close out a peace agreement that would end nearly four years of war sparked by Moscow’s invasion of Ukraine.",
          "feed_position": 5,
          "image_url": "https://static.ffx.io/images/$zoom_1.0342%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_22/t_crop_custom/q_86%2Cf_auto/f5272be1acb667670fdfdaaf06688be2de81d6166b0b288765fc5f8193446ba3"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/russia-ukraine-conflict-updates-volodymyr-zelenskyy-donald-trump-florida-meeting-peace-talks/0ee3f044-fe6a-40dc-863a-37201408b5bb",
          "published_at": "Sun, 28 Dec 2025 13:48:11 +0000",
          "title": "Zelenskyy and Trump to meet in Florida after weeks of intensive peace talks",
          "standfirst": "A meeting between Ukrainian President Volodymyr Zelenskyy and US President Donald Trump is intended to close gaps in the revised to 20-point peace plan to end the war with Russia.",
          "content": "Ukrainian President Volodymyr Zelenskyy arrives in the US on Sunday as his frozen capital of Kyiv comes under assault by Russian missiles and drones, a deadly reminder from the war&#x27;s aggressor that its attacks would continue even amid accelerated peace talks.The 1pm ET (5am Monday AEDT) Mar-a-Lago meeting between Zelenskyy and US President Donald Trump, announced only two days beforehand, is intended to close gaps in the original 28-point peace plan that Trump first proposed last month and which Ukraine has since revised to 20 points. Intensive work has been underway by American envoys to finalise a proposal both Ukraine and Russia can agree on.READ MORE: &#x27;Full-scale war&#x27;: Iran leader&#x27;s chilling statement to nationTrump, who has been in Palm Beach since December 20, will interrupt his holiday break for the discussion. The meeting was arranged after Zelenskyy held an hour-long phone call late last week with Steve Witkoff, Trump&#x27;s foreign envoy, and Jared Kushner, the president&#x27;s son-in-law who is working to finalise the peace agreement.Trump said earlier this month he didn&#x27;t think meetings with Zelenskyy or his European allies would be useful unless they were close to reaching a deal, a sign of the negotiations&#x27; advanced stage. American officials have described significant progress in the peace efforts, with a US official saying earlier this month that 90 per cent of the terms of the deal had been settled. Zelenskyy affirmed that figure on Friday.\"It isn&#x27;t easy. No one is saying that it will be 100 per cent right away, but nevertheless, we must bring the desired result closer with every such meeting, every such conversation,\" he said.The remaining 10 per cent have proved difficult to resolve and include the thorny issue of land concessions that will be necessary to end the nearly four-year war. Russia has not backed off its maximalist demands, including that Ukraine surrender the entire eastern Donbas region.Zelenskyy, however, is no longer ruling out concessions entirely, and says he would bring the peace plan up for a referendum if Russia agrees to a ceasefire. (Ukraine&#x27;s constitution requires any changes to the country&#x27;s borders to be approved in a referendum.)The US side has offered \"thought-provoking\" ideas on how to resolve the impasse, one US official said, including the development of an \"economic free zone\" in the eastern part of Ukraine.Also unresolved is the fate of the Russia-occupied Zaporizhzhia nuclear power plant, Europe&#x27;s largest. Zelenskyy said Kyiv proposes the plant be operated by a joint enterprise between the US and Ukraine, with 50 per cent of the electricity output going to Ukraine and the remainder allocated by the US.Russia will not be represented at Sunday&#x27;s meeting, and it remains unclear whether Moscow is willing to agree to an immediate ceasefire that would allow a peace plan to take hold. Trump has frequently pointed to both Ukraine and Russia as obstacles to peace.Speaking a day before the meeting, Russian President Vladimir Putin said that \"if Kyiv is not willing to resolve the matter peacefully, Russia will accomplish all the aims of the special military operation by military means,\" using a euphemism for the war in Ukraine, according to Russian state media service TASS.Russia launched 519 drones and 40 missiles at Ukraine overnight into Saturday, according to Ukraine&#x27;s air force. Zelenskyy said on Saturday morning that while Russian officials are engaging in talks to end fighting, the ongoing violence speaks for itself.American officials are hopeful the meeting Sunday will be productive after a week of intensive efforts between US and Ukrainian negotiators, according to US officials, though they did not cite a specific goal for the meeting.Zelenskyy said ahead of the meeting he wants to conclude a framework to end the conflict, including nailing down the specifics of security guarantees from the United States to ensure Russia isn&#x27;t able to invade further once the war ends.A set of security guarantees similar to NATO&#x27;s Article 5 was hammered out over two days of discussions in Berlin earlier this month between officials from Europe, Ukraine and the United States. They would allow for deterrence from further Russian aggression, deconfliction mechanisms and monitoring of an eventual peace deal. They would also spell out the consequences for Russia if it violates the agreement.\"This is the most robust set of security protocols they have ever seen. It is a very, very strong package,\" a senior US official said, without detailing exactly what the US was promising. Trump is willing to bring the US-backed security guarantees before Congress, a second official said, describing the package as the \"platinum standard\" for what Washington can offer Ukraine.Trump believes he can get Moscow to accept the guarantees, and the officials also said Russia had indicated openness to Ukraine joining the European Union as part of any peace agreement.Sunday&#x27;s meeting is not expected to include any European leaders, according to US and European officials, unlike previous meetings between the two presidents. In August, European leaders rushed to the White House to accompany Zelenskyy after a February Oval Office session with Trump turned acrimonious.Trump said in an interview with Politico on Friday that he expects the meeting with Zelenskyy to \"go good\", but cautioned that the Ukrainian president \"doesn&#x27;t have anything until I approve it\".The Ukrainians have been pushing for a meeting between Zelenskyy and Trump since they last met in October. European officials said they expected a positive meeting, describing the current dynamic between the US and Ukraine as productive.Still, they acknowledged the outcome of any meeting with Trump is unpredictable.\"There is no low-risk scenario with Trump,\" said one NATO official.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 8,
          "image_url": "https://prod.static9.net.au/fs/ca0a515e-6e8f-4c69-9def-522210a822ca"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/russia-ukraine-conflict-updates-russia-launches-mass-attack-on-kyiv-ahead-of-trump-zelenskyy-peace-talks/8b8a9c20-a221-4536-a422-671cf4f7deeb",
          "published_at": "Sat, 27 Dec 2025 12:42:12 +0000",
          "title": "Russia launches mass attack on Kyiv ahead of Trump-Zelenskyy peace talks",
          "standfirst": "Russia launched a large-scale overnight attack on Kyiv after Ukraine&#x27;s President Volodymyr Zelenskyy said he plans to meet his US counterpart Donald Trump in Florida Sunday.",
          "content": "Russia launched a large-scale overnight attack on Kyiv after Ukraine&#x27;s President Volodymyr Zelenskyy said he plans to meet his US counterpart Donald Trump in Florida Sunday, as efforts continue to end the nearly four-year war in Eastern Europe.The aerial attack killed at least one person – a 71-year-old – and injured 32 more, including two children, according to Kyiv police.Kyiv&#x27;s mayor Vitali Klitschko said more than 2600 residential buildings are currently without heating, as well as 187 kindergartens, 138 schools and 22 social institutions in the capital, amid freezing temperatures.READ MORE: At least 15 injured in a knife and chemical attack at a factory in Japan The attack lasted nearly 10 hours in total, making it one of the longest of the year.Speaking on board a plane bound for the United States Saturday, Zelenskyy repeated calls for the bolstering of Ukraine&#x27;s air defences, saying the country needed more missiles amid Russia&#x27;s relentless attacks. \"The support of Europeans is important to us today. We do not have enough additional air defence systems,\" he said.Ahead of meeting Trump, Zelenskyy is stopping in Canada for talks with President Mark Carney.On Friday, Zelenskyy told reporters that the 20-point peace plan hammered out by Ukrainian and US officials is \"90 per cent ready\" and that he planned to discuss with Trump how Ukraine&#x27;s allies could guarantee its security in the future.Trump said in an interview with Politico that he expects the meeting to \"go good,\" but cautioned that Zelenskyy \"doesn&#x27;t have anything until I approve it\". He added that he also expects to speak with Russian President Vladimir Putin \"soon, as much as I want\".In total, Russia launched nearly 500 drones and 40 missiles at Ukraine overnight, Zelenskyy said on Saturday morning, adding that while Russian officials are engaging in talks to end fighting, the ongoing violence speaks for itself.The most recent strikes primarily targeted energy and civilian infrastructure in the capital city, Kyiv, Zelenskyy said.\"In some districts of the capital and the region, electricity and heating are currently unavailable,\" he said. \"Firefighting efforts are underway.\"A CNN reporter in the capital heard attack drones flying overhead and a series of explosions early on Saturday, when Air Force warnings were in place.Fires broke out across the city, engulfing a car repair shop and several residential buildings, and forcing elderly residents to evacuate a care home as flames spread, according to Kyiv Emergency Service.Pointing to Russia&#x27;s recent engagement in talks with US representatives to end fighting in the country, Zelenskyy wrote on X in the wake of the attack that \"Russian representatives engage in lengthy talks, but in reality, Kinzhals and &#x27;shaheds&#x27; speak for them.\"He added, \"This is the true attitude of Putin and his inner circle.\"In response to the attacks, Poland scrambled fighter jets and temporarily closed two airports, Reuters reported, citing a post by the Polish Air Navigation Services Agency on X.The shutdowns of Rzeszow and Lublin airports, in the country&#x27;s southeast, were triggered by \"unplanned military activity related to ensuring state security,\" according to a Notice to Airmen (NOTAM) posted on the US Federal Aviation Administration&#x27;s website.US officials said they were hopeful that Sunday&#x27;s Zelenskyy-Trump meeting would be productive after a week of intensive efforts between US and Ukrainian negotiators. While officials did not cite a specific goal for the meeting, Zelenskyy told Axios on Friday that he wanted to conclude a framework to end the war.The meeting is not expected to include any European leaders, according to US and European officials. However, European Commission President Ursula von der Leyen will join a call on Saturday with Zelenskyy, Trump and other European leaders, a commission spokesperson told Reuters.The Ukrainians have been pushing for a meeting between Zelenskyy and Trump for months, European officials said. The Europeans expect a positive meeting because they describe the current dynamic between the US and Ukraine as productive. Still, they acknowledge that the outcome of any meeting with Trump is unpredictable.\"There is no low-risk scenario with Trump,\" said one NATO official.In preparation for Sunday&#x27;s meeting, Zelenskyy said on Friday that he had spoken with the leaders of NATO, Canada, Germany, Finland, Denmark and Estonia to coordinate their positions. \"Ukraine has never been and will never be an obstacle to peace, and we will continue working efficiently to ensure all necessary documents are prepared as quickly as possible,\" he said.Zelenskyy&#x27;s announcement comes after he offered to compromise on some of the thorniest issues that have so far stalled the US-mediated peace process with Russia. It is not clear, however, whether Zelenskyy&#x27;s concessions will satisfy the Kremlin.Asked about Zelenskyy&#x27;s potential willingness to consider territorial concessions for a peace deal, Kremlin spokesperson Dmitry Peskov told CNN that \"giving up the rest of Donetsk could contribute significantly.\"The initial 28-point peace plan, which emerged in November following talks between the United States and Russia, was criticised by Ukraine&#x27;s allies as heavily favouring Moscow. Following weeks of talks between Ukrainian and US officials, that draft has been slimmed down to the current 20-point plan, which Zelenskyy has said can serve as a \"foundational document on ending the war.\"Latest on peace negotiationsZelenskyy told reporters that Ukraine had not received an official response from the Kremlin to the latest proposal. He said Kyiv is negotiating exclusively with Washington, which in turn is communicating with Moscow.If Russia does not agree to the peace plan drafted by Ukraine and the United States, Zelenskyy suggested that more should be done to force Moscow&#x27;s hand. \"If Ukraine shows its position, it is constructive – and Russia, for example, does not agree, then the (existing) pressure is not enough,\" Zelenskyy said, adding that he wants to discuss this with Trump.Russia&#x27;s central demands are for Ukraine to abandon its ambition to join NATO – which was a distant prospect before Moscow launched its all-out invasion of the country in February 2022 – and for Kyiv&#x27;s military to withdraw fully from Ukraine&#x27;s eastern Donetsk and Luhansk regions, a vast area known as the Donbas. It was here that the Kremlin started destabilising Ukraine in 2014, helping pro-Russian separatists gain control of most of the area. The Donbas was eventually illegally annexed by Russia in September 2022.Zelenskyy has offered concessions on both issues. During a wide-ranging press conference on Tuesday to discuss the new 20-point peace plan, Zelenskyy said Ukraine was seeking security guarantees from its allies that would \"mirror\" NATO&#x27;s Article 5 – which requires all members to defend any member that has come under attack – but would no longer pursue full membership of the military alliance.Zelenskyy also said Ukraine would be willing to withdraw its troops from parts of the Donetsk region not currently occupied by Russian forces. The Ukrainian leader said any withdrawal of troops would have to be reciprocal, with Moscow giving up as much Ukrainian territory as that ceded by Kyiv and those pockets of the Donbas becoming demilitarised as a result. Earlier this month, Zelenskyy noted that US negotiators wanted these territories to become \"free economic zones\" once all troops were withdrawn.Ukraine&#x27;s constitution requires any changes to the country&#x27;s borders to be approved in a referendum. Zelenskyy reiterated on Friday that \"the fate of Ukraine should be decided by the people of Ukraine\" and said Ukraine&#x27;s allies \"have enough power to force Russia or to negotiate with the Russians\" to ensure that any such plebiscite could be carried out safely.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 15,
          "image_url": "https://prod.static9.net.au/fs/ad886ff9-30ca-462d-85e9-112040fb03c7"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_1.0342%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_22/t_crop_custom/q_86%2Cf_auto/f5272be1acb667670fdfdaaf06688be2de81d6166b0b288765fc5f8193446ba3",
      "popularity_score": 2019.0723519444443
    },
    {
      "id": "cluster_17",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 05:16:16 +1100",
      "title": "Clunky, cringe and costly: Kyrgios defeats Sabalenka in Battle of the Sexes",
      "neutral_headline": "Clunky, cringe and costly: Kyrgios defeats Sabalenka in Battle of the Sexes",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/sport/tennis/clunky-cringe-and-costly-kyrgios-defeats-sabalenka-in-battle-of-the-sexes-20251228-p5nqbk.html",
          "published_at": "Mon, 29 Dec 2025 05:16:16 +1100",
          "title": "Clunky, cringe and costly: Kyrgios defeats Sabalenka in Battle of the Sexes",
          "standfirst": "Australian tennis star Nick Kyrgios arrived on a camel, while Aryna Sabalenka made an entrance in a bedazzled overcoat for the exhibition match in Dubai on Monday.",
          "content": "Australian tennis star Nick Kyrgios arrived on a camel, while Aryna Sabalenka made an entrance in a bedazzled overcoat for the exhibition match in Dubai on Monday.",
          "feed_position": 6,
          "image_url": "https://static.ffx.io/images/$zoom_0.5515625%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_44/t_crop_custom/q_86%2Cf_auto/7c7c82df9779f9184ba4798256d742f7132c8d9430924a75aba8bf10e330461f"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/nick-kyrgios-aryna-sabalenka-battle-of-the-sexes-live-blog/106182808",
          "published_at": "Sun, 28 Dec 2025 14:33:28 +0000",
          "title": "'Happy it's over': Kyrgios defeats Sabalenka in new battle of the sexes",
          "standfirst": "Australia's Nick Kyrgios defeated women's world number one Aryna Sabalenka in the latest 'battle of the sexes'. The Aussie, who has fallen outside the ATP top 600 after barely playing for three years, won 6-3, 6-3.",
          "content": "Australia's Nick Kyrgios defeated women's world number one Aryna Sabalenka in the latest 'battle of the sexes'. The Aussie, who has fallen outside the ATP top 600 after barely playing for three years, won 6-3, 6-3.",
          "feed_position": 5
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.5515625%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_44/t_crop_custom/q_86%2Cf_auto/7c7c82df9779f9184ba4798256d742f7132c8d9430924a75aba8bf10e330461f",
      "popularity_score": 2018.9998519444443
    },
    {
      "id": "cluster_18",
      "coverage": 2,
      "updated_at": "Mon, 29 Dec 2025 05:11:00 +1100",
      "title": "Master Lock Comanche takes line honours in Sydney to Hobart filled with mass retirements",
      "neutral_headline": "Comanche gets 'redemption' for last year after winning race line honours",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/sport/sailing/master-lock-comanche-takes-line-honours-in-sydney-to-hobart-filled-with-mass-retirements-20251228-p5nqd8.html",
          "published_at": "Mon, 29 Dec 2025 05:11:00 +1100",
          "title": "Master Lock Comanche takes line honours in Sydney to Hobart filled with mass retirements",
          "standfirst": "Defending back-to-back winner LawConnect begun their day of sailing with a torn sail and couldn’t catch Comanche in the lead.",
          "content": "Defending back-to-back winner LawConnect begun their day of sailing with a torn sail and couldn’t catch Comanche in the lead.",
          "feed_position": 7,
          "image_url": "https://static.ffx.io/images/$zoom_0.5516%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/8cf37ccfadb20644b35cf7eabb2ecc001b76cdb4e83b21e833af053d9738e66a"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/live-blog-sydney-to-hobart-yacht-race-tracking-the-finish/106182756",
          "published_at": "Sun, 28 Dec 2025 06:31:51 +0000",
          "title": "Comanche gets 'redemption' for last year after winning race line honours",
          "standfirst": "Master Lock Comanche claims line honours in the 80th edition of the gruelling Sydney to Hobart yacht race, with a stunning daylight hours finish, making up for retiring early in last year's race.",
          "content": "Master Lock Comanche claims line honours in the 80th edition of the gruelling Sydney to Hobart yacht race, with a stunning daylight hours finish, making up for retiring early in last year's race.",
          "feed_position": 2
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.5516%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/8cf37ccfadb20644b35cf7eabb2ecc001b76cdb4e83b21e833af053d9738e66a",
      "popularity_score": 2018.9120741666666
    },
    {
      "id": "cluster_34",
      "coverage": 2,
      "updated_at": "Sun, 28 Dec 2025 12:13:56 +0000",
      "title": "French film star Brigitte Bardot dies, aged 91",
      "neutral_headline": "French film star Brigitte Bardot dies, aged 91",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/brigitte-bardot-death-1960s-sex-symbol-turned-militant-animal-rights-activist-dies-aged-91/6def262c-0bbf-446c-bdb8-328054e794bc",
          "published_at": "Sun, 28 Dec 2025 12:13:56 +0000",
          "title": "French film star Brigitte Bardot dies, aged 91",
          "standfirst": "Screen icon Brigitte Bardot, who became a sex symbol in the 1960s and later a militant animal rights activist, has died at the age of 91.",
          "content": "Brigitte Bardot, the French 1960s sex symbol who became one of the greatest screen sirens of the 20th century and later a militant animal rights activist, has died. She was 91.Bardot died Sunday at her home in southern France, according to Bruno Jacquelin, of the Brigitte Bardot Foundation for the protection of animals.Speaking to The Associated Press, he gave no cause of death, and said no arrangements have yet been made for funeral or memorial services. READ MORE: Russia hits Kyiv in deadly strike a day before key Trump-Zelenksyy meeting She had been hospitalised last month.Bardot became an international celebrity as a sexualized teen bride in the 1956 movie And God Created Woman. Directed by her then-husband, Roger Vadim, it triggered a scandal with scenes of the long-legged beauty dancing on tables naked.At the height of a cinema career that spanned some 28 films and three marriages, Bardot came to symbolise a nation bursting out of bourgeois respectability. Her tousled, blond hair, voluptuous figure and pouty irreverence made her one of France&#x27;s best-known stars.Such was her widespread appeal that in 1969 her features were chosen to be the model for \"Marianne\", a bare-breasted statue representing the French Republic, and the official Gallic seal. Bardot&#x27;s face appeared on statues, postage stamps and even on coins.&#x27;&#x27;We are mourning a legend,&#x27;&#x27; French President Emmanuel Macron wrote Sunday on X.Bardot&#x27;s second career as an animal rights activist was equally sensational. She travelled to the Arctic to blow the whistle on the slaughter of baby seals; she condemned the use of animals in laboratory experiments; and she opposed Muslim slaughter rituals.\"Man is an insatiable predator,\" Bardot told The Associated Press on her 73rd birthday, in 2007.\"I don&#x27;t care about my past glory. That means nothing in the face of an animal that suffers, since it has no power, no words to defend itself.\"Her activism earned her compatriots&#x27; respect and, in 1985, she was awarded the Legion of Honour, the nation&#x27;s highest honour.A turn to the far rightLater, however, she fell from public grace as her animal protection diatribes took on a decidedly extremist tone. She frequently decried the influx of immigrants into France, especially Muslims.She was convicted and fined five times in French courts of inciting racial hatred, in incidents inspired by her opposition to the Muslim practice of slaughtering sheep during annual religious holidays.Bardot&#x27;s 1992 marriage to fourth husband Bernard d&#x27;Ormale, a onetime adviser to former National Front leader Jean-Marie Le Pen, contributed to her political shift. She described the outspoken nationalist as a \"lovely, intelligent man\".In 2012, she wrote a letter in support of the presidential bid of Marine Le Pen, who now leads her father&#x27;s renamed National Rally party. Le Pen paid homage Sunday to an \"exceptional woman\" who was \"incredibly French\".In 2018, at the height of the #MeToo movement, Bardot said in an interview that most actors protesting sexual harassment in the film industry were \"hypocritical\" and \"ridiculous\" because many played \"the teases\" with producers to land parts.She said she had never had been a victim of sexual harassment and found it \"charming to be told that I was beautiful or that I had a nice little ass\".A privileged, but &#x27;difficult&#x27; upbringingBrigitte Anne-Marie Bardot was born September 28, 1934, to a wealthy industrialist. A shy, secretive child, she studied classical ballet and was discovered by a family friend who put her on the cover of Elle magazine at age 14.Bardot once described her childhood as \"difficult\" and said her father was a strict disciplinarian who would sometimes punish her with a horse whip.But it was French movie producer Vadim, whom she married in 1952, who saw her potential and wrote And God Created Woman to showcase her provocative sensuality, an explosive cocktail of childlike innocence and raw sexuality.The film, which portrayed Bardot as a bored newlywed who beds her brother-in-law, had a decisive influence on New Wave directors Jean-Luc Godard and Francois Truffaut, and came to embody the hedonism and sexual freedom of the 1960s.The film was a box-office hit, and it made Bardot a superstar. Her girlish pout, tiny waist and generous bust were often more appreciated than her talent.\"It&#x27;s an embarrassment to have acted so badly,\" Bardot said of her early films.\"I suffered a lot in the beginning. I was really treated like someone less than nothing.\"Bardot&#x27;s unabashed, off-screen love affair with co-star Jean-Louis Trintignant further shocked the nation. It eradicated the boundaries between her public and private life and turned her into a hot prize for paparazzi.Bardot never adjusted to the limelight. She blamed the constant press attention for the suicide attempt that followed 10 months after the birth of her only child, Nicolas. Photographers had broke into her house only two weeks before she gave birth to snap a picture of her pregnant.Nicolas&#x27; father was Jacques Charrier, a handsome French actor whom she married in 1959 but who never felt comfortable in his role as Monsieur Bardot. Bardot soon gave up her son to his father, and later said she had been chronically depressed and unready for the duties of being a mother.\"I was looking for roots then,\" she said in an interview. \"I had none to offer.\"In her 1996 autobiography Initiales B.B., she likened her pregnancy to \"a tumour growing inside me,\" and described Charrier as \"temperamental and abusive\".Bardot married her third husband, West German millionaire playboy Gunther Sachs, in 1966, but the relationship again ended in divorce three years later.Among her films were A Parisian (1957); In Case of Misfortune, in which she starred in 1958 with screen legend Jean Gabin; The Truth (1960); Private Life (1962); A Ravishing Idiot (1964); Shalako (1968); Women (1969); The Bear And The Doll (1970); Rum Boulevard (1971); and Don Juan (1973).With the exception of 1963&#x27;s critically acclaimed Contempt, directed by Godard, Bardot&#x27;s films were rarely complicated by plots. Often they were vehicles to display Bardot&#x27;s curves and legs in scanty dresses or frolicking nude in the sun.\"It was never a great passion of mine,\" she said of filmmaking.\"And it can be deadly sometimes. Marilyn [Monroe] perished because of it.\"Bardot retired to her Riviera villa in St. Tropez at the age of 39 in 1973 after The Woman Grabber.Reinventing herself in middle ageShe emerged a decade later with a new persona: An animal rights lobbyist, her face was wrinkled and her voice was deep following years of heavy smoking. She abandoned her jet-set life and sold off movie memorabilia and jewellery to create a foundation devoted exclusively to the prevention of animal cruelty.Her activism knew no borders. She urged South Korea to ban the sale of dog meat and once wrote to US President Bill Clinton asking why the US Navy recaptured two dolphins it had released into the wild.She attacked centuries-old French and Italian sporting traditions including the Palio, a free-for-all horse race, and campaigned on behalf of wolves, rabbits, kittens and turtle doves.Following news of her death, PETA Founder Ingrid Newkirk praised her activism and labelled the late actress \"a strong voice for all species\".\"From her rescued pigeons in Saint-Tropez to her beloved dogs, PETA will miss Brigitte, an angel for animals who went to bat and to court to protect them all,\" Newkirk said in a statement. By the late 1990s, Bardot was making headlines that would lose her many fans. She was convicted and fined five times between 1997 and 2008 for inciting racial hatred in incidents inspired by her anger at Muslim animal slaughtering rituals.\"It&#x27;s true that sometimes I get carried away, but when I see how slowly things move forward ... and despite all the promises that have been made to me by all different governments put together — my distress takes over,\" Bardot told the AP.In 1997, several towns removed Bardot-inspired statues of Marianne after the actress voiced anti-immigrant sentiment. Also that year, she received death threats after calling for a ban on the sale of horse meat.Bardot once said that she identified with the animals that she was trying to save.\"I can understand hunted animals because of the way I was treated,\" Bardot said.\"What happened to me was inhuman. I was constantly surrounded by the world press.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/1d43fdd7-def0-49f1-8b5d-50f094e33c76"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/brigitte-bardot-dies-age-91/102626484",
          "published_at": "Sun, 28 Dec 2025 10:19:07 +0000",
          "title": "Iconic French star Brigitte Bardot dies aged 91",
          "standfirst": "The French actor and singer was a screen siren of the 1950s and 1960s who in later life became a prominent animal rights campaigner.",
          "content": "The French actor and singer was a screen siren of the 1950s and 1960s who in later life became a prominent animal rights campaigner.",
          "feed_position": 3
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/1d43fdd7-def0-49f1-8b5d-50f094e33c76",
      "popularity_score": 2012.9609630555556
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:02:12 +0000",
      "title": "Courtesy wave dying out, say truckies, but still alive on back roads",
      "neutral_headline": "Courtesy wave dying out, say truckies, but still alive on back roads",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-29/australian-drivers-truckies-courtesy-wave/106152822",
          "published_at": "Sun, 28 Dec 2025 19:02:12 +0000",
          "title": "Courtesy wave dying out, say truckies, but still alive on back roads",
          "standfirst": "For generations, the courtesy wave has been etched into the Australian culture, but is it on the verge of dying?",
          "content": "For generations, the courtesy wave has been etched into the Australian culture, but is it on the verge of dying?",
          "feed_position": 0
        }
      ],
      "popularity_score": 362.7654075
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 13:01:12 +0000",
      "title": "Families of Bondi victims call for federal royal commission",
      "neutral_headline": "Families of Bondi victims call for federal royal commission",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/bondi-beach-victim-families-call-for-federal-royal-comission/106183188",
          "published_at": "Sun, 28 Dec 2025 13:01:12 +0000",
          "title": "Families of Bondi victims call for federal royal commission",
          "standfirst": "Loved ones of those killed and injured in the Bondi Beach attack say rising antisemitism requires a \"powerful national response\", piling pressure on Anthony Albanese for a royal commission.",
          "content": "Loved ones of those killed and injured in the Bondi Beach attack say rising antisemitism requires a \"powerful national response\", piling pressure on Anthony Albanese for a royal commission.",
          "feed_position": 0
        }
      ],
      "popularity_score": 346.74874083333333
    },
    {
      "id": "cluster_1",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 19:01:01 +0000",
      "title": "Caravan customers furious ASIC ignored whistleblower before collapse",
      "neutral_headline": "Caravan customers furious ASIC ignored whistleblower before collapse",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-29/furious-customers-asic-whistleblower-zone-rv-caravan-collapse/106169334",
          "published_at": "Sun, 28 Dec 2025 19:01:01 +0000",
          "title": "Caravan customers furious ASIC ignored whistleblower before collapse",
          "standfirst": "Anger is growing after revelations the corporate watchdog failed to investigate allegations against luxury caravan manufacturer Zone RV.",
          "content": "Anger is growing after revelations the corporate watchdog failed to investigate allegations against luxury caravan manufacturer Zone RV.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.7456852777778
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:33:27 +0000",
      "title": "NGOs fear lifesaving aid program blockage in Gaza under new Israeli rules",
      "neutral_headline": "NGOs fear lifesaving aid program blockage in Gaza under new Israeli rules",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/aid-agencies-fear-lifesaving-program-blockage-into-gaza-/106181964",
          "published_at": "Sun, 28 Dec 2025 18:33:27 +0000",
          "title": "NGOs fear lifesaving aid program blockage in Gaza under new Israeli rules",
          "standfirst": "The Israeli government has introduced new rules for aid organisations, including that they must not engage in any activities or criticism which \"delegitimise\" the state of Israel.",
          "content": "The Israeli government has introduced new rules for aid organisations, including that they must not engage in any activities or criticism which \"delegitimise\" the state of Israel.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.28624083333335
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 10:38:18 +0000",
      "title": "Brigitte Bardot, the French star you 'had to see to believe'",
      "neutral_headline": "Brigitte Bardot, the French star you 'had to see to believe'",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/brigitte-bardot-sex-symbol-fashion-darling-and-french-icon/105927998",
          "published_at": "Sun, 28 Dec 2025 10:38:18 +0000",
          "title": "Brigitte Bardot, the French star you 'had to see to believe'",
          "standfirst": "Few epitomised French chic like Brigitte Bardot, the doe-eyed beauty whose sensuality rocked a post-war world.",
          "content": "Few epitomised French chic like Brigitte Bardot, the doe-eyed beauty whose sensuality rocked a post-war world.",
          "feed_position": 4
        }
      ],
      "popularity_score": 304.36707416666667
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:34:19 +0000",
      "title": "Inside Big Ben, a London icon that's been ringing since 1859",
      "neutral_headline": "Inside Big Ben, a London icon that's been ringing since 1859",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/inside-big-ben-the-bell-ringing-in-new-years-day/106172402",
          "published_at": "Sun, 28 Dec 2025 18:34:19 +0000",
          "title": "Inside Big Ben, a London icon that's been ringing since 1859",
          "standfirst": "It's among the world's most photographed landmarks, a symbol of the United Kingdom and an engineering marvel. And for London's Big Ben the most important night of the year is fast approaching.",
          "content": "It's among the world's most photographed landmarks, a symbol of the United Kingdom and an engineering marvel. And for London's Big Ben the most important night of the year is fast approaching.",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.3006852777778
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:30:58 +0000",
      "title": "From agony at Mount Arapiles to the top of the world in seven months",
      "neutral_headline": "From agony at Mount Arapiles to the top of the world in seven months",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/sarah-larcombe-paraclimbing-injury-arapiles-world-championships/106018328",
          "published_at": "Sun, 28 Dec 2025 18:30:58 +0000",
          "title": "From agony at Mount Arapiles to the top of the world in seven months",
          "standfirst": "When Sarah Larcombe fell off Mount Arapiles in February, she thought she just sprained her ankle. What followed was months of ups and downs ending in a stunning world championships result.",
          "content": "When Sarah Larcombe fell off Mount Arapiles in February, she thought she just sprained her ankle. What followed was months of ups and downs ending in a stunning world championships result.",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.24485194444446
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Sat, 27 Dec 2025 18:30:00 +0000",
      "title": "Forget brat summer, the vibe shift is here and it's terrifying",
      "neutral_headline": "Forget brat summer, the vibe shift is here and it's terrifying",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/vibe-shift-ai-misinformation-reality-future/106098002",
          "published_at": "Sat, 27 Dec 2025 18:30:00 +0000",
          "title": "Forget brat summer, the vibe shift is here and it's terrifying",
          "standfirst": "From the rise of misinformation and AI to escalating political tensions, vast economic disparity, and the erosion of social bonds, the vibe shift is now understood as a deep, unsettling change in our collective reality.",
          "content": "From the rise of misinformation and AI to escalating political tensions, vast economic disparity, and the erosion of social bonds, the vibe shift is now understood as a deep, unsettling change in our collective reality.",
          "feed_position": 9
        }
      ],
      "popularity_score": 243
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:30:00 +0000",
      "title": "Quiz: How well do you remember this week in history?",
      "neutral_headline": "Quiz: How well do you remember this week in history",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/this-week-in-history-quiz-december-29/106174918",
          "published_at": "Sun, 28 Dec 2025 18:30:00 +0000",
          "title": "Quiz: How well do you remember this week in history?",
          "standfirst": "Test your knowledge with questions about Shane Warne, Frank Sinatra and Australia's first stamp.",
          "content": "Test your knowledge with questions about Shane Warne, Frank Sinatra and Australia's first stamp.",
          "feed_position": 13
        }
      ],
      "popularity_score": 152.22874083333335
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 18:22:30 +0000",
      "title": "Why a growing number of older women are living out their surf dream",
      "neutral_headline": "Why a growing number of older women are living out their surf dream",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-29/older-women-surfing-trends/105867538",
          "published_at": "Sun, 28 Dec 2025 18:22:30 +0000",
          "title": "Why a growing number of older women are living out their surf dream",
          "standfirst": "When Katie Pahlow turned 60, she decided to finally bite the bullet and book herself in for some surf lessons.",
          "content": "When Katie Pahlow turned 60, she decided to finally bite the bullet and book herself in for some surf lessons.",
          "feed_position": 14
        }
      ],
      "popularity_score": 152.10374083333335
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 07:14:19 +0000",
      "title": "Teenagers charged after alleged aggravated carjacking in Melbourne",
      "neutral_headline": "Teenagers charged after alleged aggravated carjacking in Melbourne",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/alleged-aggravated-carjacking-police-chase-hampton-park-pakenham/106183114",
          "published_at": "Sun, 28 Dec 2025 07:14:19 +0000",
          "title": "Teenagers charged after alleged aggravated carjacking in Melbourne",
          "standfirst": "An overnight police chase across multiple suburbs has ended with the arrest of three teenagers after an alleged aggravated carjacking in Melbourne's south-east.",
          "content": "An overnight police chase across multiple suburbs has ended with the arrest of three teenagers after an alleged aggravated carjacking in Melbourne's south-east.",
          "feed_position": 11
        }
      ],
      "popularity_score": 146.96735194444443
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 04:47:13 +0000",
      "title": "Sending army to protect Sydney's Jewish community 'not off the table'",
      "neutral_headline": "Sending army to protect Sydney's Jewish community 'not off the table'",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/army-protecting-sydney-jewish-community-not-ruled-out-premier/106182770",
          "published_at": "Sun, 28 Dec 2025 04:47:13 +0000",
          "title": "Sending army to protect Sydney's Jewish community 'not off the table'",
          "standfirst": "Sydneysiders can expect to see more police officers carrying long-armed guns in the weeks ahead, with the premier not ruling out sending troops to protect the Jewish community.",
          "content": "Sydneysiders can expect to see more police officers carrying long-armed guns in the weeks ahead, with the premier not ruling out sending troops to protect the Jewish community.",
          "feed_position": 16
        }
      ],
      "popularity_score": 144.51568527777778
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 07:09:07 +0000",
      "title": "Police say Tennant Creek death in custody was result of 'medical episode'",
      "neutral_headline": "Police say Tennant Creek death in custody was result of 'medical episode'",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/tennant-creek-death-in-custody-medical-episode-no-nurse-on-duty/106182578",
          "published_at": "Sun, 28 Dec 2025 07:09:07 +0000",
          "title": "Police say Tennant Creek death in custody was result of 'medical episode'",
          "standfirst": "Northern Territory Police say the death in custody of an Indigenous woman in Tennant Creek on Saturday was the result of a \"medical episode\", while admitting there was no nurse on duty at the time.",
          "content": "Northern Territory Police say the death in custody of an Indigenous woman in Tennant Creek on Saturday was the result of a \"medical episode\", while admitting there was no nurse on duty at the time.",
          "feed_position": 17
        }
      ],
      "popularity_score": 140.8806852777778
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 06:47:56 +0000",
      "title": "Woman dies in glider crash, pilot airlifted to Royal Hobart Hospital",
      "neutral_headline": "Woman dies in glider crash, pilot airlifted to Royal Hobart Hospital",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/tas-fatal-glider-crash-in-tasmanias-southern-midlands/106183104",
          "published_at": "Sun, 28 Dec 2025 06:47:56 +0000",
          "title": "Woman dies in glider crash, pilot airlifted to Royal Hobart Hospital",
          "standfirst": "A woman has died and a man has been taken to hospital following a glider crash at a private airfield in Tasmania.",
          "content": "A woman has died and a man has been taken to hospital following a glider crash at a private airfield in Tasmania.",
          "feed_position": 22
        }
      ],
      "popularity_score": 140.52762972222223
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 05:16:34 +0000",
      "title": "Why you might want to keep your receipts when you shop in Taiwan",
      "neutral_headline": "Why you might want to keep your receipts when you shop in Taiwan",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/taiwan-receipt-lottery-win-money-from-shopping/106140828",
          "published_at": "Sun, 28 Dec 2025 05:16:34 +0000",
          "title": "Why you might want to keep your receipts when you shop in Taiwan",
          "standfirst": "Most shopping receipts in Taiwan are also tickets for a lottery run every second month by the government to increase tax compliance, and there are some big prizes up for grabs.",
          "content": "Most shopping receipts in Taiwan are also tickets for a lottery run every second month by the government to increase tax compliance, and there are some big prizes up for grabs.",
          "feed_position": 12
        }
      ],
      "popularity_score": 139.00485194444445
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 04:25:03 +0000",
      "title": "Police crack down on drink driving, e-devices amid rising road death toll",
      "neutral_headline": "Police crack down on drink driving, e-devices amid rising road death toll",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/qld-annual-road-toll-reaches-sixteen-year-high/106182724",
          "published_at": "Sun, 28 Dec 2025 04:25:03 +0000",
          "title": "Police crack down on drink driving, e-devices amid rising road death toll",
          "standfirst": "More than 300 people have died on Queensland roads this year, with four additional deaths already recorded over the Christmas period. It has prompted a plea from authorities to ensure it does not get higher.",
          "content": "More than 300 people have died on Queensland roads this year, with four additional deaths already recorded over the Christmas period. It has prompted a plea from authorities to ensure it does not get higher.",
          "feed_position": 17
        }
      ],
      "popularity_score": 138.14624083333334
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 03:55:08 +0000",
      "title": "Extreme fire conditions to hit South Australia on Monday",
      "neutral_headline": "Extreme fire conditions to hit South Australia on Monday",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/sa-fire-season-extreme-danger-warning/106182676",
          "published_at": "Sun, 28 Dec 2025 03:55:08 +0000",
          "title": "Extreme fire conditions to hit South Australia on Monday",
          "standfirst": "Authorities are warning people to be prepared as hot and windy conditions sweep across the state.",
          "content": "Authorities are warning people to be prepared as hot and windy conditions sweep across the state.",
          "feed_position": 18
        }
      ],
      "popularity_score": 137.64762972222223
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 03:43:29 +0000",
      "title": "SA independent MP Nick McBride charged with assault",
      "neutral_headline": "SA independent MP Nick McBride charged with assault",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/sa-independent-mp-nick-mcbride-charged/106182668",
          "published_at": "Sun, 28 Dec 2025 03:43:29 +0000",
          "title": "SA independent MP Nick McBride charged with assault",
          "standfirst": "Police say they responded to reports of a domestic assault at a home in South Australia's south-east on Saturday.",
          "content": "Police say they responded to reports of a domestic assault at a home in South Australia's south-east on Saturday.",
          "feed_position": 11
        }
      ],
      "popularity_score": 137.45346305555555
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 02:41:42 +0000",
      "title": "MCC boss defends curator Matt Page after two-day Ashes Test",
      "neutral_headline": "MCC boss defends curator Matt Page after two-day Ashes Test",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/mcc-boss-defends-curator-after-two-day-ashes-test/106182802",
          "published_at": "Sun, 28 Dec 2025 02:41:42 +0000",
          "title": "MCC boss defends curator Matt Page after two-day Ashes Test",
          "standfirst": "MCC boss Stuart Fox staunchly defends chief curator Matt Page after a wild Boxing Day Test finishes within two days.",
          "content": "MCC boss Stuart Fox staunchly defends chief curator Matt Page after a wild Boxing Day Test finishes within two days.",
          "feed_position": 16
        }
      ],
      "popularity_score": 136.42374083333334
    },
    {
      "id": "cluster_57",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 02:38:33 +0000",
      "title": "'Grumpy' seal disrupts summer boat race at popular holiday spot",
      "neutral_headline": "'Grumpy' seal disrupts summer boat race at popular holiday spot",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/grumpy-seal-blairgowrie-petersville-regatta/106182708",
          "published_at": "Sun, 28 Dec 2025 02:38:33 +0000",
          "title": "'Grumpy' seal disrupts summer boat race at popular holiday spot",
          "standfirst": "A wild seal dubbed \"Grumpy\" causes some commotion at an annual boat race on the Mornington Peninsula, outside Melbourne.",
          "content": "A wild seal dubbed \"Grumpy\" causes some commotion at an annual boat race on the Mornington Peninsula, outside Melbourne.",
          "feed_position": 23
        }
      ],
      "popularity_score": 136.37124083333333
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 02:02:39 +0000",
      "title": "Spanish soccer coach missing after tourist boat sinks in Komodo National Park",
      "neutral_headline": "Spanish soccer coach missing after tourist boat sinks in Komodo National Park",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-28/spanish-soccer-coach-missing-after-boat-sank-komodo-park/106182542",
          "published_at": "Sun, 28 Dec 2025 02:02:39 +0000",
          "title": "Spanish soccer coach missing after tourist boat sinks in Komodo National Park",
          "standfirst": "The Labuan Bajo port authority attributes the sinking to high waves of up to three metres, but rescuers say they are \"determined\" to find survivors.",
          "content": "The Labuan Bajo port authority attributes the sinking to high waves of up to three metres, but rescuers say they are \"determined\" to find survivors.",
          "feed_position": 24
        }
      ],
      "popularity_score": 135.7729075
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 01:35:38 +0000",
      "title": "Four Ecuadorian boys left home to play soccer. They were found beaten, naked and charred",
      "neutral_headline": "Four Ecuadorian boys left home to play soccer. They were...",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/guayaquil-four-sentence-lays-bare-racism-and-security-in-ecuador/106173084",
          "published_at": "Sun, 28 Dec 2025 01:35:38 +0000",
          "title": "Four Ecuadorian boys left home to play soccer. They were found beaten, naked and charred",
          "standfirst": "In the weeks before Christmas, four boys under 16 left home to play a game of soccer. Their forced disappearance at the hands of Ecuador's military has been labelled a national \"turning point\".",
          "content": "In the weeks before Christmas, four boys under 16 left home to play a game of soccer. Their forced disappearance at the hands of Ecuador's military has been labelled a national \"turning point\".",
          "feed_position": 21
        }
      ],
      "popularity_score": 135.32262972222222
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 01:28:57 +0000",
      "title": "Why getting more migrants to swim has benefits for all of Australian society",
      "neutral_headline": "Why getting more migrants to swim has benefits for all of Australian society",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/australia-migrant-communities-overrepresented-in-drownings/106097704",
          "published_at": "Sun, 28 Dec 2025 01:28:57 +0000",
          "title": "Why getting more migrants to swim has benefits for all of Australian society",
          "standfirst": "Despite wanting to learn how to swim, many from culturally and linguistically diverse communities — particularly adults — face three key barriers to participating.",
          "content": "Despite wanting to learn how to swim, many from culturally and linguistically diverse communities — particularly adults — face three key barriers to participating.",
          "feed_position": 20
        }
      ],
      "popularity_score": 135.21124083333333
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Sun, 28 Dec 2025 02:58:45 +0000",
      "title": "Man charged with Tim Picton assault granted bail",
      "neutral_headline": "Man charged with Tim Picton assault granted bail",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/tim-picton-family-statement-alleged-northbridge-assault/106182738",
          "published_at": "Sun, 28 Dec 2025 02:58:45 +0000",
          "title": "Man charged with Tim Picton assault granted bail",
          "standfirst": "A 20-year-old man is granted bail after allegedly assaulting Tim Picton, a prominent Labor Party identity — an attack police prosecutors say may leave him permanently disabled, if he survives.",
          "content": "A 20-year-old man is granted bail after allegedly assaulting Tim Picton, a prominent Labor Party identity — an attack police prosecutors say may leave him permanently disabled, if he survives.",
          "feed_position": 10
        }
      ],
      "popularity_score": 133.7079075
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Sat, 27 Dec 2025 22:16:50 +0000",
      "title": "Kennedy Center boss demands $1.5m damages after musician cancels show",
      "neutral_headline": "Kennedy Center boss demands $1.5m damages after musician cancels show",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/kennedy-centre-criticises-musician-cancelled-performance-rebrand/106182404",
          "published_at": "Sat, 27 Dec 2025 22:16:50 +0000",
          "title": "Kennedy Center boss demands $1.5m damages after musician cancels show",
          "standfirst": "Musician Chuck Redd cancelled his Christmas Eve show days after the White House announced the venue would be renamed the Trump Kennedy Center.",
          "content": "Musician Chuck Redd cancelled his Christmas Eve show days after the White House announced the venue would be renamed the Trump Kennedy Center.",
          "feed_position": 18
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Sat, 27 Dec 2025 21:41:22 +0000",
      "title": "Lily didn't want to be blind. Then she met others like herself",
      "neutral_headline": "Lily didn't want to be blind. Then she met others like herself",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/mentors-gave-me-confidence-to-navigate-life-with-a-disability/106169450",
          "published_at": "Sat, 27 Dec 2025 21:41:22 +0000",
          "title": "Lily didn't want to be blind. Then she met others like herself",
          "standfirst": "Other people with lived experience of blindness gave ABC reporter Nas Campanella the confidence to navigate life. Her mentee, Lily, is enjoying similar benefits.",
          "content": "Other people with lived experience of blindness gave ABC reporter Nas Campanella the confidence to navigate life. Her mentee, Lily, is enjoying similar benefits.",
          "feed_position": 15
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_70",
      "coverage": 1,
      "updated_at": "Sat, 27 Dec 2025 19:07:49 +0000",
      "title": "Steroid use is 'exploding' in Australia — but quitting is a lonely road",
      "neutral_headline": "Steroid use is 'exploding' in Australia — but quitting is a lonely road",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/steroid-use-increase-quit-guidelines-australia/106043898",
          "published_at": "Sat, 27 Dec 2025 19:07:49 +0000",
          "title": "Steroid use is 'exploding' in Australia — but quitting is a lonely road",
          "standfirst": "A rising number of Australians are using steroids. But one expert says a lack of knowledge and widespread stigma make it tough to get clinical support.",
          "content": "A rising number of Australians are using steroids. But one expert says a lack of knowledge and widespread stigma make it tough to get clinical support.",
          "feed_position": 19
        }
      ],
      "popularity_score": 133
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Sat, 27 Dec 2025 23:39:03 +0000",
      "title": "Why Trump could order more air strikes in Nigeria",
      "neutral_headline": "Why Trump could order more air strikes in Nigeria",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-28/trump-us-air-strikes-is-militants-nigeria/106181242",
          "published_at": "Sat, 27 Dec 2025 23:39:03 +0000",
          "title": "Why Trump could order more air strikes in Nigeria",
          "standfirst": "With US President Donald Trump hinting at plans for further strikes on IS militants in Nigeria, here's a rundown on what you need to know about the conflict.",
          "content": "With US President Donald Trump hinting at plans for further strikes on IS militants in Nigeria, here's a rundown on what you need to know about the conflict.",
          "feed_position": 24
        }
      ],
      "popularity_score": 130.37957416666666
    }
  ]
}