{
  "updated_at": "2026-01-30T19:31:53.974Z",
  "clusters": [
    {
      "id": "cluster_22",
      "coverage": 3,
      "updated_at": "Fri, 30 Jan 2026 18:00:00 +0000",
      "title": "Phones to run hot all weekend as Ley's opponents near point of no return",
      "neutral_headline": "Phones to run hot all weekend as Ley's opponents near point of no return",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-31/andrew-hastie-sussan-ley-angus-taylor-leadership/106288160",
          "published_at": "Fri, 30 Jan 2026 18:00:00 +0000",
          "title": "Phones to run hot all weekend as Ley's opponents near point of no return",
          "standfirst": "One Liberal source told the ABC a challenge to Sussan Ley's leadership is now a \"matter of when, not if\".",
          "content": "One Liberal source told the ABC a challenge to Sussan Ley's leadership is now a \"matter of when, not if\".",
          "feed_position": 3
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2026/jan/30/andrew-hastie-liberal-leadership-challenge-sussan-ley-angus-taylor-analysis",
          "published_at": "Fri, 30 Jan 2026 09:00:54 GMT",
          "title": "After feverish speculation, Andrew Hastie failed to mount a Liberal leadership challenge. So what now?",
          "standfirst": "Hastie’s allies are cautioning against assuming his supporters would automatically shift their allegiances to Angus TaylorGet our breaking news email, free app or daily news podcastWhat was the point of that then?That is the question some Liberals MPs – and no doubt some bemused voters – are asking after Andrew Hastie abandoned plans to challenge Sussan Ley for the party leadership after a week of feverish speculation. Continue reading...",
          "content": "Hastie’s allies are cautioning against assuming his supporters would automatically shift their allegiances to Angus TaylorGet our breaking news email, free app or daily news podcastWhat was the point of that then?That is the question some Liberals MPs – and no doubt some bemused voters – are asking after Andrew Hastie abandoned plans to challenge Sussan Ley for the party leadership after a week of feverish speculation. Continue reading...",
          "feed_position": 7
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/andrew-hastie-rules-out-challenging-opposition-leader-sussan-ley/855914b0-19a2-4c88-9f33-bc2b9b3006eb",
          "published_at": "Fri, 30 Jan 2026 08:55:10 +0000",
          "title": "Andrew Hastie says he will not fight to become Liberals leader",
          "standfirst": "A ndrew Hastie will not challenge Opposition Leader Sussan Ley for leadership of the Liberal Party next week.",
          "content": "Andrew Hastie will not challenge Opposition Leader Sussan Ley for leadership of the Liberal Party next week.The backbencher from Western Australia said in a statement today he would not contest the leadership of the Liberal Party, citing a lack of support from the rest of the party.The development paves the way for a challenge from senior Liberals figure Angus Taylor.READ MORE: Thousands of Aussies are receiving mystery ATO deposits. Here&#x27;s why \"Over the past few weeks there has been speculation about the future leadership of the Liberal Party of Australia,\" Hastie said.\"I&#x27;ve previously stated that I would welcome the opportunity to serve my party and our country as leader of the Liberal Party.\"But having consulted with colleagues over the past week and respecting their honest feedback to me, it is clear that I do not have the support needed to become leader of the Liberal Party.\"Hastie said he would continue to campaign on issues including immigration and energy.\"I believe that those families and our country are best served by a strong Coalition government,\" he said.\"I will continue to work every day to make my party the very best version of itself. \"READ MORE: PM strikes $25 billion health deal with states and territories at the 11th hour Hastie joined several of his Liberal colleagues, including Taylor, for a meeting yesterday before a memorial service for former colleague and federal MP Katie Allen in Melbourne.The Liberal figures were meant to discuss the next steps at the gathering but were unable to resolve which of them might step up should Ley be convinced to step down.Their mediator, Liberal frontbencher James Paterson, told ABC Radio he believed Ley still had the backing of her colleagues. \"In my assessment, Sussan continues to enjoy the support of the majorIty of the party room,\" he said.Shadow Treasurer Ted O&#x27;Brien and Nationals Senator Bridget McKenzie echoed Paterson&#x27;s sentiments.\"I don&#x27;t believe there will be a challenge next week,\" O&#x27;Brien said. \"I cannot see the spill motion getting up on Monday,\" McKenzie said. Last week&#x27;s Coalition break-up also triggered a crisis in the National Party with David Littleproud set to face a leadership challenge.NEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.Download the 9NEWS App here via Apple and Google PlayMake 9News your preferred source on Google by ticking this box hereSign up to our breaking newsletter here",
          "feed_position": 5,
          "image_url": "https://prod.static9.net.au/fs/008c950d-8d1b-473b-89ca-123a3f044c94"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2026/jan/30/andrew-hastie-rules-out-challenging-sussan-ley-liberal-leadership",
          "published_at": "Fri, 30 Jan 2026 07:15:18 GMT",
          "title": "Andrew Hastie rules out challenging Sussan Ley for Liberal leadership, clearing path for Angus Taylor",
          "standfirst": "Hastie concedes he does not have support needed to become leader, as source says it is a ‘question of when, not if’ Taylor will mount challengeGet our breaking news email, free app or daily news podcastAndrew Hastie has confirmed he won’t contest the Liberal party leadership, clearing the path for fellow rightwinger Angus Taylor to challenge Sussan Ley.After Hastie ended a week of a speculation with a statement on Friday that confirmed he would not seek the opposition leadership, a source close to Taylor said it was a “question of when, not if” the shadow defence minister will launch a formal bid to unseat Ley. Continue reading...",
          "content": "Hastie concedes he does not have support needed to become leader, as source says it is a ‘question of when, not if’ Taylor will mount challengeGet our breaking news email, free app or daily news podcastAndrew Hastie has confirmed he won’t contest the Liberal party leadership, clearing the path for fellow rightwinger Angus Taylor to challenge Sussan Ley.After Hastie ended a week of a speculation with a statement on Friday that confirmed he would not seek the opposition leadership, a source close to Taylor said it was a “question of when, not if” the shadow defence minister will launch a formal bid to unseat Ley. Continue reading...",
          "feed_position": 9
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/hastie-rules-out-challenge-to-sussan-ley/106287872",
          "published_at": "Fri, 30 Jan 2026 05:21:08 +0000",
          "title": "Hastie rules out challenge to Sussan Ley",
          "standfirst": "The West Australian backbencher had made no secret of his desire to lead the Liberal Party but says he will not run against Sussan Ley next week, a move which could pave the way for Angus Taylor.",
          "content": "The West Australian backbencher had made no secret of his desire to lead the Liberal Party but says he will not run against Sussan Ley next week, a move which could pave the way for Angus Taylor.",
          "feed_position": 11
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/008c950d-8d1b-473b-89ca-123a3f044c94",
      "popularity_score": 3018.4683405555556
    },
    {
      "id": "cluster_4",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 19:06:43 +0000",
      "title": "Djokovic hits out at critics after epic Australian Open win over Sinner",
      "neutral_headline": "Djokovic hits out at critics after epic Australian Open win over Sinner",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-31/australian-open-novak-djokovic-jannik-sinner-carlos-alcaraz/106289146",
          "published_at": "Fri, 30 Jan 2026 19:06:43 +0000",
          "title": "Djokovic hits out at critics after epic Australian Open win over Sinner",
          "standfirst": "After beating two-time defending Jannik Sinner in five gruelling sets, Novak Djokovic sets his sights on those who doubted whether he could still be an Australian Open contender.",
          "content": "After beating two-time defending Jannik Sinner in five gruelling sets, Novak Djokovic sets his sights on those who doubted whether he could still be an Australian Open contender.",
          "feed_position": 2
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/australian-open-day-13-live-blog-alcaraz-zverev-djokovic/106286224",
          "published_at": "Fri, 30 Jan 2026 00:39:44 +0000",
          "title": "Djokovic turns back the clock to reach Aus Open final with marathon win over Sinner",
          "standfirst": "Novak Djokovic will face Carlos Alcaraz in the Australian Open men's singles final after winning another epic semifinal against Jannik Sinner.",
          "content": "Novak Djokovic will face Carlos Alcaraz in the Australian Open men's singles final after winning another epic semifinal against Jannik Sinner.",
          "feed_position": 5
        }
      ],
      "popularity_score": 2019.580285
    },
    {
      "id": "cluster_17",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 18:23:00 +0000",
      "title": "Live: US official insists DOJ 'did not protect' Trump as new Epstein files released",
      "neutral_headline": "Millions more 'Epstein files' released by US government",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-31/three-million-jeffrey-epstein-files-released-by-us-doj-live-blog/106290612",
          "published_at": "Fri, 30 Jan 2026 18:23:00 +0000",
          "title": "Live: US official insists DOJ 'did not protect' Trump as new Epstein files released",
          "standfirst": "More than 2,000 videos and 180,000 images have been released as part of the batch, which comes weeks after a legally mandated deadline signed by Donald Trump. Follow live.",
          "content": "More than 2,000 videos and 180,000 images have been released as part of the batch, which comes weeks after a legally mandated deadline signed by Donald Trump. Follow live.",
          "feed_position": 3
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-31/more-epstein-files-released-by-us-department-of-justice/106021136",
          "published_at": "Fri, 30 Jan 2026 16:48:38 +0000",
          "title": "Millions more 'Epstein files' released by US government",
          "standfirst": "More than 2,000 videos and 180,000 images are included in the latest batch, which has been made public six weeks after the legal deadline for full disclosure.",
          "content": "More than 2,000 videos and 180,000 images are included in the latest batch, which has been made public six weeks after the legal deadline for full disclosure.",
          "feed_position": 0
        }
      ],
      "popularity_score": 2018.8516738888889
    },
    {
      "id": "cluster_31",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 17:17:48 +0000",
      "title": "Luigi Mangione will not face death penalty, judge rules",
      "neutral_headline": "Luigi Mangione will not face death penalty, judge rules",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/luigi-mangione-will-not-face-death-penalty-judge-rules/95306095-d1b4-4959-bc29-b06da0bb3fd8",
          "published_at": "Fri, 30 Jan 2026 17:17:48 +0000",
          "title": "Luigi Mangione will not face death penalty, judge rules",
          "standfirst": "Luigi Mangione will not face the death penalty for allegedly killing UnitedHealthcare CEO Brian Thompson in December 2024, a federal district judge ruled.",
          "content": "Luigi Mangione will not face the death penalty for allegedly killing UnitedHealthcare CEO Brian Thompson in December 2024, a federal district judge ruled on Friday, dealing a blow to US prosecutors who were adamant about pursuing the ultimate sentence.The judge dismissed the murder charge that would have made the 27-year-old eligible for the death penalty in his federal case because it requires that the killing was committed during another \"crime of violence\".Prosecutors alleged the other crimes of violence were represented by two stalking charges, arguing Mangione stalked Thompson online and travelled across state lines to carry out the killing.READ MORE: Brothers and parents found dead suspected double murder-suicide in Perth The judge disagreed, finding the stalking charges did not amount to \"crimes of violence\" and dismissed two counts in Mangione&#x27;s federal case – the murder charge and a related firearm offence.\"The analysis contained in the balance of this Opinion may strike the average person – and indeed many lawyers and judges – as tortured and strange, and the result may seem contrary to our intuitions about the criminal law,\" Judge Margaret Garnett wrote in her ruling. \"But it represents the Court&#x27;s committed effort to faithfully apply the dictates of the Supreme Court to the charges in this case.\"The ruling is a boon for Mangione and his attorneys, who had made several arguments to avoid the death penalty. And it&#x27;s sure to galvanise his many supporters, who see Mangione as an avatar for their resentment and anger towards the American health care system.In court Friday, an assistant US attorney indicated he did not yet know whether the Justice Department would appeal the judge&#x27;s ruling on the death penalty. Judge Garnett asked for an update by February 27.Garnett denied as moot the defence&#x27;s other motions regarding the death penalty. She said the only motion that may still be relevant in a non-capital case is regarding pre-trial publicity. She suggested the defence \"table that for now\" until prosecutors make a decision on appealing, and then they can renew that motion with a new brief at a later time.The murder charge was the only count in any of the cases brought against Mangione that could have carried a possible death sentence. He will still face two counts of stalking in the federal case. If convicted, those counts have a maximum sentence of life in prison without parole.Mangione also faces a second-degree murder count and other charges in a separate case in New York state, where the death penalty is unconstitutional. If convicted of the highest charges in the state case, Mangione could face a sentence of 25 years to life.Mangione also faces counts related to his arrest in a state case in Pennsylvania that are not death penalty eligible. He has pleaded not guilty to all the charges.US Attorney General Pam Bondi announced she had directed the Justice Department to pursue the death penalty in April 2025, calling the killing \"a premeditated, cold-blooded assassination that shocked America.\"Judge Margaret Garnett also ruled on Friday to allow into Mangione&#x27;s trial evidence recovered from his backpack at the time of his arrest.Law enforcement seized several items from Mangione&#x27;s backpack, including a handgun, a loaded magazine and a red notebook – key pieces of evidence that authorities have said tie him to the killing.The recovered gun is consistent with the firearm used to kill Thompson, federal authorities said in court filings. Some of the handwritten entries in the notebook \"express hostility towards the health insurance industry and wealthy executives in particular,\" they wrote.Mangione&#x27;s attorneys had argued for the evidence to be barred from trial, contending the search of their client&#x27;s backpack was illegal because they had not yet obtained a warrant and there was no immediate threat to justify a warrantless search.Federal prosecutors have argued in court filings that officials had a right to go through Mangione&#x27;s possessions as part of routine arrest procedures and to search for any weapons that could be a safety threat. Prosecutors have also said the evidence should be permitted since it would have inevitably been discovered legally during the course of the investigation.Jury selection for the federal trial is scheduled to begin on September 8, with opening statements starting on October 13.NEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.Download the 9NEWS App here via Apple and Google PlayMake 9News your preferred source on Google by ticking this box hereSign up to our breaking newsletter here",
          "feed_position": 2,
          "image_url": "https://prod.static9.net.au/fs/1269cf8f-9991-45f1-b5e8-41582261676c"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-31/luigi-mangione-murder-weapons-charges-dropped/106290600",
          "published_at": "Fri, 30 Jan 2026 16:03:25 +0000",
          "title": "Judge rules out death penalty for Mangione over healthcare CEO murder",
          "standfirst": "A judge in Manhattan has thrown out federal murder and weapons charges the 27-year-old had faced, saying they are not legally compatible with the other charges of stalking he faces.",
          "content": "A judge in Manhattan has thrown out federal murder and weapons charges the 27-year-old had faced, saying they are not legally compatible with the other charges of stalking he faces.",
          "feed_position": 4
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/1269cf8f-9991-45f1-b5e8-41582261676c",
      "popularity_score": 2017.7650072222223
    },
    {
      "id": "cluster_39",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 12:58:46 +0000",
      "title": "MP 'beyond angry' over death of brother in alleged one-punch attack",
      "neutral_headline": "MP 'beyond angry' over death of brother in alleged one-punch attack",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/chris-picton-first-interview-death-brother-tim-picton-coward-punch/f0b4e182-e196-478b-bf57-848a0e3ac8bd",
          "published_at": "Fri, 30 Jan 2026 12:58:46 +0000",
          "title": "MP 'beyond angry' over death of brother in alleged one-punch attack",
          "standfirst": "South Australian Health Minister Chris Picton has given his first interview since the death of his brother Tim after an alleged one-punch attack in Perth.",
          "content": "After 12 years in politics and countless media interviews, today marked Chris Picton&#x27;s toughest exchange.The South Australian health minister spoke publicly for the first time since his brother Tim Picton died from an alleged one-punch attack in Perth last month.\"Beyond angry as to what&#x27;s happened,\" Chris said of the incident.READ MORE: More human remains and clothes found in search for missing Belgian tourist\"The shock that we had on that Saturday morning, getting that phone call, still haunts me and my family to this day.\"Tim, 36, died in hospital after a three-week-long coma following the incident.\"It was unlikely that Tim was going to come back, but we were still obviously all hoping for a miracle,\" Chris said.The 20-year-old charged over the incident has been granted bail, angering the MP.\"I cannot believe that that happened and I think that was a very significant mistake,\" Chris said.Tim, who made a name for himself in Labor&#x27;s ranks as a talented political strategist, had a bright future ahead.\"The prime minister said he very easily, at the very least, could have been on the frontbench of federal parliament, and I strongly believe that,\" Chris said.He is survived by his wife Priya and their four-year-old daughter Charlotte.At a memorial for Tim last week, guests were asked to write their memories of Tim for Charlotte to read when she&#x27;s older.\"There&#x27;s a hole in our family that is never, ever going to be filled,\" Chris said.As for Chris, he tells 9News that despite the heartache, he&#x27;s committed to returning to state parliament should he be re-elected in March and wants to continue serving in the ministry.\"Going through some difficult personal experiences hopefully can make you a better representative, a better leader,\" Chris said.\"This is not the sort of thing that you get over, it&#x27;s the sort of thing that eventually you learn to live with.\"NEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.Download the 9NEWS App here via Apple and Google PlayMake 9News your preferred source on Google by ticking this box hereSign up to our breaking newsletter here",
          "feed_position": 8,
          "image_url": "https://prod.static9.net.au/fs/6de06864-a86b-4a4d-b955-67af606792f7"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/tim-picton-wanted-to-become-organ-donor-brother-chris-says/106282500",
          "published_at": "Fri, 30 Jan 2026 05:30:04 +0000",
          "title": "'Heartbreaking' that Tim Picton couldn't be organ donor, brother says",
          "standfirst": "In his first interview since the death of his brother Tim, SA's Health Minister Chris Picton reflects on the profound emotional impact of the loss on their family, his reluctance to watch the CCTV footage, and his brother's inability to become an organ donor \"because of the coronial process\".",
          "content": "In his first interview since the death of his brother Tim, SA's Health Minister Chris Picton reflects on the profound emotional impact of the loss on their family, his reluctance to watch the CCTV footage, and his brother's inability to become an organ donor \"because of the coronial process\".",
          "feed_position": 20
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/6de06864-a86b-4a4d-b955-67af606792f7",
      "popularity_score": 2013.447785
    },
    {
      "id": "cluster_41",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 11:44:45 +0000",
      "title": "More human remains and clothes found in search for missing Belgian tourist",
      "neutral_headline": "More human remains and clothes found in search for missing Belgian tourist",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/celine-cremer-more-human-remains-clothes-found-in-search-for-missing-belgian-tourist/53680cd0-b035-4121-9b32-6bf57cc07ddf",
          "published_at": "Fri, 30 Jan 2026 11:44:45 +0000",
          "title": "More human remains and clothes found in search for missing Belgian tourist",
          "standfirst": "Tasmanian police have discovered more human remains along with items of clothing, which they believe belonged to missing Belgian tourist Celine Cremer.",
          "content": "Tasmanian police have discovered more human remains along with items of clothing, which they believe belonged to missing Belgian tourist Celine Cremer.Cremer went missing in June 2023 but only on Wednesday were human remains discovered by a bushwalker searching the Philosopher Falls area.Police announced that today&#x27;s discovery - which included a bra and thermal top - was made along a section of the Arthur River near Waratah, about 2.5 kilometres from where the first bones were found.READ MORE: Brothers and parents found dead suspected double murder-suicide in Perth\"Today&#x27;s search resulted in the discovery of more bones, as well as clothing items – including a polar fleece jacket – that we believe are likely to belong to Celine,\" Commander Nathan Johnston said.\"As we&#x27;ve previously advised, formal forensic confirmation of identity will take time. However, the location and nature of the items found today indicate they are likely to be Celine&#x27;s.\"Our search team has continued to work into the early evening today, and the plan is for police to continue to methodologically search the area tomorrow.\"Johnston said Cremer&#x27;s family was being updated with the developments \"as sensitively and promptly as possible\".Local bushwalker Jarrod Boys made the initial discovery this week as part of ongoing efforts to locate Cremer , with a large number of volunteers continuing the search more than two years after she was first reported missing by family members.The massive independent effort was also documented on YouTube and it&#x27;s understood Boys joined the search after watching those videos. The teams also found Cremer&#x27;s phone in December.The 31-year-old was last seen in Waratah on June 17, 2023, and reported missing by her family on June 26, sparking a major search operation involving SES, drones and a helicopter.Cremer was believed to have gone on a bushwalk at Philosopher Falls, but didn&#x27;t return. Her empty white Honda CRV was found in a car park.Police believe she got lost trying to find her way back to her car. NEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.Download the 9NEWS App here via Apple and Google PlayMake 9News your preferred source on Google by ticking this box hereSign up to our breaking newsletter here",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/c4529fc9-1bca-40bc-a25b-85a0552d1bdd"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/line-search-for-celine-cremer-after-human-remains-found/106286024",
          "published_at": "Fri, 30 Jan 2026 01:19:50 +0000",
          "title": "More human remains, 'Celine Cremer's jacket' found in river search",
          "standfirst": "More human remains and a jacket believed to belong to missing backpacker Celine Cremer have been found in a search of Tasmania's Arthur River, police say.",
          "content": "More human remains and a jacket believed to belong to missing backpacker Celine Cremer have been found in a search of Tasmania's Arthur River, police say.",
          "feed_position": 7
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/c4529fc9-1bca-40bc-a25b-85a0552d1bdd",
      "popularity_score": 2012.2141738888888
    },
    {
      "id": "cluster_45",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 10:51:23 +0000",
      "title": "Brothers and parents found dead suspected double murder-suicide in Perth",
      "neutral_headline": "Brothers and parents found dead suspected double murder-suicide in Perth",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/mosman-park-police-responding-to-serious-incident-in-perths-western-suburbs/898dc3c9-5e90-4e51-acce-b400ac7553dd",
          "published_at": "Fri, 30 Jan 2026 10:51:23 +0000",
          "title": "Brothers and parents found dead suspected double murder-suicide in Perth",
          "standfirst": "Two teenage brothers are believed to have been killed by their parents in a double murder-suicide in Perth&#x27;s west.",
          "content": "Two teenage brothers are believed to have been killed by their parents in a double murder-suicide in Perth&#x27;s west.The bodies of Leon, 16, and Otis, 14, were found at the family&#x27;s Mosman Park home about 8.15am (AWST) today after a person known to the family became concerned for their welfare.The bodies of their parents, mother Mai, 49, and father Jarrod Clune, 50, were found in different parts of the property, along with a note, police said.READ MORE : Man killed after bulldozer rolls at Port of Brisbane worksiteTwo dogs and a cat were also found dead, police said.\"This is a highly distressing situation for all involved, from community members to the person who located the family to our first responders,\" Detective Acting Inspector Jessica Securo said. She said there was \"a note that was left at the premises, though I&#x27;m not able to go into the content of that letter\".\"It will form part of our investigation.\"Police have not revealed how the family or their animals died, but said it appeared there was no violence.\"There was no weapon used during this incident and the family have no reported family violence matters with police,\" Securo said.Police said they were aware that the children had experienced \"significant health challenges\".It&#x27;s understood the boys lived with severe autism and one was non-verbal.\"Although this investigation is in its infancy, police are investigating this matter as a murder-suicide,\" WA Police said.\"This tragic incident occurred only this morning and it will take time for police to investigate the circumstances.\"READ MORE: Three men charged over $1 million insurance fraudFriends of the couple told 9News they were shocked and said Mai and Jarrod were devoted parents.\"The boys were beautiful,\" one friend told 9News in a statement.Leon and Otis had attended Christ Church Grammar School. The principal today told the school community their thoughts and prayers were with family and friends.Securo urged anyone who felt affected by the tragedy to \"speak to your loved ones and get some help and assistance\". \"WA Police Force has engaged our health and welfare and support services for all our front-line staff who attended this incident,\" she said.Readers seeking support can contact Lifeline on 13 11 14, or beyond blue on 1300 22 4636.National Sexual Assault, Domestic Family Violence Counselling Service 1800RESPECT (1800 737 732).",
          "feed_position": 7,
          "image_url": "https://prod.static9.net.au/fs/c5eca4ed-781d-4dc4-9c19-ecb9c9e6dc2d"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/mosman-park-murder-suicide-four-people-dead/106287630",
          "published_at": "Fri, 30 Jan 2026 02:33:00 +0000",
          "title": "'Devastating tragedy': Perth family dead in suspected murder-suicide",
          "standfirst": "WA Police are investigating a suspected murder-suicide in suburban Perth after finding two teenage boys and two adults dead in a home in Mosman Park.",
          "content": "WA Police are investigating a suspected murder-suicide in suburban Perth after finding two teenage boys and two adults dead in a home in Mosman Park.",
          "feed_position": 9
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/c5eca4ed-781d-4dc4-9c19-ecb9c9e6dc2d",
      "popularity_score": 2011.3247294444445
    },
    {
      "id": "cluster_53",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 07:53:01 +0000",
      "title": "PM, premier announce extra $160m for bushfire-affected communities in Victoria",
      "neutral_headline": "PM, premier announce extra $160m for bushfire-affected communities in Victoria",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/victorian-bushfires-funding-anthony-albanese/db0198e5-3e15-43dd-b458-67e6de8177d9",
          "published_at": "Fri, 30 Jan 2026 07:53:01 +0000",
          "title": "PM, premier announce extra $160m for bushfire-affected communities in Victoria",
          "standfirst": "The funds will bring the total Commonwealth‑State Disaster Recovery Funding Arrangements for the fires to $329 million.",
          "content": "Prime Minister Anthony Albanese and Victorian Premier Jacinta Allan have announced an additional $158 million will go towards communities impacted by Victorian bushfires.Addressing the media from Victoria&#x27;s State Control Centre, Albanese announced the funds will bring the total Commonwealth‑State Disaster Recovery Funding Arrangements for the fires to $329 million.\"This includes funds for clean-up programs, for emergency recovery support programs, to support businesses, to support local government across a range of areas,\" Albanese said.READ MORE: Man arrested for allegedly impersonating FBI agent in foiled attempt to free Luigi Mangione\"In addition to that, money to help repair public land and waterways, money for recovery water tanks rebates, funding across the board where it&#x27;s needed.\"We want to make sure that people know the government will be there at difficult times.\"It is the second major funding announcement from the Prime Minister today, after Albanese struck a $25 billion deal to help fund public hospitals across the country.The announcement marks an expansion of a joint $171 million disaster recovery payment support package announced for fire-impacted communities earlier this month.Allan said the first funding stage addressed \"immediate relief\" measures including hardship payments, fodder, prolonged power outages and emergency accommodation funding.Today&#x27;s announcement would focus on the next phase of the fire recovery, Allan said.\"A significant component of this funding is focused on the clean-up, and a lead contractor has been appointed and will work with those communities on the clean-up,\" she said.Ongoing and additional mental health support and temporary accommodation would also be allocated from today&#x27;s package expansion. The Allan government will inject an extra $2 million for mental health services at schools within fire-affected areas. The Harcourt Cooperative Cool Store will receive a $500,000 cash splash to rebuild after fire tore through the facility.More than 95 businesses in Harcourt and the surrounding region relied on the facility to keep apples, pears, seed potatoes, wine, craft beer and beehives at temperature before it succumbed to fire.Affected individuals can call the Emergency Recovery Hotline on 1800 560 760READ MORE: Alleged Lone Wolf bikie associate one of two charged over woman&#x27;s kidnappingVictorian fire s claim more than 1550 structuresMore than 400,000 hectares of land has been scorched by bushfires over the last month alone.The fires have razed more than 1550 structures, Emergency Management Commissioner Tim Wiebusch said.More than 400 homes have been destroyed, including 320 houses flattened and 19 severely damaged in the Longwood fire. Crews were able to bring the Lake Barracoota, Rich River, Rocklands and Larralea blazes under control yesterday.\"In good news, we&#x27;ve gone from eight major fires now to four major fires that are still active at this time,\" Wiebusch said.That means the Longwood, Walwa , Carlisle River and Dargo/Wonnangatta fires are the only fires that continue to burn.READ MORE: Man who squirted vinegar on politician is charged with assaulting and intimidating herThe Longwood fire is now contained and hasn&#x27;t moved in recent days thanks to firefighter efforts.\"Both of [the Wonnangatta and Carlisle River] fires really won&#x27;t be safe until we see decent rain, and there&#x27;s no forecast rain in the near future,\" Wiebusch said.\"Both of those fires have remained in containment lines in recebt days and we&#x27;re hoping come early next week those fires may be deemed in fact contained.\"Four watch and acts warnings remain in place across the state, where it&#x27;s still deemed too unsafe to return to several communities in the Walwa and Carlisle River fire zones.Residents in Gellibrand, Lovat and sections of Carlisle River are unable to return to their properties due to fire danger from Carlisle River blaze, after they were evacuated on Tuesday.\"We are hopeful that over the weekend we will be able to get residents back into the Gellibrand communities,\" Wiebusch said.The Carlisle River blaze has destroyed nine homes and significantly damaged two others. Twenty-five outbuildings were also lost to the blaze. The Gellibrand community still doesn&#x27;t have access to safe drinking water after the fire \"badly impacted\" the town&#x27;s water treatment plant.Barwon Water has restored some water to Gellibrand for toilets and showers, and a potable water station has been set up .Walwa fire faces next test Three watch and act warnings remain in place over the Walwa fire zone. Those in Berringama, parts of Bullioh, Koetong, Lucyvale and Shelley, Bucheen Creek, Cravensville and parts of the southern end of the Nariel Valley and surrounds can&#x27;t go back to their properties near the Walwa bushfire either. READ MORE: Urgent safety warning issued over counterfeit melatonin sleep supplementsThe Walwa fire is expected to \"come under pressure\" in the next 24 hours with the arrival of increased winds and 40 degree temperatures, but crews hope to also bring that blaze under control early next week.Fourteen homes have been destroyed by the Walwa fire and two have been significantly damaged, in addition to 93 damaged or destroyed structures. Warnings have been reduced in areas surrounding the fire activity zones in recent days.A state of disaster remains in place across Victoria and the landscape remains very dry, Wiebusch said.Dry lightning forecast across Victoria on Saturday and early Sunday could pose a risk. \"We need the community to remain vigilant, if you do see flames or new fires start then please ring through to Triple Zero so we can get our fire crews onto them as soon as we can,\" Wiebusch said. NEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.Download the 9NEWS App here via Apple and Google PlayMake 9News your preferred source on Google by ticking this box hereSign up to our breaking newsletter here",
          "feed_position": 9,
          "image_url": "https://prod.static9.net.au/fs/dcfcb2ba-167f-412e-bd42-25c234dda098"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/bushfire-funding-albanese-allan/106288080",
          "published_at": "Fri, 30 Jan 2026 06:24:53 +0000",
          "title": "Bushfire-affected Victorian communities to get $160 million funding boost",
          "standfirst": "The state and federal governments will substantially increase financial support for 23 Victorian local government areas devastated by bushfires this month.",
          "content": "The state and federal governments will substantially increase financial support for 23 Victorian local government areas devastated by bushfires this month.",
          "feed_position": 24
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/dcfcb2ba-167f-412e-bd42-25c234dda098",
      "popularity_score": 2008.3519516666668
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 19:26:02 +0000",
      "title": "Mohammed is one of ten children to die from cold in Gaza this winter",
      "neutral_headline": "Mohammed is one of ten children to die from cold in Gaza this winter",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-31/children-in-gaza-are-dying-from-hypothermia/106282834",
          "published_at": "Fri, 30 Jan 2026 19:26:02 +0000",
          "title": "Mohammed is one of ten children to die from cold in Gaza this winter",
          "standfirst": "Mohammed died from hypothermia while in his mother's arms after a cold night in Gaza. His family are one of hundreds of thousands of Gazans enduring harsh winter conditions in flimsy tents across the enclave.",
          "content": "Mohammed died from hypothermia while in his mother's arms after a cold night in Gaza. His family are one of hundreds of thousands of Gazans enduring harsh winter conditions in flimsy tents across the enclave.",
          "feed_position": 0
        }
      ],
      "popularity_score": 352.90222944444446
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 19:21:09 +0000",
      "title": "Resident in bushfire zone left in 'blind panic' after mobile connection failures",
      "neutral_headline": "Resident in bushfire zone left in 'blind panic' after mobile connection failures",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-31/apple-iphone-telstra-connectivity-triple-zero-bushfire-emergency/106286194",
          "published_at": "Fri, 30 Jan 2026 19:21:09 +0000",
          "title": "Resident in bushfire zone left in 'blind panic' after mobile connection failures",
          "standfirst": "A resident in a bushfire zone says they were left in a \"blind panic\" after their mobile phone couldn't connect, as an advocate warns of more system failures if major changes aren't made.",
          "content": "A resident in a bushfire zone says they were left in a \"blind panic\" after their mobile phone couldn't connect, as an advocate warns of more system failures if major changes aren't made.",
          "feed_position": 1
        }
      ],
      "popularity_score": 350.82084055555555
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 13:48:34 +0000",
      "title": "Former CNN anchor Don Lemon arrested on charges related to anti-ICE protest",
      "neutral_headline": "Former CNN anchor Don Lemon arrested on charges related to anti-ICE protest",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-31/cnn-anchor-don-lemon-taken-into-custody/106290312",
          "published_at": "Fri, 30 Jan 2026 13:48:34 +0000",
          "title": "Former CNN anchor Don Lemon arrested on charges related to anti-ICE protest",
          "standfirst": "The arrest comes after Don Lemon live-streamed a demonstration that interrupted a church service in St Paul, Minnesota, earlier this month that protested President Donald Trump's immigration crackdown in the area.",
          "content": "The arrest comes after Don Lemon live-streamed a demonstration that interrupted a church service in St Paul, Minnesota, earlier this month that protested President Donald Trump's immigration crackdown in the area.",
          "feed_position": 1
        }
      ],
      "popularity_score": 337.277785
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 18:00:00 +0000",
      "title": "Trump's foreign policy bluffs undermine each other",
      "neutral_headline": "Trump's foreign policy bluffs undermine each other",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-31/donald-trump-iran-nuclear-foreign-policy-greeland-tariffs/106288164",
          "published_at": "Fri, 30 Jan 2026 18:00:00 +0000",
          "title": "Trump's foreign policy bluffs undermine each other",
          "standfirst": "As the US president faces domestic consequences for his violent immigration crackdown, his geopolitical bluffs across the world also come at a price.",
          "content": "As the US president faces domestic consequences for his violent immigration crackdown, his geopolitical bluffs across the world also come at a price.",
          "feed_position": 2
        }
      ],
      "popularity_score": 328.4683405555555
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 12:04:07 +0000",
      "title": "Trump nominates Kevin Warsh as new Fed chair",
      "neutral_headline": "Trump nominates Kevin Warsh as new Fed chair",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/trump-nominates-kevin-warsh-as-next-fed-chair/106290084",
          "published_at": "Fri, 30 Jan 2026 12:04:07 +0000",
          "title": "Trump nominates Kevin Warsh as new Fed chair",
          "standfirst": "Mr Warsh will replace current chair Jerome Powell when his term expires in May.",
          "content": "Mr Warsh will replace current chair Jerome Powell when his term expires in May.",
          "feed_position": 6
        }
      ],
      "popularity_score": 282.53695166666665
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 08:20:34 +0000",
      "title": "Gambling billionaire Laurence Escalante charged with family violence",
      "neutral_headline": "Gambling billionaire Laurence Escalante charged with family violence",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/gambling-billionaire-laurence-escalante-family-violence-offences/106289792",
          "published_at": "Fri, 30 Jan 2026 08:20:34 +0000",
          "title": "Gambling billionaire Laurence Escalante charged with family violence",
          "standfirst": "Australian online gambling billionaire Laurence Escalante has appeared in a Perth court, accused of a slew of family violence, drugs and burglary offences.",
          "content": "Australian online gambling billionaire Laurence Escalante has appeared in a Perth court, accused of a slew of family violence, drugs and burglary offences.",
          "feed_position": 8
        }
      ],
      "popularity_score": 261.81111833333335
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 11:24:26 +0000",
      "title": "Alcaraz prevails in ultimate match of margins as Aus Open delivers epic",
      "neutral_headline": "Alcaraz prevails in ultimate match of margins as Aus Open delivers epic",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/tennis-alcaraz-zverev-australian-open-semifinal-analysis/106289980",
          "published_at": "Fri, 30 Jan 2026 11:24:26 +0000",
          "title": "Alcaraz prevails in ultimate match of margins as Aus Open delivers epic",
          "standfirst": "The margins can prove to be razor-thin when it comes to the business end of grand slam tournaments. Carlos Alcaraz and Alexander Zverev found out firsthand in an all-time classic.",
          "content": "The margins can prove to be razor-thin when it comes to the business end of grand slam tournaments. Carlos Alcaraz and Alexander Zverev found out firsthand in an all-time classic.",
          "feed_position": 11
        }
      ],
      "popularity_score": 154.8755627777778
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 04:30:35 +0000",
      "title": "Why are FBI agents seizing boxes of 2020 election documents in Georgia?",
      "neutral_headline": "Why are FBI agents seizing boxes of 2020 election documents in Georgia",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/fbi-seizure-fulton-county-election-ballots-explainer/106286198",
          "published_at": "Fri, 30 Jan 2026 04:30:35 +0000",
          "title": "Why are FBI agents seizing boxes of 2020 election documents in Georgia?",
          "standfirst": "Fulton County, which votes overwhelmingly Democratic, has been a target of President Donald Trump since he narrowly lost the 2020 presidential election in Georgia to Democrat Joe Biden.",
          "content": "Fulton County, which votes overwhelmingly Democratic, has been a target of President Donald Trump since he narrowly lost the 2020 presidential election in Georgia to Democrat Joe Biden.",
          "feed_position": 21
        }
      ],
      "popularity_score": 149.97806277777778
    },
    {
      "id": "cluster_42",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 11:26:42 +0000",
      "title": "'I didn't like it': Zverev takes issue with Alcaraz injury timeout",
      "neutral_headline": "'I didn't like it': Zverev takes issue with Alcaraz injury timeout",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/zverev-avoids-alcaraz-medical-timeout-question-aus-open-semi/106290020",
          "published_at": "Fri, 30 Jan 2026 11:26:42 +0000",
          "title": "'I didn't like it': Zverev takes issue with Alcaraz injury timeout",
          "standfirst": "Alexander Zverev says he \"didn't like\" that Carlos Alcaraz was allowed a medical timeout for a cramp during their semifinal match.",
          "content": "Alexander Zverev says he \"didn't like\" that Carlos Alcaraz was allowed a medical timeout for a cramp during their semifinal match.",
          "feed_position": 10
        }
      ],
      "popularity_score": 144.91334055555555
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 10:23:28 +0000",
      "title": "Police investigating 'allegations involving a child' at Alice Springs childcare",
      "neutral_headline": "Police investigating 'allegations involving a child' at Alice Springs childcare",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/nt-police-investigating-alleged-alice-springs-childcare-incident/106289702",
          "published_at": "Fri, 30 Jan 2026 10:23:28 +0000",
          "title": "Police investigating 'allegations involving a child' at Alice Springs childcare",
          "standfirst": "The centre operator says staff have been stood down as police investigate an allegation made by the family of a child enrolled at one of its services.",
          "content": "The centre operator says staff have been stood down as police investigate an allegation made by the family of a child enrolled at one of its services.",
          "feed_position": 14
        }
      ],
      "popularity_score": 143.85945166666667
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 09:04:20 +0000",
      "title": "NSW man found guilty of sexually abusing children in WA's Kimberley",
      "neutral_headline": "NSW man found guilty of sexually abusing children in WA's Kimberley",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/gregory-carr-guilty-broome-child-sexual-abuse/106282220",
          "published_at": "Fri, 30 Jan 2026 09:04:20 +0000",
          "title": "NSW man found guilty of sexually abusing children in WA's Kimberley",
          "standfirst": "The 23-year-old man has been found guilty of indecently dealing with two girls in northern Western Australia.",
          "content": "The 23-year-old man has been found guilty of indecently dealing with two girls in northern Western Australia.",
          "feed_position": 13
        }
      ],
      "popularity_score": 142.54056277777778
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 07:17:07 +0000",
      "title": "Darwin Port deal 'true test' for Albanese as farmers fear more tariff pain",
      "neutral_headline": "Darwin Port deal 'true test' for Albanese as farmers fear more tariff pain",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/farmers-urge-careful-diplomacy-in-darwin-port-row-with-china/106288346",
          "published_at": "Fri, 30 Jan 2026 07:17:07 +0000",
          "title": "Darwin Port deal 'true test' for Albanese as farmers fear more tariff pain",
          "standfirst": "Industry groups that suffered three years of damaging Chinese trade tariffs on products including barley are appealing to the federal government to exercise careful diplomacy to defuse tensions with China over the ownership of Darwin Port.",
          "content": "Industry groups that suffered three years of damaging Chinese trade tariffs on products including barley are appealing to the federal government to exercise careful diplomacy to defuse tensions with China over the ownership of Darwin Port.",
          "feed_position": 19
        }
      ],
      "popularity_score": 140.75361833333332
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 05:50:45 +0000",
      "title": "Man jailed over antisemitic graffiti and arson fails to have sentence overturned",
      "neutral_headline": "Man jailed over antisemitic graffiti and arson fails to have sentence overturned",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/mohommed-farhat-to-stay-in-jail-antisemitic-graffiti-arson/106287870",
          "published_at": "Fri, 30 Jan 2026 05:50:45 +0000",
          "title": "Man jailed over antisemitic graffiti and arson fails to have sentence overturned",
          "standfirst": "Mohommed Farhat's lawyers were urging the court to overturn the sentence on appeal and replace it with an intensive correction order which could have seen him released.",
          "content": "Mohommed Farhat's lawyers were urging the court to overturn the sentence on appeal and replace it with an intensive correction order which could have seen him released.",
          "feed_position": 19
        }
      ],
      "popularity_score": 139.3141738888889
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 08:23:17 +0000",
      "title": "50C record for Port Augusta ahead of cool change",
      "neutral_headline": "50C record for Port Augusta ahead of cool change",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/temperature-change-sa-power-outages/106287992",
          "published_at": "Fri, 30 Jan 2026 08:23:17 +0000",
          "title": "50C record for Port Augusta ahead of cool change",
          "standfirst": "For the first time in four years, Australia has recorded temperatures in excess of 50C, with both locations in South Australia.",
          "content": "For the first time in four years, Australia has recorded temperatures in excess of 50C, with both locations in South Australia.",
          "feed_position": 15
        }
      ],
      "popularity_score": 138.8563961111111
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 05:13:26 +0000",
      "title": "Western nations decline to join 'Board of Peace' as Middle Eastern powers accept",
      "neutral_headline": "Western nations decline to join 'Board of Peace' as Middle Eastern powers accept",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/nz-refuses-trump-invitation-board-of-peace-gaza/106286460",
          "published_at": "Fri, 30 Jan 2026 05:13:26 +0000",
          "title": "Western nations decline to join 'Board of Peace' as Middle Eastern powers accept",
          "standfirst": "New Zealand has declined Donald Trump's invitation to join his Board of Peace and is calling for \"clarity\" over the proposal. Here's where other countries stand.",
          "content": "New Zealand has declined Donald Trump's invitation to join his Board of Peace and is calling for \"clarity\" over the proposal. Here's where other countries stand.",
          "feed_position": 18
        }
      ],
      "popularity_score": 138.69222944444445
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 04:51:14 +0000",
      "title": "Man whose girlfriend died from 'mixed drug toxicity' jailed",
      "neutral_headline": "Man whose girlfriend died from 'mixed drug toxicity' jailed",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/ethan-ross-jailed-for-giving-meth-to-girlfriend-amy-bowden/106286368",
          "published_at": "Fri, 30 Jan 2026 04:51:14 +0000",
          "title": "Man whose girlfriend died from 'mixed drug toxicity' jailed",
          "standfirst": "A man who injected his girlfriend with methamphetamine in the 24 hours before her sudden death has been jailed for just over nine months — but his sentence was backdated, meaning he will be eligible for release in May.",
          "content": "A man who injected his girlfriend with methamphetamine in the 24 hours before her sudden death has been jailed for just over nine months — but his sentence was backdated, meaning he will be eligible for release in May.",
          "feed_position": 23
        }
      ],
      "popularity_score": 138.32222944444445
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 07:02:43 +0000",
      "title": "Precious metal market crashes",
      "neutral_headline": "Precious metal market crashes",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-30/gold-silver-prices-drop-us-federal-reserve-chair-announcement/106289302",
          "published_at": "Fri, 30 Jan 2026 07:02:43 +0000",
          "title": "Precious metal market crashes",
          "standfirst": "Gold and silver prices have plummeted, sparked by reports US President Donald Trump is set to announce a new US Federal Reserve chair.",
          "content": "Gold and silver prices have plummeted, sparked by reports US President Donald Trump is set to announce a new US Federal Reserve chair.",
          "feed_position": 17
        }
      ],
      "popularity_score": 137.51361833333334
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 03:42:11 +0000",
      "title": "Why your sunscreen application might be putting your good intentions to waste",
      "neutral_headline": "Why your sunscreen application might be putting your good intentions to waste",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/how-often-should-you-be-reapplying-sunscreen-this-summer/106079324",
          "published_at": "Fri, 30 Jan 2026 03:42:11 +0000",
          "title": "Why your sunscreen application might be putting your good intentions to waste",
          "standfirst": "This is what three experts had to say about how to get the best protection from your sunscreen.",
          "content": "This is what three experts had to say about how to get the best protection from your sunscreen.",
          "feed_position": 13
        }
      ],
      "popularity_score": 137.1713961111111
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 03:02:49 +0000",
      "title": "The NDIS was set up to relieve families. For some, it now does the opposite",
      "neutral_headline": "The NDIS was set up to relieve families. For some, it now does the opposite",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/families-frayed-by-ndis-cuts-brace-for-more-change-in-2026/106269362",
          "published_at": "Fri, 30 Jan 2026 03:02:49 +0000",
          "title": "The NDIS was set up to relieve families. For some, it now does the opposite",
          "standfirst": "Families frayed by NDIS cuts are bracing for even more change ahead of a year that is set to reshape the scheme into something more sustainable, write Nas Campanella and Evan Young.",
          "content": "Families frayed by NDIS cuts are bracing for even more change ahead of a year that is set to reshape the scheme into something more sustainable, write Nas Campanella and Evan Young.",
          "feed_position": 12
        }
      ],
      "popularity_score": 136.515285
    },
    {
      "id": "cluster_70",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 01:11:01 +0000",
      "title": "Trump shares video of Alex Pretti confrontation with agents 11 days before shooting",
      "neutral_headline": "Trump shares video of Alex Pretti confrontation with agents 11 days before shooting",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/trump-shares-video-of-alex-pretti-confrontation/106286246",
          "published_at": "Fri, 30 Jan 2026 01:11:01 +0000",
          "title": "Trump shares video of Alex Pretti confrontation with agents 11 days before shooting",
          "standfirst": "United States President Donald Trump has shared a video on Truth Social showing Alex Pretti in a confrontation with federal immigration agents 11 days before the intensive care nurse was fatally shot during a separate encounter with Border Patrol agents.",
          "content": "United States President Donald Trump has shared a video on Truth Social showing Alex Pretti in a confrontation with federal immigration agents 11 days before the intensive care nurse was fatally shot during a separate encounter with Border Patrol agents.",
          "feed_position": 23
        }
      ],
      "popularity_score": 134.65195166666666
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 01:04:30 +0000",
      "title": "'Traditional media is dying': Nine sells radio stations for $56m",
      "neutral_headline": "'Traditional media is dying': Nine sells radio stations for $56m",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/nine-radio-sold-to-arthur-laundy-talk-radio-shrinking-audience/106286352",
          "published_at": "Fri, 30 Jan 2026 01:04:30 +0000",
          "title": "'Traditional media is dying': Nine sells radio stations for $56m",
          "standfirst": "Arthur Laundy's Laundy Family Office acquires a network that includes Melbourne's top-rating talk station 3AW, Sydney's 2GB and outspoken conservative presenters such as Ben Fordham and Tom Elliott.",
          "content": "Arthur Laundy's Laundy Family Office acquires a network that includes Melbourne's top-rating talk station 3AW, Sydney's 2GB and outspoken conservative presenters such as Ben Fordham and Tom Elliott.",
          "feed_position": 22
        }
      ],
      "popularity_score": 134.54334055555555
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 00:46:06 +0000",
      "title": "Australia taking Nipah virus seriously but no changes to border control",
      "neutral_headline": "Australia taking Nipah virus seriously but no changes to border control",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/nipah-virus-no-border-control-changes-australia/106286138",
          "published_at": "Fri, 30 Jan 2026 00:46:06 +0000",
          "title": "Australia taking Nipah virus seriously but no changes to border control",
          "standfirst": "The federal government is closely monitoring an outbreak of Nipah virus in India but has not received any advice to tighten border controls at this stage.",
          "content": "The federal government is closely monitoring an outbreak of Nipah virus in India but has not received any advice to tighten border controls at this stage.",
          "feed_position": 17
        }
      ],
      "popularity_score": 134.2366738888889
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 00:37:40 +0000",
      "title": "The US looks poised to strike Iran — but what is Trump's endgame?",
      "neutral_headline": "The US looks poised to strike Iran — but what is Trump's endgame",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/donald-trump-poised-to-strike-iran/106275390",
          "published_at": "Fri, 30 Jan 2026 00:37:40 +0000",
          "title": "The US looks poised to strike Iran — but what is Trump's endgame?",
          "standfirst": "As the \"massive armada\" of the United States approaches Iran to be in place for a possible military attack, a key question remains: what can such firepower actually achieve?",
          "content": "As the \"massive armada\" of the United States approaches Iran to be in place for a possible military attack, a key question remains: what can such firepower actually achieve?",
          "feed_position": 10
        }
      ],
      "popularity_score": 134.09611833333332
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 03:26:30 +0000",
      "title": "These 10 albums from 1996 changed music forever",
      "neutral_headline": "These 10 albums from 1996 changed music forever",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/albums-1996-30-years-weezer-fugees-you-am-i-spiderbait/106126108",
          "published_at": "Fri, 30 Jan 2026 03:26:30 +0000",
          "title": "These 10 albums from 1996 changed music forever",
          "standfirst": "From Weezer's raw emotion to the Spice Girls's pop revolution, revisit 10 iconic albums that made 1996 a landmark year in music. 30 years on, they still define the era.",
          "content": "From Weezer's raw emotion to the Spice Girls's pop revolution, revisit 10 iconic albums that made 1996 a landmark year in music. 30 years on, they still define the era.",
          "feed_position": 16
        }
      ],
      "popularity_score": 133.91000722222222
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 18:26:33 +0000",
      "title": "In following his own theory, man finds human remains that could be Celine Cremer’s",
      "neutral_headline": "In following his own theory, man finds human remains that could be Celine Cremer’s",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-30/celine-cremer-what-could-have-happened/106283120",
          "published_at": "Thu, 29 Jan 2026 18:26:33 +0000",
          "title": "In following his own theory, man finds human remains that could be Celine Cremer’s",
          "standfirst": "Celine Cremer went missing in 2023 from a track in a remote part of Tasmania's north-west. With several recent discoveries in the area, these are the theories of what could have happened.",
          "content": "Celine Cremer went missing in 2023 from a track in a remote part of Tasmania's north-west. With several recent discoveries in the area, these are the theories of what could have happened.",
          "feed_position": 20
        }
      ],
      "popularity_score": 133
    }
  ]
}