{
  "updated_at": "2025-09-10T23:16:33.671Z",
  "clusters": [
    {
      "id": "cluster_11",
      "coverage": 5,
      "updated_at": "Thu, 11 Sep 2025 09:01:14 +1000",
      "title": "‘Charlie Kirk is dead’: Prominent MAGA activist assassinated in university shooting",
      "neutral_headline": "Pro-Trump Personality Charlie Kirk Dead After Shooting on US College Campus",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/north-america/conservative-political-activist-charlie-kirk-shot-at-utah-university-20250911-p5mu3s.html",
          "published_at": "Thu, 11 Sep 2025 09:01:14 +1000",
          "title": "‘Charlie Kirk is dead’: Prominent MAGA activist assassinated in university shooting",
          "standfirst": "A suspect is in custody following a manhunt after the conservative political activist and fundraiser for the US president was shot dead while speaking at a university in Utah.",
          "content": "A suspect is in custody following a manhunt after the conservative political activist and fundraiser for the US president was shot dead while speaking at a university in Utah.",
          "feed_position": 5,
          "image_url": "https://static.ffx.io/images/$zoom_0.7821%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_47/t_crop_custom/q_86%2Cf_auto/f11ed1706459bb87dd923c59911aad230068a54631814ff9db6914b696b71b58"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/australia-news-live-trump-activist-shot-at-college-campus-sussan-ley-dismisses-jacinta-price-20250911-p5mu46.html",
          "published_at": "Thu, 11 Sep 2025 09:00:38 +1000",
          "title": "Australia news LIVE: Trump activist Charlie Kirk shot dead at college campus; Sussan Ley dismisses Jacinta Price from Coalition frontbench",
          "standfirst": "Follow live as we bring you the news from Australia and beyond.",
          "content": "Follow live as we bring you the news from Australia and beyond.",
          "feed_position": 6,
          "image_url": "https://static.ffx.io/images/$zoom_0.7821%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_47/t_crop_custom/q_86%2Cf_auto/f11ed1706459bb87dd923c59911aad230068a54631814ff9db6914b696b71b58"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/charlie-kirk-assassination-pro-trump-activist-media-personality-shot-dead/efa66348-ea8c-43a2-ae28-7f7ca5620ab0",
          "published_at": "Wed, 10 Sep 2025 22:50:51 +0000",
          "title": "LIVE: Trump ally shot from a 'long distance'",
          "standfirst": "The FBI said a suspect was in custody after conservative commentator Charlie Kirk was killed.",
          "content": "The FBI said a suspect was in custody after conservative commentator Charlie Kirk was killed.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/55fb0c56-757a-4ea9-8cb1-5a195f6f47c6"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/who-was-charlie-kirk-donald-trump-ally-shot-dead-utah-usa-united-states-assassination/32eb8691-40a0-46e0-a7f8-ba3588379dab",
          "published_at": "Wed, 10 Sep 2025 22:16:22 +0000",
          "title": "'Political kingmaker' leaves behind wife, two kids",
          "standfirst": "Kirk died doing what made him a potent political force — rallying the right on a college campus",
          "content": "Charlie Kirk, who rose from a teenage conservative campus activist to a top podcaster, culture warrior and ally of President Donald Trump, was shot and killed this morning during one of his trademark public appearances at a college in Utah.He was 31; Kirk was married to podcaster Erika Frantzve and they have two young children.Kirk died doing what made him a potent political force — rallying the right on a college campus, this time Utah Valley University. His shooting is one of an escalating number of attacks on political figures in the United States, from the assassination of a Democratic state lawmaker and her husband in Minnesota to last summer&#x27;s shooting of Trump, that have roiled the nation.LIVE UPDATES: Shooter still at large after pro-Trump activist Charlie Kirk assassinatedTrump announced Kirk&#x27;s death on his social media site, Truth Social: “No one understood or had the Heart of the Youth in the United States of America better than Charlie,” Trump wrote.Kirk personified the pugnacious, populist conservatism that has taken over the Republican Party in the age of Trump.He launched his organisation, Turning Point USA, in 2012, targeting younger people and venturing onto liberal-leaning college campuses where many GOP activists were nervous to tread.A backer of Trump during the president&#x27;s initial 2016 run, Kirk took Turning Point from one of a constellation of well-funded conservative groups to the centre of the right-of-centre universe.How did Charlie Kirk help Donald Trump get elected? Turning Point&#x27;s political wing helped run get-out-the-vote for Trump&#x27;s 2024 campaign, trying to energise disaffected conservatives who rarely vote.Trump won Arizona, Turning Point&#x27;s home state, by five percentage points after narrowly losing it in 2020. The group is known for its flamboyant events that often feature strobe lighting and pyrotechnics. It claims more than 250,000 student members.Trump praised Kirk, who started as an unofficial advisor during Trump&#x27;s 2016 campaign and more recently became a confidant. “He was a very, very good friend of mine and he was a tremendous person,” Trump told the New York Post.Kirk showed off an apocalyptic style in his popular podcast, radio show and on the campaign trail. During an appearance with Trump in Georgia last year, he said that Democrats “stand for everything God hates.” Kirk called the Trump vs. Kamala Harris choice “a spiritual battle.”READ MORE: Pro-Trump activist Charlie Kirk dead after shooting at event in US“This is a Christian state. I’d like to see it stay that way,” Kirk told the 10,000 or so Georgians, who at one point joined Kirk in a deafening chant of “Christ is King! Christ is King!”Kirk had also remained a regular presence on college campuses. Last year, for the social media program “Surrounded,” he faced off against 20 liberal college students to defend his viewpoints, including that abortion is murder and should be illegal.Charlie Kirk&#x27;s rise to prominence Turning Point was founded in suburban Chicago in 2012 by a then 18-year-old Kirk and William Montgomery, a Tea Party activist, to campaign on college campuses for low taxes and limited government. It was not an immediate success.But Kirk’s zeal for confronting liberals in academia eventually won over an influential set of conservative financiers.Despite early misgivings, Turning Point enthusiastically backed Trump after he clinched the GOP nomination in 2016. Kirk served as a personal aide to Donald Trump Jr., the former president’s eldest son, during the general election campaign.READ MORE: Boost for Australia as new security deal with Fiji in the worksSoon, Kirk was a regular presence on cable TV, where he leaned into the culture wars and heaped praise on the then-president. Trump and his son were equally effusive and often spoke at Turning Point conferences.As money poured in, Kirk bought a US$4.75 million ($7.18 million) Spanish-style estate on a gated Arizona country club. Turning Point steered millions of dollars to contractors owned by Kirk and his associates, and some Republicans were sceptical when it announced it would spearhead an attempt to turn out infrequent voters during Trump’s 2024 campaign.READ MORE: &#x27;Wrong thing to do&#x27;: Australia condemns Israeli attack on key mediator QatarBut as younger voters shifted right in 2024 and Trump ran up a five-point margin of victory in Arizona, Kirk and his allies claimed vindication of his view of a sharp-elbowed, culture-war-oriented conservatism.Kirk’s evangelical Christian beliefs were intertwined with his political perspective, and he argued that there was no true separation of church and state.He also referenced the Seven Mountain Mandate, which specifies seven areas where Christians are to lead — politics, religion, media, business, family, education and the arts, and entertainment.Kirk argued for a new conservatism that advocated for freedom of speech, challenging Big Tech and the media, and centring working-class Americans beyond the nation’s capital.“We have to ask ourselves a question as a conservative movement: Are we going to revert back to the party of the status quo ruling class?” he said in his speech opening the Conservative Political Action Conference in 2020.“Or are we going to learn from what I call the MAGA doctrine? The MAGA doctrine, which is a doctrine of American renewal, revival, one that America is the greatest country in the history of the world.”DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 7,
          "image_url": "https://prod.static9.net.au/fs/15b12d8a-45c4-4a84-ad05-bd65c7bf85ea"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/charlie-kirk-who-helped-build-support-for-donald-trump-dies/105760300",
          "published_at": "Wed, 10 Sep 2025 21:47:56 +0000",
          "title": "Who was Charlie Kirk, the conservative activist and Trump ally?",
          "standfirst": "Charlie Kirk rose from a teenage conservative campus activist to a top podcaster, culture warrior and ally of US President Donald Trump.",
          "content": "Charlie Kirk rose from a teenage conservative campus activist to a top podcaster, culture warrior and ally of US President Donald Trump.",
          "feed_position": 13
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/charlie-kirk-us-donald-trump-ally-activist-shot-at-rally-utah/d81b8b88-1838-49aa-bb87-0f04b19687ec",
          "published_at": "Wed, 10 Sep 2025 21:46:24 +0000",
          "title": "Pro-Trump personality Charlie Kirk dead after shooting on US college campus",
          "standfirst": "Charlie Kirk is one of the most prominent pro-Trump activists and conservative media personalities in the US.",
          "content": "Charlie Kirk, a conservative activist and close ally of US President Donald Trump, died Wednesday after being shot at a college event, Trump said.The co-founder and CEO of the youth organisation Turning Point USA, the 31-year-old Kirk is the latest victim in a spasm of political violence across the United States.Videos posted to social media from Utah Valley University show Kirk speaking into a handheld microphone while sitting under a white tent emblazoned with the slogans \"The American Comeback\" and \"Prove Me Wrong.\"LIVE UPDATES: Shooter still at large as hunt for Charlie Kirk&#x27;s gunman unfoldsREAD MORE: Who was Charlie Kirk? Political firebrand leaves behind wife, two kidsIN PICTURES: Terror, panic as shot rings out on Utah college campus A single shot rings out and Kirk can be seen reaching up with his right hand as a large volume of blood gushes from the left side of his neck.Stunned spectators are heard gasping and screaming before people start to run away. The AP was able to confirm the videos were taken at Sorensen Centre courtyard on the Utah Valley University campus.Charlie Kirk&#x27;s organisation, Turning Point USA, has announced his death in a note to employees and supporters.\"It&#x27;s with a heavy heart that we, the Turning Point USA leadership team, write to notify you that early this afternoon, Charlie went to his eternal reward with Jesus Christ in Heaven.\"A Turning Point USA official shared the note with CNN.READ MORE: Poland &#x27;facing enemy&#x27; as it shoots down Russian drones in its airspace A person who was taken into custody at Utah Valley University was not the suspect, according to a person familiar with the investigation who was not authorised to speak publicly.The mayor of Orem, Utah, David Young, says the shooting suspect remains at large.Authorities are not telling people to shelter in place.Kirk was speaking at a debate hosted by his nonprofit political organisation. The event had been met with divided opinions on campus.An online petition calling for university administrators to bar Kirk from appearing received nearly 1000 signatures.The university issued a statement last week citing First Amendment rights and affirming its \"commitment to free speech, intellectual inquiry, and constructive dialogue.\"Last week, Kirk posted on X images of news clips showing his visit to Utah colleges was sparking controversy. He wrote, \"What&#x27;s going on in Utah?\"READ MORE: Prince Harry reunites with his father, King CharlesThe college said a \"single shot\" had been fired at Kirk and a suspect was in custody.President Donald Trump paid tribute to Kirk on social media.\"The Great, and even Legendary, Charlie Kirk, is dead,\" he said.\"No one understood or had the Heart of the Youth in the United States of America better than Charlie.\"He was loved and admired by ALL, especially me, and now, he is no longer with us. Melania and my Sympathies go out to his beautiful wife Erika, and family. Charlie, we love you!\"He also ordered all US flags be lowered to half mast in Kirk&#x27;s honour. \"In honor of Charlie Kirk, a truly Great American Patriot, I am ordering all American Flags throughout the United States lowered to Half Mast until Sunday evening at 6 P.M,\" Trump wrote in a following Truth Social post.A host of Republican and Democratic elected officials earlier decried the shooting and offered prayers for Kirk on social media.Utah Governor Spencer Cox said he spoke to Trump following Kirk&#x27;s death.\"I just got off the phone with President Trump. Working with the FBI and Utah law enforcement, we will bring to justice the individual responsible for this tragedy,\" Cox wrote on X.\"Abby and I are heartbroken. We are praying for Charlie&#x27;s wife, daughter, and son,\" Cox added.The shooting comes amid a spike in political violence in the US across all parts of the ideological spectrum.READ MORE: New NASA Mars rover findings provide strongest hints yet of potential ancient lifeThe attacks include the assassination of a Minnesota state lawmaker and her husband at their house in June, the firebombing of a Colorado parade to demand Hamas release hostages, and a fire set at the house of Pennsylvania&#x27;s governor, who is Jewish, in April.The most notorious of these events is the shooting of Trump during a campaign rally last year.Former Utah congressman Jason Chaffetz, a Republican who was at the event, said in an interview on Fox News Channel that he heard one shot and saw Kirk go back.\"It seemed like it was a close shot,\" Chaffetz said, who seemed shaken as he spoke.He said there was a light police presence at the event and Kirk had some security but not enough.\"Utah is one of the safest places on the planet,\" he said.\"And so we just don&#x27;t have these types of things.\"Turning Point was founded in suburban Chicago in 2012 by Kirk, then 18, and William Montgomery, a Tea Party activist, to proselytise on college campuses for low taxes and limited government. It was not an immediate success.But Kirk&#x27;s zeal for confronting liberals in academia eventually won over an influential set of conservative financiers.Despite early misgivings, Turning Point enthusiastically backed Trump after he clinched the GOP nomination in 2016. Kirk served as a personal aide to Donald Trump Jr, the president&#x27;s eldest son, during the general election campaign.Soon, Kirk was a regular presence on cable TV, where he leaned into the culture wars and heaped praise on the then-president. Trump and his son were equally effusive and often spoke at Turning Point conferences. More to come.",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/709702ed-eedc-4562-a3ab-e92c5905e76a"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/north-america/who-was-charlie-kirk-the-maga-activist-and-turning-point-usa-founder-20250911-p5mu4a.html",
          "published_at": "Thu, 11 Sep 2025 07:31:39 +1000",
          "title": "Who was Charlie Kirk, the MAGA activist and Turning Point USA founder?",
          "standfirst": "He rose from teenage activist to top podcaster, culture warrior and ally of President Donald Trump, and died doing what made him a political force – rallying the right on a college campus.",
          "content": "He rose from teenage activist to top podcaster, culture warrior and ally of President Donald Trump, and died doing what made him a political force – rallying the right on a college campus.",
          "feed_position": 13,
          "image_url": "https://static.ffx.io/images/$zoom_0.403%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/e38ae4e08bf26affe2949afef9e21c3db3169b0a"
        },
        {
          "source": "Crikey",
          "url": "https://www.crikey.com.au/2025/09/11/jacinta-nampijinpa-price-dumped-charlie-kirk-shot-russia-poland-drones/",
          "published_at": "Wed, 10 Sep 2025 21:12:58 +0000",
          "title": "Sussan Ley boots Jacinta Nampijinpa Price from frontbench",
          "standfirst": "The opposition leader has unceremoniously dumped the NT senator to the backbench after she refused to back Ley's leadership, and Donald Trump ally Charlie Kirk has been shot dead at a Utah university. The post Sussan Ley boots Jacinta Nampijinpa Price from frontbench appeared first on Crikey.",
          "content": "The opposition leader has unceremoniously dumped the NT senator to the backbench after she refused to back Ley's leadership, and Donald Trump ally Charlie Kirk has been shot dead at a Utah university. The post Sussan Ley boots Jacinta Nampijinpa Price from frontbench appeared first on Crikey.",
          "feed_position": 0,
          "image_url": "https://www.crikey.com.au/wp-content/uploads/sites/3/2025/09/price.jpg?fit=1024%2C576"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/pro-trump-media-personality-charlie-kirk-dies-after-college-shooting-20250911-p5mu4l.html",
          "published_at": "Thu, 11 Sep 2025 07:11:43 +1000",
          "title": "Pro-Trump media personality Charlie Kirk dies after college shooting",
          "standfirst": "Prominent pro-Trump media personality Charlie Kirk has died after he was shot in the neck on a US college campus.",
          "content": "Prominent pro-Trump media personality Charlie Kirk has died after he was shot in the neck on a US college campus.",
          "feed_position": 15,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/a494f2fc750412fa35dfb4da8abe3adcb4db1902"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/charlie-kirk-shot-utah-university-event/105418226",
          "published_at": "Wed, 10 Sep 2025 19:08:11 +0000",
          "title": "Right-wing influencer Charlie Kirk shot dead at university event in Utah",
          "standfirst": "Donald Trump confirms Charlie Kirk has been shot dead in front of a crowd of horrified students, with the US president describing the conservative activist as a \"tremendous person\" and a \"very good friend\".",
          "content": "Donald Trump confirms Charlie Kirk has been shot dead in front of a crowd of horrified students, with the US president describing the conservative activist as a \"tremendous person\" and a \"very good friend\".",
          "feed_position": 0
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.7821%2C$multiply_0.3720%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_47/t_crop_custom/q_86%2Cf_auto/f11ed1706459bb87dd923c59911aad230068a54631814ff9db6914b696b71b58",
      "popularity_score": 5019.744536111111,
      "ai_summary": [
        "Conservative commentator Charlie Kirk was shot and killed at a university.",
        "A suspect is in custody following the shooting.",
        "Kirk was a prominent pro-Trump activist and media personality.",
        "Kirk was speaking at a university in Utah when he was shot.",
        "Kirk was the founder of Turning Point USA."
      ]
    },
    {
      "id": "cluster_27",
      "coverage": 3,
      "updated_at": "Thu, 11 Sep 2025 07:40:30 +1000",
      "title": "Prince Harry and King Charles reunite for first time in 18 months",
      "neutral_headline": "Prince Harry and King Charles Meet Face to Face",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/lifestyle/prince-harry-and-king-charles-reunite-for-first-time-in-18-months-20250911-p5mu4r.html",
          "published_at": "Thu, 11 Sep 2025 07:40:30 +1000",
          "title": "Prince Harry and King Charles reunite for first time in 18 months",
          "standfirst": "Royal Editor for the Daily Mirror, Russell Myers discusses Prince Harry and King Charles meeting for the first time in more than 18 months.",
          "content": "Royal Editor for the Daily Mirror, Russell Myers discusses Prince Harry and King Charles meeting for the first time in more than 18 months.",
          "feed_position": 11,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/213798e4e8bdba93af885d2eac4552e98ee1743d"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/lifestyle/king-charles-and-prince-harry-meet-face-to-face-20250911-p5mu49.html",
          "published_at": "Thu, 11 Sep 2025 06:25:27 +1000",
          "title": "King Charles and Prince Harry meet face to face",
          "standfirst": "King Charles and Prince Harry have reunited for tea in their first face to face encounter in over 18 months.",
          "content": "King Charles and Prince Harry have reunited for tea in their first face to face encounter in over 18 months.",
          "feed_position": 18,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/738557a3472114eebf293639b88183046423eb72"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/prince-harry-meets-with-the-king-during-london-visit/105760110",
          "published_at": "Wed, 10 Sep 2025 17:57:35 +0000",
          "title": "Prince Harry meets with King Charles during London visit",
          "standfirst": "The prince has been in the UK for the past week amid speculation of a meeting with his father.",
          "content": "The prince has been in the UK for the past week amid speculation of a meeting with his father.",
          "feed_position": 24
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/prince-harry-king-charles-meeting-cancer/77c06049-a8ec-4b1d-b036-190b0f02869e",
          "published_at": "Wed, 10 Sep 2025 17:39:32 +0000",
          "title": "Prince Harry reunites with his father, King Charles",
          "standfirst": "The royal pair have not seen each other for 19 months, despite Harry&#x27;s multiple trips to the UK for court cases and his father&#x27;s cancer diagnosis.",
          "content": "P rince Harry has met his father King Charles for the first time in more than 18 months on a solo trip to the UK.The King is having treatment for an undisclosed form of cancer. The royal pair have not seen each other for 19 months, despite Harry&#x27;s multiple trips to the UK for court cases from his new home in California, USA with his wife Meghan and their two children, Prince Archie, six and Princess Lilibet, four.READ MORE: Israel launches strikes in Yemen as EU chief seeks sanctions on Israel Buckingham Palace confirmed the meeting to UK media.But both men were seen arriving at the King&#x27;s official residence, Clarence House in London this afternoon, UK time.A palace source told The Telegraph the King enjoyed a private tea with the Duke which lasted 45 minutes.Prince Harry is in the UK for a series of charity engagements. King Charles had been at Balmoral Castle in Scotland for the summer but was seen returning to London.The prince has not seen his father since early 2024.Their relationship soured following &#x27;Megxit&#x27; when he opted to leave his role in the Royal family after his marriage to Meghan. However there have been reports of meetings between representatives of both sides.Speculation of a possible meeting between the father and son has been growing throughout Harry&#x27;s solo trip back to Britain.On Wednesday, the 40-year-old duke visited the Centre for Blast Injury Studies at Imperial College London.The last time that Charles and Harry spent time together was in February 2024 when the duke dashed back to Britain for a 30-minute meeting following the King&#x27;s shock cancer diagnosis.Harry, who is fifth in line to the throne, wasn&#x27;t able to see his father when he returned in April as Charles was on a state visit to Italy.However his estranged brother, Prince William, does not appear to be in London to meet Harry.He was in Cardiff, Wales today on an official visit.While no details have been given about the King&#x27;s cancer, the prince has indicated the situation could be severe.\"I would love a reconciliation with my family,\" he told BBC News in May.\"I don&#x27;t know how much longer my father has. He won&#x27;t speak to me because of this security stuff... but it would be nice to reconcile.\" In May Prince Harry lost his appeal challenging the UK government&#x27;s decision to strip him of his publicly funded security after he stepped away from royal family duties and moved to the US.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/24dbdd6a-9fc5-4f46-b8a0-f814089bd48e"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/213798e4e8bdba93af885d2eac4552e98ee1743d",
      "popularity_score": 3018.3989805555557,
      "ai_summary": [
        "Prince Harry and King Charles met for tea in London.",
        "The meeting was their first face-to-face encounter in over 18 months.",
        "Harry has been in the UK for the past week.",
        "The meeting occurred amid speculation of a meeting with his father."
      ]
    },
    {
      "id": "cluster_5",
      "coverage": 2,
      "updated_at": "Wed, 10 Sep 2025 23:04:22 +0000",
      "title": "Murdoch children 'pleased' family trust dispute is 'behind them'",
      "neutral_headline": "Murdoch Children 'Pleased' Family Trust Dispute Is 'Behind Them",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/murdoch-children-pleased-family-trust-dispute-is-behind-them/105760498",
          "published_at": "Wed, 10 Sep 2025 23:04:22 +0000",
          "title": "Murdoch children 'pleased' family trust dispute is 'behind them'",
          "standfirst": "James Murdoch, Elisabeth Murdoch and Prudence MacLeod say they are \"pleased\" to have reached an agreement to settle litigation over the Murdoch family trust, saying the issue is \"now behind them\".",
          "content": "James Murdoch, Elisabeth Murdoch and Prudence MacLeod say they are \"pleased\" to have reached an agreement to settle litigation over the Murdoch family trust, saying the issue is \"now behind them\".",
          "feed_position": 2
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/business/companies/pleased-the-matter-is-behind-them-murdoch-children-break-silence-over-family-deal-20250911-p5mu4u.html",
          "published_at": "Thu, 11 Sep 2025 08:10:12 +1000",
          "title": "‘Pleased the matter is behind them’: Murdoch children break silence over family deal",
          "standfirst": "Prudence MacLeod, Elisabeth Murdoch and James Murdoch have spoken out after the multibillion-dollar settlement that ended the long-running family dispute.",
          "content": "Prudence MacLeod, Elisabeth Murdoch and James Murdoch have spoken out after the multibillion-dollar settlement that ended the long-running family dispute.",
          "feed_position": 9,
          "image_url": "https://static.ffx.io/images/$zoom_0.3849007407407407%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_414%2C$y_16/t_crop_custom/q_86%2Cf_auto/65d8cb4776f2123b64b3bff67b7d68f5a7d9842f57db010d2e94e65aa2810aeb"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.3849007407407407%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_414%2C$y_16/t_crop_custom/q_86%2Cf_auto/65d8cb4776f2123b64b3bff67b7d68f5a7d9842f57db010d2e94e65aa2810aeb",
      "popularity_score": 2019.7967583333334,
      "ai_summary": [
        "James Murdoch, Elisabeth Murdoch, and Prudence MacLeod spoke about the settlement.",
        "They expressed their satisfaction that the family dispute is resolved.",
        "The settlement ended the long-running litigation over the Murdoch family trust."
      ]
    },
    {
      "id": "cluster_3",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 23:07:30 +0000",
      "title": "King Charles hosts SA premier, who 'would love' royal visit at climate summit",
      "neutral_headline": "King Charles Hosts SA Premier, Who 'Would Love' Royal Visit at Climate Summit",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/king-charles-hosts-meeting-with-sa-premier-peter-malinauskas/105760222",
          "published_at": "Wed, 10 Sep 2025 23:07:30 +0000",
          "title": "King Charles hosts SA premier, who 'would love' royal visit at climate summit",
          "standfirst": "SA Premier Peter Malinauskas meets with the sovereign on an official visit to the United Kingdom, during which he also signs an agreement with nuclear reactor manufacturer Rolls-Royce regarding the AUKUS submarine agreement.",
          "content": "SA Premier Peter Malinauskas meets with the sovereign on an official visit to the United Kingdom, during which he also signs an agreement with nuclear reactor manufacturer Rolls-Royce regarding the AUKUS submarine agreement.",
          "feed_position": 0
        }
      ],
      "popularity_score": 360.84898055555556,
      "ai_summary": [
        "South Australian Premier Peter Malinauskas met with King Charles.",
        "The meeting was part of an official visit to the United Kingdom.",
        "Malinauskas signed an agreement with Rolls-Royce regarding AUKUS.",
        "The Premier expressed interest in a royal visit at a climate summit."
      ]
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 23:06:20 +0000",
      "title": "Ten years on, traditional owner says agreements better than legislation",
      "neutral_headline": "Traditional Owners Celebrate Native Title Determination Anniversary",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/heritage-protection-top-priority-for-pilbara-traditional-owners/105748362",
          "published_at": "Wed, 10 Sep 2025 23:06:20 +0000",
          "title": "Ten years on, traditional owner says agreements better than legislation",
          "standfirst": "The traditional owners of Juukan Gorge have celebrated 10 years of native title determination and shared plans to safeguard heritage sites.",
          "content": "The traditional owners of Juukan Gorge have celebrated 10 years of native title determination and shared plans to safeguard heritage sites.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.8295361111111,
      "ai_summary": [
        "Juukan Gorge traditional owners marked a decade of native title determination.",
        "They shared plans to protect heritage sites within the area.",
        "Agreements are preferred over legislation, according to the traditional owners.",
        "The celebration highlighted the progress made in land management.",
        "The event underscored the importance of Indigenous heritage preservation."
      ]
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 20:02:30 +0000",
      "title": "This Poland attack tells us Putin has no plans to do a peace deal",
      "neutral_headline": "This Poland attack tells us Putin has no plans to do a peace deal",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/poland-drone-attack-shows-putin-no-peace-plans-any-time-soon/105760108",
          "published_at": "Wed, 10 Sep 2025 20:02:30 +0000",
          "title": "This Poland attack tells us Putin has no plans to do a peace deal",
          "standfirst": "If you thought a ceasefire between Russia and Ukraine was within reach — as Donald Trump has suggested — let the events in Poland this week be a wake-up call: it's not.",
          "content": "If you thought a ceasefire between Russia and Ukraine was within reach — as Donald Trump has suggested — let the events in Poland this week be a wake-up call: it's not.",
          "feed_position": 1
        }
      ],
      "popularity_score": 339.7656469444444,
      "ai_summary": [
        "The events in Poland this week suggest a ceasefire is not within reach.",
        "Donald Trump had suggested a ceasefire between Russia and Ukraine was possible.",
        "The attack serves as a wake-up call regarding the conflict's trajectory.",
        "The situation indicates a lack of immediate plans for peace negotiations.",
        "The incident highlights the ongoing challenges in the Russia-Ukraine conflict."
      ]
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 19:36:33 +0000",
      "title": "What's left of Hamas after nearly two years of fighting with Israel?",
      "neutral_headline": "What's left of Hamas after nearly two years of fighting with Israel?",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/what-is-left-of-hamas-after-nearly-two-years-of-fighting-israel/105759734",
          "published_at": "Wed, 10 Sep 2025 19:36:33 +0000",
          "title": "What's left of Hamas after nearly two years of fighting with Israel?",
          "standfirst": "Since October 7, 2023 Hamas has lost its most senior leaders and military organisation, but two years in, it has preserved some capacity to keep fighting Israeli troops and remain the dominant force inside Gaza.",
          "content": "Since October 7, 2023 Hamas has lost its most senior leaders and military organisation, but two years in, it has preserved some capacity to keep fighting Israeli troops and remain the dominant force inside Gaza.",
          "feed_position": 2
        }
      ],
      "popularity_score": 329.3331469444444,
      "ai_summary": [
        "Hamas has lost senior leaders and military organization since October 7, 2023.",
        "The group has preserved some capacity to continue fighting Israeli troops.",
        "Hamas remains the dominant force within the Gaza Strip.",
        "The conflict has significantly impacted Hamas's leadership structure.",
        "Despite losses, Hamas maintains a presence in the ongoing conflict."
      ]
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 23:03:27 +0000",
      "title": "Child's death after car plunges into NSW dam probed by police",
      "neutral_headline": "Police Investigate Child's Death After Car Crash in NSW",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/girl-11-dies-after-car-crashes-into-dam-near-tenterfield/105760480",
          "published_at": "Wed, 10 Sep 2025 23:03:27 +0000",
          "title": "Child's death after car plunges into NSW dam probed by police",
          "standfirst": "Officers investigate the death of an 11-year-old girl pulled unresponsive from a dam following a car crash in the state's New England region on Wednesday.",
          "content": "Officers investigate the death of an 11-year-old girl pulled unresponsive from a dam following a car crash in the state's New England region on Wednesday.",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.78148055555556,
      "ai_summary": [
        "Police are investigating the death of an 11-year-old girl.",
        "The girl was found unresponsive after a car crash.",
        "The crash occurred in a dam in New South Wales.",
        "Emergency services were called to the scene.",
        "Authorities are probing the circumstances surrounding the incident."
      ]
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 18:54:07 +0000",
      "title": "Allegations of suspected $3m fraud rock IVF industry",
      "neutral_headline": "Allegations of suspected $3m fraud rock IVF industry",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/fertility-society-suspects-fraud-by-former-contractor/105748762",
          "published_at": "Wed, 10 Sep 2025 18:54:07 +0000",
          "title": "Allegations of suspected $3m fraud rock IVF industry",
          "standfirst": "Shocking allegations of suspected embezzlement at the fertility industry's peak body have been revealed just days before Australia's health ministers meet to decide the future of how the organisation self-regulates the IVF sector.",
          "content": "Shocking allegations of suspected embezzlement at the fertility industry's peak body have been revealed just days before Australia's health ministers meet to decide the future of how the organisation self-regulates the IVF sector.",
          "feed_position": 3
        }
      ],
      "popularity_score": 318.62592472222224,
      "ai_summary": [
        "Allegations of embezzlement have surfaced within the IVF industry's peak body.",
        "The alleged fraud is estimated to involve $3 million.",
        "The revelations occurred shortly before a health ministers' meeting.",
        "The meeting will decide the future of IVF sector self-regulation.",
        "The allegations have raised concerns about financial practices."
      ]
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 23:02:22 +0000",
      "title": "Man shot by police charged with attempted murder and arson",
      "neutral_headline": "Man Charged with Attempted Murder and Arson After Shooting",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/qld-wynnum-west-police-shooting-attempted-murder-arson/105760374",
          "published_at": "Wed, 10 Sep 2025 23:02:22 +0000",
          "title": "Man shot by police charged with attempted murder and arson",
          "standfirst": "Emergency services were called to Cabanda Street in Wynnum West on Tuesday morning where they found the two-storey house on fire.",
          "content": "Emergency services were called to Cabanda Street in Wynnum West on Tuesday morning where they found the two-storey house on fire.",
          "feed_position": 4
        }
      ],
      "popularity_score": 312.763425,
      "ai_summary": [
        "A man was shot by police in Wynnum West, Queensland.",
        "He has been charged with attempted murder and arson.",
        "Emergency services responded to a house fire on Cabanda Street.",
        "The two-storey house was found ablaze.",
        "The incident is under investigation by authorities."
      ]
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 18:50:06 +0000",
      "title": "Gaming addiction 'devastates' families, but this clinic is helping them recover",
      "neutral_headline": "Gaming addiction 'devastates' families, but this clinic is helping them recover",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/video-game-addiction-clinic-fiona-stanley-hospital/105758590",
          "published_at": "Wed, 10 Sep 2025 18:50:06 +0000",
          "title": "Gaming addiction 'devastates' families, but this clinic is helping them recover",
          "standfirst": "With gaming disorders estimated to affect hundreds of thousands nationwide, an Australian first clinic at Fiona Stanley Hospital is helping people who struggle to control their use to turn their lives around.",
          "content": "With gaming disorders estimated to affect hundreds of thousands nationwide, an Australian first clinic at Fiona Stanley Hospital is helping people who struggle to control their use to turn their lives around.",
          "feed_position": 4
        }
      ],
      "popularity_score": 308.5589802777778,
      "ai_summary": [
        "Gaming disorders are estimated to affect hundreds of thousands nationwide.",
        "An Australian clinic at Fiona Stanley Hospital is helping people.",
        "The clinic assists individuals struggling with gaming addiction.",
        "It aims to help people regain control of their lives.",
        "The clinic is the first of its kind in Australia."
      ]
    },
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:52:28 +0000",
      "title": "'Jacinta will be back', says senior Liberal after Ley sacks Nampijinpa Price",
      "neutral_headline": "Jacinta will be back', says senior Liberal after Ley sacks Nampijinpa Price",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/jacinta-nampijinpa-price-liberals-react-sacking/105760472",
          "published_at": "Wed, 10 Sep 2025 22:52:28 +0000",
          "title": "'Jacinta will be back', says senior Liberal after Ley sacks Nampijinpa Price",
          "standfirst": "Liberal allies of senator Jacinta Nampijinpa Price say she will return to a prominent role in time despite her spectacular sacking from the shadow ministry. But, they say it was the right call to dump her.",
          "content": "Liberal allies of senator Jacinta Nampijinpa Price say she will return to a prominent role in time despite her spectacular sacking from the shadow ministry. But, they say it was the right call to dump her.",
          "feed_position": 5
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/federal-politics-live-september-11/105759138",
          "published_at": "Wed, 10 Sep 2025 20:58:32 +0000",
          "title": "Live: Nampijinpa Price vows to speak up from backbench after sacking",
          "standfirst": "Liberal senator Jacinta Nampijinpa Price has vowed to speak up from the backbench after being dumped from the shadow ministry yesterday. Follow live.",
          "content": "Liberal senator Jacinta Nampijinpa Price has vowed to speak up from the backbench after being dumped from the shadow ministry yesterday. Follow live.",
          "feed_position": 20
        }
      ],
      "popularity_score": 302.598425,
      "ai_summary": [
        "Liberal allies believe Senator Jacinta Nampijinpa Price will return to prominence.",
        "They believe her sacking from the shadow ministry was the correct decision.",
        "Senator Price has vowed to speak up from the backbench.",
        "She was dumped from the shadow ministry.",
        "The situation has caused internal debate within the Liberal party."
      ]
    },
    {
      "id": "cluster_13",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:47:40 +0000",
      "title": "Police arrest major player in Victoria's illegal tobacco trade",
      "neutral_headline": "Police arrest major player in Victoria's illegal tobacco trade",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/melbourne-illegal-tobacco-arrest/105760448",
          "published_at": "Wed, 10 Sep 2025 22:47:40 +0000",
          "title": "Police arrest major player in Victoria's illegal tobacco trade",
          "standfirst": "Police say a 49-year-old North Coburg man was behind the importation of millions of dollars worth of illegal tobacco, supplying dozens of tobacco stores.",
          "content": "Police say a 49-year-old North Coburg man was behind the importation of millions of dollars worth of illegal tobacco, supplying dozens of tobacco stores.",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.518425,
      "ai_summary": [
        "Police arrested a 49-year-old man from North Coburg.",
        "The man is accused of importing illegal tobacco.",
        "He allegedly supplied dozens of tobacco stores.",
        "The illegal tobacco is worth millions of dollars.",
        "The investigation targeted the illegal tobacco trade in Victoria."
      ]
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 09:42:40 +0000",
      "title": "Sacking Jacinta Nampijinpa Price was Sussan Ley's only option, and she took it",
      "neutral_headline": "Sacking Jacinta Nampijinpa Price was Sussan Ley's only option, and she took it",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-10/analysis-jacinta-nampijinpa-price-sacked-by-sussan-ley/105759688",
          "published_at": "Wed, 10 Sep 2025 09:42:40 +0000",
          "title": "Sacking Jacinta Nampijinpa Price was Sussan Ley's only option, and she took it",
          "standfirst": "Comments about Indian migrants were one thing, but refusing to back in her leader made it impossible for her to stay.",
          "content": "Comments about Indian migrants were one thing, but refusing to back in her leader made it impossible for her to stay.",
          "feed_position": 5
        }
      ],
      "popularity_score": 289.4350913888889,
      "ai_summary": [
        "Sussan Ley's decision to sack Jacinta Nampijinpa Price was necessary.",
        "Price's comments about Indian migrants were a factor.",
        "Her refusal to support the leader made her position untenable.",
        "The situation led to the decision to remove her from the shadow ministry.",
        "The move reflects internal party dynamics and leadership challenges."
      ]
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 18:56:10 +0000",
      "title": "Economists warn Labor has little hope of finding consensus on company tax",
      "neutral_headline": "Economists warn Labor has little hope of finding consensus on company tax",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/labor-company-tax-reform-little-prospect-of-consensus/105759764",
          "published_at": "Wed, 10 Sep 2025 18:56:10 +0000",
          "title": "Economists warn Labor has little hope of finding consensus on company tax",
          "standfirst": "Prime Minister Anthony Albanese has told business leaders he is open to reforming the tax to boost investment in a \"fair and affordable\" way, but there is no agreement on a clear way forward.",
          "content": "Prime Minister Anthony Albanese has told business leaders he is open to reforming the tax to boost investment in a \"fair and affordable\" way, but there is no agreement on a clear way forward.",
          "feed_position": 6
        }
      ],
      "popularity_score": 288.6600913888889,
      "ai_summary": [
        "Economists are skeptical about Labor's ability to agree on company tax.",
        "Prime Minister Albanese is open to tax reform to boost investment.",
        "There is no consensus on how to proceed with tax reform.",
        "The government aims to make tax changes \"fair and affordable\".",
        "The issue highlights challenges in achieving economic policy consensus."
      ]
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 19:53:25 +0000",
      "title": "South Korea's skincare innovation attracts shoppers and Australian brands",
      "neutral_headline": "South Korea's skincare innovation attracts shoppers and Australian brands",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/the-rise-of-k-beauty-as-australia-market-size-swells/105753808",
          "published_at": "Wed, 10 Sep 2025 19:53:25 +0000",
          "title": "South Korea's skincare innovation attracts shoppers and Australian brands",
          "standfirst": "Once considered niche, K-beauty products are now everywhere — from luxury department stores to local pharmacies and even supermarkets. It is one of the fastest-growing sectors in the Australian cosmetics landscape.",
          "content": "Once considered niche, K-beauty products are now everywhere — from luxury department stores to local pharmacies and even supermarkets. It is one of the fastest-growing sectors in the Australian cosmetics landscape.",
          "feed_position": 7
        }
      ],
      "popularity_score": 279.6142580555556,
      "ai_summary": [
        "K-beauty products are gaining popularity in Australia.",
        "They are available in various retail locations, including supermarkets.",
        "The K-beauty sector is one of the fastest-growing in Australia.",
        "It was once considered a niche market.",
        "The trend reflects changing consumer preferences."
      ]
    },
    {
      "id": "cluster_57",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 19:00:00 +0000",
      "title": "Albanese government about to settle on Australia's 2035 climate target",
      "neutral_headline": "Albanese government about to settle on Australia's 2035 climate target",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/albanese-government-settle-australia-climate-target-2035/105745500",
          "published_at": "Wed, 10 Sep 2025 19:00:00 +0000",
          "title": "Albanese government about to settle on Australia's 2035 climate target",
          "standfirst": "Anthony Albanese has long argued being serious on climate change is the \"entry fee\" for credibility in the Pacific.",
          "content": "Anthony Albanese has long argued being serious on climate change is the \"entry fee\" for credibility in the Pacific.",
          "feed_position": 9
        }
      ],
      "popularity_score": 278.7239802777778,
      "ai_summary": [
        "The Albanese government is finalizing Australia's 2035 climate target.",
        "Anthony Albanese views climate action as essential for credibility.",
        "The government is focused on its climate change commitments.",
        "The target will shape Australia's environmental policies.",
        "The decision reflects the government's priorities on climate change."
      ]
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 20:12:00 +0000",
      "title": "Police say 13,500 prisoners escaped custody during deadly Nepal riots",
      "neutral_headline": "Police say 13,500 prisoners escaped custody during deadly Nepal riots",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/nepal-army-retakes-control-of-kathmandu-after-riots/105760022",
          "published_at": "Wed, 10 Sep 2025 20:12:00 +0000",
          "title": "Police say 13,500 prisoners escaped custody during deadly Nepal riots",
          "standfirst": "After days of deadly riots that killed at least 30 people, a relative calm has been restored in Kathmandu as the army begins negotiations with protest organisers over what happens next.",
          "content": "After days of deadly riots that killed at least 30 people, a relative calm has been restored in Kathmandu as the army begins negotiations with protest organisers over what happens next.",
          "feed_position": 8
        }
      ],
      "popularity_score": 269.9239802777778,
      "ai_summary": [
        "Approximately 13,500 prisoners escaped during deadly riots in Nepal.",
        "The riots resulted in at least 30 fatalities.",
        "Calm has been restored in Kathmandu after the unrest.",
        "The army is negotiating with protest organizers.",
        "The situation highlights the impact of the riots on the prison system."
      ]
    },
    {
      "id": "cluster_18",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:11:18 +0000",
      "title": "'Sky's the limit' for Claudia Hollingsworth at World Athletics Championships",
      "neutral_headline": "Sky's the limit' for Claudia Hollingsworth at World Athletics Championships",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/claudia-hollingsworth-world-athletics-championship/105756644",
          "published_at": "Wed, 10 Sep 2025 22:11:18 +0000",
          "title": "'Sky's the limit' for Claudia Hollingsworth at World Athletics Championships",
          "standfirst": "National record holder, Claudia Hollingsworth knows that the sky is the limit on her career. With a superstition for jellybeans before each race, the Australian star is ready to take on the World Athletics Championships in Tokyo.",
          "content": "National record holder, Claudia Hollingsworth knows that the sky is the limit on her career. With a superstition for jellybeans before each race, the Australian star is ready to take on the World Athletics Championships in Tokyo.",
          "feed_position": 9
        }
      ],
      "popularity_score": 261.9123138888889,
      "ai_summary": [
        "Claudia Hollingsworth is competing at the World Athletics Championships.",
        "She holds the national record in her event.",
        "Hollingsworth believes her potential is unlimited.",
        "She has a pre-race superstition involving jellybeans.",
        "The event is taking place in Tokyo."
      ]
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:09:28 +0000",
      "title": "Heavy rain, flash flooding and powerful winds wreak havoc in Sydney",
      "neutral_headline": "Sydney experiences heavy rain, flash flooding, and strong winds",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/nsw-wild-weather-rain-winds-hits-sydney/105760168",
          "published_at": "Wed, 10 Sep 2025 22:09:28 +0000",
          "title": "Heavy rain, flash flooding and powerful winds wreak havoc in Sydney",
          "standfirst": "Severe weather has wreaked havoc across the state with intense rain stranding light rail passengers in Randwick and causing a roof collapse near Penrith overnight.",
          "content": "Severe weather has wreaked havoc across the state with intense rain stranding light rail passengers in Randwick and causing a roof collapse near Penrith overnight.",
          "feed_position": 10
        }
      ],
      "popularity_score": 165.88175833333332,
      "ai_summary": [
        "Intense rain stranded light rail passengers in Randwick, Sydney.",
        "A roof collapsed near Penrith overnight due to severe weather.",
        "The state experienced heavy rain, flash flooding, and powerful winds.",
        "The severe weather caused widespread disruption across the state.",
        "The incidents highlight the impact of extreme weather events."
      ]
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:17:39 +0000",
      "title": "Harris says allowing Biden to seek re-election was 'recklessness'",
      "neutral_headline": "Kamala Harris calls Biden's re-election bid \"recklessness",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/kamala-harris-says-joe-biden-2024-election-bid-reckless/105760214",
          "published_at": "Wed, 10 Sep 2025 21:17:39 +0000",
          "title": "Harris says allowing Biden to seek re-election was 'recklessness'",
          "standfirst": "In an excerpt from her forthcoming book, Kamala Harris says it was reckless to allow former US president Joe Biden to decide to seek re-election in 2024 but she felt she could not advise her boss not to run.",
          "content": "In an excerpt from her forthcoming book, Kamala Harris says it was reckless to allow former US president Joe Biden to decide to seek re-election in 2024 but she felt she could not advise her boss not to run.",
          "feed_position": 15
        }
      ],
      "popularity_score": 163.01814694444445,
      "ai_summary": [
        "Kamala Harris's forthcoming book excerpt criticizes Biden's re-election decision.",
        "Harris felt she could not advise Biden against seeking re-election in 2024.",
        "She describes allowing Biden to run again as \"recklessness\".",
        "The book excerpt provides insight into the dynamics within the administration.",
        "The comments offer a rare glimpse into internal political considerations."
      ]
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 19:55:30 +0000",
      "title": "Australia's Nepalese community backs anti-government protests",
      "neutral_headline": "Australian Nepalese community supports anti-government protests",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/australia-nepalese-community-vigil-anti-government-protest/105756944",
          "published_at": "Wed, 10 Sep 2025 19:55:30 +0000",
          "title": "Australia's Nepalese community backs anti-government protests",
          "standfirst": "The frustrations with Nepal's government spill beyond the country's borders, with the diaspora in Australia taking to the streets to express solidarity.",
          "content": "The frustrations with Nepal's government spill beyond the country's borders, with the diaspora in Australia taking to the streets to express solidarity.",
          "feed_position": 16
        }
      ],
      "popularity_score": 161.64898027777778,
      "ai_summary": [
        "The Nepalese diaspora in Australia is protesting against Nepal's government.",
        "Protests reflect frustrations with the Nepalese government's policies.",
        "The protests are taking place in Australia to show solidarity.",
        "The diaspora is expressing support for those protesting in Nepal.",
        "The protests highlight the global reach of political discontent."
      ]
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:01:43 +0000",
      "title": "Live: ASX set to drop after Wall Street's S&P 500 reaches record highs",
      "neutral_headline": "ASX set to drop after Wall Street's S&P 500 reaches record highs",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/asx-markets-business-live-news-september-11-/105760268",
          "published_at": "Wed, 10 Sep 2025 21:01:43 +0000",
          "title": "Live: ASX set to drop after Wall Street's S&P 500 reaches record highs",
          "standfirst": "The local share market is set to drop when trading resumes. Meanwhile, Wall Street's S&P 500 has closed at record highs. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
          "content": "The local share market is set to drop when trading resumes. Meanwhile, Wall Street's S&P 500 has closed at record highs. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
          "feed_position": 17
        }
      ],
      "popularity_score": 160.7525913888889,
      "ai_summary": [
        "The local share market is expected to drop upon trading resumption.",
        "Wall Street's S&P 500 closed at record highs recently.",
        "Business reporters will provide insights on the ABC News live markets blog.",
        "The day's events and market trends will be closely followed.",
        "The market's performance reflects global economic conditions."
      ]
    },
    {
      "id": "cluster_25",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:41:25 +0000",
      "title": "The little-known Sydney funeral venue where bookings are hard to come by",
      "neutral_headline": "The little-known Sydney funeral venue where bookings are hard to come by",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/demand-for-open-air-funerals-in-sydney/105749790",
          "published_at": "Wed, 10 Sep 2025 21:41:25 +0000",
          "title": "The little-known Sydney funeral venue where bookings are hard to come by",
          "standfirst": "With Sydney grappling with the need for more burial plots, the city's funeral industry is also presented with a new problem — a lack of open-air funeral venues.",
          "content": "With Sydney grappling with the need for more burial plots, the city's funeral industry is also presented with a new problem — a lack of open-air funeral venues.",
          "feed_position": 14
        }
      ],
      "popularity_score": 157.41425833333332,
      "ai_summary": [
        "Sydney faces a shortage of burial plots, impacting the funeral industry.",
        "There is a lack of open-air funeral venues in Sydney.",
        "The funeral industry is grappling with new challenges.",
        "The venue's limited availability creates booking difficulties.",
        "The situation highlights the strain on funeral services."
      ]
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:53:51 +0000",
      "title": "Dry and dusty sports clubs offer solace to drought-stricken towns",
      "neutral_headline": "Sports clubs offer solace to drought-stricken towns in South Australia",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/what-sport-clubs-do-in-near-constant-drought/105731438",
          "published_at": "Wed, 10 Sep 2025 21:53:51 +0000",
          "title": "Dry and dusty sports clubs offer solace to drought-stricken towns",
          "standfirst": "In SA's Flinders Ranges ovals, golf courses and race tracks help people forget about drought for a brief time, even when they are also dry.",
          "content": "In SA's Flinders Ranges ovals, golf courses and race tracks help people forget about drought for a brief time, even when they are also dry.",
          "feed_position": 22
        }
      ],
      "popularity_score": 156.62148055555556,
      "ai_summary": [
        "Dry and dusty sports clubs provide respite in drought-stricken towns.",
        "Flinders Ranges ovals, golf courses, and race tracks offer temporary relief.",
        "These venues help people forget about the drought for a short time.",
        "The clubs provide a sense of normalcy during difficult times.",
        "The situation highlights the impact of drought on communities."
      ]
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:34:53 +0000",
      "title": "Brisbane man charged with terrorism offences",
      "neutral_headline": "Brisbane man charged with terrorism offences by police",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/qld-terror-charges-the-gap-afp-qps-asio/105760476",
          "published_at": "Wed, 10 Sep 2025 22:34:53 +0000",
          "title": "Brisbane man charged with terrorism offences",
          "standfirst": "Police allegedly found violent extremist material linked to a proscribed terror organisation during a search of the 18-year-old's property.",
          "content": "Police allegedly found violent extremist material linked to a proscribed terror organisation during a search of the 18-year-old's property.",
          "feed_position": 14
        }
      ],
      "popularity_score": 155.30536944444444,
      "ai_summary": [
        "Police charged an 18-year-old Brisbane man with terrorism offences.",
        "Violent extremist material was allegedly found on the man's property.",
        "The material was linked to a proscribed terror organization.",
        "The investigation is ongoing, and further details are awaited.",
        "The case highlights the threat of extremism."
      ]
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 19:58:12 +0000",
      "title": "'I'll walk with you': Mitch Brown's message to next queer AFL player",
      "neutral_headline": "Mitch Brown's message to next queer AFL player",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/mitch-brown-message-to-next-queer-afl-player/105759044",
          "published_at": "Wed, 10 Sep 2025 19:58:12 +0000",
          "title": "'I'll walk with you': Mitch Brown's message to next queer AFL player",
          "standfirst": "When AFL player Mitch Brown openly came out as the first bisexual man in AFL history, he wasn't expecting the guilt that followed. While the 36-year-old has \"no regrets\", he admits he's disappointed by the lack of support from some within the AFL.",
          "content": "When AFL player Mitch Brown openly came out as the first bisexual man in AFL history, he wasn't expecting the guilt that followed. While the 36-year-old has \"no regrets\", he admits he's disappointed by the lack of support from some within the AFL.",
          "feed_position": 11
        }
      ],
      "popularity_score": 154.69398027777777,
      "ai_summary": [
        "Mitch Brown, the first openly bisexual AFL player, reflects on his experience.",
        "Brown admits to feeling guilt after coming out.",
        "He expresses disappointment at the lack of support from some in the AFL.",
        "Brown has \"no regrets\" about his decision to come out.",
        "He offers support to future queer AFL players."
      ]
    },
    {
      "id": "cluster_16",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:30:09 +0000",
      "title": "Banksy mural of judge beating protester scrubbed off from London court",
      "neutral_headline": "Banksy mural of judge beating protester removed from London court",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/banksy-mural-of-judge-beating-protester-scrubbed-off-in-london/105760478",
          "published_at": "Wed, 10 Sep 2025 22:30:09 +0000",
          "title": "Banksy mural of judge beating protester scrubbed off from London court",
          "standfirst": "A painting depicting a judge beating a protester on the outside of a heritage London courthouse is removed two days after going up.",
          "content": "A painting depicting a judge beating a protester on the outside of a heritage London courthouse is removed two days after going up.",
          "feed_position": 20
        }
      ],
      "popularity_score": 152.22648055555555,
      "ai_summary": [
        "A Banksy mural was removed from a London courthouse.",
        "The mural depicted a judge beating a protester.",
        "The artwork was removed two days after its appearance.",
        "The mural was located on the outside of a heritage courthouse.",
        "The removal raises questions about art and public space."
      ]
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 22:05:31 +0000",
      "title": "WA's other goldfields are so bright they can be seen from space",
      "neutral_headline": "WA's other goldfields are so bright they can be seen from space",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/satellite-images-show-wa-canola-fields-visible-from-space/105739264",
          "published_at": "Wed, 10 Sep 2025 22:05:31 +0000",
          "title": "WA's other goldfields are so bright they can be seen from space",
          "standfirst": "Stunning photos of Western Australia's canola crops can be seen in much of the countryside, on social media and in satellite images.",
          "content": "Stunning photos of Western Australia's canola crops can be seen in much of the countryside, on social media and in satellite images.",
          "feed_position": 11
        }
      ],
      "popularity_score": 151.815925,
      "ai_summary": [
        "Stunning photos of Western Australia's canola crops are visible.",
        "The crops are visible in satellite images and on social media.",
        "The canola fields are a vibrant sight across the countryside.",
        "The images showcase the beauty of the WA landscape.",
        "The phenomenon highlights the scale of agricultural production."
      ]
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:41:09 +0000",
      "title": "Vuelta a España time trial stage cut by half over safety reasons",
      "neutral_headline": "Vuelta a España time trial stage cut by half over safety reasons",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/vuelta-a-espana-cuts-time-trial-stage-short-protests/105760290",
          "published_at": "Wed, 10 Sep 2025 21:41:09 +0000",
          "title": "Vuelta a España time trial stage cut by half over safety reasons",
          "standfirst": "Organisers have shortened Thursday's individual time trial and are set to embark on the largest public security deployment in Madrid since 2022 in order to protect riders and protesters on the weekend's final stages.",
          "content": "Organisers have shortened Thursday's individual time trial and are set to embark on the largest public security deployment in Madrid since 2022 in order to protect riders and protesters on the weekend's final stages.",
          "feed_position": 15
        }
      ],
      "popularity_score": 151.4098138888889,
      "ai_summary": [
        "Organizers shortened the individual time trial stage.",
        "The decision was made due to safety concerns.",
        "The largest public security deployment since 2022 is planned.",
        "The deployment will protect riders and protesters.",
        "The final stages will take place over the weekend."
      ]
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:14:46 +0000",
      "title": "Premier coy on whether alleged war crimes raised with Israel ambassador",
      "neutral_headline": "Premier coy on whether alleged war crimes raised with Israel ambassador",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/roger-cook-meeting-israeli-ambassador-amir-maimon/105752728",
          "published_at": "Wed, 10 Sep 2025 21:14:46 +0000",
          "title": "Premier coy on whether alleged war crimes raised with Israel ambassador",
          "standfirst": "WA's premier refuses to say whether he raised war crime allegations with Israel's ambassador to Australia when the pair met, amid growing international concern about the provision of aid in Gaza.",
          "content": "WA's premier refuses to say whether he raised war crime allegations with Israel's ambassador to Australia when the pair met, amid growing international concern about the provision of aid in Gaza.",
          "feed_position": 19
        }
      ],
      "popularity_score": 150.97009138888887,
      "ai_summary": [
        "WA's premier did not confirm if war crimes were discussed.",
        "The premier met with Israel's ambassador to Australia.",
        "International concern exists regarding aid in Gaza.",
        "The premier's response reflects sensitivity around the issue.",
        "The meeting took place amid ongoing international scrutiny."
      ]
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 21:00:00 +0000",
      "title": "Individual emitters triggered otherwise 'impossible' heatwaves: study",
      "neutral_headline": "Individual emitters triggered otherwise 'impossible' heatwaves: study",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/science/2025-09-11/heatwaves-more-likely-climate-change-nature-major-emitters/105747138",
          "published_at": "Wed, 10 Sep 2025 21:00:00 +0000",
          "title": "Individual emitters triggered otherwise 'impossible' heatwaves: study",
          "standfirst": "Emissions from the 180 biggest carbon polluters directly contributed half of the total increase in heatwave intensity between the late 1800s and this century, a new study found.",
          "content": "Emissions from the 180 biggest carbon polluters directly contributed half of the total increase in heatwave intensity between the late 1800s and this century, a new study found.",
          "feed_position": 19
        }
      ],
      "popularity_score": 150.72398027777777,
      "ai_summary": [
        "A new study examined the impact of carbon polluters.",
        "The 180 biggest emitters contributed to heatwave intensity.",
        "They directly contributed half of the increase since the 1800s.",
        "The study highlights the role of individual emitters.",
        "The findings underscore the impact of climate change."
      ]
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 20:48:43 +0000",
      "title": "New electric ute sparks interest on farms but diesel still dominates",
      "neutral_headline": "New electric ute sparks interest on farms but diesel still dominates",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/new-ford-electric-ute-will-farmers-use-ev/105747446",
          "published_at": "Wed, 10 Sep 2025 20:48:43 +0000",
          "title": "New electric ute sparks interest on farms but diesel still dominates",
          "standfirst": "The Ford F150 Lightning is being touted as the first viable EV for farm work, but it comes with a hefty price tag.",
          "content": "The Ford F150 Lightning is being touted as the first viable EV for farm work, but it comes with a hefty price tag.",
          "feed_position": 21
        }
      ],
      "popularity_score": 150.53592472222223,
      "ai_summary": [
        "The Ford F150 Lightning is being promoted as an EV for farm work.",
        "The electric ute has generated interest among farmers.",
        "The vehicle comes with a significant price tag.",
        "Diesel-powered vehicles remain dominant on farms.",
        "The situation reflects the transition to electric vehicles."
      ]
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 20:43:02 +0000",
      "title": "'I love winning things': Ange vows to take Forest back to the top",
      "neutral_headline": "I love winning things': Ange vows to take Forest back to the top",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/ange-postecoglou-nottingham-forest-back-to-rightful-place/105760224",
          "published_at": "Wed, 10 Sep 2025 20:43:02 +0000",
          "title": "'I love winning things': Ange vows to take Forest back to the top",
          "standfirst": "Nottingham Forest fans have been made a promise by Ange Postecoglou that he'll give his all to help them bring back their glory days.",
          "content": "Nottingham Forest fans have been made a promise by Ange Postecoglou that he'll give his all to help them bring back their glory days.",
          "feed_position": 21
        }
      ],
      "popularity_score": 150.4412025,
      "ai_summary": [
        "Ange Postecoglou promised to help Nottingham Forest succeed.",
        "He wants to bring back the glory days for the team.",
        "Postecoglou expressed his love for winning.",
        "He is committed to achieving success with the team.",
        "The fans have been promised his full dedication."
      ]
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 20:32:12 +0000",
      "title": "NT police officer assaulted Aboriginal man in wheelchair, court rules",
      "neutral_headline": "Police officer assaulted Aboriginal man, court rules",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/nt-court-finds-police-assaulted-aboriginal-man-in-wheelchair/105741238",
          "published_at": "Wed, 10 Sep 2025 20:32:12 +0000",
          "title": "NT police officer assaulted Aboriginal man in wheelchair, court rules",
          "standfirst": "Body-worn video footage played to the Darwin Local Court captures a loud thud as an Aboriginal man with a disability is dropped into a police wagon, drawing an audible gasp from another officer.",
          "content": "Body-worn video footage played to the Darwin Local Court captures a loud thud as an Aboriginal man with a disability is dropped into a police wagon, drawing an audible gasp from another officer.",
          "feed_position": 23
        }
      ],
      "popularity_score": 150.26064694444443,
      "ai_summary": [
        "Body-worn video showed an officer dropping a disabled Aboriginal man into a police wagon.",
        "The incident occurred in Darwin, Australia, and was captured on video footage.",
        "The court heard the sound of a loud thud during the incident.",
        "Another officer in the video audibly gasped at the action.",
        "The court ruled on the incident based on the presented evidence."
      ]
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 20:25:21 +0000",
      "title": "SA mum slams health authorities for 'irresponsible' handling of algal bloom advice",
      "neutral_headline": "Mother criticizes handling of algal bloom advice",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-11/sa-mum-calls-for-stronger-algal-bloom-health-advice/105759034",
          "published_at": "Wed, 10 Sep 2025 20:25:21 +0000",
          "title": "SA mum slams health authorities for 'irresponsible' handling of algal bloom advice",
          "standfirst": "A South Australian mother of a teenager with asthma says it was \"irresponsible\" of health authorities not to communicate updated advice more widely, amid the state's harmful algal bloom.",
          "content": "A South Australian mother of a teenager with asthma says it was \"irresponsible\" of health authorities not to communicate updated advice more widely, amid the state's harmful algal bloom.",
          "feed_position": 24
        }
      ],
      "popularity_score": 150.14648027777778,
      "ai_summary": [
        "A South Australian mother criticized health authorities' communication.",
        "Her teenager has asthma, making the advice crucial for her family.",
        "She felt the authorities were irresponsible in their communication.",
        "The criticism relates to the handling of information about algal blooms.",
        "The mother wanted wider dissemination of updated health advice."
      ]
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 19:25:54 +0000",
      "title": "Australian glove-maker Ansell accused of exploiting workers",
      "neutral_headline": "Ansell investigated allegations of worker exploitation",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/ansell-gloves-factory-workers-alleged-exploitation-malaysia/105730848",
          "published_at": "Wed, 10 Sep 2025 19:25:54 +0000",
          "title": "Australian glove-maker Ansell accused of exploiting workers",
          "standfirst": "Melbourne-based company Ansell has confirmed it investigated allegations at a Malaysian factory and identified issues that do not meet labour standards.",
          "content": "Melbourne-based company Ansell has confirmed it investigated allegations at a Malaysian factory and identified issues that do not meet labour standards.",
          "feed_position": 18
        }
      ],
      "popularity_score": 149.15564694444444,
      "ai_summary": [
        "Ansell, a Melbourne-based glove maker, investigated allegations.",
        "The investigation occurred at a Malaysian factory location.",
        "Ansell identified issues that did not meet labor standards.",
        "The company confirmed the investigation and its findings.",
        "The issues found were related to labor standards violations."
      ]
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 18:48:43 +0000",
      "title": "Australia wants to expand a massive gas project but Pacific nations aren't happy",
      "neutral_headline": "Australia's gas project expansion faces Pacific opposition",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-11/vanuatu-warns-australia-about-expansion-of-woodside-gas-project/105759934",
          "published_at": "Wed, 10 Sep 2025 18:48:43 +0000",
          "title": "Australia wants to expand a massive gas project but Pacific nations aren't happy",
          "standfirst": "Australia's move to expand Woodside's North West Shelf gas project has not been welcomed in the Pacific, which is fighting the most dramatic effects of climate change.",
          "content": "Australia's move to expand Woodside's North West Shelf gas project has not been welcomed in the Pacific, which is fighting the most dramatic effects of climate change.",
          "feed_position": 12
        }
      ],
      "popularity_score": 148.53592472222223,
      "ai_summary": [
        "Australia plans to expand Woodside's North West Shelf gas project.",
        "Pacific nations are unhappy with the expansion plans.",
        "Pacific nations are facing the effects of climate change.",
        "The expansion is not welcomed by Pacific Island nations.",
        "The project's expansion is a point of contention."
      ]
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Wed, 10 Sep 2025 07:58:53 +0000",
      "title": "At least eight dead in Bali floods",
      "neutral_headline": "Flooding in Bali results in multiple fatalities",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-10/at-least-eight-dead-in-bali-indonesia-floods/105759388",
          "published_at": "Wed, 10 Sep 2025 07:58:53 +0000",
          "title": "At least eight dead in Bali floods",
          "standfirst": "Bali has been rocked by unusual and deadly flooding as heavy rains inundate homes, major roads and force large evacuations.",
          "content": "Bali has been rocked by unusual and deadly flooding as heavy rains inundate homes, major roads and force large evacuations.",
          "feed_position": 13
        }
      ],
      "popularity_score": 142.70536916666666,
      "ai_summary": [
        "Bali experienced unusual and deadly flooding.",
        "Heavy rains caused the flooding in Bali.",
        "Homes and major roads were inundated by the floods.",
        "Large evacuations were necessary due to the flooding.",
        "At least eight people have died due to the floods."
      ]
    }
  ]
}