{
  "updated_at": "2025-11-20T03:43:22.747Z",
  "clusters": [
    {
      "id": "cluster_6",
      "coverage": 3,
      "updated_at": "Thu, 20 Nov 2025 03:19:11 GMT",
      "title": "Australia news live: Melissa McIntosh says full list of phones unable to connect to triple-zero network ‘has not been communicated clearly’",
      "neutral_headline": "Australia News: Triple Zero, Climate Conference, Market",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb",
          "published_at": "Thu, 20 Nov 2025 03:19:11 GMT",
          "title": "Australia news live: Melissa McIntosh says full list of phones unable to connect to triple-zero network ‘has not been communicated clearly’",
          "standfirst": "Meanwhile, NSW Liberals edge towards leadership spill. Follow today’s news liveTurkey to host Cop31 climate conference after Australia drops push to hold it in AdelaideGet our breaking news email, free app or daily news podcastGovernment reaffirms that best Cop outcome is one that elevates Pacific voicesPat Conroy, the minister for defence industry, said Australia is still seeking to host the UN climate summit in Adelaide next year, but is being frank with the Australian people that any one country can block a successful bid.We’re continuing to negotiate the best possible outcome for progress on climate action and to draw attention to what’s occurring in the Pacific. And so we are still negotiating. We’re still seeking to win the rights to host the Cop in conjunction with the Pacific. But we’re also being frank with the Australian people that the UN framework convention has consensus rules, which means that any one country can block a successful bid.We’re still seeking to host that Cop, but we’ve been very clear. That our focus is on getting a positive outcome for climate action and highlighting what is going on in the Pacific.We’ve said that we would not veto Turkey if they choose them. They haven’t been chosen yet, but we would not veto it. Continue reading...",
          "content": "Meanwhile, NSW Liberals edge towards leadership spill. Follow today’s news liveTurkey to host Cop31 climate conference after Australia drops push to hold it in AdelaideGet our breaking news email, free app or daily news podcastGovernment reaffirms that best Cop outcome is one that elevates Pacific voicesPat Conroy, the minister for defence industry, said Australia is still seeking to host the UN climate summit in Adelaide next year, but is being frank with the Australian people that any one country can block a successful bid.We’re continuing to negotiate the best possible outcome for progress on climate action and to draw attention to what’s occurring in the Pacific. And so we are still negotiating. We’re still seeking to win the rights to host the Cop in conjunction with the Pacific. But we’re also being frank with the Australian people that the UN framework convention has consensus rules, which means that any one country can block a successful bid.We’re still seeking to host that Cop, but we’ve been very clear. That our focus is on getting a positive outcome for climate action and highlighting what is going on in the Pacific.We’ve said that we would not veto Turkey if they choose them. They haven’t been chosen yet, but we would not veto it. Continue reading...",
          "feed_position": 0
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/nov/20/ai-bubble-asx-share-prices-rates-australian-market-impact-nvidia-tech-companies",
          "published_at": "Thu, 20 Nov 2025 02:21:51 GMT",
          "title": "Fear of an AI bubble, falls in ASX share prices and rates jitters – what’s going on with the Australian market?",
          "standfirst": "The benchmark index hit a record in October but then quickly shed about 7%. And despite a Nvidia-fuelled tech rally, Australia isn’t out of the woods yetFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastGlobal share markets – including in Australia – were plunging before the world’s biggest company, US chip maker Nvidia, reported a soaring profit and upbeat outlook, soothing jittery traders.Yet the results will spark further discussion on whether the market optimism around artificial intelligence is justified. But is it a bubble getting ready to burst? And why is the Australian stock market affected? Continue reading...",
          "content": "The benchmark index hit a record in October but then quickly shed about 7%. And despite a Nvidia-fuelled tech rally, Australia isn’t out of the woods yetFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastGlobal share markets – including in Australia – were plunging before the world’s biggest company, US chip maker Nvidia, reported a soaring profit and upbeat outlook, soothing jittery traders.Yet the results will spark further discussion on whether the market optimism around artificial intelligence is justified. But is it a bubble getting ready to burst? And why is the Australian stock market affected? Continue reading...",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/nov/20/turkey-to-host-cop31-climate-conference-after-australia-drops-push-to-hold-it-in-adelaide",
          "published_at": "Thu, 20 Nov 2025 01:51:33 GMT",
          "title": "Turkey to host Cop31 climate conference after Australia drops push to hold it in Adelaide",
          "standfirst": "Fortnight-long event to be held in Antalya but Australian climate change minister Chris Bowen expected to lead the negotiationsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTurkey will host the Cop31 climate conference after the Australian government dropped its push to hold the event in Adelaide at the last moment despite having invested in a more than three-year campaign.But Australia’s climate change minister, Chris Bowen, is expected to lead climate negotiations at the summit in Turkey’s Mediterranean resort city of Antalya in November 2026 under a compromise deal to resolve a standoff between the two countries. Continue reading...",
          "content": "Fortnight-long event to be held in Antalya but Australian climate change minister Chris Bowen expected to lead the negotiationsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTurkey will host the Cop31 climate conference after the Australian government dropped its push to hold the event in Adelaide at the last moment despite having invested in a more than three-year campaign.But Australia’s climate change minister, Chris Bowen, is expected to lead climate negotiations at the summit in Turkey’s Mediterranean resort city of Antalya in November 2026 under a compromise deal to resolve a standoff between the two countries. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/new-underquoting-laws-victoria-reserve-price-disclosure-set-to-be-introduced/f98139b7-96d6-4f95-95d1-60440c3c1318",
          "published_at": "Thu, 20 Nov 2025 00:44:56 +0000",
          "title": "Fresh laws will stop dodgy real estate agents from underquoting home prices",
          "standfirst": "A ustralian-first laws will soon make it illegal for Victorian real estate agents to underquote the reserve price of a property in the days before an auction.",
          "content": "A ustralian-first laws will soon make it illegal for Victorian real estate agents to underquote the reserve price of a property in the days before an auction.Agents will be made to disclose a home&#x27;s exact reserve price a week before it goes under the hammer in a major overhaul of underquoting legislation in the state.Underquoting is already illegal in Victoria however the proposed reform will make it harder to advertise misleading prices closer to auction day.READ MORE: &#x27;AI bubble&#x27; fears eased as world&#x27;s most valuable company clears hurdleThe key change was announced today by Victoria&#x27;s Consumer Affairs Minister Nick Staikos today after media reports of dishonest auction practices.Under the current laws, agents can set a reserve or asking price which is above the previously advertised figure as late as the day of the auction .It leads to potential homebuyers wasting their Saturday at auctions for a home they an&#x27;t afford.The updated laws will require agents to publish the actual reserve price at least seven days before auction day.Real estate agents who fail to disclose a reserve price within this time frame will be banned from proceeding to auction or sale. All marketing materials will be required to reflect the honest reserve price too. \"Underquoting isn&#x27;t fair and it&#x27;s young Victorians and families paying the price,\" Staikos said today.\"That&#x27;s why we&#x27;re stamping it out by requiring reserve prices to be published at least seven days before an auction.READ MORE: One disease wiped out Steph&#x27;s family in a year. Survival rates have barely changed\"We want the housing market to be fair – that&#x27;s why we&#x27;re continuing to crack down on underquoting with strong laws, a dedicated taskforce and active enforcement.\"The Labor government said its underquoting taskforce has issued over 200 infringements totalling over $2.3 million in fines.In response, the Victorian Greens said it supported the fresh underquoting laws but warned it may not have any impact on housing affordability. The Greens claimed underquoting has \"run rampant\" in the state, which has fuelled competition and driven prices up.\"Labor&#x27;s finally catching. First-home buyers have been getting completely screwed for years, wasting time and spending thousands on inspections for homes they were never going to afford,\" said Victorian Greens housing spokesperson Gabrielle de Vietri.\"Being told the reserve early is helpful, but it doesn&#x27;t change the reality that most young people can&#x27;t afford the reserve in the first place.\"Similar laws were introduced this month in NSW, which penalises dodgy real estate agents who put misleading price estimates in property listings. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 6,
          "image_url": "https://prod.static9.net.au/fs/cd905212-8148-4664-8019-0d7a88489d83"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/business/2025/nov/20/victoria-agents-to-publish-property-reserve-prices-crackdown-on-underquoting",
          "published_at": "Thu, 20 Nov 2025 00:35:17 GMT",
          "title": "Victoria to force agents to publish property reserve prices in crackdown on underquoting",
          "standfirst": "Under the nation-first laws, real estate agents in Victoria will be required to disclose owner’s reserve price within seven days of sale or face penaltiesFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastReal estate agents in Victoria will be legally required to reveal a property’s reserve price a week before auction, under nation-first laws to crack down on underquoting.The Allan government on Thursday announced the major reform that would be introduced to parliament next year. Continue reading...",
          "content": "Under the nation-first laws, real estate agents in Victoria will be required to disclose owner’s reserve price within seven days of sale or face penaltiesFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastReal estate agents in Victoria will be legally required to reveal a property’s reserve price a week before auction, under nation-first laws to crack down on underquoting.The Allan government on Thursday announced the major reform that would be introduced to parliament next year. Continue reading...",
          "feed_position": 5
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/victorian-government-announces-real-estate-underquoting-laws/106031070",
          "published_at": "Wed, 19 Nov 2025 23:41:12 +0000",
          "title": "Reserve property prices to be published in underquoting crackdown",
          "standfirst": "Real estate agents in Victoria will be required to publish a property's reserve price at least seven days before it goes to auction, under new laws the state government says will stamp out illegal underquoting.",
          "content": "Real estate agents in Victoria will be required to publish a property's reserve price at least seven days before it goes to auction, under new laws the state government says will stamp out illegal underquoting.",
          "feed_position": 17
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/environment/2025/nov/19/australia-deforestation-hidden-official-figures-conservationists-report",
          "published_at": "Wed, 19 Nov 2025 14:00:42 GMT",
          "title": "Researchers say real impact of deforestation being hidden in Australia’s official figures by ‘sleight of hand’",
          "standfirst": "Report commissioned by conservationists suggests some recorded new growth is misclassified or otherwise not equivalent to losses in species-heavy forestsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAt face value, the amount of forest in Australia is officially increasing, and has been since 2008.But if an old-growth tree is felled in a forest and seedlings grow elsewhere, is the official account ecologically sound? Not according to new analysis, which suggests that the way Australia calculates forest cover obfuscates the impacts of ongoing deforestation. Continue reading...",
          "content": "Report commissioned by conservationists suggests some recorded new growth is misclassified or otherwise not equivalent to losses in species-heavy forestsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAt face value, the amount of forest in Australia is officially increasing, and has been since 2008.But if an old-growth tree is felled in a forest and seedlings grow elsewhere, is the official account ecologically sound? Not according to new analysis, which suggests that the way Australia calculates forest cover obfuscates the impacts of ongoing deforestation. Continue reading...",
          "feed_position": 6
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/nov/19/coalition-and-labor-negotiate-nature-laws-as-greens-warn-compromise-would-show-it-was-written-for-big-business",
          "published_at": "Wed, 19 Nov 2025 14:00:41 GMT",
          "title": "Coalition and Labor negotiate nature laws as Greens warn compromise would show it was ‘written for big business’",
          "standfirst": "Murray Watt says other parties must decide ‘whether they want to see us do a deal with the other side of politics’Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastSenior Liberal MPs are optimistic a deal can be reached with Labor on a watered-down version of its new nature laws, allowing them to be passed in parliament’s final sitting week of the year.The environment minister, Murray Watt, is open to a deal with the Coalition that would require concessions, including revising a new provision designed to block projects that cause an “unacceptable impact” on the environment. Continue reading...",
          "content": "Murray Watt says other parties must decide ‘whether they want to see us do a deal with the other side of politics’Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastSenior Liberal MPs are optimistic a deal can be reached with Labor on a watered-down version of its new nature laws, allowing them to be passed in parliament’s final sitting week of the year.The environment minister, Murray Watt, is open to a deal with the Coalition that would require concessions, including revising a new provision designed to block projects that cause an “unacceptable impact” on the environment. Continue reading...",
          "feed_position": 8
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/business/grogonomics/2025/nov/19/wages-are-now-barely-growing-faster-than-inflation",
          "published_at": "Wed, 19 Nov 2025 14:00:37 GMT",
          "title": "The days of 4% pay rises are behind us – wages are now barely growing faster than inflation | Greg Jericho",
          "standfirst": "The recovery of real wages is expected to be so slow that it will take us until 2044 to get back to having as much purchasing power as in 2021Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe latest wage figures show no sign of wages growth powering inflation, as the real value of private-sector wages fell in the September quarter.Other than inflation, the figures the Reserve Bank of Australia most keeps an eye on are the quarterly wages growth figures. These give us a sense of whether there is so much competition for jobs that employers are offering higher wages and workers can demand higher wages without fear of their hours being cut. Continue reading...",
          "content": "The recovery of real wages is expected to be so slow that it will take us until 2044 to get back to having as much purchasing power as in 2021Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastThe latest wage figures show no sign of wages growth powering inflation, as the real value of private-sector wages fell in the September quarter.Other than inflation, the figures the Reserve Bank of Australia most keeps an eye on are the quarterly wages growth figures. These give us a sense of whether there is so much competition for jobs that employers are offering higher wages and workers can demand higher wages without fear of their hours being cut. Continue reading...",
          "feed_position": 12
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/nov/19/meta-starts-notifying-australian-teens-of-account-shutdowns-as-social-media-ban-looms",
          "published_at": "Wed, 19 Nov 2025 13:01:36 GMT",
          "title": "Facebook and Instagram to start kicking Australian teenagers off platforms as social media ban looms",
          "standfirst": "Meta users under 16 will be sent email, SMS and in-app messages in anticipation of 10 December, when ban will beginFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAustralian Facebook and Instagram users under 16 will be notified starting Thursday that their accounts will be deactivated by 10 December, as Meta begins to comply with the Albanese government’s social media ban.Users affected by the ban will receive 14 days’ notice of their pending account deactivation through a combination of in-app messages, email and SMS before their access is cut off. Continue reading...",
          "content": "Meta users under 16 will be sent email, SMS and in-app messages in anticipation of 10 December, when ban will beginFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAustralian Facebook and Instagram users under 16 will be notified starting Thursday that their accounts will be deactivated by 10 December, as Meta begins to comply with the Albanese government’s social media ban.Users affected by the ban will receive 14 days’ notice of their pending account deactivation through a combination of in-app messages, email and SMS before their access is cut off. Continue reading...",
          "feed_position": 9
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/cd905212-8148-4664-8019-0d7a88489d83",
      "popularity_score": 3019.596737222222,
      "ai_summary": [
        "Melissa McIntosh says the full list of phones unable to connect to triple-zero network has not been communicated clearly.",
        "Australia is still seeking to host the UN climate summit in Adelaide next year.",
        "Global share markets, including Australia, were plunging before Nvidia's report.",
        "The benchmark index hit a record in October but then shed about 7%.",
        "Pat Conroy said Australia is being frank with the Australian people."
      ]
    },
    {
      "id": "cluster_20",
      "coverage": 2,
      "updated_at": "Thu, 20 Nov 2025 02:48:09 +0000",
      "title": "NRL star's mum to claim mental health defence over crash that killed three people",
      "neutral_headline": "NRL Star's Mother to Claim Mental Health Defense",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/queensland-court-nrl-star-payne-haas-mum-uiatu-joan-taufua-mental-health-defence-over-triple-fatal-crash/48827ce1-6c2f-4bba-be32-71f93aa59367",
          "published_at": "Thu, 20 Nov 2025 02:48:09 +0000",
          "title": "NRL star's mum to claim mental health defence over crash that killed three people",
          "standfirst": "The mother of premiership-winning NRL star Payne Haas will claim a mental-health defence over the deaths of three people in a head-on collision during a police pursuit.",
          "content": "The mother of premiership-winning NRL star Payne Haas will claim a mental-health defence over the deaths of three people in a head-on collision during a police pursuit.Uiatu \"Joan\" Taufua faced Queensland Supreme Court today for an arraignment on the three counts of manslaughter stemming from the devastating crash on a narrow rural road in the Gold Coast hinterland on December 30, 2022.Taufua was due to enter pleas to the charges but her barrister Martin Longhurst instead sought to have the matter referred to the Mental Health Court.READ MORE: &#x27;Asbestos of the 21st century&#x27;: Calls to ban chemical Aussies are exposed to every day\"This matter has a long history ... a psychiatric report has been a very long time coming,\" Longhurst said.\"I received the report yesterday afternoon. That has been disclosed to (prosecutors). It does give a reference to a potential section 27 defence.\"Section 27 of the Queensland criminal code is an insanity defence that a person is not criminally responsible for an act if they were delusional or did not have the mental capacity to control their actions or know they were wrong.Taufua&#x27;s case should be immediately referred to the Mental Health Court, Longhurst told Justice Elizabeth Wilson.That court decides whether an alleged offender was of unsound mind.Taufua stood in the dock wearing gold-rimmed glasses and a black dress with a yellow flower pattern.Police will allege that she was fleeing police before ploughing into an oncoming vehicle, killing Chris Fawcett, 79, Susan Zimmer, 70, and her 35-year-old daughter Steffanie.Longhurst told the Supreme Court in October Taufua had struggled to accept the death of her child.READ MORE: Warning entire industry critical for Australian economy on the brink of collapse\"In the time leading up to the driving, the defendant had been displaying very aberrant behaviour,\" Longhurst said.Chace Haas, 21, died in Gold Coast Hospital in August 2020.He had lived his entire life using a wheelchair after breaking his neck in a car accident at just five months of age.It would be extraordinary for a case that has been running since December 2022 to have a referral to the Mental Health Court at this stage, crown prosecutor Dejana Kovac said.\"It&#x27;s very unfortunate for the parents of the deceased,\" Ms Kovac said.\"It&#x27;s a position that could have been avoided had these issues been sorted out earlier than yesterday at 4.58pm. The prolonged process has already had an impact on the families.\"Taufua - the mother of Brisbane Broncos forward Payne and Gold Coast Titans rising star Klese Haas - was the crash&#x27;s sole survivor.Taufua was on parole at the time of the crash after being sentenced to nine months in prison for assaulting two security guards at The Star casino.She was subsequently returned to custody after the collision.READ MORE: Bizarre twist as owner charged over death of Arnie the German shepherdIn November 2024, Taufua was committed to stand trial after conceding she had a prima facie case to answer.Justice Wilson said she would suspend Taufua&#x27;s Supreme Court matter.Taufua was remanded in custody and her case will return to the Supreme Court in February for an update on the Mental Health Court&#x27;s progress.Readers seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/cfa3a60b-ffdb-43c3-a0ce-ffa10615561f"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/queensland/triple-fatal-case-takes-new-turn-for-payne-haas-mum-20251120-p5nh16.html",
          "published_at": "Thu, 20 Nov 2025 13:24:18 +1100",
          "title": "Triple-fatal case takes new turn for Payne Haas’ mum",
          "standfirst": "The mother of the star NRL player has launched a mental health defence over triple-fatal manslaughter charges.",
          "content": "The mother of the star NRL player has launched a mental health defence over triple-fatal manslaughter charges.",
          "feed_position": 18,
          "image_url": "https://static.ffx.io/images/$zoom_0.5519%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/591f78f824ef4eb9c0fbe5c667a0b8dbc4c2cfdc"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/cfa3a60b-ffdb-43c3-a0ce-ffa10615561f",
      "popularity_score": 2019.079515,
      "ai_summary": [
        "The mother of NRL star Payne Haas will claim a mental health defense.",
        "The defense is related to a crash that killed three people.",
        "The crash involved a head-on collision during a police pursuit.",
        "The case has taken a new turn for Payne Haas' mother.",
        "The defense will be presented in court."
      ]
    },
    {
      "id": "cluster_29",
      "coverage": 2,
      "updated_at": "Thu, 20 Nov 2025 02:17:47 +0000",
      "title": "Four arrested after man stabbed to death at regional park",
      "neutral_headline": "Four Arrested After Fatal Stabbing in Park",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/nsw-bega-park-death-four-arrested-after-man-stabbed-to-death/b8e8f5a3-6e8f-4db2-ab9d-e1ab32ab18c1",
          "published_at": "Thu, 20 Nov 2025 02:17:47 +0000",
          "title": "Four arrested after man stabbed to death at regional park",
          "standfirst": "Three men and a woman have been arrested after a 43-year-old man was stabbed to death at a park on the NSW South Coast.",
          "content": "Three men and a woman have been arrested after a 43-year-old man was stabbed to death at a park on the NSW South Coast. Strike force detectives established a crime scene and began an investigation after the man was found on East Street in Bega about 2am on October 6 .A second man, a 45-year-old, had also been stabbed but has since recovered at South East Regional Hospital. READ MORE: One of Australia&#x27;s biggest customers ditches our biggest exportThis morning, officers stormed three homes in Bega and Bemboka and arrested three men, aged 29, 32 and 34, and a 19-year-old woman.All four were taken to Bega Police Station. No charges have been laid.The arrests come just days after a public tip-off led detectives and divers to search a private property and the Glebe Wetlands on East Street.READ MORE: Aussies are being forced to accept jobs with no clue what they&#x27;ll be paidThey uncovered items of interest in the property, which are being forensically examined. A knife, electronic devices, and two vehicles have been previously found and seized.Strike force detectives, with the help of NSW SES, have been focusing their efforts on the Glebe Wetlands. Investigations are continuing. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/ad5552f9-555a-484f-bf0e-6f4f37ff01c9"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/four-people-arrested-six-weeks-after-fatal-stabbing-at-bega/106031200",
          "published_at": "Wed, 19 Nov 2025 23:58:03 +0000",
          "title": "Four people arrested six weeks after fatal stabbing on NSW South Coast",
          "standfirst": "Four people have been arrested at Bega on the NSW South Coast following the fatal stabbing of a 43-year-old man last month.",
          "content": "Four people have been arrested at Bega on the NSW South Coast following the fatal stabbing of a 43-year-old man last month.",
          "feed_position": 15
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/ad5552f9-555a-484f-bf0e-6f4f37ff01c9",
      "popularity_score": 2018.5734038888888,
      "ai_summary": [
        "Four people were arrested after a man was stabbed to death.",
        "The stabbing occurred at a park on the NSW South Coast.",
        "The victim was a 43-year-old man.",
        "The arrests happened six weeks after the stabbing.",
        "Three men and one woman were arrested."
      ]
    },
    {
      "id": "cluster_37",
      "coverage": 2,
      "updated_at": "Thu, 20 Nov 2025 01:38:29 +0000",
      "title": "Owner charged over allegedly abandoning dog Arnie after claiming he was stolen",
      "neutral_headline": "Owner Charged Over Allegedly Abandoning Dog",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/qld-man-charged-for-leaving-dog-in-car/106031602",
          "published_at": "Thu, 20 Nov 2025 01:38:29 +0000",
          "title": "Owner charged over allegedly abandoning dog Arnie after claiming he was stolen",
          "standfirst": "Queensland Police had been investigating the alleged theft of a vehicle and Arnie the German shepherd, from Brisbane's bayside.",
          "content": "Queensland Police had been investigating the alleged theft of a vehicle and Arnie the German shepherd, from Brisbane's bayside.",
          "feed_position": 14
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/owner-charged-after-ute-with-dog-dead-inside-found-on-street-queensland/1532d732-7402-48d7-a35d-bb183d84e7ca",
          "published_at": "Thu, 20 Nov 2025 01:21:58 +0000",
          "title": "Bizarre twist as owner charged over death of Arnie the German shepherd",
          "standfirst": "P olice allege the Toyota Hilux was never stolen in the first place.",
          "content": "The owner of a beloved German shepherd that was found dead in a ute has now been charged, with police alleging the car was never stolen.Nathan McKeown, 43, had fronted several public appeals for information after it was reported to police that his Toyota Hilux had been stolen from an address in Queensland with his beloved dog, named Arnie, asleep in the ute&#x27;s tray. Police were told the Hilux had been stolen on the night of November 7. At 4pm on November 17, a member of the public found the vehicle with Arnie deceased inside.READ MORE: &#x27;AI bubble&#x27; fears eased as world&#x27;s most valuable company clears hurdleNow, in a bizarre twist, police allege the vehicle was never stolen and McKeown has been charged with one count of breaching a duty of care of an animal. Detectives from the Bayside Criminal Investigation branch will allege in court that McKeown drove his Hilux into Amelia Street in Brisbane&#x27;s Fortitude Valley and left on foot around 10.30pm on November 7.Police will allege Arnie was left inside the vehicle at that time.The next morning, it is alleged McKeown told his partner that the vehicle had been stolen from a Wynnum address.She then reported the theft to police.Police will allege the man&#x27;s partner was not aware that the Hilux had not been stolen.READ MORE: One disease wiped out Steph&#x27;s family in a year. Survival rates have barely changedThe search for Arnie became a highly publicised case, with police and community groups all joining the search for the suspected stolen car and dog. Queensland Police say the investigation is ongoing, and thanked the public for their assistance. \"Media and the public are thanked for their extensive assistance throughout the investigation,\" a spokesperson said.\"Police are aware this has been a highly publicised case, and offences of this nature may cause distress and upset members of the public.\"The matter is expected to be listed for hearing before a Brisbane Court next month.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/b07458c4-573c-44be-8912-f45beb52c97a"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/b07458c4-573c-44be-8912-f45beb52c97a",
      "popularity_score": 2017.9184038888889,
      "ai_summary": [
        "An owner has been charged over allegedly abandoning a dog.",
        "The dog is a German shepherd named Arnie.",
        "Police were investigating the alleged theft of a vehicle and Arnie.",
        "Police now allege the Toyota Hilux was never stolen.",
        "The owner is facing charges related to the dog's death."
      ]
    },
    {
      "id": "cluster_1",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 03:32:27 +0000",
      "title": "CTTV of accused before alleged murder played to jury",
      "neutral_headline": "CTTV of accused before alleged murder played to jury",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/toyah-cordinley-jury-shown-cctv-of-rajwinder-singh/106031870",
          "published_at": "Thu, 20 Nov 2025 03:32:27 +0000",
          "title": "CTTV of accused before alleged murder played to jury",
          "standfirst": "Police compiled the CCTV and traffic camera vision by tracking a car registered to Rajwinder Singh before Toyah Cordingley was allegedly murdered.",
          "content": "Police compiled the CCTV and traffic camera vision by tracking a car registered to Rajwinder Singh before Toyah Cordingley was allegedly murdered.",
          "feed_position": 0
        }
      ],
      "popularity_score": 352.81784833333336,
      "ai_summary": [
        "Police compiled CCTV and traffic camera vision.",
        "The vision tracked a car registered to Rajwinder Singh.",
        "The vision was shown to the jury.",
        "The vision is related to the alleged murder of Toyah Cordingley.",
        "The evidence is part of the prosecution's case."
      ]
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 01:31:07 +0000",
      "title": "Trump signs Epstein files bill into law, triggering 30-day deadline",
      "neutral_headline": "Trump Signs Epstein Files Bill, Triggering Release Deadline",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/donald-trump-sign-jeffrey-epstein-files-release-bill/106030528",
          "published_at": "Thu, 20 Nov 2025 01:31:07 +0000",
          "title": "Trump signs Epstein files bill into law, triggering 30-day deadline",
          "standfirst": "US President Donald Trump says he has signed off on legislation to force the release of the \"Epstein files\" — the final step required to turn the bill into law.",
          "content": "US President Donald Trump says he has signed off on legislation to force the release of the \"Epstein files\" — the final step required to turn the bill into law.",
          "feed_position": 0
        }
      ],
      "popularity_score": 350.7956261111111,
      "ai_summary": [
        "President Trump signed legislation mandating release of Epstein files.",
        "The bill's signing initiates a 30-day deadline for the files' release.",
        "This action represents the final step to enact the bill into law.",
        "The files' release is now legally mandated by the United States government.",
        "The files' contents will become public within the specified timeframe."
      ]
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 03:19:55 +0000",
      "title": "Calls for security to be 'ramped up' at Alice Springs units",
      "neutral_headline": "Calls for Increased Security at Alice Springs Units",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/calls-for-more-security-at-housing-commission-units/106028066",
          "published_at": "Thu, 20 Nov 2025 03:19:55 +0000",
          "title": "Calls for security to be 'ramped up' at Alice Springs units",
          "standfirst": "A 92-year-old man and his daughter are calling for the Department of Housing to install better security at a block of Alice Springs housing commission units, after a series of assaults on elderly residents.",
          "content": "A 92-year-old man and his daughter are calling for the Department of Housing to install better security at a block of Alice Springs housing commission units, after a series of assaults on elderly residents.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.60895944444445,
      "ai_summary": [
        "A 92-year-old man and his daughter seek improved security.",
        "They are requesting better security at Alice Springs housing units.",
        "The request follows a series of assaults on elderly residents.",
        "The Department of Housing is the target of the security request.",
        "The assaults prompted the call for increased security measures."
      ]
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 23:53:50 +0000",
      "title": "Australia hands COP31 to Türkiye but Bowen to lead negotiations",
      "neutral_headline": "Australia Hands COP31 to Türkiye, Bowen to Lead Talks",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/australia-withdraws-bid-to-host-cop31-in-adelaide/106031148",
          "published_at": "Wed, 19 Nov 2025 23:53:50 +0000",
          "title": "Australia hands COP31 to Türkiye but Bowen to lead negotiations",
          "standfirst": "Adelaide will not host next year's COP summit, but Australia's energy minister, Chris Bowen, will lead the negotiations, and a pre-event will be hosted by a Pacific Island nation.",
          "content": "Adelaide will not host next year's COP summit, but Australia's energy minister, Chris Bowen, will lead the negotiations, and a pre-event will be hosted by a Pacific Island nation.",
          "feed_position": 1
        }
      ],
      "popularity_score": 339.17423694444443,
      "ai_summary": [
        "Adelaide will not host the next year's COP summit.",
        "Chris Bowen, Australia's energy minister, will lead negotiations.",
        "A pre-event will be hosted by a Pacific Island nation.",
        "Türkiye will host the COP31 summit.",
        "Australia will still be involved in the climate change talks."
      ]
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 23:18:51 +0000",
      "title": "G20 leaders are 'saving the furniture' as Trump leads a boycott",
      "neutral_headline": "G20 Leaders Face Challenges Amid Trump's Absence",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/g20-trump-boycott-albanese-save-furniture/106031090",
          "published_at": "Wed, 19 Nov 2025 23:18:51 +0000",
          "title": "G20 leaders are 'saving the furniture' as Trump leads a boycott",
          "standfirst": "Trump's absence could neuter the forum's ability to move the dial on the summit's priorities, including helping nations adapt to weather disasters, the transition to clean energy, cutting excessive debt costs and working together in the global rush for critical minerals.",
          "content": "Trump's absence could neuter the forum's ability to move the dial on the summit's priorities, including helping nations adapt to weather disasters, the transition to clean energy, cutting excessive debt costs and working together in the global rush for critical minerals.",
          "feed_position": 2
        }
      ],
      "popularity_score": 328.5911813888889,
      "ai_summary": [
        "Trump's absence could hinder the summit's progress.",
        "The forum's ability to address key priorities may be affected.",
        "Priorities include adapting to weather disasters and clean energy.",
        "Cutting debt costs and critical minerals are also priorities.",
        "The summit aims to foster global cooperation on various issues."
      ]
    },
    {
      "id": "cluster_11",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 02:58:52 +0000",
      "title": "Driver pleads guilty over 'horrific' crash after club event that injured teen",
      "neutral_headline": "Driver Pleads Guilty After \"Horrific\" Crash Injuring Teen",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/chun-lai-yuen-burswood-crown-casino-car-crash-caitlyn-dickson/105656184",
          "published_at": "Thu, 20 Nov 2025 02:58:52 +0000",
          "title": "Driver pleads guilty over 'horrific' crash after club event that injured teen",
          "standfirst": "A Chinese national admits dangerous driving over a \"horrific\" crash at a car club meet-up that left 17-year-old Caitlyn Dickson with life-threatening injuries.",
          "content": "A Chinese national admits dangerous driving over a \"horrific\" crash at a car club meet-up that left 17-year-old Caitlyn Dickson with life-threatening injuries.",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.2581261111111,
      "ai_summary": [
        "A Chinese national admitted to dangerous driving charges.",
        "The charges relate to a \"horrific\" crash at a car club event.",
        "Caitlyn Dickson, 17, sustained life-threatening injuries in the crash.",
        "The crash occurred during a car club meet-up.",
        "The driver's actions resulted in serious harm to the victim."
      ]
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 01:46:15 +0000",
      "title": "'Champion young man' who died in cricketing accident farewelled",
      "neutral_headline": "Memorial Held for Teenager Who Died in Cricket Accident",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/young-cricketer-ben-austin-farewelled-at-melbourne-funeral/106031014",
          "published_at": "Thu, 20 Nov 2025 01:46:15 +0000",
          "title": "'Champion young man' who died in cricketing accident farewelled",
          "standfirst": "Melbourne's Junction Oval was a sea of cricket shirts, football jumpers and scarves as friends and family gathered to farewell beloved teenager Ben Austin, who died in a tragic cricket accident last month.",
          "content": "Melbourne's Junction Oval was a sea of cricket shirts, football jumpers and scarves as friends and family gathered to farewell beloved teenager Ben Austin, who died in a tragic cricket accident last month.",
          "feed_position": 3
        }
      ],
      "popularity_score": 321.0478483333333,
      "ai_summary": [
        "A memorial service was held for Ben Austin.",
        "The service took place at Melbourne's Junction Oval.",
        "Friends and family gathered to remember the teenager.",
        "Ben Austin died in a tragic cricket accident.",
        "The event was filled with cricket shirts and scarves."
      ]
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 01:36:19 +0000",
      "title": "How to download your content ahead of Meta's teen social media ban",
      "neutral_headline": "How to download your content ahead of Meta's teen social media ban",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/meta-teen-ban-looming-download-content/106031186",
          "published_at": "Thu, 20 Nov 2025 01:36:19 +0000",
          "title": "How to download your content ahead of Meta's teen social media ban",
          "standfirst": "Meta warns it will start axing the Meta accounts of under 16s from December 4. Here's how you can download your data before then.",
          "content": "Meta warns it will start axing the Meta accounts of under 16s from December 4. Here's how you can download your data before then.",
          "feed_position": 4
        }
      ],
      "popularity_score": 310.88229277777776,
      "ai_summary": [
        "Meta will start removing under-16s' accounts on December 4.",
        "Users can download their data before their accounts are removed.",
        "The ban applies to Meta accounts, including Facebook and Instagram.",
        "The company is providing instructions on how to download data.",
        "This action is part of Meta's policy changes regarding teens."
      ]
    },
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 02:58:07 +0000",
      "title": "Two debutants set to be named for Australia in first Ashes Test",
      "neutral_headline": "Two Debutants Set for Australia in First Ashes Test",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/ashes-cricket-australia-england-perth-weatherald-doggett/106032328",
          "published_at": "Thu, 20 Nov 2025 02:58:07 +0000",
          "title": "Two debutants set to be named for Australia in first Ashes Test",
          "standfirst": "Australia is set to blood two debutants in a Test for the first time since 2019 as the Ashes get underway in Perth on Friday.",
          "content": "Australia is set to blood two debutants in a Test for the first time since 2019 as the Ashes get underway in Perth on Friday.",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.2456261111111,
      "ai_summary": [
        "Australia is set to include two debutants in the first Test.",
        "This will be the first time since 2019 that this has happened.",
        "The Ashes series is set to begin in Perth on Friday.",
        "The debutants will be playing in the Ashes series.",
        "The team selection marks a significant change for Australia."
      ]
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 02:51:28 +0000",
      "title": "How to follow Oscar Piastri during the F1 grand prix in Las Vegas",
      "neutral_headline": "How to follow Oscar Piastri during the F1 grand prix in Las Vegas",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/f1-las-vegas-grand-prix-start-time-how-to-watch-driver-standings/105995164",
          "published_at": "Thu, 20 Nov 2025 02:51:28 +0000",
          "title": "How to follow Oscar Piastri during the F1 grand prix in Las Vegas",
          "standfirst": "Oscar Piastri enters the third-last grand prix of the season further away from the drivers' championship lead than he has been all year.",
          "content": "Oscar Piastri enters the third-last grand prix of the season further away from the drivers' championship lead than he has been all year.",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.13479277777776,
      "ai_summary": [
        "Oscar Piastri is competing in the F1 grand prix in Las Vegas.",
        "He is further from the drivers' championship lead than all year.",
        "The Las Vegas race is the third-last grand prix of the season.",
        "Fans can follow Piastri's progress during the race.",
        "The race presents a challenge for Piastri in the championship."
      ]
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 02:04:37 +0000",
      "title": "Boy escapes attempted abduction by man wearing a balaclava",
      "neutral_headline": "Boy Escapes Attempted Abduction by Man in Balaclava",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/attempted-abduction-of-12-year-old-boy-at-tweed-heads/106031158",
          "published_at": "Thu, 20 Nov 2025 02:04:37 +0000",
          "title": "Boy escapes attempted abduction by man wearing a balaclava",
          "standfirst": "A school community in northern NSW is warned to remain vigilant after a child of about 12 was approached by a man wearing a balaclava and gloves.",
          "content": "A school community in northern NSW is warned to remain vigilant after a child of about 12 was approached by a man wearing a balaclava and gloves.",
          "feed_position": 6
        }
      ],
      "popularity_score": 291.35395944444446,
      "ai_summary": [
        "A child, approximately 12 years old, was approached.",
        "The man wore a balaclava and gloves during the incident.",
        "The incident prompted a warning to the school community.",
        "The attempted abduction occurred in northern NSW.",
        "The community is urged to remain vigilant."
      ]
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 19:00:04 +0000",
      "title": "Multinational company sues small-town cleaner over packaging",
      "neutral_headline": "Multinational Company Sues Cleaner Over Packaging",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/enduroshield-takes-action-against-window-cleaner/106004284",
          "published_at": "Wed, 19 Nov 2025 19:00:04 +0000",
          "title": "Multinational company sues small-town cleaner over packaging",
          "standfirst": "A multinational company is taking a small-town Australian cleaner to court, claiming his glass-cleaning product is deceptively similar to its own.",
          "content": "A multinational company is taking a small-town Australian cleaner to court, claiming his glass-cleaning product is deceptively similar to its own.",
          "feed_position": 6
        }
      ],
      "popularity_score": 284.2781258333333,
      "ai_summary": [
        "A multinational company is taking a cleaner to court.",
        "The company claims the cleaner's product is similar to its own.",
        "The cleaner is based in a small Australian town.",
        "The lawsuit concerns the cleaner's glass-cleaning product.",
        "The company alleges deceptive similarity in packaging."
      ]
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 18:49:08 +0000",
      "title": "Home owners filthy on plumbing industry as insurance firms dig in",
      "neutral_headline": "Homeowners Frustrated with Plumbing Industry, Insurance Issues",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/plumbing-insurance-claims-fail-despite-ministerial-order/106017148",
          "published_at": "Wed, 19 Nov 2025 18:49:08 +0000",
          "title": "Home owners filthy on plumbing industry as insurance firms dig in",
          "standfirst": "Home owners are demanding action after years trying to access insurance payouts for failed plumbing work that has left properties a mess and, in some cases, unliveable.",
          "content": "Home owners are demanding action after years trying to access insurance payouts for failed plumbing work that has left properties a mess and, in some cases, unliveable.",
          "feed_position": 7
        }
      ],
      "popularity_score": 274.0959036111111,
      "ai_summary": [
        "Homeowners are demanding action regarding plumbing issues.",
        "They are struggling to access insurance payouts for failures.",
        "Failed plumbing work has left properties in disrepair.",
        "Some properties have become unlivable due to the issues.",
        "Homeowners have been dealing with these issues for years."
      ]
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 22:06:10 +0000",
      "title": "Aboriginal teen mistakenly pulled from bus at gunpoint after 'racial profiling'",
      "neutral_headline": "Aboriginal Teen Mistakenly Pulled from Bus by Police",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/aboriginal-17yo-pulled-bus-gunpoint-mistaken-racial-profiling/106029782",
          "published_at": "Wed, 19 Nov 2025 22:06:10 +0000",
          "title": "Aboriginal teen mistakenly pulled from bus at gunpoint after 'racial profiling'",
          "standfirst": "The family of a 17-year-old Indigenous boy says he was racially profiled when he was pulled from a Canberra bus by police officers who handcuffed him before realising he was the wrong person.",
          "content": "The family of a 17-year-old Indigenous boy says he was racially profiled when he was pulled from a Canberra bus by police officers who handcuffed him before realising he was the wrong person.",
          "feed_position": 8
        }
      ],
      "popularity_score": 267.3797925,
      "ai_summary": [
        "A 17-year-old Indigenous boy was pulled from a bus.",
        "Police officers handcuffed the boy before realizing the error.",
        "The boy's family claims racial profiling occurred.",
        "The incident happened on a Canberra bus.",
        "The police mistakenly identified the boy."
      ]
    },
    {
      "id": "cluster_76",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 19:00:00 +0000",
      "title": "Is fluoride in water toxic? Here's what decades of research tells us",
      "neutral_headline": "Is fluoride in water toxic? Here's what decades of research tells us",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/science/2025-11-20/is-fluoride-really-a-toxin-we-examine-the-evidence/105966548",
          "published_at": "Wed, 19 Nov 2025 19:00:00 +0000",
          "title": "Is fluoride in water toxic? Here's what decades of research tells us",
          "standfirst": "Large studies conclude there is no evidence to back up community concerns that fluoride in water at recommended levels may affect the cognition or IQ of children.",
          "content": "Large studies conclude there is no evidence to back up community concerns that fluoride in water at recommended levels may affect the cognition or IQ of children.",
          "feed_position": 9
        }
      ],
      "popularity_score": 254.27701472222222,
      "ai_summary": [
        "Large studies have been conducted on fluoride in water.",
        "The studies conclude there is no evidence of harm.",
        "Concerns exist about fluoride's impact on children's IQ.",
        "Recommended fluoride levels are considered safe.",
        "The research supports the safety of fluoride in water."
      ]
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 00:00:53 +0000",
      "title": "What we can learn from this $2m new-build on a flood-prone block",
      "neutral_headline": "What we can learn from this $2m new-build on a flood-prone block",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/grand-designs-australia-sherwood-flood-house-design/105862434",
          "published_at": "Thu, 20 Nov 2025 00:00:53 +0000",
          "title": "What we can learn from this $2m new-build on a flood-prone block",
          "standfirst": "Only someone whose family has long lived next to a river famous for catastrophic flooding would dare to build on this block. Here's what we can all learn from Richard and Janette's new home.",
          "content": "Only someone whose family has long lived next to a river famous for catastrophic flooding would dare to build on this block. Here's what we can all learn from Richard and Janette's new home.",
          "feed_position": 16
        }
      ],
      "popularity_score": 157.29173694444444,
      "ai_summary": [
        "A new home was built on a flood-prone block.",
        "The family has a long history of living near the river.",
        "The home cost $2 million to build.",
        "The river is known for catastrophic flooding.",
        "The article explores lessons from the new construction."
      ]
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 23:59:43 +0000",
      "title": "Brisbane girls school under fire after teachers' dossier on students leaked",
      "neutral_headline": "Brisbane School Faces Backlash Over Student Dossier Leak",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/somerville-house-investigates-teachers-notes-about-students/106031336",
          "published_at": "Wed, 19 Nov 2025 23:59:43 +0000",
          "title": "Brisbane girls school under fire after teachers' dossier on students leaked",
          "standfirst": "One of Brisbane's most prestigious all-girls schools is in crisis mode after students were able to access a document where teachers wrote notes about students' appearances, personalities and their parents.",
          "content": "One of Brisbane's most prestigious all-girls schools is in crisis mode after students were able to access a document where teachers wrote notes about students' appearances, personalities and their parents.",
          "feed_position": 24
        }
      ],
      "popularity_score": 155.2722925,
      "ai_summary": [
        "A Brisbane all-girls school is dealing with a crisis after a document was accessed by students.",
        "The document contained teacher notes about students' appearances, personalities, and parents.",
        "The school is one of Brisbane's most prestigious institutions.",
        "The incident has caused significant concern among students and parents.",
        "The school is currently addressing the fallout from the leaked information."
      ]
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 00:09:46 +0000",
      "title": "'It is hard': The double life of Mackin as an Irish AFLW player",
      "neutral_headline": "Double Life of Irish AFLW Player Blaithin Mackin",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/blaithin-mackin-double-life-of-an-irish-aflw-player/106017896",
          "published_at": "Thu, 20 Nov 2025 00:09:46 +0000",
          "title": "'It is hard': The double life of Mackin as an Irish AFLW player",
          "standfirst": "Melbourne premiership player Blaithin Mackin loves playing both Gaelic and AFLW — but it means living a double life.",
          "content": "Melbourne premiership player Blaithin Mackin loves playing both Gaelic and AFLW — but it means living a double life.",
          "feed_position": 12
        }
      ],
      "popularity_score": 154.4397925,
      "ai_summary": [
        "Blaithin Mackin plays both Gaelic football and AFLW professionally.",
        "She is a Melbourne premiership player in the AFLW.",
        "Balancing both sports creates a demanding schedule for Mackin.",
        "Mackin's commitment requires significant travel and time management.",
        "She loves playing both sports, despite the challenges."
      ]
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 20:19:41 +0000",
      "title": "Live: ASX surges but Japanese bonds flash red",
      "neutral_headline": "Australian Stock Exchange Surges, Japanese Bonds Decline",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/asx-markets-business-news-live-updates-20-november/106028890",
          "published_at": "Wed, 19 Nov 2025 20:19:41 +0000",
          "title": "Live: ASX surges but Japanese bonds flash red",
          "standfirst": "The ASX is surging higher today, but Japan's bond market is being sold off, pushing some interest rates to their highest level since the global financial crisis. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
          "content": "The ASX is surging higher today, but Japan's bond market is being sold off, pushing some interest rates to their highest level since the global financial crisis. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
          "feed_position": 11
        }
      ],
      "popularity_score": 152.60507027777777,
      "ai_summary": [
        "The Australian Stock Exchange is experiencing an upward trend.",
        "Japan's bond market is facing a sell-off.",
        "Some Japanese interest rates have reached levels not seen since the global financial crisis.",
        "Business reporters are providing live updates on the market activity.",
        "The day's events are being followed closely for insights."
      ]
    },
    {
      "id": "cluster_10",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 03:03:54 +0000",
      "title": "Judge says horror of 14-year-old boy's murder 'hard to comprehend'",
      "neutral_headline": "Judge Sentences Ethan Hoac's Killer to Over a Decade",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/teenager-sentenced-for-machete-murder-of-ethan-hoac/106031934",
          "published_at": "Thu, 20 Nov 2025 03:03:54 +0000",
          "title": "Judge says horror of 14-year-old boy's murder 'hard to comprehend'",
          "standfirst": "The killer of Ethan Hoac — who was murdered in an unprovoked attack in Melbourne's north-west in 2023 — is sentenced to more than a decade behind bars for a crime labelled \"appalling\" and \"vicious\".",
          "content": "The killer of Ethan Hoac — who was murdered in an unprovoked attack in Melbourne's north-west in 2023 — is sentenced to more than a decade behind bars for a crime labelled \"appalling\" and \"vicious\".",
          "feed_position": 15
        }
      ],
      "popularity_score": 152.342015,
      "ai_summary": [
        "A judge sentenced Ethan Hoac's killer to more than a decade in prison.",
        "Ethan Hoac was murdered in an unprovoked attack in Melbourne in 2023.",
        "The judge described the crime as \"appalling\" and \"vicious\".",
        "The sentencing relates to the murder of a 14-year-old boy.",
        "The case has drawn significant attention due to its brutality."
      ]
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 18:00:00 +0000",
      "title": "Government playing down impact of CSIRO job cuts",
      "neutral_headline": "Government Downplays CSIRO Job Cut Impact",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/tomago-smelters-science-csiro-funding-cuts/106026312",
          "published_at": "Wed, 19 Nov 2025 18:00:00 +0000",
          "title": "Government playing down impact of CSIRO job cuts",
          "standfirst": "The prime minister, when in opposition, accused the Coalition of \"hollowing out\" the CSIRO. Now, following the announcement 350 research positions at the organisation will be cut, he is being accused of being \"worse than Abbott\".",
          "content": "The prime minister, when in opposition, accused the Coalition of \"hollowing out\" the CSIRO. Now, following the announcement 350 research positions at the organisation will be cut, he is being accused of being \"worse than Abbott\".",
          "feed_position": 12
        }
      ],
      "popularity_score": 152.27701472222222,
      "ai_summary": [
        "The government is minimizing the impact of CSIRO job cuts.",
        "The Prime Minister previously criticized the Coalition for \"hollowing out\" the CSIRO.",
        "350 research positions at the CSIRO are being eliminated.",
        "Critics accuse the current government of being \"worse than Abbott\".",
        "The cuts have sparked controversy within the scientific community."
      ]
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Thu, 20 Nov 2025 02:01:31 +0000",
      "title": "Death in custody ruling delayed as DPP requests details from NT Police",
      "neutral_headline": "Death in custody ruling delayed as DPP requests details from NT Police",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/kumanjayi-white-family-waiting-six-months-to-hear-from-nt-dpp/106031194",
          "published_at": "Thu, 20 Nov 2025 02:01:31 +0000",
          "title": "Death in custody ruling delayed as DPP requests details from NT Police",
          "standfirst": "Kumanjayi White investigation continues six months on from his death as the Department of Public Prosecutions awaits \"the provision of further material\" from NT Police. But the family says the findings are taking too long.",
          "content": "Kumanjayi White investigation continues six months on from his death as the Department of Public Prosecutions awaits \"the provision of further material\" from NT Police. But the family says the findings are taking too long.",
          "feed_position": 23
        }
      ],
      "popularity_score": 151.30229277777778,
      "ai_summary": [
        "The Department of Public Prosecutions is awaiting further material from NT Police.",
        "The investigation into Kumanjayi White's death continues six months later.",
        "The family of Kumanjayi White believes the findings are taking too long.",
        "The DPP requested details from NT Police regarding the death.",
        "The delay has caused frustration for the family."
      ]
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 23:00:21 +0000",
      "title": "Latest cyclone track map shows Fina tracking closer to Darwin",
      "neutral_headline": "Cyclone Fina Forecast to Pass Near Darwin",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/cyclone-fina-thursday-watch-area-extended-to-darwin/106030822",
          "published_at": "Wed, 19 Nov 2025 23:00:21 +0000",
          "title": "Latest cyclone track map shows Fina tracking closer to Darwin",
          "standfirst": "Darwin is officially on cyclone watch, with Tropical Cyclone Fina now forecast to pass between the Northern Territory capital and the Tiwi Islands on Saturday.",
          "content": "Darwin is officially on cyclone watch, with Tropical Cyclone Fina now forecast to pass between the Northern Territory capital and the Tiwi Islands on Saturday.",
          "feed_position": 10
        }
      ],
      "popularity_score": 148.28284805555555,
      "ai_summary": [
        "Darwin is under a cyclone watch.",
        "Tropical Cyclone Fina is expected to pass near Darwin.",
        "The cyclone is forecast to move between Darwin and the Tiwi Islands.",
        "The forecast is for Saturday.",
        "Authorities are monitoring the cyclone's path."
      ]
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 22:51:52 +0000",
      "title": "Man accused of supplying assisted suicide drugs charged with further offences",
      "neutral_headline": "Man accused of supplying assisted suicide drugs charged with further offences",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/assisted-suicide-accused-brett-daniel-taylor-faces-more-charges/106031034",
          "published_at": "Wed, 19 Nov 2025 22:51:52 +0000",
          "title": "Man accused of supplying assisted suicide drugs charged with further offences",
          "standfirst": "Gold Coast man Brett Daniel Taylor allegedly sold high-strength sedatives to people for the purpose of taking their own lives.",
          "content": "Gold Coast man Brett Daniel Taylor allegedly sold high-strength sedatives to people for the purpose of taking their own lives.",
          "feed_position": 20
        }
      ],
      "popularity_score": 148.14145916666666,
      "ai_summary": [
        "Brett Daniel Taylor is accused of selling high-strength sedatives.",
        "Taylor allegedly sold the drugs to people for assisted suicide.",
        "The charges relate to the purpose of taking one's own life.",
        "Taylor is a Gold Coast man.",
        "He faces additional charges related to the alleged offenses."
      ]
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 22:39:54 +0000",
      "title": "Camp for at-risk youths dressed workers in balaclavas",
      "neutral_headline": "Camp for at-risk youths dressed workers in balaclavas",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/jcp-youth-meets-with-tasmania-education-camp-workers-balaclavas/106021476",
          "published_at": "Wed, 19 Nov 2025 22:39:54 +0000",
          "title": "Camp for at-risk youths dressed workers in balaclavas",
          "standfirst": "A taxpayer-funded mentoring program for at-risk Tasmanian youths posted footage on social media showing workers at a camp dressed in black clothes and balaclavas.",
          "content": "A taxpayer-funded mentoring program for at-risk Tasmanian youths posted footage on social media showing workers at a camp dressed in black clothes and balaclavas.",
          "feed_position": 21
        }
      ],
      "popularity_score": 147.9420147222222,
      "ai_summary": [
        "A mentoring program for at-risk youths used workers in balaclavas.",
        "The program is taxpayer-funded.",
        "Footage of the workers was posted on social media.",
        "The camp is located in Tasmania.",
        "The use of balaclavas has raised concerns."
      ]
    },
    {
      "id": "cluster_65",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 22:30:14 +0000",
      "title": "Speakman dismisses 'reports of my death' as leadership speculation grows",
      "neutral_headline": "Speakman dismisses 'reports of my death' as leadership speculation grows",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/nsw-liberal-leadership-speculation-mark-speakman-kellie-sloane/106026038",
          "published_at": "Wed, 19 Nov 2025 22:30:14 +0000",
          "title": "Speakman dismisses 'reports of my death' as leadership speculation grows",
          "standfirst": "NSW Opposition Leader Mark Speakman says no-one has approached him to mount a leadership challenge.",
          "content": "NSW Opposition Leader Mark Speakman says no-one has approached him to mount a leadership challenge.",
          "feed_position": 22
        }
      ],
      "popularity_score": 147.7809036111111,
      "ai_summary": [
        "NSW Opposition Leader Mark Speakman denies leadership challenge rumors.",
        "Speakman says no one has approached him about a leadership challenge.",
        "Leadership speculation is increasing.",
        "Speakman is the current leader of the NSW Opposition.",
        "He is addressing the rumors of a potential leadership challenge."
      ]
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 22:26:59 +0000",
      "title": "Trial to offer mental health care 'from the comfort of home'",
      "neutral_headline": "Trial to offer mental health care 'from the comfort of home",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-11-20/hospital-at-home-mental-health-trial-in-kemspey/106026032",
          "published_at": "Wed, 19 Nov 2025 22:26:59 +0000",
          "title": "Trial to offer mental health care 'from the comfort of home'",
          "standfirst": "NSW will run a state-first trial that will offer mental health patients care in their own home, but it will mean the town trialling the system loses its hospital-based mental health unit.",
          "content": "NSW will run a state-first trial that will offer mental health patients care in their own home, but it will mean the town trialling the system loses its hospital-based mental health unit.",
          "feed_position": 23
        }
      ],
      "popularity_score": 147.72673694444444,
      "ai_summary": [
        "NSW will trial mental health care in patients' homes.",
        "The trial will be the first of its kind in the state.",
        "The town trialing the system will lose its hospital-based mental health unit.",
        "The trial aims to provide care in a more accessible setting.",
        "The program will offer mental health services at home."
      ]
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 21:38:31 +0000",
      "title": "NASA unveils close-up pictures of Comet 3I/Atlas in our solar system",
      "neutral_headline": "NASA unveils close-up pictures of Comet 3I/Atlas in our solar system",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/comet-31-atlas-new-images/106030712",
          "published_at": "Wed, 19 Nov 2025 21:38:31 +0000",
          "title": "NASA unveils close-up pictures of Comet 3I/Atlas in our solar system",
          "standfirst": "Discovered in July this year, the comet known as 3I/Atlas is only the third confirmed object to visit our corner of the cosmos from another star.",
          "content": "Discovered in July this year, the comet known as 3I/Atlas is only the third confirmed object to visit our corner of the cosmos from another star.",
          "feed_position": 22
        }
      ],
      "popularity_score": 146.91895916666667,
      "ai_summary": [
        "NASA released close-up pictures of Comet 3I/Atlas.",
        "The comet was discovered in July of this year.",
        "Comet 3I/Atlas is only the third confirmed interstellar object.",
        "The comet has visited our solar system from another star.",
        "The images provide detailed views of the comet."
      ]
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 20:06:16 +0000",
      "title": "Hunt continues for man who stole car with baby inside and dumped him in box",
      "neutral_headline": "Hunt continues for man who stole car with baby inside and dumped him in box",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/baby-in-stolen-car-police-hunt-for-thief/106030586",
          "published_at": "Wed, 19 Nov 2025 20:06:16 +0000",
          "title": "Hunt continues for man who stole car with baby inside and dumped him in box",
          "standfirst": "Police search for a man who stole a car with a sleeping baby in the back seat from a supermarket car park in northern Victoria, before dumping the child in a box and driving away.",
          "content": "Police search for a man who stole a car with a sleeping baby in the back seat from a supermarket car park in northern Victoria, before dumping the child in a box and driving away.",
          "feed_position": 13
        }
      ],
      "popularity_score": 145.38145916666667,
      "ai_summary": [
        "Police are searching for a man who stole a car.",
        "A baby was in the car at the time of the theft.",
        "The man dumped the baby in a box.",
        "The car was stolen from a supermarket car park.",
        "The incident occurred in northern Victoria."
      ]
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 19:52:56 +0000",
      "title": "Uni students furious at 'shameful' plans to cut support service staff",
      "neutral_headline": "Uni students furious at 'shameful' plans to cut support service staff",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/university-of-wollongong-sexual-assault-support-redundancies/106021790",
          "published_at": "Wed, 19 Nov 2025 19:52:56 +0000",
          "title": "Uni students furious at 'shameful' plans to cut support service staff",
          "standfirst": "The University of Wollongong is considering redundancies at a well-regarded support service for victim-survivors of sexual assault.",
          "content": "The University of Wollongong is considering redundancies at a well-regarded support service for victim-survivors of sexual assault.",
          "feed_position": 21
        }
      ],
      "popularity_score": 145.15923694444444,
      "ai_summary": [
        "University of Wollongong students are angry about staff cuts.",
        "The university is considering redundancies at a support service.",
        "The support service assists victim-survivors of sexual assault.",
        "Students consider the plans \"shameful\".",
        "The cuts are impacting a well-regarded support service."
      ]
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 19:35:57 +0000",
      "title": "Data of up to 3.6m people exposed in cyber breaches, FOI shows",
      "neutral_headline": "Data of up to 3.6m people exposed in cyber breaches, FOI shows",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/delays-detecting-data-breaches-australian-mining-manufacturing/105978234",
          "published_at": "Wed, 19 Nov 2025 19:35:57 +0000",
          "title": "Data of up to 3.6m people exposed in cyber breaches, FOI shows",
          "standfirst": "Australia's mining and manufacturing sectors are taking up to two years to notice and report cyber breaches to authorities, prompting concerns about the data security of industries critical to the nation's economy.",
          "content": "Australia's mining and manufacturing sectors are taking up to two years to notice and report cyber breaches to authorities, prompting concerns about the data security of industries critical to the nation's economy.",
          "feed_position": 18
        }
      ],
      "popularity_score": 144.87618138888888,
      "ai_summary": [
        "Cyber breaches have exposed data of up to 3.6 million people.",
        "FOI requests revealed the data breaches.",
        "Australian mining and manufacturing sectors are affected.",
        "Breaches take up to two years to be reported.",
        "Concerns exist about data security in critical industries."
      ]
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 18:50:22 +0000",
      "title": "UWU boss accused of 'misleading' members about slush fund links",
      "neutral_headline": "Union Boss Faces Vote After Alleged Fund Misuse",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/uwu-national-secretary-tim-kennedy-accused-of-slush-fund-links/106028936",
          "published_at": "Wed, 19 Nov 2025 18:50:22 +0000",
          "title": "UWU boss accused of 'misleading' members about slush fund links",
          "standfirst": "The head of one of Australia's most powerful unions has suffered a vote of no confidence amid claims he was aware of allegedly improper use of members' resources to raise money from bosses for an election slush fund.",
          "content": "The head of one of Australia's most powerful unions has suffered a vote of no confidence amid claims he was aware of allegedly improper use of members' resources to raise money from bosses for an election slush fund.",
          "feed_position": 19
        }
      ],
      "popularity_score": 144.11645916666666,
      "ai_summary": [
        "The United Workers Union leader faces a no-confidence vote.",
        "Accusations involve improper use of member resources.",
        "Allegations claim funds were used for an election slush fund.",
        "The leader is accused of being aware of the fund's activities.",
        "The union is one of Australia's most powerful organizations."
      ]
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 18:49:54 +0000",
      "title": "Care provider quoted $14k to remove a 'few clumps' of coloured sand",
      "neutral_headline": "Care Provider Quoted $14,000 for Sand Removal",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/coloured-sand-asbestos-removal-cost/106029248",
          "published_at": "Wed, 19 Nov 2025 18:49:54 +0000",
          "title": "Care provider quoted $14k to remove a 'few clumps' of coloured sand",
          "standfirst": "A regional NSW after-school hours operator says an asbestos removal company wanted to charge her more than $14,000 to vacuum up a small amount of coloured sand that spilled onto a carpet.",
          "content": "A regional NSW after-school hours operator says an asbestos removal company wanted to charge her more than $14,000 to vacuum up a small amount of coloured sand that spilled onto a carpet.",
          "feed_position": 20
        }
      ],
      "popularity_score": 144.1086813888889,
      "ai_summary": [
        "A regional NSW after-school operator received a quote.",
        "The quote was for over $14,000 to remove colored sand.",
        "The sand spill was a small amount on a carpet.",
        "An asbestos removal company provided the quote.",
        "The operator is disputing the excessive cost."
      ]
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Wed, 19 Nov 2025 16:58:12 +0000",
      "title": "'We see you': UK warns Russia as spy ship nears British waters",
      "neutral_headline": "UK Warns Russia as Spy Ship Approaches Waters",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-11-20/uk-vows-to-act-as-russian-vessel-strays-close-to-territory/106030534",
          "published_at": "Wed, 19 Nov 2025 16:58:12 +0000",
          "title": "'We see you': UK warns Russia as spy ship nears British waters",
          "standfirst": "The Russian vessel had directed lasers at pilots of surveillance aircraft monitoring its activities.",
          "content": "The Russian vessel had directed lasers at pilots of surveillance aircraft monitoring its activities.",
          "feed_position": 17
        }
      ],
      "popularity_score": 142.24701472222222,
      "ai_summary": [
        "A Russian vessel is nearing British waters.",
        "The UK issued a warning to Russia.",
        "The Russian ship directed lasers at surveillance aircraft.",
        "The aircraft were monitoring the ship's activities.",
        "The incident raises concerns about potential escalation."
      ]
    }
  ]
}