{
  "updated_at": "2025-08-29T11:15:46.712Z",
  "clusters": [
    {
      "id": "cluster_11",
      "coverage": 4,
      "updated_at": "Fri, 29 Aug 2025 10:32:43 +0000",
      "title": "'No winners': Reality star TV Matt Wright found guilty of two charges",
      "neutral_headline": "Reality Star Found Guilty After Fatal Helicopter Crash",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/matt-wright-jury-deliberations/1723a3f2-df9e-42e3-a68d-bd0bed6f414f",
          "published_at": "Fri, 29 Aug 2025 10:32:43 +0000",
          "title": "'No winners': Reality star TV Matt Wright found guilty of two charges",
          "standfirst": "A widow has slammed reality TV star Matt Wright for trying to cover up evidence after a helicopter crash that killed her husband.",
          "content": "A widow has slammed reality TV star Matt Wright for trying to cover up evidence after a helicopter crash that killed her husband.Wright was charged with three counts of attempting to pervert the course of justice after the February 2022 crash killed his Outback Wrangler co-star Chris \"Willow\" Wilson and left pilot Sebastian Robinson a paraplegic.Mr Wilson&#x27;s widow Dani took aim at Wright, 46, after he was found guilty of two counts by a Supreme Court jury in Darwin on Friday.READ MORE: Call for &#x27;change of approach&#x27; following horror Porepunkah shootingThey failed to reach agreement on a third count after a four-week trial, with Acting Justice Allan Blow saying they were \"hopelessly deadlocked\".Wright faces up to 15 years in jail when he is sentenced on October 6.His legal team has already confirmed they will appeal the guilty verdicts.\"We&#x27;ll keep just moving forward with this, but it&#x27;s been devastating for everyone involved,\" Wright said outside court after his bail was extended.He later said in a statement there were \"no winners\" from the trial.\"The ordeal has been incredibly tough on everyone and it&#x27;s always been hard to understand why the focus of these investigations have been solely on me and not into the cause of the crash.\"READ MORE: &#x27;I&#x27;ve punched blokes in the mouth&#x27;: Katter threatens 9News journoMr Wilson&#x27;s widow said the case had been about an individual who attempted to pervert the course of justice and in doing so \"denied a complete, thorough and unimpeded investigation into the crash\".The charges against Wright did not relate to the cause of the accident and the prosecution did not allege he was responsible for the crash, Mr Wilson&#x27;s death or Robinson&#x27;s injuries.Mrs Wilson said the verdicts were a step closer to justice being served, lessons learned and accountability upheld.She said her two sons would soon spend their fourth Father&#x27;s Day without their dad.\"Once again there will be an empty seat at the table, a constant reminder of all that has been taken from us,\" she said, reading a statement outside court.\"In the midst of our grief we are comforted by the fact that Willow is with God in heaven.\"The crash occurred during a crocodile-egg collecting trip in Arnhem Land in the Northern Territory, with Mr Wilson slung on a line below the chopper to drop onto croc nests in remote swampland.READ MORE: The grim reality facing authorities in the hunt for accused cop killerThe Air Transport Safety Bureau concluded the helicopter ran out of fuel, causing the engine to shut down and the machine to crash to the ground.Wright was accused of lying to crash investigators about the amount of fuel in the machine, of trying to get Robinson to falsify flying hours and of asking a friend to \"torch\" the helicopter&#x27;s maintenance release.The jury could not reach agreement on the third count which regarded the \"torch\" claim.Prosecutors alleged Wright was worried investigators would learn his choppers&#x27; meters were regularly disconnected to extend flying hours beyond official thresholds and paperwork was falsified to match.Senior defence counsel David Edwardson KC worked hard to focus blame on Robinson, who was painted as a cocaine-trafficking \"party animal\".Edwardson accused Robinson, his mother and two brothers of colluding when they gave evidence Wright had asked at the injured pilot&#x27;s hospital bedside for him to falsify flying hours.Their aim, he alleged, was to put the focus on Wright in order to avoid serious charges against Robinson.Outside court on Friday, Robinson&#x27;s brother Zac Chellingworth read a statement from the pilot saying the verdicts brought some closure for the family \"but the scars of the defendant&#x27;s conduct are huge and permanent\".Robinson revealed he carried the \"immense grief\" of losing his mate, saying the trauma for his family had been relentless as he learnt to live in a wheelchair.The wounds were made worse by the defendant&#x27;s cover-up and failure to tell the truth, he said.\"I also faced a malicious and sustained campaign of lies aimed at destroying my reputation and that of my family. The jury saw the truth.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/89281bfa-54e8-4550-aa50-e83dabbf4803"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/29/porepunkah-alleged-police-killer-vanished-into-victorian-alpine-region-manhunt-continues-ntwnfb",
          "published_at": "Fri, 29 Aug 2025 10:06:24 GMT",
          "title": "Porepunkah’s alleged police killer vanished into wild alpine bush – leaving locals behind in the mess",
          "standfirst": "Dezi Freeman’s anti-government views and bushcraft skills were well-known in the small Victorian town before he allegedly killed two officersGet our breaking news email, free app or daily news podcastIt didn’t take long for Dezi Freeman to allegedly shoot and kill two police officers before he vanished into the bush in the Victorian high country, seemingly without a trace.That brief moment in time launched a manhunt that has involved hundreds of police officers from all over the country, some of Australia’s elite special forces, a visit from the premier and, as one local described it, a media “circus” in the small town of Porepunkah, in Victoria’s north east. Continue reading...",
          "content": "Dezi Freeman’s anti-government views and bushcraft skills were well-known in the small Victorian town before he allegedly killed two officersGet our breaking news email, free app or daily news podcastIt didn’t take long for Dezi Freeman to allegedly shoot and kill two police officers before he vanished into the bush in the Victorian high country, seemingly without a trace.That brief moment in time launched a manhunt that has involved hundreds of police officers from all over the country, some of Australia’s elite special forces, a visit from the premier and, as one local described it, a media “circus” in the small town of Porepunkah, in Victoria’s north east. Continue reading...",
          "feed_position": 0
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/29/matt-wright-outback-wrangler-trial-verdict-ntwnfb",
          "published_at": "Fri, 29 Aug 2025 10:03:31 GMT",
          "title": "Outback Wrangler star Matt Wright found guilty on two charges after fatal helicopter crash but jury deadlocked on third",
          "standfirst": "Reality TV star accused of trying to cover up evidence following the February 2022 crash that killed co-star Chris ‘Willow’ WilsonFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastReality TV star Matt Wright has been found guilty of two counts of attempting to pervert the course of justice after a deadly helicopter crash.But a supreme court jury in Darwin on Friday failed to reach agreement on a third count after a four-week trial held before acting justice Allan Blow. Continue reading...",
          "content": "Reality TV star accused of trying to cover up evidence following the February 2022 crash that killed co-star Chris ‘Willow’ WilsonFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastReality TV star Matt Wright has been found guilty of two counts of attempting to pervert the course of justice after a deadly helicopter crash.But a supreme court jury in Darwin on Friday failed to reach agreement on a third count after a four-week trial held before acting justice Allan Blow. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb",
          "published_at": "Fri, 29 Aug 2025 08:03:26 GMT",
          "title": "Severe thunderstorm warning for Porepunkah as manhunt continues – as it happened",
          "standfirst": "This blog is now closedGet our breaking news email, free app or daily news podcastExpelled ambassador says allegations against Iran ‘baseless’ during Sydney airport exitIran’s former ambassador to Australia – now persona non grata – denied allegations his government was behind two antisemitic arson attacks in Australia, describing the accusations as “baseless” as he left the country. Continue reading...",
          "content": "This blog is now closedGet our breaking news email, free app or daily news podcastExpelled ambassador says allegations against Iran ‘baseless’ during Sydney airport exitIran’s former ambassador to Australia – now persona non grata – denied allegations his government was behind two antisemitic arson attacks in Australia, describing the accusations as “baseless” as he left the country. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/news/2025/aug/29/porepunkah-raid-arrests-search-for-alleged-police-killer-dezi-freeman-continues-ntwnfb",
          "published_at": "Fri, 29 Aug 2025 07:25:02 GMT",
          "title": "Porepunkah police shooting: wife of alleged killer Dezi Freeman arrested in late-night raid as manhunt continues",
          "standfirst": "Victoria police arrested and interviewed a 42-year-old woman and a 15-year-old boy, releasing them ‘pending further inquiries’What we know so far about the Victoria police shooting and suspect Dezi FreemanReport: Porepunkah suspect used to spy on my family with drones, says former neighbourGet our breaking news email, free app or daily news podcastPolice overnight arrested the wife of Porepunkah shooting suspect Dezi Freeman, interviewing and releasing the 42-year-old woman and a 15-year-old boy “pending further inquiries” as the manhunt in Victoria’s high country continues.As the massive police operation to find the alleged cop killer marked its fourth day on Friday, the Bureau of Meteorology issued an emergency warning for severe thunderstorms in Victoria’s north-east, including the town of Porepunkah. Continue reading...",
          "content": "Victoria police arrested and interviewed a 42-year-old woman and a 15-year-old boy, releasing them ‘pending further inquiries’What we know so far about the Victoria police shooting and suspect Dezi FreemanReport: Porepunkah suspect used to spy on my family with drones, says former neighbourGet our breaking news email, free app or daily news podcastPolice overnight arrested the wife of Porepunkah shooting suspect Dezi Freeman, interviewing and releasing the 42-year-old woman and a 15-year-old boy “pending further inquiries” as the manhunt in Victoria’s high country continues.As the massive police operation to find the alleged cop killer marked its fourth day on Friday, the Bureau of Meteorology issued an emergency warning for severe thunderstorms in Victoria’s north-east, including the town of Porepunkah. Continue reading...",
          "feed_position": 4
        },
        {
          "source": "Canberra Times",
          "url": "https://www.canberratimes.com.au/story/8898331/outback-wranglers-nt-home-hits-the-market-amid-trial/",
          "published_at": "Fri, 29 Aug 2025 12:30:00 +1000",
          "title": "Outback Wrangler Matt Wright family home under offer after being found guilty on chopper charges",
          "standfirst": "The offer on the family home comes as the TV star faces serious legal challenges.",
          "content": "The offer on the family home comes as the TV star faces serious legal challenges.",
          "feed_position": 7,
          "image_url": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/170682627/e428837a-ff51-47df-b7e8-134735460d64.jpg/r1_0_1758_990_w600_h338_fmax.jpg"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/media/commentisfree/2025/aug/29/family-of-erin-pattersons-victims-say-mushroom-trial-media-frenzy-fed-off-their-suffering",
          "published_at": "Fri, 29 Aug 2025 02:29:03 GMT",
          "title": "Family of Erin Patterson’s victims say mushroom trial media frenzy fed off their suffering | The Weekly Beast",
          "standfirst": "Heather and Ian Wilkinson’s daughter says it is ‘revolting to experience our family’s tragedy being turned into entertainment’. Plus: Andrew Greene’s second chanceFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAs Erin Patterson faced a plea hearing on Monday, several of her victims’ families told the court how the media’s interest in the case had exacerbated their suffering.The daughter of Heather and Ian Wilkinson, Ruth Dubois, said the media’s behaviour had changed the way she interacts with people, leaving her isolated. Continue reading...",
          "content": "Heather and Ian Wilkinson’s daughter says it is ‘revolting to experience our family’s tragedy being turned into entertainment’. Plus: Andrew Greene’s second chanceFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAs Erin Patterson faced a plea hearing on Monday, several of her victims’ families told the court how the media’s interest in the case had exacerbated their suffering.The daughter of Heather and Ian Wilkinson, Ruth Dubois, said the media’s behaviour had changed the way she interacts with people, leaving her isolated. Continue reading...",
          "feed_position": 10
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/matt-wright-supreme-court-trial-verdict-guilty-two-counts/105705404",
          "published_at": "Fri, 29 Aug 2025 01:55:43 +0000",
          "title": "Matt Wright guilty on two counts of hindering chopper crash investigation",
          "standfirst": "Celebrity crocodile wrangler Matt Wright is found guilty on two counts of attempting to pervert the course of justice, after a month-long Supreme Court trial.",
          "content": "Celebrity crocodile wrangler Matt Wright is found guilty on two counts of attempting to pervert the course of justice, after a month-long Supreme Court trial.",
          "feed_position": 2
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/29/governor-general-office-review-claims-bullying-dysfunction-culture-of-fear-ntwnfb",
          "published_at": "Fri, 29 Aug 2025 01:14:30 GMT",
          "title": "Damning review of governor general’s office hears claims of past bullying, dysfunction and a culture of fear",
          "standfirst": "Independent review commissioned by the government upon Sam Mostyn’s appointment to the office focuses on diversity and ‘capabilities’ of staff Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA damning review into the governor general’s office has heard historic allegations of bullying and harassment, “inappropriate sharing of personal information” and staff reluctant to complain for fear of reprisal.The independent review, from respected former public servant Vivienne Thom, made scathing findings about alleged dysfunction within the office, said its lack of diversity did not reflect the nation, and recommended an “external intervention” to overhaul the office. Continue reading...",
          "content": "Independent review commissioned by the government upon Sam Mostyn’s appointment to the office focuses on diversity and ‘capabilities’ of staff Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA damning review into the governor general’s office has heard historic allegations of bullying and harassment, “inappropriate sharing of personal information” and staff reluctant to complain for fear of reprisal.The independent review, from respected former public servant Vivienne Thom, made scathing findings about alleged dysfunction within the office, said its lack of diversity did not reflect the nation, and recommended an “external intervention” to overhaul the office. Continue reading...",
          "feed_position": 7
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/news/commentisfree/2025/aug/29/porepunkah-killings-how-the-search-for-alleged-police-killer-dezi-freeman-will-lead-through-treacherous-terrain-ntwnfb",
          "published_at": "Fri, 29 Aug 2025 00:25:44 GMT",
          "title": "Porepunkah killings: how the search for alleged police killer Dezi Freeman will lead through treacherous terrain",
          "standfirst": "With snow-capped peaks, fog and winter rain hampering the search, what tactics and technology do police have at their disposal?Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA large-scale hunt is under way for Dezi Freeman, the so-called sovereign citizen who allegedly killed two Victorian police officers while they were attempting to execute a search warrant.Freeman fled into the bushland surrounding the Porepunkah property in Victoria’s high country and remains on the run. Continue reading...",
          "content": "With snow-capped peaks, fog and winter rain hampering the search, what tactics and technology do police have at their disposal?Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastA large-scale hunt is under way for Dezi Freeman, the so-called sovereign citizen who allegedly killed two Victorian police officers while they were attempting to execute a search warrant.Freeman fled into the bushland surrounding the Porepunkah property in Victoria’s high country and remains on the run. Continue reading...",
          "feed_position": 11
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/aug/28/the-reynolds-v-higgins-defamation-ruling-concludes-a-protracted-legal-battle-but-when-will-the-saga-end-ntwnfb",
          "published_at": "Thu, 28 Aug 2025 15:00:54 GMT",
          "title": "The Reynolds v Higgins defamation ruling concludes a protracted legal battle. But when will the saga end?",
          "standfirst": "More than six years after one of the most contested events in Australian political history, the legal fallout continuesFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTwo Liberal staffers entered Linda Reynolds’ ministerial suite in Parliament House in the early hours of 23 March 2019.That night and how those around them responded in the years after have become one of the most contested events in Australia’s political history. Continue reading...",
          "content": "More than six years after one of the most contested events in Australian political history, the legal fallout continuesFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTwo Liberal staffers entered Linda Reynolds’ ministerial suite in Parliament House in the early hours of 23 March 2019.That night and how those around them responded in the years after have become one of the most contested events in Australia’s political history. Continue reading...",
          "feed_position": 8
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/89281bfa-54e8-4550-aa50-e83dabbf4803",
      "popularity_score": 4019.2823022222224,
      "ai_summary": [
        "Matt Wright, a reality TV star, was found guilty of two charges related to a helicopter crash.",
        "A jury failed to reach a verdict on a third charge against Wright.",
        "The crash resulted in the death of Chris ‘Willow’ Wilson.",
        "The widow of the deceased criticized Wright for attempting to cover up evidence.",
        "A manhunt continues for Dezi Freeman, the alleged killer of two police officers."
      ]
    },
    {
      "id": "cluster_19",
      "coverage": 3,
      "updated_at": "Fri, 29 Aug 2025 20:14:46 +1000",
      "title": "Victorians warned to brace for destructive wind",
      "neutral_headline": "Victorians Warned of Destructive Winds, Power Outages",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victorians-warned-to-brace-for-destructive-wind-20250829-p5mqzr.html",
          "published_at": "Fri, 29 Aug 2025 20:14:46 +1000",
          "title": "Victorians warned to brace for destructive wind",
          "standfirst": "Victorians have been warned to expect dangerous winds, power outages and fallen trees as a destructive cold front tears across Australia's south-eastern states.",
          "content": "Victorians have been warned to expect dangerous winds, power outages and fallen trees as a destructive cold front tears across Australia's south-eastern states.",
          "feed_position": 16,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/cf830a7f1253e0352dda42a10e2f9757935a2397"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/weather-warning-for-dangerous-winds-power-outages-victoria/105712746",
          "published_at": "Fri, 29 Aug 2025 06:30:53 +0000",
          "title": "Power outages expected as dangerous winds batter Victoria",
          "standfirst": "The state's emergency management commissioner warns Victorians to \"prepare now\" as dangerous winds exceeding 100 kilometres per hour approach.",
          "content": "The state's emergency management commissioner warns Victorians to \"prepare now\" as dangerous winds exceeding 100 kilometres per hour approach.",
          "feed_position": 3
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australia-weather-update-severe-conditions-for-south-eastern-states/0eec56a9-c53e-4080-9094-b87630694aa0",
          "published_at": "Fri, 29 Aug 2025 05:34:27 +0000",
          "title": "'Expect power outages, fallen trees': Victorians warned to brace for destruction",
          "standfirst": "M utliple states are in the firing line as winter goes out with a bang.",
          "content": "Victorians have been warned to expect dangerous winds, power outages and fallen trees as a destructive cold front tears across Australia&#x27;s south eastern states.\"We have not seen a significant weather event like this in some years,\" Emergency Management Commissioner Tim Wiebusch said at a press conference this afternoon.Meanwhile the South Australian State Emergency Service (SES) responded to hundreds of calls for help after a severe storm ripped through the state this morning.READ MORE: Man executed over triple murder motivated by $3000 debtHere&#x27;s everything you need to know about the powerful polar blast sweeping across SA, Victoria, NSW and Tasmania.VictoriaVictorians are bracing for damaging winds and gusts exceeding 100 km/h in some areas on Friday afternoon an into Saturday morning.Locations which may be affected include Melbourne, Geelong, Mildura, Horsham, Warrnambool, Maryborough, Ballarat, Stawell, Hamilton, Portland, Wonthaggi, Bacchus Marsh, Dandenong Ranges, Mt Hotham and Mt Buller.Gusts of 113km/h have already been recorded at Mt Hotham, as well as 100km/h gusts at Mt Buller, 94km/h at Horsham in the state&#x27;s west.Five watch and act warnings have been issued across Victoria.READ MORE: Lisa wanted to retire soon. After losing $60,000 in super, that won&#x27;t be possible\"Expect that there will be power outages. Expect that there will be fallen power lines,\" Wiebusch said today.He urged residents to charge their mobile phones and avoid unnecessary travel, especially in areas with lots of tree coverage.He also warned Victorians to secure outdoor items around their homes to ensure they don&#x27;t \"become missiles\" when winds pick up.Victoria State Emergency Service ( VICSES) has already received 76 requests for assistance and those numbers are growing.It has also seen two cars and one person impacted by a tree, according to state agency commander Mark Cattell.The cold front could also produce blizzard conditions in some alpine areas, according to Bureau of Meteorology senior meteorologist Kirsty Turner.The worst weather is expected overnight and locals have been warned to stay indoors. \"Remain vigilant, don&#x27;t be travelling if you don&#x27;t need to be ... and if you can remain indoors in safety, that&#x27;s where you need to be,\" Cattell said.South AustraliaMultiple trees have already been brought down in SA, where damaging winds have snapped massive gum trees in half, blocking roads and damaging homes.One resident in the Elizabeth area told 9News that he heard a loud bang, only to find his roof had collapsed onto his driveway and over his cars.READ MORE: Florida taxpayers may lose $333m on empty &#x27;Alligator Alcatraz&#x27; as judge orders shutdownThe weather system will bring damaging winds, showers and snow today and into the weekend.Conditions are expected to gradually ease from the west during the evening, although may continue into the late evening over the state&#x27;s Lower South East.Communities which may be affected include Adelaide, Port Lincoln, Whyalla, Renmark, Mount Gambier and Ceduna.The Bureau of Meteorology has issued severe weather warnings across the state, where wind gusts are expected to reach up to 130km/h in some areas.A gale warning was issued by the bureau today for a huge stretch of coastal waters, including the Adelaide metropolitan area.The SES is advising people to leave their boats at home for the next couple of days. New South WalesWarnings for damaging winds and possible blizzards have been issued in parts of NSW today as the cold front crosses the state.People in the Snowy Mountains and parts of the Mid North Coast, Hunter, Illawarra, and other regions in the far southwest and elevated parts of the southeast of NSW have been urged to stay vigilant.Winds averaging 80-90km/h with gusts up to 110km/h are forecast to continue through the night in alpine areas above 1900m.READ MORE: Recently-liquidated major retailer fined $25m for breaching consumer lawsStrong winds are also expected in lower eastern areas and the far southwest, where gusts of up to 90km/h are possible.Winds are forecast to ease below warning thresholds by Saturday evening.The NSW National Parks and Wildlife Service has urged anyone planning back country travel to postpone until the weather improves.Locations which may be affected by the wild weather include Goulburn, Scone, Katoomba, Cooma, Wentworth, Bowral, Braidwood, Nowendoc, Thredbo, Perisher and Gloucester.Sydney, where the Sydney Marathon is set to be held on Saturday, should not be affected.Tasmania A severe weather warning has also been issued for parts of Tasmania.People in King Island and parts of North West Coast, Central North, Central Plateau and Midlands Forecast Districts are bracing for vigorous southerly winds from the same low pressure system affecting much of the south east coast.Damaging winds averaging 60 to 70 km/h with peak gusts up to 110 km/h are possible from tonight in King Island.Residents in the Great Western Tiers have been warned to expect the same, with conditions to ease on Saturday morning.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 9,
          "image_url": "https://prod.static9.net.au/fs/f809fb48-58ee-4e31-a4cc-fa27f7b01c89"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/cf830a7f1253e0352dda42a10e2f9757935a2397",
      "popularity_score": 3018.9831355555557,
      "ai_summary": [
        "Victorians are warned to expect dangerous winds and power outages.",
        "A destructive cold front is moving across Australia's south-eastern states.",
        "Emergency management commissioner urges Victorians to prepare for the weather.",
        "Dangerous winds exceeding 100 kilometers per hour are expected.",
        "Multiple states are in the firing line as winter ends."
      ]
    },
    {
      "id": "cluster_4",
      "coverage": 2,
      "updated_at": "Fri, 29 Aug 2025 21:03:24 +1000",
      "title": "Another Thai prime minister bites the dust after Constitutional Court ruling",
      "neutral_headline": "Thai Court Sacks Prime Minister Paetongtarn Shinawatra",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/asia/another-thai-prime-minister-bites-the-dust-after-constitutional-court-ruling-20250829-p5mr13.html",
          "published_at": "Fri, 29 Aug 2025 21:03:24 +1000",
          "title": "Another Thai prime minister bites the dust after Constitutional Court ruling",
          "standfirst": "Thailand’s suspended Prime Minister Paetongtarn Shinawatra has been officially sacked.",
          "content": "Thailand’s suspended Prime Minister Paetongtarn Shinawatra has been officially sacked.",
          "feed_position": 4,
          "image_url": "https://static.ffx.io/images/$zoom_0.1914%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/9eb9b3d2dd5518efcf64d9bba1f2d39c449ac7c3"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/thai-court-sacks-pm/105714892",
          "published_at": "Fri, 29 Aug 2025 09:00:53 +0000",
          "title": "Thai court sacks PM Paetongtarn Shinawatra",
          "standfirst": "Thailand's Constitutional Court dismisses Prime Minister Paetongtarn Shinawatra from office for an ethics violation after only a year in power.",
          "content": "Thailand's Constitutional Court dismisses Prime Minister Paetongtarn Shinawatra from office for an ethics violation after only a year in power.",
          "feed_position": 5
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.1914%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/9eb9b3d2dd5518efcf64d9bba1f2d39c449ac7c3",
      "popularity_score": 2019.793691111111,
      "ai_summary": [
        "Thailand's Constitutional Court dismissed Prime Minister Paetongtarn Shinawatra.",
        "The dismissal was due to an ethics violation.",
        "Shinawatra was in power for only a year before being removed."
      ]
    },
    {
      "id": "cluster_13",
      "coverage": 2,
      "updated_at": "Fri, 29 Aug 2025 20:17:07 +1000",
      "title": "Round 26: Warriors v Eels Match Highlights",
      "neutral_headline": "Warriors Lose to Eels After Bunker Denies Try",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/sport/nrl/round-26-warriors-v-eels-match-highlights-20250829-p5mr1e.html",
          "published_at": "Fri, 29 Aug 2025 20:17:07 +1000",
          "title": "Round 26: Warriors v Eels Match Highlights",
          "standfirst": "New Zealand Warriors take on the Parramatta Eels in Round 26 of the 2025 NRL Premiership at GO Media Stadium, Auckland.",
          "content": "New Zealand Warriors take on the Parramatta Eels in Round 26 of the 2025 NRL Premiership at GO Media Stadium, Auckland.",
          "feed_position": 10,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/e9f61d5a90dcb0e5be93a70e8db0f7272cce0408"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/nrl-live-updates-warriors-eels-storm-roosters-round-26/105714292",
          "published_at": "Fri, 29 Aug 2025 06:59:45 +0000",
          "title": "Live: Warriors denied match-winning try by Bunker as top four hopes take blow",
          "standfirst": "The Parramatta Eels have produced another upset over a top-eight side, defeating the fourth-placed New Zealand Warriors in Auckland, 26-22. Follow live.",
          "content": "The Parramatta Eels have produced another upset over a top-eight side, defeating the fourth-placed New Zealand Warriors in Auckland, 26-22. Follow live.",
          "feed_position": 9
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/e9f61d5a90dcb0e5be93a70e8db0f7272cce0408",
      "popularity_score": 2019.0223022222222,
      "ai_summary": [
        "The Parramatta Eels defeated the New Zealand Warriors in Auckland, 26-22.",
        "The Warriors had a match-winning try disallowed by the Bunker.",
        "The Eels upset a top-eight side, impacting the Warriors' top-four hopes."
      ]
    },
    {
      "id": "cluster_14",
      "coverage": 2,
      "updated_at": "Fri, 29 Aug 2025 20:16:15 +1000",
      "title": "Friends pay tribute to Vadim De Waart",
      "neutral_headline": "Friends Remember Slain Police Officer Vadim De Waart",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/friends-pay-tribute-to-vadim-de-waart-20250829-p5mr1c.html",
          "published_at": "Fri, 29 Aug 2025 20:16:15 +1000",
          "title": "Friends pay tribute to Vadim De Waart",
          "standfirst": "Friends of Porepunkah shooting victim Senior Constable Vadim De Waart have remembered him as a warm, bright and adventurous person.",
          "content": "Friends of Porepunkah shooting victim Senior Constable Vadim De Waart have remembered him as a warm, bright and adventurous person.",
          "feed_position": 11,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/59d6f9b09bb6aa83596e7e0e6e8e79fb2fdbed9c"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/porepunkah-police-shooting-victims-neal-thompson-vadim-de-waart/44e6e519-6e7a-4ba5-869f-ebfe95424f9c",
          "published_at": "Fri, 29 Aug 2025 09:56:30 +0000",
          "title": "Friends remember Belgian-Australian police officer killed in senseless ambush",
          "standfirst": "Friends of a Belgian-Australian police officer killed in a senseless ambush in Victoria&#x27;s alpine region have remembered him as a warm, bright and adventurous person.",
          "content": "Friends of a Belgian-Australian police officer killed in an ambush in Victoria&#x27;s alpine region have remembered him as a warm, bright and adventurous person.Senior Constable Vadim de Waart, 35, was killed alongside his colleague Detective Leading Senior Constable Neal Thompson after at a Porepunkah property whilst they were serving a warrant.De Waart had been on secondment to Wangaratta from Melbourne.READ MORE: &#x27;Wear him down&#x27;: Weather a major factor in gunman search\"Everybody loved Vadim. He was an amazing person,\" friend Muniera Dubery said.\"He wanted to make a difference and doing things, but also I think he really loved talking to people, helping people and he just liked making everyone&#x27;s day brighter.\"His friends said they were struggling to come to terms with the fact De Waart was not coming home.\"Wherever you are Vadim, we miss you and we love you and I&#x27;m sorry this happened to you because you were such a good guy. You didn&#x27;t deserve it,\" friend Yalenka said.\"I want [accused gunman Dezi Freeman] to know what a senseless act he has undertaken and that it was unnecessary and I want him to know he is never ever going to get away with it.\"Loved ones, colleagues and emergency services last night paid tribute to the two police officers at Wangaratta Police Station.Two minutes of silence was observed outside the station, representing one minute for each of the fallen officers. CFA trucks, ambulances and men and women in uniform were seen commemorating their colleagues with a military-style salute and march.A floral tribute at the entrance to the Wangaratta Police Station continues to grow, with dozens of arrangements and heartfelt cards surrounding photos of the two fallen officers. Thompson&#x27;s soccer teammates today remembered \"Thommo\" as a larrikin, a proud police officer and a man who worked for the community.\"Neil was a tower of a man in every sense,\" friend Tom Marshall said.\"Thommo loved his job and he&#x27;s very proud of it and, sadly, he&#x27;s died doing what he loved.\"READ MORE: Queensland woman denied boarding, forced to pay $10k over visa error\"It&#x27;s it&#x27;s like losing a family member, and all of the police across Australia and probably internationally are feeling the pain that we&#x27;re feeling, which is horrible,\" friend Mark Williams said.State officials yesterday met with Thompson&#x27;s partner Lisa to offer their support.\"It was a privilege alongside the Premier and Chief Commissioner Bush to spend some time today with Mr Thompson&#x27;s wife Lisa, also a serving officer of Victoria Police,\" Police Minister Anthony Carbines said.\"We pay our deepest respects to these officers and their families and we wish our police members who hunt a dangerous fugitive and armed offender every success and we want them to stay safe as they do that.\"A minute&#x27;s silence was also observed in federal parliament in honour of Thompson and De Waart, as their colleagues battled strong weather conditions in the bid to bring their alleged killer to justice.\"Our hearts go out to everyone whose heart is breaking,\" Prime Minister Anthony Albanese said.\"We honour the bravery of detective leading senior constable Neal Thompson and senior constable Vadim De Waart and our hopes and prayers are with their fellow officers at the scene, including one currently in The Alfred Hospital in Melbourne receiving treatment for their wounds.\"As a Parliament, as a country, we offer our deepest condolences to all whose worlds have been shattered by this horrific shooting.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 8,
          "image_url": "https://prod.static9.net.au/fs/9513a34e-34ec-42f0-9318-73bf55db91bd"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/59d6f9b09bb6aa83596e7e0e6e8e79fb2fdbed9c",
      "popularity_score": 2019.0078577777779,
      "ai_summary": [
        "Friends are paying tribute to Vadim De Waart, a victim of the Porepunkah shooting.",
        "De Waart was remembered as warm, bright, and adventurous.",
        "He was a Belgian-Australian police officer."
      ]
    },
    {
      "id": "cluster_21",
      "coverage": 2,
      "updated_at": "Fri, 29 Aug 2025 20:12:35 +1000",
      "title": "Albanese expected to increase Australia’s defence spending",
      "neutral_headline": "Albanese Expected to Increase Australian Defence Spending",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/albanese-expected-to-increase-australia-s-defence-spending-20250829-p5mr19.html",
          "published_at": "Fri, 29 Aug 2025 20:12:35 +1000",
          "title": "Albanese expected to increase Australia’s defence spending",
          "standfirst": "Pressure from US President Trump has seemingly led to Prime Minister Anthony Albanese being destined to increase Australia’s defence spending.",
          "content": "Pressure from US President Trump has seemingly led to Prime Minister Anthony Albanese being destined to increase Australia’s defence spending.",
          "feed_position": 18,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/6475eb4a84cf9eaceb817934266ff6743269acd3"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/prime-minister-hints-australia-could-lift-defence-budget/c38dc092-1a4f-403c-b286-06eb980a1fe2",
          "published_at": "Fri, 29 Aug 2025 02:19:41 +0000",
          "title": "PM hints at $40 billion defence splurge to soothe Trump",
          "standfirst": "W hile insisting Australia will &#x27;do what we like&#x27;, Anthony Albanese left the door open to greater military spending.",
          "content": "P rime Minister Anthony Albanese hasn&#x27;t ruled out Australia lifting its defence spending by tens of billions of dollars a year as the Trump administration nudges allies to increase their military budgets.Albanese was speaking on Today this morning amid the fallout of Defence Minister Richard Marles&#x27; visit to Washington DC, and confusion about whether he had sit-down talks with his US counterpart.Albanese said his government had already committed to raising spending on the Australian Defence Force by $10 billion over the short term, and could not rule out spending more.READ MORE: Teenage boy, woman arrested by police in Porepunkah investigationWhen quizzed about the federal government&#x27;s defence budget, he insisted \"what we&#x27;re going to do is do what we like, which is to provide us with whatever assets we need and our capability\".Albanese pointed to last month&#x27;s announcement of a $10 billion order with a Japanese company for new warships to equip the Royal Australian Navy. But he also left the door open to more spending for the armed forces. \"We&#x27;ll continue to provide whatever investment is required to make sure that we lift our capability and we lift our relationships as well,\" Albanese said.The federal government has projected defence spending to rise from 2.02 per cent of GDP to 2.33 per cent by 2033 to 2034.READ MORE: The twisted messages posted by church mass shooterBut US officials, such as Defence Secretary Pete Hegseth, want Australia to go further and set a target of 3.5 per cent GDP, equivalent to about $97 billion annually.Such a move would mean the Treasury having to find an extra $40 billion, putting a severe strain on other government spending programmes.The Trump administration insists its allies in the Indo-Pacific and Europe must step up to meet emerging security challenges, and ease the burden on the US military.In June, US President Donald Trump persuaded members of the NATO alliance to invest 5 per cent of their GDP on defence and security.The US says China&#x27;s ambitions on Taiwan pose a threat to global peace and stability, and require its regional allies, including Australia, to play their part on defence. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 7,
          "image_url": "https://prod.static9.net.au/fs/af780593-4a7f-4f6d-865d-6363979c6422"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/6475eb4a84cf9eaceb817934266ff6743269acd3",
      "popularity_score": 2018.9467466666667,
      "ai_summary": [
        "Prime Minister Anthony Albanese is expected to increase Australia's defence spending.",
        "Pressure from US President Trump is a factor in the expected increase.",
        "Albanese hinted at a $40 billion defence spending increase."
      ]
    },
    {
      "id": "cluster_24",
      "coverage": 2,
      "updated_at": "Fri, 29 Aug 2025 09:56:43 +0000",
      "title": "Accused Porepunkah gunman's wife arrested as 450 cops continue manhunt",
      "neutral_headline": "Accused Gunman's Wife Arrested in Porepunkah Manhunt",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/porepunkah-victoria-police-officer-shooting-people-escorted-from-home/58cb7c8b-9cc2-412b-baf9-94a6619eebe4",
          "published_at": "Fri, 29 Aug 2025 09:56:43 +0000",
          "title": "Accused Porepunkah gunman's wife arrested as 450 cops continue manhunt",
          "standfirst": "More than 450 police officers from across the country are now part of a high country manhunt for accused Porepeunkah gunman Dezi Freeman, after his partner was arrested last night.",
          "content": "More than 450 police officers are now part of a manhunt for accused gunman Dezi Freeman, police have revealed, after Freeman&#x27;s wife and a 15-year-old were arrested overnight.Victoria Police chief commissioner Mike Bush today confirmed Freeman&#x27;s partner Mali Freeman, 42, and a 15-year-old boy were arrested just after 8.30pm after 12 police vehicles surrounded a property in Porepunkah, about 300km from Melbourne.Officers dismounted and surrounded a property as a loudspeaker advised people inside to come out with nothing in their hands.READ MORE: Amid calls to fast-track the national gun register, one expert says a different issue is far more pressing\"There&#x27;s a lot of cops dressed up in all sorts of gear,\" a neighbour told 9News.\"Very scary, with the two little kids at home. Luckily, they slept through it.\"About 10 people walked from the home before they were searched.Officers led away a woman and a baby.Mali Freeman and the teenager were interviewed and released without charge, pending further enquiries.Bush said they were \"interviewed totally and specifically related to the homicide investigation\".\"There may or may not be charges that follow, but it would be very inappropriate for me to say anything else at his point,\" he said.Fugitive may be using technology to aid evasion from policeHigh country fugitive Dezi Freeman may be using technology to help him hide from authorities, Bush said.Bush refused to reveal details about the police search for the accused killer, in fear it may assist him to evade police.\"It&#x27;s quite possible that the suspect at large has access to technology, so it would be very unwise of me, on behalf of my investigation and search team to share further information,\" Bush said.&#x27;We are not leaving&#x27;: Police from across the country rush to rural townMore than 450 police officers from Victoria, NSW, SA, the ACT and AFP are now involved in the \"very professional and coordinated operation\" to apprehend Freeman.\"Some are involved in search, some are involved in investigations, some are involved in supporting, and many are involved in community reassurance,\" Bush said.\"We&#x27;re also joined in that operation by Ambulance Victoria, the fire department, the local fire department, and we&#x27;re really, really appreciative of their efforts.\"Bush assured the local community that emergency services \"are not leaving here until this person is in custody\".\"We have many officers out in the field to keep you safe.\"Our partners from across other states, if they&#x27;re not here already, they&#x27;re on their way to support us\"All of our law enforcement colleagues and partners across Austrlia are leaning into this with us.\"Commissioner probed on Freeman&#x27;s firearm license Bush revealed Freeman&#x27;s firearm license had been revoked before the deadly shooting.He refused to elaborate on whether he had transferred ownership of his firearms to somebody close to him.\"Of course that forms an offence, which also relates to the search warrants last night, in relation to how someone can be unlawfully in possession of firearms,\" Bush said. \"It forms part of the investigation and could form part of the prosecution if that does occur.\"Bush also issued a direct message to the suspected gunman. \"If that person is listening, it really is time to lay down your firearms and give yourself up, so that we can all bring this to a safe conclusion and this community can get back to what they love to do,\" he said.Funeral arrangements under way Bush gave a condition update on the third police officer seriously wounded in Tuesday&#x27;s fatal shooting .\"He&#x27;s had one operation. He will have another. He will recover. He&#x27;s in good hands,\" Bush said.Funeral arrangements for Detective Leading Senior Constable Neal Thompson and Senior Constable Vadim de Waart were being organised, Bush said.\"We are not at a position yet to announce funeral arrangements, but those arrangements are progressing very well and we&#x27;ll be able to share that with you at some point,\" Bush said.Senior Victoria Police and state officials including the premier have met with the families of both fallen officers. \"In the last few days we have met with Neil&#x27;s wife, Lisa, to give her every support,\" Bush said.\"I&#x27;ve also spoken to Vadim&#x27;s aunty, who lives in Melbourne, to offer them every support.\"Premier Jacinta Allan, Police Minister Anthony Carbines added to a growing floral tribute at Wangaratta Police Station.No sightings since manhunt commenced Earlier today, police confirmed there have been no sightings of accused gunman Dezi Freeman since Tuesday.Porepunkah has been in lockdown since three police officers were shot when executing a search warrant, two fatally.The man believed responsible, Dezi Freeman, also known as Desmond Filby, remains at large.Also overnight, an emotional vigil was held in the town of Wangaratta for one of the officers shot dead in the attack.The town is where Detective Leading Senior Constable Neal Thompson, 59, used to work. He was only two weeks away from retirement when he died.Freeman is accused of shooting dead Thompson and Constable Vadim De Waart on Tuesday morning at a home in Porepunkah.A third officer was allegedly shot and wounded in the leg and is recovering in hospital.Freeman is a self-described \"sovereign citizen\" who is known to police.According to the Australian Federal Police, a sovereign citizen – also known as a SovCit – seeks to \"disassociate from society and refuses to engage with societal requirements like paying tax\".Police said he had several firearms on him, with senior officers confirming police had not recovered any weapons used in the attack. Hundreds of officers and specialist police have swarmed the small country town as Victoria Police commit every resource available to track down and apprehend Freeman.P olice are still working on the theory that the accused gunman remains in the Porepunkah area.Deputy Commissioner of Regional Operations Russell Barrett said yesterday the search area had been expanded but Freeman was believed to be close by.He also said the manhunt had been taking longer than expected. The rough terrain has been making the search difficult. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/1530f139-5229-4c71-849a-5b5308868e27"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/arrests-porepunkah-dezi-freeman-wife-son/105713412",
          "published_at": "Fri, 29 Aug 2025 05:36:16 +0000",
          "title": "Police not ruling out potential charges against Dezi Freeman's wife and son",
          "standfirst": "The two people arrested in relation to the search for alleged Porepunkah gunman Dezi Freeman were his wife and teenage son, police have confirmed.",
          "content": "The two people arrested in relation to the search for alleged Porepunkah gunman Dezi Freeman were his wife and teenage son, police have confirmed.",
          "feed_position": 1
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/1530f139-5229-4c71-849a-5b5308868e27",
      "popularity_score": 2018.6823022222222,
      "ai_summary": [
        "The wife of the accused Porepunkah gunman was arrested.",
        "Over 450 police officers are involved in the manhunt.",
        "Police are not ruling out potential charges against the gunman's wife and son.",
        "The gunman's teenage son was also arrested."
      ]
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 05:54:27 +0000",
      "title": "Tanya Plibersek approved water plan without reading it, court finds",
      "neutral_headline": "Tanya Plibersek Approved Water Plan Without Reading It, Court Finds",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/nsw-fractured-rock-water-resource-plan-traditional-owners-court/105711536",
          "published_at": "Fri, 29 Aug 2025 05:54:27 +0000",
          "title": "Tanya Plibersek approved water plan without reading it, court finds",
          "standfirst": "The federal court finds that the federal government failed traditional owners when the former water minister approved a water resource plan she had not read.",
          "content": "The federal court finds that the federal government failed traditional owners when the former water minister approved a water resource plan she had not read.",
          "feed_position": 0
        }
      ],
      "popularity_score": 347.64452444444447,
      "ai_summary": [
        "The federal court found the government failed traditional owners.",
        "Former water minister Tanya Plibersek approved a water resource plan.",
        "Plibersek had not read the water resource plan before approving it."
      ]
    },
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 10:29:21 +0000",
      "title": "Breaking: Israeli troops retrieve bodies of two hostages held in Gaza",
      "neutral_headline": "Breaking: Israeli troops retrieve bodies of two hostages held in Gaza",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/two-hostages-retrieved-by-israeli-troops/105715132",
          "published_at": "Fri, 29 Aug 2025 10:29:21 +0000",
          "title": "Breaking: Israeli troops retrieve bodies of two hostages held in Gaza",
          "standfirst": "The bodies of two Israeli hostages have been retrieved from Gaza.",
          "content": "The bodies of two Israeli hostages have been retrieved from Gaza.",
          "feed_position": 4
        }
      ],
      "popularity_score": 322.2261911111111
    },
    {
      "id": "cluster_27",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 09:10:18 +0000",
      "title": "Mother who forged daughter's medical documents granted immediate parole",
      "neutral_headline": "Mother who forged daughter's medical documents granted immediate parole",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/mother-faking-daughters-condition-granted-immediate-parole/105711170",
          "published_at": "Fri, 29 Aug 2025 09:10:18 +0000",
          "title": "Mother who forged daughter's medical documents granted immediate parole",
          "standfirst": "A north Queensland mother who forged medical documents falsifying her young daughter's medical conditions has been sentenced to two and a half years jail, then immediately granted parole.",
          "content": "A north Queensland mother who forged medical documents falsifying her young daughter's medical conditions has been sentenced to two and a half years jail, then immediately granted parole.",
          "feed_position": 3
        }
      ],
      "popularity_score": 320.9086911111111,
      "ai_summary": [
        "A mother forged medical documents for her daughter.",
        "She was sentenced to two and a half years in jail.",
        "The mother was immediately granted parole.",
        "The case originated in north Queensland."
      ]
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 10:59:14 +0000",
      "title": "Lawyers call for police involved in Kumanjayi White's death to be suspended",
      "neutral_headline": "Lawyers call for police involved in Kumanjayi White's death to be suspended",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/nt-lawyers-ask-police-in-kumanjayi-white-death-to-stand-down/105714928",
          "published_at": "Fri, 29 Aug 2025 10:59:14 +0000",
          "title": "Lawyers call for police involved in Kumanjayi White's death to be suspended",
          "standfirst": "Almost 80 Northern Territory lawyers have written to the government calling for \"external oversight\" in the investigation into Kumanjayi White's death in custody, and for the officers involved to be stood down during the probe.",
          "content": "Almost 80 Northern Territory lawyers have written to the government calling for \"external oversight\" in the investigation into Kumanjayi White's death in custody, and for the officers involved to be stood down during the probe.",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.72424666666666,
      "ai_summary": [
        "Almost 80 Northern Territory lawyers have written to the government.",
        "They are calling for \"external oversight\" in the investigation.",
        "They want the officers involved to be stood down during the probe.",
        "The case involves the death of Kumanjayi White in custody."
      ]
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 08:32:51 +0000",
      "title": "A-Leagues to move forward as Western United fight wind-up order",
      "neutral_headline": "A-Leagues to move forward as Western United fight wind-up order",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/football-western-united-enters-liquidation-federal-court/105713464",
          "published_at": "Fri, 29 Aug 2025 08:32:51 +0000",
          "title": "A-Leagues to move forward as Western United fight wind-up order",
          "standfirst": "Embattled A-Leages club Western United has successfully applied for a stay to be put on winding up orders handed down to owner WMG Football Club Limited, however the Australian Professional Leagues (APL) says it will kick on with preparations for the new season with or without the club.",
          "content": "Embattled A-Leages club Western United has successfully applied for a stay to be put on winding up orders handed down to owner WMG Football Club Limited, however the Australian Professional Leagues (APL) says it will kick on with preparations for the new season with or without the club.",
          "feed_position": 7
        }
      ],
      "popularity_score": 280.28452444444446,
      "ai_summary": [
        "Western United applied for a stay on winding up orders.",
        "The Australian Professional Leagues (APL) will prepare for the season.",
        "The APL will proceed with or without Western United.",
        "Western United is an embattled A-Leagues club."
      ]
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 08:10:02 +0000",
      "title": "Bob Carr looking forward to attending major Chinese military parade",
      "neutral_headline": "Bob Carr looking forward to attending major Chinese military parade",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/bob-carr-chinese-military-parade/105714668",
          "published_at": "Fri, 29 Aug 2025 08:10:02 +0000",
          "title": "Bob Carr looking forward to attending major Chinese military parade",
          "standfirst": "Former Victorian premier Dan Andrews was also included on a guest list released by China's assistant foreign minister.",
          "content": "Former Victorian premier Dan Andrews was also included on a guest list released by China's assistant foreign minister.",
          "feed_position": 7
        }
      ],
      "popularity_score": 279.90424666666667,
      "ai_summary": [
        "Bob Carr is looking forward to attending a Chinese military parade.",
        "Former Victorian premier Dan Andrews is also on the guest list.",
        "The guest list was released by China's assistant foreign minister."
      ]
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 07:21:16 +0000",
      "title": "Australia Post warns of 'intensifying structural headwinds' despite small profit",
      "neutral_headline": "Australia Post Faces Headwinds Despite Small Profit",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/australia-post-records-small-profit-but-us-tariffs-setback/105713946",
          "published_at": "Fri, 29 Aug 2025 07:21:16 +0000",
          "title": "Australia Post warns of 'intensifying structural headwinds' despite small profit",
          "standfirst": "Australia Post's chief executive defends the postal carrier's decision to immediately halt most shipping to the United States, just four days before a tariff deadline on low-value packages arriving there came into play.",
          "content": "Australia Post's chief executive defends the postal carrier's decision to immediately halt most shipping to the United States, just four days before a tariff deadline on low-value packages arriving there came into play.",
          "feed_position": 8
        }
      ],
      "popularity_score": 269.09146888888887,
      "ai_summary": [
        "Australia Post's CEO defends halting most US shipping before a tariff deadline.",
        "The postal carrier reported a small profit despite facing \"structural headwinds\".",
        "The decision to halt shipping was made four days before a tariff deadline.",
        "The tariff deadline applied to low-value packages arriving in the United States.",
        "The CEO's defense came in response to concerns about the shipping halt."
      ]
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 07:14:00 +0000",
      "title": "Drug checking to resume in Queensland months after government axed funding",
      "neutral_headline": "Drug Checking Services to Resume in Queensland",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/qld-pill-testing-to-resume-after-government-axes-funding/105711082",
          "published_at": "Fri, 29 Aug 2025 07:14:00 +0000",
          "title": "Drug checking to resume in Queensland months after government axed funding",
          "standfirst": "Funding for the politically controversial services was cut by the state government earlier this year.",
          "content": "Funding for the politically controversial services was cut by the state government earlier this year.",
          "feed_position": 13
        }
      ],
      "popularity_score": 160.9703577777778,
      "ai_summary": [
        "Drug checking services will resume in Queensland after funding cuts.",
        "The state government cut funding for the services earlier this year.",
        "The services are politically controversial in Queensland.",
        "The resumption of services comes after a period of funding absence.",
        "The government's decision to reinstate funding is a reversal of policy."
      ]
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 04:18:10 +0000",
      "title": "Zelenskyy told Trump 'you can't have elections' during a war. Is this true?",
      "neutral_headline": "Zelenskyy Told Trump Elections Cannot Happen During War",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/can-you-hold-an-election-during-a-war/105697398",
          "published_at": "Fri, 29 Aug 2025 04:18:10 +0000",
          "title": "Zelenskyy told Trump 'you can't have elections' during a war. Is this true?",
          "standfirst": "Ukraine hasn't held a presidential election since 2019. International law experts say it's \"ultimately not safe\" until a peace agreement is reached with Russia.",
          "content": "Ukraine hasn't held a presidential election since 2019. International law experts say it's \"ultimately not safe\" until a peace agreement is reached with Russia.",
          "feed_position": 19
        }
      ],
      "popularity_score": 158.03980222222222,
      "ai_summary": [
        "Zelenskyy reportedly told Trump elections cannot happen during the war.",
        "Ukraine has not held a presidential election since 2019.",
        "International law experts say elections are unsafe until peace is reached.",
        "The experts' assessment is based on international legal standards.",
        "The war with Russia is the primary factor affecting election safety."
      ]
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 04:17:37 +0000",
      "title": "'He couldn't breathe': Dave Hughes ends up in hospital after AFL Legends game",
      "neutral_headline": "Dave Hughes Hospitalized After AFL Legends Game",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/comedian-dave-hughes-ends-up-in-hospital-after-afl-legends-game/105712992",
          "published_at": "Fri, 29 Aug 2025 04:17:37 +0000",
          "title": "'He couldn't breathe': Dave Hughes ends up in hospital after AFL Legends game",
          "standfirst": "Dave Hughes is rushed to hospital by his wife after coming in for some heavy contact during the AFL Legends game at Docklands Stadium.",
          "content": "Dave Hughes is rushed to hospital by his wife after coming in for some heavy contact during the AFL Legends game at Docklands Stadium.",
          "feed_position": 18
        }
      ],
      "popularity_score": 151.03063555555556,
      "ai_summary": [
        "Dave Hughes was rushed to hospital after an AFL Legends game.",
        "He sustained injuries during the game at Docklands Stadium.",
        "His wife took him to the hospital after the game.",
        "The game involved heavy contact between players.",
        "The specific nature of Hughes' injuries is not detailed."
      ]
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 09:14:40 +0000",
      "title": "Vengeful killer who shot dead innocent man in his own bedroom jailed",
      "neutral_headline": "Man Jailed for Murdering Innocent Man in Bedroom",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/peter-nguyen-ha-gets-22-years-for-murdering-ralph-matthews-cox/105686824",
          "published_at": "Fri, 29 Aug 2025 09:14:40 +0000",
          "title": "Vengeful killer who shot dead innocent man in his own bedroom jailed",
          "standfirst": "A vengeful man who fired a shotgun through a bedroom window in suburban Perth, killing an innocent man, is sentenced to life imprisonment with a 22-year minimum for murder.",
          "content": "A vengeful man who fired a shotgun through a bedroom window in suburban Perth, killing an innocent man, is sentenced to life imprisonment with a 22-year minimum for murder.",
          "feed_position": 17
        }
      ],
      "popularity_score": 150.98146888888888,
      "ai_summary": [
        "A man was jailed for life for shooting an innocent man.",
        "The shooting occurred in the victim's bedroom in Perth.",
        "The sentence includes a minimum of 22 years in prison.",
        "The crime was motivated by vengeance, according to reports.",
        "The man fired a shotgun through a bedroom window."
      ]
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 09:01:55 +0000",
      "title": "More than 120,000 older Australians waiting to be assessed for at-home support",
      "neutral_headline": "Thousands Waiting for Home Support Assessments",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/waitlists-for-at-home-support-for-older-australians/105714918",
          "published_at": "Fri, 29 Aug 2025 09:01:55 +0000",
          "title": "More than 120,000 older Australians waiting to be assessed for at-home support",
          "standfirst": "The government promised to release 83,000 packages to help clear the lengthy waitlist for at-home supports in July, but the extra packages have been pushed back to November.",
          "content": "The government promised to release 83,000 packages to help clear the lengthy waitlist for at-home supports in July, but the extra packages have been pushed back to November.",
          "feed_position": 11
        }
      ],
      "popularity_score": 150.76896888888888,
      "ai_summary": [
        "Over 120,000 older Australians await home support assessments.",
        "The government promised 83,000 packages to clear the waitlist.",
        "The promised packages were delayed from July to November.",
        "The delay impacts access to at-home support services.",
        "The government's promise aimed to reduce the wait times."
      ]
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 08:51:58 +0000",
      "title": "ANZ CEO says automated redundancy email was 'indefensible'",
      "neutral_headline": "ANZ CEO Calls Automated Redundancy Email \"Indefensible",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/anz-ceo-contacts-staff-after-automated-email-fires-them/105714886",
          "published_at": "Fri, 29 Aug 2025 08:51:58 +0000",
          "title": "ANZ CEO says automated redundancy email was 'indefensible'",
          "standfirst": "Chief executive Nuno Matos says the bank is going to ensure the \"indefensible and deeply disappointing\" emails are not repeated.",
          "content": "Chief executive Nuno Matos says the bank is going to ensure the \"indefensible and deeply disappointing\" emails are not repeated.",
          "feed_position": 14
        }
      ],
      "popularity_score": 150.60313555555555,
      "ai_summary": [
        "ANZ's CEO called an automated redundancy email \"indefensible\".",
        "The CEO, Nuno Matos, expressed disappointment with the emails.",
        "The bank will ensure such emails are not repeated.",
        "The emails caused significant concern among employees.",
        "The bank is taking steps to prevent similar incidents."
      ]
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 07:55:27 +0000",
      "title": "Don Bradman's baggy green bought for over $400,000 by National Museum",
      "neutral_headline": "Don Bradman's Baggy Green Cap Sold at Auction",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/don-bradmans-baggy-green-bought-national-museum-of-australia/105713078",
          "published_at": "Fri, 29 Aug 2025 07:55:27 +0000",
          "title": "Don Bradman's baggy green bought for over $400,000 by National Museum",
          "standfirst": "One of 11 known baggy green caps worn by Australian cricket great Sir Donald Bradman is bought by the National Museum of Australia for $438,550 at auction, with a federal government contribution covering half the cost.",
          "content": "One of 11 known baggy green caps worn by Australian cricket great Sir Donald Bradman is bought by the National Museum of Australia for $438,550 at auction, with a federal government contribution covering half the cost.",
          "feed_position": 10
        }
      ],
      "popularity_score": 149.66119111111112,
      "ai_summary": [
        "Don Bradman's baggy green cap was bought by a museum.",
        "The National Museum of Australia purchased the cap.",
        "The purchase price was over $400,000 at auction.",
        "The federal government contributed half the purchase cost.",
        "The cap is one of eleven known to have been worn by Bradman."
      ]
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 07:49:38 +0000",
      "title": "'RIP Indonesia's democracy': One killed and 600 arrested in Jakarta rally",
      "neutral_headline": "RIP Indonesia's democracy': One killed and 600 arrested in Jakarta rally",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/jakarta-protesters-faced-with-police-violence-on-street/105711818",
          "published_at": "Fri, 29 Aug 2025 07:49:38 +0000",
          "title": "'RIP Indonesia's democracy': One killed and 600 arrested in Jakarta rally",
          "standfirst": "A 21-year-old has died after being struck by an armoured police vehicle during violent clashes at a Jakarta rally.",
          "content": "A 21-year-old has died after being struck by an armoured police vehicle during violent clashes at a Jakarta rally.",
          "feed_position": 10
        }
      ],
      "popularity_score": 149.56424666666666,
      "ai_summary": [
        "A 21-year-old died during clashes at a Jakarta rally.",
        "An armored police vehicle struck the individual.",
        "Approximately 600 people were arrested during the rally.",
        "The rally took place in Jakarta, Indonesia.",
        "The rally's theme was related to Indonesian democracy."
      ]
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 07:32:11 +0000",
      "title": "Judge jails grandfather for sexually assaulting teenage granddaughters",
      "neutral_headline": "Judge jails grandfather for sexually assaulting teenage granddaughters",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/western-nsw-grandfather-jailed-sexually-abusing-grandaughters/105713086",
          "published_at": "Fri, 29 Aug 2025 07:32:11 +0000",
          "title": "Judge jails grandfather for sexually assaulting teenage granddaughters",
          "standfirst": "A man in his 70s is sentenced to eight years jail for sexually assaulting his granddaughters in 2021 and 2023.",
          "content": "A man in his 70s is sentenced to eight years jail for sexually assaulting his granddaughters in 2021 and 2023.",
          "feed_position": 11
        }
      ],
      "popularity_score": 149.27341333333334,
      "ai_summary": [
        "A man in his seventies received an eight-year jail sentence.",
        "The sentence was for sexually assaulting his granddaughters.",
        "The assaults occurred in 2021 and 2023.",
        "The judge handed down the sentence for the crimes.",
        "The man's age was a factor in the sentencing."
      ]
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 06:07:36 +0000",
      "title": "State forestry corporation accused of failing to protect endangered glider",
      "neutral_headline": "State forestry corporation accused of failing to protect endangered glider",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/forestry-corporation-nsw-charged-by-epa-tallaganda-state-forest/105711516",
          "published_at": "Fri, 29 Aug 2025 06:07:36 +0000",
          "title": "State forestry corporation accused of failing to protect endangered glider",
          "standfirst": "Conservationists call for an end to native forest logging in NSW after the state’s forestry corporation is accused of logging breaches in Tallaganda State Forest.",
          "content": "Conservationists call for an end to native forest logging in NSW after the state’s forestry corporation is accused of logging breaches in Tallaganda State Forest.",
          "feed_position": 16
        }
      ],
      "popularity_score": 147.8636911111111,
      "ai_summary": [
        "Conservationists want an end to native forest logging in NSW.",
        "The forestry corporation is accused of logging breaches.",
        "The breaches allegedly occurred in Tallaganda State Forest.",
        "The endangered glider is the focus of the conservationists.",
        "The logging practices are under scrutiny by conservation groups."
      ]
    },
    {
      "id": "cluster_42",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 06:07:17 +0000",
      "title": "'One elderly woman wet herself': Passengers 'distressed' after plane's toilets stop working",
      "neutral_headline": "Passengers Distressed After Plane's Toilets Stop Working",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/virgin-australia-bali-brisbane-flight-toilet-malfunction/105713124",
          "published_at": "Fri, 29 Aug 2025 06:07:17 +0000",
          "title": "'One elderly woman wet herself': Passengers 'distressed' after plane's toilets stop working",
          "standfirst": "Virgin Australia has apologised after passengers on a flight from Bali to Brisbane overnight were left without any working toilets during what one described as \"a filthy, humiliating nightmare\".",
          "content": "Virgin Australia has apologised after passengers on a flight from Bali to Brisbane overnight were left without any working toilets during what one described as \"a filthy, humiliating nightmare\".",
          "feed_position": 12
        }
      ],
      "popularity_score": 147.85841333333335,
      "ai_summary": [
        "Passengers were distressed on a flight with non-working toilets.",
        "The flight was from Bali to Brisbane overnight.",
        "Virgin Australia apologized for the incident.",
        "One passenger described the experience as a \"nightmare\".",
        "The toilets stopped working during the flight."
      ]
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 06:03:21 +0000",
      "title": "Victoria's largest farming property hits market for first time since 2018",
      "neutral_headline": "Victoria's Largest Farming Property Hits Market",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/victorias-largest-farm-telopea-downs-on-market/105710830",
          "published_at": "Fri, 29 Aug 2025 06:03:21 +0000",
          "title": "Victoria's largest farming property hits market for first time since 2018",
          "standfirst": "Telopea Downs in the state's north-west is offered for sale on a walk-in, walk-out basis, seven years after it was purchased for $70 million.",
          "content": "Telopea Downs in the state's north-west is offered for sale on a walk-in, walk-out basis, seven years after it was purchased for $70 million.",
          "feed_position": 18
        }
      ],
      "popularity_score": 147.79285777777778,
      "ai_summary": [
        "Telopea Downs is for sale for the first time since 2018.",
        "The property is in Victoria's north-west region.",
        "The sale is on a walk-in, walk-out basis.",
        "The property was purchased for $70 million in 2018.",
        "The property is the largest farming property in Victoria."
      ]
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 06:01:37 +0000",
      "title": "US-based online retailer bans melatonin sales to Australia after jump in child overdoses",
      "neutral_headline": "US Retailer Bans Melatonin Sales to Australia",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/iherb-suspends-sale-melatonin-supplements-kids-overdose/105712268",
          "published_at": "Fri, 29 Aug 2025 06:01:37 +0000",
          "title": "US-based online retailer bans melatonin sales to Australia after jump in child overdoses",
          "standfirst": "Many Australian families use melatonin supplements to help their kids get a good night's sleep. But new data shows a concerning spike in overdoses among children taking the gummies.",
          "content": "Many Australian families use melatonin supplements to help their kids get a good night's sleep. But new data shows a concerning spike in overdoses among children taking the gummies.",
          "feed_position": 13
        }
      ],
      "popularity_score": 147.76396888888888,
      "ai_summary": [
        "A US retailer banned melatonin sales to Australia.",
        "The ban follows a rise in child overdoses.",
        "Many Australian families use melatonin for children.",
        "New data shows a spike in overdoses among children.",
        "The overdoses involve children taking melatonin gummies."
      ]
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 05:50:09 +0000",
      "title": "Colman and Cumberbatch are joyfully venomous in Roses remake",
      "neutral_headline": "Colman and Cumberbatch are joyfully venomous in Roses remake",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/the-roses-interview-olivia-colman/105711322",
          "published_at": "Fri, 29 Aug 2025 05:50:09 +0000",
          "title": "Colman and Cumberbatch are joyfully venomous in Roses remake",
          "standfirst": "Starring Olivia Colman and Benedict Cumberbatch and written by Australian Tony McNamara, this re-imagining of this thorny novel stings.",
          "content": "Starring Olivia Colman and Benedict Cumberbatch and written by Australian Tony McNamara, this re-imagining of this thorny novel stings.",
          "feed_position": 21
        }
      ],
      "popularity_score": 147.57285777777778,
      "ai_summary": [
        "Olivia Colman and Benedict Cumberbatch star in the remake.",
        "The film is written by Australian Tony McNamara.",
        "The film is a re-imagining of a novel.",
        "The film is described as \"joyfully venomous\".",
        "The film's tone is described as stinging."
      ]
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 05:45:47 +0000",
      "title": "Residents outraged by proposed quarry 'right in the middle' of estate",
      "neutral_headline": "Residents oppose quarry plans near their residential estate",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/locals-concerned-about-impact-of-proposed-monaro-rock-quarry/105709608",
          "published_at": "Fri, 29 Aug 2025 05:45:47 +0000",
          "title": "Residents outraged by proposed quarry 'right in the middle' of estate",
          "standfirst": "Royalla residents and the local mayor want to halt plans to transform an empty field over their back fence into a million-tonnes-per-year rock quarry, but they're concerned nobody is listening.",
          "content": "Royalla residents and the local mayor want to halt plans to transform an empty field over their back fence into a million-tonnes-per-year rock quarry, but they're concerned nobody is listening.",
          "feed_position": 22
        }
      ],
      "popularity_score": 147.50008,
      "ai_summary": [
        "Royalla residents and mayor oppose a quarry planned near their homes.",
        "The proposed quarry would transform an empty field into a rock quarry.",
        "Residents are concerned about the lack of consideration for their concerns.",
        "The quarry is planned to produce one million tonnes of rock annually.",
        "Residents fear the quarry's impact on their quality of life."
      ]
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 04:42:21 +0000",
      "title": "Gun enthusiast who told police officer 'we're coming for you' faces jail",
      "neutral_headline": "Army reservist faces jail for threatening police officer",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/mitchell-john-hogan-found-guilty-over-wa-police-officer-threat/105712824",
          "published_at": "Fri, 29 Aug 2025 04:42:21 +0000",
          "title": "Gun enthusiast who told police officer 'we're coming for you' faces jail",
          "standfirst": "An army reservist with access to high-powered firearms is found guilty of threatening a senior WA Police officer over his involvement in the state's firearm reforms.",
          "content": "An army reservist with access to high-powered firearms is found guilty of threatening a senior WA Police officer over his involvement in the state's firearm reforms.",
          "feed_position": 16
        }
      ],
      "popularity_score": 146.4428577777778,
      "ai_summary": [
        "An army reservist threatened a senior WA Police officer.",
        "The reservist was found guilty of making threats.",
        "The threats were related to firearm reforms in the state.",
        "The reservist had access to high-powered firearms.",
        "The reservist is now facing potential jail time."
      ]
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 04:36:52 +0000",
      "title": "Prison guard gave chase 'in socks' to hospital escapee",
      "neutral_headline": "Prison guard chased hospital escapee in socks",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/escaped-prisoner-nicholas-scott-inquest-findings/105711816",
          "published_at": "Fri, 29 Aug 2025 04:36:52 +0000",
          "title": "Prison guard gave chase 'in socks' to hospital escapee",
          "standfirst": "Prisoner Nicholas Aaron Scott was shot and killed by another man in a scuffle the morning after his escape from Royal Hobart Hospital, where he was meant to be handcuffed at all times.",
          "content": "Prisoner Nicholas Aaron Scott was shot and killed by another man in a scuffle the morning after his escape from Royal Hobart Hospital, where he was meant to be handcuffed at all times.",
          "feed_position": 24
        }
      ],
      "popularity_score": 146.3514688888889,
      "ai_summary": [
        "A prison guard pursued an escaping prisoner from a hospital.",
        "The guard was reportedly wearing socks during the chase.",
        "The escapee, Nicholas Aaron Scott, was shot and killed.",
        "The shooting occurred after Scott escaped from Royal Hobart Hospital.",
        "Scott was supposed to be handcuffed at all times in the hospital."
      ]
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 04:35:44 +0000",
      "title": "Witness saw missing man beaten by 'weapons and instruments', court told",
      "neutral_headline": "Witness saw missing man beaten, court hears",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/man-accused-of-torture-andrew-burow-denied-bail/105711436",
          "published_at": "Fri, 29 Aug 2025 04:35:44 +0000",
          "title": "Witness saw missing man beaten by 'weapons and instruments', court told",
          "standfirst": "Maroochydore Magistrates Court hears a witness watched missing Brisbane man Andrew Burow being severely beaten on a video phone call.",
          "content": "Maroochydore Magistrates Court hears a witness watched missing Brisbane man Andrew Burow being severely beaten on a video phone call.",
          "feed_position": 22
        }
      ],
      "popularity_score": 146.33258,
      "ai_summary": [
        "A witness testified in court about seeing a beating.",
        "The witness saw the beating of missing man Andrew Burow.",
        "The beating was viewed via a video phone call.",
        "The witness described the use of \"weapons and instruments.\"",
        "The court is located in Maroochydore, Queensland."
      ]
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 03:08:28 +0000",
      "title": "NZ fugitive reportedly caught on camera after four years on the run",
      "neutral_headline": "NZ fugitive reportedly caught on camera after four years",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/nz-police-cctv-footage-of-tom-phillips-and-child/105711968",
          "published_at": "Fri, 29 Aug 2025 03:08:28 +0000",
          "title": "NZ fugitive reportedly caught on camera after four years on the run",
          "standfirst": "New Zealand father Tom Philips disappeared into the rugged wilderness just before Christmas 2021 with his three children.",
          "content": "New Zealand father Tom Philips disappeared into the rugged wilderness just before Christmas 2021 with his three children.",
          "feed_position": 15
        }
      ],
      "popularity_score": 144.87813555555556,
      "ai_summary": [
        "Tom Philips, a New Zealand fugitive, was reportedly seen on camera.",
        "Philips disappeared with his three children in late 2021.",
        "He vanished into the wilderness just before Christmas.",
        "The search for Philips and his children has been ongoing.",
        "The recent sighting suggests he may still be in the area."
      ]
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 05:14:37 +0000",
      "title": "The most common issues these sex therapists see",
      "neutral_headline": "The most common issues these sex therapists see",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-08-29/the-most-common-issues-these-sex-therapists-see/105651324",
          "published_at": "Fri, 29 Aug 2025 05:14:37 +0000",
          "title": "The most common issues these sex therapists see",
          "standfirst": "People often feel alone in their intimacy struggles, but peek behind the curtain of sex therapy, and you may realise your concerns are not unique.",
          "content": "People often feel alone in their intimacy struggles, but peek behind the curtain of sex therapy, and you may realise your concerns are not unique.",
          "feed_position": 24
        }
      ],
      "popularity_score": 143.98063555555555,
      "ai_summary": [
        "Sex therapists often see people struggling with intimacy issues.",
        "Many people feel alone in their intimacy struggles.",
        "The article offers a peek behind the curtain of sex therapy.",
        "The article suggests concerns are often not unique.",
        "The article aims to normalize common intimacy challenges."
      ]
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Fri, 29 Aug 2025 02:01:15 +0000",
      "title": "Robbins Island wind farm approved after years of delays",
      "neutral_headline": "Robbins Island wind farm approved after delays",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/tas-robbins-island-wind-farm-approved/105711854",
          "published_at": "Fri, 29 Aug 2025 02:01:15 +0000",
          "title": "Robbins Island wind farm approved after years of delays",
          "standfirst": "A 100-turbine wind farm, the largest in Tasmania, will be built on Robbins Island in north-west Tasmania following seven delays to the decision, and multiple court appeals.",
          "content": "A 100-turbine wind farm, the largest in Tasmania, will be built on Robbins Island in north-west Tasmania following seven delays to the decision, and multiple court appeals.",
          "feed_position": 21
        }
      ],
      "popularity_score": 143.7578577777778,
      "ai_summary": [
        "A wind farm on Robbins Island has been approved.",
        "The approval follows years of delays and court appeals.",
        "The wind farm will have 100 turbines.",
        "It will be the largest wind farm in Tasmania.",
        "The project faced seven delays before approval."
      ]
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Thu, 28 Aug 2025 22:00:00 +0000",
      "title": "'Frighteningly complex': Scientists race to find solution to algal crisis",
      "neutral_headline": "Scientists race to find solution to algal crisis",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/science/2025-08-29/sa-algal-bloom-science-research/105703992",
          "published_at": "Thu, 28 Aug 2025 22:00:00 +0000",
          "title": "'Frighteningly complex': Scientists race to find solution to algal crisis",
          "standfirst": "Scientific efforts are getting microscopic on the biggest algal bloom in Australia’s history to see if it hides secrets that could stop its spread.",
          "content": "Scientific efforts are getting microscopic on the biggest algal bloom in Australia’s history to see if it hides secrets that could stop its spread.",
          "feed_position": 23
        }
      ],
      "popularity_score": 139.73702444444444,
      "ai_summary": [
        "Scientists are working to understand an algal bloom.",
        "The bloom is the largest in Australian history.",
        "Scientists are studying the bloom microscopically.",
        "They hope to find ways to stop its spread.",
        "The research aims to uncover secrets of the bloom."
      ]
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Thu, 28 Aug 2025 18:53:02 +0000",
      "title": "How Iran's antisemitic attack plot came undone",
      "neutral_headline": "How Iran's antisemitic attack plot came undone",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-08-29/how-irans-antisemitic-attack-plot-came-undone/105709542",
          "published_at": "Thu, 28 Aug 2025 18:53:02 +0000",
          "title": "How Iran's antisemitic attack plot came undone",
          "standfirst": "After months of painstaking investigation, Australia's top spooks last week unpicked the thread confirming a link between the Islamic Revolutionary Guard Corps and antisemitic attacks in Sydney and Melbourne.",
          "content": "After months of painstaking investigation, Australia's top spooks last week unpicked the thread confirming a link between the Islamic Revolutionary Guard Corps and antisemitic attacks in Sydney and Melbourne.",
          "feed_position": 20
        }
      ],
      "popularity_score": 133.62091333333333,
      "ai_summary": [
        "Australian intelligence agencies investigated an antisemitic plot.",
        "The investigation confirmed a link to the IRGC.",
        "The IRGC is the Islamic Revolutionary Guard Corps.",
        "The plot involved attacks in Sydney and Melbourne.",
        "The investigation took months to complete."
      ]
    }
  ]
}