{
  "updated_at": "2025-10-21T19:16:34.910Z",
  "clusters": [
    {
      "id": "cluster_13",
      "coverage": 3,
      "updated_at": "Tue, 21 Oct 2025 18:29:34 GMT",
      "title": "Albanese hints US could still seek changes to Aukus agreement amid review",
      "neutral_headline": "Albanese Hints US Could Still Seek Changes to Aukus Agreement Amid Review",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/21/albanese-says-us-could-still-seek-changes-to-aukus-agreement-amid-review",
          "published_at": "Tue, 21 Oct 2025 18:29:34 GMT",
          "title": "Albanese hints US could still seek changes to Aukus agreement amid review",
          "standfirst": "Speaking in Washington, the prime minister downplayed US comments about ‘ambiguity’ but conceded he knows that the Pentagon want some updatesGet our breaking news email, free app or daily news podcastAnthony Albanese has indicated the United States could seek updates to the Aukus agreement a day after Donald Trump’s navy secretary spoke of his hopes to “clarify some of the ambiguity” in the nuclear submarine deal, amid an ongoing Pentagon review.The prime minister downplayed the comments from naval secretary John Phelan, telling media “don’t look for something that’s not there” and noting Trump’s strong support for the plan to even be accelerated. Following successful meetings with President Trump and senior US politicians in Washington DC, Albanese boasted of the substantial support for the agreement on Capitol Hill, and revealed he even presented Trump with a gift of a model submarine. Continue reading...",
          "content": "Speaking in Washington, the prime minister downplayed US comments about ‘ambiguity’ but conceded he knows that the Pentagon want some updatesGet our breaking news email, free app or daily news podcastAnthony Albanese has indicated the United States could seek updates to the Aukus agreement a day after Donald Trump’s navy secretary spoke of his hopes to “clarify some of the ambiguity” in the nuclear submarine deal, amid an ongoing Pentagon review.The prime minister downplayed the comments from naval secretary John Phelan, telling media “don’t look for something that’s not there” and noting Trump’s strong support for the plan to even be accelerated. Following successful meetings with President Trump and senior US politicians in Washington DC, Albanese boasted of the substantial support for the agreement on Capitol Hill, and revealed he even presented Trump with a gift of a model submarine. Continue reading...",
          "feed_position": 6
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/22/albaneses-critical-minerals-deal-isnt-good-economics-but-in-trump-and-xis-new-world-bargaining-chips-matter",
          "published_at": "Tue, 21 Oct 2025 14:00:39 GMT",
          "title": "Albanese’s critical minerals deal isn’t good economics – but in Trump and Xi’s new world, bargaining chips matter",
          "standfirst": "Though the dollar benefits may not outweigh the cost on Australia’s new mining agreement with the US, experts say it couldn’t have gone any betterGet our breaking news email, free app or daily news podcastAnthony Albanese has struck a multi-billion dollar deal with Donald Trump to develop critical minerals projects in Australia that will never be commercially viable.When it’s laid out like that, it very much sounds like our prime minister fell victim to the president’s “art of the deal”. But we are in a new world where the national value of our critical minerals extends beyond economics, experts say. Continue reading...",
          "content": "Though the dollar benefits may not outweigh the cost on Australia’s new mining agreement with the US, experts say it couldn’t have gone any betterGet our breaking news email, free app or daily news podcastAnthony Albanese has struck a multi-billion dollar deal with Donald Trump to develop critical minerals projects in Australia that will never be commercially viable.When it’s laid out like that, it very much sounds like our prime minister fell victim to the president’s “art of the deal”. But we are in a new world where the national value of our critical minerals extends beyond economics, experts say. Continue reading...",
          "feed_position": 3
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2025/oct/21/key-moments-albanese-and-trump-white-house-meeting-video",
          "published_at": "Tue, 21 Oct 2025 02:55:31 GMT",
          "title": "Key moments from Albanese and Trump's White House meeting – video",
          "standfirst": "The Australian prime minister, Anthony Albanese, has met with the US president, Donald Trump, officially for the first time in person. At a meeting in the White House, Trump heaped praise on Albanese's leadership as the pair signed a US$8.5bn rare earths deal and Trump assured Australia of the US's commitment to the Aukus submarine deal. It wasn't all rosy – Trump told former Australian PM Kevin Rudd, who is now the ambassador to the US, 'I don't like you and I probably never will'. Trump was asked about Rudd's former negative comments about the president. Trump also chided three Australian reporters, but praised one for his haircut.► Subscribe to Guardian Australia on YouTubeAlbanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous comments Continue reading...",
          "content": "The Australian prime minister, Anthony Albanese, has met with the US president, Donald Trump, officially for the first time in person. At a meeting in the White House, Trump heaped praise on Albanese's leadership as the pair signed a US$8.5bn rare earths deal and Trump assured Australia of the US's commitment to the Aukus submarine deal. It wasn't all rosy – Trump told former Australian PM Kevin Rudd, who is now the ambassador to the US, 'I don't like you and I probably never will'. Trump was asked about Rudd's former negative comments about the president. Trump also chided three Australian reporters, but praised one for his haircut.► Subscribe to Guardian Australia on YouTubeAlbanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous comments Continue reading...",
          "feed_position": 14
        },
        {
          "source": "Crikey",
          "url": "https://www.crikey.com.au/2025/10/21/minerals-deal-australia-united-states-anthony-albanese-donald-trump/",
          "published_at": "Tue, 21 Oct 2025 00:44:46 +0000",
          "title": "Albanese&#8217;s critical minerals handout to Trump damages national security — and rewards laziness",
          "standfirst": "While Donald Trump is a bit late to the party on critical minerals, he's found a loyal dependent in Anthony Albanese to help fix the error. The post Albanese&#8217;s critical minerals handout to Trump damages national security — and rewards laziness appeared first on Crikey.",
          "content": "While Donald Trump is a bit late to the party on critical minerals, he's found a loyal dependent in Anthony Albanese to help fix the error. The post Albanese&#8217;s critical minerals handout to Trump damages national security — and rewards laziness appeared first on Crikey.",
          "feed_position": 3,
          "image_url": "https://www.crikey.com.au/wp-content/uploads/sites/3/2025/10/20251021110408091469-original-copy.jpg?fit=1024%2C576"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/australia-and-us-rare-earths-deal-why-critical-minerals-are-so-vital-explained/c8ccd0ac-b0a1-467b-bdd3-ee35823d6d92",
          "published_at": "Tue, 21 Oct 2025 00:21:11 +0000",
          "title": "Why the Australia-US rare earths deal matters so much for Trump",
          "standfirst": "P rime Minister Anthony Albanese and US President Donald Trump are crowing about the agreement, but will it make Australia a big player in critical minerals?",
          "content": "P rime Minister Anthony Albanese and US President Donald Trump have signed an $US8.5 billion ($13 billion) critical minerals and rare earths agreement in a move to break China&#x27;s stranglehold on the market.The US–Australia Critical Minerals Framework puts rare earths squarely at the forefront of the Australian-US relationship, with Albanese saying there is a \"pipeline that we have ready to go\".The deal will kick off with both countries paying $US1 billion over the next six months for new projects.READ MORE: &#x27;I don&#x27;t like you&#x27;: Trump blasts Rudd during Albo meetingTrump was delighted in securing the agreement with Australia. China earlier this month ramped up restrictions on its rare earth exports. That didn&#x27;t sit well with the US president, who threatened to call off an upcoming meeting with his Chinese counterpart, Xi Jinping.\"We work together very much on rare earths, critical minerals and lots of other things, and we&#x27;ve had a very good relationship,\" Trump said as he sat beside Albanese at the White House.\"We&#x27;ve been working on that for quite a while.\"In about a year from now, we&#x27;ll have so much critical mineral and rare earths, and you won&#x27;t know what to do with them.\"READ MORE: World&#x27;s biggest apps and websites hit by global outageWhat are rare earths?Rare earths include 17 metallic elements in the periodic table made up of scandium, yttrium and the lanthanides.The name \"rare earths\" is a bit of a misnomer, because the materials are found throughout the Earth&#x27;s crust.They are more abundant than gold, but they are difficult and costly to extract and process and are also environmentally damaging.The minerals are used to make everyday technologies, from smartphones to wind turbines to LED lights and flat-screen TVs.They&#x27;re crucial for batteries in electric vehicles, as well as MRI scanners and cancer treatments.Rare earths are also essential for the arms industry and the US armed forces, the world&#x27;s biggest.They&#x27;re used in F-35 fighter jets, submarines, lasers, satellites, Tomahawk missiles and more, according to the Centre for Strategic and International Studies (CSIS), a US think tank.READ MORE: Chilling warning over 3D-printed guns flooding Australia amid crackdownWhy is Australia so crucial?The US sees Australia, a long-standing ally, as an alternative source for rare earths as the critical minerals shape up to become a major hurdle in Washington-Beijing relations.China is the world&#x27;s largest producer of rare earth elements, with 61 per cent of mined rare earth production, according to the International Energy Agency, and 92 per cent of the global output in the processing stag e. Trump hopes the Australia deal will help break that monopoly.Australia offers three major attractions: it has some of the world&#x27;s biggest geological reserves : a share market with a record of successfully investing in mining; and a skilled labour force.Are there any hurdles ahead? Economic geographer Lian Sinclair, of the University of Sydney, says vast sums of money are pouring into the Australian rare earths industry: $3.2 billion by Australian government agencies; $2.9 billion from foreign allied governments, including the US, Japan, South Korea and Canada.\"This is a large amount for an industry with a total global trade of less than US$4 billion ($6 billion) every year,\" he said. It means without investment in refineries and magnet production in allied countries, Australian miners will continue to either sell into or be outcompeted by Chinese domestic industry.Sinclair says apart from Australian rare-earths mining company Lynas, which sells into the Japanese market, miners are struggling to find potential international buyers.To wean themselves off Chinese rare earths for wind turbines and electric vehicles, the US, Europe and South Korea need to heavily invest in magnet and advanced metal processing industries.Sinclair also points to the environmental cost of Australia becoming a big player in rare earths, with more work needed to be done in planning for managing radioactive waste and building partnerships with First Nations people. - With CNN DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 15,
          "image_url": "https://prod.static9.net.au/fs/786de9af-7391-40b7-a0fa-e70ec0ca53ef"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/21/diplomatic-triumph-or-capitulation-albanese-found-donald-trump-in-a-heavenly-mood-but-the-devil-may-be-in-the-detail",
          "published_at": "Mon, 20 Oct 2025 23:31:00 GMT",
          "title": "Diplomatic triumph or ‘capitulation’? Albanese found Donald Trump in a heavenly mood but the devil may be in the detail",
          "standfirst": "Fresh from a tropical holiday, the Australian prime minister caught the US president at his effusive best‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous commentsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAnthony Albanese was so pleased about his first meeting with Donald Trump, so chuffed with the overwhelming – and somewhat unexpected – praise from the president, the prime minister joked that he’d use the endorsements in his campaign ads at the next election.That’s obviously unlikely to happen – consider the effective campaign Albanese ran against Peter Dutton by comparing him to Trump, and the Labor left flank already ropable over what they view as a fawning and “shameful capitulation” over Aukus and critical minerals. Continue reading...",
          "content": "Fresh from a tropical holiday, the Australian prime minister caught the US president at his effusive best‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous commentsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastAnthony Albanese was so pleased about his first meeting with Donald Trump, so chuffed with the overwhelming – and somewhat unexpected – praise from the president, the prime minister joked that he’d use the endorsements in his campaign ads at the next election.That’s obviously unlikely to happen – consider the effective campaign Albanese ran against Peter Dutton by comparing him to Trump, and the Labor left flank already ropable over what they view as a fawning and “shameful capitulation” over Aukus and critical minerals. Continue reading...",
          "feed_position": 7
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2025/oct/21/ready-to-go-trump-and-albanese-sign-multibillion-dollar-critical-minerals-agreement-video",
          "published_at": "Mon, 20 Oct 2025 21:48:58 GMT",
          "title": "'Ready to go': Trump and Albanese sign multibillion-dollar critical minerals agreement – video",
          "standfirst": "The US president, Donald Trump, and the Australian prime minister, Anthony Albanese, signed an agreement on rare earths and critical minerals on Monday at the White House. Albanese said the deal would 'take our relationship to that next level' while Trump said it had been negotiated over four or ► Subscribe to Guardian Australia on YouTubefive monthsAlbanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous comments Continue reading...",
          "content": "The US president, Donald Trump, and the Australian prime minister, Anthony Albanese, signed an agreement on rare earths and critical minerals on Monday at the White House. Albanese said the deal would 'take our relationship to that next level' while Trump said it had been negotiated over four or ► Subscribe to Guardian Australia on YouTubefive monthsAlbanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous comments Continue reading...",
          "feed_position": 15
        },
        {
          "source": "Crikey",
          "url": "https://www.crikey.com.au/2025/10/21/trump-albanese-critical-minerals-kevin-rudd-humiliated/",
          "published_at": "Mon, 20 Oct 2025 20:53:04 +0000",
          "title": "Trump and Albanese sign critical minerals deal, Kevin Rudd humiliated",
          "standfirst": "Anthony Albanese has finally met with Donald Trump, with the pair signing a critical minerals deal (although not before the US president got in a dig at Kevin Rudd). The post Trump and Albanese sign critical minerals deal, Kevin Rudd humiliated appeared first on Crikey.",
          "content": "Anthony Albanese has finally met with Donald Trump, with the pair signing a critical minerals deal (although not before the US president got in a dig at Kevin Rudd). The post Trump and Albanese sign critical minerals deal, Kevin Rudd humiliated appeared first on Crikey.",
          "feed_position": 6,
          "image_url": "https://www.crikey.com.au/wp-content/uploads/sites/3/2025/10/20251021152435679391-original.jpg?fit=1024%2C576"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/21/i-dont-like-you-either-diplomats-hold-their-breath-as-trump-chides-rudd-over-previous-comments",
          "published_at": "Mon, 20 Oct 2025 19:01:11 GMT",
          "title": "‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous comments",
          "standfirst": "President’s comments were greeted with laughter as diplomatic pressure valve finally releasedAlbanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcast“I don’t like you either. And I probably never will,” US President Donald Trump told Australian ambassador Kevin Rudd at the White House cabinet room table.It was the testiest and most uncomfortable remark at a typically freewheeling and chaotic presidential press conference. Continue reading...",
          "content": "President’s comments were greeted with laughter as diplomatic pressure valve finally releasedAlbanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcast“I don’t like you either. And I probably never will,” US President Donald Trump told Australian ambassador Kevin Rudd at the White House cabinet room table.It was the testiest and most uncomfortable remark at a typically freewheeling and chaotic presidential press conference. Continue reading...",
          "feed_position": 8
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/oct/20/albanese-at-the-white-house-trump-endorses-aukus-signs-85bn-rare-earths-deal-and-calls-pm-great-leader",
          "published_at": "Mon, 20 Oct 2025 18:10:59 GMT",
          "title": "Albanese at the White House: Trump endorses Aukus, signs $8.5bn rare earths deal and calls PM ‘great leader’",
          "standfirst": "President says US has no better friend than Australia but tells ambassador Kevin Rudd “I don’t like you’‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous commentsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastDonald Trump has strongly endorsed the Aukus pact and praised prime minister Anthony Albanese as a “great” leader, but the president’s navy secretary says the US may seek to “clarify some ambiguities” in the nuclear submarine deal.Trump and Albanese also signed a multibillion-dollar agreement for Australia to supply the United States with critical minerals, amid a deepening trade war as China threatens to cut its supply of rare earth elements. But the president also downplayed any prospect of cutting tariffs on Australian goods. Continue reading...",
          "content": "President says US has no better friend than Australia but tells ambassador Kevin Rudd “I don’t like you’‘I don’t like you either’: diplomats hold their breath as Trump chides Rudd over previous commentsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastDonald Trump has strongly endorsed the Aukus pact and praised prime minister Anthony Albanese as a “great” leader, but the president’s navy secretary says the US may seek to “clarify some ambiguities” in the nuclear submarine deal.Trump and Albanese also signed a multibillion-dollar agreement for Australia to supply the United States with critical minerals, amid a deepening trade war as China threatens to cut its supply of rare earth elements. But the president also downplayed any prospect of cutting tariffs on Australian goods. Continue reading...",
          "feed_position": 9
        }
      ],
      "featured_image": "https://www.crikey.com.au/wp-content/uploads/sites/3/2025/10/20251021110408091469-original-copy.jpg?fit=1024%2C576",
      "popularity_score": 3019.216413888889,
      "ai_summary": [
        "Anthony Albanese downplayed US comments about \"ambiguity\" in the Aukus agreement.",
        "The Pentagon is conducting a review of the nuclear submarine deal.",
        "Albanese met with Donald Trump in Washington.",
        "Albanese presented Trump with a model submarine.",
        "Albanese struck a deal with Trump for critical minerals projects."
      ]
    },
    {
      "id": "cluster_6",
      "coverage": 2,
      "updated_at": "Wed, 22 Oct 2025 05:57:20 +1100",
      "title": "Prime Minister backs US ambassador Kevin Rudd",
      "neutral_headline": "Prime Minister Backs US Ambassador Kevin Rudd",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/prime-minister-backs-us-ambassador-kevin-rudd-20251022-p5n4aw.html",
          "published_at": "Wed, 22 Oct 2025 05:57:20 +1100",
          "title": "Prime Minister backs US ambassador Kevin Rudd",
          "standfirst": "The prime minister has reinforced his support for US ambassador Kevin Rudd after his public chastising by Donald Trump.",
          "content": "The prime minister has reinforced his support for US ambassador Kevin Rudd after his public chastising by Donald Trump.",
          "feed_position": 5,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/4c1e86920ba33b80c35a5d18e30a2afee339e300"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/rudd-should-not-be-sacked-after-trump-rebuke-turnbull-insists/105917016",
          "published_at": "Tue, 21 Oct 2025 08:01:43 +0000",
          "title": "Turnbull gives Albanese a 10, backs Rudd to stay in US",
          "standfirst": "Former prime minister Malcoim Turnbull says any talk of removing Kevin Rudd as ambassador to the United States should be ignored.",
          "content": "Former prime minister Malcoim Turnbull says any talk of removing Kevin Rudd as ambassador to the United States should be ignored.",
          "feed_position": 2
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/4c1e86920ba33b80c35a5d18e30a2afee339e300",
      "popularity_score": 2019.6791916666666,
      "ai_summary": [
        "The Prime Minister reinforced support for US ambassador Kevin Rudd.",
        "This followed public criticism of Rudd by Donald Trump.",
        "Former Prime Minister Malcolm Turnbull supports Rudd's continued role.",
        "Turnbull believes any talk of removing Rudd should be ignored."
      ]
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 19:11:16 +0000",
      "title": "Gaza ceasefire going 'better than expected', JD Vance says",
      "neutral_headline": "Gaza Ceasefire Going 'Better Than Expected', JD Vance Says",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-22/jd-vance-visits-israel-amid-gaza-ceasefire-concerns/105919276",
          "published_at": "Tue, 21 Oct 2025 19:11:16 +0000",
          "title": "Gaza ceasefire going 'better than expected', JD Vance says",
          "standfirst": "The vice-president urged Israel to have \"a little bit of patience\" with Hamas as the militant group tries to find the remains of deceased hostages.",
          "content": "The vice-president urged Israel to have \"a little bit of patience\" with Hamas as the militant group tries to find the remains of deceased hostages.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.9114138888889,
      "ai_summary": [
        "JD Vance stated the Gaza ceasefire is going \"better than expected\".",
        "Vance urged Israel to show \"a little bit of patience\" with Hamas.",
        "Hamas is trying to find the remains of deceased hostages."
      ]
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:45:30 +0000",
      "title": "Trump's take on Taiwan should shift the tone of war talk in Australia",
      "neutral_headline": "Trump's Take on Taiwan Should Shift War Talk in Australia",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/trump-take-china-taiwan-shift-tone-war-talk-australia/105916520",
          "published_at": "Tue, 21 Oct 2025 06:45:30 +0000",
          "title": "Trump's take on Taiwan should shift the tone of war talk in Australia",
          "standfirst": "Trump's remarks downplaying the threat of confrontation over Taiwan are highly significant for Australia. They should also shift the tone of much of the strategic discussion among China hawks on the prospects of imminent war.",
          "content": "Trump's remarks downplaying the threat of confrontation over Taiwan are highly significant for Australia. They should also shift the tone of much of the strategic discussion among China hawks on the prospects of imminent war.",
          "feed_position": 0
        }
      ],
      "popularity_score": 340.4819694444444,
      "ai_summary": [
        "Trump's remarks downplaying the threat of confrontation over Taiwan are significant.",
        "These remarks should shift the tone of strategic discussion in Australia.",
        "The discussion is among China hawks on the prospects of war."
      ]
    },
    {
      "id": "cluster_17",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 18:11:37 +0000",
      "title": "Sports business mogul faces $6.7m tax bill, court documents show",
      "neutral_headline": "Sports Business Mogul Faces $6.7M Tax Bill",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-22/scott-pendlebury-jason-sourasis-legal-action/105918404",
          "published_at": "Tue, 21 Oct 2025 18:11:37 +0000",
          "title": "Sports business mogul faces $6.7m tax bill, court documents show",
          "standfirst": "The former financial adviser to Collingwood star Scott Pendlebury has racked up a multi-million dollar tax debt since 2021.",
          "content": "The former financial adviser to Collingwood star Scott Pendlebury has racked up a multi-million dollar tax debt since 2021.",
          "feed_position": 4
        }
      ],
      "popularity_score": 316.9172472222222,
      "ai_summary": [
        "A sports business mogul faces a $6.7 million tax bill.",
        "The mogul was the former financial advisor to Scott Pendlebury.",
        "The tax debt has accumulated since 2021."
      ]
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 09:29:01 +0000",
      "title": "Brittany Higgins abandons appeal over Linda Reynolds' defamation win",
      "neutral_headline": "Brittany Higgins Abandons Appeal Over Linda Reynolds' Defamation Win",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/linda-reynolds-brittany-higgins-david-sharaz-defamation-trial/105918850",
          "published_at": "Tue, 21 Oct 2025 09:29:01 +0000",
          "title": "Brittany Higgins abandons appeal over Linda Reynolds' defamation win",
          "standfirst": "Brittany Higgins abandons her appeal of a WA Supreme Court finding that she defamed her ex-boss and former Liberal Senator Linda Reynolds in a series of social media posts.",
          "content": "Brittany Higgins abandons her appeal of a WA Supreme Court finding that she defamed her ex-boss and former Liberal Senator Linda Reynolds in a series of social media posts.",
          "feed_position": 3
        }
      ],
      "popularity_score": 313.20724722222224,
      "ai_summary": [
        "Brittany Higgins abandoned her appeal.",
        "The appeal was regarding a defamation case.",
        "The case involved her ex-boss, Linda Reynolds.",
        "The WA Supreme Court found Higgins defamed Reynolds.",
        "The defamation was in a series of social media posts."
      ]
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 04:27:29 +0000",
      "title": "Kevin Rudd took one for the team in the most spectacular way",
      "neutral_headline": "Kevin Rudd's Political Career and Recent Events Discussed",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/trump-albanese-meeting-rudd-pound-of-flesh/105916336",
          "published_at": "Tue, 21 Oct 2025 04:27:29 +0000",
          "title": "Kevin Rudd took one for the team in the most spectacular way",
          "standfirst": "From his humble early days as a child reading Hansard in the regional Sunshine State pocket of Eumundi, Kevin Rudd has been preparing for this martyrdom. But the Passion Of The Kevin, when it came, was a million miles from home.",
          "content": "From his humble early days as a child reading Hansard in the regional Sunshine State pocket of Eumundi, Kevin Rudd has been preparing for this martyrdom. But the Passion Of The Kevin, when it came, was a million miles from home.",
          "feed_position": 5
        }
      ],
      "popularity_score": 288.18169166666667,
      "ai_summary": [
        "Kevin Rudd's career began with reading Hansard in Eumundi, Queensland.",
        "The article discusses his preparation for political roles and recent events.",
        "It mentions a significant event, described as \"The Passion Of The Kevin.\"",
        "The event occurred far from his early life's location.",
        "The article explores the impact of this event on his career."
      ]
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 07:54:23 +0000",
      "title": "Rex Airlines finds US buyer after voluntary administration",
      "neutral_headline": "Rex Airlines Finds US Buyer After Voluntary Administration",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/nsw-rex-airlines-administrators-find-buyer-air-t/105918688",
          "published_at": "Tue, 21 Oct 2025 07:54:23 +0000",
          "title": "Rex Airlines finds US buyer after voluntary administration",
          "standfirst": "Regional Express Airlines has found a buyer after the company went into voluntary administration last July.",
          "content": "Regional Express Airlines has found a buyer after the company went into voluntary administration last July.",
          "feed_position": 6
        }
      ],
      "popularity_score": 281.630025,
      "ai_summary": [
        "Regional Express Airlines entered voluntary administration in July.",
        "The company has now secured a buyer.",
        "The buyer is based in the United States.",
        "The sale follows the company's financial difficulties.",
        "The deal aims to secure the airline's future operations."
      ]
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 08:04:55 +0000",
      "title": "Mayor of inner-Melbourne council says he will fight assault charge",
      "neutral_headline": "Yarra City Council Mayor Will Fight Assault Charge",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/yarra-mayor-stephen-jolly-to-fight-assault-charge/105918388",
          "published_at": "Tue, 21 Oct 2025 08:04:55 +0000",
          "title": "Mayor of inner-Melbourne council says he will fight assault charge",
          "standfirst": "Yarra City Council mayor Stephen Jolly says he will fight an assault charge linked to a local government election afterparty last November.",
          "content": "Yarra City Council mayor Stephen Jolly says he will fight an assault charge linked to a local government election afterparty last November.",
          "feed_position": 7
        }
      ],
      "popularity_score": 277.80558055555554,
      "ai_summary": [
        "Yarra City Council Mayor Stephen Jolly faces an assault charge.",
        "The charge relates to an afterparty following a local government election.",
        "The election occurred in November of the previous year.",
        "Mayor Jolly has stated he will contest the charge.",
        "The case is now proceeding through the legal system."
      ]
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:27:16 +0000",
      "title": "Police working with health authorities after five people ingest rat poison",
      "neutral_headline": "Authorities Investigate Rat Poison Ingestion Cases",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/qld-rat-poison-cluster-logan-patients-police-investigating/105917342",
          "published_at": "Tue, 21 Oct 2025 06:27:16 +0000",
          "title": "Police working with health authorities after five people ingest rat poison",
          "standfirst": "A public health probe has so far failed to identify the source of the poisonings, which authorities say aren't being treated as suspicious.",
          "content": "A public health probe has so far failed to identify the source of the poisonings, which authorities say aren't being treated as suspicious.",
          "feed_position": 7
        }
      ],
      "popularity_score": 270.17808055555554,
      "ai_summary": [
        "Five individuals have ingested rat poison.",
        "Health authorities and police are collaborating on the investigation.",
        "The source of the poisonings remains unidentified.",
        "Authorities currently do not consider the cases suspicious.",
        "The investigation focuses on public health concerns."
      ]
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 00:22:58 +0000",
      "title": "Power tools and a 'perfect storm': How France lost its treasure",
      "neutral_headline": "France's Lost Treasure: Vulnerabilities in the Louvre Museum",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/louvre-museum-heist-how-crown-jewels-became-and-easy-target/105913348",
          "published_at": "Tue, 21 Oct 2025 00:22:58 +0000",
          "title": "Power tools and a 'perfect storm': How France lost its treasure",
          "standfirst": "As French authorities scour Europe for some of their nation's most prized possessions, closer inspection of the Louvre museum itself reveals just how vulnerable it was to the type of attack that saw some of the French crown jewels disappear.",
          "content": "As French authorities scour Europe for some of their nation's most prized possessions, closer inspection of the Louvre museum itself reveals just how vulnerable it was to the type of attack that saw some of the French crown jewels disappear.",
          "feed_position": 8
        }
      ],
      "popularity_score": 254.10641388888888,
      "ai_summary": [
        "French authorities are searching for missing national treasures.",
        "The article examines security vulnerabilities at the Louvre Museum.",
        "It discusses the type of attack that led to the theft of crown jewels.",
        "The investigation extends across Europe.",
        "The focus is on preventing future incidents."
      ]
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 05:00:27 +0000",
      "title": "Japan may have its first female PM, but some say it is not a win for women",
      "neutral_headline": "Japan May Have First Female PM, But Not a Win for Women",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/japan-first-female-pm-sanae-takaichi/105911682",
          "published_at": "Tue, 21 Oct 2025 05:00:27 +0000",
          "title": "Japan may have its first female PM, but some say it is not a win for women",
          "standfirst": "In the world of male-dominated politics, Sanae Takaichi has broken through an incredibly tough glass ceiling.",
          "content": "In the world of male-dominated politics, Sanae Takaichi has broken through an incredibly tough glass ceiling.",
          "feed_position": 9
        }
      ],
      "popularity_score": 248.7311361111111,
      "ai_summary": [
        "Sanae Takaichi has broken through political barriers.",
        "The article discusses the challenges for women in Japanese politics.",
        "It examines the male-dominated environment of politics.",
        "The focus is on the impact of her potential leadership.",
        "The article explores the broader implications for women."
      ]
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 18:50:01 +0000",
      "title": "Record-breaking heatwave to consume larger parts of Queensland for days",
      "neutral_headline": "Queensland Faces Record-Breaking Heatwave for Days",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-22/extreme-heatwave-blankets-parts-of-queensland/105917292",
          "published_at": "Tue, 21 Oct 2025 18:50:01 +0000",
          "title": "Record-breaking heatwave to consume larger parts of Queensland for days",
          "standfirst": "Locals flock to waterholes and outback pubs to escape the heat, as temperatures soar to the mid-40s.",
          "content": "Locals flock to waterholes and outback pubs to escape the heat, as temperatures soar to the mid-40s.",
          "feed_position": 16
        }
      ],
      "popularity_score": 162.55724722222223,
      "ai_summary": [
        "Queensland is experiencing a record-breaking heatwave.",
        "Temperatures are expected to reach the mid-40s.",
        "Locals are seeking relief in waterholes and pubs.",
        "The heatwave is expected to last for several days.",
        "The article highlights the impact of the extreme heat."
      ]
    },
    {
      "id": "cluster_57",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:52:33 +0000",
      "title": "WA government flags climate target legislation, but remains tight-lipped on detail",
      "neutral_headline": "WA Government Plans Climate Target Legislation",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/wa-government-flags-legislating-climate-targets/105918114",
          "published_at": "Tue, 21 Oct 2025 06:52:33 +0000",
          "title": "WA government flags climate target legislation, but remains tight-lipped on detail",
          "standfirst": "The WA government is foreshadowing the introduction of legislated \"climate targets\" next year but refuses to clarify what those targets will be.",
          "content": "The WA government is foreshadowing the introduction of legislated \"climate targets\" next year but refuses to clarify what those targets will be.",
          "feed_position": 15
        }
      ],
      "popularity_score": 160.59946944444445,
      "ai_summary": [
        "The WA government intends to introduce climate target legislation.",
        "The legislation is planned for the coming year.",
        "The government has not yet disclosed specific targets.",
        "Details of the legislation remain undisclosed.",
        "The announcement signals a commitment to climate action."
      ]
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 18:26:14 +0000",
      "title": "A tank escape and mating attempts — raising Maugean skates in captivity",
      "neutral_headline": "Challenges in Captivity for Endangered Maugean Skates",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-22/scientists-prepare-to-release-captive-adult-maugean-skates/105856276",
          "published_at": "Tue, 21 Oct 2025 18:26:14 +0000",
          "title": "A tank escape and mating attempts — raising Maugean skates in captivity",
          "standfirst": "From a specimen unexpectedly launching itself out of a tank, to another dying from a gastrointestinal blockage, and bite marks made during mating rituals, the ABC can reveal the challenges scientist face keeping the endangered Maugean skate species alive.",
          "content": "From a specimen unexpectedly launching itself out of a tank, to another dying from a gastrointestinal blockage, and bite marks made during mating rituals, the ABC can reveal the challenges scientist face keeping the endangered Maugean skate species alive.",
          "feed_position": 14
        }
      ],
      "popularity_score": 152.16085833333332,
      "ai_summary": [
        "Scientists face challenges keeping Maugean skates alive in captivity.",
        "One skate escaped from its tank unexpectedly.",
        "Another skate died from a gastrointestinal blockage.",
        "Bite marks were observed during mating rituals.",
        "The article highlights the difficulties of conservation efforts."
      ]
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 05:59:10 +0000",
      "title": "Alcohol deliveries to Canberra homes could soon be restricted",
      "neutral_headline": "Alcohol Delivery Restrictions Proposed for Canberra Homes",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/act-government-proposes-bill-to-restrict-alcohol-deliveries/105916738",
          "published_at": "Tue, 21 Oct 2025 05:59:10 +0000",
          "title": "Alcohol deliveries to Canberra homes could soon be restricted",
          "standfirst": "The ACT government introduces a bill that would restrict alcohol deliveries to Canberra homes to between 10am and 10pm, and cap the amount of alcohol a consumer could receive in a 24-hour period.",
          "content": "The ACT government introduces a bill that would restrict alcohol deliveries to Canberra homes to between 10am and 10pm, and cap the amount of alcohol a consumer could receive in a 24-hour period.",
          "feed_position": 23
        }
      ],
      "popularity_score": 149.70974722222223,
      "ai_summary": [
        "The ACT government is proposing alcohol delivery restrictions.",
        "Deliveries would be limited to between 10 AM and 10 PM.",
        "There would be a cap on the amount of alcohol per consumer.",
        "The proposed bill is currently under consideration.",
        "The aim is to regulate alcohol consumption and delivery."
      ]
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 04:48:54 +0000",
      "title": "'Footy fatigue' leaves AFLW struggling for attention after men's season",
      "neutral_headline": "AFLW Struggles for Attention After Men's Season Ends",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/aflw-struggling-against-footy-fatigue-after-mens-season/105911454",
          "published_at": "Tue, 21 Oct 2025 04:48:54 +0000",
          "title": "'Footy fatigue' leaves AFLW struggling for attention after men's season",
          "standfirst": "One of the biggest challenges the AFLW faces is end-of-year \"footy fatigue\", according to diehard fans and industry insiders.",
          "content": "One of the biggest challenges the AFLW faces is end-of-year \"footy fatigue\", according to diehard fans and industry insiders.",
          "feed_position": 24
        }
      ],
      "popularity_score": 143.53863611111112,
      "ai_summary": [
        "AFLW faces \"footy fatigue\" after the men's season concludes.",
        "Diehard fans and industry insiders acknowledge the challenge.",
        "The article discusses the impact of the timing on viewership.",
        "The focus is on attracting and retaining audience interest.",
        "The challenge is to maintain momentum for the women's league."
      ]
    },
    {
      "id": "cluster_46",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 08:43:13 +0000",
      "title": "Skipper Healy out of Australia's blockbuster World Cup clash with injury",
      "neutral_headline": "Skipper Healy Out of Australia's Blockbuster World Cup Clash with Injury",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/healy-out-of-australia-s-blockbuster-world-cup-clash-injury/105918786",
          "published_at": "Tue, 21 Oct 2025 08:43:13 +0000",
          "title": "Skipper Healy out of Australia's blockbuster World Cup clash with injury",
          "standfirst": "Alyssa Healy suffers another injury at the pointy end of a World Cup, ruled out of Australia's clash against England with the finals on the horizon.",
          "content": "Alyssa Healy suffers another injury at the pointy end of a World Cup, ruled out of Australia's clash against England with the finals on the horizon.",
          "feed_position": 15
        }
      ],
      "popularity_score": 142.4439138888889,
      "ai_summary": [
        "Alyssa Healy sustained an injury during the World Cup.",
        "She is ruled out of Australia's match against England.",
        "The injury occurred at a crucial stage of the tournament.",
        "The finals are approaching in the competition.",
        "The article discusses the impact of her absence."
      ]
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 08:43:13 +0000",
      "title": "What caused the AWS outage? Why was it such a big deal?",
      "neutral_headline": "What caused the AWS outage? Why was it such a big deal?",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/amazon-web-services-aws-outage-explained/105917274",
          "published_at": "Tue, 21 Oct 2025 08:43:13 +0000",
          "title": "What caused the AWS outage? Why was it such a big deal?",
          "standfirst": "Millions of apps, websites and services rely on AWS, one of the world's largest cloud computing platforms. Here's what we know about the outage.",
          "content": "Millions of apps, websites and services rely on AWS, one of the world's largest cloud computing platforms. Here's what we know about the outage.",
          "feed_position": 18
        }
      ],
      "popularity_score": 142.4439138888889,
      "ai_summary": [
        "AWS is one of the world's largest cloud computing platforms.",
        "Millions of apps, websites, and services rely on AWS.",
        "The article explains the cause of the recent outage.",
        "It details the impact of the outage on various services.",
        "The focus is on understanding the significance of the event."
      ]
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 07:51:24 +0000",
      "title": "Senator Nampijinpa Price civil trial hears CEO's reputation 'hit' after media coverage",
      "neutral_headline": "Senator Nampijinpa Price civil trial hears CEO's reputation 'hit' after media coverage",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/nt-clc-lesley-turner-jacinta-nampijinpa-price-defamation-claim/105915448",
          "published_at": "Tue, 21 Oct 2025 07:51:24 +0000",
          "title": "Senator Nampijinpa Price civil trial hears CEO's reputation 'hit' after media coverage",
          "standfirst": "On day two of the senator's defamation trial, a witness told the court the chief executive of one of the NT's largest land councils took a \"sustained hit\" to his reputation when news broke about an alleged no-confidence motion last year.",
          "content": "On day two of the senator's defamation trial, a witness told the court the chief executive of one of the NT's largest land councils took a \"sustained hit\" to his reputation when news broke about an alleged no-confidence motion last year.",
          "feed_position": 10
        }
      ],
      "popularity_score": 141.58030277777777,
      "ai_summary": [
        "A defamation trial involving Senator Nampijinpa Price is underway.",
        "A witness testified about the impact on a CEO's reputation.",
        "The CEO leads one of the NT's largest land councils.",
        "The reputation was affected by media coverage.",
        "The coverage related to an alleged no-confidence motion."
      ]
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 07:43:10 +0000",
      "title": "Repatriation brings 'tears of joy' as remains re-buried after decades",
      "neutral_headline": "Repatriation brings 'tears of joy' as remains re-buried after decades",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/kaurna-ancestral-remains-re-buried-repatriation-ceremony/105917020",
          "published_at": "Tue, 21 Oct 2025 07:43:10 +0000",
          "title": "Repatriation brings 'tears of joy' as remains re-buried after decades",
          "standfirst": "An emotional ceremony for the repatriation of Aboriginal remains that had been held by institutions, including the South Australian Museum, has been held in Adelaide's north at a site that is now a resting place for hundreds of Kaurna ancestors.",
          "content": "An emotional ceremony for the repatriation of Aboriginal remains that had been held by institutions, including the South Australian Museum, has been held in Adelaide's north at a site that is now a resting place for hundreds of Kaurna ancestors.",
          "feed_position": 11
        }
      ],
      "popularity_score": 141.44308055555555,
      "ai_summary": [
        "Aboriginal remains were repatriated in Adelaide.",
        "The remains were re-buried after being held by institutions.",
        "The ceremony was emotional, evoking \"tears of joy\".",
        "The resting place is now a site for Kaurna ancestors.",
        "The event involved the South Australian Museum."
      ]
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 07:38:46 +0000",
      "title": "Canberra man jailed for part in brutal baseball bat attack",
      "neutral_headline": "Canberra Man Jailed for Baseball Bat Attack on Woman",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/act-man-jailed-for-part-in-brutal-baseball-bat-attack/105918202",
          "published_at": "Tue, 21 Oct 2025 07:38:46 +0000",
          "title": "Canberra man jailed for part in brutal baseball bat attack",
          "standfirst": "A Canberra man has pleaded guilty to his part in a \"cruel\" and \"premeditated\" attack on a woman, helping trick her into a car before driving her around, hitting her with a baseball bat, choking her and demanding $10,000.",
          "content": "A Canberra man has pleaded guilty to his part in a \"cruel\" and \"premeditated\" attack on a woman, helping trick her into a car before driving her around, hitting her with a baseball bat, choking her and demanding $10,000.",
          "feed_position": 12
        }
      ],
      "popularity_score": 141.36974722222223,
      "ai_summary": [
        "A Canberra man pleaded guilty to involvement in a brutal attack on a woman.",
        "The man helped trick the woman into a car before the assault.",
        "He drove the woman around before hitting her with a baseball bat.",
        "The man choked the woman and demanded a $10,000 ransom.",
        "The attack was described as \"cruel\" and \"premeditated\" by authorities."
      ]
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 07:22:23 +0000",
      "title": "'It's ... a stepping stone': Top Shield spell boosts Boland for Ashes",
      "neutral_headline": "Scott Boland's Shield Spell Boosts Confidence for Ashes",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/top-sheffield-shield-spell-boosts-boland-for-ashes/105918176",
          "published_at": "Tue, 21 Oct 2025 07:22:23 +0000",
          "title": "'It's ... a stepping stone': Top Shield spell boosts Boland for Ashes",
          "standfirst": "Australian Test paceman Scott Boland says his five-wicket spell for Victoria last Friday was important for his confidence ahead of the Ashes.",
          "content": "Australian Test paceman Scott Boland says his five-wicket spell for Victoria last Friday was important for his confidence ahead of the Ashes.",
          "feed_position": 13
        }
      ],
      "popularity_score": 141.09669166666666,
      "ai_summary": [
        "Scott Boland took five wickets for Victoria in a recent match.",
        "Boland believes the performance boosted his confidence.",
        "The Ashes series is a major upcoming event for the Australian team.",
        "Boland is an Australian Test paceman.",
        "The match was played last Friday."
      ]
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 07:22:17 +0000",
      "title": "Hobart private school staff member charged with child abuse offence",
      "neutral_headline": "Hobart School Staff Member Charged with Child Abuse",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/friends-school-staff-member-child-abuse-charge/105918150",
          "published_at": "Tue, 21 Oct 2025 07:22:17 +0000",
          "title": "Hobart private school staff member charged with child abuse offence",
          "standfirst": "The non-teaching member of staff at The Friends' School was arrested and charged following two police raids in Hobart.",
          "content": "The non-teaching member of staff at The Friends' School was arrested and charged following two police raids in Hobart.",
          "feed_position": 14
        }
      ],
      "popularity_score": 141.095025,
      "ai_summary": [
        "A non-teaching staff member at The Friends' School was arrested.",
        "The arrest followed two police raids in Hobart.",
        "The staff member is charged with a child abuse offense.",
        "The school is a private institution in Hobart.",
        "Details of the charges have not been released."
      ]
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:32:52 +0000",
      "title": "Timothy Hunt sentenced to life in prison for missing Darwin man's murder",
      "neutral_headline": "Timothy Hunt Sentenced to Life for Darwin Man's Murder",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/nt-timothy-hunt-sentenced-life-in-prison-over-tony-rowe-murder/105915660",
          "published_at": "Tue, 21 Oct 2025 06:32:52 +0000",
          "title": "Timothy Hunt sentenced to life in prison for missing Darwin man's murder",
          "standfirst": "Timothy Hunt is sentenced to life in prison for the murder of missing Darwin man Tony Rowe, in what Justice Sonia Brownhill described as a \"bizarre, brutal and cowardly attack\".",
          "content": "Timothy Hunt is sentenced to life in prison for the murder of missing Darwin man Tony Rowe, in what Justice Sonia Brownhill described as a \"bizarre, brutal and cowardly attack\".",
          "feed_position": 17
        }
      ],
      "popularity_score": 140.2714138888889,
      "ai_summary": [
        "Timothy Hunt received a life sentence for the murder of Tony Rowe.",
        "Tony Rowe was a missing person from Darwin.",
        "Justice Sonia Brownhill described the attack as \"bizarre, brutal and cowardly\".",
        "The murder occurred in Darwin.",
        "The sentencing concludes the legal proceedings."
      ]
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:26:27 +0000",
      "title": "Border Force cracks down on 3D-printed guns and parts",
      "neutral_headline": "Border Force Cracks Down on 3D-Printed Guns and Parts",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/border-force-seize-3d-printed-guns-and-parts/105917850",
          "published_at": "Tue, 21 Oct 2025 06:26:27 +0000",
          "title": "Border Force cracks down on 3D-printed guns and parts",
          "standfirst": "An Australian Border Force operation leads to the seizure of more than 1,000 firearms and parts, including 281 made via 3D-printing processes.",
          "content": "An Australian Border Force operation leads to the seizure of more than 1,000 firearms and parts, including 281 made via 3D-printing processes.",
          "feed_position": 20
        }
      ],
      "popularity_score": 140.16446944444445,
      "ai_summary": [
        "Australian Border Force seized over 1,000 firearms and parts.",
        "The operation included 281 items made via 3D-printing.",
        "The seizure was part of a Border Force operation.",
        "The operation targeted illegal firearms and components.",
        "The investigation is ongoing."
      ]
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:20:37 +0000",
      "title": "Demolitions begin for Trump's ballroom in the latest White House renovation",
      "neutral_headline": "Demolitions Begin for Trump's Ballroom Renovation",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/trump-begins-demolition-to-prepare-for-white-house-ballroom/105915632",
          "published_at": "Tue, 21 Oct 2025 06:20:37 +0000",
          "title": "Demolitions begin for Trump's ballroom in the latest White House renovation",
          "standfirst": "Demolition work has begun for Donald Trump's new ballroom. It is one of many changes to the White House over the years.",
          "content": "Demolition work has begun for Donald Trump's new ballroom. It is one of many changes to the White House over the years.",
          "feed_position": 13
        }
      ],
      "popularity_score": 140.06724722222222,
      "ai_summary": [
        "Demolition work has started for Donald Trump's new ballroom.",
        "The ballroom is part of ongoing renovations at the White House.",
        "The White House has undergone many changes over the years.",
        "The renovations are a significant undertaking.",
        "The project reflects current White House priorities."
      ]
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:13:11 +0000",
      "title": "Myanmar military shuts down major online scam operation detaining 2,000 people",
      "neutral_headline": "Myanmar Military Shuts Down Online Scam Operation",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/myanmar-military-shuts-down-cybercrime-centre/105917612",
          "published_at": "Tue, 21 Oct 2025 06:13:11 +0000",
          "title": "Myanmar military shuts down major online scam operation detaining 2,000 people",
          "standfirst": "The military raided KK Park which is a well-documented cybercrime centre as part of its operations to suppress crimes like online fraud.",
          "content": "The military raided KK Park which is a well-documented cybercrime centre as part of its operations to suppress crimes like online fraud.",
          "feed_position": 22
        }
      ],
      "popularity_score": 139.94335833333332,
      "ai_summary": [
        "The Myanmar military raided KK Park, a cybercrime center.",
        "The raid targeted online fraud and other cybercrimes.",
        "Approximately 2,000 people were detained during the operation.",
        "KK Park is a well-documented center for cybercrime.",
        "The military is working to suppress online criminal activities."
      ]
    },
    {
      "id": "cluster_65",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 06:11:47 +0000",
      "title": "Fishing industry shocked by mandatory reporting refusal",
      "neutral_headline": "Fishing Industry Shocked by Mandatory Reporting Refusal",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/wa-fishing-council-shocked-by-state-government-fishery-approach/105916462",
          "published_at": "Tue, 21 Oct 2025 06:11:47 +0000",
          "title": "Fishing industry shocked by mandatory reporting refusal",
          "standfirst": "Western Australia's commercial fishing industry says live data is essential to improve the health of the state's fisheries, but the WA government and recreational groups say it is not needed.",
          "content": "Western Australia's commercial fishing industry says live data is essential to improve the health of the state's fisheries, but the WA government and recreational groups say it is not needed.",
          "feed_position": 22
        }
      ],
      "popularity_score": 139.920025,
      "ai_summary": [
        "Western Australia's fishing industry wants live data reporting.",
        "The industry believes data improves fisheries health.",
        "The WA government and recreational groups oppose the reporting.",
        "The disagreement concerns data collection and transparency.",
        "The issue impacts the management of state fisheries."
      ]
    },
    {
      "id": "cluster_89",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 00:55:52 +0000",
      "title": "'Nothing to see here, man': Tony Armstrong on racism, denial and Aussie sport",
      "neutral_headline": "Tony Armstrong Discusses Racism and Aussie Sport",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/tony-armstrong-tackles-racism-in-sport-in-end-game/105897492",
          "published_at": "Tue, 21 Oct 2025 00:55:52 +0000",
          "title": "'Nothing to see here, man': Tony Armstrong on racism, denial and Aussie sport",
          "standfirst": "Proud Gamilaroi man and TV presenter Tony Armstrong has felt the sting of racist trolling online. Now he's using it as ammunition as he tackles racism in sport in the new documentary series End Game.",
          "content": "Proud Gamilaroi man and TV presenter Tony Armstrong has felt the sting of racist trolling online. Now he's using it as ammunition as he tackles racism in sport in the new documentary series End Game.",
          "feed_position": 11
        }
      ],
      "popularity_score": 139.65474722222223,
      "ai_summary": [
        "Tony Armstrong is a Gamilaroi man and TV presenter.",
        "Armstrong has experienced racist trolling online.",
        "He is using his experiences in a new documentary series.",
        "The series is titled \"End Game\" and tackles racism.",
        "The documentary explores racism in Australian sport."
      ]
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 05:52:52 +0000",
      "title": "RACQ issues apology to customers after insurance notice bungle",
      "neutral_headline": "RACQ Issues Apology After Insurance Notice Bungle",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-10-21/racq-apologises-insurance-renewal-notices-lawsuit/105916966",
          "published_at": "Tue, 21 Oct 2025 05:52:52 +0000",
          "title": "RACQ issues apology to customers after insurance notice bungle",
          "standfirst": "RACQ is facing allegations that more than half a million renewal notices were misleading or false, following an ABC investigation into its insurance arm.",
          "content": "RACQ is facing allegations that more than half a million renewal notices were misleading or false, following an ABC investigation into its insurance arm.",
          "feed_position": 24
        }
      ],
      "popularity_score": 139.60474722222222,
      "ai_summary": [
        "RACQ apologized to customers after an insurance notice issue.",
        "Allegations claim over half a million notices were misleading.",
        "An ABC investigation revealed the issues with the notices.",
        "The notices concerned insurance renewals.",
        "The company is facing scrutiny over its practices."
      ]
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 04:55:52 +0000",
      "title": "Fall from grace as Sarkozy trades the Élysée Palace for a prison cell",
      "neutral_headline": "Sarkozy Begins Prison Sentence for Criminal Conspiracy",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/former-french-president-nicolas-sarkozy-to-begin-prison-sentence/105916788",
          "published_at": "Tue, 21 Oct 2025 04:55:52 +0000",
          "title": "Fall from grace as Sarkozy trades the Élysée Palace for a prison cell",
          "standfirst": "Former French president Nicolas Sarkozy is due to start serving a five-year sentence in prison, after being convicted of criminal conspiracy over a plan for late Libyan dictator Muammar Gaddafi to fund his electoral campaign.",
          "content": "Former French president Nicolas Sarkozy is due to start serving a five-year sentence in prison, after being convicted of criminal conspiracy over a plan for late Libyan dictator Muammar Gaddafi to fund his electoral campaign.",
          "feed_position": 12
        }
      ],
      "popularity_score": 138.65474722222223,
      "ai_summary": [
        "Former French president Nicolas Sarkozy is starting a prison sentence.",
        "He was convicted of criminal conspiracy.",
        "The conviction relates to funding from Muammar Gaddafi.",
        "Gaddafi was the late Libyan dictator.",
        "Sarkozy's sentence is for five years."
      ]
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 04:44:28 +0000",
      "title": "Man found guilty of brutal murder of Gold Coast landlord",
      "neutral_headline": "Man Found Guilty of Brutal Murder of Gold Coast Landlord",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/jason-thomas-king-gold-coast-murder-trial-susan-walker-verdict/105917448",
          "published_at": "Tue, 21 Oct 2025 04:44:28 +0000",
          "title": "Man found guilty of brutal murder of Gold Coast landlord",
          "standfirst": "Jason Thomas King has been sentenced to life in prison after being found guilty of beating 74-year-old Susan Walker to death at her Gold Coast home, where he rented a room.",
          "content": "Jason Thomas King has been sentenced to life in prison after being found guilty of beating 74-year-old Susan Walker to death at her Gold Coast home, where he rented a room.",
          "feed_position": 21
        }
      ],
      "popularity_score": 138.46474722222223,
      "ai_summary": [
        "Jason Thomas King was found guilty of murder.",
        "He murdered 74-year-old Susan Walker at her home.",
        "King was a tenant renting a room from Walker.",
        "He has been sentenced to life in prison.",
        "The murder occurred on the Gold Coast."
      ]
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 03:07:22 +0000",
      "title": "Giuffre haunted by 'hungry ghosts' of Epstein and Maxwell, memoir says",
      "neutral_headline": "Giuffre Haunted by 'Hungry Ghosts' of Epstein and Maxwell, memoir says",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/virginia-giuffre-epstein-prince-andrew-nobodys-girl-memoir/105911280",
          "published_at": "Tue, 21 Oct 2025 03:07:22 +0000",
          "title": "Giuffre haunted by 'hungry ghosts' of Epstein and Maxwell, memoir says",
          "standfirst": "The late Virginia Giuffre's memoir details how she became involved in the shadowy world of notorious sex offender Jeffrey Epstein, which led to her abuse at the hands of some of the world's \"wealthiest and most powerful\" people.",
          "content": "The late Virginia Giuffre's memoir details how she became involved in the shadowy world of notorious sex offender Jeffrey Epstein, which led to her abuse at the hands of some of the world's \"wealthiest and most powerful\" people.",
          "feed_position": 19
        }
      ],
      "popularity_score": 136.8464138888889,
      "ai_summary": [
        "Virginia Giuffre's memoir details her involvement with Epstein and Maxwell.",
        "The memoir describes her abuse by wealthy and powerful people.",
        "Jeffrey Epstein was a notorious sex offender.",
        "Ghislaine Maxwell was also involved in the sex trafficking.",
        "The memoir explores the impact of the events on Giuffre."
      ]
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 02:45:03 +0000",
      "title": "Controversial river gets first green light to host 2032 Olympic events",
      "neutral_headline": "Controversial River Gets Green Light for Olympic Events",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-10-21/rockhampton-fitzroy-river-2032-brisbane-olympics-giica-testing/105915800",
          "published_at": "Tue, 21 Oct 2025 02:45:03 +0000",
          "title": "Controversial river gets first green light to host 2032 Olympic events",
          "standfirst": "Despite backlash from national and international bodies, Rockhampton's Fitzroy River receives positive feedback following initial water testing to prove it is up to standard to host rowing and canoeing events for the Brisbane Games.",
          "content": "Despite backlash from national and international bodies, Rockhampton's Fitzroy River receives positive feedback following initial water testing to prove it is up to standard to host rowing and canoeing events for the Brisbane Games.",
          "feed_position": 23
        }
      ],
      "popularity_score": 136.47446944444445,
      "ai_summary": [
        "The Fitzroy River will host 2032 Olympic events.",
        "The decision follows initial water testing.",
        "The testing aimed to prove the river's suitability.",
        "The river faced backlash from various bodies.",
        "Rowing and canoeing events will be held there."
      ]
    }
  ]
}