{
  "updated_at": "2026-01-03T23:19:49.742Z",
  "clusters": [
    {
      "id": "cluster_0",
      "coverage": 5,
      "updated_at": "Sun, 04 Jan 2026 10:14:20 +1100",
      "title": "Venezuela strikes live updates: Nicolas Maduro arrives in New York after being captured by US government; Trump reveals US will ‘run’ Venezuela",
      "neutral_headline": "How the US captured Venezuelan leader Nicolas Maduro",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/south-america/venezuela-crisis-live-caracas-accuses-us-of-attacking-civilian-and-military-targets-20260103-p5nrex.html",
          "published_at": "Sun, 04 Jan 2026 10:14:20 +1100",
          "title": "Venezuela strikes live updates: Nicolas Maduro arrives in New York after being captured by US government; Trump reveals US will ‘run’ Venezuela",
          "standfirst": "After taking Venezuelan President Nicolas Maduro into US custody, US President Donald Trump has revealed plans to ‘run’ the country and tap its vast oil fields. Follow for live updates.",
          "content": "After taking Venezuelan President Nicolas Maduro into US custody, US President Donald Trump has revealed plans to ‘run’ the country and tap its vast oil fields. Follow for live updates.",
          "feed_position": 0,
          "image_url": "https://static.ffx.io/images/$zoom_0.225%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/q_86%2Cf_auto/462fa3955a36684c91f94a598210e6b51db28c07"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/south-america/how-the-us-captured-venezuelan-leader-nicolas-maduro-20260104-p5nrg9.html",
          "published_at": "Sun, 04 Jan 2026 10:13:28 +1100",
          "title": "How the US captured Venezuelan leader Nicolas Maduro",
          "standfirst": "President Donald Trump has disclosed how US forces spent months rehearsing operations against Venezuela, mapping every move of Nicolas Maduro, including his safe house.",
          "content": "President Donald Trump has disclosed how US forces spent months rehearsing operations against Venezuela, mapping every move of Nicolas Maduro, including his safe house.",
          "feed_position": 1,
          "image_url": "https://static.ffx.io/images/$zoom_0.3415%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_82/t_crop_custom/q_86%2Cf_auto/a4085fa631a0d807dcfb7b1b463f719cda6b12c2"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/venezuela-explosions-reported-in-capital-caracas/79b4f99d-181e-4fc5-8ddb-f5a48d197d22",
          "published_at": "Sat, 03 Jan 2026 22:16:05 +0000",
          "title": "Trump says US 'is going to run' Venezuela after capture of Maduro",
          "standfirst": "The Venezuelan president and his wife have been taken into custody by the US in an extraordinary nighttime operation.",
          "content": "President Donald Trump says the US will run Venezuela until new leadership is decided after the capture of President Nicolas Maduro and his wife in an extraordinary nighttime operation.Trump posted a photo on Truth Social of Maduro, blindfolded, handcuffed, wearing a grey Nike tracksuit and holding a bottle of water on board the warship USS Iwo Jima on its way to New York.Speaking from Mar-a-Lago just before 4am (AEDT), Trump revealed new details of Operation Absolute Resolve and said \"we&#x27;re going to run the country until such time as we can do a safe, proper and judicious transition\".READ MORE: Why is the US attacking Venezuela? \"We don&#x27;t want to be involved with having someone else get in and we have the same situation that we had for the last long period of years. So we are going to run the country,\" he said.Trump said the US government would tap Venezuela&#x27;s vast oil reserves to sell \"large amounts\" to other countries.He said the US would send in troops for the purposes of securing oil, vowing the money would go towards reimbursing Venezuelans and the United States for damages caused under Maduro&#x27;s leadership.\"We&#x27;re going to be taking out a tremendous amount of wealth out of the ground, and that wealth is going to the people of Venezuela and people from outside of Venezuela that used to be in Venezuela. And it goes also to the United States of America in the form of reimbursement for the damages caused us by that country,\" Trump said.READ MORE: Operation Absolute Resolve: Inside the US mission to capture MaduroUS planned operation for many monthsGeneral Dan Caine, the chairman of the Joint Chiefs of Staff, said US intelligence agencies had tracked Maduro for many months to \"understand how he moved, where he lived, where he travelled, what he ate, what he wore\".CNN previously reported that the CIA had installed a small team inside Venezuela over the northern hemisphere summer to keep a close watch on Maduro&#x27;s activities.Caine said Operation Absolute Resolve involved more than 150 aircraft launched from 20 different bases on land and sea.Among them were helicopters carrying an extraction force that began their flight into Venezuela at just 30 metres above the water.Some troops suffered bullet and shrapnel wounds but their injuries were not believed to be life-threatening. Caine said one US aircraft was struck during the operation, \"but remained flyable\".READ MORE: Venezuelan president and wife on US warship heading to New York. Here&#x27;s what to knowTrump said Maduro could have been killed as he tried to evade capture.\"He was trying to get into a safe place. You know, the safe place&#x27;s all steel, and he wasn&#x27;t able to make it to the door because our guys were so fast.\"The US military \"went through the opposition so fast\", Trump said, while also noting that \"there was a lot of opposition\". \"People were wondering, do we get them by surprise? Sort of surprised, but they were waiting for something. It was a lot of opposition. There was a lot of gunfire,\" he said.Trump said lights in Caracas were shut off during the operation to capture Maduro, which began just before 2am on Saturday (6pm AEDT).\"No nation in the world could achieve what America achieved yesterday,\" Trump said this morning.READ MORE: Who is Nicolas Maduro? From bus driver to Venezuela president\"In just a short period of time, all Venezuelan military capacities were rendered powerless as the men and women of our military, working with us, law enforcement, successfully captured Maduro in the dead of night.\"It was dark, the lights of Caracas were largely turned off due to a certain expertise that we have.\"It was dark and it was deadly.\"Trump claims vice president sworn in, speaking with USThere were mixed reactions from citizens: supporters of Maduro were seen embracing each other on the streets of Caracas, while elsewhere, such as in Madrid, Spain, Venezuelans celebrated the downfall of Maduro.Maduro&#x27;s government urged citizens to take to the streets. Nobel Peace Prize winner Maraa Corina Machado, the most prominent political opposition of Maduro, posted a statement saying: \"Venezuelans, the time for freedom has come.\"It was not immediately clear who was running Venezuela in the hours after Maduro&#x27;s capture.Under Venezuelan law, Vice President Delcy Rodriguez would be expected to take power.READ MORE: &#x27;Extraordinary&#x27; couple gunned down in their US homeTrump said she had been sworn in as president but was speaking with US Secretary of State Marco Rubio.\"She is essentially willing to do what we think is necessary to make Venezuela great again. Very simple,\" Trump said.Earlier, Machado – who has been living outside of Venezuela for her own safety – said that the opposition candidate Edmundo Gonzalez should assume power, saying that he rightfully won the 2024 presidential election.Rodriguez condemns &#x27;kidnapping&#x27;In a televised speech, Rodriguez called for calm and unity, before contradicting Trump&#x27;s earlier claims that she had been sworn in as president of Venezuela.\"We demand the immediate release of President Nicolas Maduro and his wife. The only president of Venezuela is President Nicolas Maduro,\" Rodriguez said.The VP said Venezuela&#x27;s government was prepared to defend itself, adding that the country&#x27;s defence council had been activated. She confirmed an official government response would be expected soon.\"To our Venezuela, to our people: There is a clear government here,\" she said.Rodriguez emphasised that Venezuela \"will never again be anyone&#x27;s colony – neither of old empires, nor of new empires, nor of empires in decline\".Maduro and wife to face &#x27;justice&#x27; The capture of a sitting leader marked the culmination of an escalating Trump administration pressure campaign on the South American country that consisted of months of strikes on boats officials said were smuggling drugs to the US.US Attorney General Pam Bondi said Maduro and his wife, Cilia Flores, would face charges after an indictment in New York, vowing that the couple would \"soon face the full wrath of American justice on American soil in American courts\".Maduro and other Venezuelan officials were indicted in 2020 on \"narco-terrorism\" conspiracy charges, but it was not previously known that his wife had been.It wasn&#x27;t clear if Bondi was referring to a new indictment when she said the pair would face justice. The details of the allegations against Flores were not immediately known.On Friday, a day before the attack, Venezuela said it was open to negotiating an agreement with the US to combat drug trafficking.Maduro also said in a pre-taped interview that aired on Thursday that the US wanted to force a government change in Venezuela and gain access to its vast oil reserves through the monthslong pressure campaign that began with a massive military deployment to the Caribbean Sea in August.The CIA was behind a drone strike last week at a docking area believed to have been used by Venezuelan drug cartels in what was the first known direct operation on Venezuelan soil since the US began strikes on boats in September.Trump for months had threatened that he could soon order strikes on targets on Venezuelan land. The US has also seized sanctioned oil tankers off the coast of Venezuela, and Trump ordered a blockade of others in a move that seemed designed to put a tighter chokehold on the South American country&#x27;s economy.The US military has been attacking boats in the Caribbean Sea and the eastern Pacific Ocean since early September. As of Friday, the number of known boat strikes was 35 and the number of people killed was at least 115, according to numbers announced by the Trump administration.They followed a major buildup of American forces in the waters off South America, including the arrival in November of the nation&#x27;s most advanced aircraft carrier, which added thousands more troops to what was already the largest military presence in the region in generations.Trump has justified the boat strikes as a necessary escalation to stem the flow of drugs into the US and asserted that the US is engaged in an \"armed conflict\" with drug cartels.&#x27;This is horrible&#x27; There had been at least seven explosions in the US strike, which sent people rushing into the streets.It was not clear how many people had been injured during the operation that lasted about 30 minutes. \"One [explosion] was so strong, my window was shaking after it,\" CNN correspondent Osmary Hernandez said.Smoke could be seen rising from the hangar of a military base in Caracas. Another military installation in the capital was without power.\"The whole ground shook. This is horrible. We heard explosions and planes in the distance,\" said Carmen Hidalgo, a 21-year-old office worker, her voice trembling.She was walking briskly with two relatives, returning from a birthday party.\"We felt like the air was hitting us.\"Venezuela&#x27;s government has called on its supporters to take to the streets.\"People to the streets!\" the government said in a statement.\"The Bolivarian government calls on all social and political forces in the country to activate mobilisation plans and repudiate this imperialist attack.\"The statement added that Maduro had \"ordered all national defence plans to be implemented\" and declared \"a state of external disturbance\".- Reported with Associated Press and CNN",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/1be6c632-6d3e-4234-96a5-7cbe2ec70e1d"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/trump-doesn-t-have-an-exit-plan-after-capturing-venezuelan-president-20260104-p5nrgo.html",
          "published_at": "Sun, 04 Jan 2026 08:57:08 +1100",
          "title": "Trump ‘doesn’t have an exit plan’ after capturing Venezuelan president",
          "standfirst": "Former White House advisor Laura Schwartz said Donald Trump doesn’t appear to have an “exit plan” after capturing Nicolas Maduro and his wife Cilia Flores.",
          "content": "Former White House advisor Laura Schwartz said Donald Trump doesn’t appear to have an “exit plan” after capturing Nicolas Maduro and his wife Cilia Flores.",
          "feed_position": 11,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/69f5dc6e114ee2dbd6eba50c52f13295a33e1ca1"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/venezuela-who-is-president-nicolas-maduro-wife-cilia-flores-explainer/510bb4fb-26db-491c-b8c6-bc3d454ab4a7",
          "published_at": "Sat, 03 Jan 2026 20:28:17 +0000",
          "title": "Who is Cilia Flores, Maduro's wife and 'first combatant'?",
          "standfirst": "Captured along with Venezuelan President Nicolás Maduro was his wife and top adviser, Cilia Flores, who was dragged from their bedroom along with her husband by US troops.",
          "content": "Captured along with Venezuelan President Nicolas Maduro was his wife and top adviser, Cilia Flores, who was dragged from their bedroom along with her husband by US troops.The couple were quickly spirited out of the country to stand trial on US drug-trafficking charges.\"Cilita\", as Maduro calls her, served as first lady for more than a decade – although in the official jargon of the socialist movement known as Chavismo she is referred to as \"first combatant\\\".READ MORE: Why is the US attacking Venezuela? She has been Maduro&#x27;s partner for more than 30 years, during which time she built her own political capital and was considered one of the most powerful women in Venezuela.Cilia Flores, born in 1956 in the town of Tinaquillo in central Venezuela, grew up in working-class neighbourhoods in western Caracas.She met Maduro, who frequently emphasises his humble origins, during the early days of the Chavista movement.A lawyer specialising in labour and criminal law, she provided legal assistance to Hugo Chavez, the movement&#x27;s namesake, and other military officers who were captured after attempting to overthrow then-President Carlos Andres Perez in 1992.Maduro, for his part, also campaigned for Chavez&#x27;s release and was on the then-lieutenant colonel&#x27;s security team.\"During that struggle for Chavez&#x27;s release, we were involved in street activities. I always remember a meeting in Catia, and when a young man asked to speak, he spoke, and I just stared at him. I said, &#x27;How intelligent&#x27;,\" Flores recalled in November 2023, on the first episode of Maduro&#x27;s podcast.READ MORE: Trump says US &#x27;is going to run&#x27; Venezuela after capture of Maduro Since then, they have remained inseparable, but Flores forged her own political path.She was elected to her first term as a member of the National Assembly in 2000, the year after Chavez was elected president.She won a seat again in 2005, and a year later she became the first woman to preside over parliament, succeeding Maduro, who became Chavez&#x27;s foreign minister.During her tenure, she banned journalists from entering the legislative chamber.She was also criticised for hiring dozens of relatives as employees in Congress.In an interview with Spanish newspaper La Vanguardia, she responded that the complaint was never formally filed and that it was a smear campaign, but she confirmed the hirings: \"Yes, my family members were hired based on their own merits; I am proud of them and I will defend their work whenever necessary.\"READ MORE: Operation Absolute Resolve: Inside the US mission to capture MaduroA staunch Chavez loyalistBetween 2009 and 2011, she also served as the second vice president of the United Socialist Party of Venezuela, then led by Chavez, who in 2012 appointed Flores attorney general.Alongside Maduro, who was already vice president, she visited Chavez in Cuba, where he was treated for cancer during the final months of life.Her Twitter profile, when she created in 2015, read \"Daughter of Chavez\", although she changed it a few years later to \"Chavista\".Flores and Maduro, who met after Chavez surrendered following his 1992 failed coup attempt, married in July 2013, after two decades together and shortly after Maduro&#x27;s victory in the presidential election against then-opposition candidate Henrique Capriles.\"She has a significant political background. When she became first lady, she took a back seat. But for many, she is the power behind the throne or a top adviser,\" Carmen Arteaga, a doctor of political science and associate professor at Simón Bolívar University, told CNN.\"When they got married, she significantly lowered her profile. She hardly makes public statements, she doesn&#x27;t compete for attention, she takes a step back,\" she added.According to Arteaga, Flores&#x27;s support and advice would have been fundamental during those years when Chavismo was experiencing internal disputes over Chavez&#x27;s succession.Maduro, anointed by the then-president, was still consolidating his leadership over other prominent figures close to the deceased leader, such as Rafael Ramírez, the ousted president of Petroleos de Venezuela and minister of energy and petroleum; lawmaker Diosdado Cabello or Vice President Elias Jaua.In that circle, few women have held high-ranking positions.For Arteaga, there was \"no doubt\" that Flores was the most powerful woman in the country, at least as long as Chavismo remained in power.Wielding power behind the scenesPolitical scientist Estefanaa Reyes told CNN that it was difficult to quantify her power because she wielded it \"behind the scenes\" and it was not institutionalised.\"It&#x27;s dangerous not to understand the dynamics of decision-making, because that makes it difficult to ensure accountability and transparency regarding influence,\" she said.If there ever was a dual leadership, it was never formalised, unlike in Nicaragua between President Daniel Ortega and his wife, Vice President Rosario Murillo.Reyes also pointed out that Flores appeared in recent years in a supporting role as a mother figure, seeking to connect more with the public rather than as a figure of electoral competition.\"Chavismo instrumentalises the role of mother. Symbolically, she remains bound by gender restrictions,\" said Reyes, an assistant professor at Western University in Canada.For years, the position of first lady was not used in Venezuela, since Chávez had divorced. When Maduro assumed power, he christened Flores \"first combatant,\" arguing that \"first lady\" was an \"aristocratic concept\".In this regard, Reyes noted that, despite the informal change of title, the position continues to be linked, as in other countries, to causes such as child protection and the leadership of charitable organisations.Political scientist Nastassja Rojas, a professor of human rights at Javeriana University in Colombia, agreed.\"Chavismo betrays everything they had criticised by presenting her as the first combatant. What she now projects is a person who is the president&#x27;s partner, who accompanies him. In recent years, they have completely changed her profile,\" she told CNN.READ MORE: Venezuelan president and wife on US warship heading to New York. Here&#x27;s what to knowNephews convicted in USWith fewer appearances once Maduro&#x27;s government began, Flores was almost exclusively limited to one of the numerous radio programs that figures from the ruling party have had, titled \"With Cilia in the Family\".But her name returned to the headlines in 2015 when two of her nephews were arrested on drug-trafficking charges by undercover agents of the US Drug Enforcement Administration (DEA) in Haiti.Flores called the incident a kidnapping, but both were tried and convicted in New York and sentenced to 18 years in prison for conspiring to import cocaine into the US. In 2022, they were released in a prisoner exchange between Caracas and Washington.She was also sanctioned in 2018 by Canadian authorities, along with 13 other officials, a day after the Organisation of American States reported that the Maduro government had committed crimes against humanity.A few months later, the US Treasury Department added its own sanctions, explaining in a press release that Maduro \"relies on his inner circle to remain in power\".In response, Maduro declared: \"If you want to attack me, attack me. Don&#x27;t mess with Cilia. Don&#x27;t mess with the family. Don&#x27;t be cowards. Her only crime is being my wife.\"By this time, Flores had returned to the Legislative Palace after being elected in 2017 to the Constituent Assembly and, in 2021, as a deputy in the National Assembly, a position she held at the time of her capture.READ MORE: Who is Nicolas Maduro? From bus driver to Venezuela presidentA polarising figureArteaga, the professor at Simon Bolívar University, maintained that Flores has not distinguished herself by promoting feminist proposals, although socialism champions the oppressed, including women in that group. Flores \"follows the Chavista agenda; she has not been known for a feminist agenda,\" Arteaga added.While she has not attracted as much public attention as Maduro, Arteaga said, she is just as polarising as the ousted president.\"Currently, she is unpopular; she has the same image as him. They work closely together, and public opinion perceives them as a single entity,\" Arteaga said.Thus, when the government distributed millions of toys for the 2022 Christmas holidays, it handed out images of \"SuperBigote\", a cartoon character inspired by Maduro, but also the \"Cilita\" doll, the co-star of the animated series.During the 2024 presidential campaign that resulted in Maduro&#x27;s disputed re-election, Flores accompanied her husband to several events, even dancing with him on stage.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/ec3f543a-95a6-4226-b543-345a08707fef"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/us-takes-control-of-venezuela-after-capturing-nicolas-maduro-20260104-p5nrg2.html",
          "published_at": "Sun, 04 Jan 2026 07:27:07 +1100",
          "title": "US takes control of Venezuela after capturing Nicolas Maduro",
          "standfirst": "The United States has taken control of Venezuela after capturing President Nicolas Maduro and his wife Cilia Flores in a late-night military operation.",
          "content": "The United States has taken control of Venezuela after capturing President Nicolas Maduro and his wife Cilia Flores in a late-night military operation.",
          "feed_position": 18,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/166bbe2540be0115077194a66858157a33447adc"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/inside-the-dark-deadly-us-mission-to-arrest-maduro-and-wife/106197254",
          "published_at": "Sat, 03 Jan 2026 20:15:44 +0000",
          "title": "Inside the 'dark, deadly' US mission at a compound in Caracas",
          "standfirst": "Fresh details about the operation to detain Venezuelan President Nicolás Maduro and his wife on Saturday have been revealed, and even Donald Trump's top military advisor has described the mission as \"audacious\".",
          "content": "Fresh details about the operation to detain Venezuelan President Nicolás Maduro and his wife on Saturday have been revealed, and even Donald Trump's top military advisor has described the mission as \"audacious\".",
          "feed_position": 18
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/venezuelan-president-nicolas-maduro-captured-by-us/106197206",
          "published_at": "Sat, 03 Jan 2026 19:36:12 +0000",
          "title": "Trump says US ready for 'much larger attack' as it decides Venezuela's future",
          "standfirst": "The US will temporarily \"run\" Venezuela after American forces captured the country's president and first lady in an extraordinary military strike, US President Donald Trump says.",
          "content": "The US will temporarily \"run\" Venezuela after American forces captured the country's president and first lady in an extraordinary military strike, US President Donald Trump says.",
          "feed_position": 22
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/what-is-operation-absolute-resolve-inside-the-us-mission-to-capture-maduro/c53e1596-5e1e-434d-83b6-adc327c487a1",
          "published_at": "Sat, 03 Jan 2026 19:27:22 +0000",
          "title": "Operation Absolute Resolve: The US mission to capture Maduro",
          "standfirst": "US intelligence agencies tracked the Venezuelan president for months to \"understand how he moved, where he lived, where he traveled, what he ate, what he wore\".",
          "content": "The US mission to capture Venezuelan President Nicolas Maduro was planned over many months and involved more than 150 aircraft.General Dan Caine, the chairman of the Joint Chiefs of Staff, said US intelligence agencies had tracked Maduro to \"understand how he moved, where he lived, where he travelled, what he ate, what he wore\".\"The operation, known as Operation Absolute Resolve, was discreet, precise and conducted during the darkest hours of January 2, and was the culmination of months of planning and rehearsal — an operation that frankly only the United States military could undertake,\" Caine said in a press conference at Mar-a-Lago with US President Donald Trump.READ MORE: Why is the US attacking Venezuela?CNN previously reported that the CIA had installed a small team inside Venezuela over the northern hemisphere summer to keep a close watch on Maduro&#x27;s activities.Caine said Operation Absolute Resolve involved more than 150 aircraft launched from 20 different bases on land and sea.Among them were helicopters carrying an extraction force that began their flight into Venezuela at just 30 metres above the water.The helicopters, safeguarded by a series of strikes carried out in the area, arrived at Maduro&#x27;s compound about 1am ET (5pm AEDT).The effort to capture Maduro and his wife, Cilia Flores, required multiple \"self defence engagements\" as the forces came under fire, Caine said, before flying out of Venezuela about 3.29am ET (7.29pm AEDT).Maduro and his wife were subsequently transferred to the warship USS Iwo Jima, where they were then on their way to New York to stand trial.READ MORE: Trump says US &#x27;is going to run&#x27; Venezuela after capture of Maduro \"Failure of one component of this well-oiled machine would have endangered the entire mission, and failure is never an option for America&#x27;s joint force,\" Caine said.CNN reports on a source saying \"a handful of troops sustained bullet and shrapnel wounds, but none are life-threatening\".Trump earlier told Fox News that \"a couple of guys were hit. But they came back and they&#x27;re supposed to be in pretty good shape.\"Caine said one US aircraft was struck during the operation, \"but remained flyable\".He also highlighted the role of intelligence teams in supporting the mission in real time.\"Our air and ground intelligence teams provided real time updates to the ground force, ensuring those forces could safely navigate the complex environment without unnecessary risk.\"Maduro was &#x27;trying to get into safe place&#x27;Trump said Maduro could have been killed.\"It could have happened,\" he said.\"He was trying to get into a safe place. You know, the safe place&#x27;s all steel, and he wasn&#x27;t able to make it to the door because our guys were so fast.\"The US military \"went through the opposition so fast\", Trump said, while also noting that \"there was a lot of opposition\".READ MORE: Venezuelan president and wife on US warship heading to New York. Here&#x27;s what to know \"People were wondering, do we get them by surprise? Sort of surprised, but they were waiting for something. It was a lot of opposition. There was a lot of gunfire,\" he said.Trump said lights in Caracas were shut off during the operation.\"No nation in the world could achieve what America achieved yesterday,\" Trump said this morning.\"In just a short period of time, all Venezuelan military capacities were rendered powerless as the men and women of our military, working with us, law enforcement, successfully captured Maduro in the dead of night.\"It was dark, the lights of Caracas were largely turned off due to a certain expertise that we have.\"It was dark and it was deadly.\"US prepared for second wave of attackTrump praised the US operation, calling it a success and emphasising that no American service members were killed and no US military equipment was lost.He said it involved extensive US military assets.\"If you would have seen what I saw last night, you would have been very impressed,\" Trump said.READ MORE: Who is Nicolas Maduro? From bus driver to Venezuela president \"I&#x27;m not sure that you&#x27;ll ever get to see it, but it was an incredible thing to see not a single American service member was killed and not a single piece of American equipment was lost.\"We had many helicopters, many planes, many, many people involved in that fight.\"Trump said the US was prepared to mount a second attack on Venezuela.\"We were prepared to do a second wave if we needed to do so — we actually assumed that a second wave would be necessary, but now it&#x27;s probably not,\" he said.\"The first wave, if you&#x27;d like to call it that, the first attack was so successful, we probably don&#x27;t have to do a second, but we&#x27;re prepared to do a second wave, a much bigger wave, actually.\"- Reported with CNN",
          "feed_position": 10,
          "image_url": "https://prod.static9.net.au/fs/185c2a0a-15c4-400a-8dab-8b9f411c6873"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/why-is-the-us-attacking-venezuela-timeline-of-events-leading-to-capture-of-president-maduro-and-wife/4e2d8f2d-a677-4ea7-b0a6-6a13d819d672",
          "published_at": "Sat, 03 Jan 2026 19:27:12 +0000",
          "title": "Why is the US attacking Venezuela?",
          "standfirst": "The strike on the third day of 2026 is a dramatic escalation after months of Donald Trump increasing pressure on Nicolas Maduro.",
          "content": "Venezuelan President Nicolas Maduro has been captured and flown from the country, US President Donald Trump announced after confirming that the US forces conducted what he called \"a large-scale strike against Venezuela and its leader\".The strike on the third day of 2026 is a dramatic escalation after months of Trump increasing pressure on Maduro.Most recently the CIA carried out a drone strike on Venezuelan soil and the military seized two tankers carrying Venezuelan oil in international waters.READ MORE: Trump says Venezuela&#x27;s president and wife captured and removed from countryAll the while, the US military has continued to blow up alleged drug smuggling boats in South American waters. There have been 35 known strikes since early September that have killed at least 115 people, according to announcements from the Trump administration.The US had sent a fleet of warships to the region, the largest buildup of forces in generations.The White House said the US was in \"armed conflict\" with drug cartels to halt the flow of narcotics into the United States, while US officials alleged that Maduro supports the international drug trade. The authoritarian president faces charges of narco-terrorism in the US.Maduro insists the real purpose of the US military operations has been to force him from power.READ MORE: Teen arrested in US in alleged ISIS-inspired attack plot intended for New Year&#x27;s Eve Here is a timeline of the US military actions, concerns among some politicians and the response in Venezuela:Jan. 20, 2025Trump signs an executive order that paves the way for criminal organisations and drug cartels to be named \"foreign terrorist organisations.\" They include Tren de Aragua, a Venezuelan street gang.The US intelligence community has disputed Trump&#x27;s central claim that Maduro&#x27;s administration is working with Tren de Aragua and orchestrating drug trafficking and illegal immigration into the US.Feb. 20The Trump administration formally designates eight Latin American crime organisations as foreign terrorist organisations.The label is normally reserved for groups like al-Qaida or the Islamic State that use violence for political ends — not for profit-focused crime rings.Aug. 19The US military deploys three guided-missile destroyers to the waters off Venezuela.The naval force in the Caribbean grows within weeks to include three amphibious assault ships and other vessels, carrying about 6000 sailors and Marines and a variety of aircraft.The US deploys F-35 fighter jets to Puerto Rico in September, while a Navy submarine carrying cruise missiles operates off South America.Sept. 2The US carries out its first strike against what Trump says was a drug-carrying vessel that departed from Venezuela and was operated by Tren de Aragua.Trump says all 11 people on the boat were killed and posts a short video clip of a small vessel appearing to explode in flames.Sept. 10In a letter to the White House, Democratic senators say the Trump administration has provided \"no legitimate legal justification\" for the strike.Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, says in a floor speech that week that the US military is not \"empowered to hunt down suspected criminals and kill them without trial\".Sept. 15The US military carries out its second strike against an alleged drug boat, killing three people.Asked what proof the US has that the vessel was carrying drugs, Trump told reporters that big bags of cocaine and fentanyl were spattered all over the ocean. However, images of what Trump described were not released by the military or the White House.Sept. 19Trump says the US military carried out its third fatal strike against an alleged drug-smuggling vessel. Several senators and human rights groups continue to question the legality of the strikes, describing them as a potential overreach of executive authority.Oct. 2Trump declares drug cartels to be unlawful combatants and says the US is now in an \"armed conflict\" with them, according to a Trump administration memo obtained by The Associated Press.The memo appears to represent an extraordinary assertion of presidential war powers and draws criticism from some lawmakers, including Republican Senator Rand Paul of Kentucky.Oct. 3Defence Secretary Pete Hegseth says he ordered a fourth strike on a small boat he accuses of carrying drugs.Oct. 8Senate Republicans vote down legislation that would have required the president to seek authorisation from Congress before further military strikes.Oct. 14Trump announces the fifth strike against a small boat accused of carrying drugs, saying it killed six people.Oct. 15Trump confirms he has authorized the CIA to conduct covert operations inside Venezuela and says he is weighing carrying out land operations in the country.He declines to say whether the CIA has authority to take action against Maduro.Oct. 16The Navy admiral who oversees military operations in the region says he will retire in December.Admiral Alvin Holsey became leader of US Southern Command only the previous November, overseeing an area that encompasses the Caribbean and waters off South America. Such postings typically last three to four years.Oct. 16Trump says the US struck a sixth suspected drug-carrying vessel in the Caribbean, killing two people and leaving two survivors who were on the semi-submersible craft.The president later says the survivors would be sent to Ecuador and Colombia, their home countries, \"for detention and prosecution\". Repatriation avoided questions about what their legal status would have been in the US justice system.Oct. 17The US military attacks a seventh vessel that Hegseth says was carrying \"substantial amounts of narcotics\" and associated with a Colombian rebel group, the National Liberation Army, or ELN. Three people are killed.Oct. 20Representative Adam Smith, top Democrat on the House Armed Services Committee, calls for a hearing on the boat strikes.\"Never before in my over 20 years on the committee can I recall seeing a combatant commander leave their post this early and amid such turmoil,\" Smith said in a statement of Holsey&#x27;s impending departure. \"I have also never seen such a staggering lack of transparency on behalf of an Administration and the Department to meaningfully inform Congress on the use of lethal military force.\"Oct. 21Hegseth says the US military launched its eighth strike against an alleged drug-carrying vessel, killing two people in the eastern Pacific.The attack marks an expansion of the military&#x27;s targeting area to the waters off South America where much of the cocaine from the world&#x27;s largest producers is smuggled.Oct. 22Hegseth announces the ninth strike, another in the eastern Pacific, saying three men are killed.Oct. 24Hegseth orders the US military&#x27;s most advanced aircraft carrier, the USS Gerald R Ford, to the region in a significant escalation of military firepower.Oct. 24Hegseth says the military conducted the 10th strike on a suspected drug-running boat, leaving six people dead.Oct. 27Hegseth says three more strikes were carried out in the eastern Pacific, killing 14 people and leaving one survivor.Hegseth says Mexican authorities \"assumed responsibility for coordinating the rescue\" of the sole survivor, who is presumed dead after Mexico suspended its search.Oct. 29Hegseth says the US military carried out another strike on a boat he said was carrying drugs in the eastern Pacific, killing all four people aboard in the 14th attack.Oct. 29Senator Mark Warner, the ranking Democrat on the Senate Intelligence Committee, says the Trump administration briefed Republicans — but not Democrats — on the boat strikes.The Senate at the time was facing a potential vote on a war powers resolution that would prohibit strikes in or near Venezuela without congressional approval.Oct. 31UN human rights chief Volker Türk calls for an investigation into the strikes, in what appeared to be the first such condemnation of its kind from a United Nations organisation.Ravina Shamdasani, a spokeswoman for Türk&#x27;s office, relayed his message at a briefing: \"The US must halt such attacks and take all measures necessary to prevent the extrajudicial killing of people aboard these boats.\"Nov. 1Hegseth announces the 15th known strike, saying three people were killed.Nov. 4In the 16th known strike, Hegseth posts on social media that two people were killed aboard a vessel in the eastern Pacific.Nov. 6Hegseth announces the 17th known strike, which killed three people.Senate Republicans vote to reject legislation that would have limited Trump&#x27;s ability to order an attack on Venezuelan soil without congressional authorisation. Lawmakers from both parties had demanded more information on the strikes, but Republicans appeared more willing to give Trump leeway to continue his buildup of naval forces.Nov. 9The US military strikes two vessels in the eastern Pacific, killing six people, according to an announcement from Hegseth the following day.Nov. 10The 20th known strike on a boat accused of transporting drugs kills four people in the Caribbean, according to a social media post from the US military&#x27;s Southern Command.Nov. 11Venezuela&#x27;s government launches what it says is a \"massive\" mobilisation of troops and volunteers for two days of exercises prompted by the US military buildup.Defence Minister Vladimir Padrino López asserts that Venezuela&#x27;s military is \"stronger than ever in its unity, morale and equipment\".Nov. 15Three people are killed after the US military conducts its 21st strike on an alleged drug-smuggling boat in the eastern Pacific, according to a post from Southern Command a day later.Nov. 16The Ford arrives in the Caribbean, a major moment in the Trump administration&#x27;s show of force.The aircraft carrier&#x27;s arrival brings the total number of troops in the region to about 12,000 on nearly a dozen Navy ships in what Hegseth has dubbed \"Operation Southern Spear\".Nov. 16Trump says the US \"may be having some discussions\" with Maduro and \"Venezuela would like to talk\", without offering details.\"I&#x27;ll talk to anybody,\" Trump said. \"We&#x27;ll see what happens.\"Dec. 4Admiral Frank \"Mitch\" Bradley appears for closed-door classified briefings at the Capitol as lawmakers begin investigating the strikes. The investigation began following reports that Bradley ordered a follow-on attack that killed the survivors of the first strike on September 2 to comply with Hegseth&#x27;s demands.Republican Senator Tom Cotton later tells reporters that \"Bradley was very clear that he was given no such order, to give no quarter or to kill them all\".Democrats say they found the video of the entire attack disturbing.Washington Representative Adam Smith, the top Democrat on the House Armed Services Committee, says the survivors were \"basically two shirtless people clinging to the bow of a capsized and inoperable boat, drifting in the water — until the missiles come and kill them\".Dec. 4Four people are killed in the 22nd strike on an alleged drug-smuggling boat in the eastern Pacific, according to a post from Southern Command.Dec. 10The US seizes an oil tanker off the coast of Venezuela after the ship left that country with about 2 million barrels of heavy crude.Attorney General Pam Bondi says the tanker was involved in \"an illicit oil shipping network supporting foreign terrorist organisations\". Venezuela&#x27;s government says the seizure \"constitutes a blatant theft and an act of international piracy\".Dec. 15The US military strikes three alleged drug-smuggling boats, killing eight people, in the eastern Pacific Ocean, Southern Command announces.Dec. 16Hegseth says the Pentagon will not publicly release unedited video of the September 2 strike that killed two survivors, even as questions mount in Congress about the attack and the overall campaign near Venezuela.Dec. 16Trump says he&#x27;s ordering a blockade of all \"sanctioned oil tankers\" going into and out of Venezuela, a move that seems designed to put a tighter chokehold on the South American country&#x27;s oil-dependent economy.Trump alleges that Venezuela is using oil to fund drug trafficking, terrorism and other crimes and vows to continue the military buildup until the country returns to the US oil, land and assets, though it&#x27;s unclear why the president feels the US has a claim.Dec. 17The US military says it attacked a boat accused of smuggling drugs in the eastern Pacific Ocean, killing four people.House Republicans rejected a pair of Democratic-backed resolutions that would have put a check on Trump&#x27;s power to use military force against drug cartels and Venezuela. They were the first votes in the House after Senate Republicans previously voted down similar war powers resolutions.Dec. 18The US military says it conducted two more strikes against boats that were allegedly smuggling drugs in the eastern Pacific, killing five people.Dec. 20Homeland Security Secretary Kristi Noem says the US Coast Guard, with help from the Defense Department, stopped a second oil tanker off the coast of Venezuela.Dec. 22Trump confirms that the US Coast Guard is chasing another oil tanker that the administration describes as part of the \"dark fleet\".The US military says it attacked a boat accused of smuggling drugs in the eastern Pacific Ocean, killing four people.Dec. 29Trump tells reporters the US struck a facility where boats accused of carrying drugs \"load up\". He declines to say if the US military or the CIA carried out the strike on the dock or where it occurred. He does not confirm it happened in Venezuela.The US military says it attacked a boat accused of smuggling drugs in the eastern Pacific Ocean, killing two people.Dec. 30The CIA was behind the drone strike at a docking area believed to have been used by Venezuelan drug cartels, according to two people familiar with details of the classified operation who requested anonymity to discuss it.It is the first known direct operation on Venezuelan soil since the US began strikes in September. Venezuelan officials have not acknowledged the strike.Dec. 30The US military strikes three more boats that were allegedly smuggling drugs, killing three people in the first boat while people from the other two boats jumped overboard and may have survived, US Southern Command announces the following day.Dec. 31The US imposes sanctions on four firms operating in Venezuela&#x27;s oil sector and designates four additional oil tankers as blocked property and part of the larger shadow fleet that is evading US sanctions on Venezuela.Dec. 31The US military says it attacked two more boats, killing five people who were allegedly smuggling drugs along known trafficking routes.Jan. 3Multiple explosions rock Caracas in the early hours of the morning; Trump confirms the US has launched \"large-scale strike against Venezuela and its leader\".Venezuelan President Nicolás Maduro and his wife are captured and removed from the country.",
          "feed_position": 4,
          "image_url": "https://prod.static9.net.au/fs/0d849481-0ffe-4b5c-b8d3-7fff11f7403d"
        },
        {
          "source": "Canberra Times",
          "url": "https://www.canberratimes.com.au/story/9144824/us-to-rule-venezuela-says-trump-after-maduro-capture/",
          "published_at": "Sun, 04 Jan 2026 06:25:02 +1100",
          "title": "US to rule Venezuela, says Trump, after Maduro capture",
          "standfirst": "Venezuela's autocratic President Nicolas Maduro and wife Cilia Flores will \"soon face the full wrath of American justice\", after being deposed by US forces.",
          "content": "Venezuela's autocratic President Nicolas Maduro and wife Cilia Flores will \"soon face the full wrath of American justice\", after being deposed by US forces.",
          "feed_position": 4,
          "image_url": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/3115f7e0-1358-467c-980b-6365cc8396ec.jpg/r0_75_800_526_w600_h338_fmax.jpg"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/us-captures-venezuela-president-nicolas-maduro-heres-what-we-know/0ebceca1-e82d-466d-ae51-a401cc0c9a37",
          "published_at": "Sat, 03 Jan 2026 16:07:09 +0000",
          "title": "Venezuelan president and wife on US warship heading to New York. Here's what to know",
          "standfirst": "Donald Trump said that Nicolas Maduro and his wife were aboard the USS Iwo Jima heading to New York.",
          "content": "US President Donald Trump announced early on Saturday morning (Saturday night AEDT) that the US carried out a \"large-scale strike against Venezuela\" and that President Nicolas Maduro and his wife had been captured, a stunning development that plunged the country into uncertainty after weeks of spiraling tensions.\"The United States of America has successfully carried out a large scale strike against Venezuela and its leader, President Nicolás Maduro, who has been, along with his wife, captured and flown out of the Country,\" he wrote on Truth Social.Venezuela requested an urgent meeting of the United Nations Security Council in response to the attack, Foreign Minister Yván Gil Pinto said.READ MORE: Why is the US attacking Venezuela?\"No cowardly attack will prevail against the strength of this people, who will emerge victorious,\" he said on Telegram, sharing the letter sent to the UN.Venezuelan Vice President Delcy Rodríguez said in an audio call with state-run VTV that the government doesn&#x27;t know the whereabouts of Maduro and first lady Cilia Flores, demanding \"immediate proof of life\" from the Trump administration.Speaking to Fox News on Saturday morning, Trump said that Maduro and his wife are aboard the USS Iwo Jima heading to New York. Earlier, in an interview with The New York Times, he declined to answer questions about whether he had sought congressional authorisation for the strike, saying he would address the issue at a news conference.Here&#x27;s what we know.What has happened?A CNN team witnessed several explosions and heard the sounds of aircraft early Saturday in the Venezuelan capital Caracas, and reported that some areas of the city were without electricity.Videos verified by CNN showed helicopters roaring over Caracas, with plumes of smoke rising into the night sky. Footage also showed a large blaze and explosions at an airport in the city of Higuerote.Hours after the strikes, CNN&#x27;s Mary Mena said from Caracas that the capital was calm.\"We listened to many airplanes and helicopters passing by, but right now the city remains quiet, for the past two hours,\" she said. \"We haven&#x27;t heard people for example coming to the streets, and the state channel keeps repeating this message from the ministry of defense saying they want people to remain calm and they will deploy military forces across the country.\"READ MORE: US captures Venezuela&#x27;s president and wife, removes them from the country The first blast witnessed by the CNN team was recorded about 1.50am (5.50pm AEDT).\"One was so strong, my window was shaking after it,\" CNN correspondent Osmary Hernandez said.Several areas of the city were without power, and CNN journalists in the capital heard the sound of aircraft after the explosions.One video obtained and verified by CNN showed two plumes of smoke rising into the night sky amid city lights. An orange glow could be seen at the base of one of the plumes. Then a flash in another location was briefly seen, followed by a dull booming sound.Two sources familiar with the matter said that Maduro and his wife were dragged from their bedroom by US forces during the raid that led to their capture. The couple was captured in the middle of the night as they were sleeping, the sources said.The raid, carried out by the US Army&#x27;s elite Delta Force, did not lead to any US casualties, a US official said.Why is it happening?The Trump administration has for years said that Maduro was a criminal and has looked to prosecute him through the US legal system.In 2020, during Trump&#x27;s first term, Maduro was charged in the Southern District of New York for \"narco-terrorism\", conspiracy to import cocaine, and related charges.The Trump administration offered a $US15 million ($22 million) bounty for Maduro&#x27;s arrest. That bounty was increased to $US25 million ($37 million) in the waning days of the Biden administration, in early January 2025, and was increased again, to $US50 million ($74 million), in August 2025 after Trump took office for a second term and designated Cartel de los Soles as a foreign terrorist organization. The administration has claimed that Maduro is the leader of that group, which it describes as a criminal organisation.Utah Republican Senator Mike Lee said Secretary of State Marco Rubio told him that Maduro was arrested to stand trial in the US.\"He informed me that Nicolás Maduro has been arrested by US personnel to stand trial on criminal charges in the United States, and that the kinetic action we saw tonight was deployed to protect and defend those executing the arrest warrant,\" Lee posted on X early Saturday.In recent weeks, Trump had repeatedly warned that the US was preparing to take new action against alleged drug trafficking networks in Venezuela and that strikes on land will start \"soon\".Trump&#x27;s pressure campaign on Maduro has included strikes destroying more than 30 boats in the Caribbean Sea and eastern Pacific Ocean in what the US has described as a counter-narcotics campaign. Trump last month ordered a blockade of sanctioned oil tankers coming to and leaving Venezuela.The CIA carried out a drone strike in December on a port facility on the coast of Venezuela, CNN reported last month, citing sources, marking the first known US attack on a target inside that country.How has the international community reacted?Several world leaders have reacted with concern to the US operation.British Prime Minister Keir Starmer said he \"wants to establish the facts\" and speak to Trump about the military operation in Venezuela, according to the UK&#x27;s PA Media news agency.\"I always say and believe we should all uphold international law,\" Starmer said, adding that Britain was \"not involved in any way\" in the strike on Caracas, PA Media reported.Ursula von der Leyen, the president of the European Commission, said in a post on X that the commission \"stand(s) by the people of Venezuela and support(s) a peaceful and democratic transition. Any solution must respect international law and the UN Charter.\"Meanwhile, Venezuela&#x27;s allies Russia and Iran condemned the US attack.The Russian foreign ministry denounced what it called an \"act of armed aggression against Venezuela\" by the US, calling any \"excuses\" given to justify such actions \"untenable\".\"We reaffirm our solidarity with the Venezuelan people and our support for the Bolivarian leadership&#x27;s course of action aimed at protecting the country&#x27;s national interests and sovereignty,\" a statement from the foreign ministry said. \"Venezuela must be guaranteed the right to determine its own destiny without any destructive, let alone military, interference from outside.\"Similarly, the Iranian foreign ministry said the attack violates Venezuela&#x27;s sovereignty and territorial integrity as well as the UN charter, Iranian state news outlet Press TV reported.What comes next?What happens next in Venezuela is far from clear. The country&#x27;s constitution states that power will pass to Maduro&#x27;s vice president, Delcy Rodríguez.But the future of the regime is in doubt, and the opposition – within and outside the country – will likely see this moment as a critical opportunity.Venezuela&#x27;s opposition says the rightful president is the exiled politician Edmundo Gonzalez.Amid the uncertainty, there are a range of scenarios.If the constitutional path – Article 233 – is followed, in the \"absolute absence\" of the president, the executive vice president – Delcy Rodriguez – takes over and calls for an election within 30 days. The newly elected president then serves a full six-year term.The regime collapses and its senior figures resign or flee, the most likely opposition candidate is Edmundo González Urrutia, who ran in the 2024 election. Gonzales, an academic and long-time diplomat, is now in exile in Spain. He is supported by the recent winner of the Nobel Peace Prize, democratic activist María Corina Machado. Speaking in Oslo last month after receiving the prize, Machado said her movement was preparing for \"an orderly and peaceful transition\" once Maduro was gone. She said in December that González had invited her to be vice-president and that \"the vast majority\" of the police and armed forces would follow the new administration&#x27;s orders once the political transition began.There could also be a military takeover. But the current defence minister, Vladimir Padrino López, has spoken out against the US strikes, saying Venezuela would resist the presence of foreign troops in the country. \"This invasion represents the greatest outrage the country has suffered,\" he said.",
          "feed_position": 11,
          "image_url": "https://prod.static9.net.au/fs/ab32c826-13d8-42aa-81f9-b519df4aad00"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/venezuela-trump-says-maduro-on-way-to-new-york/106197080",
          "published_at": "Sat, 03 Jan 2026 14:57:41 +0000",
          "title": "Trump says US 'will run' Venezuela after strikes",
          "standfirst": "The US has \"captured\" Venezuelan President Nicolás Maduro and his wife during an early-morning raid, which saw US military strike targets within the capital Caracas and in several other states. Follow live.",
          "content": "The US has \"captured\" Venezuelan President Nicolás Maduro and his wife during an early-morning raid, which saw US military strike targets within the capital Caracas and in several other states. Follow live.",
          "feed_position": 0
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.225%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/q_86%2Cf_auto/462fa3955a36684c91f94a598210e6b51db28c07",
      "popularity_score": 5019.908405277778
    },
    {
      "id": "cluster_6",
      "coverage": 4,
      "updated_at": "Sat, 03 Jan 2026 22:47:22 GMT",
      "title": "Missing worker found dead after roof collapse deep underground at Queensland coalmine",
      "neutral_headline": "Two men die in separate Queensland mining incidents",
      "items": [
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2026/jan/04/missing-worker-found-dead-after-roof-collapse-deep-underground-at-queensland-coalmine-ntwnfb",
          "published_at": "Sat, 03 Jan 2026 22:47:22 GMT",
          "title": "Missing worker found dead after roof collapse deep underground at Queensland coalmine",
          "standfirst": "Emergency team were unable to save man trapped in the Curragh mine following the collapse on FridayGet our breaking news email, free app or daily news podcastSearchers have found a missing Queensland coalmine worker dead a day after he became trapped in a roof collapse.The man was inside the Curragh mine in central Queensland when the collapse happened about 3pm on Friday. There were fears he was as deep as 1km underground. Continue reading...",
          "content": "Emergency team were unable to save man trapped in the Curragh mine following the collapse on FridayGet our breaking news email, free app or daily news podcastSearchers have found a missing Queensland coalmine worker dead a day after he became trapped in a roof collapse.The man was inside the Curragh mine in central Queensland when the collapse happened about 3pm on Friday. There were fears he was as deep as 1km underground. Continue reading...",
          "feed_position": 0
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/two-men-die-in-separate-queensland-mining-incidents-20260104-p5nrg4.html",
          "published_at": "Sun, 04 Jan 2026 07:27:28 +1100",
          "title": "Two men die in separate Queensland mining incidents",
          "standfirst": "Two men have died in separate mining incidents in central Queensland.",
          "content": "Two men have died in separate mining incidents in central Queensland.",
          "feed_position": 17,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/3c262da3184c43e9052445f9b4128794cfa501ea"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/central-queensland-fear-of-mine-collapse-search-for-two-workers/55d5bc5f-8109-4c15-9983-384d4d7e18bf",
          "published_at": "Sat, 03 Jan 2026 11:09:46 +0000",
          "title": "Man trapped in Queensland mine dies after marathon bid to rescue him",
          "standfirst": "A man trapped at a coal mine in Central Queensland has died after a marathon effort to rescue him.",
          "content": "A man trapped at a coal mine in Central Queensland has died after a marathon effort to rescue him. The operation to reach the man had entered its second night after the \"roof fall\" at the Mammoth Underground Mine near Blackwater, about 800 kilometres north-west of Brisbane and inland from Rockhampton. The company that runs the mine confirmed the man&#x27;s death tonight.READ MORE: Witnesses blame &#x27;sparklers in champagne bottles&#x27; after 40 killed in Swiss Alps blaze \"Coronado is deeply saddened by this incident and extends its deepest sympathies and sincere condolences to the family, friends and colleagues of the worker,\" Coronado chief executive Douglas Thompson said. \"It is providing all support to the contracted coal mine operator, Mammoth Underground Mine Management Pty Ltd, which is currently working with the relevant authorities at site to understand the cause of the incident.\" Emergency services raced to the mine after the roof collapsed about 3pm (4pm AEDT) on Friday. Another man was taken to hospital and a third was also rescued. Resources Safety and Health Queensland said it would conduct \"a thorough investigation into the nature and cause of this incident\". \"Loss of life in mining operations is unacceptable,\" it said in a statement. Mammoth Underground Mine is within Coronado&#x27;s Curragh Mine complex, about 10 kilometres north of Blackwater.",
          "feed_position": 6,
          "image_url": "https://prod.static9.net.au/fs/87798b67-52ab-4761-866e-d2dc169a631c"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-03/qld-curragh-mine-mammoth-underground-collapse-rescue/106196192",
          "published_at": "Sat, 03 Jan 2026 00:48:29 +0000",
          "title": "Worker dies in Central Queensland mine following roof collapse",
          "standfirst": "A worker has died after a roof collapse at the Curragh mining complex in Central Queensland.",
          "content": "A worker has died after a roof collapse at the Curragh mining complex in Central Queensland.",
          "feed_position": 18
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/3c262da3184c43e9052445f9b4128794cfa501ea",
      "popularity_score": 4019.4589608333335
    },
    {
      "id": "cluster_1",
      "coverage": 2,
      "updated_at": "Sat, 03 Jan 2026 23:12:24 +0000",
      "title": "'National crisis': Sports stars call for Bondi federal royal commission",
      "neutral_headline": "'National crisis': Sports stars call for Bondi federal royal commission",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/sport-stars-call-for-federal-royal-commission/106197406",
          "published_at": "Sat, 03 Jan 2026 23:12:24 +0000",
          "title": "'National crisis': Sports stars call for Bondi federal royal commission",
          "standfirst": "More than 60 Australian sports stars, including Ian Thorpe, Jess Fox, Lleyton Hewitt and Sam Newman, join public calls for a Commonwealth royal commission into antisemitism and the events that led up to the terror attack.",
          "content": "More than 60 Australian sports stars, including Ian Thorpe, Jess Fox, Lleyton Hewitt and Sam Newman, join public calls for a Commonwealth royal commission into antisemitism and the events that led up to the terror attack.",
          "feed_position": 3
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/australian-sporting-stars-call-for-bondi-shooting-royal-commission-20260104-p5nrg3.html",
          "published_at": "Sun, 04 Jan 2026 07:27:51 +1100",
          "title": "Australian sporting stars call for Bondi shooting royal commission",
          "standfirst": "Some of Australia’s biggest sporting legends have jointly called for a royal commission into the Bondi terror attack.",
          "content": "Some of Australia’s biggest sporting legends have jointly called for a royal commission into the Bondi terror attack.",
          "feed_position": 16,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/a480abdc04eb876401274c868cbf6bc718fc1eda"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/a480abdc04eb876401274c868cbf6bc718fc1eda",
      "popularity_score": 2019.8761830555557
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 22:50:49 +0000",
      "title": "Live: Beau Webster named as Australia 'pushed into a corner' by SCG pitch",
      "neutral_headline": "Live: Beau Webster named as Australia 'pushed into a corner' by SCG pitch",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/live-updates-ashes-australia-vs-england-fifth-test-day-one/106197464",
          "published_at": "Sat, 03 Jan 2026 22:50:49 +0000",
          "title": "Live: Beau Webster named as Australia 'pushed into a corner' by SCG pitch",
          "standfirst": "Australia names Beau Webster to play his first Ashes Test, with captain Steve Smith saying another seam-friendly pitch forced them to go without a frontline spinner. Follow live.",
          "content": "Australia names Beau Webster to play his first Ashes Test, with captain Steve Smith saying another seam-friendly pitch forced them to go without a frontline spinner. Follow live.",
          "feed_position": 2
        }
      ],
      "popularity_score": 342.5164608333333
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 18:00:00 +0000",
      "title": "America's 250th birthday party will serve up a toxic brew of exceptionalism",
      "neutral_headline": "America's 250th birthday party will serve up a toxic brew of exceptionalism",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/on-its-250th-birthday-america-is-being-america/106193418",
          "published_at": "Sat, 03 Jan 2026 18:00:00 +0000",
          "title": "America's 250th birthday party will serve up a toxic brew of exceptionalism",
          "standfirst": "It is entirely fitting that the US is so splintered on its semiquincentennial. Division, for the lion's share of its history, has been its default.",
          "content": "It is entirely fitting that the US is so splintered on its semiquincentennial. Division, for the lion's share of its history, has been its default.",
          "feed_position": 1
        }
      ],
      "popularity_score": 337.66951611111114
    },
    {
      "id": "cluster_10",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 22:38:55 +0000",
      "title": "Charity keeps pets at home and out of the pound by helping cover care costs",
      "neutral_headline": "Charity keeps pets at home and out of the pound by helping cover care costs",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/charity-keeping-pets-out-of-the-pound-funding-vet-care/106101748",
          "published_at": "Sat, 03 Jan 2026 22:38:55 +0000",
          "title": "Charity keeps pets at home and out of the pound by helping cover care costs",
          "standfirst": "A new charity is helping low socio-economic households keep their pets, by offering emergency boarding and funding for veterinary care.",
          "content": "A new charity is helping low socio-economic households keep their pets, by offering emergency boarding and funding for veterinary care.",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.3181275
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 19:17:38 +0000",
      "title": "Hindus 'living in fear' after man's public lynching for alleged blasphemy",
      "neutral_headline": "Hindus 'living in fear' after man's public lynching for alleged blasphemy",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/bangladeshi-hindu-minority-fearful-after-lynching-of-worker/106192790",
          "published_at": "Sat, 03 Jan 2026 19:17:38 +0000",
          "title": "Hindus 'living in fear' after man's public lynching for alleged blasphemy",
          "standfirst": "Four Hindu men have been killed in Muslim-majority Bangladesh in just over two weeks, and several houses have been burned, leaving the minority community traumatised and fearing for their lives.",
          "content": "Four Hindu men have been killed in Muslim-majority Bangladesh in just over two weeks, and several houses have been burned, leaving the minority community traumatised and fearing for their lives.",
          "feed_position": 4
        }
      ],
      "popularity_score": 308.963405
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 19:57:02 +0000",
      "title": "Tourists stranded, dozens of roads closed as rain continues in outback Queensland",
      "neutral_headline": "Tourists stranded, dozens of roads closed as rain continues in outback Queensland",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/tourists-stranded-dozens-of-roads-closed-by-queensland-flooding/106196556",
          "published_at": "Sat, 03 Jan 2026 19:57:02 +0000",
          "title": "Tourists stranded, dozens of roads closed as rain continues in outback Queensland",
          "standfirst": "Tourists are stranded in towns dotted across north-west Queensland as rain continues to keep major rivers in flood.",
          "content": "Tourists are stranded in towns dotted across north-west Queensland as rain continues to keep major rivers in flood.",
          "feed_position": 5
        }
      ],
      "popularity_score": 299.62007166666666
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 18:45:02 +0000",
      "title": "Amid a population crisis, this island needs migrants to keep its industry alive",
      "neutral_headline": "Amid a population crisis, this island needs migrants to keep its industry alive",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/japanese-island-etajima-migrants-oyster-industry/106176486",
          "published_at": "Sat, 03 Jan 2026 18:45:02 +0000",
          "title": "Amid a population crisis, this island needs migrants to keep its industry alive",
          "standfirst": "The Japanese island of Etajima's oyster industry relies almost entirely on foreign workers due to its aging population.",
          "content": "The Japanese island of Etajima's oyster industry relies almost entirely on foreign workers due to its aging population.",
          "feed_position": 6
        }
      ],
      "popularity_score": 298.4200716666667
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 18:49:02 +0000",
      "title": "Australian brands still dealing with 'the wild west' of Trump's tariffs",
      "neutral_headline": "Australian brands still dealing with 'the west' of Trump's tariffs",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/australian-brands-still-dealing-with-trump-tariffs-more-in-2026/106194486",
          "published_at": "Sat, 03 Jan 2026 18:49:02 +0000",
          "title": "Australian brands still dealing with 'the wild west' of Trump's tariffs",
          "standfirst": "From de minimis to beef tariffs, Aussie exporters are preparing for another \"wild\" year.",
          "content": "From de minimis to beef tariffs, Aussie exporters are preparing for another \"wild\" year.",
          "feed_position": 7
        }
      ],
      "popularity_score": 278.48673833333334
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:20:54 +0000",
      "title": "How you're already relying on AI, even if you think you're not",
      "neutral_headline": "How you're already relying on AI, even if you think you're not",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/how-act-government-is-using-ai-across-services/106137618",
          "published_at": "Sat, 03 Jan 2026 21:20:54 +0000",
          "title": "How you're already relying on AI, even if you think you're not",
          "standfirst": "Artificial intelligence is a controversial subject, but as the debate rages it is already being used by ACT government departments, doctors and the people running firefighting operations.",
          "content": "Artificial intelligence is a controversial subject, but as the debate rages it is already being used by ACT government departments, doctors and the people running firefighting operations.",
          "feed_position": 8
        }
      ],
      "popularity_score": 271.0178497222222
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 18:30:00 +0000",
      "title": "Experts weigh in on the butter versus margarine debate",
      "neutral_headline": "Experts weigh in on the butter versus margarine debate",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/butter-margarine-nut-spreads-which-is-best/106010740",
          "published_at": "Sat, 03 Jan 2026 18:30:00 +0000",
          "title": "Experts weigh in on the butter versus margarine debate",
          "standfirst": "You might have a personal preference for which spread you use at home, but experts say there are health considerations for which one you use.",
          "content": "You might have a personal preference for which spread you use at home, but experts say there are health considerations for which one you use.",
          "feed_position": 9
        }
      ],
      "popularity_score": 258.16951611111114
    },
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:18:30 +0000",
      "title": "Former North Melbourne AFL player Phoenix Spicer dies aged 23",
      "neutral_headline": "Former North Melbourne AFL player Phoenix Spicer dies aged 23",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/afl-former-north-melbourne-player-phoenix-spicer-dies/106197350",
          "published_at": "Sat, 03 Jan 2026 21:18:30 +0000",
          "title": "Former North Melbourne AFL player Phoenix Spicer dies aged 23",
          "standfirst": "Phoenix Spicer, who played 12 AFL matches for North Melbourne, has died at the age of 23.",
          "content": "Phoenix Spicer, who played 12 AFL matches for North Melbourne, has died at the age of 23.",
          "feed_position": 19
        }
      ],
      "popularity_score": 161.97784944444444
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:10:51 +0000",
      "title": "Brisbane man training to take on Mount Everest world record",
      "neutral_headline": "Brisbane man training to take on Mount Everest world record",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/world-record-mental-health-oliver-foran-everest/106166224",
          "published_at": "Sat, 03 Jan 2026 21:10:51 +0000",
          "title": "Brisbane man training to take on Mount Everest world record",
          "standfirst": "Oliver Foran struggled with his mental health after losing his mother to cancer. Now, he is training to set a world record while raising money and awareness for youth mental health.",
          "content": "Oliver Foran struggled with his mental health after losing his mother to cancer. Now, he is training to set a world record while raising money and awareness for youth mental health.",
          "feed_position": 11
        }
      ],
      "popularity_score": 156.85034944444445
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:00:01 +0000",
      "title": "Police seek help after alleged sexual assault in Melbourne laneway on January 1",
      "neutral_headline": "Police seek help after alleged sexual assault in Melbourne laneway on January 1",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/sexual-assault-investigation-melbourne-coors-lane-new-years-day/106197360",
          "published_at": "Sat, 03 Jan 2026 21:00:01 +0000",
          "title": "Police seek help after alleged sexual assault in Melbourne laneway on January 1",
          "standfirst": "Police seek public assistance to locate a 22-year-old French man who allegedly sexually assaulted a woman in a Melbourne laneway in the early hours of New Year's Day.",
          "content": "Police seek public assistance to locate a 22-year-old French man who allegedly sexually assaulted a woman in a Melbourne laneway in the early hours of New Year's Day.",
          "feed_position": 24
        }
      ],
      "popularity_score": 156.66979388888888
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 20:17:08 +0000",
      "title": "A station and infamous murders: What happened to Sydney's Macdonaldtown?",
      "neutral_headline": "A station and infamous murders: What happened to Sydney's Macdonaldtown",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/sydney-macdonaldtown-history-the-baby-farmer-urban-legend/106114232",
          "published_at": "Sat, 03 Jan 2026 20:17:08 +0000",
          "title": "A station and infamous murders: What happened to Sydney's Macdonaldtown?",
          "standfirst": "It's the suburb in Sydney that no longer exists — except for a train station — but did it disappear because of scandalous murders or was it just to increase property prices?",
          "content": "It's the suburb in Sydney that no longer exists — except for a train station — but did it disappear because of scandalous murders or was it just to increase property prices?",
          "feed_position": 11
        }
      ],
      "popularity_score": 155.95507166666667
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 22:42:06 +0000",
      "title": "Top End dams overflow as parks come to life in the wake of Cyclone Fina",
      "neutral_headline": "Top End dams overflow as parks come to life in the wake of Cyclone Fina",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/fogg-dam-darwin-river-cyclone-fina-monsoon/106194820",
          "published_at": "Sat, 03 Jan 2026 22:42:06 +0000",
          "title": "Top End dams overflow as parks come to life in the wake of Cyclone Fina",
          "standfirst": "The Northern Territory's Top End has been transformed into a lush green paradise by a cyclone and a monsoon that have brought an unusually heavy start to the annual wet season.",
          "content": "The Northern Territory's Top End has been transformed into a lush green paradise by a cyclone and a monsoon that have brought an unusually heavy start to the annual wet season.",
          "feed_position": 15
        }
      ],
      "popularity_score": 152.37118305555555
    },
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 22:29:00 +0000",
      "title": "Aussie teen makes history with World Cup gold ahead of Winter Olympics",
      "neutral_headline": "Aussie teen makes history with World Cup gold ahead of Winter Olympics",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/world-cup-freeski-halfpipe-indra-brown-wins-gold/106197452",
          "published_at": "Sat, 03 Jan 2026 22:29:00 +0000",
          "title": "Aussie teen makes history with World Cup gold ahead of Winter Olympics",
          "standfirst": "With the Winter Olympics on the horizon, 15-year-old Indra Brown wins her first World Cup freeski halfpipe gold in Calgary.",
          "content": "With the Winter Olympics on the horizon, 15-year-old Indra Brown wins her first World Cup freeski halfpipe gold in Calgary.",
          "feed_position": 20
        }
      ],
      "popularity_score": 152.15284972222221
    },
    {
      "id": "cluster_13",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 22:27:17 +0000",
      "title": "Two drownings in two days along NSW South Coast as man dies at Jervis Bay",
      "neutral_headline": "Two drownings in two days along NSW South Coast as man dies at Jervis Bay",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/man-drowns-jervis-bay-beach/106197422",
          "published_at": "Sat, 03 Jan 2026 22:27:17 +0000",
          "title": "Two drownings in two days along NSW South Coast as man dies at Jervis Bay",
          "standfirst": "Emergency services attempted to revive the man after he and three other people were pulled from the water at Green Patch beach on Saturday afternoon.",
          "content": "Emergency services attempted to revive the man after he and three other people were pulled from the water at Green Patch beach on Saturday afternoon.",
          "feed_position": 10
        }
      ],
      "popularity_score": 152.1242386111111
    },
    {
      "id": "cluster_16",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 22:13:26 +0000",
      "title": "15yo girl, man die after their ATV collides with ute on highway",
      "neutral_headline": "15yo girl, man die after their ATV collides with ute on highway",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/two-killed-in-atv-crash-on-tasmanian-highway/106197446",
          "published_at": "Sat, 03 Jan 2026 22:13:26 +0000",
          "title": "15yo girl, man die after their ATV collides with ute on highway",
          "standfirst": "A 15-year-old girl from interstate and a 38-year-old Rosebery man, who were both on an all-terrain vehicle, died at the scene on the Murchison Highway after a collision with a ute.",
          "content": "A 15-year-old girl from interstate and a 38-year-old Rosebery man, who were both on an all-terrain vehicle, died at the scene on the Murchison Highway after a collision with a ute.",
          "feed_position": 22
        }
      ],
      "popularity_score": 151.8934052777778
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:28:59 +0000",
      "title": "Friends keep teenage pact to retire in the outback together",
      "neutral_headline": "Friends keep teenage pact to retire in the outback together",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/hughenden-friendship-pact-outback-retirement/106187766",
          "published_at": "Sat, 03 Jan 2026 21:28:59 +0000",
          "title": "Friends keep teenage pact to retire in the outback together",
          "standfirst": "Veronica and Wendy made a pact as teenagers to move back to their hometown to retire together. More than 40 years later they have kept their promise.",
          "content": "Veronica and Wendy made a pact as teenagers to move back to their hometown to retire together. More than 40 years later they have kept their promise.",
          "feed_position": 14
        }
      ],
      "popularity_score": 151.15257194444445
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:17:19 +0000",
      "title": "'So, I had this idea': Scientists dispense insecticide-coated feathers for birds to build nests",
      "neutral_headline": "'So, I had this idea': Scientists dispense insecticide-coated feathers...",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/forty-spotted-pardalote-bruny-island-endangered-species/106176110",
          "published_at": "Sat, 03 Jan 2026 21:17:19 +0000",
          "title": "'So, I had this idea': Scientists dispense insecticide-coated feathers for birds to build nests",
          "standfirst": "Donning a helmet and a well-equipped harness, Dr Fernanda Alves looks like she is set to take on an extreme sport. Instead, she is climbing trees to check nesting boxes for a tiny and very rare bird.",
          "content": "Donning a helmet and a well-equipped harness, Dr Fernanda Alves looks like she is set to take on an extreme sport. Instead, she is climbing trees to check nesting boxes for a tiny and very rare bird.",
          "feed_position": 10
        }
      ],
      "popularity_score": 150.95812722222223
    },
    {
      "id": "cluster_27",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 21:00:00 +0000",
      "title": "How braille music opens up the music world for blind people",
      "neutral_headline": "How braille music opens up the music world for blind people",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/louis-braille-music-200/106176564",
          "published_at": "Sat, 03 Jan 2026 21:00:00 +0000",
          "title": "How braille music opens up the music world for blind people",
          "standfirst": "In the 1820s, Louis Braille devised a raised-dot system of letters, numbers and musical notation. 200 years later, it’s still opening the music world for blind musicians.",
          "content": "In the 1820s, Louis Braille devised a raised-dot system of letters, numbers and musical notation. 200 years later, it’s still opening the music world for blind musicians.",
          "feed_position": 23
        }
      ],
      "popularity_score": 150.6695161111111
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 20:21:58 +0000",
      "title": "Man told to pay $120,000 over unauthorised backyard cheese business",
      "neutral_headline": "Man told to pay $120,000 over unauthorised backyard cheese business",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/contempt-of-court-finding-over-backyard-cheesemaking-facility/106189800",
          "published_at": "Sat, 03 Jan 2026 20:21:58 +0000",
          "title": "Man told to pay $120,000 over unauthorised backyard cheese business",
          "standfirst": "An Adelaide retiree who continually ignored orders to remove an unauthorised backyard cheesemaking facility from his suburban home is ordered to pay more than $120,000 in costs, after being found guilty of contempt of court.",
          "content": "An Adelaide retiree who continually ignored orders to remove an unauthorised backyard cheesemaking facility from his suburban home is ordered to pay more than $120,000 in costs, after being found guilty of contempt of court.",
          "feed_position": 12
        }
      ],
      "popularity_score": 150.03562722222222
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 20:01:57 +0000",
      "title": "De Minaur unfazed by United Cup loss in Australian Open build-up",
      "neutral_headline": "De Minaur unfazed by United Cup loss in Australian Open build-up",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/united-cup-tennis-alex-de-minaur-casper-ruud-australian-open/106197302",
          "published_at": "Sat, 03 Jan 2026 20:01:57 +0000",
          "title": "De Minaur unfazed by United Cup loss in Australian Open build-up",
          "standfirst": "Alex de Minaur is not concerned about his Australian Open preparations, believing he can \"flip that switch\" after recording his first career defeat to Casper Ruud.",
          "content": "Alex de Minaur is not concerned about his Australian Open preparations, believing he can \"flip that switch\" after recording his first career defeat to Casper Ruud.",
          "feed_position": 21
        }
      ],
      "popularity_score": 149.7020161111111
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 19:52:57 +0000",
      "title": "Summer is here but this town's pub is closed for the first time in 140 years",
      "neutral_headline": "Summer is here but this town's pub is closed for the first time in 140 years",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/toora-pub-closure-impact-south-gippsland-hotel-summer/106159610",
          "published_at": "Sat, 03 Jan 2026 19:52:57 +0000",
          "title": "Summer is here but this town's pub is closed for the first time in 140 years",
          "standfirst": "For the first time in almost 140 years, Toora's historic pub did not trade over the festive season, leaving locals and visitors with nowhere to drink.",
          "content": "For the first time in almost 140 years, Toora's historic pub did not trade over the festive season, leaving locals and visitors with nowhere to drink.",
          "feed_position": 16
        }
      ],
      "popularity_score": 149.5520161111111
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 19:03:01 +0000",
      "title": "A world-first blak love anthology is coming — and it's about joy",
      "neutral_headline": "A world-first blak love anthology is coming — and it's about joy",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/blak-romance-choc-lit-magabala-first-nations-love-stories/106164166",
          "published_at": "Sat, 03 Jan 2026 19:03:01 +0000",
          "title": "A world-first blak love anthology is coming — and it's about joy",
          "standfirst": "An anthology of love stories written by First Nations people is in the works with stories of blak love, joy, and connection capitalising on the fastest growing literary genre in the world.",
          "content": "An anthology of love stories written by First Nations people is in the works with stories of blak love, joy, and connection capitalising on the fastest growing literary genre in the world.",
          "feed_position": 24
        }
      ],
      "popularity_score": 148.7197938888889
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 18:59:26 +0000",
      "title": "Pakistani women challenge tradition and hike the 'Savage Mountain'",
      "neutral_headline": "Pakistani women challenge tradition and hike the 'Savage Mountain'",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/pakistan-women-hikers-summit-k2-sparks-new-wave-female-climbers/106032678",
          "published_at": "Sat, 03 Jan 2026 18:59:26 +0000",
          "title": "Pakistani women challenge tradition and hike the 'Savage Mountain'",
          "standfirst": "Pakistani women are hiking some of the world's tallest mountains and glacier trails, claiming a space that has long been out of reach.",
          "content": "Pakistani women are hiking some of the world's tallest mountains and glacier trails, claiming a space that has long been out of reach.",
          "feed_position": 13
        }
      ],
      "popularity_score": 148.66007166666668
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 18:30:00 +0000",
      "title": "How Hillary made history again with an 'arrogant' dash to the South Pole",
      "neutral_headline": "How Hillary made history again with an 'arrogant' dash to the South Pole",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2026-01-04/today-in-history-january-4-hillary-dash-to-the-pole/106181576",
          "published_at": "Sat, 03 Jan 2026 18:30:00 +0000",
          "title": "How Hillary made history again with an 'arrogant' dash to the South Pole",
          "standfirst": "Less than five years after conquering Mount Everest, legendary explorer Sir Edmund Hillary wanted to make history again in Antarctica.",
          "content": "Less than five years after conquering Mount Everest, legendary explorer Sir Edmund Hillary wanted to make history again in Antarctica.",
          "feed_position": 17
        }
      ],
      "popularity_score": 148.1695161111111
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 20:39:21 +0000",
      "title": "Snowy Mountains rodeo celebrates 80 years",
      "neutral_headline": "Snowy Mountains rodeo celebrates 80 years",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/tumbaumba-rodeo-turns-80/106194110",
          "published_at": "Sat, 03 Jan 2026 20:39:21 +0000",
          "title": "Snowy Mountains rodeo celebrates 80 years",
          "standfirst": "As the Tumbarumba Rodeo celebrates its 80th year, the Rial family have held on for the longest ride of them all.",
          "content": "As the Tumbarumba Rodeo celebrates its 80th year, the Rial family have held on for the longest ride of them all.",
          "feed_position": 14
        }
      ],
      "popularity_score": 147.32534944444444
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Sat, 03 Jan 2026 20:23:37 +0000",
      "title": "Early eye testing helped Lucy avoid blindness",
      "neutral_headline": "Early eye testing helped Lucy avoid blindness",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2026-01-04/calls-for-universal-preschool-vision-testing-in-sa/106190758",
          "published_at": "Sat, 03 Jan 2026 20:23:37 +0000",
          "title": "Early eye testing helped Lucy avoid blindness",
          "standfirst": "A group of researchers is calling on the South Australian government to implement a universal vision screening program for all children attending preschools or day care centres.",
          "content": "A group of researchers is calling on the South Australian government to implement a universal vision screening program for all children attending preschools or day care centres.",
          "feed_position": 15
        }
      ],
      "popularity_score": 147.06312722222222
    }
  ]
}