{
  "updated_at": "2025-12-19T23:19:45.879Z",
  "clusters": [
    {
      "id": "cluster_5",
      "coverage": 3,
      "updated_at": "Fri, 19 Dec 2025 22:55:48 +0000",
      "title": "Jeffrey Epstein files released by US Justice Department",
      "neutral_headline": "Jeffrey Epstein files released by US Justice Department",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/justice-department-begins-releasing-longawaited-files-tied-to-epstein-sex-trafficking-investigation/e4c60703-d817-48e6-a944-77aca0cf9226",
          "published_at": "Fri, 19 Dec 2025 22:55:48 +0000",
          "title": "Jeffrey Epstein files released by US Justice Department",
          "standfirst": "The US Justice Department has begun releasing its files on Jeffrey Epstein.",
          "content": "The US Justice Department has begun releasing its files on Jeffrey Epstein, a convicted sex offender and wealthy financier known for his connections to some of the world&#x27;s most influential people, including Donald Trump, who as president had tried to keep the files sealed.The release included photographs, call logs, grand jury testimony and some documents and records that have already been in the public domain.READ MORE: New Epstein photos &#x27;no big deal&#x27;, says Trump Photos of Bill Clinton Several photos of former President Bill Clinton are in the documents released by the Justice DepartmentSome show Clinton on a private plane, including one with a woman whose face was redacted from the photo sitting on his lap. Another photo shows him in a pool with Maxwell and a person whose face also was redacted.Another photo shows Clinton in a hot tub with a woman whose face was redacted.The files do not say when the photos were taken.Clinton has never been accused of wrongdoing in connection with Epstein, and the mere inclusion of someone&#x27;s name or images in files from the investigation does not imply otherwise.Clinton minimised his relationship with Epstein, acknowledging that he traveled on Epstein&#x27;s private jet but saying through a spokesperson that he had no knowledge of the late financier&#x27;s crimes.What Democrats could do to force complete releaseDemocrats in Congress say they are reviewing all their legal options as they assess the Department of Justice&#x27;s release of the Epstein files, which they say is not a full release of documents.Lawmakers could go to court to force the Justice Department to comply with the law passed earlier this year forcing the release, but that would almost certainly be a lengthy process that plays out while the Justice Department releases more files.Separately, the House Oversight Committee has issued a subpoena for the Epstein files. That could give Congress another avenue to force the release of more information to the committee, but it would require Democrats to convince Republicans to join them in contempt of Congress proceedings. It would be highly unusual for GOP politicians to take such a move against a Republican administration.Democratic senator vows to use &#x27;all avenues and legal tools&#x27; for full release of documentsDemocratic Sen. Jeff Merkley of Oregon expressed frustration that the Trump administration had not taken steps to \"appropriately redact the Epstein Files to prepare them for release\" of their own accord over the last year.\"Instead of meeting the legally required deadline today to release all of the files, they have chosen to illegally disregard the law I led the fight in the Senate to pass,\" Merkley said. \"By failing to comply, the Administration is openly denying &#x27;equal justice under the law&#x27; to all of Jeffrey Epstein&#x27;s victims.\"Merkley continued: \"I&#x27;ll keep fighting to release all the Epstein Files and am exploring all avenues and legal tools to get justice for the victims and transparency for the American people.\"Files appear online after a waiting room-like queueHigh interest led the Justice Department to regulate access to its Epstein files website for a time.The webpage went live Friday afternoon with a waiting room-type queue akin to what concertgoers sometimes see when they go online to purchase tickets.Visitors were greeted with the message: \"You are in line for Department of Justice web content. When it is your turn, you will have 10 minutes to enter the website.\"The webpage then refreshed to reveal a landing page with various categories of documents, including court records and other disclosures.Inside the records The records could contain the most detailed look yet at nearly two decades worth of government investigations into Epstein&#x27;s sexual abuse of young women and underage girls.Their release has long been demanded by a public hungry to learn whether any of Epstein&#x27;s rich and powerful associates knew about — or participated in — the abuse. Epstein&#x27;s accusers have also long sought answers about why federal authorities shut down their initial investigation into the allegations in 2008.Bowing to political pressure from fellow Republicans, Trump on November 19 signed a bill giving the Justice Department 30 days to release most of its files and communications related to Epstein, including information about the investigation into his death in a federal jail. The law&#x27;s passage was a remarkable display of bipartisanship that overcame months of opposition from Trump and Republican leadership.READ MORE: Trump administration moves to cut off transgender care for children What the law allowsThat law allows for redactions about the victims or ongoing investigations but makes clear no records shall be withheld or redacted due to \"embarrassment, reputational harm, or political sensitivity.\"Attorney General Pam Bondi said on November 14 that she had ordered a top federal prosecutor to investigate Epstein&#x27;s ties to Trump&#x27;s political foes, including former President Bill Clinton. Bondi acted after Trump pressed for such an inquiry, though he did not explain what supposed crimes he wanted the Justice Department to investigate. None of the men Trump mentioned in a social media post demanding the investigation has been accused of sexual misconduct by any of Epstein&#x27;s victims.In July, Trump dismissed some of his own supporters as \"weaklings\" for falling for \"the Jeffrey Epstein hoax.\" But both Trump and House Speaker Mike Johnson, R-La., failed to prevent the legislation from coming to a vote.Trump did a U-turn on the files once it became clear that congressional action was inevitable. He insisted that the Epstein matter had become a distraction to the Republican agenda and that releasing the records was the best way to move on.READ MORE: Trump hurls outrageous slur at female reporterThe Epstein investigationsPolice in Palm Beach, Florida, began investigating Epstein in 2005 after the family of a 14-year-old girl reported she had been molested at his mansion. The FBI joined the investigation, and authorities gathered testimony from multiple underage girls who said they had been hired to give Epstein sexual massages.Ultimately, though, prosecutors gave Epstein a deal that allowed him to avoid federal prosecution. He pleaded guilty to state prostitution charges involving someone under age 18 and was sentenced to 18 months in jail.Epstein&#x27;s accusers then spent years in civil litigation trying to get that plea deal set aside. One of those women, Virginia Giuffre, accused Epstein of arranging for her to have sexual encounters, starting at age 17, with numerous other men, including billionaires, famous academics, US politicians and Andrew Mountbatten-Windsor, then known as Britain&#x27;s Prince Andrew.All of those men denied the allegations. Prosecutors never brought charges in connection with Giuffre&#x27;s claims, but her account fuelled conspiracy theories about supposed government plots to protect the powerful. Giuffre died by suicide at her farm in Western Australia in April at age 41.Federal prosecutors in New York brought new sex trafficking charges against Epstein in 2019, but he killed himself in jail a month after his arrest. Prosecutors then charged Epstein&#x27;s longtime confidant, British socialite Ghislaine Maxwell, with recruiting underage girls for Epstein to abuse.Maxwell was convicted in late 2021 and is serving a 20-year prison sentence, though she was moved from a low-security federal prison in Florida to a minimum-security prison camp in Texas after she was interviewed over the summer by Deputy Attorney General Todd Blanche. Her lawyers argued that she never should have been tried or convicted.The Justice Department in July said it had not found any information that could support prosecuting anyone else.Lots of Epstein records were already publicAfter nearly two decades of court action and prying by reporters, a voluminous number of records related to Epstein is already public, including flight logs, address books, email correspondence, police reports, grand jury records, courtroom testimony and transcripts of depositions of his accusers, his staffers and others.Yet, the public&#x27;s appetite for more records has been insatiable, particularly for anything related to Epstein&#x27;s associations with famous people including Trump, Mountbatten-Windsor and Clinton.Trump was friends with Epstein for years before the two had a falling out. Neither he nor Clinton has ever been accused of wrongdoing in connection with Epstein, and the mere inclusion of someone&#x27;s name in files from the investigation does not imply otherwise.Mountbatten-Windsor denied ever having sex with Giuffre, but King Charles III stripped him of his royal titles this year after Giuffre&#x27;s memoir was published after she died.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/f88cf03d-74ac-4116-ad6b-a3b2cd4a905b"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/world/north-america/epstein-files-released-live-updates-us-justice-department-makes-records-on-disgraced-financier-jeffrey-epstein-public-20251218-p5nosx.html",
          "published_at": "Sat, 20 Dec 2025 09:55:07 +1100",
          "title": "Epstein files released LIVE updates: Celebrities, politicians feature in photos, Congress told of 1200 victims as US Justice Department makes public Jeffrey Epstein files",
          "standfirst": "The US Justice Department has released records relating to disgraced financier Jeffrey Epstein, who died by suicide in his jail cell in 2019. Follow along for our live coverage.",
          "content": "The US Justice Department has released records relating to disgraced financier Jeffrey Epstein, who died by suicide in his jail cell in 2019. Follow along for our live coverage.",
          "feed_position": 2,
          "image_url": "https://static.ffx.io/images/$zoom_0.353%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_122/t_crop_custom/q_86%2Cf_auto/0e26b148ce0dec0e5d7df700032735db17968e2a"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/epstein-files-released-by-us-department-of-justice/106034604",
          "published_at": "Fri, 19 Dec 2025 21:10:09 +0000",
          "title": "Epstein files partially released by US Department of Justice",
          "standfirst": "The Trump administration publishes the first tranche of the Epstein files; but the release of hundreds of thousands of documents looks to have been delayed.",
          "content": "The Trump administration publishes the first tranche of the Epstein files; but the release of hundreds of thousands of documents looks to have been delayed.",
          "feed_position": 12
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/world/jeffrey-epstein-files-donald-trump-administration-redacted-documents-latest-news/5d9ea1fd-527e-41f0-b545-567efffba191",
          "published_at": "Fri, 19 Dec 2025 21:02:00 +0000",
          "title": "Fears Trump administration will redact too much in Epstein documents",
          "standfirst": "Frustration is mounting inside the Justice Department as it races to redact thousands of pages of files related to Jeffrey Epstein before they must be released today, multiple sources familiar with the process told CNN.",
          "content": "Frustration is mounting inside the Justice Department as it races to redact thousands of pages of files related to Jeffrey Epstein before they must be released today, multiple sources familiar with the process told CNN.A substantial number of redactions are needed, one of the sources said, and the documents each attorney is processing since Thanksgiving week can number more than 1000 — a time-consuming task that likely will come down to the wire. The sensitivities of executive and legal privacy, victims&#x27; protections and other concerns all could play in to the choices the lawyers must make when it comes to potential redactions.Lawyers working on the Epstein files at the US Department of Justice&#x27;s National Security Division also believe they aren&#x27;t getting clear or comprehensive direction on how to make the most information available under the law, several sources said.READ MORE: New Epstein photos &#x27;no big deal&#x27;, says Trump Counterintelligence specialists were asked to drop nearly all of their other work to process the Epstein documents, two people said, but some lawyers declined to participate.An act of Congress has mandated the Trump administration release troves of Epstein-related documents — from grand jury records, to FBI files and internal Justice Department discussions — by Friday, after months of the Trump administration promising and not delivering transparency.The situation suggests that the persistent political headache connected to transparency for the Epstein files may not disappear with Friday&#x27;s deadline.In whatever becomes public on Friday, sources said there will still be extensive amounts of information redacted — the type of lack of transparency that the American public may continue to scrutinise.Some legal document specialists are already preparing for the possibility that the Department of Justice&#x27;s release of the files will have more redactions than what is required, and that there may be mistakes in what&#x27;s redacted and what&#x27;s made public. Mistakes especially could relate to the disclosure of sensitive personal information, because of the volume of documents and how fast the lawyers have had to work, the sources said.\"Either they&#x27;re going to screw it up or they&#x27;re going to withhold things. It wouldn&#x27;t surprise me,\" said one lawyer outside the Justice Department who is awaiting the release to determine whether there should be complaints made about how the redaction work was done. \"Some of it may be incompetence as much as deliberate.\"READ MORE: Trump administration moves to cut off transgender care for children A challenging taskThe Epstein files are vast, and thousands of records held by different sections of federal law enforcement have to be picked through to determine whether they are responsive to the transparency law&#x27;s requirements or need to be redacted because of various confidentiality rules and to protect Epstein&#x27;s victims.There are only four pages the lawyers have been given as internal guidance to follow to make the redactions, one of the sources said. And nearly all of the guidelines the lawyers have received articulate exemptions to the transparency law.There are also logistical headaches in the work. Duplicates in what the lawyers are working through haven&#x27;t been taken out of the cache, one source told CNN. That creates more of a possibility there may not be consistent redactions across the documents or that redactions may be done incorrectly in spots. Plus it adds hundreds of pages more for lawyers to process than what they normally would have to handle if the duplicates were taken out.The Justice Department has flubbed redactions in a massive document production already this year. When the National Security Division worked on releasing 60,000 pages related to the Kennedy assassination earlier this year, in another drop-everything task with a deadline, social security numbers and other private information of more than 400 former congressional staffers and others were mistakenly made public, according to the Washington Post.The stakes are high for women who suffered abuse under Epstein.Some Epstein victims have said they feel as if they&#x27;re in the dark on how the files are being prepared for the release, according to CNN reporting earlier this week. The Epstein survivors who spoke recently told CNN that they had gotten no outreach from the US Department of Justice ahead of the files&#x27; release.A Justice Department spokesperson declined to comment for this article.READ MORE: Trump hurls outrageous slur at female reporterWho&#x27;s doing the redactingThe Justice Department&#x27;s National Security Division inherited the redaction work from the FBI after the law was passed for transparency on the Epstein files.It&#x27;s surprising to many national security law specialists that that&#x27;s who&#x27;s doing the work, given the division&#x27;s historical emphasis on classified matters and the lack of a nexus between Epstein and national security interests.Several sources said, however, that&#x27;s where the manpower is at the Justice Department this year.The latest round of Epstein redaction work started in fervour over Thanksgiving, shortly after Congress passed the transparency act.The FBI had previously done a similar push on redactions earlier in the Trump administration. During that effort, in response to an over-promising of transparency by Attorney General Pam Bondi that the department didn&#x27;t deliver, agents worked around the clock, some in overnight shifts that supplanted other threat investigations the FBI was working on.READ MORE: Trump has an alcoholic&#x27;s personality: chief of staff The national security lawyers aren&#x27;t among the Justice Department division that classically handles document processing, or even sex crimes or conspiracies, as had been alleged of the late Epstein and his convicted paramour Ghislaine Maxwell. A different part of the Justice Department where lawyers handle Freedom of Information Act requests are more typically tasked to handle document redaction projects, especially before this Trump administration. The national security section also isn&#x27;t the office that investigated Epstein years ago – another group that could weigh in on the files and transparency.Still, the national security division has previously handled substantial redaction projects this year for topics that aren&#x27;t core to their legal work – including those related to releases of the Martin Luther King Jr and John F. Kennedy assassination historical files.While the National Security Division has been gutted during this Trump administration, it&#x27;s still many dozens of lawyers strong. Those lawyers are experienced in working with sensitive data, with extensive, elaborate redaction needs.READ MORE: More photos from Epstein&#x27;s estate released DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 1,
          "image_url": "https://prod.static9.net.au/fs/1ffbeed3-414e-4776-933e-ef5a2187f88d"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/f88cf03d-74ac-4116-ad6b-a3b2cd4a905b",
      "popularity_score": 3019.600589166667
    },
    {
      "id": "cluster_0",
      "coverage": 2,
      "updated_at": "Sat, 20 Dec 2025 10:15:54 +1100",
      "title": "The Ashes 2025 third Test LIVE: Head, Carey build lead as England tries to save series",
      "neutral_headline": "The Ashes 2025 third Test LIVE: Head, Carey build lead as...",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/sport/cricket/the-ashes-2025-third-test-live-head-carey-build-lead-as-england-tries-to-save-series-20251220-p5np6o.html",
          "published_at": "Sat, 20 Dec 2025 10:15:54 +1100",
          "title": "The Ashes 2025 third Test LIVE: Head, Carey build lead as England tries to save series",
          "standfirst": "Australia gave England a valuable lesson in how to turn an advantage into an unassailable position as they strengthened their hold on the third Test and the Ashes. Will the third Ashes Test be decided on day four?",
          "content": "Australia gave England a valuable lesson in how to turn an advantage into an unassailable position as they strengthened their hold on the third Test and the Ashes. Will the third Ashes Test be decided on day four?",
          "feed_position": 0,
          "image_url": "https://static.ffx.io/images/$zoom_0.8371%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_465%2C$y_103/t_crop_custom/q_86%2Cf_auto/d4b15c04932a1c5196bd8e04db0e267ed2e5fbb5"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/ashes-third-test-day-four-live-blog/106165808",
          "published_at": "Fri, 19 Dec 2025 22:49:35 +0000",
          "title": "Live: Head, Carey looking to pile on more runs as Australia dominate in Adelaide",
          "standfirst": "Australia can win the Ashes in record time as it enters day four with a 356-run lead, leaving England hoping for a miracle in the third Test at Adelaide Oval. Follow live.",
          "content": "Australia can win the Ashes in record time as it enters day four with a 356-run lead, leaving England hoping for a miracle in the third Test at Adelaide Oval. Follow live.",
          "feed_position": 3
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.8371%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_465%2C$y_103/t_crop_custom/q_86%2Cf_auto/d4b15c04932a1c5196bd8e04db0e267ed2e5fbb5",
      "popularity_score": 2019.9355891666667
    },
    {
      "id": "cluster_13",
      "coverage": 2,
      "updated_at": "Fri, 19 Dec 2025 22:07:50 +0000",
      "title": "Pressure mounts on Victorian government to take action over anti-Zionist rally",
      "neutral_headline": "Pressure mounts on Victorian government to take action over anti-Zionist rally",
      "items": [
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/pressure-mounts-on-victorian-government--to-take-action-over-antizionist-rally/9e1addbc-9bd5-4602-bbfa-885882c6fbee",
          "published_at": "Fri, 19 Dec 2025 22:07:50 +0000",
          "title": "Pressure mounts on Victorian government to take action over anti-Zionist rally",
          "standfirst": "The Victorian Government has warned that anyone who protests in Melbourne in the aftermath of the Bondi terror attack will be \"dealt with by police\".",
          "content": "J ewish leaders are calling on the Victorian government to prevent an anti-Zionism protest happening in Melbourne on Monday.Victorian Premier Jacinta Allan has warned that people who attend the rally will be \"dealt with by police\".Anti-Zionism Australia originally planned to protest in the city today.READ MORE: Powerful new gun laws touted ahead of buybackInstead, they will protest on Monday, a day after the National Day of Reflection.\"It is unthinkable that these rallies or protests would happen, full stop,\" Education Minister Jason Clare said.Victoria Police has said there will be a significant presence in the city and has said any unlawful behaviour will not be tolerated. NSW Police have also issued warnings to those planning to attend unauthorised gatherings this weekend in Sydney.\"Fifteen people are dead. There are still people in hospital. Many more people that are injured. What we need in this country right now is love, not hate, not protest,\" the Education Minister said.Clare said that he hopes the Victorian government does everything in its power to ensure that the protests do not take place.\"Any right-thinking Australian would know this is absolutely wrong and shouldn&#x27;t happen in the first place,\" he said.\"So I&#x27;m hoping that it just doesn&#x27;t happen.\" Former federal treasurer and prominent Jewish Victorian Josh Frydenberg has voiced his displeasure with the rally, saying it is unthinkable that the government would not intervene. DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 2,
          "image_url": "https://prod.static9.net.au/fs/03b0f167-e085-4c6e-9cd2-96d7e31a0844"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victorian-government-warns-people-planning-to-protest-in-melbourne-20251220-p5np6b.html",
          "published_at": "Sat, 20 Dec 2025 07:38:46 +1100",
          "title": "Victorian government warns people planning to protest in Melbourne",
          "standfirst": "The Victorian Government has warned anyone who protests in Melbourne in the aftermath of the Bondi terror attack will be \"dealt with by police\".",
          "content": "The Victorian Government has warned anyone who protests in Melbourne in the aftermath of the Bondi terror attack will be \"dealt with by police\".",
          "feed_position": 6,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/0c9f0251f1568628c8d0cd66778d5ac9561c603a"
        }
      ],
      "featured_image": "https://prod.static9.net.au/fs/03b0f167-e085-4c6e-9cd2-96d7e31a0844",
      "popularity_score": 2018.8011447222223
    },
    {
      "id": "cluster_29",
      "coverage": 2,
      "updated_at": "Sat, 20 Dec 2025 07:38:30 +1100",
      "title": "Final victim of Bondi Beach terror attack identified",
      "neutral_headline": "Final victim of Bondi Beach terror attack identified",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/final-victim-of-bondi-beach-terror-attack-identified-20251220-p5np67.html",
          "published_at": "Sat, 20 Dec 2025 07:38:30 +1100",
          "title": "Final victim of Bondi Beach terror attack identified",
          "standfirst": "The final victim of the Bondi Beach terror attack has been identified as a grandmother who reportedly risked her life while trying to save a child.",
          "content": "The final victim of the Bondi Beach terror attack has been identified as a grandmother who reportedly risked her life while trying to save a child.",
          "feed_position": 7,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/8230a2714669bc07f71a3660778ec050531539b8"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/bondi-beach-shooting-terror-attack-victims-named/8e866d73-4e45-4198-b28b-3661b4d8ad58",
          "published_at": "Fri, 19 Dec 2025 08:57:25 +0000",
          "title": "Final victim of Bondi attack named as local grandmother",
          "standfirst": "It is believed Tania Tretiak, a local grandmother, was attending the Chanukah by the Sea event with family.",
          "content": "Grief-stricken families of those killed in the terrorist attack at Bondi Beach have paid tribute to the victims with moving and heartbreaking messages of reflection, as the identity of the final victim was today confirmed.A 10-year-old girl, a Holocaust survivor, a former police officer, a French footballer, a lifelong volunteer, a loving father and a Bondi local are among the 15 people who were gunned down in the shooting.Dozens more were injured when Sajid and Naveed Akram allegedly fired dozens of shots targeting Jewish people celebrating the first day of Hanukkah on Sunday evening.READ MORE: Donations for Bondi hero surpass $2.5m Seventeen people remain in several hospitals around Sydney in conditions ranging from stable to critical as of 8am today, according to NSW Health.Two of the injured were police officers, a constable who exchanged fire with the gunman and a probationary constable.Ahmed El-Ahmed, the hero bystander who helped disarm one of the gunmen, is among the injured recovering at St George Hospital.Here is what we know about the victims so far. Fourteen have been named, with the identity of the final victim not yet known. Tania Tretiak - Randwick grandmotherRandwick grandmother Tania Tretiak, 68, is the 15th and final victim of the massacre to be identified. Tretiak was celebrating Hanukkah with family at the Bondi event when she was tragically gunned down, The Sydney Morning Herald reports. Adam Smyth - Bondi localBondi resident and father-of-four Adam Smyth, 50, was walking with his wife Katrina when he was shot and killed in Bondi.Smyth&#x27;s family sadly confirmed he died at the scene.\" We are all trying to come to terms with the senseless shooting, of which Adam was a victim,\" his family said in a statement.\"No words can describe the pain of our loss.\"Adam and Katrina were living their best lives together.\"Their shared love of family and friends, travel and sport – if not always the same team – made their time together truly special.\"Smyth is being remembered for his love of English Premier League, his AFL team the Sydney Swans and NRL&#x27;s Manly Sea Eagles. \"We will forever cherish the time we have had with him,\" the statement continued.\"Adam was a generous and kind person who will be dearly missed and is forever irreplaceable.\"Matilda — 10-year-old girlThe youngest victim has been identified as 10-year-old Matilda.She smiled for a photo after having her face painted, petted some farm animals and had been enjoying the celebrations with her six-year-old sister on Sunday evening.But when the gunmen opened fire, she was fatally shot in front of her sister. She was rushed to hospital, but could not be saved. Her aunt, Lina Chernykh, shared footage of Matilda taken hours before she was killed.She said the heartbroken family will never recover from their loss.\"A happy kid,\" she told 9News.\"She was open-hearted. Everywhere she goes, she was like a sun.\"Matilda has been remembered as a \"bright, joyful, and spirited child who brought light to everyone around her\", according to her language teacher Irina Goodhew, who has launched a fundraising appeal for her family.\"Yesterday, while celebrating Hanukkah, her young life was tragically taken. Her memory will live on in our hearts,\" she wrote on the fundraising site. Boris and Sofia Gurman - husband and wife Boris, 69, and Sofia Gurman, 61, were a Ukrainian-Jewish couple living in Bondi who were the first victims of the shooting.They were walking when they came across Sajid Akram firing early shots.Dashcam footage showed Boris disarm him, grabbing the gun like a cricket bat and charging at him while his wife watched on.But Akram had more than one weapon. He fired and fatally shot the husband and wife.\"They had been married for 34 years, with their 35th wedding anniversary approaching in January,\" their family said.\"In just two days&#x27; time, we were meant to celebrate Sofia&#x27;s birthday - a moment that now feels incredibly hard to comprehend.\"The beloved couple&#x27;s family said their actions proved the type of people they were.\"While nothing can lessen the pain of losing Boris and Sofia, we feel an overwhelming sense of pride in their bravery and selflessness. This encapsulates who Boris and Sofia were – people who instinctively and selflessly tried to help others,\" they said in a statement.His family said the couple were going to celebrate Sofia&#x27;s birthday tomorrow and their 35th wedding anniversary in January.\"Boris was a retired mechanic, known for his generosity, quiet strength and willingness to lend a hand to anyone in need. Sofia worked at Australia Post and was deeply loved by her colleagues and community,\" their family said.The pair were remembered for living \"honest, hardworking lives\" and treating everyone with \"kindness, warmth and respect\".Witnesses described Boris as a \"hero\". \"He was a hero. He tried, he tried. We need to let his family know,\" a witness told 9News.\"Everyone needs to know what he tried, because it was right in the beginning. And he put himself in that face of danger. There were bullets flying already, and he put his self in the face of danger.\"Boris Tetleroyd - loving fatherA Soviet immigrant and loving father, Boris Tetleroyd was killed during the Bondi shooting.Boris and his son were at the event on Sunday. Both were shot.Tetleroyd did not survive his injuries, while his son is recovering in hospital.\"Boris was loved by everyone he met. He was well known to his neighbours, deeply connected to our wider community, and cherished by his family,\" his family said.\"He was profoundly loved and adored by his sons Yaakov and Roman and by his wife Svetlana.\"He is also deeply loved by his brother, aunt, nieces, nephews, cousins and all who had the privilege of knowing him.\"He is also being remembered as a gentle person, a gifted musician and a valued member of his community.\"We honour his life and the love he so generously gave to those around him,\" the statement added.His niece has set up a fundraiser, and said the family is grieving his \"sudden and violent\" loss.He is also survived by his wife.Social media posts show Tetleroyd as a nature lover, who shared photos of animals he encountered on bushwalks. Edith Brutman — community service workerEdith Brutman was a devoted member of the Jewish community who was killed while attending Sunday&#x27;s event.She was the vice president of B&#x27;nai B&#x27;rith NSW, the state&#x27;s branch of the international Jewish community service organisation.President of the Alfred Dreyfus Unit at B&#x27;nai B&#x27;rith, Ernie Friedlander, told The Sydney Morning Herald she was a \"good, caring human being\".\"She was a very clever lady, and she was very, very passionate about dealing with prejudice and discrimination. She was always there, and she had very strong opinions,\" he said.Alex Kleytman — Holocaust survivorAlex Kleytman was an 87-year-old Holocaust survivor who died in the Bondi attack, according to Chabad, a US-based global Hasidic Jewish organisation that hosted the Hanukkah event at Bondi.He is the oldest known victim of the shooting. He had survived the genocide with his mother and younger brother in Siberia before he and his wife, Larisa Kleytman, migrated to Australia from Ukraine.They had been married for nearly 60 years.\"He was a fascinating person of many talents and an unwavering spirit,\" his family said.\"He was also very stubborn!! Born in 1938, he survived the hardships of World War II in frozen Siberia, carrying with him a lifetime of extraordinary stories of resilience, survival, and unexpected luck.\"His family said he retired at age 76 and went on to become a lobbyist, before finding his passion in writing books.But most of all, they said, he loved Larisa.\"He loved his wife, Larisa, with unparalleled passion, the kind you only see in the movies,\" his family said.\"He and Mum loved to dance and were quite good, winning a dancing competition at work .\"The two gunmen killed him, but his memories, his legacy, and his books will bring light for generations to come.\"Peter Meagher — former police officerPeter Meagher, a former police officer and Randwick Rugby volunteer and manager, was working as a freelance photographer at the Hanukkah event when he was shot.His family said he was a member of the NSW Police Force for 35 years, rising to the position of detective sergeant and retired in 2020.\"Our family is heartbroken by the loss of our beloved Peter,\" the family said in a statement released through police.\"He was a cherished brother, husband and uncle whose kindness, generosity and love touched everyone who knew him.\"We are grateful for the outpouring of support from friends and the community.\"As we begin to come to terms with what has happened, we ask for privacy and the space to mourn together as a family.\"We also ask that the media respect our wishes and remember Peter for the life he lived, not for the way it ended.\"In retirement he became a freelance photographer and was on assignment in Bondi on Sunday to photograph the Chanukah celebration.\"Peter also spent countless hours doing volunteer work in retirement including in various roles for his beloved Randwick Rugby Union Football Club. \"The tragic irony that Peter spent so long in the dangerous front line as a police officer and was struck down in retirement while pursuing his passion for taking photos is hard for us to comprehend.\"Our thoughts are with all those who have been affected by this tragedy.\" Randwick Rugby said Meagher had worked as a long-time referee before spending much of the last decade as a first-grade manager and volunteer for Randwick Rugby.His club said news of his death has hit the players, coaches, managers, volunteers and supporters \"extremely hard\". \"&#x27;Marzo&#x27;, as he was universally known, was a much-loved figure and absolute legend in our club, with decades of voluntary involvement, he was one of the heart and soul figures of Randwick Rugby,\" the club said.\"Rest in Peace &#x27;Marzo&#x27; - we all love you and will miss you greatly. We are devastated.\"Reuven Morrison — heroReuven Morrison, a 62-year-old immigrant from the Soviet Union, was killed while trying to protect the community from the gunmen.He was captured on footage throwing bricks at Sajid after he was disarmed by local hero Ahmed Al Ahmed.His daughter, Sheina Gutnick, said it was only fitting that her father died while trying to save lives.\"From my sources and understanding, he had jumped up the second the shooting started. He managed to throw bricks at the terrorist,\" she told CBS News.\"He was screaming at the terrorist, and protecting his community, he was shot dead.\"If there was one way for him to go on this earth, it would be fighting a terrorist. There was no other way he would be taken from us. He went down fighting, protecting the people he loved most.\" Gutnick said her father migrated to Australia believing he would be safe. Eli Schlanger — rabbiEli Schlanger was a rabbi, father of five and chaplain for Corrective Services NSW.The 41-year-old, who welcomed his newborn baby just six weeks ago, helped organise the Hanukkah event when he was shot dead.His brother-in-law, rabbi Mendel Kastel, said their \"family is broken\", while his cousin, Zalman Lewis, remembered him as a \"truly an incredible guy\".Rabbi Menachem Dadon, whose daughter was shot but survived, said he had held Schlanger as he died.Alex Ryvchin, of the Executive Council of Australian Jewry, said Schlanger was the \"best of us\".\"This was a man who got up every morning with the purpose of doing good. That&#x27;s all he did,\" he said.\"He drove around, and he gave things to charity, and he fed the needy. And he visited prisoners in prisons. And he just lived to do good things.\"Corrective Services NSW Commissioner Gary McCahon said Schlanger was a \"valued member\" and was \"devoted to supporting others with compassion and dignity\".\"His loss will be felt by many. I extend my deepest condolences to his family, friends, colleagues, and the broader Jewish community during this immensely painful time,\" he said.Yaakov Levitan — rabbiYaakov Levitan was a rabbi, a father and an active member of the Jewish community who lost his life celebrating the first day of Hanukkah.He served as general manager of Chabad of Bondi, secretary of the Sydney Beth Din centre and a key figure in educational initiatives at the BINA Centre. He has been remembered as a \"profoundly beloved and active member of the Sydney Jewish community\" and the \"cornerstone of his family\".\"He was a man of quiet devotion, known for his kindness and tireless work in assisting others, including his commitment to distributing tefillin as a sacred act of service,\" according to a fundraising page set up to raise money for his family \"His senseless murder has left an irreplaceable void.\"Marika Pogany — lifelong volunteerMarika Pogany, who moved to Australia from the former Czechoslovakia in 1968, was sitting in the front row of the Hanukkah event when she was fatally shot.She became an Australian citizen in 1972 where she \"embraced her life as an Aussie from that point on\", her family said.The 82-year-old was a decade-long volunteer for Meals on Wheels and Coa Sydney, an organisation providing community services to elderly Jewish people.\"She had an extraordinary gift for connecting with people. Her kindness, laughter, and generosity left a lasting mark on everyone she met, and her incredible network of friends was a true reflection of the love and loyalty she inspired,\" her family said in a statement.\"Though she is gone, her light will continue to shine brightly through the family and friends who were so blessed to have her in their lives.\"She won an award for service to her community after she delivered more than 12,000 kosher meals.COA Sydney said she was the \"beating heart\" of the organisation and a \"source of warmth for thousands of people\". \"She lifted the room simply by being in it,\" the organisation said in a statement.\"She asked for nothing and gave everything. She showed us what true service looks like and she did it without fanfare and without ever wanting attention.\"We are shattered by her loss. Marika gave real love to this community and her impact runs deep.\"May all those that knew Marika and had the blessing to be touched by her, be comforted and consoled by the memories of a truly remarkable and wonderful woman.\" Her friends told 9News of decades of friendship, saying she was an \"amazing person\" and they were \"very fond of her\".Tibor Weitzen — great-grandfatherTibor Weitzen was a 78-year-old great-grandfather who had reportedly gone to the event to celebrate the first day of Hanukkah with his wife and grandchildren.He died shielding a family friend who also lost her life. His granddaughter told 9News her family is \"shattered\" by his death.\"Just devastating. Honestly, I&#x27;ve got no words,\" she said.\"And we were just yesterday with him. We had coffee at Bondi Junction with him yesterday. I didn&#x27;t know this was going to be, you know, the last day.\"Dan Elkayam — French engineerDan Elkayam was a 27-year-old engineer from France who had moved to Australia.His family said he was shot in the back while trying to escape the gunfire.\" He was murdered because he was Jewish,\" Elkayam&#x27;s family said.\"He leaves behind his partner in Australia, as well as his parents, brothers, nieces, and nephews in Paris, France, where he was born and raised.\"He was deeply proud of his community back home in Le Bourget.\"Elkayam&#x27;s family remembered him as someone who loved life \"fully and intensely\".\"He travelled the world and was known for his gentle, kind, fun and loving nature, making friends wherever he went,\" they said.\"Dan brought light wherever he went and inspired countless people through the way he lived. His smile could light up any room.\"He was pure joy - a beautiful and humble soul.\"French President Emmanuel Macron paid tribute to him after he was killed at Bondi and offered his thoughts to his family.\"It is with deep sadness that I learned of the death of our compatriot Dan Elkayam in the anti-Semitic terrorist attack in Sydney,\" he said in a statement on X.\"My thoughts are with his family and loved ones, and I express to them the full solidarity of the nation.\"French Foreign Minister Jean-Noel Barrot said the country was mourning with Elkayam, and described the shooting as \"despicable\".His partner, Krystal, is \"navigating profound grief while suddenly having to face life on her own\", according to a fundraising site set up by her friends.The fundraising site has raised almost $28,000 for her.The top donation was from the south Sydney football club Elkayam played for, Rockdale Ilinden Football Club, of $2500.Elkayam was a member and player for the team&#x27;s premier league one team.The club said it was in \" extreme shock and sadness\" over the \"horrendous, tragic and senseless events\".\"Dan was an integral member of our PL1 Squad in 2025, who was an extremely talented and popular figure amongst teammates,\" the club said.\"Our deepest and sincerest condolences to Dan&#x27;s family, friends and all that knew him. He will be missed.\"If you have been impacted by the terror attack in Bondi there is support available.To contact Lifeline Australia, call 13 11 14 or text 0477 13 11 14.For people under 25 years old, you can contact Kids Helpline at 1800 55 1800.Both of these are available on a 24/7 basis.If you wish to donate blood, you can find your nearest donor centre here.DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/c8d1e90d-b20f-46aa-8d9a-ff7e36e635f6"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/8230a2714669bc07f71a3660778ec050531539b8",
      "popularity_score": 2017.3122558333334
    },
    {
      "id": "cluster_32",
      "coverage": 2,
      "updated_at": "Sat, 20 Dec 2025 07:36:47 +1100",
      "title": "Seven men arrested by counter-terrorism police to take legal action",
      "neutral_headline": "Seven men arrested by counter-terrorism police to take legal action",
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/seven-men-arrested-by-counter-terrorism-police-to-take-legal-action-20251220-p5np68.html",
          "published_at": "Sat, 20 Dec 2025 07:36:47 +1100",
          "title": "Seven men arrested by counter-terrorism police to take legal action",
          "standfirst": "The seven men arrested by counter-terrorism police in Sydney’s south-west have said they plan to sue New South Wales police for damages.",
          "content": "The seven men arrested by counter-terrorism police in Sydney’s south-west have said they plan to sue New South Wales police for damages.",
          "feed_position": 10,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/2b269a35c4d137512222a27f560039ce5ebf21eb"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/seven-men-arrested-in-liverpool-in-sydney-could-soon-be-released-police-say/dc40cceb-111a-4dd3-aa67-44e4984e8658",
          "published_at": "Fri, 19 Dec 2025 08:16:08 +0000",
          "title": "Seven men arrested in Sydney car stops planning to sue NSW police",
          "standfirst": "Seven men who were arrested in a dramatic operation in Sydney&#x27;s south-west and released without charge plan to sue NSW Police for damages.",
          "content": "Seven men who were arrested yesterday after a dramatic operation in Sydney&#x27;s south-west and released today without charge plan to sue NSW Police for damages.Their lawyer Ahmed Dibb said the group, the youngest of whom was just 18, claim they were unfairly targeted and want to set a precedent that no other group receives the same treatment.Two of their cars were damaged after being rammed during the arrest on the corner of George and Campbell streets in Liverpool yesterday, but it is understood the lawsuit will go beyond that.READ MORE: Identity of mystery Bondi Beach hero revealed No filings have been lodged just yet.Police said in a statement yesterday they had received information that \"a violent act was possibly being planned\".\"As investigations continue, seven men are assisting police with their inquiries,\" NSW Police said yesterday.\"At this point in time, police have not identified any connection to the current police investigation of the Bondi terror attack.\"Speaking to reporters after their release, the men denied any wrongdoing, claiming that they arrived from Victoria two days ago for a holiday.The men told police they were on their way to a short-term rental before they were intercepted.Police lacked sufficient evidence to charge the men with any offences, and they were released earlier today.\"We didn&#x27;t do nothing wrong. There was nothing found on us,\" one of the men told reporters.\"Why are we here? If we got terrorism charges, I&#x27;d be locked up right now.\" DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 6,
          "image_url": "https://prod.static9.net.au/fs/f30b9641-7e1f-4723-91b0-30bb59638828"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/2b269a35c4d137512222a27f560039ce5ebf21eb",
      "popularity_score": 2017.283644722222
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 19:28:13 +0000",
      "title": "Two girls were separated from their dad at Bondi. It's a scene that is hard to forget",
      "neutral_headline": "Two girls were separated from their dad at Bondi. It's a scene that is hard to forget",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/nsw-bondi-beach-cafe-households-help-strangers-terror-attack/106154094",
          "published_at": "Fri, 19 Dec 2025 19:28:13 +0000",
          "title": "Two girls were separated from their dad at Bondi. It's a scene that is hard to forget",
          "standfirst": "These are the stories of everyday people who stepped up during dark times, and of a community coming together when two gunmen sought to tear them apart on December 14.",
          "content": "These are the stories of everyday people who stepped up during dark times, and of a community coming together when two gunmen sought to tear them apart on December 14.",
          "feed_position": 0
        }
      ],
      "popularity_score": 349.14086694444444
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 23:11:41 +0000",
      "title": "A family lost their son to suicide. Now they're working to prevent the death of another young man",
      "neutral_headline": "A family lost their son to suicide. Now they're working to prevent...",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/tyler-pask-firefighter-mens-mental-health-suicide-prevention-qld/106154520",
          "published_at": "Fri, 19 Dec 2025 23:11:41 +0000",
          "title": "A family lost their son to suicide. Now they're working to prevent the death of another young man",
          "standfirst": "Tyler Pask devoted his life to being an incredible father, selfless brother and a diligent emergency service worker for the Queensland Fire Department. Now his family is transforming their grief into encouraging other young men to access support for their mental health.",
          "content": "Tyler Pask devoted his life to being an incredible father, selfless brother and a diligent emergency service worker for the Queensland Fire Department. Now his family is transforming their grief into encouraging other young men to access support for their mental health.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.86531138888887
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 19:39:10 +0000",
      "title": "How the Bondi shooters got access to now-banned guns",
      "neutral_headline": "How the Bondi shooters got access to now-banned guns",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/how-the-bondi-shooters-got-access-to-now-banned-guns/106165084",
          "published_at": "Fri, 19 Dec 2025 19:39:10 +0000",
          "title": "How the Bondi shooters got access to now-banned guns",
          "standfirst": "With Australia's strict gun laws, how was Sajid Akram able to legally own the gun he was using to slaughter innocent people in Bondi on December 14?",
          "content": "With Australia's strict gun laws, how was Sajid Akram able to legally own the gun he was using to slaughter innocent people in Bondi on December 14?",
          "feed_position": 1
        }
      ],
      "popularity_score": 339.32336694444444
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 23:03:54 +0000",
      "title": "Passenger numbers fall short on $2.9 billion Western Sydney light rail line",
      "neutral_headline": "Passenger numbers fall short on $2.9 billion Western Sydney light rail line",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/passenger-numbers-fall-short-on-parramatta-light-rail/106157050",
          "published_at": "Fri, 19 Dec 2025 23:03:54 +0000",
          "title": "Passenger numbers fall short on $2.9 billion Western Sydney light rail line",
          "standfirst": "While rider numbers fell short of expectations in 2025, next year the number of trips taken on the Parramatta Light Rail is expected to double.",
          "content": "While rider numbers fell short of expectations in 2025, next year the number of trips taken on the Parramatta Light Rail is expected to double.",
          "feed_position": 2
        }
      ],
      "popularity_score": 338.73558916666667
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:54:33 +0000",
      "title": "Live: Hundreds of lifesavers hold silent vigil for Bondi victims",
      "neutral_headline": "Live: Hundreds of lifesavers hold silent vigil for Bondi victims",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/bondi-beach-shooting-terrorist-attack-live-blog-december-20/106165292",
          "published_at": "Fri, 19 Dec 2025 21:54:33 +0000",
          "title": "Live: Hundreds of lifesavers hold silent vigil for Bondi victims",
          "standfirst": "Hundreds of surf lifesavers have gathered on Bondi Beach to pay tribute to the victims of last Sunday's terrorist attack. Follow live.",
          "content": "Hundreds of surf lifesavers have gathered on Bondi Beach to pay tribute to the victims of last Sunday's terrorist attack. Follow live.",
          "feed_position": 3
        }
      ],
      "popularity_score": 331.5797558333333
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 18:00:00 +0000",
      "title": "Albanese not the only one facing a reckoning over Bondi terror",
      "neutral_headline": "Albanese not the only one facing a reckoning over Bondi terror",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/anthony-albanese-bondi-terror-attack-jewish-community-safety/106156710",
          "published_at": "Fri, 19 Dec 2025 18:00:00 +0000",
          "title": "Albanese not the only one facing a reckoning over Bondi terror",
          "standfirst": "While Albanese will forever struggle to shed the perception that he was too slow to recognise the threat to Australia's Jewish community — he is taking action.",
          "content": "While Albanese will forever struggle to shed the perception that he was too slow to recognise the threat to Australia's Jewish community — he is taking action.",
          "feed_position": 2
        }
      ],
      "popularity_score": 327.6705891666667
    },
    {
      "id": "cluster_10",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:32:28 +0000",
      "title": "How IS operates behind the scenes after link to Bondi attack",
      "neutral_headline": "How IS operates behind the scenes after link to Bondi attack",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/why-islamic-state-back-in-news-link-to-bondi-2026-attack/106165328",
          "published_at": "Fri, 19 Dec 2025 22:32:28 +0000",
          "title": "How IS operates behind the scenes after link to Bondi attack",
          "standfirst": "What is this group, which once ruled a territorial \"caliphate\" and inspired attacks all over the world?",
          "content": "What is this group, which once ruled a territorial \"caliphate\" and inspired attacks all over the world?",
          "feed_position": 4
        }
      ],
      "popularity_score": 312.21170027777777
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:04:59 +0000",
      "title": "Live: Clinton portraits, grocery lists published in partially released Epstein files",
      "neutral_headline": "Live: Clinton portraits, grocery lists published in partially released Epstein files",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/epstein-files-published-us-department-of-justice/105584914",
          "published_at": "Fri, 19 Dec 2025 21:04:59 +0000",
          "title": "Live: Clinton portraits, grocery lists published in partially released Epstein files",
          "standfirst": "A trove of documents about the investigation into sex offender Jeffrey Epstein and his co-conspirator, Ghislaine Maxwell, has been published. Follow live as we analyse the files and the fallout.",
          "content": "A trove of documents about the investigation into sex offender Jeffrey Epstein and his co-conspirator, Ghislaine Maxwell, has been published. Follow live as we analyse the files and the fallout.",
          "feed_position": 5
        }
      ],
      "popularity_score": 310.75364472222225
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 19:50:45 +0000",
      "title": "Extreme heat, humidity and storms ahead of Christmas Day",
      "neutral_headline": "Extreme heat, humidity and storms ahead of Christmas Day",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/bom-christmas-weather-forecast/106163070",
          "published_at": "Fri, 19 Dec 2025 19:50:45 +0000",
          "title": "Extreme heat, humidity and storms ahead of Christmas Day",
          "standfirst": "Australia is experiencing a smorgasbord of wild weather in the lead-up to Christmas, featuring extreme heat, humidity, severe thunderstorms, and tropical storms all on the cards.",
          "content": "Australia is experiencing a smorgasbord of wild weather in the lead-up to Christmas, featuring extreme heat, humidity, severe thunderstorms, and tropical storms all on the cards.",
          "feed_position": 6
        }
      ],
      "popularity_score": 289.5164225
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:44:54 +0000",
      "title": "US strikes dozens of IS targets in Syria, officials say",
      "neutral_headline": "US strikes dozens of IS targets in Syria, officials say",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/us-strikes-dozens-of-islamic-state-targets-in-syria/106165794",
          "published_at": "Fri, 19 Dec 2025 22:44:54 +0000",
          "title": "US strikes dozens of IS targets in Syria, officials say",
          "standfirst": "Described as \"a declaration of vengeance\" by US Defense Secretary Pete Hegseth, the strikes come after Donald Trump vowed retaliation for an attack on US personnel.",
          "content": "Described as \"a declaration of vengeance\" by US Defense Secretary Pete Hegseth, the strikes come after Donald Trump vowed retaliation for an attack on US personnel.",
          "feed_position": 7
        }
      ],
      "popularity_score": 282.4189225
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:01:59 +0000",
      "title": "Grace Tame fights against a legal loophole frustrating abuse survivors",
      "neutral_headline": "Grace Tame fights against a legal loophole frustrating abuse survivors",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/grace-tame-campaign-to-change-vicarious-liability-laws/106049438",
          "published_at": "Fri, 19 Dec 2025 20:01:59 +0000",
          "title": "Grace Tame fights against a legal loophole frustrating abuse survivors",
          "standfirst": "In every Australian state and the NT, churches cannot be held vicariously liable for historical child sexual abuse perpetrated by their priests. Grace Tame is leading the charge for change.",
          "content": "In every Australian state and the NT, churches cannot be held vicariously liable for historical child sexual abuse perpetrated by their priests. Grace Tame is leading the charge for change.",
          "feed_position": 9
        }
      ],
      "popularity_score": 259.70364472222224
    },
    {
      "id": "cluster_1",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 23:12:31 +0000",
      "title": "'Pretty smelly': Government faces questions over advertising spend",
      "neutral_headline": "'Pretty smelly': Government faces questions over advertising spend",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/tasmanian-government-pulse-advertising-spend-questioned/106165120",
          "published_at": "Fri, 19 Dec 2025 23:12:31 +0000",
          "title": "'Pretty smelly': Government faces questions over advertising spend",
          "standfirst": "The Tasmanian premier's department authorised more than $13,000 of taxpayer money to be spent with a local media organisation to promote the budget after the government asked for an election to be held, documents show.",
          "content": "The Tasmanian premier's department authorised more than $13,000 of taxpayer money to be spent with a local media organisation to promote the budget after the government asked for an election to be held, documents show.",
          "feed_position": 24
        }
      ],
      "popularity_score": 164.87920027777778
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:07:31 +0000",
      "title": "Regional town's residents 'at breaking point' amid end-of-year crime spike",
      "neutral_headline": "Regional town's residents 'at breaking point' amid end-of-year crime spike",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/murgon-crime-spike-leaves-residents-at-breaking-point/106146606",
          "published_at": "Fri, 19 Dec 2025 21:07:31 +0000",
          "title": "Regional town's residents 'at breaking point' amid end-of-year crime spike",
          "standfirst": "The crime rate spikes every year around the holidays, according to the police. Tensions are rising in the Murgon community, as residents say they don't feel safe in their homes.",
          "content": "The crime rate spikes every year around the holidays, according to the police. Tensions are rising in the Murgon community, as residents say they don't feel safe in their homes.",
          "feed_position": 17
        }
      ],
      "popularity_score": 160.79586694444444
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:41:51 +0000",
      "title": "How a desolate Scottish isle is providing a crucial Olympics resource",
      "neutral_headline": "How a desolate Scottish isle is providing a crucial Olympics resource",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/winter-olympics-2026-the-scottish-isle-used-for-curling/106165748",
          "published_at": "Fri, 19 Dec 2025 22:41:51 +0000",
          "title": "How a desolate Scottish isle is providing a crucial Olympics resource",
          "standfirst": "For all intents and purposes, Ailsa Craig looks like it has nothing to offer the human experience. But on its desolate shores, golden dreams are quietly being mined.",
          "content": "For all intents and purposes, Ailsa Craig looks like it has nothing to offer the human experience. But on its desolate shores, golden dreams are quietly being mined.",
          "feed_position": 11
        }
      ],
      "popularity_score": 152.36808916666666
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:35:28 +0000",
      "title": "Grace Lillian Lee weaves a path from the Torres Strait to Paris",
      "neutral_headline": "Grace Lillian Lee weaves a path from the Torres Strait to Paris",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/grace-lillian-lee-weaves-a-path-from-the-torres-strait-to-paris/106158378",
          "published_at": "Fri, 19 Dec 2025 22:35:28 +0000",
          "title": "Grace Lillian Lee weaves a path from the Torres Strait to Paris",
          "standfirst": "Lee's woven, wearable art creations have catapulted her from Cairns and the Torres Strait to Paris, a bustling textile mecca more than 15,000 kilometres away.",
          "content": "Lee's woven, wearable art creations have catapulted her from Cairns and the Torres Strait to Paris, a bustling textile mecca more than 15,000 kilometres away.",
          "feed_position": 23
        }
      ],
      "popularity_score": 152.26170027777778
    },
    {
      "id": "cluster_14",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:06:07 +0000",
      "title": "One in six Kimberley children infected with strep A, study finds",
      "neutral_headline": "One in six Kimberley children infected with strep A, study finds",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/west-australian-study-strep-a-findings-kimberley-broome-derby/106149204",
          "published_at": "Fri, 19 Dec 2025 22:06:07 +0000",
          "title": "One in six Kimberley children infected with strep A, study finds",
          "standfirst": "An infectious disease study hopes to see faster and earlier diagnosis of strep A to prevent chronic diseases in high-risk communities.",
          "content": "An infectious disease study hopes to see faster and earlier diagnosis of strep A to prevent chronic diseases in high-risk communities.",
          "feed_position": 20
        }
      ],
      "popularity_score": 151.7725336111111
    },
    {
      "id": "cluster_17",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:31:06 +0000",
      "title": "Dreams shattered as 140 Zone RV caravan customers' worst fears realised",
      "neutral_headline": "Dreams shattered as 140 Zone RV caravan customers' worst fears realised",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/dreams-shattered-as-zone-rv-caravan-customers-fears-realised/106165022",
          "published_at": "Fri, 19 Dec 2025 21:31:06 +0000",
          "title": "Dreams shattered as 140 Zone RV caravan customers' worst fears realised",
          "standfirst": "About 140 customers of Zone RV have been told they will not be receiving their caravans after the company collapsed.",
          "content": "About 140 customers of Zone RV have been told they will not be receiving their caravans after the company collapsed.",
          "feed_position": 16
        }
      ],
      "popularity_score": 151.1889225
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:09:14 +0000",
      "title": "Thousands of dollars in pay rises awarded to Queensland mayors and councillors",
      "neutral_headline": "Thousands of dollars in pay rises awarded to Queensland mayors and councillors",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/qld-mayors-councillors-pay-rise-local-government/106165038",
          "published_at": "Fri, 19 Dec 2025 21:09:14 +0000",
          "title": "Thousands of dollars in pay rises awarded to Queensland mayors and councillors",
          "standfirst": "The salary increases will see smaller council representatives given a 4.5 per cent pay rise, with 3.25 per cent raises on offer for larger council areas.",
          "content": "The salary increases will see smaller council representatives given a 4.5 per cent pay rise, with 3.25 per cent raises on offer for larger council areas.",
          "feed_position": 14
        }
      ],
      "popularity_score": 150.82447805555555
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:08:35 +0000",
      "title": "Former patients and families 'waiting for justice' after report into mental hospital",
      "neutral_headline": "Former patients and families 'waiting for justice' after report into mental hospital",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/wolston-park-mental-hospital-review-patients/106164118",
          "published_at": "Fri, 19 Dec 2025 21:08:35 +0000",
          "title": "Former patients and families 'waiting for justice' after report into mental hospital",
          "standfirst": "Brisbane's Wolston Park Mental Hospital closed in 2001, but a 12-month review has shed light on its history of sexual abuse and patient mistreatment.",
          "content": "Brisbane's Wolston Park Mental Hospital closed in 2001, but a 12-month review has shed light on its history of sexual abuse and patient mistreatment.",
          "feed_position": 17
        }
      ],
      "popularity_score": 150.81364472222222
    },
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:08:01 +0000",
      "title": "Cost-conscious Queensland family embraces the spirit of 'Thriftmas'",
      "neutral_headline": "Cost-conscious Queensland family embraces the spirit of 'Thriftmas'",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/queensland-family-prepares-for-second-hand-christmas/106155536",
          "published_at": "Fri, 19 Dec 2025 21:08:01 +0000",
          "title": "Cost-conscious Queensland family embraces the spirit of 'Thriftmas'",
          "standfirst": "Rising expenses across the festive season have driven a family of five in Brisbane to set a rule to only purchase Christmas presents from second-hand stores — and they've been pleasantly surprised by the treasures they've uncovered.",
          "content": "Rising expenses across the festive season have driven a family of five in Brisbane to set a rule to only purchase Christmas presents from second-hand stores — and they've been pleasantly surprised by the treasures they've uncovered.",
          "feed_position": 16
        }
      ],
      "popularity_score": 150.80420027777777
    },
    {
      "id": "cluster_25",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:58:54 +0000",
      "title": "Why this 'powerhouse' of women's Aussie Rules is at risk of folding",
      "neutral_headline": "Why this 'powerhouse' of women's Aussie Rules is at risk of folding",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/melbourne-university-womens-football-club-at-risk-of-folding/106098428",
          "published_at": "Fri, 19 Dec 2025 20:58:54 +0000",
          "title": "Why this 'powerhouse' of women's Aussie Rules is at risk of folding",
          "standfirst": "Melbourne University is the latest women’s Aussie Rules club fighting for survival, but it is hoping intervention from an AFL executive can turn the club’s fortunes around.",
          "content": "Melbourne University is the latest women’s Aussie Rules club fighting for survival, but it is hoping intervention from an AFL executive can turn the club’s fortunes around.",
          "feed_position": 10
        }
      ],
      "popularity_score": 150.65225583333333
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:50:36 +0000",
      "title": "'Why on Earth would we do it?': This scientist is trying to figure out kissing",
      "neutral_headline": "'Why on Earth would we do it?': This scientist is trying to figure out kissing",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/why-do-humans-kiss-has-scientists-puzzled/106162070",
          "published_at": "Fri, 19 Dec 2025 20:50:36 +0000",
          "title": "'Why on Earth would we do it?': This scientist is trying to figure out kissing",
          "standfirst": "Why is swapping saliva something all human societies have normalised? Turns out kissing isn't just a human thing — all sorts of species appear to kiss, and new research suggests Neanderthals did it too.",
          "content": "Why is swapping saliva something all human societies have normalised? Turns out kissing isn't just a human thing — all sorts of species appear to kiss, and new research suggests Neanderthals did it too.",
          "feed_position": 15
        }
      ],
      "popularity_score": 150.5139225
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:39:02 +0000",
      "title": "How to watch the Jake Paul and Anthony Joshua fight in Australia",
      "neutral_headline": "How to watch the Jake Paul and Anthony Joshua fight in Australia",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/jake-paul-and-anthony-joshua-fight-explainer/106165706",
          "published_at": "Fri, 19 Dec 2025 20:39:02 +0000",
          "title": "How to watch the Jake Paul and Anthony Joshua fight in Australia",
          "standfirst": "The controversial fight between Jake Paul and Anthony Joshua has finally arrived. Here's everything you need to know.",
          "content": "The controversial fight between Jake Paul and Anthony Joshua has finally arrived. Here's everything you need to know.",
          "feed_position": 21
        }
      ],
      "popularity_score": 150.32114472222221
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:32:13 +0000",
      "title": "Tobacco shop owner 'refuses to cooperate' with police despite shakedown sign",
      "neutral_headline": "Tobacco shop owner 'refuses to cooperate' with police despite shakedown sign",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/tobacco-shop-owner-refusing-to-cooperate-with-police-after-sign/106162026",
          "published_at": "Fri, 19 Dec 2025 20:32:13 +0000",
          "title": "Tobacco shop owner 'refuses to cooperate' with police despite shakedown sign",
          "standfirst": "Shop owners in the northern Victorian town of Swan Hill say they are concerned after a threatening note was left outside a store selling tobacco, demanding the owner \"contact the commission\".",
          "content": "Shop owners in the northern Victorian town of Swan Hill say they are concerned after a threatening note was left outside a store selling tobacco, demanding the owner \"contact the commission\".",
          "feed_position": 19
        }
      ],
      "popularity_score": 150.2075336111111
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:19:19 +0000",
      "title": "Records tumble as Heat pulls off stunning BBL run chase at the Gabba",
      "neutral_headline": "Records tumble as Heat pulls off stunning BBL run chase at the Gabba",
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-12-20/bbl-cricket-brisbane-heat-beat-perth-scorchers-in-stunning-chase/106165678",
          "published_at": "Fri, 19 Dec 2025 20:19:19 +0000",
          "title": "Records tumble as Heat pulls off stunning BBL run chase at the Gabba",
          "standfirst": "Matt Renshaw and Jack Wildermuth pull off one of the greatest run chases in T20 history in a stunning Big Bash match at the Gabba.",
          "content": "Matt Renshaw and Jack Wildermuth pull off one of the greatest run chases in T20 history in a stunning Big Bash match at the Gabba.",
          "feed_position": 23
        }
      ],
      "popularity_score": 149.9925336111111
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:14:37 +0000",
      "title": "Fight on to save these 'vacuum cleaners of the river' from extinction",
      "neutral_headline": "Fight on to save these 'vacuum cleaners of the river' from extinction",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/environmental-experts-fight-for-freshwater-turtle-conservation/106091598",
          "published_at": "Fri, 19 Dec 2025 20:14:37 +0000",
          "title": "Fight on to save these 'vacuum cleaners of the river' from extinction",
          "standfirst": "A team of environmental experts, Indigenous rangers and conservation detection dogs is working on recovering the population of native freshwater turtles.",
          "content": "A team of environmental experts, Indigenous rangers and conservation detection dogs is working on recovering the population of native freshwater turtles.",
          "feed_position": 18
        }
      ],
      "popularity_score": 149.91420027777778
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:12:35 +0000",
      "title": "Deaths of two Aboriginal brothers with disability reveals systemic failures",
      "neutral_headline": "Deaths of two Aboriginal brothers with disability reveals systemic failures",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/australian-aboriginal-men-coronial-alice-springs-hospital/106163524",
          "published_at": "Fri, 19 Dec 2025 20:12:35 +0000",
          "title": "Deaths of two Aboriginal brothers with disability reveals systemic failures",
          "standfirst": "The NT coroner makes nine recommendations following an inquest into the deaths of two disabled Aboriginal brothers who spent a number of years homeless in Alice Springs.",
          "content": "The NT coroner makes nine recommendations following an inquest into the deaths of two disabled Aboriginal brothers who spent a number of years homeless in Alice Springs.",
          "feed_position": 13
        }
      ],
      "popularity_score": 149.88031138888888
    },
    {
      "id": "cluster_16",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:47:31 +0000",
      "title": "Man burned in gin fire loses worker's comp case",
      "neutral_headline": "Man burned in gin fire loses worker's comp case",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/adams-distillery-fire-health-and-safety-case-dismissed/105728508",
          "published_at": "Fri, 19 Dec 2025 21:47:31 +0000",
          "title": "Man burned in gin fire loses worker's comp case",
          "standfirst": "A work health and safety case against a distillery in Perth, northern Tasmania, is dismissed.",
          "content": "A work health and safety case against a distillery in Perth, northern Tasmania, is dismissed.",
          "feed_position": 22
        }
      ],
      "popularity_score": 148.4625336111111
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 18:30:00 +0000",
      "title": "How 'half-brained' thieves snatched a $50m Picasso in under four minutes",
      "neutral_headline": "How 'half-brained' thieves snatched a $50m Picasso in under four minutes",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/today-in-history-picasso-art-heist-brazil-2007/106143440",
          "published_at": "Fri, 19 Dec 2025 18:30:00 +0000",
          "title": "How 'half-brained' thieves snatched a $50m Picasso in under four minutes",
          "standfirst": "The 2007 Brazilian heist was not the last time a nimble thief made off with a Picasso. And as many Melburnians know, it certainly wasn't the first.",
          "content": "The 2007 Brazilian heist was not the last time a nimble thief made off with a Picasso. And as many Melburnians know, it certainly wasn't the first.",
          "feed_position": 14
        }
      ],
      "popularity_score": 148.17058916666667
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:09:34 +0000",
      "title": "Parents grapple with Australia's social media ban",
      "neutral_headline": "Parents grapple with Australia's social media ban",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/social-media-ban-teenagers-parents-respond/106163362",
          "published_at": "Fri, 19 Dec 2025 21:09:34 +0000",
          "title": "Parents grapple with Australia's social media ban",
          "standfirst": "For some parents, the social media bans for under-16s have come as a relief. But others say they are fuelling conflict.",
          "content": "For some parents, the social media bans for under-16s have come as a relief. But others say they are fuelling conflict.",
          "feed_position": 12
        }
      ],
      "popularity_score": 147.8300336111111
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 15:14:36 +0000",
      "title": "Three people dead in Taipei Metro station stabbing attack",
      "neutral_headline": "Three people dead in Taipei Metro station stabbing attack",
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-12-20/taipei-metro-stabbing-attack-leaves-at-least-three-people-dead/106165504",
          "published_at": "Fri, 19 Dec 2025 15:14:36 +0000",
          "title": "Three people dead in Taipei Metro station stabbing attack",
          "standfirst": "The suspect is also dead after falling from a building during a police chase.",
          "content": "The suspect is also dead after falling from a building during a police chase.",
          "feed_position": 21
        }
      ],
      "popularity_score": 144.9139225
    }
  ]
}