{
  "updated_at": "2025-12-14T19:15:58.756Z",
  "clusters": [
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Sat, 13 Dec 2025 12:00:06 +0000",
      "title": "Sharks and rays gain landmark protections as nations move to curb international trade",
      "neutral_headline": "Sharks and rays gain landmark protections as nations move to curb international trade",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/sharks-and-rays-gain-landmark-protections-as-nations-move-to-curb-international-trade/",
          "published_at": "Sat, 13 Dec 2025 12:00:06 +0000",
          "title": "Sharks and rays gain landmark protections as nations move to curb international trade",
          "standfirst": "Gov'ts agree to ban or restrict international trade in shark meat, fins, and other products.",
          "content": "For the first time, global governments have agreed to widespread international trade bans and restrictions for sharks and rays being driven to extinction. Last week, more than 70 shark and ray species, including oceanic whitetip sharks, whale sharks, and manta rays, received new safeguards under the Convention on International Trade in Endangered Species of Wild Fauna and Flora. The convention, known as CITES, is a United Nations treaty that requires countries to regulate or prohibit international trade in species whose survival is threatened. Sharks and rays are closely related species that play similar roles as apex predators in the ocean, helping to maintain healthy marine ecosystems. They have been caught and traded for decades, contributing to a global market worth nearly $1 billion annually, according to Luke Warwick, director of shark and ray conservation at Wildlife Conservation Society (WCS), an international nonprofit dedicated to preserving animals and their habitats.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2227923861-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2227923861-1152x648.jpg",
      "popularity_score": 348
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 22:16:42 +0000",
      "title": "OpenAI built an AI coding agent and uses it to improve the agent itself",
      "neutral_headline": "OpenAI built an AI coding agent and uses it to improve the agent itself",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/how-openai-is-using-gpt-5-codex-to-improve-the-ai-tool-itself/",
          "published_at": "Fri, 12 Dec 2025 22:16:42 +0000",
          "title": "OpenAI built an AI coding agent and uses it to improve the agent itself",
          "standfirst": "\"The vast majority of Codex is built by Codex,\" OpenAI told us about its new AI coding agent.",
          "content": "With the popularity of AI coding tools rising among some software developers, their adoption has begun to touch every aspect of the process, including the improvement of AI coding tools themselves. In interviews with Ars Technica this week, OpenAI employees revealed the extent to which the company now relies on its own AI coding agent, Codex, to build and improve the development tool. “I think the vast majority of Codex is built by Codex, so it’s almost entirely just being used to improve itself,” said Alexander Embiricos, product lead for Codex at OpenAI, in a conversation on Tuesday. Codex, which OpenAI launched in its modern incarnation as a research preview in May 2025, operates as a cloud-based software engineering agent that can handle tasks like writing features, fixing bugs, and proposing pull requests. The tool runs in sandboxed environments linked to a user’s code repository and can execute multiple tasks in parallel. OpenAI offers Codex through ChatGPT’s web interface, a command-line interface (CLI), and IDE extensions for VS Code, Cursor, and Windsurf.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/AI_codehead_header-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/AI_codehead_header-1152x648.jpg",
      "popularity_score": 338
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 20:44:35 +0000",
      "title": "Google Translate expands live translation to all earbuds on Android",
      "neutral_headline": "Google Translate expands live translation to all earbuds on Android",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/12/google-translate-learns-slang-and-idioms-expands-live-translation-beyond-pixel-buds/",
          "published_at": "Fri, 12 Dec 2025 20:44:35 +0000",
          "title": "Google Translate expands live translation to all earbuds on Android",
          "standfirst": "Expanded live translation will come to iOS in the coming months.",
          "content": "Google has increasingly moved toward keeping features locked to its hardware products, but the Translate app is bucking that trend. The live translate feature is breaking out of the Google bubble with support for any earbuds you happen to have connected to your Android phone. The app is also getting improved translation quality across dozens of languages and some Duolingo-like learning features. The latest version of Google’s live translation is built on Gemini and initially rolled out earlier this year. It supports smooth back-and-forth translations as both on-screen text and audio. Beginning a live translate session in Google Translate used to require Pixel Buds, but that won’t be the case going forward. Google says a beta test of expanded headphone support is launching today in the US, Mexico, and India. The audio translation attempts to preserve the tone and cadence of the original speaker, but it’s not as capable as the full AI-reproduced voice translations you can do on the latest Pixel phones. Google says this feature should work on any earbuds or headphones, but it’s only for Android right now. The feature will expand to iOS in the coming months. Apple does have a similar live translation feature on the iPhone, but it requires AirPods.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Translate-app-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Translate-app-1152x648.jpg",
      "popularity_score": 315
    },
    {
      "id": "cluster_76",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 21:35:44 +0000",
      "title": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
      "neutral_headline": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/reminder-donate-to-win-swag-in-our-annual-charity-drive-sweepstakes-17/",
          "published_at": "Fri, 12 Dec 2025 21:35:44 +0000",
          "title": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
          "standfirst": "Help raise a charity haul that's already past $11,000 in just a couple of days.",
          "content": "If you’ve been too busy floating in your new WoW house to take part in this year’s Ars Technica Charity Drive sweepstakes, don’t worry. You still have time to donate to a good cause and get a chance to win your share of over $4,000 worth of swag (no purchase necessary to win). In the first two days or so of the drive, over 200 readers have contributed over $11,000 to either the Electronic Frontier Foundation or Child’s Play as part of the charity drive (Child’s Play has a roughly 60/40 donation lead at the moment). That’s still a long way off from 2020’s record haul of over $58,000, but there’s still plenty of time until the Charity Drive wraps up on Friday, January 2, 2026. That doesn’t mean you should put your donation off, though. Do yourself and the charities involved a favor and give now while you’re thinking about it.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/charitydrive2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/charitydrive2025-1152x648.jpg",
      "popularity_score": 313
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 19:49:27 +0000",
      "title": "Ukrainians sue US chip firms for powering Russian drones, missiles",
      "neutral_headline": "Ukrainians sue US chip firms for powering Russian drones, missiles",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/ukrainians-sue-us-chip-firms-for-powering-russian-drones-missiles/",
          "published_at": "Fri, 12 Dec 2025 19:49:27 +0000",
          "title": "Ukrainians sue US chip firms for powering Russian drones, missiles",
          "standfirst": "Lawsuits may force Intel, AMD, and Texas Instruments to do more to control chip supply chains.",
          "content": "Dozens of Ukrainian civilians filed a series of lawsuits in Texas this week, accusing some of the biggest US chip firms of negligently failing to track chips that evaded export curbs. Those chips were ultimately used to power Russian and Iranian weapon systems, causing wrongful deaths last year. Their complaints alleged that for years, Texas Instruments (TI), AMD, and Intel have ignored public reporting, government warnings, and shareholder pressure to do more to track final destinations of chips and shut down shady distribution channels diverting chips to sanctioned actors in Russia and Iran. Putting profits over human lives, tech firms continued using “high-risk” channels, Ukrainian civilians’ legal team alleged in a press statement, without ever strengthening controls.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2161674727-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2161674727-1024x648.jpg",
      "popularity_score": 308
    }
  ]
}