{
  "updated_at": "2025-12-27T19:15:48.710Z",
  "clusters": [
    {
      "id": "cluster_9",
      "coverage": 2,
      "updated_at": "Sat, 27 Dec 2025 15:51:08 +0000",
      "title": "NY Governor Hochul signs bill requiring warning labels on ‘addictive’ social media",
      "neutral_headline": "NY Governor Hochul signs bill requiring warning labels on ‘addictive’ social media",
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/27/ny-governor-hochul-signs-bill-requiring-warning-labels-on-addictive-social-media/",
          "published_at": "Sat, 27 Dec 2025 15:51:08 +0000",
          "title": "NY Governor Hochul signs bill requiring warning labels on ‘addictive’ social media",
          "standfirst": "New York Governor Kathy Hochul signed a bill requiring social media platforms to show warning labels to younger users before they’re exposed to features such as autoplay and infinite scrolling.",
          "content": "New York Governor Kathy Hochul signed a bill requiring social media platforms to show warning labels to younger users before they’re exposed to features such as autoplay and infinite scrolling.",
          "feed_position": 3
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/251226/p16#a251226p16",
          "published_at": "Fri, 26 Dec 2025 22:05:01 -0500",
          "title": "NY Gov. Kathy Hochul signs a law requiring social platforms with features like addictive feeds to show warning labels about mental health impacts on young users (Andre Revilla/Engadget)",
          "standfirst": "Andre Revilla / Engadget: NY Gov. Kathy Hochul signs a law requiring social platforms with features like addictive feeds to show warning labels about mental health impacts on young users &mdash; The warnings will appear when users interact with a feature the state deems addictive. &mdash; The State of New York &hellip;",
          "content": "Andre Revilla / Engadget: NY Gov. Kathy Hochul signs a law requiring social platforms with features like addictive feeds to show warning labels about mental health impacts on young users &mdash; The warnings will appear when users interact with a feature the state deems addictive. &mdash; The State of New York &hellip;",
          "feed_position": 7,
          "image_url": "http://www.techmeme.com/251226/i16.jpg"
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/251226/p12#a251226p12",
          "published_at": "Fri, 26 Dec 2025 16:15:00 -0500",
          "title": "Governor Hochul signs law for mental health warnings on addictive social media features (Felix Day/WRGB)",
          "standfirst": "Felix Day / WRGB: Governor Hochul signs law for mental health warnings on addictive social media features &mdash; New York (WRGB) &mdash; Governor Hochul has signed new legislation that will require social media platforms with certain addictive features to display warning labels alerting young users to potential mental health risks.",
          "content": "Felix Day / WRGB: Governor Hochul signs law for mental health warnings on addictive social media features &mdash; New York (WRGB) &mdash; Governor Hochul has signed new legislation that will require social media platforms with certain addictive features to display warning labels alerting young users to potential mental health risks.",
          "feed_position": 11,
          "image_url": "http://www.techmeme.com/251226/i12.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/251226/i16.jpg",
      "popularity_score": 2016.5886919444445
    },
    {
      "id": "cluster_36",
      "coverage": 2,
      "updated_at": "Fri, 26 Dec 2025 20:13:08 +0000",
      "title": "What we listened to in 2025",
      "neutral_headline": "What we listened to in 2025",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/entertainment/music/what-we-listened-to-in-2025-201308584.html",
          "published_at": "Fri, 26 Dec 2025 20:13:08 +0000",
          "title": "What we listened to in 2025",
          "standfirst": "If streaming services’ year-in-review campaigns have shown us anything, it’s that we’ve spent a staggering amount of time drowning out the hum of everyday life with music, podcasts and audio series. And with some incredible new releases this year, we were really eatin’ good. Here are some of the Engadget team’s favorite things we listened to in 2025.Spiritbox - Tsunami SeaI became aware of Spiritbox in late 2024 shortly before the band dropped its latest album, Tsunami Sea. At the time, I was in a deep Sleep Token phase, and I don’t remember how I stumbled upon Spiritbox, but I’m sure glad I did. Not knowing anything about the band, I initially thought it had two singers: one for clean vocals and another for the harsh, guttural screams. Well, I was wrong. Vocalist Courtney LaPlante handles it all, and she is a force of nature. After learning of a new band, I do what any self-respecting music nerd does: I looked up live videos of them on YouTube. The way LaPlante seamlessly transitions from airy, ambient singing to some of the best growls you’ll hear in metal music is effortless. And after seeing Spiritbox live in person earlier in December, I can attest to her ability to consistently nail both vocal styles for the entirety of an hour-long set. My infatuation with Spiritbox isn’t just with the vocalist though. Guitarist Mike Stringer, LaPlante’s husband, also has a lot of unique abilities to offer. Stringer’s use of noise and whammy effects in his riffs create a signature style, not to mention his mix of nu-metal, djent and metalcore sensibilities. He also has some of the thickest guitar tones I’ve ever heard live, and I was mesmerized for the full set. Stringer’s guitar work on Tsunami Sea is a prime example of a unique musician at the height of his powers. Tsunami Sea takes you on a ride. The first two tracks are all-out ragers, and after a slight respite in “Perfect Soul” and “Keep Sweet,” the album’s best song comes fifth. I’ve heard LaPlante dedicate it to “all the people I love to fucking hate,” and it’s clearly written about her enemies. It’s also the perfect example of what this band is capable of. It’s three minutes of LaPlante’s screams interlaced with plenty of Stringer’s trademark guitar work. The rest of the album showcases the band’s ability to blend dynamics, with “No Loss, No Love” and “Ride The Wave” providing the highlights on the back half of the record. The album’s title track is a great vehicle for LaPlante’s clean vocals, serving as the introduction to the album’s second act. If you’ve been enamored with Sleep Token this year like I have, give Spiritbox a go — you won’t be sorry you did. — Billy Steele, Deputy Editor, ReviewsBandsplainI didn’t discover Bandsplain in 2025, but I definitely listened to it more than any other podcast in terms of total time spent. Sure, that’s because most episodes are over three hours long, but I digress. Host Yasi Salek does a deep dive on “cult bands and iconic artists” to… ahem, bandsplain why people love them. There’s a deep catalog of back episodes, so there’s sure to be an in-depth analysis of a band you’re familiar with. But even if you think you know an artist, I’m willing to bet Salek will divulge parts of the story you weren’t aware of. Jimmy Eat World’s Clarity is a top 5 all-timer for me, and Salek had plenty to offer about the narrative around that album I didn’t know. Her grunge series from 2024 was a history lesson I wish I’d had in middle school when I first discovered Soundgarden, Pearl Jam, Alice in Chains and the rest of the lot. An older episode about Nine Inch Nails served as the primer for me seeing the band live for the first time in September. And that’s the thing about the show: the back catalog holds up. If you’re waiting for the next installment to drop, there’s certainly something in the archives you’ll enjoy. No shade to Salek’s colleagues at The Ringer, but the best episodes of Bandsplain are when the guest is a musician. Thursday front man Geoff Rickly was excellent on that Nine Inch Nails episode, and Death Cab for Cutie singer Ben Gibbard had me on the edge of my seat when he was on to discuss The La’s — a band I’d never heard of before. I’d also highly recommend the episodes on Oasis and the more recent one on Alanis Morissette. But, really, you can’t go wrong starting from anywhere on the episode list. — B.S.Lucy Dacus - Forever is a Feeling I remember being a teenager and hearing from an adult that they did not religiously seek out, research, evaluate and introduce new bands and songs into their lives as if all existence would cease without the life-sustaining energy of new music. I was confused, concerned and damn sure that wouldn’t happen to me. You know where this story goes: Job. Kid. House. Spouse. Pets that will die if I don’t feed, walk, play with and/or medicate them. I allow the algorithm to feed me new songs but rarely does something stick, so I end up listening to tracks I bonded with in my teens and twenties. This year, Blossom & Bones, a three-day music festival in Ghost Ranch, New Mexico, managed to push through the churn and lodge new music into my brain. Along with my kid and some friends, I camped among some of the most beautiful landscapes imaginable and ambled over to the stage each evening for performances by Santigold, Ani DiFranco and about a dozen more. Lucy Dacus, one third of the indie group Boygenius, did a one-hour set with plenty of songs from her latest album Forever is a Feeling. Hearing the songs for the first time, I felt like I’d been listening to them for years. Lilting harmonies and layered strings create a lovely backdrop for Dacus’s velvet voice, but there’s a sharpness to her observations about relationships, rejection and sex. I’ve been looping the album ever since. — Amy Skorheim, Senior Reporter, Buying AdviceBlanco White - “So Certain” (single)Early on the last concert of the day at that same festival, Blanco White took the stage. People were aimlessly milling about and the sun hadn’t yet set. Kids were playing on the lawn and the smell from the food trucks was intense, but I was enrapt by the four people on stage. The sad violin and strummy guitars floated with the hand-beat drum out into the red hills. The music sounded like I felt: rooted and wrapped in the harsh beauty of the desert and I was really glad to take that home with me. — A.S.Martian Revolution If you're as big a nerd as I am, you might know that Leo Tolstoy didn't consider War and Peace to be a novel. The story is what most people read for, but in the author's mind, all the drama was a parable to illustrate his grand theory of history.Over the last year, history podcaster Mike Duncan has accomplished a similar feat using a medium Tolstoy never imagined. Duncan's Revolutions podcast has covered ten different revolutionary upheavals across history, starting with the English Civil War and ending with the Russian Revolution. After wrapping up the Bolsheviks, Duncan took a few episodes to suggest a grand theory of how revolutions unfold. For a while, it seemed like that was all we'd get. Then, in the middle of 2024, he started posting original sci-fi — without any indication that this tale, which followed future Martians revolting against their corporate overlords on Earth, was in any way different from the previous ten seasons.Part of what makes the Martian Revolution so excellent is Duncan's deadpan delivery. He never once breaks character. He rattles off lists of fictional sources, apologizes for inaccuracies in prior episodes, and introduces made-up historical figures with the same gravity he once used to mention George Washington or Simon Bolivar. If you're a fan of Revolutions, you'll have a blast recognizing character archetypes. (Mabel Dore is the Liberal Noble! Timothy Werner is the Man of Blood!)But the podcast is great even if you've never listened to an episode of Revolutions. It has an excellent grasp of character and a sense of inevitable tragedy, but with moments of joy leavened throughout. I certainly hope we don't wind up in the megacorp-ruled future of the podcast, but if we do, it'll be a great consolation if it eventually turns out the way Duncan imagines. — Sam Chapman, Senior WriterRon Gallo - Checkmate My favorite artists are ones that surprise me, and Ron Gallo is a master of reinvention. He's dabbled in absurdist punk, psychedelia, garage rock, Beatles-tinged pop and, now, stripped-down acoustic music. This is not a genre I am typically a fan of, Elliott Smith withstanding, but Checkmate is something special. His lyrical prowess is off the charts here, trading his usual wordplay for simple and emotionally-gutting truisms about life, love and, well, the end of the world. Of course, the lyrics wouldn't work if the songs weren't good. The songs are very good. The title track is just about the perfect love song, with a primary hook that gets lost in your head for weeks. Other tracks offer hints of Mac DeMarco, Dan Fogelberg, Kevin Morby and just about everyone else who has crafted great songs on an acoustic guitar. It's fitting that Gallo has found a home on the label Kill Rock Stars, which released so much of Elliott Smith's work back in the day. As an aside, Gallo regularly posts songs about current events on TikTok and other social media platforms, which are worth checking out if you like stuff like Jesse Welles. — Lawrence Bonk, Contributing ReporterDe La Soul - Cabin in the SkyThere have been hip-hop albums that explored the finality and tragedy of death, but not many that truly tackled spirituality and long-term grief. De La Soul has done just that, following the passing of founding member Trugoy the Dove. This album serves as a final testament of sorts for Trugoy, as he's heavily featured throughout. In that way, Cabin in the Sky is reminiscent of A Tribe Called Quest's 2016 masterpiece We Got It from Here... Thank You 4 Your Service, which followed the death of rapper Phife Dawg. Like Tribe's modern classic, Cabin in the Sky is filled with absolute bangers. It features standout beats by DJ Premier, Pete Rock, Trugoy, Jake One and others. The rhymes are great and all three primary De La members are given time to shine. Guest rappers like Common and Nas got the memo, delivering some of their most memorable verses in years. Heck, even Giancarlo Esposito is on board as the narrator. Some reviewers have dinged this album for being too long but, come on, that's like complaining there's too much pizza. It's De La Soul. — L.B.FKA twigs - EusexuaThis was a really good year for new music IMO, so much that I've been finding it pretty difficult to think back and settle on my favorite releases. But, FKA twigs' Eusexua undeniably did some heavy lifting for me, pretty much carrying me through the first six or so months of the year without much competition, and I've circled right back to it as the year closes. It's an album that somehow seems to meet every vibe. It'll have you in club mode and ready for a night of sweaty, filthy dancing in under three minutes, or feeling bright and upbeat like a midday walk on the first day of spring — yet it still hits when you're having a good ol' car cry. \"Girl Feels Good\" is for sure one of my most-played songs of the year, followed closely by \"Eusexua,\" \"Perfect Stranger,\" \"Keep It, Hold It\" and \"Striptease.\" If ever I can't decide what I'm in the mood to listen to, I throw this album on and it doesn't disappoint. — Cheyenne MacDonald, Weekend EditorFaetooth - Labyrinthine Faetooth's sophomore album, Labyrinthine, is face-melting, melancholic perfection. The band describes its sound as \"fairy doom,\" but don't let that first word fool you into thinking it isn't heavy as hell. Labyrinthine goes unbelievably hard, and will have you feeling like you're eternally wandering a cursed bog, surrounded by the wailing of the unfortunate souls who came before you. Don't believe me? Put on \"White Noise.\" This is really an album that should be enjoyed in its entirety, though, and I can't individually name half the songs on it because I tend to just keep the whole thing playing on rotation. — C.M. Orville Peck - Appaloosa This EP is truly a testament to my ability to run my obsessions into the ground, because it only came out in mid-November and somehow landed on my most-listened wrapup for the end of the year… which was released some two weeks later. It's front-loaded with its strongest songs, a powerful and kind of haunting trio that just flows beautifully from one into the other: \"Dreaded Sundown,\" to \"Drift Away\" into \"Atchafalaya\" (ft. Noah Cyrus). As a fan of musicals, I also loved the inclusion of \"Maybe This Time,\" a cover from Cabaret, especially since I was pretty bummed to have missed Peck's stint as the Emcee in Cabaret on Broadway this summer. — C.M.Case 63 I got into an audio series kick this year, and dove into shows like Unicorn Girl, Stalked! and more. But none of the dramatized fiction I listened to in 2025 had me hooked like Case 63. Setting aside that it’s voice-acted by A-listers Julianne Moore and Oscar Isaac, which is a phenomenal pairing that won me over on star power alone. The best thing about Case 63 is its storytelling. Moore stars as a psychologist, meeting Isaac for the first time in a prison interview. Isaac has been claiming to be a traveler of sorts, and through recorded sessions and voice notes, we hear his side of the story, as well as her reactions and ultimate involvement in the adventures. Every step of the way, particularly in the beginning, there is clear explanation as to why the exchange is being recorded. It isn’t necessary, but it’s helpful in my buying into the realism of the story. It isn’t just the method and technical aspects of the storytelling, of course. Narratively, Case 63 is a gripping ride, and thanks to its short episodes, it’s easy to binge really quickly. There is certainly a generous use of cliffhangers to help speed things along, but I found myself eager to devour the entire series in one commute. The story continued to linger in my mind days after I finished both existing seasons, and I’m hoping the new one drops soon. If you’re looking for a quick and easy sci-fi audio series, do not miss Case 63. — Cherlynn Low, Managing EditorSecure Love I spent a lot of time this year trying to learn more about my attachment style and how it shows up in all the relationships in my life. Between Stephanie Rigg’s On Attachment podcast, the TV show Couples Therapy and all the books on the topic of attachment styles, trauma and more, I’ve consumed them all. And while they’ve all been helpful in different ways, one podcast stuck out to me this year. It’s hosted by Julie Menanno, MA, LMFT, LCPC, creator of the @TheSecureRelationship account on Instagram and the author of Secure Love: Create a relationship that lasts a lifetime. You can probably tell from that introduction what Menanno’s work is all about. Relationships, from the lens of attachment styles. The Secure Love Podcast doesn’t just re-deliver the same information we’ve seen published across various media and platforms, though. Each season of the podcast (it’s partway through the second as of this writing) sees Menanno work with one couple through their negative cycles, using somatic practices to help each partner understand their emotions, triggers and reactions. Because we’re listening to real people talk about real-life happenings, it’s not only easy to relate, but listeners often see themselves in these scenarios. At the start of each episode, too, Menanno reads out or plays notes from the audience, and you can see how fellow listeners have reacted. This season, for example, my friend and some other listeners seemed to really dislike Brian, the anxious male partner in this season’s pair. While I’ve certainly found some of Brian’s ways of speaking borderline offensive, I had a lot more sympathy for him as I started seeing his traits in my loved ones. I also started to identify with his partner Bethany, who Menanno typed as having an avoidant attachment style. As I listened to Bethany and Brian describe the reasons they got into fights and explain where they were coming from, suddenly it felt like the world made sense. I saw similar patterns and reasonings in my own relationship, as well as those of my parents, relatives and friends. It is slightly voyeuristic to listen to something so intimate, of course, but Menanno makes it all educational rather than just entertaining. She gently interrupts parts of each episode to tell the audience why she asks certain questions or what she’s attempting to achieve by asking Brian or Bethany to sit with their difficult feelings. I found her method familiar, as I recently started working with a somatic coach whose approach is similar to Menanno’s, which is rooted in emotion-focused therapy (EFT). Staying with uncomfortable feelings makes me want to jump out of my skin, but being able to endure them, question why they arise and then understand where they come from is crucial to helping uncover the thinking that causes them. Sometimes they’re the result of flawed logic, catastrophic thinking or a simple lack of context, but often they’re very reasonable reactions. If you’re looking to understand yourself and your emotions a bit better, or just want to get an idea of what EFT or couples therapy sounds like, I can’t recommend The Secure Love Podcast highly enough. — C.L.This article originally appeared on Engadget at https://www.engadget.com/entertainment/music/what-we-listened-to-in-2025-201308584.html?src=rss",
          "content": "If streaming services’ year-in-review campaigns have shown us anything, it’s that we’ve spent a staggering amount of time drowning out the hum of everyday life with music, podcasts and audio series. And with some incredible new releases this year, we were really eatin’ good. Here are some of the Engadget team’s favorite things we listened to in 2025.Spiritbox - Tsunami SeaI became aware of Spiritbox in late 2024 shortly before the band dropped its latest album, Tsunami Sea. At the time, I was in a deep Sleep Token phase, and I don’t remember how I stumbled upon Spiritbox, but I’m sure glad I did. Not knowing anything about the band, I initially thought it had two singers: one for clean vocals and another for the harsh, guttural screams. Well, I was wrong. Vocalist Courtney LaPlante handles it all, and she is a force of nature. After learning of a new band, I do what any self-respecting music nerd does: I looked up live videos of them on YouTube. The way LaPlante seamlessly transitions from airy, ambient singing to some of the best growls you’ll hear in metal music is effortless. And after seeing Spiritbox live in person earlier in December, I can attest to her ability to consistently nail both vocal styles for the entirety of an hour-long set. My infatuation with Spiritbox isn’t just with the vocalist though. Guitarist Mike Stringer, LaPlante’s husband, also has a lot of unique abilities to offer. Stringer’s use of noise and whammy effects in his riffs create a signature style, not to mention his mix of nu-metal, djent and metalcore sensibilities. He also has some of the thickest guitar tones I’ve ever heard live, and I was mesmerized for the full set. Stringer’s guitar work on Tsunami Sea is a prime example of a unique musician at the height of his powers. Tsunami Sea takes you on a ride. The first two tracks are all-out ragers, and after a slight respite in “Perfect Soul” and “Keep Sweet,” the album’s best song comes fifth. I’ve heard LaPlante dedicate it to “all the people I love to fucking hate,” and it’s clearly written about her enemies. It’s also the perfect example of what this band is capable of. It’s three minutes of LaPlante’s screams interlaced with plenty of Stringer’s trademark guitar work. The rest of the album showcases the band’s ability to blend dynamics, with “No Loss, No Love” and “Ride The Wave” providing the highlights on the back half of the record. The album’s title track is a great vehicle for LaPlante’s clean vocals, serving as the introduction to the album’s second act. If you’ve been enamored with Sleep Token this year like I have, give Spiritbox a go — you won’t be sorry you did. — Billy Steele, Deputy Editor, ReviewsBandsplainI didn’t discover Bandsplain in 2025, but I definitely listened to it more than any other podcast in terms of total time spent. Sure, that’s because most episodes are over three hours long, but I digress. Host Yasi Salek does a deep dive on “cult bands and iconic artists” to… ahem, bandsplain why people love them. There’s a deep catalog of back episodes, so there’s sure to be an in-depth analysis of a band you’re familiar with. But even if you think you know an artist, I’m willing to bet Salek will divulge parts of the story you weren’t aware of. Jimmy Eat World’s Clarity is a top 5 all-timer for me, and Salek had plenty to offer about the narrative around that album I didn’t know. Her grunge series from 2024 was a history lesson I wish I’d had in middle school when I first discovered Soundgarden, Pearl Jam, Alice in Chains and the rest of the lot. An older episode about Nine Inch Nails served as the primer for me seeing the band live for the first time in September. And that’s the thing about the show: the back catalog holds up. If you’re waiting for the next installment to drop, there’s certainly something in the archives you’ll enjoy. No shade to Salek’s colleagues at The Ringer, but the best episodes of Bandsplain are when the guest is a musician. Thursday front man Geoff Rickly was excellent on that Nine Inch Nails episode, and Death Cab for Cutie singer Ben Gibbard had me on the edge of my seat when he was on to discuss The La’s — a band I’d never heard of before. I’d also highly recommend the episodes on Oasis and the more recent one on Alanis Morissette. But, really, you can’t go wrong starting from anywhere on the episode list. — B.S.Lucy Dacus - Forever is a Feeling I remember being a teenager and hearing from an adult that they did not religiously seek out, research, evaluate and introduce new bands and songs into their lives as if all existence would cease without the life-sustaining energy of new music. I was confused, concerned and damn sure that wouldn’t happen to me. You know where this story goes: Job. Kid. House. Spouse. Pets that will die if I don’t feed, walk, play with and/or medicate them. I allow the algorithm to feed me new songs but rarely does something stick, so I end up listening to tracks I bonded with in my teens and twenties. This year, Blossom & Bones, a three-day music festival in Ghost Ranch, New Mexico, managed to push through the churn and lodge new music into my brain. Along with my kid and some friends, I camped among some of the most beautiful landscapes imaginable and ambled over to the stage each evening for performances by Santigold, Ani DiFranco and about a dozen more. Lucy Dacus, one third of the indie group Boygenius, did a one-hour set with plenty of songs from her latest album Forever is a Feeling. Hearing the songs for the first time, I felt like I’d been listening to them for years. Lilting harmonies and layered strings create a lovely backdrop for Dacus’s velvet voice, but there’s a sharpness to her observations about relationships, rejection and sex. I’ve been looping the album ever since. — Amy Skorheim, Senior Reporter, Buying AdviceBlanco White - “So Certain” (single)Early on the last concert of the day at that same festival, Blanco White took the stage. People were aimlessly milling about and the sun hadn’t yet set. Kids were playing on the lawn and the smell from the food trucks was intense, but I was enrapt by the four people on stage. The sad violin and strummy guitars floated with the hand-beat drum out into the red hills. The music sounded like I felt: rooted and wrapped in the harsh beauty of the desert and I was really glad to take that home with me. — A.S.Martian Revolution If you're as big a nerd as I am, you might know that Leo Tolstoy didn't consider War and Peace to be a novel. The story is what most people read for, but in the author's mind, all the drama was a parable to illustrate his grand theory of history.Over the last year, history podcaster Mike Duncan has accomplished a similar feat using a medium Tolstoy never imagined. Duncan's Revolutions podcast has covered ten different revolutionary upheavals across history, starting with the English Civil War and ending with the Russian Revolution. After wrapping up the Bolsheviks, Duncan took a few episodes to suggest a grand theory of how revolutions unfold. For a while, it seemed like that was all we'd get. Then, in the middle of 2024, he started posting original sci-fi — without any indication that this tale, which followed future Martians revolting against their corporate overlords on Earth, was in any way different from the previous ten seasons.Part of what makes the Martian Revolution so excellent is Duncan's deadpan delivery. He never once breaks character. He rattles off lists of fictional sources, apologizes for inaccuracies in prior episodes, and introduces made-up historical figures with the same gravity he once used to mention George Washington or Simon Bolivar. If you're a fan of Revolutions, you'll have a blast recognizing character archetypes. (Mabel Dore is the Liberal Noble! Timothy Werner is the Man of Blood!)But the podcast is great even if you've never listened to an episode of Revolutions. It has an excellent grasp of character and a sense of inevitable tragedy, but with moments of joy leavened throughout. I certainly hope we don't wind up in the megacorp-ruled future of the podcast, but if we do, it'll be a great consolation if it eventually turns out the way Duncan imagines. — Sam Chapman, Senior WriterRon Gallo - Checkmate My favorite artists are ones that surprise me, and Ron Gallo is a master of reinvention. He's dabbled in absurdist punk, psychedelia, garage rock, Beatles-tinged pop and, now, stripped-down acoustic music. This is not a genre I am typically a fan of, Elliott Smith withstanding, but Checkmate is something special. His lyrical prowess is off the charts here, trading his usual wordplay for simple and emotionally-gutting truisms about life, love and, well, the end of the world. Of course, the lyrics wouldn't work if the songs weren't good. The songs are very good. The title track is just about the perfect love song, with a primary hook that gets lost in your head for weeks. Other tracks offer hints of Mac DeMarco, Dan Fogelberg, Kevin Morby and just about everyone else who has crafted great songs on an acoustic guitar. It's fitting that Gallo has found a home on the label Kill Rock Stars, which released so much of Elliott Smith's work back in the day. As an aside, Gallo regularly posts songs about current events on TikTok and other social media platforms, which are worth checking out if you like stuff like Jesse Welles. — Lawrence Bonk, Contributing ReporterDe La Soul - Cabin in the SkyThere have been hip-hop albums that explored the finality and tragedy of death, but not many that truly tackled spirituality and long-term grief. De La Soul has done just that, following the passing of founding member Trugoy the Dove. This album serves as a final testament of sorts for Trugoy, as he's heavily featured throughout. In that way, Cabin in the Sky is reminiscent of A Tribe Called Quest's 2016 masterpiece We Got It from Here... Thank You 4 Your Service, which followed the death of rapper Phife Dawg. Like Tribe's modern classic, Cabin in the Sky is filled with absolute bangers. It features standout beats by DJ Premier, Pete Rock, Trugoy, Jake One and others. The rhymes are great and all three primary De La members are given time to shine. Guest rappers like Common and Nas got the memo, delivering some of their most memorable verses in years. Heck, even Giancarlo Esposito is on board as the narrator. Some reviewers have dinged this album for being too long but, come on, that's like complaining there's too much pizza. It's De La Soul. — L.B.FKA twigs - EusexuaThis was a really good year for new music IMO, so much that I've been finding it pretty difficult to think back and settle on my favorite releases. But, FKA twigs' Eusexua undeniably did some heavy lifting for me, pretty much carrying me through the first six or so months of the year without much competition, and I've circled right back to it as the year closes. It's an album that somehow seems to meet every vibe. It'll have you in club mode and ready for a night of sweaty, filthy dancing in under three minutes, or feeling bright and upbeat like a midday walk on the first day of spring — yet it still hits when you're having a good ol' car cry. \"Girl Feels Good\" is for sure one of my most-played songs of the year, followed closely by \"Eusexua,\" \"Perfect Stranger,\" \"Keep It, Hold It\" and \"Striptease.\" If ever I can't decide what I'm in the mood to listen to, I throw this album on and it doesn't disappoint. — Cheyenne MacDonald, Weekend EditorFaetooth - Labyrinthine Faetooth's sophomore album, Labyrinthine, is face-melting, melancholic perfection. The band describes its sound as \"fairy doom,\" but don't let that first word fool you into thinking it isn't heavy as hell. Labyrinthine goes unbelievably hard, and will have you feeling like you're eternally wandering a cursed bog, surrounded by the wailing of the unfortunate souls who came before you. Don't believe me? Put on \"White Noise.\" This is really an album that should be enjoyed in its entirety, though, and I can't individually name half the songs on it because I tend to just keep the whole thing playing on rotation. — C.M. Orville Peck - Appaloosa This EP is truly a testament to my ability to run my obsessions into the ground, because it only came out in mid-November and somehow landed on my most-listened wrapup for the end of the year… which was released some two weeks later. It's front-loaded with its strongest songs, a powerful and kind of haunting trio that just flows beautifully from one into the other: \"Dreaded Sundown,\" to \"Drift Away\" into \"Atchafalaya\" (ft. Noah Cyrus). As a fan of musicals, I also loved the inclusion of \"Maybe This Time,\" a cover from Cabaret, especially since I was pretty bummed to have missed Peck's stint as the Emcee in Cabaret on Broadway this summer. — C.M.Case 63 I got into an audio series kick this year, and dove into shows like Unicorn Girl, Stalked! and more. But none of the dramatized fiction I listened to in 2025 had me hooked like Case 63. Setting aside that it’s voice-acted by A-listers Julianne Moore and Oscar Isaac, which is a phenomenal pairing that won me over on star power alone. The best thing about Case 63 is its storytelling. Moore stars as a psychologist, meeting Isaac for the first time in a prison interview. Isaac has been claiming to be a traveler of sorts, and through recorded sessions and voice notes, we hear his side of the story, as well as her reactions and ultimate involvement in the adventures. Every step of the way, particularly in the beginning, there is clear explanation as to why the exchange is being recorded. It isn’t necessary, but it’s helpful in my buying into the realism of the story. It isn’t just the method and technical aspects of the storytelling, of course. Narratively, Case 63 is a gripping ride, and thanks to its short episodes, it’s easy to binge really quickly. There is certainly a generous use of cliffhangers to help speed things along, but I found myself eager to devour the entire series in one commute. The story continued to linger in my mind days after I finished both existing seasons, and I’m hoping the new one drops soon. If you’re looking for a quick and easy sci-fi audio series, do not miss Case 63. — Cherlynn Low, Managing EditorSecure Love I spent a lot of time this year trying to learn more about my attachment style and how it shows up in all the relationships in my life. Between Stephanie Rigg’s On Attachment podcast, the TV show Couples Therapy and all the books on the topic of attachment styles, trauma and more, I’ve consumed them all. And while they’ve all been helpful in different ways, one podcast stuck out to me this year. It’s hosted by Julie Menanno, MA, LMFT, LCPC, creator of the @TheSecureRelationship account on Instagram and the author of Secure Love: Create a relationship that lasts a lifetime. You can probably tell from that introduction what Menanno’s work is all about. Relationships, from the lens of attachment styles. The Secure Love Podcast doesn’t just re-deliver the same information we’ve seen published across various media and platforms, though. Each season of the podcast (it’s partway through the second as of this writing) sees Menanno work with one couple through their negative cycles, using somatic practices to help each partner understand their emotions, triggers and reactions. Because we’re listening to real people talk about real-life happenings, it’s not only easy to relate, but listeners often see themselves in these scenarios. At the start of each episode, too, Menanno reads out or plays notes from the audience, and you can see how fellow listeners have reacted. This season, for example, my friend and some other listeners seemed to really dislike Brian, the anxious male partner in this season’s pair. While I’ve certainly found some of Brian’s ways of speaking borderline offensive, I had a lot more sympathy for him as I started seeing his traits in my loved ones. I also started to identify with his partner Bethany, who Menanno typed as having an avoidant attachment style. As I listened to Bethany and Brian describe the reasons they got into fights and explain where they were coming from, suddenly it felt like the world made sense. I saw similar patterns and reasonings in my own relationship, as well as those of my parents, relatives and friends. It is slightly voyeuristic to listen to something so intimate, of course, but Menanno makes it all educational rather than just entertaining. She gently interrupts parts of each episode to tell the audience why she asks certain questions or what she’s attempting to achieve by asking Brian or Bethany to sit with their difficult feelings. I found her method familiar, as I recently started working with a somatic coach whose approach is similar to Menanno’s, which is rooted in emotion-focused therapy (EFT). Staying with uncomfortable feelings makes me want to jump out of my skin, but being able to endure them, question why they arise and then understand where they come from is crucial to helping uncover the thinking that causes them. Sometimes they’re the result of flawed logic, catastrophic thinking or a simple lack of context, but often they’re very reasonable reactions. If you’re looking to understand yourself and your emotions a bit better, or just want to get an idea of what EFT or couples therapy sounds like, I can’t recommend The Secure Love Podcast highly enough. — C.L.This article originally appeared on Engadget at https://www.engadget.com/entertainment/music/what-we-listened-to-in-2025-201308584.html?src=rss",
          "feed_position": 2
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/accessories/best-ipad-accessories-130018595.html",
          "published_at": "Fri, 26 Dec 2025 17:01:27 +0000",
          "title": "The best iPad accessories for 2026",
          "standfirst": "The best iPad accessories can make an aging tablet feel like new again, or give you additional ways to use that new slab you just bought. Whether it's a slim folio case, an Apple Pencil, a docking station or a paper-like screen protector, there are so many iPad accessories out there that can transform how you use your tablet on a regular basis — and make your iPad last longer, too. We've tested a plethora of accessories over the years, and these are the best iPad accessories you can get right now. Table of contents Which iPad generation do you own? iPad cases iPad stands and docks iPad keyboards and mice iPad stylus iPad chargers iPad screen protectors Which iPad generation do you own? Before you splurge on a bunch of accessories, you should double check which iPad generation you own. There are a couple of ways to do this: first, you can check the back of your tablet for its model number, which will start with an “A” and end with a series of numbers. You can also go into Settings on your iPad, then General and look up the model number in the top section. If you see a series of letters and numbers with a slash (“/“) in it, just tap that to reveal the iPad’s true model number. The most important iPad details to consider before buying accessories are the charging port, screen size and Apple Pencil compatibility. Most iPads now have USB-C charging, save for the now discontinued 9th-gen iPad that still requires a Lightning cable. Make sure to double check your iPad’s screen size before buying a folio for iPad or a screen protector — especially if you have the new iPad Air 11-inch. As for the Apple Pencil, check out this guide to how to choose the right Apple Pencil (and even replacement pencil tips) to make sure you're getting the right one for the tablet you have. Best iPad accessories for 2026 iPad cases iPad stands and docks iPad keyboards and mice iPad stylus iPad chargers iPad screen protectors If you’re a heavy user of the Apple Pencil or some other stylus, you should consider getting a screen protector for your new iPad. They pull double-duty: Not only do they act as a first line of defense if your iPad goes careening onto concrete, but they can also enhance the digital drawing and writing experience. Using a stylus on an iPad is strange at first because gliding the stylus nib over a glass surface feels nothing like “normal” writing. Matte screen protectors can get closer to replicating the pen-on-paper experience, and they also prevent the stylus nib from wearing down as quickly. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-ipad-accessories-130018595.html?src=rss",
          "content": "The best iPad accessories can make an aging tablet feel like new again, or give you additional ways to use that new slab you just bought. Whether it's a slim folio case, an Apple Pencil, a docking station or a paper-like screen protector, there are so many iPad accessories out there that can transform how you use your tablet on a regular basis — and make your iPad last longer, too. We've tested a plethora of accessories over the years, and these are the best iPad accessories you can get right now. Table of contents Which iPad generation do you own? iPad cases iPad stands and docks iPad keyboards and mice iPad stylus iPad chargers iPad screen protectors Which iPad generation do you own? Before you splurge on a bunch of accessories, you should double check which iPad generation you own. There are a couple of ways to do this: first, you can check the back of your tablet for its model number, which will start with an “A” and end with a series of numbers. You can also go into Settings on your iPad, then General and look up the model number in the top section. If you see a series of letters and numbers with a slash (“/“) in it, just tap that to reveal the iPad’s true model number. The most important iPad details to consider before buying accessories are the charging port, screen size and Apple Pencil compatibility. Most iPads now have USB-C charging, save for the now discontinued 9th-gen iPad that still requires a Lightning cable. Make sure to double check your iPad’s screen size before buying a folio for iPad or a screen protector — especially if you have the new iPad Air 11-inch. As for the Apple Pencil, check out this guide to how to choose the right Apple Pencil (and even replacement pencil tips) to make sure you're getting the right one for the tablet you have. Best iPad accessories for 2026 iPad cases iPad stands and docks iPad keyboards and mice iPad stylus iPad chargers iPad screen protectors If you’re a heavy user of the Apple Pencil or some other stylus, you should consider getting a screen protector for your new iPad. They pull double-duty: Not only do they act as a first line of defense if your iPad goes careening onto concrete, but they can also enhance the digital drawing and writing experience. Using a stylus on an iPad is strange at first because gliding the stylus nib over a glass surface feels nothing like “normal” writing. Matte screen protectors can get closer to replicating the pen-on-paper experience, and they also prevent the stylus nib from wearing down as quickly. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-ipad-accessories-130018595.html?src=rss",
          "feed_position": 3
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/entertainment/our-favorite-books-we-read-in-2025-160000704.html",
          "published_at": "Fri, 26 Dec 2025 16:00:00 +0000",
          "title": "Our favorite books we read in 2025",
          "standfirst": "This was the kind of year that felt 100 years long, so who could blame us for leaning into a bit of escapism? Some of us buried our noses in books in 2025, and thankfully, there were plenty of good reads to get lost in. Here are some of the Engadget team’s top picks from the year.Wild Dark Shore by Charlotte McConaghyWild Dark Shore pulls off a magnificent balancing act of telling an intimate, personal story coupled with the backdrop of impending climate disaster. A father and three children are living on a remote island near Antarctica, taking care of a vast seed bank that was part of an abandoned research facility. They’re literally trying to stay above water for a few months until they get bailed out from the island along with as much of the seed bank as they can save before it goes under when a woman named Rowan washes up on shore. She survives, is nursed back to health, and starts forming bonds with her rescuers and their mission — but at the same time, she has some unexpected connections to the island and the former research team that lived there that she keeps to herself.The magic of this book is in the way Charlotte McConaghy builds tensions from many sources throughout the book; you feel a lingering sense of discomfort through, waiting for the other shoe to fall even as Rowan gets closer and closer to the family. It’s a small-scale story at its heart, but with the backdrop of disaster looming the stakes feel extremely high. And McConaghy is a master at putting these feelings on the page in gorgeous prose. As she showed in her previous work Migrations, she has a real talent for realistically describing near-future climate disasters, but Wild Dark Shore raises the personal stakes in a visceral way. — Nathan Ingraham, Deputy EditorMoonflow by Bitter Karella This book is a chaotic and deeply weird rollercoaster ride that repeatedly gave me whiplash, and I loved it. Fair warning, it's not for the weak-stomached. It is horrifying, hilarious, nauseating and somehow a very good time and a very bad time simultaneously. Moonflow is told through dual narratives, one following Sarah, a trans woman and mushroom dealer who has found herself in a desperate situation, and the other following the henchwomen of a deranged cult that's made its home in a cursed forest. After Sarah ventures into these woods in search of the King's Breakfast, a rare mushroom said to grant divine understanding to those who consume it, all hell breaks loose.Karella's writing is immersive, and this is the kind of book you can see, feel, hear and smell, for better and worse. Every person in this book is like a caricature of someone I've crossed paths with at some point in life, and the names of the cult members are just… chef's kiss. Some of them had me howling. It is completely unpredictable — except in those few moments where it seems the author wants you to know exactly where things are going just to make you dread the inevitable. Reading Moonflow was a visceral, unforgettable experience. — Cheyenne MacDonald, Weekend EditorSimplicity by Mattie LubchanskyAnother one about a cult, except this cult rules. I picked up Simplicity knowing nothing about it except that everyone cool on the internet seemed to be praising it, and was excited to discover that it's set near where I live in New York's Hudson Valley, in a future version of the Catskills. And here in the Hudson Valley, it often feels like I'm one or two innocuous decisions away from accidentally joining a cult, so there was an immediate connection. In Simplicity, it's the year 2081 and New York City is a high-tech dystopia run by a billionaire. North of the city, though, various communities have settled off-grid, including a group called The Spiritual Association of Peers.Lucius Pasternak, a trans man, is sent on an anthropological assignment from the mayor to SAP's compound, Simplicity, and it doesn't take long for their uninhibited way of life to start growing on him. But Lucius soon begins to have strange dreams, and a series of violent attacks shakes up the community. Through his mission to understand the people of SAP and later to find and stop the entity that's targeting them, a beautiful story about queerness and identity and belonging and fighting for what's important unfolds. This feels like the kind of book that should be passed around between friends who just get it, and I imagine many readers will feel incredibly seen by it like I did. — C.M. The Buffalo Hunter Hunter by Stephen Graham JonesOr Stephen Graham Jones' Interview with the Vampire. The Buffalo Hunter Hunter blends historical fiction and horror to give us one of the most impactful vampire novels of our time — one that serves as an uncomfortable but necessary reminder of the atrocities committed against indigenous people in the US by white settlers. It begins with the discovery of a crumbling journal that claims to contain the confession of a Blackfeet man-turned-vampire named Good Stab, as told to Lutheran pastor Arthur Beaucarne. What follows is a gutting chronicle of slaughter, heartbreak and revenge. It's a classic in the making. — C.M.Isola by Allegra GoodmanHistorical fiction is how I trick my brain into possibly learning something. And because the endings are set, the author has to hook you into the drama with more than just the peril of an unknown outcome. I fell deep into Wolf Hall even though I knew which heads Henry VIII chopped off. I thought Isola might be similarly gratifying. It tells the story of Marguerite de la Rocque de Roberval, a young noblewoman from France who was intentionally marooned on an island off the coast of Canada in 1542. The story is based on historical records so you know the plot won’t adhere to safe formulas, but mon dieu, I was not prepared for how rough things would be for Marguerite. Her troubles began long before she found herself fighting for survival on a wild uninhabited island with brutal winters. From birth, nearly every happiness was undercut by more dominant forces, yet the woman never stopped moving forward. Thankfully, Goodman draws Marguerite’s character not as some tired brand of plucky heroine with grit and a wink, but as a perceptive, pragmatic being who also gives in to impulse and doesn’t have everything figured out. Isola is beautifully rendered, from the stone chateaus to creaking ships and rough abundance of the island. Despite being set over 400 years ago, nothing feels dated. Human versus universe is an unfair battle, but I rooted for Marguerite on every page — and those pages turned quickly. — Amy Skorheim, Senior Reporter, Buying AdviceOld Soul by Susan BarkerThis was one of the first books I read this year, and it's really stuck with me. Old Soul travels through time and all over the world, across multiple storylines to trace the devastating impact of one mysterious woman who seems to defy the rules of mortality and always leave tragedy in her wake. Barker's writing in Old Soul pulls the reader in and doesn't let go. It's an unsettling slow burn that did a great job of getting under my skin. — C.M.Meet Me at the Crossroads by Megan GiddingsIf a door appeared out of nowhere, would you go through it not knowing what lies beyond or if you'd be able to return? In Meet Me at the Crossroads, seven doors pop up one day around the world, and people are unsurprisingly captivated by them. Regular people tempt fate, the ultra-wealthy plan exclusive excursions through them, religions form around their mystique. Ayanna is a teenager who was brought up in one of these religions. She's also a twin, with a sister named Olivia who she's been separated from after their parents' split. When it comes time for Ayanna to go through one of the doors as part of a ceremony, Olivia makes a last-second decision to go with her. What follows is the aftermath of that decision. Meet Me at the Crossroads is a haunting and emotional journey. — C.M.Woodworking by Emily St. JamesI am a cisgender, white middle-aged man, so the experience of learning and accepting a different gender identity is something I will never fully understand. But Woodworking, the debut novel by Emily St. James, is a hilarious, tragic and ultimately hopeful look at two trans women navigating different moments of acceptance in their lives. Erica is a mid-30s high school teacher who is recently divorced and just figuring out that she’s trans, something no one else knows about her at the start. Her student, 17-year-old Abigail, is her opposite: proudly out about her identity in a way that’s uncommon and dangerous in her small, conversative town in South Dakota. Their paths intersect, and Abigail ends up in the uncomfortable and somewhat unethical role of helping Erica find herself. After all she’s confident and not afraid of who she is — but she’s also still a teenager, one dealing with massive trauma of her own. The dual look into these two protagonists, each with sections of the book narrated from their own points of view, gave me a vivid picture of the different challenges, emotions and dangers trans people face. But the unexpected community that develops around both characters plainly shows the value of living as your true self in a way that (hopefully) anyone should be able to relate to. — N.I.This article originally appeared on Engadget at https://www.engadget.com/entertainment/our-favorite-books-we-read-in-2025-160000704.html?src=rss",
          "content": "This was the kind of year that felt 100 years long, so who could blame us for leaning into a bit of escapism? Some of us buried our noses in books in 2025, and thankfully, there were plenty of good reads to get lost in. Here are some of the Engadget team’s top picks from the year.Wild Dark Shore by Charlotte McConaghyWild Dark Shore pulls off a magnificent balancing act of telling an intimate, personal story coupled with the backdrop of impending climate disaster. A father and three children are living on a remote island near Antarctica, taking care of a vast seed bank that was part of an abandoned research facility. They’re literally trying to stay above water for a few months until they get bailed out from the island along with as much of the seed bank as they can save before it goes under when a woman named Rowan washes up on shore. She survives, is nursed back to health, and starts forming bonds with her rescuers and their mission — but at the same time, she has some unexpected connections to the island and the former research team that lived there that she keeps to herself.The magic of this book is in the way Charlotte McConaghy builds tensions from many sources throughout the book; you feel a lingering sense of discomfort through, waiting for the other shoe to fall even as Rowan gets closer and closer to the family. It’s a small-scale story at its heart, but with the backdrop of disaster looming the stakes feel extremely high. And McConaghy is a master at putting these feelings on the page in gorgeous prose. As she showed in her previous work Migrations, she has a real talent for realistically describing near-future climate disasters, but Wild Dark Shore raises the personal stakes in a visceral way. — Nathan Ingraham, Deputy EditorMoonflow by Bitter Karella This book is a chaotic and deeply weird rollercoaster ride that repeatedly gave me whiplash, and I loved it. Fair warning, it's not for the weak-stomached. It is horrifying, hilarious, nauseating and somehow a very good time and a very bad time simultaneously. Moonflow is told through dual narratives, one following Sarah, a trans woman and mushroom dealer who has found herself in a desperate situation, and the other following the henchwomen of a deranged cult that's made its home in a cursed forest. After Sarah ventures into these woods in search of the King's Breakfast, a rare mushroom said to grant divine understanding to those who consume it, all hell breaks loose.Karella's writing is immersive, and this is the kind of book you can see, feel, hear and smell, for better and worse. Every person in this book is like a caricature of someone I've crossed paths with at some point in life, and the names of the cult members are just… chef's kiss. Some of them had me howling. It is completely unpredictable — except in those few moments where it seems the author wants you to know exactly where things are going just to make you dread the inevitable. Reading Moonflow was a visceral, unforgettable experience. — Cheyenne MacDonald, Weekend EditorSimplicity by Mattie LubchanskyAnother one about a cult, except this cult rules. I picked up Simplicity knowing nothing about it except that everyone cool on the internet seemed to be praising it, and was excited to discover that it's set near where I live in New York's Hudson Valley, in a future version of the Catskills. And here in the Hudson Valley, it often feels like I'm one or two innocuous decisions away from accidentally joining a cult, so there was an immediate connection. In Simplicity, it's the year 2081 and New York City is a high-tech dystopia run by a billionaire. North of the city, though, various communities have settled off-grid, including a group called The Spiritual Association of Peers.Lucius Pasternak, a trans man, is sent on an anthropological assignment from the mayor to SAP's compound, Simplicity, and it doesn't take long for their uninhibited way of life to start growing on him. But Lucius soon begins to have strange dreams, and a series of violent attacks shakes up the community. Through his mission to understand the people of SAP and later to find and stop the entity that's targeting them, a beautiful story about queerness and identity and belonging and fighting for what's important unfolds. This feels like the kind of book that should be passed around between friends who just get it, and I imagine many readers will feel incredibly seen by it like I did. — C.M. The Buffalo Hunter Hunter by Stephen Graham JonesOr Stephen Graham Jones' Interview with the Vampire. The Buffalo Hunter Hunter blends historical fiction and horror to give us one of the most impactful vampire novels of our time — one that serves as an uncomfortable but necessary reminder of the atrocities committed against indigenous people in the US by white settlers. It begins with the discovery of a crumbling journal that claims to contain the confession of a Blackfeet man-turned-vampire named Good Stab, as told to Lutheran pastor Arthur Beaucarne. What follows is a gutting chronicle of slaughter, heartbreak and revenge. It's a classic in the making. — C.M.Isola by Allegra GoodmanHistorical fiction is how I trick my brain into possibly learning something. And because the endings are set, the author has to hook you into the drama with more than just the peril of an unknown outcome. I fell deep into Wolf Hall even though I knew which heads Henry VIII chopped off. I thought Isola might be similarly gratifying. It tells the story of Marguerite de la Rocque de Roberval, a young noblewoman from France who was intentionally marooned on an island off the coast of Canada in 1542. The story is based on historical records so you know the plot won’t adhere to safe formulas, but mon dieu, I was not prepared for how rough things would be for Marguerite. Her troubles began long before she found herself fighting for survival on a wild uninhabited island with brutal winters. From birth, nearly every happiness was undercut by more dominant forces, yet the woman never stopped moving forward. Thankfully, Goodman draws Marguerite’s character not as some tired brand of plucky heroine with grit and a wink, but as a perceptive, pragmatic being who also gives in to impulse and doesn’t have everything figured out. Isola is beautifully rendered, from the stone chateaus to creaking ships and rough abundance of the island. Despite being set over 400 years ago, nothing feels dated. Human versus universe is an unfair battle, but I rooted for Marguerite on every page — and those pages turned quickly. — Amy Skorheim, Senior Reporter, Buying AdviceOld Soul by Susan BarkerThis was one of the first books I read this year, and it's really stuck with me. Old Soul travels through time and all over the world, across multiple storylines to trace the devastating impact of one mysterious woman who seems to defy the rules of mortality and always leave tragedy in her wake. Barker's writing in Old Soul pulls the reader in and doesn't let go. It's an unsettling slow burn that did a great job of getting under my skin. — C.M.Meet Me at the Crossroads by Megan GiddingsIf a door appeared out of nowhere, would you go through it not knowing what lies beyond or if you'd be able to return? In Meet Me at the Crossroads, seven doors pop up one day around the world, and people are unsurprisingly captivated by them. Regular people tempt fate, the ultra-wealthy plan exclusive excursions through them, religions form around their mystique. Ayanna is a teenager who was brought up in one of these religions. She's also a twin, with a sister named Olivia who she's been separated from after their parents' split. When it comes time for Ayanna to go through one of the doors as part of a ceremony, Olivia makes a last-second decision to go with her. What follows is the aftermath of that decision. Meet Me at the Crossroads is a haunting and emotional journey. — C.M.Woodworking by Emily St. JamesI am a cisgender, white middle-aged man, so the experience of learning and accepting a different gender identity is something I will never fully understand. But Woodworking, the debut novel by Emily St. James, is a hilarious, tragic and ultimately hopeful look at two trans women navigating different moments of acceptance in their lives. Erica is a mid-30s high school teacher who is recently divorced and just figuring out that she’s trans, something no one else knows about her at the start. Her student, 17-year-old Abigail, is her opposite: proudly out about her identity in a way that’s uncommon and dangerous in her small, conversative town in South Dakota. Their paths intersect, and Abigail ends up in the uncomfortable and somewhat unethical role of helping Erica find herself. After all she’s confident and not afraid of who she is — but she’s also still a teenager, one dealing with massive trauma of her own. The dual look into these two protagonists, each with sections of the book narrated from their own points of view, gave me a vivid picture of the different challenges, emotions and dangers trans people face. But the unexpected community that develops around both characters plainly shows the value of living as your true self in a way that (hopefully) anyone should be able to relate to. — N.I.This article originally appeared on Engadget at https://www.engadget.com/entertainment/our-favorite-books-we-read-in-2025-160000704.html?src=rss",
          "feed_position": 6
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/headphones/how-to-find-lost-airpods-120000144.html",
          "published_at": "Fri, 26 Dec 2025 12:00:00 +0000",
          "title": "How to find lost AirPods",
          "standfirst": "Losing AirPods happens to the best of us. They’re small, they slide into couch cushions and they love disappearing into bags or pockets when you least expect it. Luckily, Apple’s Find My system makes it easy to track down misplaced AirPods, whether you dropped the case somewhere or can’t find one of the individual earbuds. With the right settings enabled, your iPhone can show the last place they were connected, play a sound to help you hunt them down or even guide you with on-screen directions. Here’s how to use Find My to locate lost AirPods and how to track down the left or right earbud if only one has gone missing.How to use Find My to locate AirPodsIf your AirPods are paired with an Apple device linked to your Apple ID, they automatically appear in the Find My app. You don’t need to enable this manually, but you do need Bluetooth turned on during regular use so the system can refresh their location.Open the Find My app on your iPhone, iPad or Mac and go to the Devices tab. Your AirPods should appear in the list. If they’re online or recently connected to your device, Find My will show their current location on a map. If they’re offline, the app will show the last place they were detected, which can help narrow down where to start searching.For many people, this alone is enough to jog a memory. Find My might show your gym, a friend’s house or the bus stop where they slipped out of your pocket. If the location seems familiar, head there first and refresh the app once you arrive so it can update if the AirPods reconnect.If Find My says your AirPods are nearby but you still can’t see them, you can make them play a locating sound. Tap Play Sound in the device menu and the earbuds will emit a rising chirp that gets louder over a few seconds. This is especially helpful for finding AirPods hiding under blankets, inside bags or behind furniture.Keep in mind that AirPods need enough battery to make noise, and the charging case itself cannot play sound unless you have AirPods 4 (ANC), AirPods Pro 2, or AirPods Pro 3 that support that feature. If nothing plays, try refreshing the app or checking the last location again.AirPods models, like the AirPods Pro (2nd gen) and AirPods Pro (3rd gen) with MagSafe charging cases support Precision Finding. This feature uses the U1 chip inside your iPhone to show a directional arrow, distance estimate and haptic feedback as you get closer. Not all models have this feature, but if yours do, the Find My app will display a Find Nearby button.Follow the on-screen prompts and slowly rotate your phone. The iPhone will show when you’re walking in the right direction and tell you when you’re close enough to start looking under cushions or inside drawers.How to locate individual AirPodsAirPods have a habit of separating from each other, and losing only the left or right earbud may happen as frequently as misplacing the entire case. One of the most useful features in Find My is the ability to track each earbud individually. Here’s how to do it:Locate your AirPods in the Find My app and select the option to locate the Left or Right earbud.Select the earbud that’s missing. The map will update to show its location. If the missing bud has nearby location support, you can use Find Nearby to get directional guidance. If not, you can still use Play Sound, as long as it has enough battery.If Find My shows your lost earbud as Offline, you’ll still see its last known location. This can be enough to help you retrace your steps. Once you get within Bluetooth range again, the status may change to Online and let you use Play Sound.If you think the earbud is still somewhere in your home, try refreshing Find My while walking slowly from room to room. The device may reconnect once you get close enough.How to find a missing AirPods caseFinding the AirPods case is a little trickier because only newer models have support for sound playback or Precision Finding. If your case supports Find My, you’ll see options similar to locating the earbuds themselves. If it doesn’t, the app will only show the last place the case was connected.If your earbuds are in the case but the case is not supported by Find My, you may not be able to play sound until you open it or pull one of the earbuds out.Find My is a powerful tool for tracking down misplaced AirPods, and knowing how to use all of its features makes the search much easier. Whether you’re trying to find the entire set, one stray earbud or a case that wandered off, the app can lead you back to them with sound alerts, location markers and even directional guidance on supported models. With a few minutes of searching, you’ll usually have your AirPods back in your ears and your music playing again.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/how-to-find-lost-airpods-120000144.html?src=rss",
          "content": "Losing AirPods happens to the best of us. They’re small, they slide into couch cushions and they love disappearing into bags or pockets when you least expect it. Luckily, Apple’s Find My system makes it easy to track down misplaced AirPods, whether you dropped the case somewhere or can’t find one of the individual earbuds. With the right settings enabled, your iPhone can show the last place they were connected, play a sound to help you hunt them down or even guide you with on-screen directions. Here’s how to use Find My to locate lost AirPods and how to track down the left or right earbud if only one has gone missing.How to use Find My to locate AirPodsIf your AirPods are paired with an Apple device linked to your Apple ID, they automatically appear in the Find My app. You don’t need to enable this manually, but you do need Bluetooth turned on during regular use so the system can refresh their location.Open the Find My app on your iPhone, iPad or Mac and go to the Devices tab. Your AirPods should appear in the list. If they’re online or recently connected to your device, Find My will show their current location on a map. If they’re offline, the app will show the last place they were detected, which can help narrow down where to start searching.For many people, this alone is enough to jog a memory. Find My might show your gym, a friend’s house or the bus stop where they slipped out of your pocket. If the location seems familiar, head there first and refresh the app once you arrive so it can update if the AirPods reconnect.If Find My says your AirPods are nearby but you still can’t see them, you can make them play a locating sound. Tap Play Sound in the device menu and the earbuds will emit a rising chirp that gets louder over a few seconds. This is especially helpful for finding AirPods hiding under blankets, inside bags or behind furniture.Keep in mind that AirPods need enough battery to make noise, and the charging case itself cannot play sound unless you have AirPods 4 (ANC), AirPods Pro 2, or AirPods Pro 3 that support that feature. If nothing plays, try refreshing the app or checking the last location again.AirPods models, like the AirPods Pro (2nd gen) and AirPods Pro (3rd gen) with MagSafe charging cases support Precision Finding. This feature uses the U1 chip inside your iPhone to show a directional arrow, distance estimate and haptic feedback as you get closer. Not all models have this feature, but if yours do, the Find My app will display a Find Nearby button.Follow the on-screen prompts and slowly rotate your phone. The iPhone will show when you’re walking in the right direction and tell you when you’re close enough to start looking under cushions or inside drawers.How to locate individual AirPodsAirPods have a habit of separating from each other, and losing only the left or right earbud may happen as frequently as misplacing the entire case. One of the most useful features in Find My is the ability to track each earbud individually. Here’s how to do it:Locate your AirPods in the Find My app and select the option to locate the Left or Right earbud.Select the earbud that’s missing. The map will update to show its location. If the missing bud has nearby location support, you can use Find Nearby to get directional guidance. If not, you can still use Play Sound, as long as it has enough battery.If Find My shows your lost earbud as Offline, you’ll still see its last known location. This can be enough to help you retrace your steps. Once you get within Bluetooth range again, the status may change to Online and let you use Play Sound.If you think the earbud is still somewhere in your home, try refreshing Find My while walking slowly from room to room. The device may reconnect once you get close enough.How to find a missing AirPods caseFinding the AirPods case is a little trickier because only newer models have support for sound playback or Precision Finding. If your case supports Find My, you’ll see options similar to locating the earbuds themselves. If it doesn’t, the app will only show the last place the case was connected.If your earbuds are in the case but the case is not supported by Find My, you may not be able to play sound until you open it or pull one of the earbuds out.Find My is a powerful tool for tracking down misplaced AirPods, and knowing how to use all of its features makes the search much easier. Whether you’re trying to find the entire set, one stray earbud or a case that wandered off, the app can lead you back to them with sound alerts, location markers and even directional guidance on supported models. With a few minutes of searching, you’ll usually have your AirPods back in your ears and your music playing again.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/how-to-find-lost-airpods-120000144.html?src=rss",
          "feed_position": 9
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/playstation/best-ssd-for-ps5-130004175.html",
          "published_at": "Fri, 26 Dec 2025 10:00:35 +0000",
          "title": "The best SSDs for PS5 in 2026",
          "standfirst": "Storage fills up fast on a PS5, especially when a single game can take up as much space as an entire last-gen library. Adding moreSSD space is the easiest way to stop playing Tetris with your installs, and once it is set up, your console loads games just as quickly as it does from the built-in drive. It is a small upgrade that makes a big difference if you jump between several titles at once.The tricky part is knowing which SSDs actually work with the PS5. You need a drive that meets Sony’s speed requirements and stays cool under long play sessions. Some models include a heatsink, while others let you use your own to save a little money. We tested the top options and picked the best SSDs for PS5 to help you upgrade without hassle.Read more: These are the best SSDs in 2026 Table of contents Best SSDs for PS5 in 2026 How we test PS5 SSDs PS5 SSD FAQs Best SSDs for PS5 in 2026 How we test PS5 SSDs I’ve tested most of the SSDs recommended on this list, either for PS5 or computer use. I also bought and used our top pick in my own PS5. PS5 SSD FAQs How much PS5 storage do I need? The PlayStation 5 and PlayStation 5 Pro can accept internal drives with between 250GB and 8TB of storage capacity. If you already own a PS5, chances are you have a reasonable idea of how much storage you need ​​for your game library. If you’re buying an SSD with a new PS5 or PS5 Pro, or buying for someone else, it’s more difficult to tell what you might need for a high-performance experience. PS5 games are smaller on average than their PS4 equivalents, typically taking up between 30GB and 100GB, with some notable (and very popular) exceptions. If you’re a fan of the Call of Duty series, installing Black Ops 6 and Warzone 2.0 can eat up to 240GB. In other words, a full Call of Duty install will take up more than one-third of the PS5’s internal storage. If you’re not a CoD fan, though, chances are you’ll be good to store between six to 10 games on a regular PS5 internally before running into problems. You also need to consider your internet speed. If you live in an area with slow broadband, the “you can just download it again” rationale doesn’t really work. At my old home, a 100GB download took me around eight hours, during which time it was difficult to simultaneously watch Twitch or, say, publish articles about upgrading PS5 SSDs. Keeping games around on the off-chance you’ll want to play them at some point makes sense. Aaron Souppouris / Engadget Off the bat, there's basically no point in going for a 250GB PS5 SSD. Economically, 250GB drives aren’t that much cheaper than 500GB ones — and practically, that really isn’t a lot of space for modern games to live on. 500GB drives can be a decent option, but after years of declining prices, I think the sweet spot for most people is to opt for a high-capacity 1TB or 2TB drive, which should run you at most $200. The latter will more than double the PS5 Pro’s storage without breaking the bank. Unless you’re rolling in cash and want to flex, 4TB and 8TB models should mostly be avoided, as you’ll end up paying more per gigabyte than you would with a 1TB or 2TB drive. While the 825GB PS5 only provides 667GB of storage, that’s largely due to storage being reserved for the operating system and caching. If you install a 1TB PS5 SSD, you'll have, within a margin of error, 1TB of storage available for games. Out of the box, the PS5 Pro offers 1.86TB of storage for games, though you can eke out more if you delete the pre-installed Astro’s Playroom (gasp). Since neither the PS5 Slim nor PS5 Pro feature updated CPU architecture, all of our recommendations will work with whatever PS5 model you own. Can you play PS5 games on an external SSD? External hard drives tend to cost less than internal SSD counterparts (and there’s a good chance you might own one already). Unfortunately, there are restrictions on what you can do with them. An external SSD connects to your PS5 via USB, and is only suitable for playing PlayStation 4 games, or storing PS5 titles. That’s useful if you have anything but the best high-speed internet — it’s faster to move a PS5 game out of “cold storage” on an external drive than it is to re-download it — or want to keep your PS4 library on hand. Due to the limitations here, you don’t need the highest-performing model, although you should opt for SSDs over HDDs for improved transfer speeds and load times. Any basic portable drive from a reputable brand will do, with the Crucial X9 Pro and Samsung T7 being options we’ve tried and can recommend. Which SSD cards are compatible with the PS5? The official answer to this question is an “M.2 Socket 3 (Key M) Gen4 x4 NVME SSD.” But even within that seemingly specific description, there are additional factors to consider. The main requirements Sony has laid out for compatibility come down to speed, cooling and physical dimensions. For speed, Sony says drives should be able to handle sequential reads at 5,500MB/s. Early testing showed that the PS5 would accept drives as slow as 4,800MB/s, and that games that tap into the SSD regularly — such as Ratchet & Clank: Rift Apart — would cause no issues. Pretty much the only thing the PS5 will outright reject is one that doesn't match the Gen4 x4 spec. In our opinion, though, using a drive slower than the specification is a risk that, if you don’t already have that drive lying around, is not worth taking. Just because we haven’t found issues yet doesn’t mean there won’t be games that could be problematic in the future. The price difference between these marginally slower Gen4 drives and the ones that meet Sony’s spec isn’t huge, and you might as well cover all your bases. Slightly more complicated than speed is cooling and size. Most new SSDs are going to be just fine; the PS5 can fit 22mm-wide SSDs of virtually any length (30mm, 40mm, 60mm, 80mm or 110mm, to be precise). The vast majority of drives you find will be 22mm wide and 80mm long, so no problem there. It should be noted that the system can fit a 25mm-wide drive, but that width must include the cooling solution. Speaking of, Sony says SSDs require “effective heat dissipation with a cooling structure, such as a heatsink.” The maximum height supported by Sony’s slot is 11.25mm, of which only 2.45mm can be “below” the drive. This previously meant some of the most popular heatsinked Gen4 SSDs, including Corsair’s MP600 Pro LP, would not fit within the PS5’s storage expansion slot. Since Engadget first published this guide in 2021, most NVMe makers, including Samsung, have come out with PlayStation-specific models that meet those requirements. That said, if you want to save some money, bare drives are often cheaper and it’s trivial to find a cooling solution that will work for the PS5. The only component in an NVMe SSD that really requires cooling is the controller, which without a heatsink will happily sear a (very small) steak. Most SSDs have chips on only one side, but even on double-sided SSDs, the controller is likely to be on top, as manufacturers know it needs to be positioned there to better dissipate heat. So, head to your PC component seller of choice and pick up basically anything that meets the recommended dimensions. A good search term is “laptop NVME heatsink,” as these will be designed to fit in the confines of gaming laptops, which are even more restrictive than a PS5. They’re also typically cheaper than the ones labeled as “PS5 heatsinks.” One recommendation is this $6 copper heatsink, which attaches to the PS5 SSD with sticky thermal interface material. It works just fine, and in performing stress tests on a PC, we couldn’t find anything metal that didn’t keep temperatures under control. When you’re searching, just make sure the solution you go for measures no more than 25mm wide or 8mm tall (including the thermal interface material) and has a simple method of installation that’s not going to cause any headaches. One last thing: When shopping for a PS5 NVMe, there’s no reason to buy a Gen5 model over a more affordable Gen4 model. As things stand, Sony’s console can’t take advantage of the new standard, and though Gen5 drives are backward compatible, they’re more expensive than their Gen4 counterparts. Just buy the fastest and highest-capacity Gen4 model you can afford. How to install an SSD into your PS5 If you need guidance on how to install your new NVMe into your PS5 or PS5 Pro, we have a separate guide detailing all the steps here. Installation is pretty straightforward, but our how-to can help you if you're stuck. Just make note: Before attempting to add more storage via a PS5 SSD, ensure that you have Sony’s latest software installed.This article originally appeared on Engadget at https://www.engadget.com/gaming/playstation/best-ssd-for-ps5-130004175.html?src=rss",
          "content": "Storage fills up fast on a PS5, especially when a single game can take up as much space as an entire last-gen library. Adding moreSSD space is the easiest way to stop playing Tetris with your installs, and once it is set up, your console loads games just as quickly as it does from the built-in drive. It is a small upgrade that makes a big difference if you jump between several titles at once.The tricky part is knowing which SSDs actually work with the PS5. You need a drive that meets Sony’s speed requirements and stays cool under long play sessions. Some models include a heatsink, while others let you use your own to save a little money. We tested the top options and picked the best SSDs for PS5 to help you upgrade without hassle.Read more: These are the best SSDs in 2026 Table of contents Best SSDs for PS5 in 2026 How we test PS5 SSDs PS5 SSD FAQs Best SSDs for PS5 in 2026 How we test PS5 SSDs I’ve tested most of the SSDs recommended on this list, either for PS5 or computer use. I also bought and used our top pick in my own PS5. PS5 SSD FAQs How much PS5 storage do I need? The PlayStation 5 and PlayStation 5 Pro can accept internal drives with between 250GB and 8TB of storage capacity. If you already own a PS5, chances are you have a reasonable idea of how much storage you need ​​for your game library. If you’re buying an SSD with a new PS5 or PS5 Pro, or buying for someone else, it’s more difficult to tell what you might need for a high-performance experience. PS5 games are smaller on average than their PS4 equivalents, typically taking up between 30GB and 100GB, with some notable (and very popular) exceptions. If you’re a fan of the Call of Duty series, installing Black Ops 6 and Warzone 2.0 can eat up to 240GB. In other words, a full Call of Duty install will take up more than one-third of the PS5’s internal storage. If you’re not a CoD fan, though, chances are you’ll be good to store between six to 10 games on a regular PS5 internally before running into problems. You also need to consider your internet speed. If you live in an area with slow broadband, the “you can just download it again” rationale doesn’t really work. At my old home, a 100GB download took me around eight hours, during which time it was difficult to simultaneously watch Twitch or, say, publish articles about upgrading PS5 SSDs. Keeping games around on the off-chance you’ll want to play them at some point makes sense. Aaron Souppouris / Engadget Off the bat, there's basically no point in going for a 250GB PS5 SSD. Economically, 250GB drives aren’t that much cheaper than 500GB ones — and practically, that really isn’t a lot of space for modern games to live on. 500GB drives can be a decent option, but after years of declining prices, I think the sweet spot for most people is to opt for a high-capacity 1TB or 2TB drive, which should run you at most $200. The latter will more than double the PS5 Pro’s storage without breaking the bank. Unless you’re rolling in cash and want to flex, 4TB and 8TB models should mostly be avoided, as you’ll end up paying more per gigabyte than you would with a 1TB or 2TB drive. While the 825GB PS5 only provides 667GB of storage, that’s largely due to storage being reserved for the operating system and caching. If you install a 1TB PS5 SSD, you'll have, within a margin of error, 1TB of storage available for games. Out of the box, the PS5 Pro offers 1.86TB of storage for games, though you can eke out more if you delete the pre-installed Astro’s Playroom (gasp). Since neither the PS5 Slim nor PS5 Pro feature updated CPU architecture, all of our recommendations will work with whatever PS5 model you own. Can you play PS5 games on an external SSD? External hard drives tend to cost less than internal SSD counterparts (and there’s a good chance you might own one already). Unfortunately, there are restrictions on what you can do with them. An external SSD connects to your PS5 via USB, and is only suitable for playing PlayStation 4 games, or storing PS5 titles. That’s useful if you have anything but the best high-speed internet — it’s faster to move a PS5 game out of “cold storage” on an external drive than it is to re-download it — or want to keep your PS4 library on hand. Due to the limitations here, you don’t need the highest-performing model, although you should opt for SSDs over HDDs for improved transfer speeds and load times. Any basic portable drive from a reputable brand will do, with the Crucial X9 Pro and Samsung T7 being options we’ve tried and can recommend. Which SSD cards are compatible with the PS5? The official answer to this question is an “M.2 Socket 3 (Key M) Gen4 x4 NVME SSD.” But even within that seemingly specific description, there are additional factors to consider. The main requirements Sony has laid out for compatibility come down to speed, cooling and physical dimensions. For speed, Sony says drives should be able to handle sequential reads at 5,500MB/s. Early testing showed that the PS5 would accept drives as slow as 4,800MB/s, and that games that tap into the SSD regularly — such as Ratchet & Clank: Rift Apart — would cause no issues. Pretty much the only thing the PS5 will outright reject is one that doesn't match the Gen4 x4 spec. In our opinion, though, using a drive slower than the specification is a risk that, if you don’t already have that drive lying around, is not worth taking. Just because we haven’t found issues yet doesn’t mean there won’t be games that could be problematic in the future. The price difference between these marginally slower Gen4 drives and the ones that meet Sony’s spec isn’t huge, and you might as well cover all your bases. Slightly more complicated than speed is cooling and size. Most new SSDs are going to be just fine; the PS5 can fit 22mm-wide SSDs of virtually any length (30mm, 40mm, 60mm, 80mm or 110mm, to be precise). The vast majority of drives you find will be 22mm wide and 80mm long, so no problem there. It should be noted that the system can fit a 25mm-wide drive, but that width must include the cooling solution. Speaking of, Sony says SSDs require “effective heat dissipation with a cooling structure, such as a heatsink.” The maximum height supported by Sony’s slot is 11.25mm, of which only 2.45mm can be “below” the drive. This previously meant some of the most popular heatsinked Gen4 SSDs, including Corsair’s MP600 Pro LP, would not fit within the PS5’s storage expansion slot. Since Engadget first published this guide in 2021, most NVMe makers, including Samsung, have come out with PlayStation-specific models that meet those requirements. That said, if you want to save some money, bare drives are often cheaper and it’s trivial to find a cooling solution that will work for the PS5. The only component in an NVMe SSD that really requires cooling is the controller, which without a heatsink will happily sear a (very small) steak. Most SSDs have chips on only one side, but even on double-sided SSDs, the controller is likely to be on top, as manufacturers know it needs to be positioned there to better dissipate heat. So, head to your PC component seller of choice and pick up basically anything that meets the recommended dimensions. A good search term is “laptop NVME heatsink,” as these will be designed to fit in the confines of gaming laptops, which are even more restrictive than a PS5. They’re also typically cheaper than the ones labeled as “PS5 heatsinks.” One recommendation is this $6 copper heatsink, which attaches to the PS5 SSD with sticky thermal interface material. It works just fine, and in performing stress tests on a PC, we couldn’t find anything metal that didn’t keep temperatures under control. When you’re searching, just make sure the solution you go for measures no more than 25mm wide or 8mm tall (including the thermal interface material) and has a simple method of installation that’s not going to cause any headaches. One last thing: When shopping for a PS5 NVMe, there’s no reason to buy a Gen5 model over a more affordable Gen4 model. As things stand, Sony’s console can’t take advantage of the new standard, and though Gen5 drives are backward compatible, they’re more expensive than their Gen4 counterparts. Just buy the fastest and highest-capacity Gen4 model you can afford. How to install an SSD into your PS5 If you need guidance on how to install your new NVMe into your PS5 or PS5 Pro, we have a separate guide detailing all the steps here. Installation is pretty straightforward, but our how-to can help you if you're stuck. Just make note: Before attempting to add more storage via a PS5 SSD, ensure that you have Sony’s latest software installed.This article originally appeared on Engadget at https://www.engadget.com/gaming/playstation/best-ssd-for-ps5-130004175.html?src=rss",
          "feed_position": 10,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2020-11/341eb080-1ec1-11eb-bffb-88f330aaaf35"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/nintendo/best-microsd-cards-for-nintendo-switch-2-160052947.html",
          "published_at": "Fri, 26 Dec 2025 08:00:36 +0000",
          "title": "The best microSD cards for the Nintendo Switch 2",
          "standfirst": "If you want to expand the storage of your Nintendo Switch 2, you’ll need a microSD Express card. This is not the same as the more traditional microSD cards you may have bought for the original Switch or other gaming handhelds; Express cards are newer, faster and significantly more expensive on average. But they’re your only choice, and given how much space certain Switch 2 games chew up, you’ll probably have no choice but to get one eventually. Which to buy, though? If you’re looking for the best microSD card for the Switch 2 today, we’ve broken down what you should know before taking the plunge. The best microSD cards for the Switch 2 (aren't all that important) Jeff Dunn for Engadget The Switch 2 is the first mainstream device to require microSD Express for storage expansion, so there aren’t many options available to buy just yet. Of the handful of compatible models released thus far, we’ve now tested seven: the SanDisk microSD Express Card (aka the “SanDisk GamePlay microSD Express Card” at Walmart), the Lexar Play Pro, the Samsung microSD Card for Nintendo Switch 2, the Samsung P9 Express, the PNY microSD Express Card, the GameStop Express microSD Card for Nintendo Switch 2 and the Onn microSD Express Card. The first five are made by genuine storage manufacturers, while the GameStop and Onn cards appear to be rebadged versions of other models. We used the 256GB version of every card except for Lexar Play Pro, which was 1TB. After timing these microSD Express cards across a range of Switch 2 games, our advice is simple: Get whichever one is in stock for the lowest price in the capacity you want. They aren’t identically fast, especially if you want to move a game to the card from the console’s internal storage (or vice versa). But the differences in load times and overall performance within actual games are tough to notice unless you have a stopwatch handy. All five cards loaded up the digital version of Mario Kart World, for instance, between 18 and 20 seconds. Each loaded the first Grand Prix race in about 6.5 seconds. Getting to the start screen of Cyberpunk 2077 took about 38 or 39 seconds in each case. Loading a save in a particularly asset-heavy area (Jig-Jig Street) then took between 26 and 29 seconds, depending on the card. (The one exception was with the Onn card, which averaged closer to 31 seconds with that particular task, though that’s also the cheapest choice.) With Fast Fusion, a smaller native Switch 2 game, the initial load always took six to seven seconds, while each card loaded the first championship race in roughly 4 seconds. It was a similar situation with the Switch 2 upgrade for The Legend of Zelda: Breath of the Wild (using a Switch 1 cartridge): Each card took just over six seconds to get to the start screen, between 19 and 20 seconds to load a save just before the final boss, about 16 seconds to fast travel between Kakariko Village and Korok Forest, and so on. We saw no significant issues with in-game loads when playing each game, either. The SanDisk microSD Express Card and Lexar Play Pro. Jeff Dunn for Engadget All of this suggests that the Switch 2 has a relatively specific target for these cards to hit, and that there may not be much room for one model to leap too far out in front of the others. We’ll also note that the console’s built-in storage was consistently faster than any external option: The gap wasn’t always big, but no card truly outpaced it in any of our tests. Loading that demanding area in Cyberpunk, for example, took about 22.5 seconds on average. So if you want the absolute fastest load times, don’t put your game on a card at all. If you need the mental comfort of knowing you technically have the best card available, get the SanDisk microSD Express Card. It had no outliers across our many game loading tests, and it was consistently right near the top when it came to moving games to and from system storage, which means it offers strong sequential read and write performance. Benchmark testing on PC with tools like CrystalDiskMark backed this up, as noted in our broader microSD card buying guide. Putting Mario Kart (a 21.9GB file) on that card took four minutes and 39 seconds on average, which was only second to the Lexar Play Pro by six seconds. It was the fastest to write Fast Fusion (3.5GB), taking an average of 27 seconds across three runs. Only PNY’s card was faster to move games back to the console’s storage, but that one was far slower at writing games to the card — getting Mario Kart on there took seven minutes and 11 seconds on average. Just note that the 128GB version of SanDisk’s card has slower sequential writes than the larger versions, including much slower sustained write speeds (100 MB/s vs 210-220 MB/s). So transferring a game to that particular model will take much longer. The Onn card was also slower to move games back to system storage, taking about 50 seconds more than the SanDisk with Mario Kart and nearly three minutes longer with Cyberpunk. Practically speaking, though, speed differences aren’t as important in this case as having lots of space to hold games at a price you can live with. To make things easy, we’ve listed every Express card we’ve seen at retailers at the time of writing below. Remember: You want microSD Express, not “Extreme,” like the branding SanDisk uses for some conventional microSD cards. A microSD Express card will have a big “EX” logo printed on it. 128GB SanDisk microSD Express Card ($64 MSRP) PNY microSD Express Card ($48 MSRP) 256GB Samsung microSD Express Card for Nintendo Switch 2 ($60 MSRP) Samsung P9 Express ($55 MSRP) SanDisk microSD Express Card ($78 MSRP) Lexar Play Pro ($60 MSRP) PNY microSD Express Card ($62 MSRP) GameStop Express microSD Card for Nintendo Switch 2 ($60 MSRP) Onn microSD Express Card ($47 MSRP) 512GB Samsung P9 Express ($100 MSRP) SanDisk microSD Express Card ($128 MSRP) Lexar Play Pro ($120 MSRP) PNY microSD Express Card ($124 MSRP) GameStop Express microSD Card for Nintendo Switch 2 ($100 MSRP) Onn microSD Express Card ($85 MSRP) 1TB Lexar Play Pro ($220 MSRP) GameStop Express microSD Card for Nintendo Switch 2 ($190 MSRP) All microSD Express cards will have this \"EX\" logo printed on them. Nintendo/Engadget As you can see, while the SanDisk card is fast, it’s also the most expensive of an already-pricey bunch. Is it worth an extra $10-20 to shave a couple seconds off certain loads in certain games, or a couple minutes when moving a game to external storage? Probably not for most people. But stock for all of these cards has been a bit patchy since the Switch 2 landed, particularly for the Walmart Onn model, which has typically been the cheapest choice. More recently, the GameStop-branded cards seem to have sold out too. If only one card is actually available by the time you read this — and you must have it today — it’s safe to just get it. You won’t lose or gain all that much when it comes to real-world performance. We’ve recommended holding off on buying a microSD Express card for as long as possible in previous updates to this guide, and ultimately each model above should still come down in price over time. We saw multiple Express card discounts during Black Friday and Cyber Monday, for instance. But between President Trump’s tariff hikes and the ongoing AI-driven shortages for memory and high-capacity storage, you’d be justified if you wanted to grab the largest card you can reasonably afford sooner rather than later. These things are still pricey compared to traditional microSD cards: The Samsung Pro Plus, for example, costs $17 for 128GB, $27 for 256GB, $50 for 512GB and $95 for 1TB as of this writing. And ideally, we’ll see more high-capacity options down the road: Nintendo says the Switch 2 technically supports cards up to 2TB, but so far only a couple even go up to 1TB. You should still try to use all 256GB baked into the Switch 2 first, even if it means having to delete a game or two. But if you absolutely need more space right away, the cards above should be fine today. What are microSD Express cards? A microSD Express card like the one on the right has a second row of pins on the back. Jeff Dunn for Engadget Most microSD cards are based on a standard called Ultra High Speed (UHS), of which there are three versions: UHS-I, UHS-II and UHS-III. The vast majority of cards you may have bought in the past utilize UHS-I. These have one row of pins in the back and a theoretical maximum data transfer speed of 104 megabytes per second (MB/s). (Though many cards are able to surpass that limit with proprietary tech and card readers.) The original Switch has a UHS-I microSD slot, as do most other gaming handhelds like Valve’s Steam Deck. UHS-II cards add a second row of pins and can reach up to 312 MB/s. These are pricier and much less common than cards based on UHS-I, but they’re supported by some cameras and higher-power handhelds like the ASUS ROG Xbox Ally X. UHS-III, meanwhile, is twice as fast as UHS-II in theory (624 MB/s), but no microSD cards have actually used it. UHS-I cards have held on over the years because they’re cheap, widely supported and fast enough for the things most people need them to do: record 4K video, stash photos and so on. But with the Switch 2, Nintendo needs more. The new console is dramatically more powerful, which allows it to run demanding games that may have originally been built for stronger hardware like the PlayStation 5, Xbox Series X or gaming PCs. The device also uses UFS 3.1 storage internally, which is much speedier than the eMMC storage used by the original Switch. (A custom file decompression engine helps improve load times as well.) So if the Switch 2 is going to accept microSD cards, it needs ones that won’t bring a serious drop-off in performance and can hold up with modern games. The Nintendo Switch 2. Sam Rutherford for Engadget Hence, SD Express. This standard has technically been around since 2018 but mostly went nowhere until the Switch 2 came along. It also uses a second row of pins, but it lets microSD cards take advantage of the PCI Express (PCIe)/NVMe interface, which is the same underlying tech used by modern SSDs. As a result, it can produce considerably faster read and write speeds, with a current theoretical maximum of 985 MB/s. As noted above, real-world performance won’t be quite that fast. Even if it was, the best microSD Express cards would still be much slower than the NVMe SSDs used by the PS5 and Xbox. (Sony recommends SSDs with sequential read speeds of at least 5,500 MB/s.) And they’ll fall well below their peak speeds under sustained loads: SanDisk, for instance, says sustained write speeds for its 128GB Express card can drop as low as 100 MB/s. But they’re still a marked improvement over old UHS-I cards, and in theory, they should be quicker than some older SATA-based SSDs when it comes loading game levels, asset streaming, retrieving saves or copying games to external storage. Whereas SanDisk’s microSD Express card can produce sequential read speeds around 900 MB/s, Lexar’s Professional Silver Plus — the top UHS-I pick in our general microSD card guide — topped out just over 200 MB/s, and that’s with a proprietary reader. (On the first Switch, it’d be closer to 100 MB/s.) Sequential writes and random speeds were three to four times better as well, and sometimes even more depending on the benchmark we used. It remains to be seen how well these Express cards will hold up with years of use, and there’s no way to know exactly when their sky-high prices will drop. Non-Switch 2 devices that support microSD Express are still exceedingly rare, and the standard itself isn’t backwards compatible with UHS-II, so you’ll be limited to UHS-I speeds if you want to use your card with another device (unless you buy a pricey external reader). Still, while the increased costs and limited selection are annoying, the tech itself is worthy of a next-gen Switch. How we test microSD Express cards Jeff Dunn for Engadget We put our microSD Express cards through a series of tests meant to simulate how people would use each card on the Switch 2 in the real world. We mainly worked with four games: a mid-sized title in Mario Kart World, a small one in Fast Fusion, a relatively large one in Cyberpunk 2077 and a hybrid in The Legend of Zelda: Breath of the Wild, which ran off a Switch 1 cartridge but used a roughly 10GB Switch 2 upgrade pack that was downloaded and installed digitally. We first timed how long it took to move each game from the system’s internal storage to the card in question, and vice versa. We then timed how long it took to load each game when installed to a given card. After that, we measured how quickly the cards could load certain in-game scenarios: the first Grand Prix race in Mario Kart; the first championship race in Fast Fusion; fast traveling between the Jig-Jig Street, Embers and Downtown Central areas in Cyberpunk and fast traveling between the Kakariko Village, Korok Forest and the Hyrule Castle Town Ruins areas in Zelda. (We chose those places in the latter two games because they’re more taxing than other regions.) With Cyberpunk and Zelda, we also timed how long it took to load up different save files in those locations. With each test, we completed three to five runs to account for any irregularities and marked down the average time taken between them. We did each test in airplane mode, with Wi-Fi and Bluetooth off, to minimize any performance drain that could arise from background downloads. Between each test, we also spent at least an hour playing the games off each card to ensure there were no significant drop-offs compared to the console’s built-in storage. Recent updates December 2025: We’ve tested Samsung’s P9 Express card, though our general shopping advice for this market remains the same. November 2025: We’ve tested the 256GB version of Walmart’s Onn microSD Express card and edited our guide accordingly. It’s generally slower than most of the other options we’ve tried, especially when moving games to and from system storage, and in synthetic benchmark tests on a PC. But the performance drop-off isn’t particularly noticeable in actual Switch 2 games, so if you see it in stock and just want to pay as little as possible, it’s a decent buy. September 2025: We’ve taken another pass through this guide to confirm our advice is still accurate. We’ve also noted a new 512GB version of PNY’s microSD Express card and confirmed that a “SanDisk GamePlay” Express card sold at Walmart has the same performance as the standard SanDisk model we recommend above, just with a different name.This article originally appeared on Engadget at https://www.engadget.com/gaming/nintendo/best-microsd-cards-for-nintendo-switch-2-160052947.html?src=rss",
          "content": "If you want to expand the storage of your Nintendo Switch 2, you’ll need a microSD Express card. This is not the same as the more traditional microSD cards you may have bought for the original Switch or other gaming handhelds; Express cards are newer, faster and significantly more expensive on average. But they’re your only choice, and given how much space certain Switch 2 games chew up, you’ll probably have no choice but to get one eventually. Which to buy, though? If you’re looking for the best microSD card for the Switch 2 today, we’ve broken down what you should know before taking the plunge. The best microSD cards for the Switch 2 (aren't all that important) Jeff Dunn for Engadget The Switch 2 is the first mainstream device to require microSD Express for storage expansion, so there aren’t many options available to buy just yet. Of the handful of compatible models released thus far, we’ve now tested seven: the SanDisk microSD Express Card (aka the “SanDisk GamePlay microSD Express Card” at Walmart), the Lexar Play Pro, the Samsung microSD Card for Nintendo Switch 2, the Samsung P9 Express, the PNY microSD Express Card, the GameStop Express microSD Card for Nintendo Switch 2 and the Onn microSD Express Card. The first five are made by genuine storage manufacturers, while the GameStop and Onn cards appear to be rebadged versions of other models. We used the 256GB version of every card except for Lexar Play Pro, which was 1TB. After timing these microSD Express cards across a range of Switch 2 games, our advice is simple: Get whichever one is in stock for the lowest price in the capacity you want. They aren’t identically fast, especially if you want to move a game to the card from the console’s internal storage (or vice versa). But the differences in load times and overall performance within actual games are tough to notice unless you have a stopwatch handy. All five cards loaded up the digital version of Mario Kart World, for instance, between 18 and 20 seconds. Each loaded the first Grand Prix race in about 6.5 seconds. Getting to the start screen of Cyberpunk 2077 took about 38 or 39 seconds in each case. Loading a save in a particularly asset-heavy area (Jig-Jig Street) then took between 26 and 29 seconds, depending on the card. (The one exception was with the Onn card, which averaged closer to 31 seconds with that particular task, though that’s also the cheapest choice.) With Fast Fusion, a smaller native Switch 2 game, the initial load always took six to seven seconds, while each card loaded the first championship race in roughly 4 seconds. It was a similar situation with the Switch 2 upgrade for The Legend of Zelda: Breath of the Wild (using a Switch 1 cartridge): Each card took just over six seconds to get to the start screen, between 19 and 20 seconds to load a save just before the final boss, about 16 seconds to fast travel between Kakariko Village and Korok Forest, and so on. We saw no significant issues with in-game loads when playing each game, either. The SanDisk microSD Express Card and Lexar Play Pro. Jeff Dunn for Engadget All of this suggests that the Switch 2 has a relatively specific target for these cards to hit, and that there may not be much room for one model to leap too far out in front of the others. We’ll also note that the console’s built-in storage was consistently faster than any external option: The gap wasn’t always big, but no card truly outpaced it in any of our tests. Loading that demanding area in Cyberpunk, for example, took about 22.5 seconds on average. So if you want the absolute fastest load times, don’t put your game on a card at all. If you need the mental comfort of knowing you technically have the best card available, get the SanDisk microSD Express Card. It had no outliers across our many game loading tests, and it was consistently right near the top when it came to moving games to and from system storage, which means it offers strong sequential read and write performance. Benchmark testing on PC with tools like CrystalDiskMark backed this up, as noted in our broader microSD card buying guide. Putting Mario Kart (a 21.9GB file) on that card took four minutes and 39 seconds on average, which was only second to the Lexar Play Pro by six seconds. It was the fastest to write Fast Fusion (3.5GB), taking an average of 27 seconds across three runs. Only PNY’s card was faster to move games back to the console’s storage, but that one was far slower at writing games to the card — getting Mario Kart on there took seven minutes and 11 seconds on average. Just note that the 128GB version of SanDisk’s card has slower sequential writes than the larger versions, including much slower sustained write speeds (100 MB/s vs 210-220 MB/s). So transferring a game to that particular model will take much longer. The Onn card was also slower to move games back to system storage, taking about 50 seconds more than the SanDisk with Mario Kart and nearly three minutes longer with Cyberpunk. Practically speaking, though, speed differences aren’t as important in this case as having lots of space to hold games at a price you can live with. To make things easy, we’ve listed every Express card we’ve seen at retailers at the time of writing below. Remember: You want microSD Express, not “Extreme,” like the branding SanDisk uses for some conventional microSD cards. A microSD Express card will have a big “EX” logo printed on it. 128GB SanDisk microSD Express Card ($64 MSRP) PNY microSD Express Card ($48 MSRP) 256GB Samsung microSD Express Card for Nintendo Switch 2 ($60 MSRP) Samsung P9 Express ($55 MSRP) SanDisk microSD Express Card ($78 MSRP) Lexar Play Pro ($60 MSRP) PNY microSD Express Card ($62 MSRP) GameStop Express microSD Card for Nintendo Switch 2 ($60 MSRP) Onn microSD Express Card ($47 MSRP) 512GB Samsung P9 Express ($100 MSRP) SanDisk microSD Express Card ($128 MSRP) Lexar Play Pro ($120 MSRP) PNY microSD Express Card ($124 MSRP) GameStop Express microSD Card for Nintendo Switch 2 ($100 MSRP) Onn microSD Express Card ($85 MSRP) 1TB Lexar Play Pro ($220 MSRP) GameStop Express microSD Card for Nintendo Switch 2 ($190 MSRP) All microSD Express cards will have this \"EX\" logo printed on them. Nintendo/Engadget As you can see, while the SanDisk card is fast, it’s also the most expensive of an already-pricey bunch. Is it worth an extra $10-20 to shave a couple seconds off certain loads in certain games, or a couple minutes when moving a game to external storage? Probably not for most people. But stock for all of these cards has been a bit patchy since the Switch 2 landed, particularly for the Walmart Onn model, which has typically been the cheapest choice. More recently, the GameStop-branded cards seem to have sold out too. If only one card is actually available by the time you read this — and you must have it today — it’s safe to just get it. You won’t lose or gain all that much when it comes to real-world performance. We’ve recommended holding off on buying a microSD Express card for as long as possible in previous updates to this guide, and ultimately each model above should still come down in price over time. We saw multiple Express card discounts during Black Friday and Cyber Monday, for instance. But between President Trump’s tariff hikes and the ongoing AI-driven shortages for memory and high-capacity storage, you’d be justified if you wanted to grab the largest card you can reasonably afford sooner rather than later. These things are still pricey compared to traditional microSD cards: The Samsung Pro Plus, for example, costs $17 for 128GB, $27 for 256GB, $50 for 512GB and $95 for 1TB as of this writing. And ideally, we’ll see more high-capacity options down the road: Nintendo says the Switch 2 technically supports cards up to 2TB, but so far only a couple even go up to 1TB. You should still try to use all 256GB baked into the Switch 2 first, even if it means having to delete a game or two. But if you absolutely need more space right away, the cards above should be fine today. What are microSD Express cards? A microSD Express card like the one on the right has a second row of pins on the back. Jeff Dunn for Engadget Most microSD cards are based on a standard called Ultra High Speed (UHS), of which there are three versions: UHS-I, UHS-II and UHS-III. The vast majority of cards you may have bought in the past utilize UHS-I. These have one row of pins in the back and a theoretical maximum data transfer speed of 104 megabytes per second (MB/s). (Though many cards are able to surpass that limit with proprietary tech and card readers.) The original Switch has a UHS-I microSD slot, as do most other gaming handhelds like Valve’s Steam Deck. UHS-II cards add a second row of pins and can reach up to 312 MB/s. These are pricier and much less common than cards based on UHS-I, but they’re supported by some cameras and higher-power handhelds like the ASUS ROG Xbox Ally X. UHS-III, meanwhile, is twice as fast as UHS-II in theory (624 MB/s), but no microSD cards have actually used it. UHS-I cards have held on over the years because they’re cheap, widely supported and fast enough for the things most people need them to do: record 4K video, stash photos and so on. But with the Switch 2, Nintendo needs more. The new console is dramatically more powerful, which allows it to run demanding games that may have originally been built for stronger hardware like the PlayStation 5, Xbox Series X or gaming PCs. The device also uses UFS 3.1 storage internally, which is much speedier than the eMMC storage used by the original Switch. (A custom file decompression engine helps improve load times as well.) So if the Switch 2 is going to accept microSD cards, it needs ones that won’t bring a serious drop-off in performance and can hold up with modern games. The Nintendo Switch 2. Sam Rutherford for Engadget Hence, SD Express. This standard has technically been around since 2018 but mostly went nowhere until the Switch 2 came along. It also uses a second row of pins, but it lets microSD cards take advantage of the PCI Express (PCIe)/NVMe interface, which is the same underlying tech used by modern SSDs. As a result, it can produce considerably faster read and write speeds, with a current theoretical maximum of 985 MB/s. As noted above, real-world performance won’t be quite that fast. Even if it was, the best microSD Express cards would still be much slower than the NVMe SSDs used by the PS5 and Xbox. (Sony recommends SSDs with sequential read speeds of at least 5,500 MB/s.) And they’ll fall well below their peak speeds under sustained loads: SanDisk, for instance, says sustained write speeds for its 128GB Express card can drop as low as 100 MB/s. But they’re still a marked improvement over old UHS-I cards, and in theory, they should be quicker than some older SATA-based SSDs when it comes loading game levels, asset streaming, retrieving saves or copying games to external storage. Whereas SanDisk’s microSD Express card can produce sequential read speeds around 900 MB/s, Lexar’s Professional Silver Plus — the top UHS-I pick in our general microSD card guide — topped out just over 200 MB/s, and that’s with a proprietary reader. (On the first Switch, it’d be closer to 100 MB/s.) Sequential writes and random speeds were three to four times better as well, and sometimes even more depending on the benchmark we used. It remains to be seen how well these Express cards will hold up with years of use, and there’s no way to know exactly when their sky-high prices will drop. Non-Switch 2 devices that support microSD Express are still exceedingly rare, and the standard itself isn’t backwards compatible with UHS-II, so you’ll be limited to UHS-I speeds if you want to use your card with another device (unless you buy a pricey external reader). Still, while the increased costs and limited selection are annoying, the tech itself is worthy of a next-gen Switch. How we test microSD Express cards Jeff Dunn for Engadget We put our microSD Express cards through a series of tests meant to simulate how people would use each card on the Switch 2 in the real world. We mainly worked with four games: a mid-sized title in Mario Kart World, a small one in Fast Fusion, a relatively large one in Cyberpunk 2077 and a hybrid in The Legend of Zelda: Breath of the Wild, which ran off a Switch 1 cartridge but used a roughly 10GB Switch 2 upgrade pack that was downloaded and installed digitally. We first timed how long it took to move each game from the system’s internal storage to the card in question, and vice versa. We then timed how long it took to load each game when installed to a given card. After that, we measured how quickly the cards could load certain in-game scenarios: the first Grand Prix race in Mario Kart; the first championship race in Fast Fusion; fast traveling between the Jig-Jig Street, Embers and Downtown Central areas in Cyberpunk and fast traveling between the Kakariko Village, Korok Forest and the Hyrule Castle Town Ruins areas in Zelda. (We chose those places in the latter two games because they’re more taxing than other regions.) With Cyberpunk and Zelda, we also timed how long it took to load up different save files in those locations. With each test, we completed three to five runs to account for any irregularities and marked down the average time taken between them. We did each test in airplane mode, with Wi-Fi and Bluetooth off, to minimize any performance drain that could arise from background downloads. Between each test, we also spent at least an hour playing the games off each card to ensure there were no significant drop-offs compared to the console’s built-in storage. Recent updates December 2025: We’ve tested Samsung’s P9 Express card, though our general shopping advice for this market remains the same. November 2025: We’ve tested the 256GB version of Walmart’s Onn microSD Express card and edited our guide accordingly. It’s generally slower than most of the other options we’ve tried, especially when moving games to and from system storage, and in synthetic benchmark tests on a PC. But the performance drop-off isn’t particularly noticeable in actual Switch 2 games, so if you see it in stock and just want to pay as little as possible, it’s a decent buy. September 2025: We’ve taken another pass through this guide to confirm our advice is still accurate. We’ve also noted a new 512GB version of PNY’s microSD Express card and confirmed that a “SanDisk GamePlay” Express card sold at Walmart has the same performance as the standard SanDisk model we recommend above, just with a different name.This article originally appeared on Engadget at https://www.engadget.com/gaming/nintendo/best-microsd-cards-for-nintendo-switch-2-160052947.html?src=rss",
          "feed_position": 12,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-08/f2871a40-7217-11f0-9abf-6d1045de6d8d"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/security/the-enterprise-voice-ai-split-why-architecture-not-model-quality-defines",
          "published_at": "Fri, 26 Dec 2025 08:00:00 GMT",
          "title": "The enterprise voice AI split: Why architecture — not model quality — defines your compliance posture",
          "standfirst": "For the past year, enterprise decision-makers have faced a rigid architectural trade-off in voice AI: adopt a \"Native\" speech-to-speech (S2S) model for speed and emotional fidelity, or stick with a \"Modular\" stack for control and auditability. That binary choice has evolved into distinct market segmentation, driven by two simultaneous forces reshaping the landscape.What was once a performance decision has become a governance and compliance decision, as voice agents move from pilots into regulated, customer-facing workflows.On one side, Google has commoditized the \"raw intelligence\" layer. With the release of Gemini 2.5 Flash and now Gemini 3.0 Flash, Google has positioned itself as the high-volume utility provider with pricing that makes voice automation economically viable for workflows previously too cheap to justify. OpenAI responded in August with a 20% price cut on its Realtime API, narrowing the gap with Gemini to roughly 2x — still meaningful, but no longer insurmountable.On the other side, a new \"Unified\" modular architecture is emerging. By physically co-locating the disparate components of a voice stack-transcription, reasoning and synthesis-providers like Together AI are addressing the latency issues that previously hampered modular designs. This architectural counter-attack delivers native-like speed while retaining the audit trails and intervention points that regulated industries require.Together, these forces are collapsing the historical trade-off between speed and control in enterprise voice systems.For enterprise executives, the question is no longer just about model performance. It&#x27;s a strategic choice between a cost-efficient, generalized utility model and a domain-specific, vertically integrated stack that supports compliance requirements — including whether voice agents can be deployed at scale without introducing audit gaps, regulatory risk, or downstream liability.Understanding the three architectural pathsThese architectural differences are not academic; they directly shape latency, auditability, and the ability to intervene in live voice interactions.The enterprise voice AI market has consolidated around three distinct architectures, each optimized for different trade-offs between speed, control, and cost. S2S models — including Google&#x27;s Gemini Live and OpenAI&#x27;s Realtime API — process audio inputs natively to preserve paralinguistic signals like tone and hesitation. But contrary to popular belief, these aren&#x27;t true end-to-end speech models. They operate as what the industry calls \"Half-Cascades\": Audio understanding happens natively, but the model still performs text-based reasoning before synthesizing speech output. This hybrid approach achieves latency in the 200 to 300ms range, closely mimicking human response times where pauses beyond 200ms become perceptible and feel unnatural. The trade-off is that these intermediate reasoning steps remain opaque to enterprises, limiting auditability and policy enforcement.Traditional chained pipelines represent the opposite extreme. These modular stacks follow a three-step relay: Speech-to-text engines like Deepgram&#x27;s Nova-3 or AssemblyAI&#x27;s Universal-Streaming transcribe audio into text, an LLM generates a response, and text-to-speech providers like ElevenLabs or Cartesia&#x27;s Sonic synthesize the output. Each handoff introduces network transmission time plus processing overhead. While individual components have optimized their processing times to sub-300ms, the aggregate roundtrip latency frequently exceeds 500ms, triggering \"barge-in\" collisions where users interrupt because they assume the agent hasn&#x27;t heard them. Unified infrastructure represents the architectural counter-attack from modular vendors. Together AI physically co-locates STT (Whisper Turbo), LLM (Llama/Mixtral), and TTS models (Rime, Cartesia) on the same GPU clusters. Data moves between components via high-speed memory interconnects rather than the public internet, collapsing total latency to sub-500ms while retaining the modular separation that enterprises require for compliance. Together AI benchmarks TTS latency at approximately 225ms using Mist v2, leaving sufficient headroom for transcription and reasoning within the 500ms budget that defines natural conversation. This architecture delivers the speed of a native model with the control surface of a modular stack — which can be the \"Goldilocks\" solution that addresses both performance and governance requirements simultaneously.The trade-off is increased operational complexity compared to fully managed native systems, but for regulated enterprises that complexity often maps directly to required control.Why latency determines user tolerance — and the metrics that prove itThe difference between a successful voice interaction and an abandoned call often comes down to milliseconds. A single extra second of delay can cut user satisfaction by 16%. Three technical metrics define production readiness:Time to first token (TTFT) measures the delay from the end of user speech to the start of the agent&#x27;s response. Human conversation tolerates roughly 200ms gaps; anything longer feels robotic. Native S2S models achieve 200 to 300ms, while modular stacks must optimize aggressively to stay under 500ms.Word Error Rate (WER) measures transcription accuracy. Deepgram’s Nova-3 delivers 53.4% lower WER for streaming, while AssemblyAI&#x27;s Universal-Streaming claims 41% faster word emission latency. A single transcription error — \"billing\" misheard as \"building\" — corrupts the entire downstream reasoning chain.Real-Time Factor (RTF) measures whether the system processes speech faster than users speak. An RTF below 1.0 is mandatory to prevent lag accumulation. Whisper Turbo runs 5.4x faster than Whisper Large v3, making sub-1.0 RTF achievable at scale without proprietary APIs.The modular advantage: Control and complianceFor regulated industries like healthcare and finance, \"cheap\" and \"fast\" are secondary to governance. Native S2S models function as \"black boxes,\" making it difficult to audit what the model processed before responding. Without visibility into the intermediate steps, enterprises can&#x27;t verify that sensitive data was properly handled or that the agent followed required protocols. These controls are difficult — and in some cases impossible — to implement inside opaque, end-to-end speech systems.The modular approach, on the other hand, maintains a text layer between transcription and synthesis, enabling stateful interventions impossible with end-to-end audio processing. Some use cases include:PII redaction allows compliance engines to scan intermediate text and strip out credit card numbers, patient names, or Social Security numbers before they enter the reasoning model. Retell AI&#x27;s automatic redaction of sensitive personal data from transcripts significantly lowers compliance risk — a feature that Vapi does not natively offer.Memory injection lets enterprises inject domain knowledge or user history into the prompt context before the LLM generates a response, transforming agents from transactional tools into relationship-based systems. Pronunciation authority becomes critical in regulated industries where mispronouncing a drug name or financial term creates liability. Rime&#x27;s Mist v2 focuses on deterministic pronunciation, allowing enterprises to define pronunciation dictionaries that are rigorously adhered to across millions of calls — a capability that native S2S models struggle to guarantee.Architecture comparison matrixThe table below summarizes how each architecture optimizes for a different definition of “production-ready.”FeatureNative S2S (Half-Cascade)Unified Modular (Co-located)Legacy Modular (Chained)Leading PlayersGoogle Gemini 2.5, OpenAI RealtimeTogether AI, Vapi (On-prem)Deepgram + Anthropic + ElevenLabsLatency (TTFT)~200-300ms (Human-level) ~300-500ms (Near-native) >500ms (Noticeable Lag) Cost ProfileBifurcated: Gemini is low utility (~$0.02/min); OpenAI is premium (~$0.30+/min).Moderate/Linear: Sum of components (~$0.15/min). No hidden \"context tax.\"Moderate: Similar to Unified, but higher bandwidth/transport costs.State/MemoryLow: Stateless by default. Hard to inject RAG mid-stream.High: Full control to inject memory/context between STT and LLM.High: Easy RAG integration, but slow.Compliance\"Black Box\": Hard to audit input/output directly.Auditable: Text layer allows for PII redaction and policy checks.Auditable: Full logs available for every step.Best Use CaseHigh-Volume Utility or Concierge.Regulated Enterprise: Healthcare, Finance requiring strict audit trails.Legacy IVR: Simple routing where latency is less critical.The vendor ecosystem: Who&#x27;s winning whereThe enterprise voice AI landscape has fragmented into distinct competitive tiers, each serving different segments with minimal overlap. Infrastructure providers like Deepgram and AssemblyAI compete on transcription speed and accuracy, with Deepgram claiming 40x faster inference than standard cloud services and AssemblyAI countering with better accuracy and speed. Model providers Google and OpenAI compete on price-performance with dramatically different strategies. Google&#x27;s utility positioning makes it the default for high-volume, low-margin workflows, whereas OpenAI defends the premium tier with improved instruction following (30.5% on MultiChallenge benchmark) and enhanced function calling (66.5% on ComplexFuncBench). The gap has narrowed from 15x to 4x in pricing, but OpenAI maintains its edge in emotional expressivity and conversational fluidity - qualities that justify premium pricing for mission-critical interactions.Orchestration platforms Vapi, Retell AI, and Bland AI compete on implementation ease and feature completeness. Vapi&#x27;s developer-first approach appeals to technical teams wanting granular control, while Retell&#x27;s compliance focus (HIPAA, automatic PII redaction) makes it the default for regulated industries. Bland&#x27;s managed service model targets operations teams wanting \"set and forget\" scalability at the cost of flexibility.Unified infrastructure providers like Together AI represent the most significant architectural evolution, collapsing the modular stack into a single offering that delivers native-like latency while retaining component-level control. By co-locating STT, LLM, and TTS on the shared GPU clusters, Together AI achieves sub-500ms total latency with ~225ms for TTS generation using Mist v2.The bottom lineThe market has moved beyond choosing between \"smart\" and \"fast.\" Enterprises must now map their specific requirements — compliance posture, latency tolerance, cost constraints — to the architecture that supports them. For high-volume utility workflows involving routine, low-risk interactions, Google Gemini 2.5 Flash offers unbeatable price-to-performance at approximately 2 cents per minute. For workflows requiring sophisticated reasoning without breaking the budget, Gemini 3 Flash delivers Pro-grade intelligence at Flash-level costs.For complex, regulated workflows requiring strict governance, specific vocabulary enforcement, or integration with complex back-end systems, the modular stack delivers necessary control and auditability without the latency penalties that previously hampered modular designs. Together AI&#x27;s co-located architecture or Retell AI&#x27;s compliance-first orchestration represent the strongest contenders here. The architecture you choose today will determine whether your voice agents can operate in regulated environments — a decision far more consequential than which model sounds most human or scores highest on the latest benchmark.",
          "content": "For the past year, enterprise decision-makers have faced a rigid architectural trade-off in voice AI: adopt a \"Native\" speech-to-speech (S2S) model for speed and emotional fidelity, or stick with a \"Modular\" stack for control and auditability. That binary choice has evolved into distinct market segmentation, driven by two simultaneous forces reshaping the landscape.What was once a performance decision has become a governance and compliance decision, as voice agents move from pilots into regulated, customer-facing workflows.On one side, Google has commoditized the \"raw intelligence\" layer. With the release of Gemini 2.5 Flash and now Gemini 3.0 Flash, Google has positioned itself as the high-volume utility provider with pricing that makes voice automation economically viable for workflows previously too cheap to justify. OpenAI responded in August with a 20% price cut on its Realtime API, narrowing the gap with Gemini to roughly 2x — still meaningful, but no longer insurmountable.On the other side, a new \"Unified\" modular architecture is emerging. By physically co-locating the disparate components of a voice stack-transcription, reasoning and synthesis-providers like Together AI are addressing the latency issues that previously hampered modular designs. This architectural counter-attack delivers native-like speed while retaining the audit trails and intervention points that regulated industries require.Together, these forces are collapsing the historical trade-off between speed and control in enterprise voice systems.For enterprise executives, the question is no longer just about model performance. It&#x27;s a strategic choice between a cost-efficient, generalized utility model and a domain-specific, vertically integrated stack that supports compliance requirements — including whether voice agents can be deployed at scale without introducing audit gaps, regulatory risk, or downstream liability.Understanding the three architectural pathsThese architectural differences are not academic; they directly shape latency, auditability, and the ability to intervene in live voice interactions.The enterprise voice AI market has consolidated around three distinct architectures, each optimized for different trade-offs between speed, control, and cost. S2S models — including Google&#x27;s Gemini Live and OpenAI&#x27;s Realtime API — process audio inputs natively to preserve paralinguistic signals like tone and hesitation. But contrary to popular belief, these aren&#x27;t true end-to-end speech models. They operate as what the industry calls \"Half-Cascades\": Audio understanding happens natively, but the model still performs text-based reasoning before synthesizing speech output. This hybrid approach achieves latency in the 200 to 300ms range, closely mimicking human response times where pauses beyond 200ms become perceptible and feel unnatural. The trade-off is that these intermediate reasoning steps remain opaque to enterprises, limiting auditability and policy enforcement.Traditional chained pipelines represent the opposite extreme. These modular stacks follow a three-step relay: Speech-to-text engines like Deepgram&#x27;s Nova-3 or AssemblyAI&#x27;s Universal-Streaming transcribe audio into text, an LLM generates a response, and text-to-speech providers like ElevenLabs or Cartesia&#x27;s Sonic synthesize the output. Each handoff introduces network transmission time plus processing overhead. While individual components have optimized their processing times to sub-300ms, the aggregate roundtrip latency frequently exceeds 500ms, triggering \"barge-in\" collisions where users interrupt because they assume the agent hasn&#x27;t heard them. Unified infrastructure represents the architectural counter-attack from modular vendors. Together AI physically co-locates STT (Whisper Turbo), LLM (Llama/Mixtral), and TTS models (Rime, Cartesia) on the same GPU clusters. Data moves between components via high-speed memory interconnects rather than the public internet, collapsing total latency to sub-500ms while retaining the modular separation that enterprises require for compliance. Together AI benchmarks TTS latency at approximately 225ms using Mist v2, leaving sufficient headroom for transcription and reasoning within the 500ms budget that defines natural conversation. This architecture delivers the speed of a native model with the control surface of a modular stack — which can be the \"Goldilocks\" solution that addresses both performance and governance requirements simultaneously.The trade-off is increased operational complexity compared to fully managed native systems, but for regulated enterprises that complexity often maps directly to required control.Why latency determines user tolerance — and the metrics that prove itThe difference between a successful voice interaction and an abandoned call often comes down to milliseconds. A single extra second of delay can cut user satisfaction by 16%. Three technical metrics define production readiness:Time to first token (TTFT) measures the delay from the end of user speech to the start of the agent&#x27;s response. Human conversation tolerates roughly 200ms gaps; anything longer feels robotic. Native S2S models achieve 200 to 300ms, while modular stacks must optimize aggressively to stay under 500ms.Word Error Rate (WER) measures transcription accuracy. Deepgram’s Nova-3 delivers 53.4% lower WER for streaming, while AssemblyAI&#x27;s Universal-Streaming claims 41% faster word emission latency. A single transcription error — \"billing\" misheard as \"building\" — corrupts the entire downstream reasoning chain.Real-Time Factor (RTF) measures whether the system processes speech faster than users speak. An RTF below 1.0 is mandatory to prevent lag accumulation. Whisper Turbo runs 5.4x faster than Whisper Large v3, making sub-1.0 RTF achievable at scale without proprietary APIs.The modular advantage: Control and complianceFor regulated industries like healthcare and finance, \"cheap\" and \"fast\" are secondary to governance. Native S2S models function as \"black boxes,\" making it difficult to audit what the model processed before responding. Without visibility into the intermediate steps, enterprises can&#x27;t verify that sensitive data was properly handled or that the agent followed required protocols. These controls are difficult — and in some cases impossible — to implement inside opaque, end-to-end speech systems.The modular approach, on the other hand, maintains a text layer between transcription and synthesis, enabling stateful interventions impossible with end-to-end audio processing. Some use cases include:PII redaction allows compliance engines to scan intermediate text and strip out credit card numbers, patient names, or Social Security numbers before they enter the reasoning model. Retell AI&#x27;s automatic redaction of sensitive personal data from transcripts significantly lowers compliance risk — a feature that Vapi does not natively offer.Memory injection lets enterprises inject domain knowledge or user history into the prompt context before the LLM generates a response, transforming agents from transactional tools into relationship-based systems. Pronunciation authority becomes critical in regulated industries where mispronouncing a drug name or financial term creates liability. Rime&#x27;s Mist v2 focuses on deterministic pronunciation, allowing enterprises to define pronunciation dictionaries that are rigorously adhered to across millions of calls — a capability that native S2S models struggle to guarantee.Architecture comparison matrixThe table below summarizes how each architecture optimizes for a different definition of “production-ready.”FeatureNative S2S (Half-Cascade)Unified Modular (Co-located)Legacy Modular (Chained)Leading PlayersGoogle Gemini 2.5, OpenAI RealtimeTogether AI, Vapi (On-prem)Deepgram + Anthropic + ElevenLabsLatency (TTFT)~200-300ms (Human-level) ~300-500ms (Near-native) >500ms (Noticeable Lag) Cost ProfileBifurcated: Gemini is low utility (~$0.02/min); OpenAI is premium (~$0.30+/min).Moderate/Linear: Sum of components (~$0.15/min). No hidden \"context tax.\"Moderate: Similar to Unified, but higher bandwidth/transport costs.State/MemoryLow: Stateless by default. Hard to inject RAG mid-stream.High: Full control to inject memory/context between STT and LLM.High: Easy RAG integration, but slow.Compliance\"Black Box\": Hard to audit input/output directly.Auditable: Text layer allows for PII redaction and policy checks.Auditable: Full logs available for every step.Best Use CaseHigh-Volume Utility or Concierge.Regulated Enterprise: Healthcare, Finance requiring strict audit trails.Legacy IVR: Simple routing where latency is less critical.The vendor ecosystem: Who&#x27;s winning whereThe enterprise voice AI landscape has fragmented into distinct competitive tiers, each serving different segments with minimal overlap. Infrastructure providers like Deepgram and AssemblyAI compete on transcription speed and accuracy, with Deepgram claiming 40x faster inference than standard cloud services and AssemblyAI countering with better accuracy and speed. Model providers Google and OpenAI compete on price-performance with dramatically different strategies. Google&#x27;s utility positioning makes it the default for high-volume, low-margin workflows, whereas OpenAI defends the premium tier with improved instruction following (30.5% on MultiChallenge benchmark) and enhanced function calling (66.5% on ComplexFuncBench). The gap has narrowed from 15x to 4x in pricing, but OpenAI maintains its edge in emotional expressivity and conversational fluidity - qualities that justify premium pricing for mission-critical interactions.Orchestration platforms Vapi, Retell AI, and Bland AI compete on implementation ease and feature completeness. Vapi&#x27;s developer-first approach appeals to technical teams wanting granular control, while Retell&#x27;s compliance focus (HIPAA, automatic PII redaction) makes it the default for regulated industries. Bland&#x27;s managed service model targets operations teams wanting \"set and forget\" scalability at the cost of flexibility.Unified infrastructure providers like Together AI represent the most significant architectural evolution, collapsing the modular stack into a single offering that delivers native-like latency while retaining component-level control. By co-locating STT, LLM, and TTS on the shared GPU clusters, Together AI achieves sub-500ms total latency with ~225ms for TTS generation using Mist v2.The bottom lineThe market has moved beyond choosing between \"smart\" and \"fast.\" Enterprises must now map their specific requirements — compliance posture, latency tolerance, cost constraints — to the architecture that supports them. For high-volume utility workflows involving routine, low-risk interactions, Google Gemini 2.5 Flash offers unbeatable price-to-performance at approximately 2 cents per minute. For workflows requiring sophisticated reasoning without breaking the budget, Gemini 3 Flash delivers Pro-grade intelligence at Flash-level costs.For complex, regulated workflows requiring strict governance, specific vocabulary enforcement, or integration with complex back-end systems, the modular stack delivers necessary control and auditability without the latency penalties that previously hampered modular designs. Together AI&#x27;s co-located architecture or Retell AI&#x27;s compliance-first orchestration represent the strongest contenders here. The architecture you choose today will determine whether your voice agents can operate in regulated environments — a decision far more consequential than which model sounds most human or scores highest on the latest benchmark.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/1mxFBOFNzUTndabeP1y0h0/913e95cac7d3f5f8b357701893fd5e47/cruey3_Editorial_illustration_showing_a_split_between_two_ent_641822ed-fc12-46d1-908f-ddfefd9f0556_2.png?w=300&q=30"
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2020-11/341eb080-1ec1-11eb-bffb-88f330aaaf35",
      "popularity_score": 2000
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Fri, 26 Dec 2025 16:40:40 +0000",
      "title": "Embark on a visual voyage of art inspired by black holes",
      "neutral_headline": "Embark on a visual voyage of art inspired by black holes",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/embark-on-a-visual-voyage-of-art-inspired-by-black-holes/",
          "published_at": "Fri, 26 Dec 2025 16:40:40 +0000",
          "title": "Embark on a visual voyage of art inspired by black holes",
          "standfirst": "Art and science converge in Lynn Gamwell's book, Conjuring the Void: The Art of Black Holes",
          "content": "Black holes have long captured the imagination of both scientists and the general public. These exotic objects—once thought to be merely hypothetical—have also conceptually inspired countless artists all over the world. A generous sampling of such work is featured in Conjuring the Void: The Art of Black Holes. Author Lynn Gamwell spent ten years as director of the New York Academy of Science's Gallery of Art and Science. She has an extensive background writing about the intersection of math, art, and science. So she was a natural choice to speak at the annual conference of Harvard's interdisciplinary Black Hole Initiative a few years ago. Gamwell focused her talk on the art of black holes, and thus the seeds for what would become Conjuring the Void were sown. \"I was just astounded at how much art there is [about black holes], and I was specifically interested in Asian art,\" Gamwell told Ars. \"There's just something about the concept of a black hole that resonates with the Eastern tradition. So many of the themes—the science of black holes, void, nothingness, being inescapable—relate to the philosophy of Buddhism and Taoism and so on.\"Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/blackhole4-1152x648-1760991049.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/blackhole4-1152x648-1760991049.jpg",
      "popularity_score": 333
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "Being Santa Claus is a year-round calling",
      "neutral_headline": "Being Santa Claus is a year-round calling",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/being-santa-claus-is-a-year-round-calling/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "Being Santa Claus is a year-round calling",
          "standfirst": "",
          "content": "",
          "feed_position": 2
        }
      ],
      "popularity_score": 329.99989361111113
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "How AI coding agents work—and what to remember if you use them",
      "neutral_headline": "How AI coding agents work—and what to remember if you use them",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/how-do-ai-coding-agents-work-we-look-under-the-hood/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "How AI coding agents work—and what to remember if you use them",
          "standfirst": "",
          "content": "",
          "feed_position": 4
        }
      ],
      "popularity_score": 327.99989361111113
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Fri, 26 Dec 2025 13:35:38 +0000",
      "title": "In the ’90s, Wing Commander: Privateer made me realize what kind of games I love",
      "neutral_headline": "In the ’90s, Wing Commander: Privateer made me realize what kind of games I love",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/in-the-90s-wing-commander-privateer-made-me-realize-what-kind-of-games-i-love/",
          "published_at": "Fri, 26 Dec 2025 13:35:38 +0000",
          "title": "In the ’90s, Wing Commander: Privateer made me realize what kind of games I love",
          "standfirst": "Most things Privateer did have been done better, but it's still a classic.",
          "content": "Ever since 1993, I think I've unconsciously judged almost every game by how well it can capture how Wing Commander: Privateer made me feel. Steam and PlayStation (the two platforms I use the most) have been doing a year-in-review summary akin to the wildly popular Spotify Wrapped for the past few years. Based on these, I can report that my most-played games in 2025 were, from most hours down: No Man's Sky Civilization VII Assassin's Creed Shadows The Elder Scrolls IV Oblivion Remastered The Lord of the Rings: Return to Moria The Elder Scrolls III Morrowind World of Warcraft Meridian 59 Tainted Grail: Fall of Avalon Unreal Tournament With the exceptions of Civilization VII and Unreal Tournament, every one of those games is some kind of open-world experience that's all about immersing you in a far-flung land (or galaxy).Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Privateer-splash-image-1152x648-1766445610.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Privateer-splash-image-1152x648-1766445610.png",
      "popularity_score": 323
    },
    {
      "id": "cluster_3",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "SPEED Act passes in House despite changes that threaten clean power projects",
      "neutral_headline": "SPEED Act passes in House despite changes that threaten clean power projects",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/speed-act-passes-in-house-despite-changes-that-threaten-clean-power-projects/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "SPEED Act passes in House despite changes that threaten clean power projects",
          "standfirst": "",
          "content": "",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.99989361111113
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Fri, 26 Dec 2025 12:00:09 +0000",
      "title": "Ars Technica’s Top 20 video games of 2025",
      "neutral_headline": "Ars Technica’s Top 20 video games of 2025",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/ars-technicas-top-20-video-games-of-2025/",
          "published_at": "Fri, 26 Dec 2025 12:00:09 +0000",
          "title": "Ars Technica’s Top 20 video games of 2025",
          "standfirst": "A mix of expected sequels and out-of-nowhere indie gems made 2025 a joy.",
          "content": "When we put together our top 20 games of last year, we specifically called out Civilization 7, Avowed, Doom: The Dark Ages, and Grand Theft Auto 6 as big franchise games we were already looking forward to for 2025. While one of those games has been delayed into 2026, the three others made this year's list of Ars' favorite games as expected. They join a handful of other highly anticipated sequels, ranging from big-budget blockbusters to long-gestating indies, on the \"expected\" side of this year's list. But the games that really stood out for me in 2025 were the ones that seemed to come out of nowhere. Those range from hard-to-categorize roguelike puzzle games to a gonzo, punishing mountainous walking simulation, the best Geometry Wars clone in years, and a touching look at the difficulties of adolescence through the surprisingly effective lens of mini-games. As we look toward 2026, there are plenty of other big-budget projects that the industry is busy preparing for (the delayed Grand Theft Auto VI chief among them). If next year is anything like this year, though, we can look forward to plenty more games that no one saw coming suddenly vaulting into view as new classics.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-best-games-2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-best-games-2025-1152x648.jpg",
      "popularity_score": 310
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "China just carried out its second reusable launch attempt in three weeks",
      "neutral_headline": "China just carried out its second reusable launch attempt in three weeks",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/china-just-carried-out-its-second-reusable-launch-attempt-in-three-weeks/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "China just carried out its second reusable launch attempt in three weeks",
          "standfirst": "",
          "content": "",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.99989361111113
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "OpenAI’s child exploitation reports increased sharply this year",
      "neutral_headline": "OpenAI’s child exploitation reports increased sharply this year",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/openais-child-exploitation-reports-increased-sharply-this-year/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "OpenAI’s child exploitation reports increased sharply this year",
          "standfirst": "",
          "content": "",
          "feed_position": 7
        }
      ],
      "popularity_score": 297.99989361111113
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "FCC’s import ban on the best new drones starts today",
      "neutral_headline": "FCC’s import ban on the best new drones starts today",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/djis-new-drones-will-not-be-available-in-the-us-as-fcc-ban-takes-effect/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "FCC’s import ban on the best new drones starts today",
          "standfirst": "",
          "content": "",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.99989361111113
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "2025-12-27T19:15:48.326Z",
      "title": "“Yo what?” LimeWire re-emerges in online rush to share pulled “60 Minutes” segment",
      "neutral_headline": "“Yo what?” LimeWire re-emerges in online rush to share pulled “60 Minutes” segment",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/yo-what-limewire-re-emerges-in-online-rush-to-share-pulled-60-minutes-segment/",
          "published_at": "2025-12-27T19:15:48.326Z",
          "title": "“Yo what?” LimeWire re-emerges in online rush to share pulled “60 Minutes” segment",
          "standfirst": "",
          "content": "",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.9998933333333
    }
  ]
}