{
  "updated_at": "2025-12-14T11:17:10.978Z",
  "clusters": [
    {
      "id": "cluster_24",
      "coverage": 2,
      "updated_at": "Sat, 13 Dec 2025 20:00:00 GMT",
      "title": "Why most enterprise AI coding pilots underperform (Hint: It's not the model)",
      "neutral_headline": "Why most enterprise AI coding pilots underperform (Hint: It's not the model)",
      "items": [
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/ai/why-most-enterprise-ai-coding-pilots-underperform-hint-its-not-the-model",
          "published_at": "Sat, 13 Dec 2025 20:00:00 GMT",
          "title": "Why most enterprise AI coding pilots underperform (Hint: It's not the model)",
          "standfirst": "Gen AI in software engineering has moved well beyond autocomplete. The emerging frontier is agentic coding: AI systems capable of planning changes, executing them across multiple steps and iterating based on feedback. Yet despite the excitement around “AI agents that code,” most enterprise deployments underperform. The limiting factor is no longer the model. It’s context: The structure, history and intent surrounding the code being changed. In other words, enterprises are now facing a systems design problem: They have not yet engineered the environment these agents operate in.The shift from assistance to agencyThe past year has seen a rapid evolution from assistive coding tools to agentic workflows. Research has begun to formalize what agentic behavior means in practice: The ability to reason across design, testing, execution and validation rather than generate isolated snippets. Work such as dynamic action re-sampling shows that allowing agents to branch, reconsider and revise their own decisions significantly improves outcomes in large, interdependent codebases. At the platform level, providers like GitHub are now building dedicated agent orchestration environments, such as Copilot Agent and Agent HQ, to support multi-agent collaboration inside real enterprise pipelines.But early field results tell a cautionary story. When organizations introduce agentic tools without addressing workflow and environment, productivity can decline. A randomized control study this year showed that developers who used AI assistance in unchanged workflows completed tasks more slowly, largely due to verification, rework and confusion around intent. The lesson is straightforward: Autonomy without orchestration rarely yields efficiency.Why context engineering is the real unlockIn every unsuccessful deployment I’ve observed, the failure stemmed from context. When agents lack a structured understanding of a codebase, specifically its relevant modules, dependency graph, test harness, architectural conventions and change history. They often generate output that appears correct but is disconnected from reality. Too much information overwhelms the agent; too little forces it to guess. The goal is not to feed the model more tokens. The goal is to determine what should be visible to the agent, when and in what form.The teams seeing meaningful gains treat context as an engineering surface. They create tooling to snapshot, compact and version the agent’s working memory: What is persisted across turns, what is discarded, what is summarized and what is linked instead of inlined. They design deliberation steps rather than prompting sessions. They make the specification a first-class artifact, something reviewable, testable and owned, not a transient chat history. This shift aligns with a broader trend some researchers describe as “specs becoming the new source of truth.”Workflow must change alongside toolingBut context alone isn’t enough. Enterprises must re-architect the workflows around these agents. As McKinsey’s 2025 report “One Year of Agentic AI” noted, productivity gains arise not from layering AI onto existing processes but from rethinking the process itself. When teams simply drop an agent into an unaltered workflow, they invite friction: Engineers spend more time verifying AI-written code than they would have spent writing it themselves. The agents can only amplify what’s already structured: Well-tested, modular codebases with clear ownership and documentation. Without those foundations, autonomy becomes chaos.Security and governance, too, demand a shift in mindset. AI-generated code introduces new forms of risk: Unvetted dependencies, subtle license violations and undocumented modules that escape peer review. Mature teams are beginning to integrate agentic activity directly into their CI/CD pipelines, treating agents as autonomous contributors whose work must pass the same static analysis, audit logging and approval gates as any human developer. GitHub’s own documentation highlights this trajectory, positioning Copilot Agents not as replacements for engineers but as orchestrated participants in secure, reviewable workflows. The goal isn’t to let an AI “write everything,” but to ensure that when it acts, it does so inside defined guardrails.What enterprise decision-makers should focus on nowFor technical leaders, the path forward starts with readiness rather than hype. Monoliths with sparse tests rarely yield net gains; agents thrive where tests are authoritative and can drive iterative refinement. This is exactly the loop Anthropic calls out for coding agents. Pilots in tightly scoped domains (test generation, legacy modernization, isolated refactors); treat each deployment as an experiment with explicit metrics (defect escape rate, PR cycle time, change failure rate, security findings burned down). As your usage grows, treat agents as data infrastructure: Every plan, context snapshot, action log and test run is data that composes into a searchable memory of engineering intent, and a durable competitive advantage.Under the hood, agentic coding is less a tooling problem than a data problem. Every context snapshot, test iteration and code revision becomes a form of structured data that must be stored, indexed and reused. As these agents proliferate, enterprises will find themselves managing an entirely new data layer: One that captures not just what was built, but how it was reasoned about. This shift turns engineering logs into a knowledge graph of intent, decision-making and validation. In time, the organizations that can search and replay this contextual memory will outpace those who still treat code as static text.The coming year will likely determine whether agentic coding becomes a cornerstone of enterprise development or another inflated promise. The difference will hinge on context engineering: How intelligently teams design the informational substrate their agents rely on. The winners will be those who see autonomy not as magic, but as an extension of disciplined systems design:Clear workflows, measurable feedback, and rigorous governance.Bottom linePlatforms are converging on orchestration and guardrails, and research keeps improving context control at inference time. The winners over the next 12 to 24 months won’t be the teams with the flashiest model; they’ll be the ones that engineer context as an asset and treat workflow as the product. Do that, and autonomy compounds. Skip it, and the review queue does.Context + agent = leverage. Skip the first half, and the rest collapses.Dhyey Mavani is accelerating generative AI at LinkedIn.Read more from our guest writers. Or, consider submitting a post of your own! See our guidelines here.",
          "content": "Gen AI in software engineering has moved well beyond autocomplete. The emerging frontier is agentic coding: AI systems capable of planning changes, executing them across multiple steps and iterating based on feedback. Yet despite the excitement around “AI agents that code,” most enterprise deployments underperform. The limiting factor is no longer the model. It’s context: The structure, history and intent surrounding the code being changed. In other words, enterprises are now facing a systems design problem: They have not yet engineered the environment these agents operate in.The shift from assistance to agencyThe past year has seen a rapid evolution from assistive coding tools to agentic workflows. Research has begun to formalize what agentic behavior means in practice: The ability to reason across design, testing, execution and validation rather than generate isolated snippets. Work such as dynamic action re-sampling shows that allowing agents to branch, reconsider and revise their own decisions significantly improves outcomes in large, interdependent codebases. At the platform level, providers like GitHub are now building dedicated agent orchestration environments, such as Copilot Agent and Agent HQ, to support multi-agent collaboration inside real enterprise pipelines.But early field results tell a cautionary story. When organizations introduce agentic tools without addressing workflow and environment, productivity can decline. A randomized control study this year showed that developers who used AI assistance in unchanged workflows completed tasks more slowly, largely due to verification, rework and confusion around intent. The lesson is straightforward: Autonomy without orchestration rarely yields efficiency.Why context engineering is the real unlockIn every unsuccessful deployment I’ve observed, the failure stemmed from context. When agents lack a structured understanding of a codebase, specifically its relevant modules, dependency graph, test harness, architectural conventions and change history. They often generate output that appears correct but is disconnected from reality. Too much information overwhelms the agent; too little forces it to guess. The goal is not to feed the model more tokens. The goal is to determine what should be visible to the agent, when and in what form.The teams seeing meaningful gains treat context as an engineering surface. They create tooling to snapshot, compact and version the agent’s working memory: What is persisted across turns, what is discarded, what is summarized and what is linked instead of inlined. They design deliberation steps rather than prompting sessions. They make the specification a first-class artifact, something reviewable, testable and owned, not a transient chat history. This shift aligns with a broader trend some researchers describe as “specs becoming the new source of truth.”Workflow must change alongside toolingBut context alone isn’t enough. Enterprises must re-architect the workflows around these agents. As McKinsey’s 2025 report “One Year of Agentic AI” noted, productivity gains arise not from layering AI onto existing processes but from rethinking the process itself. When teams simply drop an agent into an unaltered workflow, they invite friction: Engineers spend more time verifying AI-written code than they would have spent writing it themselves. The agents can only amplify what’s already structured: Well-tested, modular codebases with clear ownership and documentation. Without those foundations, autonomy becomes chaos.Security and governance, too, demand a shift in mindset. AI-generated code introduces new forms of risk: Unvetted dependencies, subtle license violations and undocumented modules that escape peer review. Mature teams are beginning to integrate agentic activity directly into their CI/CD pipelines, treating agents as autonomous contributors whose work must pass the same static analysis, audit logging and approval gates as any human developer. GitHub’s own documentation highlights this trajectory, positioning Copilot Agents not as replacements for engineers but as orchestrated participants in secure, reviewable workflows. The goal isn’t to let an AI “write everything,” but to ensure that when it acts, it does so inside defined guardrails.What enterprise decision-makers should focus on nowFor technical leaders, the path forward starts with readiness rather than hype. Monoliths with sparse tests rarely yield net gains; agents thrive where tests are authoritative and can drive iterative refinement. This is exactly the loop Anthropic calls out for coding agents. Pilots in tightly scoped domains (test generation, legacy modernization, isolated refactors); treat each deployment as an experiment with explicit metrics (defect escape rate, PR cycle time, change failure rate, security findings burned down). As your usage grows, treat agents as data infrastructure: Every plan, context snapshot, action log and test run is data that composes into a searchable memory of engineering intent, and a durable competitive advantage.Under the hood, agentic coding is less a tooling problem than a data problem. Every context snapshot, test iteration and code revision becomes a form of structured data that must be stored, indexed and reused. As these agents proliferate, enterprises will find themselves managing an entirely new data layer: One that captures not just what was built, but how it was reasoned about. This shift turns engineering logs into a knowledge graph of intent, decision-making and validation. In time, the organizations that can search and replay this contextual memory will outpace those who still treat code as static text.The coming year will likely determine whether agentic coding becomes a cornerstone of enterprise development or another inflated promise. The difference will hinge on context engineering: How intelligently teams design the informational substrate their agents rely on. The winners will be those who see autonomy not as magic, but as an extension of disciplined systems design:Clear workflows, measurable feedback, and rigorous governance.Bottom linePlatforms are converging on orchestration and guardrails, and research keeps improving context control at inference time. The winners over the next 12 to 24 months won’t be the teams with the flashiest model; they’ll be the ones that engineer context as an asset and treat workflow as the product. Do that, and autonomy compounds. Skip it, and the review queue does.Context + agent = leverage. Skip the first half, and the rest collapses.Dhyey Mavani is accelerating generative AI at LinkedIn.Read more from our guest writers. Or, consider submitting a post of your own! See our guidelines here.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/38oJ3yjcAb67Hunz4whpDs/5e419481c52a1deafddb26fc2af21f57/DDM_Coding.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/openai-signs-deal-to-bring-disney-characters-to-sora-and-chatgpt-144344820.html",
          "published_at": "Fri, 12 Dec 2025 21:11:20 +0000",
          "title": "OpenAI signs deal to bring Disney characters to Sora and ChatGPT",
          "standfirst": "It looks like Disney wasted no time delivering on CEO Bob Iger’s promise to bring AI-generated content to Disney+. On Thursday, the company announced the start of a three-year licensing agreement with OpenAI to bring more than 200 of its beloved characters, including those from Star Wars and Pixar, to the Sora app and ChatGPT. With the deal in place, OpenAI users will be able to prompt ChatGPT to generate images that tap into Disney’s intellectual property, with costumes, props, vehicles and environments covered. The agreement does not include voices or “talent likenesses,” meaning Sora users won’t be able prompt the app to make a video with Black Widow and get something with Scarlett Johansson in it. Instead, both Sora and ChatGPT will only have access to animated and illustrated versions of Marvel and Star Wars characters like Black Panther, Captain America, Han Solo, Darth Vader and others. Disney will stream “curated selections” of Sora-generated fan videos on Disney+. Sora and ChatGPT users will be able to start generating images and videos with Disney characters starting in early 2026. “Disney is the global gold standard for storytelling, and we’re excited to partner to allow Sora and ChatGPT Images to expand the way people create and experience great content,” said OpenAI CEO Sam Altman. “This agreement shows how AI companies and creative leaders can work together responsibly to promote innovation that benefits society, respect the importance of creativity, and help works reach vast new audiences.”Disney has also agreed to become an OpenAI customer, promising to use the company’s APIs to build new products, tools and experiences. Additionally, Disney will invest $1 billion in OpenAI, with the option to purchase additional equity down the road. OpenAI recently completed a restructuring to become more of traditional profit-seeking corporation, clearing the way for a potential IPO sometime in the next year or so. Still, the pact brings together two unlikely bedfellows who have been on opposite sides of the copyright debate. Reaction from the entertainment industry was mixed. In a statement released on Bluesky, The Writers Guild of America, which represents writers across film, television and other media, made it clear it is unhappy with the deal:“Disney’s deal with OpenAI appears to sanction its theft of our work and cedes the value of what we create to a tech company that has built its business off our backs. We will meet with Disney to probe the terms of this deal, including the extent to which user-generated videoes will use the work of WGA members. We will continue to fight to protect our members’ creative and economic interests in the context of AI technology.”SAG-AFTRA, the screen actors union which has around 160,000 members worldwide, was less incendiary. It posted a notice on its site saying that both Disney and OpenAI had reached out to the union to give “their assurances that they will meet their contractual and legal obligations to performers.” The union noted it would “closely monitor the deal and its implementation to ensure compliance with our contracts and with applicable laws protecting image, voice, and likeness.”Update, December 11, 5:45PM ET: This story was updated after publish to include comment from the Writers Guild of America and SAG-AFTRA.This article originally appeared on Engadget at https://www.engadget.com/ai/openai-signs-deal-to-bring-disney-characters-to-sora-and-chatgpt-144344820.html?src=rss",
          "content": "It looks like Disney wasted no time delivering on CEO Bob Iger’s promise to bring AI-generated content to Disney+. On Thursday, the company announced the start of a three-year licensing agreement with OpenAI to bring more than 200 of its beloved characters, including those from Star Wars and Pixar, to the Sora app and ChatGPT. With the deal in place, OpenAI users will be able to prompt ChatGPT to generate images that tap into Disney’s intellectual property, with costumes, props, vehicles and environments covered. The agreement does not include voices or “talent likenesses,” meaning Sora users won’t be able prompt the app to make a video with Black Widow and get something with Scarlett Johansson in it. Instead, both Sora and ChatGPT will only have access to animated and illustrated versions of Marvel and Star Wars characters like Black Panther, Captain America, Han Solo, Darth Vader and others. Disney will stream “curated selections” of Sora-generated fan videos on Disney+. Sora and ChatGPT users will be able to start generating images and videos with Disney characters starting in early 2026. “Disney is the global gold standard for storytelling, and we’re excited to partner to allow Sora and ChatGPT Images to expand the way people create and experience great content,” said OpenAI CEO Sam Altman. “This agreement shows how AI companies and creative leaders can work together responsibly to promote innovation that benefits society, respect the importance of creativity, and help works reach vast new audiences.”Disney has also agreed to become an OpenAI customer, promising to use the company’s APIs to build new products, tools and experiences. Additionally, Disney will invest $1 billion in OpenAI, with the option to purchase additional equity down the road. OpenAI recently completed a restructuring to become more of traditional profit-seeking corporation, clearing the way for a potential IPO sometime in the next year or so. Still, the pact brings together two unlikely bedfellows who have been on opposite sides of the copyright debate. Reaction from the entertainment industry was mixed. In a statement released on Bluesky, The Writers Guild of America, which represents writers across film, television and other media, made it clear it is unhappy with the deal:“Disney’s deal with OpenAI appears to sanction its theft of our work and cedes the value of what we create to a tech company that has built its business off our backs. We will meet with Disney to probe the terms of this deal, including the extent to which user-generated videoes will use the work of WGA members. We will continue to fight to protect our members’ creative and economic interests in the context of AI technology.”SAG-AFTRA, the screen actors union which has around 160,000 members worldwide, was less incendiary. It posted a notice on its site saying that both Disney and OpenAI had reached out to the union to give “their assurances that they will meet their contractual and legal obligations to performers.” The union noted it would “closely monitor the deal and its implementation to ensure compliance with our contracts and with applicable laws protecting image, voice, and likeness.”Update, December 11, 5:45PM ET: This story was updated after publish to include comment from the Writers Guild of America and SAG-AFTRA.This article originally appeared on Engadget at https://www.engadget.com/ai/openai-signs-deal-to-bring-disney-characters-to-sora-and-chatgpt-144344820.html?src=rss",
          "feed_position": 6
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/science/in-2025-ai-and-evs-gave-the-us-an-insatiable-hunger-for-power-133000673.html",
          "published_at": "Fri, 12 Dec 2025 13:30:00 +0000",
          "title": "In 2025, AI and EVs gave the US an insatiable hunger for power",
          "standfirst": "You may be surprised to learn electricity only accounts for 21 percent of the world’s energy consumption. Fossil fuels and the rest all play their part to make the world go around, but their role is likely to diminish no matter what happens. The International Energy Agency believes electricity’s share of global energy consumption is going to double in the next decade alone. You all know the causes: Electrification, EVs, data centers and AI mean the planet needs to dramatically increase its power generation, transmission and storage capacity. It’s a shame, then, that the world is nowhere near ready to satisfy such an outrageous surge in demand. Re-learning to love the atomThe US has certainly spent the year opening doors to dramatically increase domestic energy production. Part of that has to give the signal that the US will embrace nuclear power in ways it hasn’t for generations. This January, an executive order titled Unleashing American Energy included an instruction for the government to eliminate rules and regulations related to power generation. Its primary focus was to destroy environmental regulations limiting the extraction of oil, natural gas and coal, but also to remove roadblocks to the construction of new nuclear plants. Then, in May, a subsequent order declared a desire to ensure the deployment of “advanced nuclear technologies.” As the driving force behind the AI push, big tech has made some high profile moves to buy up extra generation capacity. Meta signed a 20-year deal with Constellation to own the output of the Clinton Power Station, preserving the 1.1GW facility once its state tax credit expires next year. Microsoft has its own 20-year deal with Constellation to own the power generated by reactor 1 at Three Mile Island, now renamed the Crane Clean Energy Center. On November 18, that project was also given the backing of the Department of Energy which authorized a $1 billion loan. But even without the backing of big tech, other mothballed reactors are being restarted, like the Palisades plant in Michigan. Earlier this year, the Department of Energy handed out a $1.52 billion loan to get the facility, capable of generating 800MW, back up and running. Big tech is also betting on the future of nuclear power, signing deals with a number of startups looking to build out a new generation of reactors. Google, for instance, has backed Kairos Power and its plan to build a series of small, modular reactors. Amazon, meanwhile, invested in X-Energy and has published plans for its own buildout in Washington State. It’s not just the US that is learning to fall back in love with nuclear power, as the rest of the world is also building out new capacity. The World Nuclear Association says there are 70 reactors currently under construction across 15 countries. Russia, India, Argentina, Turkey, South Korea, Japan, and Brazil, to name just a few, are all working on new reactors. China on its own is presently building 33 reactors and, as Nuclear Business Platform reported earlier this year, greenlit a further 10 this April. That same report adds that China’s policy of producing multiple reactors at a time has seen costs crater. It says that while the UK’s two new reactors at Hinkley Point will cost in excess of $60 billion, each of these new reactors will cost $2.7 billion. Bridging the nuclear gapcoal handling in a portIndigo Division via Getty ImagesBuilding a nuclear reactor is not a swift process, and construction of a facility can take the better part of a decade. You can add on a few more years if you include the necessary procedural steps that need to be undertaken before a single piece of concrete is poured. Consequently, any major shift in the US’ power generation fleet will be measured in generations, rather than years. It’s a concern that, for all of the attention nuclear power is getting, it’s merely a smokescreen for a renewed push for fossil fuel extraction.After all, one major casualty from the Big, Beautiful Bill was the eradication of subsidies for the US’ solar industry. As we reported back in July, the act has kicked the legs out from domestic solar panel manufacturing, handing renewable energy dominance to China. This goes hand in hand with the US Department of Energy setting up a $625 million funding stream to revive America’s coal industry and recommission old power plants. Or that it is also awarding contracts to grow America’s strategic petroleum reserve. Back in September, Energy Secretary Chris Wright made the implausible claim to BBC News that fossil fuel extraction was nothing to worry about as fusion power would be on the grid in the next decade. Wright, himself the former CEO of fracking company Liberty Energy, was taken to task by a number of climate experts for publishing a report riddled with “misleading or fundamentally incorrect” assertions. Similarly, on November 20, the Department of Energy reshuffled its org chart to eliminate several departments responsible for renewable energy and energy efficiency while forming the Office of Fusion. Solar’s unstoppable riseThis stunning aerial view captures an array of solar panels arranged in neat, parallel rows across the landscape. From above, the panels shimmer under the bright sunlight, creating a striking contrast against the natural terrain below. The organized rows of solar panels stretch across acres of land, symbolizing the growing global shift toward renewable energy. The grid-like pattern highlights the efficiency and scale of modern solar farms, contributing to sustainable energy production.This high-resolution image showcases the incredible reach and potential of solar power as a clean, renewable energy source. Whether situated in rural fields, expansive deserts, or atop rooftops, these solar panels represent a major step toward reducing carbon footprints and combating climate change. The solar farm's orderly rows and reflective surfaces create a visually appealing scene, demonstrating both technological innovation and environmental responsibility.Diane Keough via Getty ImagesThe US may have kneecapped its domestic solar industry, but it may not be enough to defeat renewables’ momentum. In October, the International Energy Agency projected renewable energy will grow by 4.6 TW by 2030 — a figure equal to the combined generation capacity of China, the EU and Japan combined. 77 percent of that figure is expected to come from solar power alone, despite the loss of subsidies in the US and less favorable circumstances in China. The domestic US forecast has been revised downward significantly as a consequence of its policy choices. But despite this, the obvious benefits of solar power haven’t gone away even if the price may be higher than it was at the start of the year. It remains the fastest and cheapest way to add new power in many countries, and can be installed on a grid or individual basis. Not to mention its utility in remote areas with poor generation resources, where it can reduce dependency on fossil fuels. This year, clean energy think-tank Ember reported on the growth of solar power in the last decade, and how it went from adding just one percent of global power generation in 2015 to 8.8 percent in the first half of 2025.“AI demand for electricity is the macro driver of US made solar,” said Rob Gardner, VP at the Solar Manufacturers for America Coalition. “AI investments can’t deliver expected returns without quickly deployed power, and US solar is the fastest and cheapest to deploy,” he said. Gardner cited a recent FERC forecast which predicts that 92.6GW of solar will come online between now and July 2028. The dream of fusionConstruction inside the reactor of ITER.ITERThe US is pinning a lot of its hopes on fusion power to wipe away the debt of our fossil fuel past. Earlier this year, the Department of Energy released a roadmap to get fusion out of the lab and into the world. It wants to coordinate the remaining resources of the federal government to close the fusion world’s “critical science, materials and technology gaps.” In the next three years, officials have been tasked with designing facilities for reactors and developing sources of fuel. Within the next decade, it’s hoped the government will be able to offer large-scale fuel cycle plants to help private sector plants start operations.If fusion power can be harnessed, it has many of the same upsides as nuclear fission with a lot fewer downsides. If nuclear fission harnesses the energy released when an atom is broken apart, then fusion harnesses the energy released when two smaller atoms are smashed together to create a larger one. It harnesses the same principle as you’ll find inside our sun: Superheated hydrogen atoms fusing to create helium. And while nuclear fusion requires radioactive material, we can source deuterium and tritium from water and lithium. ITER (International Thermonuclear Experimental Reactor) is a giant experimental fusion reactor under construction in France which, when operational, will be the world’s largest. It is backed by a coalition of nations, including the US, EU and China, and has the aim of both generating power and developing the technologies necessary to make Fusion a reality. The organization claims that there is enough of both materials available on the planet to run fusion plants for at least a thousand years, if not longer. There are also a raft of safety benefits, as there’s no creation of the sort of long-lived and dangerous waste associated with nuclear power, no risk of a meltdown, and its raw materials can’t be used to make weapons. But while fusion is entirely possible, and on paper could be the salve to all of the world’s energy ills, it’s not yet a reality. There are a large number of engineering challenges sitting between us and a viable commercial reactor. The shift that has happened this year is that fusion is now being treated as a “strategic national priority,” according to the International Atomic Energy Agency. More than 160 fusion facilities are operational worldwide, each one looking to explore ways of solving the hard problems standing between us and limitless power.But as well as ITER, there are other major nations working to build out their own fusion capacity. The biggest would likely be China’s Experimental Advanced Superconducting Tokamak (EAST) which has already set a record for energy generation. At the start of this year, it was able to produce a steady state for 1,066 seconds. But what we are seeing now, which may offer some degree of hope, is the surge in interest from the private sector. Companies like Commonwealth Fusion, Type One Energy, Helion and Pacific Fusion are all working on their own fusion facilities. These projects have received billions in funding, but it’s likely all will need time to work out if their approaches are viable. Stuart White is a spokesperson for Tokamak Energy, a British-Japanese startup spun out from the UK’s Atomic Energy Authority which is developing its own fusion technologies. In 2022, the company’s own reactor was able to reach a plasma temperature of 100 million degrees celsius. “It’s an incredible achievement but that isn’t going to power homes around the UK or anywhere,” he said. White believes the fusion world will spend the next decade “scaling up,” projects to find the right pathway to building commercial reactors. He cited national programs, like the UK’s STEP which is targeted to begin working in 2040, while the US’ plan for the mid-2030s he feels is “aggressive.”White also explained that, as equally important as solving the key physics issues, is building out the supply chain to actually make the equipment. He cited the importance of manufacturing in Japan and China to produce the hardware necessary to build fusion reactors. And that this process, while time consuming now, will help accelerate the eventual development of the technology down the line. White added that another positive sign is that regulators aren’t likely to want to scrutinize fusion reactors with the same intensity as they do nuclear reactors. That will both speed up the construction of new facilities and reduce costs when they do eventually enter service. What’s clear, however, is that Fusion is not going to be able to swoop in and decarbonize the world’s energy needs in the sort of time scale it’s likely to be required. (White said it is likely to arrive in time to complement other clean sources of energy over the next half century, rather than so quickly that every other power station gets mothballed instantly.) Consequently, the government of the world must keep prioritizing the rollout of renewables rather than hoping that fusion will simply bail everyone out in the next decade.This article originally appeared on Engadget at https://www.engadget.com/science/in-2025-ai-and-evs-gave-the-us-an-insatiable-hunger-for-power-133000673.html?src=rss",
          "content": "You may be surprised to learn electricity only accounts for 21 percent of the world’s energy consumption. Fossil fuels and the rest all play their part to make the world go around, but their role is likely to diminish no matter what happens. The International Energy Agency believes electricity’s share of global energy consumption is going to double in the next decade alone. You all know the causes: Electrification, EVs, data centers and AI mean the planet needs to dramatically increase its power generation, transmission and storage capacity. It’s a shame, then, that the world is nowhere near ready to satisfy such an outrageous surge in demand. Re-learning to love the atomThe US has certainly spent the year opening doors to dramatically increase domestic energy production. Part of that has to give the signal that the US will embrace nuclear power in ways it hasn’t for generations. This January, an executive order titled Unleashing American Energy included an instruction for the government to eliminate rules and regulations related to power generation. Its primary focus was to destroy environmental regulations limiting the extraction of oil, natural gas and coal, but also to remove roadblocks to the construction of new nuclear plants. Then, in May, a subsequent order declared a desire to ensure the deployment of “advanced nuclear technologies.” As the driving force behind the AI push, big tech has made some high profile moves to buy up extra generation capacity. Meta signed a 20-year deal with Constellation to own the output of the Clinton Power Station, preserving the 1.1GW facility once its state tax credit expires next year. Microsoft has its own 20-year deal with Constellation to own the power generated by reactor 1 at Three Mile Island, now renamed the Crane Clean Energy Center. On November 18, that project was also given the backing of the Department of Energy which authorized a $1 billion loan. But even without the backing of big tech, other mothballed reactors are being restarted, like the Palisades plant in Michigan. Earlier this year, the Department of Energy handed out a $1.52 billion loan to get the facility, capable of generating 800MW, back up and running. Big tech is also betting on the future of nuclear power, signing deals with a number of startups looking to build out a new generation of reactors. Google, for instance, has backed Kairos Power and its plan to build a series of small, modular reactors. Amazon, meanwhile, invested in X-Energy and has published plans for its own buildout in Washington State. It’s not just the US that is learning to fall back in love with nuclear power, as the rest of the world is also building out new capacity. The World Nuclear Association says there are 70 reactors currently under construction across 15 countries. Russia, India, Argentina, Turkey, South Korea, Japan, and Brazil, to name just a few, are all working on new reactors. China on its own is presently building 33 reactors and, as Nuclear Business Platform reported earlier this year, greenlit a further 10 this April. That same report adds that China’s policy of producing multiple reactors at a time has seen costs crater. It says that while the UK’s two new reactors at Hinkley Point will cost in excess of $60 billion, each of these new reactors will cost $2.7 billion. Bridging the nuclear gapcoal handling in a portIndigo Division via Getty ImagesBuilding a nuclear reactor is not a swift process, and construction of a facility can take the better part of a decade. You can add on a few more years if you include the necessary procedural steps that need to be undertaken before a single piece of concrete is poured. Consequently, any major shift in the US’ power generation fleet will be measured in generations, rather than years. It’s a concern that, for all of the attention nuclear power is getting, it’s merely a smokescreen for a renewed push for fossil fuel extraction.After all, one major casualty from the Big, Beautiful Bill was the eradication of subsidies for the US’ solar industry. As we reported back in July, the act has kicked the legs out from domestic solar panel manufacturing, handing renewable energy dominance to China. This goes hand in hand with the US Department of Energy setting up a $625 million funding stream to revive America’s coal industry and recommission old power plants. Or that it is also awarding contracts to grow America’s strategic petroleum reserve. Back in September, Energy Secretary Chris Wright made the implausible claim to BBC News that fossil fuel extraction was nothing to worry about as fusion power would be on the grid in the next decade. Wright, himself the former CEO of fracking company Liberty Energy, was taken to task by a number of climate experts for publishing a report riddled with “misleading or fundamentally incorrect” assertions. Similarly, on November 20, the Department of Energy reshuffled its org chart to eliminate several departments responsible for renewable energy and energy efficiency while forming the Office of Fusion. Solar’s unstoppable riseThis stunning aerial view captures an array of solar panels arranged in neat, parallel rows across the landscape. From above, the panels shimmer under the bright sunlight, creating a striking contrast against the natural terrain below. The organized rows of solar panels stretch across acres of land, symbolizing the growing global shift toward renewable energy. The grid-like pattern highlights the efficiency and scale of modern solar farms, contributing to sustainable energy production.This high-resolution image showcases the incredible reach and potential of solar power as a clean, renewable energy source. Whether situated in rural fields, expansive deserts, or atop rooftops, these solar panels represent a major step toward reducing carbon footprints and combating climate change. The solar farm's orderly rows and reflective surfaces create a visually appealing scene, demonstrating both technological innovation and environmental responsibility.Diane Keough via Getty ImagesThe US may have kneecapped its domestic solar industry, but it may not be enough to defeat renewables’ momentum. In October, the International Energy Agency projected renewable energy will grow by 4.6 TW by 2030 — a figure equal to the combined generation capacity of China, the EU and Japan combined. 77 percent of that figure is expected to come from solar power alone, despite the loss of subsidies in the US and less favorable circumstances in China. The domestic US forecast has been revised downward significantly as a consequence of its policy choices. But despite this, the obvious benefits of solar power haven’t gone away even if the price may be higher than it was at the start of the year. It remains the fastest and cheapest way to add new power in many countries, and can be installed on a grid or individual basis. Not to mention its utility in remote areas with poor generation resources, where it can reduce dependency on fossil fuels. This year, clean energy think-tank Ember reported on the growth of solar power in the last decade, and how it went from adding just one percent of global power generation in 2015 to 8.8 percent in the first half of 2025.“AI demand for electricity is the macro driver of US made solar,” said Rob Gardner, VP at the Solar Manufacturers for America Coalition. “AI investments can’t deliver expected returns without quickly deployed power, and US solar is the fastest and cheapest to deploy,” he said. Gardner cited a recent FERC forecast which predicts that 92.6GW of solar will come online between now and July 2028. The dream of fusionConstruction inside the reactor of ITER.ITERThe US is pinning a lot of its hopes on fusion power to wipe away the debt of our fossil fuel past. Earlier this year, the Department of Energy released a roadmap to get fusion out of the lab and into the world. It wants to coordinate the remaining resources of the federal government to close the fusion world’s “critical science, materials and technology gaps.” In the next three years, officials have been tasked with designing facilities for reactors and developing sources of fuel. Within the next decade, it’s hoped the government will be able to offer large-scale fuel cycle plants to help private sector plants start operations.If fusion power can be harnessed, it has many of the same upsides as nuclear fission with a lot fewer downsides. If nuclear fission harnesses the energy released when an atom is broken apart, then fusion harnesses the energy released when two smaller atoms are smashed together to create a larger one. It harnesses the same principle as you’ll find inside our sun: Superheated hydrogen atoms fusing to create helium. And while nuclear fusion requires radioactive material, we can source deuterium and tritium from water and lithium. ITER (International Thermonuclear Experimental Reactor) is a giant experimental fusion reactor under construction in France which, when operational, will be the world’s largest. It is backed by a coalition of nations, including the US, EU and China, and has the aim of both generating power and developing the technologies necessary to make Fusion a reality. The organization claims that there is enough of both materials available on the planet to run fusion plants for at least a thousand years, if not longer. There are also a raft of safety benefits, as there’s no creation of the sort of long-lived and dangerous waste associated with nuclear power, no risk of a meltdown, and its raw materials can’t be used to make weapons. But while fusion is entirely possible, and on paper could be the salve to all of the world’s energy ills, it’s not yet a reality. There are a large number of engineering challenges sitting between us and a viable commercial reactor. The shift that has happened this year is that fusion is now being treated as a “strategic national priority,” according to the International Atomic Energy Agency. More than 160 fusion facilities are operational worldwide, each one looking to explore ways of solving the hard problems standing between us and limitless power.But as well as ITER, there are other major nations working to build out their own fusion capacity. The biggest would likely be China’s Experimental Advanced Superconducting Tokamak (EAST) which has already set a record for energy generation. At the start of this year, it was able to produce a steady state for 1,066 seconds. But what we are seeing now, which may offer some degree of hope, is the surge in interest from the private sector. Companies like Commonwealth Fusion, Type One Energy, Helion and Pacific Fusion are all working on their own fusion facilities. These projects have received billions in funding, but it’s likely all will need time to work out if their approaches are viable. Stuart White is a spokesperson for Tokamak Energy, a British-Japanese startup spun out from the UK’s Atomic Energy Authority which is developing its own fusion technologies. In 2022, the company’s own reactor was able to reach a plasma temperature of 100 million degrees celsius. “It’s an incredible achievement but that isn’t going to power homes around the UK or anywhere,” he said. White believes the fusion world will spend the next decade “scaling up,” projects to find the right pathway to building commercial reactors. He cited national programs, like the UK’s STEP which is targeted to begin working in 2040, while the US’ plan for the mid-2030s he feels is “aggressive.”White also explained that, as equally important as solving the key physics issues, is building out the supply chain to actually make the equipment. He cited the importance of manufacturing in Japan and China to produce the hardware necessary to build fusion reactors. And that this process, while time consuming now, will help accelerate the eventual development of the technology down the line. White added that another positive sign is that regulators aren’t likely to want to scrutinize fusion reactors with the same intensity as they do nuclear reactors. That will both speed up the construction of new facilities and reduce costs when they do eventually enter service. What’s clear, however, is that Fusion is not going to be able to swoop in and decarbonize the world’s energy needs in the sort of time scale it’s likely to be required. (White said it is likely to arrive in time to complement other clean sources of energy over the next half century, rather than so quickly that every other power station gets mothballed instantly.) Consequently, the government of the world must keep prioritizing the rollout of renewables rather than hoping that fusion will simply bail everyone out in the next decade.This article originally appeared on Engadget at https://www.engadget.com/science/in-2025-ai-and-evs-gave-the-us-an-insatiable-hunger-for-power-133000673.html?src=rss",
          "feed_position": 17,
          "image_url": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/a92d7c30-9d6a-11f0-b34f-f4800ebc779d"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/general/the-morning-after-engadget-newsletter-121506303.html",
          "published_at": "Fri, 12 Dec 2025 12:15:06 +0000",
          "title": "The Morning After: Tech’s biggest losers of 2025",
          "standfirst": "Honestly, compiling the biggest losers for Engadget is more fun than talking up the winners. While we reviewed nothing as atrocious as those ill-fated AI assistant gadgets from 2024, AI companies and services straddled both the winner and loser podiums. The losers might be you, the American consumer. (Sorry.) In the US, anyone wanting a drone will have to find something that isn’t made by DJI. The company has been targeted by regulators since 2017 over concerns its products could spy on sensitive US infrastructure on behalf of China. Engadget The problem is DJI has such a high market share (over 75 percent) that its absence will effectively upend the industry. Oh, and its drones are consistently the best too. The US government hasn’t yet attempted to work with DJI to assess whether its products pose a risk. DJI recently made a final plea for a security review, sending letters to five US agencies that could assess its products. If that fails, US drone options will shrink massively. In the same 12 months, EV sales across the globe are up around 25 percent this year. Germany set a record in the first half of 2025, with electric cars accounting for nearly one in five new registrations. In China, EV sales are growing so fast (over 50 percent market share) that the country is flooding the global market with gas-powered cars it can’t sell at home. However — remember this is about losers — in the US, the Trump administration ended the EV tax credit. And shock! Sales of EVs in the US slumped, with some automakers, such as Ford, seeing a 60 percent year-over-year decline. As Sam Rutherford puts it, this policy change puts more roadblocks (his inadvertent pun, not mine) in the way of making cheaper battery-powered cars. It also affects EV investment and could mean US automakers fall even further behind their rivals elsewhere. We also point and shake our heads at Xbox, Grok and TV streaming. Check it all out right here. — Mat Smith The other big stories (and deals) this morning Kindle Scribe Colorsoft review-in-progress Control Resonant steps into a larger world inspired by Neon Genesis Evangelion OpenAI’s house of cards seems primed to collapse Trump orders creation of litigation task force to challenge state AI laws All the winners (and everything announced) at The Game Awards 2025 News, trailers and award winners. Most of which are Clair Obscur. Remedy If you missed The Game Awards 2025, you missed a historic sweep by Sandfall Interactive’s Clair Obscur: Expedition 33. The Belle Epoque saga, which was expected to win several categories, even bagged Game of the Year and eventually picked up more wins than any title in the show’s 12-year history. Naturally, there were trailers and game reveals too, which were pleasantly notable. We got a first look at the Control sequel, Resonant, Star Wars: Fate of The Old Republic is coming, headed by Mass Effect veterans, while Larian Studios is returning to the Divinity series following the success of Baldur’s Gate 3. Heck, if you want a good chance of winning at The Game Awards, hire Jennifer English to voice one of your main characters — she was in both BG3 and Clair Obscur. Continue reading. OpenAI signs deal to bring Disney characters to Sora and ChatGPT Slop Wars, Toy Sloppy and more! Disney announced a three-year licensing agreement with OpenAI to bring more than 200 of its characters, including those from Star Wars and Pixar, to the Sora app and ChatGPT. With the deal in place, OpenAI users will be able to prompt ChatGPT to generate images that tap into Disney’s intellectual property, with costumes, props, vehicles and environments covered. Additionally, Disney will invest $1 billion in OpenAI, with the option to purchase additional equity down the road. Continue reading. MasterClass subscriptions are 40 percent off for the holiday season Learn about tennis from Serena Williams or music from John Legend. If you’re struggling to find a good present for the holidays, MasterClass has discounted its subscriptions by up to 40 percent. I secured a similar deal for myself and was pleasantly surprised by the solid interface and the number of courses. I also forgot to update my subscription, whoops. Maybe this offer will get me back on board. Continue reading. Amazon’s AI-generated recap tool didn’t watch Fallout very closely It’s already getting the details wrong on its own shows. Amazon’s plan to offer AI-generated recaps of Prime Video shows isn’t off to a great start. The company’s recap of the first season of Fallout has multiple errors. First, the AI-generated recap incorrectly identifies the era of the show’s Los Angeles-set flashbacks as being the 1950s — they’re actually 2077. Perhaps more egregiously for a recap, it misunderstands the ending of the first season, which sets up season two’s partnership between vault dweller Lucy and The Ghoul. Continue reading.This article originally appeared on Engadget at https://www.engadget.com/general/the-morning-after-engadget-newsletter-121506303.html?src=rss",
          "content": "Honestly, compiling the biggest losers for Engadget is more fun than talking up the winners. While we reviewed nothing as atrocious as those ill-fated AI assistant gadgets from 2024, AI companies and services straddled both the winner and loser podiums. The losers might be you, the American consumer. (Sorry.) In the US, anyone wanting a drone will have to find something that isn’t made by DJI. The company has been targeted by regulators since 2017 over concerns its products could spy on sensitive US infrastructure on behalf of China. Engadget The problem is DJI has such a high market share (over 75 percent) that its absence will effectively upend the industry. Oh, and its drones are consistently the best too. The US government hasn’t yet attempted to work with DJI to assess whether its products pose a risk. DJI recently made a final plea for a security review, sending letters to five US agencies that could assess its products. If that fails, US drone options will shrink massively. In the same 12 months, EV sales across the globe are up around 25 percent this year. Germany set a record in the first half of 2025, with electric cars accounting for nearly one in five new registrations. In China, EV sales are growing so fast (over 50 percent market share) that the country is flooding the global market with gas-powered cars it can’t sell at home. However — remember this is about losers — in the US, the Trump administration ended the EV tax credit. And shock! Sales of EVs in the US slumped, with some automakers, such as Ford, seeing a 60 percent year-over-year decline. As Sam Rutherford puts it, this policy change puts more roadblocks (his inadvertent pun, not mine) in the way of making cheaper battery-powered cars. It also affects EV investment and could mean US automakers fall even further behind their rivals elsewhere. We also point and shake our heads at Xbox, Grok and TV streaming. Check it all out right here. — Mat Smith The other big stories (and deals) this morning Kindle Scribe Colorsoft review-in-progress Control Resonant steps into a larger world inspired by Neon Genesis Evangelion OpenAI’s house of cards seems primed to collapse Trump orders creation of litigation task force to challenge state AI laws All the winners (and everything announced) at The Game Awards 2025 News, trailers and award winners. Most of which are Clair Obscur. Remedy If you missed The Game Awards 2025, you missed a historic sweep by Sandfall Interactive’s Clair Obscur: Expedition 33. The Belle Epoque saga, which was expected to win several categories, even bagged Game of the Year and eventually picked up more wins than any title in the show’s 12-year history. Naturally, there were trailers and game reveals too, which were pleasantly notable. We got a first look at the Control sequel, Resonant, Star Wars: Fate of The Old Republic is coming, headed by Mass Effect veterans, while Larian Studios is returning to the Divinity series following the success of Baldur’s Gate 3. Heck, if you want a good chance of winning at The Game Awards, hire Jennifer English to voice one of your main characters — she was in both BG3 and Clair Obscur. Continue reading. OpenAI signs deal to bring Disney characters to Sora and ChatGPT Slop Wars, Toy Sloppy and more! Disney announced a three-year licensing agreement with OpenAI to bring more than 200 of its characters, including those from Star Wars and Pixar, to the Sora app and ChatGPT. With the deal in place, OpenAI users will be able to prompt ChatGPT to generate images that tap into Disney’s intellectual property, with costumes, props, vehicles and environments covered. Additionally, Disney will invest $1 billion in OpenAI, with the option to purchase additional equity down the road. Continue reading. MasterClass subscriptions are 40 percent off for the holiday season Learn about tennis from Serena Williams or music from John Legend. If you’re struggling to find a good present for the holidays, MasterClass has discounted its subscriptions by up to 40 percent. I secured a similar deal for myself and was pleasantly surprised by the solid interface and the number of courses. I also forgot to update my subscription, whoops. Maybe this offer will get me back on board. Continue reading. Amazon’s AI-generated recap tool didn’t watch Fallout very closely It’s already getting the details wrong on its own shows. Amazon’s plan to offer AI-generated recaps of Prime Video shows isn’t off to a great start. The company’s recap of the first season of Fallout has multiple errors. First, the AI-generated recap incorrectly identifies the era of the show’s Los Angeles-set flashbacks as being the 1950s — they’re actually 2077. Perhaps more egregiously for a recap, it misunderstands the ending of the first season, which sets up season two’s partnership between vault dweller Lucy and The Ghoul. Continue reading.This article originally appeared on Engadget at https://www.engadget.com/general/the-morning-after-engadget-newsletter-121506303.html?src=rss",
          "feed_position": 20,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/0bdb7230-d74d-11f0-bfee-8d068bb86d9a"
        }
      ],
      "featured_image": "https://images.ctfassets.net/jdtwqhzvc2n1/38oJ3yjcAb67Hunz4whpDs/5e419481c52a1deafddb26fc2af21f57/DDM_Coding.png?w=300&q=30",
      "popularity_score": 2004.7136172222222
    },
    {
      "id": "cluster_92",
      "coverage": 2,
      "updated_at": "Fri, 12 Dec 2025 17:00:00 +0000",
      "title": "Google Translate now lets you hear real-time translations in your headphones",
      "neutral_headline": "Google Translate now lets you hear real-time translations in your headphones",
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/12/google-translate-now-lets-you-hear-real-time-translations-in-your-headphones/",
          "published_at": "Fri, 12 Dec 2025 17:00:00 +0000",
          "title": "Google Translate now lets you hear real-time translations in your headphones",
          "standfirst": "The real-time headphone translations experience keeps each speaker’s tone, emphasis, and cadence intact, so it’s easier to follow the conversation and tell who’s saying what.",
          "content": "The real-time headphone translations experience keeps each speaker’s tone, emphasis, and cadence intact, so it’s easier to follow the conversation and tell who’s saying what.",
          "feed_position": 11
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/google-translate-languages-real-time-earbuds-gemini-update/",
          "published_at": "Fri, 12 Dec 2025 17:00:00 GMT",
          "title": "Your earbuds can translate 70 languages in real-time now, thanks to Gemini",
          "standfirst": "Android users can hear live translations in more than 70 languages, with Gemini preserving the speaker's tone and cadence.",
          "content": "Android users can hear live translations in more than 70 languages, with Gemini preserving the speaker's tone and cadence.",
          "feed_position": 18
        }
      ],
      "popularity_score": 2000
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Sat, 13 Dec 2025 12:00:06 +0000",
      "title": "Sharks and rays gain landmark protections as nations move to curb international trade",
      "neutral_headline": "Sharks and rays gain landmark protections as nations move to curb international trade",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/sharks-and-rays-gain-landmark-protections-as-nations-move-to-curb-international-trade/",
          "published_at": "Sat, 13 Dec 2025 12:00:06 +0000",
          "title": "Sharks and rays gain landmark protections as nations move to curb international trade",
          "standfirst": "Gov'ts agree to ban or restrict international trade in shark meat, fins, and other products.",
          "content": "For the first time, global governments have agreed to widespread international trade bans and restrictions for sharks and rays being driven to extinction. Last week, more than 70 shark and ray species, including oceanic whitetip sharks, whale sharks, and manta rays, received new safeguards under the Convention on International Trade in Endangered Species of Wild Fauna and Flora. The convention, known as CITES, is a United Nations treaty that requires countries to regulate or prohibit international trade in species whose survival is threatened. Sharks and rays are closely related species that play similar roles as apex predators in the ocean, helping to maintain healthy marine ecosystems. They have been caught and traded for decades, contributing to a global market worth nearly $1 billion annually, according to Luke Warwick, director of shark and ray conservation at Wildlife Conservation Society (WCS), an international nonprofit dedicated to preserving animals and their habitats.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2227923861-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2227923861-1152x648.jpg",
      "popularity_score": 348
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 22:16:42 +0000",
      "title": "OpenAI built an AI coding agent and uses it to improve the agent itself",
      "neutral_headline": "OpenAI built an AI coding agent and uses it to improve the agent itself",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/how-openai-is-using-gpt-5-codex-to-improve-the-ai-tool-itself/",
          "published_at": "Fri, 12 Dec 2025 22:16:42 +0000",
          "title": "OpenAI built an AI coding agent and uses it to improve the agent itself",
          "standfirst": "\"The vast majority of Codex is built by Codex,\" OpenAI told us about its new AI coding agent.",
          "content": "With the popularity of AI coding tools rising among some software developers, their adoption has begun to touch every aspect of the process, including the improvement of AI coding tools themselves. In interviews with Ars Technica this week, OpenAI employees revealed the extent to which the company now relies on its own AI coding agent, Codex, to build and improve the development tool. “I think the vast majority of Codex is built by Codex, so it’s almost entirely just being used to improve itself,” said Alexander Embiricos, product lead for Codex at OpenAI, in a conversation on Tuesday. Codex, which OpenAI launched in its modern incarnation as a research preview in May 2025, operates as a cloud-based software engineering agent that can handle tasks like writing features, fixing bugs, and proposing pull requests. The tool runs in sandboxed environments linked to a user’s code repository and can execute multiple tasks in parallel. OpenAI offers Codex through ChatGPT’s web interface, a command-line interface (CLI), and IDE extensions for VS Code, Cursor, and Windsurf.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/AI_codehead_header-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/AI_codehead_header-1152x648.jpg",
      "popularity_score": 338
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 20:44:35 +0000",
      "title": "Google Translate expands live translation to all earbuds on Android",
      "neutral_headline": "Google Translate expands live translation to all earbuds on Android",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/12/google-translate-learns-slang-and-idioms-expands-live-translation-beyond-pixel-buds/",
          "published_at": "Fri, 12 Dec 2025 20:44:35 +0000",
          "title": "Google Translate expands live translation to all earbuds on Android",
          "standfirst": "Expanded live translation will come to iOS in the coming months.",
          "content": "Google has increasingly moved toward keeping features locked to its hardware products, but the Translate app is bucking that trend. The live translate feature is breaking out of the Google bubble with support for any earbuds you happen to have connected to your Android phone. The app is also getting improved translation quality across dozens of languages and some Duolingo-like learning features. The latest version of Google’s live translation is built on Gemini and initially rolled out earlier this year. It supports smooth back-and-forth translations as both on-screen text and audio. Beginning a live translate session in Google Translate used to require Pixel Buds, but that won’t be the case going forward. Google says a beta test of expanded headphone support is launching today in the US, Mexico, and India. The audio translation attempts to preserve the tone and cadence of the original speaker, but it’s not as capable as the full AI-reproduced voice translations you can do on the latest Pixel phones. Google says this feature should work on any earbuds or headphones, but it’s only for Android right now. The feature will expand to iOS in the coming months. Apple does have a similar live translation feature on the iPhone, but it requires AirPods.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Translate-app-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Translate-app-1152x648.jpg",
      "popularity_score": 315
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 21:35:44 +0000",
      "title": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
      "neutral_headline": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/reminder-donate-to-win-swag-in-our-annual-charity-drive-sweepstakes-17/",
          "published_at": "Fri, 12 Dec 2025 21:35:44 +0000",
          "title": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
          "standfirst": "Help raise a charity haul that's already past $11,000 in just a couple of days.",
          "content": "If you’ve been too busy floating in your new WoW house to take part in this year’s Ars Technica Charity Drive sweepstakes, don’t worry. You still have time to donate to a good cause and get a chance to win your share of over $4,000 worth of swag (no purchase necessary to win). In the first two days or so of the drive, over 200 readers have contributed over $11,000 to either the Electronic Frontier Foundation or Child’s Play as part of the charity drive (Child’s Play has a roughly 60/40 donation lead at the moment). That’s still a long way off from 2020’s record haul of over $58,000, but there’s still plenty of time until the Charity Drive wraps up on Friday, January 2, 2026. That doesn’t mean you should put your donation off, though. Do yourself and the charities involved a favor and give now while you’re thinking about it.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/charitydrive2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/charitydrive2025-1152x648.jpg",
      "popularity_score": 313
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 19:49:27 +0000",
      "title": "Ukrainians sue US chip firms for powering Russian drones, missiles",
      "neutral_headline": "Ukrainians sue US chip firms for powering Russian drones, missiles",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/ukrainians-sue-us-chip-firms-for-powering-russian-drones-missiles/",
          "published_at": "Fri, 12 Dec 2025 19:49:27 +0000",
          "title": "Ukrainians sue US chip firms for powering Russian drones, missiles",
          "standfirst": "Lawsuits may force Intel, AMD, and Texas Instruments to do more to control chip supply chains.",
          "content": "Dozens of Ukrainian civilians filed a series of lawsuits in Texas this week, accusing some of the biggest US chip firms of negligently failing to track chips that evaded export curbs. Those chips were ultimately used to power Russian and Iranian weapon systems, causing wrongful deaths last year. Their complaints alleged that for years, Texas Instruments (TI), AMD, and Intel have ignored public reporting, government warnings, and shareholder pressure to do more to track final destinations of chips and shut down shady distribution channels diverting chips to sanctioned actors in Russia and Iran. Putting profits over human lives, tech firms continued using “high-risk” channels, Ukrainian civilians’ legal team alleged in a press statement, without ever strengthening controls.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2161674727-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2161674727-1024x648.jpg",
      "popularity_score": 308
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 19:14:31 +0000",
      "title": "Scientists built an AI co-pilot for prosthetic bionic hands",
      "neutral_headline": "Scientists built an AI co-pilot for prosthetic bionic hands",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/scientists-built-an-ai-co-pilot-for-prosthetic-bionic-hands/",
          "published_at": "Fri, 12 Dec 2025 19:14:31 +0000",
          "title": "Scientists built an AI co-pilot for prosthetic bionic hands",
          "standfirst": "Managing each finger separately can, with the right sensors, ease control issues.",
          "content": "Modern bionic hand prostheses nearly match their natural counterparts when it comes to dexterity, degrees of freedom, and capability. And many amputees who tried advanced bionic hands apparently didn’t like them. “Up to 50 percent of people with upper limb amputation abandon these prostheses, never to use them again,” says Jake George, an electrical and computer engineer at the University of Utah. The main issue with bionic hands that drives users away from them, George explains, is that they’re difficult to control. “Our goal was making such bionic arms more intuitive, so that users could go about their tasks without having to think about it,” George says. To make this happen, his team came up with an AI bionic hand co-pilot. Micro-management issues Bionic hands’ control problems stem largely from their lack of autonomy. Grasping a paper cup without crushing it or catching a ball mid-flight appear so effortless because our natural movements rely on an elaborate system of reflexes and feedback loops. When an object you hold begins to slip, tiny mechanoreceptors in your fingertips send signals to the nervous system that make the hand tighten its grip. This all happens within 60 to 80 milliseconds—before you even consciously notice. This reflex is just one of many ways your brain automatically assists you in dexterity-based tasks.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2207559807-e1765565371849-1152x648-1765565584.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2207559807-e1765565371849-1152x648-1765565584.jpg",
      "popularity_score": 298
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 18:29:50 +0000",
      "title": "Trump tries to block state AI laws himself after Congress decided not to",
      "neutral_headline": "Trump tries to block state AI laws himself after Congress decided not to",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/trump-tries-to-block-state-ai-laws-himself-after-congress-decided-not-to/",
          "published_at": "Fri, 12 Dec 2025 18:29:50 +0000",
          "title": "Trump tries to block state AI laws himself after Congress decided not to",
          "standfirst": "Trump claims state laws force AI makers to embed \"ideological bias\" in models.",
          "content": "President Trump issued an executive order yesterday attempting to thwart state AI laws, saying that federal agencies must fight state laws because Congress hasn’t yet implemented a national AI standard. Trump’s executive order tells the Justice Department, Commerce Department, Federal Communications Commission, Federal Trade Commission, and other federal agencies to take a variety of actions. “My Administration must act with the Congress to ensure that there is a minimally burdensome national standard—not 50 discordant State ones. The resulting framework must forbid State laws that conflict with the policy set forth in this order… Until such a national standard exists, however, it is imperative that my Administration takes action to check the most onerous and excessive laws emerging from the States that threaten to stymie innovation,” Trump’s order said. The order claims that state laws, such as one passed in Colorado, “are increasingly responsible for requiring entities to embed ideological bias within models.” Congressional Republicans recently decided not to include a Trump-backed plan to block state AI laws in the National Defense Authorization Act (NDAA), although it could be included in other legislation. Sen. Ted Cruz (R-Texas) has also failed to get congressional backing for legislation that would punish states with AI laws.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/trump-august-2025-1152x648-1756146125.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/trump-august-2025-1152x648-1756146125.jpg",
      "popularity_score": 278
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 18:58:12 +0000",
      "title": "A study in contrasts: The cinematography of Wake Up Dead Man",
      "neutral_headline": "A study in contrasts: The cinematography of Wake Up Dead Man",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/a-study-in-contrasts-the-cinematography-of-wake-up-dead-man/",
          "published_at": "Fri, 12 Dec 2025 18:58:12 +0000",
          "title": "A study in contrasts: The cinematography of Wake Up Dead Man",
          "standfirst": "Ars chats with cinematographer Steve Yedlin about bringing Rian Johnson's Gothic vision to life.",
          "content": "Rian Johnson has another Benoit Blanc hit on his hands with Wake Up Dead Man, in which Blanc tackles the strange death of a fire-and-brimstone parish priest, Monseigneur Jefferson Wicks (Josh Brolin). It’s a classic locked-room mystery in a spookily Gothic small-town setting, and Johnson turned to cinematographer Steve Yedlin (Looper, The Last Jedi) to help realize his artistic vision. (Minor spoilers below but no major reveals.) Yedlin worked on the previous two Knives Out installments. He’s known Johnson since the two were in their teens, and that longstanding friendship ensures that they are on the same page, aesthetically, from the start when they work on projects.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/wakeup1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/wakeup1-1152x648.jpg",
      "popularity_score": 273
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 16:00:23 +0000",
      "title": "Apple loses its appeal of a scathing contempt ruling in iOS payments case",
      "neutral_headline": "Apple loses its appeal of a scathing contempt ruling in iOS payments case",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/epic-celebrates-the-end-of-the-apple-tax-after-appeals-court-win-in-ios-payments-case/",
          "published_at": "Fri, 12 Dec 2025 16:00:23 +0000",
          "title": "Apple loses its appeal of a scathing contempt ruling in iOS payments case",
          "standfirst": "But Sweeney warns iOS devs are still afraid of \"totally illegal\" retaliation by Apple.",
          "content": "Back in April, District Court Judge Yvonne Gonzalez Rogers delivered a scathing judgment finding that Apple was in “willful violation” of her 2021 injunction intended to open up iOS App Store payments. That contempt of court finding has now been almost entirely upheld by the Ninth Circuit Court of Appeals, a development that Epic Games’ Tim Sweeney tells Ars he hopes will “do a lot of good for developers and start to really change the App Store situation worldwide, I think.” The ruling, signed by a panel of three appellate court judges, affirmed that Apple’s initial attempts to charge a 27 percent fee to iOS developers using outside payment options “had a prohibitive effect, in violation of the injunction.” Similarly, Apple’s restrictions on how those outside links had to be designed were overly broad; the appeals court suggests that Apple can only ensure that internal and external payment options are presented in a similar fashion. The appeals court also agreed that Apple acted in “bad faith” by refusing to comply with the injunction, rejecting viable, compliant alternatives in internal discussions. And the appeals court was also not convinced by Apple’s process-focused arguments, saying the district court properly evaluated materials Apple argued were protected by attorney-client privilege.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2171810471-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2171810471-1024x648.jpg",
      "popularity_score": 255
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 17:33:22 +0000",
      "title": "Man shocks doctors with extreme blood pressure, stroke from energy drinks",
      "neutral_headline": "Man shocks doctors with extreme blood pressure, stroke from energy drinks",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/man-shocks-doctors-with-extreme-blood-pressure-stroke-from-energy-drinks/",
          "published_at": "Fri, 12 Dec 2025 17:33:22 +0000",
          "title": "Man shocks doctors with extreme blood pressure, stroke from energy drinks",
          "standfirst": "His blood pressure was 254/150. Readings of 180/120 are considered an emergency.",
          "content": "Sometimes, downing an energy drink can feel like refueling your battery. But with too much, that jolt can turn into a catastrophic surge that fries the wiring and blows a fuse. That was the unfortunate and alarming case for a man in the UK several years ago, according to a case report this week in BMJ Case Reports. The man, who was in his 50s and otherwise healthy, showed up at a hospital after the entire left side of his body abruptly went numb and he was left with clumsy, uncoordinated muscle movements (ataxia). His blood pressure was astonishingly high, at 254/150 mm Hg. For context, a normal reading is under 120/80, while anything over 180/120 is considered a hypertensive crisis, which is a medical emergency. The man had suffered a mild stroke, and his extremely high blood pressure was an obvious factor. But why his blood pressure had reached stratospheric heights was far less obvious to his doctors, according to the retrospective case report written by Martha Coyle and Sunil Munshi of Nottingham University Hospital.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1025255964-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1025255964-1152x648.jpg",
      "popularity_score": 253
    },
    {
      "id": "cluster_102",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 15:33:32 +0000",
      "title": "Senator endorses discredited doctor’s book that claims chemical treats autism, cancer",
      "neutral_headline": "Senator endorses discredited doctor’s book that claims chemical treats autism, cancer",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/senator-endorses-discredited-doctors-book-that-claims-chemical-treats-autism-cancer/",
          "published_at": "Fri, 12 Dec 2025 15:33:32 +0000",
          "title": "Senator endorses discredited doctor’s book that claims chemical treats autism, cancer",
          "standfirst": "Safety experts advise those who handle chlorine dioxide to work in well-ventilated spaces, wear gloves.",
          "content": "For years, Sen. Ron Johnson has been spreading conspiracy theories and misinformation about COVID-19 and the safety of vaccines. He’s promoted disproven treatments for COVID-19 and claimed, without evidence, that athletes are “dropping dead on the field” after getting the COVID-19 vaccination. Now the Wisconsin politician is endorsing a book by a discredited doctor promoting an unproven and dangerous treatment for autism and a host of ailments: chlorine dioxide, a chemical used for disinfecting and bleaching. The book is “The War on Chlorine Dioxide: The Medicine that Could End Medicine” by Dr. Pierre Kory, a critical care specialist who practiced in Wisconsin hospitals before losing his medical certification for statements advocating using an antiparasite medication to treat COVID-19. The action, he’s said, makes him unemployable, even though he still has a license.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1438746733-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1438746733-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_103",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 15:23:57 +0000",
      "title": "Investors commit quarter-billion dollars to startup designing “Giga” satellites",
      "neutral_headline": "Investors commit quarter-billion dollars to startup designing “Giga” satellites",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/investors-commit-quarter-billion-dollars-to-startup-designing-giga-satellites/",
          "published_at": "Fri, 12 Dec 2025 15:23:57 +0000",
          "title": "Investors commit quarter-billion dollars to startup designing “Giga” satellites",
          "standfirst": "\"If we build these platforms well, we get to ask new questions about what's possible in orbit.\"",
          "content": "A startup established three years ago to churn out a new class of high-power satellites has raised $250 million to ramp up production at its Southern California factory. The company, named K2, announced the cash infusion on Thursday. K2’s Series C fundraising round was led by Redpoint Ventures, with additional funding from investment firms in the United States, the United Kingdom, and Germany. K2 has now raised more than $400 million since its founding in 2022 and is on track to launch its first major demonstration mission next year, officials said. K2 aims to take advantage of a coming abundance of heavy- and super-heavy-lift launch capacity, with SpaceX’s Starship expected to begin deploying satellites as soon as next year. Blue Origin’s New Glenn rocket launched twice this year and will fly more in 2026 while engineers develop an even larger New Glenn with additional engines and more lift capability.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/k2gravitas-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/k2gravitas-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_117",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 12:15:02 +0000",
      "title": "Chatbot-powered toys rebuked for discussing sexual, dangerous topics with kids",
      "neutral_headline": "Chatbot-powered toys rebuked for discussing sexual, dangerous topics with kids",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/chatbot-powered-toys-rebuked-for-discussing-sexual-dangerous-topics-with-kids/",
          "published_at": "Fri, 12 Dec 2025 12:15:02 +0000",
          "title": "Chatbot-powered toys rebuked for discussing sexual, dangerous topics with kids",
          "standfirst": "\"... AI toys shouldn’t be capable of having sexually explicit conversations, period.\"",
          "content": "Protecting children from the dangers of the online world was always difficult, but that challenge has intensified with the advent of AI chatbots. A new report offers a glimpse into the problems associated with the new market, including the misuse of AI companies’ large language models (LLMs). In a blog post today, the US Public Interest Group Education Fund (PIRG) reported its findings after testing AI toys (PDF). It described AI toys as online devices with integrated microphones that let users talk to the toy, which uses a chatbot to respond. AI toys are currently a niche market, but they could be set to grow. More consumer companies have been eager to shoehorn AI technology into their products so they can do more, cost more, and potentially give companies user tracking and advertising data. A partnership between OpenAI and Mattel announced this year could also create a wave of AI-based toys from the maker of Barbie and Hot Wheels, as well as its competitors.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/F6S-AI_ChatGPT-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/F6S-AI_ChatGPT-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_118",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 12:00:49 +0000",
      "title": "Rocket Report: Neutron’s Hungry Hippo is deemed ready, whither Orbex?",
      "neutral_headline": "Rocket Report: Neutron’s Hungry Hippo is deemed ready, whither Orbex",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/rocket-report-neutrons-hungry-hippo-is-deemed-ready-whither-orbex/",
          "published_at": "Fri, 12 Dec 2025 12:00:49 +0000",
          "title": "Rocket Report: Neutron’s Hungry Hippo is deemed ready, whither Orbex?",
          "standfirst": "\"That is the moment an IPO suddenly came into play.\"",
          "content": "Welcome to Edition 8.22 of the Rocket Report! The big news this week concerns the decision by SpaceX founder Elon Musk to take the company public, via IPO, sometime within the next 12 to 18 months. Musk confirmed this after Ars published a story on Wednesday evening. This understandably raises questions about whether a future SpaceX will be committed more to AI data centers in space or Mars settlement. However, one of the company’s founding employees, Tom Mueller, said this could benefit the company’s Mars plans. Clearly this is something we’ll be following closely. As always, we welcome reader submissions, and if you don’t want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar. Avio will build solid rocket motors in Virginia. The governor of Virginia, Glenn Youngkin, announced Wednesday that Avio USA has selected his state to produce solid rocket motors for defense and commercial space propulsion purposes. Avio USA’s investment, which will be up to $500 million, is supported by its Italian parent Avio. The company’s factory will encompass 860,000 sq. feet.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Neutron-Hungry-Hippo-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Neutron-Hungry-Hippo-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_116",
      "coverage": 1,
      "updated_at": "Fri, 12 Dec 2025 12:30:22 +0000",
      "title": "How to break free from smart TV ads and tracking",
      "neutral_headline": "How to break free from smart TV ads and tracking",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/the-ars-technica-guide-to-dumb-tvs/",
          "published_at": "Fri, 12 Dec 2025 12:30:22 +0000",
          "title": "How to break free from smart TV ads and tracking",
          "standfirst": "Sick of smart TVs? Here are your best options.",
          "content": "Smart TVs can feel like a dumb choice if you’re looking for privacy, reliability, and simplicity. Today’s TVs and streaming sticks are usually loaded up with advertisements and user tracking, making offline TVs seem very attractive. But ever since smart TV operating systems began making money, “dumb” TVs have been hard to find. In response, we created this non-smart TV guide that includes much more than dumb TVs. Since non-smart TVs are so rare, this guide also breaks down additional ways to watch TV and movies online and locally without dealing with smart TVs’ evolution toward software-centric features and snooping. We’ll discuss a range of options suitable for various budgets, different experience levels, and different rooms in your home.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/smart-dumb-tv-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/smart-dumb-tv-1152x648.jpg",
      "popularity_score": 130
    }
  ]
}