{
  "updated_at": "2025-10-21T07:19:59.765Z",
  "clusters": [
    {
      "id": "cluster_9",
      "coverage": 2,
      "updated_at": "Tue, 21 Oct 2025 01:21:01 +0000",
      "title": "Amazon's AWS outage knocked services like Alexa, Snapchat, Fortnite, Venmo and more offline",
      "neutral_headline": "Amazon's AWS outage knocked services like Alexa, Snapchat, Fortnite, Venmo and more offline",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/big-tech/amazons-aws-outage-has-knocked-services-like-alexa-snapchat-fortnite-venmo-and-more-offline-142935812.html",
          "published_at": "Tue, 21 Oct 2025 01:21:01 +0000",
          "title": "Amazon's AWS outage knocked services like Alexa, Snapchat, Fortnite, Venmo and more offline",
          "standfirst": "It felt like half of the internet was dealing with a hangover from the morning of October 19 to the early hours of October 20. A severe Amazon Web Services outage took out many, many websites, apps, games and other services that rely on Amazon’s cloud division to stay up and running. That included a long list of popular software like Venmo, Snapchat, Canva and Fortnite. Even Amazon's own assistant Alexa stuttered, and if you were wondering why the internet seemed to be against you — you weren't imagining it. The good news is that, Amazon announced by 6:53PM Eastern time on October 20 that it resolved the \"increased error rates and latencies for AWS Services.\" The company said it \"identified the trigger of the event as DNS resolution issues for the regional DynamoDB service endpoints.\" It ran into more problems as it tried to solve the outage, but it was eventually able to fix everything. \"By 3:01 PM, all AWS services returned to normal operations,\" it said. At about 4:30PM ET on October 20, things seemed to be returning back to normal. Apps like Venmo and Lyft, which were either slow to respond or completely nonresponsive before, were appearing to behave smoothly. As of 1:15PM ET on October 20, multiple services were unavailable, including asking Alexa for the weather or to turn off lights in your home. The Lyft app was also slower to respond than usual, and Venmo transactions were not completing. According to the AWS service health page at the time, Amazon was looking into \"increased error rates and latencies for multiple AWS services\" in the US-EAST-1 region (i.e. data centers in Northern Virginia) as of 3:11AM ET on Monday. By 5:01AM, AWS had figured out that a DNS resolution issue with its DynamoDB API was the cause of the outage. DynamoDB is a database that holds info for AWS clients. At about 12:08PM ET, the company posted a small statement that reiterated the above and added that the \"underlying DNS issue was fully mitigated at 2:24 AM PDT.\" According to the notice, some Amazon \"customers still continue to experience increased error rates with AWS services in the N. Virginia (us-east-1) Region due to issues with launching new EC2 instances.\" Amazon also said Amazon.com and Amazon subsidiaries, as well as AWS customer service support operations have been impacted. “Amazon had the data safely stored, but nobody else could find it for several hours, leaving apps temporarily separated from their data,” Mike Chapple, a teaching professor of IT, analytics and operations at University of Notre Dame, told CNN. “It’s as if large portions of the internet suffered temporary amnesia.” As of 6:35AM, AWS said it had fully mitigated the DNS issue and that \"most AWS Service operations are succeeding normally now.\" However, the knock-on effect caused issues with other AWS services, including EC2, a virtual machine service on which many companies build online applications. At 8:48AM, AWS said it was \"making progress on resolving the issue with new EC2 instance launches in the US-EAST-1 Region.\" It recommended that clients not tie new deployments to specific Availability Zones (i.e. one or more data centers in a given region) \"so that EC2 has flexibility\" in picking a zone that may be a better option. At 9:42AM, Amazon noted on the status page that although it had applied \"multiple mitigations\" across several Availability Zones in US-EAST-1, it was \"still experiencing elevated errors for new EC2 instance launches.\" As such, AWS was \"rate limiting new instance launches to aid recovery.\" The company added at 10:14AM that it was seeing \"significant API errors and connectivity issues across multiple services in the US-EAST-1 Region.\" Even once all the issues are resolved, AWS will have a significant backlog of requests and other factors to process, so it'll take some time for everything to recover. Many, many, many companies use US-EAST-1 for their AWS deployments, which is why it felt like half of the internet was knocked offline on Monday morning. As of mid-morning, tons of websites and other services were sluggish or offering up error messages. Outage reports for a broad swathe of services spiked on Down Detector. Along with Amazon's own services, users reported issues with the likes of banks, airlines, Disney+, Snapchat, Reddit, Lyft, Apple Music, Pinterest, Fortnite, Roblox and The New York Times — sorry to anyone whose Wordle streaks may be at risk. Sites like Reddit have posted their own status updates, and though they don't explicitly mention AWS, it's possible that the services' paths may cross somewhere in the pipelines. AWS offers a lot of useful features to clients, such as the ability for websites and apps to automatically scale compute and server capacity up and down as needed to handle ebbs and flows in traffic. It also has data centers around the world. That kind of infrastructure is attractive to companies that serve a global audience and need to stay online around the clock. As of mid-2025, it was estimated that AWS' share of the worldwide cloud infrastructure market was 30 percent. But incidents such as this highlight that relying on just a few providers to be the backbone of much of the internet is a bit of a problem. Update October 20, 2025, 9:21PM ET: This story has been updated with Amazon's latest update that says the issue has been resolved. Update, Oct 20 2025, 10:57AM ET: This story has been updated to include a short list of services affected in the intro. Update, Oct 20 2025, 11:17AM ET: This story has been updated to include a reference to Reddit's own status update website. Update, Oct 20 2025, 1:15PM ET: This story has been updated to include a paragraph reflecting the status of popular services like Lyft, Venmo and Alexa, based on our editors' personal experiences as of this time. Update, Oct 20 2025, 3:15PM ET: This story has been updated to include a short statement from Amazon describing a timeline of events, when the underlying issue was mitigated and what parts of Amazon have been impacted. Update, Oct 20 2025, 4:30PM ET: This story has been updated to reflect the status of services like Venmo and Lyft as of Monday afternoon.This article originally appeared on Engadget at https://www.engadget.com/big-tech/amazons-aws-outage-has-knocked-services-like-alexa-snapchat-fortnite-venmo-and-more-offline-142935812.html?src=rss",
          "content": "It felt like half of the internet was dealing with a hangover from the morning of October 19 to the early hours of October 20. A severe Amazon Web Services outage took out many, many websites, apps, games and other services that rely on Amazon’s cloud division to stay up and running. That included a long list of popular software like Venmo, Snapchat, Canva and Fortnite. Even Amazon's own assistant Alexa stuttered, and if you were wondering why the internet seemed to be against you — you weren't imagining it. The good news is that, Amazon announced by 6:53PM Eastern time on October 20 that it resolved the \"increased error rates and latencies for AWS Services.\" The company said it \"identified the trigger of the event as DNS resolution issues for the regional DynamoDB service endpoints.\" It ran into more problems as it tried to solve the outage, but it was eventually able to fix everything. \"By 3:01 PM, all AWS services returned to normal operations,\" it said. At about 4:30PM ET on October 20, things seemed to be returning back to normal. Apps like Venmo and Lyft, which were either slow to respond or completely nonresponsive before, were appearing to behave smoothly. As of 1:15PM ET on October 20, multiple services were unavailable, including asking Alexa for the weather or to turn off lights in your home. The Lyft app was also slower to respond than usual, and Venmo transactions were not completing. According to the AWS service health page at the time, Amazon was looking into \"increased error rates and latencies for multiple AWS services\" in the US-EAST-1 region (i.e. data centers in Northern Virginia) as of 3:11AM ET on Monday. By 5:01AM, AWS had figured out that a DNS resolution issue with its DynamoDB API was the cause of the outage. DynamoDB is a database that holds info for AWS clients. At about 12:08PM ET, the company posted a small statement that reiterated the above and added that the \"underlying DNS issue was fully mitigated at 2:24 AM PDT.\" According to the notice, some Amazon \"customers still continue to experience increased error rates with AWS services in the N. Virginia (us-east-1) Region due to issues with launching new EC2 instances.\" Amazon also said Amazon.com and Amazon subsidiaries, as well as AWS customer service support operations have been impacted. “Amazon had the data safely stored, but nobody else could find it for several hours, leaving apps temporarily separated from their data,” Mike Chapple, a teaching professor of IT, analytics and operations at University of Notre Dame, told CNN. “It’s as if large portions of the internet suffered temporary amnesia.” As of 6:35AM, AWS said it had fully mitigated the DNS issue and that \"most AWS Service operations are succeeding normally now.\" However, the knock-on effect caused issues with other AWS services, including EC2, a virtual machine service on which many companies build online applications. At 8:48AM, AWS said it was \"making progress on resolving the issue with new EC2 instance launches in the US-EAST-1 Region.\" It recommended that clients not tie new deployments to specific Availability Zones (i.e. one or more data centers in a given region) \"so that EC2 has flexibility\" in picking a zone that may be a better option. At 9:42AM, Amazon noted on the status page that although it had applied \"multiple mitigations\" across several Availability Zones in US-EAST-1, it was \"still experiencing elevated errors for new EC2 instance launches.\" As such, AWS was \"rate limiting new instance launches to aid recovery.\" The company added at 10:14AM that it was seeing \"significant API errors and connectivity issues across multiple services in the US-EAST-1 Region.\" Even once all the issues are resolved, AWS will have a significant backlog of requests and other factors to process, so it'll take some time for everything to recover. Many, many, many companies use US-EAST-1 for their AWS deployments, which is why it felt like half of the internet was knocked offline on Monday morning. As of mid-morning, tons of websites and other services were sluggish or offering up error messages. Outage reports for a broad swathe of services spiked on Down Detector. Along with Amazon's own services, users reported issues with the likes of banks, airlines, Disney+, Snapchat, Reddit, Lyft, Apple Music, Pinterest, Fortnite, Roblox and The New York Times — sorry to anyone whose Wordle streaks may be at risk. Sites like Reddit have posted their own status updates, and though they don't explicitly mention AWS, it's possible that the services' paths may cross somewhere in the pipelines. AWS offers a lot of useful features to clients, such as the ability for websites and apps to automatically scale compute and server capacity up and down as needed to handle ebbs and flows in traffic. It also has data centers around the world. That kind of infrastructure is attractive to companies that serve a global audience and need to stay online around the clock. As of mid-2025, it was estimated that AWS' share of the worldwide cloud infrastructure market was 30 percent. But incidents such as this highlight that relying on just a few providers to be the backbone of much of the internet is a bit of a problem. Update October 20, 2025, 9:21PM ET: This story has been updated with Amazon's latest update that says the issue has been resolved. Update, Oct 20 2025, 10:57AM ET: This story has been updated to include a short list of services affected in the intro. Update, Oct 20 2025, 11:17AM ET: This story has been updated to include a reference to Reddit's own status update website. Update, Oct 20 2025, 1:15PM ET: This story has been updated to include a paragraph reflecting the status of popular services like Lyft, Venmo and Alexa, based on our editors' personal experiences as of this time. Update, Oct 20 2025, 3:15PM ET: This story has been updated to include a short statement from Amazon describing a timeline of events, when the underlying issue was mitigated and what parts of Amazon have been impacted. Update, Oct 20 2025, 4:30PM ET: This story has been updated to reflect the status of services like Venmo and Lyft as of Monday afternoon.This article originally appeared on Engadget at https://www.engadget.com/big-tech/amazons-aws-outage-has-knocked-services-like-alexa-snapchat-fortnite-venmo-and-more-offline-142935812.html?src=rss",
          "feed_position": 0
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/social-media/xs-handle-marketplace-will-sell-some-rare-usernames-for-millions-of-dollars-224852740.html",
          "published_at": "Mon, 20 Oct 2025 22:48:52 +0000",
          "title": "X's handle marketplace will sell some 'rare' usernames for millions of dollars",
          "standfirst": "X is finally following through on its long-rumored plans to sell old user handles, and some of the most sought-after usernames could fetch millions of dollars. The company shared more details about and opened a waitlist for its \"handle marketplace,\" that will enable paying subscribers to request and buy \"inactive\" handles. According to the company, X will make two types of \"inactive' handles available: \"priority\" usernames that may include \"full names, multi-word phrases, or alphanumeric combinations\" and \"rare\" handles that consist of \"short, generic, or culturally significant names.\" Subscribers to X's Premium+ and Premium Business tiers will eventually be able to request some \"priority\" handles as part of their subscription. The company says @PizzaEater and @GabrielJones are possible examples of such handles. Notably, this process requires what essentially amounts to an indefinite subscription to X Premium, as the company says it will revoke priority handles if an account's subscription lapses. The X Handle Marketplace is our industry-first solution to redistribute handles that are no longer in use. Eligible Premium subscribers will be able to search and make requests, with both complimentary and paid options available.— Handle Marketplace (@XHandles) October 19, 2025 The process for acquiring a \"rare\" handle is a lot less clear. X says that it will offer some rare handles through \"public drops\" and that those will be given away for free \"based on merit\" and that multiple users will be able to apply. X will take a user's engagement and \"past contributions\" to the platform into account when deciding who gets these handles. The company will also make some handles available for sale via an invitation-only process. These prices will be \"fixed\" and \"determined by a number of factors including popularity of word, character length, and cultural significance.\" These usernames could include common one-word usernames like @one, @fly or @compute, according to examples provided by X. They could also be incredibly expensive. \"Some handles are included with a Premium+ or Premium Business subscription,\" X wrote in an FAQ. \"Others – especially Rare handles – may be priced anywhere from $2,500 to over seven figures, depending on demand and uniqueness.\" People who buy a supposedly rare handle will need to have a Premium+ or Premium Business subscription in order to start the process, but won't be required to maintain one in order to keep the handle. In a separate \"handle transfer agreement,\" X describes its handle-buying scheme as an \"evolving initiative\" that it hopes will be adopted by other social media companies in the future. \"We are establishing a new standard for social media handles—a framework we hope the broader industry will adopt, similar to how Community Notes has influenced online transparency,\" the company wrote. Andrew Allemann, the publisher of Domain Name Wire, a publication that tracks the domain name industry, says that there are some similarities between X's plan to sell handles and the marketplace for expired domains. \"For a long time, people have been buying and selling handles off of X, and X hasn't been getting a cut of that,\" he told Engadget. \"So in some ways, I think this will get some of the better handles to be more used on the platform.\" But he said he would have concerns about some of the terms in X's policies, which allow it to \"reclaim'' handles if they become inactive. The company's current \"inactive account policy\" defines an inactive account as one that hasn't been logged into for 30 days. \"I would definitely want a firmer contract if I were to pay money for a handle,\" Allemann says. \"I would want some rights baked into a contract that says it can't just be taken away. I certainly want a longer period of inactivity before it can be taken away.\" X also has a history of commandeering desirable handles from users that were actively using them. The company took the @X handle from a San Francisco photographer in 2023 without compensating him, though he was offered \"merch\" and a tour of X's headquarters. That same year, it also took the @music handle from a longtime user with more than a half million followers. Last year, the company swiped the @America handle from a reported Donald Trump critic. The handle is now used by Musk's super PAC. X's plan to give away handles based on \"merit\" raises additional questions about who the platform could decide to reward and penalize. The company didn't immediately respond to a request for comment. Allemann says that all social media users should remember they don't own any of the content they publish on company platforms. \"If you create your website, you control it, and people can always come to it. On social media, the single billionaire owner of it could decide they don't like you, and it's pretty much within their rights to kick you off, or demote you, or change the algorithm to impact you as well.\" Have a tip for Karissa? You can reach her by email, on X, Bluesky, Threads, or send a message to @karissabe.51 to chat confidentially on Signal.This article originally appeared on Engadget at https://www.engadget.com/social-media/xs-handle-marketplace-will-sell-some-rare-usernames-for-millions-of-dollars-224852740.html?src=rss",
          "content": "X is finally following through on its long-rumored plans to sell old user handles, and some of the most sought-after usernames could fetch millions of dollars. The company shared more details about and opened a waitlist for its \"handle marketplace,\" that will enable paying subscribers to request and buy \"inactive\" handles. According to the company, X will make two types of \"inactive' handles available: \"priority\" usernames that may include \"full names, multi-word phrases, or alphanumeric combinations\" and \"rare\" handles that consist of \"short, generic, or culturally significant names.\" Subscribers to X's Premium+ and Premium Business tiers will eventually be able to request some \"priority\" handles as part of their subscription. The company says @PizzaEater and @GabrielJones are possible examples of such handles. Notably, this process requires what essentially amounts to an indefinite subscription to X Premium, as the company says it will revoke priority handles if an account's subscription lapses. The X Handle Marketplace is our industry-first solution to redistribute handles that are no longer in use. Eligible Premium subscribers will be able to search and make requests, with both complimentary and paid options available.— Handle Marketplace (@XHandles) October 19, 2025 The process for acquiring a \"rare\" handle is a lot less clear. X says that it will offer some rare handles through \"public drops\" and that those will be given away for free \"based on merit\" and that multiple users will be able to apply. X will take a user's engagement and \"past contributions\" to the platform into account when deciding who gets these handles. The company will also make some handles available for sale via an invitation-only process. These prices will be \"fixed\" and \"determined by a number of factors including popularity of word, character length, and cultural significance.\" These usernames could include common one-word usernames like @one, @fly or @compute, according to examples provided by X. They could also be incredibly expensive. \"Some handles are included with a Premium+ or Premium Business subscription,\" X wrote in an FAQ. \"Others – especially Rare handles – may be priced anywhere from $2,500 to over seven figures, depending on demand and uniqueness.\" People who buy a supposedly rare handle will need to have a Premium+ or Premium Business subscription in order to start the process, but won't be required to maintain one in order to keep the handle. In a separate \"handle transfer agreement,\" X describes its handle-buying scheme as an \"evolving initiative\" that it hopes will be adopted by other social media companies in the future. \"We are establishing a new standard for social media handles—a framework we hope the broader industry will adopt, similar to how Community Notes has influenced online transparency,\" the company wrote. Andrew Allemann, the publisher of Domain Name Wire, a publication that tracks the domain name industry, says that there are some similarities between X's plan to sell handles and the marketplace for expired domains. \"For a long time, people have been buying and selling handles off of X, and X hasn't been getting a cut of that,\" he told Engadget. \"So in some ways, I think this will get some of the better handles to be more used on the platform.\" But he said he would have concerns about some of the terms in X's policies, which allow it to \"reclaim'' handles if they become inactive. The company's current \"inactive account policy\" defines an inactive account as one that hasn't been logged into for 30 days. \"I would definitely want a firmer contract if I were to pay money for a handle,\" Allemann says. \"I would want some rights baked into a contract that says it can't just be taken away. I certainly want a longer period of inactivity before it can be taken away.\" X also has a history of commandeering desirable handles from users that were actively using them. The company took the @X handle from a San Francisco photographer in 2023 without compensating him, though he was offered \"merch\" and a tour of X's headquarters. That same year, it also took the @music handle from a longtime user with more than a half million followers. Last year, the company swiped the @America handle from a reported Donald Trump critic. The handle is now used by Musk's super PAC. X's plan to give away handles based on \"merit\" raises additional questions about who the platform could decide to reward and penalize. The company didn't immediately respond to a request for comment. Allemann says that all social media users should remember they don't own any of the content they publish on company platforms. \"If you create your website, you control it, and people can always come to it. On social media, the single billionaire owner of it could decide they don't like you, and it's pretty much within their rights to kick you off, or demote you, or change the algorithm to impact you as well.\" Have a tip for Karissa? You can reach her by email, on X, Bluesky, Threads, or send a message to @karissabe.51 to chat confidentially on Signal.This article originally appeared on Engadget at https://www.engadget.com/social-media/xs-handle-marketplace-will-sell-some-rare-usernames-for-millions-of-dollars-224852740.html?src=rss",
          "feed_position": 2
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/microsoft-has-ended-windows-10-support-but-heres-how-to-get-an-extra-year-for-free-125118044.html",
          "published_at": "Mon, 20 Oct 2025 18:54:24 +0000",
          "title": "Microsoft has ended Windows 10 support, but here's how to get an extra year for free",
          "standfirst": "You'll get access to Windows 10 a little longer by doing this. (Getty Images) Are you still using Windows 10 on your desktop or laptop? If so, you need to know this: As of October 14, Microsoft moved the software to its \"end of life\" phase. What that means is that while Windows 10 PCs will continue to work, they'll stop getting important security updates by default. That leaves you with three options to make sure your computer remains secure: You can choose to upgrade to Windows 11 for free if your computer is compatible. You can buy a new PC that already has Windows 11 pre-installed (or opt for an alternative, like a Mac or a Chromebook). Forget about Windows 11 right now and sign up for the Extended Security Updates (ESU), which lets you kick the can down the road for a year. The third option is easier than it sounds — and can now be done for free in many cases — so we'll focus on that one here. We'll walk you through the steps of keeping Windows 10 on your PC… for now, at least. How to sign up for Windows 10 Extended Security Updates on your computer We can question Microsoft's motives for killing off Windows 10, even though it works perfectly well on most older PCs. But without those periodic security updates, your PC will become increasingly susceptible to malware with each passing week. To that end, enrolling in Extended Security Updates (ESU) will give you another year of using Windows 10 securely. At one point, Microsoft suggested the 12-month extension would require a $30 fee. While that's still an option, there's now a free path for Windows 10 users in the US. Here's how to make it happen. Step 1: Make sure your PC is up to date You can find out if your computer is up-to-date by going into your Settings > System > About, then scroll down to see what version you're running. If not, you'll want to make sure you also install all the Windows 10 updates available. Step 2: Make sure you're using an administrator account If you share a computer with multiple people in your household, make sure you're signed in to the administrator account. Typically, it's the first account created on the computer. You'll know it's the right one when you see \"Administrator\" under the name. (You can double-check under Settings > Your Info.) Step 3: Verify if your PC is eligible to upgrade to Windows 11 (or not) If you see an option to upgrade to Windows 11, just do that. It's free and it keeps you in the Windows loop. Otherwise, continue following the steps below so you can keep your computer safe with security updates. Step 4: Enroll in Extended Security Updates Sign up for ESU by selecting Update & Security from the Settings menu. Click the \"Enroll Now\" sign-up link, as pictured below. Again, you may see an option to download Windows 11 if your computer meets the requirements (again, definitely do that if you see it). Find out if you need to update your computer. (Screenshot/Engadget) If you're not seeing the \"Enroll now\" link, you probably need to update and install the latest Windows 10 updates (as noted above). By enrolling in Extended Security Updates, you'll have another year before you need to upgrade to Windows 11. (Screenshots/Engadget) Step 5: Choose your upgrade method Next up is choosing how you want to enroll, and you have a few options. The easiest way is to back up your PC settings. It's free, but it takes a little bit of time since you'll need to back up your data. Again, you'll need to use your administrator account to get started. Back up your PC before you enroll in ESU. (ExplainingComputers via YouTube) That said, the free option here comes with two catches, at least for users in the US. (European users will get the free option with no strings attached.) The first is that you'll be linking your Windows login to Microsoft's cloud-based online service. Most users have likely already done this (if they're using CoPilot, Office 365, GamePass, OneDrive or one of Microsoft's other various online services). But if you've specifically opted for a local login to Windows, the price you're paying for this \"free\" extension is joining the cloud-connected Microsoft universe. The other potential issue is that the free backup only applies to the first 5 GB of storage. Anything more, and you’ll need to pay up for Microsoft's OneDrive services. But thankfully, you can turn off anything you don't want to back up by going to Settings > OneDrive and toggling off options like Documents, Pictures and Videos to get in under the free threshold to start. Once you're signed in, a window will pop up that says \"Add this device to receive Extended Security Updates.\" Click Add Device to enroll it. Click Done. A note: Thanks to YouTube's Explaining Computers channel, where we grabbed the screenshot above (since our test PC was already signed up for cloud backups, and didn't provide the splash screen to choose options). You can watch their full video if you'd like a deeper dive into the process. That's it, you're done! (Until next year) You've got 12 more months to figure out an alternative upgrade path to Windows 11. If anything changes next year, we'll update this story with what your next steps are. You did it right if you see this window. (Screenshot/Engadget) This article originally appeared on Engadget at https://www.engadget.com/computing/microsoft-has-ended-windows-10-support-but-heres-how-to-get-an-extra-year-for-free-125118044.html?src=rss",
          "content": "You'll get access to Windows 10 a little longer by doing this. (Getty Images) Are you still using Windows 10 on your desktop or laptop? If so, you need to know this: As of October 14, Microsoft moved the software to its \"end of life\" phase. What that means is that while Windows 10 PCs will continue to work, they'll stop getting important security updates by default. That leaves you with three options to make sure your computer remains secure: You can choose to upgrade to Windows 11 for free if your computer is compatible. You can buy a new PC that already has Windows 11 pre-installed (or opt for an alternative, like a Mac or a Chromebook). Forget about Windows 11 right now and sign up for the Extended Security Updates (ESU), which lets you kick the can down the road for a year. The third option is easier than it sounds — and can now be done for free in many cases — so we'll focus on that one here. We'll walk you through the steps of keeping Windows 10 on your PC… for now, at least. How to sign up for Windows 10 Extended Security Updates on your computer We can question Microsoft's motives for killing off Windows 10, even though it works perfectly well on most older PCs. But without those periodic security updates, your PC will become increasingly susceptible to malware with each passing week. To that end, enrolling in Extended Security Updates (ESU) will give you another year of using Windows 10 securely. At one point, Microsoft suggested the 12-month extension would require a $30 fee. While that's still an option, there's now a free path for Windows 10 users in the US. Here's how to make it happen. Step 1: Make sure your PC is up to date You can find out if your computer is up-to-date by going into your Settings > System > About, then scroll down to see what version you're running. If not, you'll want to make sure you also install all the Windows 10 updates available. Step 2: Make sure you're using an administrator account If you share a computer with multiple people in your household, make sure you're signed in to the administrator account. Typically, it's the first account created on the computer. You'll know it's the right one when you see \"Administrator\" under the name. (You can double-check under Settings > Your Info.) Step 3: Verify if your PC is eligible to upgrade to Windows 11 (or not) If you see an option to upgrade to Windows 11, just do that. It's free and it keeps you in the Windows loop. Otherwise, continue following the steps below so you can keep your computer safe with security updates. Step 4: Enroll in Extended Security Updates Sign up for ESU by selecting Update & Security from the Settings menu. Click the \"Enroll Now\" sign-up link, as pictured below. Again, you may see an option to download Windows 11 if your computer meets the requirements (again, definitely do that if you see it). Find out if you need to update your computer. (Screenshot/Engadget) If you're not seeing the \"Enroll now\" link, you probably need to update and install the latest Windows 10 updates (as noted above). By enrolling in Extended Security Updates, you'll have another year before you need to upgrade to Windows 11. (Screenshots/Engadget) Step 5: Choose your upgrade method Next up is choosing how you want to enroll, and you have a few options. The easiest way is to back up your PC settings. It's free, but it takes a little bit of time since you'll need to back up your data. Again, you'll need to use your administrator account to get started. Back up your PC before you enroll in ESU. (ExplainingComputers via YouTube) That said, the free option here comes with two catches, at least for users in the US. (European users will get the free option with no strings attached.) The first is that you'll be linking your Windows login to Microsoft's cloud-based online service. Most users have likely already done this (if they're using CoPilot, Office 365, GamePass, OneDrive or one of Microsoft's other various online services). But if you've specifically opted for a local login to Windows, the price you're paying for this \"free\" extension is joining the cloud-connected Microsoft universe. The other potential issue is that the free backup only applies to the first 5 GB of storage. Anything more, and you’ll need to pay up for Microsoft's OneDrive services. But thankfully, you can turn off anything you don't want to back up by going to Settings > OneDrive and toggling off options like Documents, Pictures and Videos to get in under the free threshold to start. Once you're signed in, a window will pop up that says \"Add this device to receive Extended Security Updates.\" Click Add Device to enroll it. Click Done. A note: Thanks to YouTube's Explaining Computers channel, where we grabbed the screenshot above (since our test PC was already signed up for cloud backups, and didn't provide the splash screen to choose options). You can watch their full video if you'd like a deeper dive into the process. That's it, you're done! (Until next year) You've got 12 more months to figure out an alternative upgrade path to Windows 11. If anything changes next year, we'll update this story with what your next steps are. You did it right if you see this window. (Screenshot/Engadget) This article originally appeared on Engadget at https://www.engadget.com/computing/microsoft-has-ended-windows-10-support-but-heres-how-to-get-an-extra-year-for-free-125118044.html?src=rss",
          "feed_position": 4,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-10/c836b6e0-a60d-11f0-aff0-71a091f199fd"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/samsung-galaxy-s25-fe-review-iterative-to-a-fault-183026577.html",
          "published_at": "Mon, 20 Oct 2025 18:30:26 +0000",
          "title": "Samsung Galaxy S25 FE review: Iterative to a fault",
          "standfirst": "Five years after the release of the Galaxy S20 FE, Samsung has settled into a predictable pattern with its \"Fan Edition\" line of phones. Each new phone doesn't offer much new or different from its immediate predecessor, with the company opting to offer iterative updates instead. That might have been fine before, but with the arrival of the Nothing Phone 3a Pro and Pixel 10 — devices that changed the value proposition in their respective categories — the S25 FE feels woefully out of touch with a market that's changing to meet people's demands. There's not much here that makes the new Galaxy S25 FE stand out, and any \"upgrades\" aren't substantive. Hardware and display Igor Bonifacic for Engadget When I first took the S25 FE out of the box, I thought Samsung had played a cruel trick on me. The phone looks identical to its predecessor, sporting the same brushed aluminum frame that's been the company's go-to for years now. I had to dig the S24 FE out of my gadgets drawer to compare the two phones before I confirmed they were in fact different devices. The physical differences are minor. Samsung has tweaked the dimensions of the new phone, making it slightly shorter, wider and thinner. Specifically, the S25 FE measures in at 6.35 x 3.02 x 0.29 inches, while its predecessor was 6.38 x 3.04 x 0.31 inches. The new phone is also protected by Samsung's \"enhanced Armor\" aluminum frame. More noticeable is that the S25 FE is lighter than last year's model, coming in at 6.7 ounces, down from 7.51 ounces. This is despite the fact the new device has a higher-capacity 4,900mAh battery. Together, these changes don't make the S25 FE easier to hold if you have small hands (just ask my girlfriend), but it does feel better balanced than its predecessor. One issue with the size of the S25 FE is the placement of the in-display fingerprint sensor. It's right at the bottom of the screen. I found this made it awkward to unlock the phone with my thumb — and I'm someone with big hands. Another slight difference is the finish on the back of the phone. This time around, Samsung has gone with a matte coating, instead of the glossy finish it used on the S24 FE. It's a welcome change since it makes the new model less prone to smudging and attracting fingerprints. I just wish Samsung had decided to offer the S25 FE in more fun colors. At release, it's available in four colorways: white, icy blue, jet black and navy (pictured). So, if you don't like blue, I'm sorry. Amid the slight design tweaks, Samsung has gone with the same screen it did last year. The S25 FE has a 6.7-inch AMOLED display, with a panel that offers a 120Hz refresh rate and 1080p resolution. The S24 FE's vibrant screen was one of the best parts of last year's model, and it's the same with S25 FE. It's easy to see the screen in bright sunlight, thanks to the fact it can push 1,900 nits of peak brightness. It's also vibrant, and with HDR10 support included, great for watching videos on YouTube, Netflix and elsewhere. Cameras Igor Bonifacic for Engadget Samsung made a single tweak to the Galaxy S25 FE's camera hardware. Like last year's model, the new phone has a 50-megapixel main camera with optical image stabilization (OIS) and a fast f/1.8 aperture lens. Once again, it also has an 8MP telephoto camera with a 3x optical zoom and a 12MP ultrawide angle that offers a 123-degree field of view. The one addition is a higher resolution 12MP front-facing camera with a faster f/2.2 aperture lens. For selfies, the S24 FE made do with a 10MP sensor and f/2.4 lens. If the new front-facing camera included phase detection autofocus (PDAF), it would be the same one that's available on the Galaxy S25. Unfortunately, it doesn't and that's a shame because PDAF greatly increases the likelihood your photos will come out sharp and in focus. It's also a shame Samsung decided not to update the FE's telephoto camera. Before the Nothing 3a Pro, that was one of the features that made the S24 FE stand out in its price range. In 2025, however, the S25 FE's telephoto feels outdated. It doesn't offer the 5x optical zoom of the Pixel 10 nor the 50MP of resolution and periscope zoom you get with the 3a Pro. Coming from the former, the FE's telephoto camera felt limiting. With only 8MP of resolution, trying to snap a photo at anything beyond 5x zoom was pointless; it would just turn out a blurry mess. As for FE's other cameras, they're decent if uninspiring. The 50MP camera is the best of the bunch, capable of capturing detailed, good-looking photos even in low light. The ultrawide, meanwhile, is mostly forgettable. It does an okay job of capturing big scenes, but it's lacking in dynamic range and detail. The selfie camera is a noticeable upgrade from the one that came with last year's model, and produces pleasing photos that are on par with what you can expect from the S25's front-facing camera. Otherwise, snapping pictures with the S25 FE feels like using a flagship phone from a few years ago. The one thing that saves it from being a complete blast from the past is the inclusion of Samsung's generative photo editing software, which you can use to remove distracting objects from photos. Of the AI photo apps I've tested, Samsung's is among the best at editing out objects without smearing the background. You can also use the generative edit to add things to a photo, but as you might expect, this doesn't work as well as removing them. Performance and battery life Igor Bonifacic for Engadget On paper, the S25 FE should offer better performance than its predecessor, thanks to Samsung's decision to equip the phone with its Exynos 2400 chipset over the cut-down Exynos 2400e it used on last year's model. In practice the two are about on par with one another. On Geekbench's processor test, the Exynos 2400 delivered a 2,144 single-core score and a 7,059 multi-core score. That's not much better than the 2,140 and 6,690 I recorded last fall on the S24 FE. Still, it's a more impressive showing than either the Pixel 9a and Nothing 3a Pro had when my colleague Sam Rutherford and I put their Tensor G4 and Snapdragon 7s Gen 3 chips through Geekbench earlier this year. For comparison, the former delivered a modest 1,665 on single-core performance and 4,294 on multi-core performance. The latter scored an even less impressive 1,115 and 3,082 respectively. In real-world use, the Exynos 2400 feels snappy. Scrolling is fast and fluid, as is opening apps and switching between them. Gaming performance is also impressive, with the chip able to handle the 60 fps modes in graphically demanding games like Diablo Immortal and League of Legends: Wild Rift without dropping frames. Last year, Samsung said it redesigned the S24 FE's vapor chamber to make it bigger and improve cooling. With the S25 FE, that component is an additional 10 percent larger. However, if the new vapor chamber made a difference to the phone's thermals, I had a hard time telling. Both the S25 FE and S24 FE got warm after about 15 to 20 minutes of gaming. The new phone never got hot to the point I couldn't hold it anymore, but it also didn't feel noticeably cooler than the S24 FE running the same games. As mentioned at the top, the S25 FE has a larger 4,900mAh battery. That's about four percent more capacity than the S24 FE offered. As a result, any difference in battery life is minimal. I'm sure there are some scenarios the S25 FE may last longer than its predecessor, but in my testing the two phones were equal in terms of longevity. With three to four hours of active screentime, I managed to get a full day of battery life from the S25 FE, with enough power left over to get the phone through the night before charging it in the morning. That's similar to the experience I had last year. Speaking of charging, the S24 FE, with a 25 watt wired limit, was painfully slow at it. Going into this review, my hope was the S25 FE would do better and I had good reason to be hopeful. Samsung lists the new phone as capable of charging at 45 watts. However, in my testing the S25 FE was only slightly faster than its predecessor. Plugged into a 130 watt Razer GaN charger, it took the phone about an hour and 14 minutes to charge to full from a battery at 10 percent life. When I replicated that same test with a 25 watt charger, it took the S25 FE just over an hour-and-a-half to charge back up. Either way, if battery life is important to you, the Nothing 3a Pro and Pixel 9a are better bets. Both come with bigger batteries (5,000 and 5,100mAh, respectively), and with the former, you also get 50 watt charging. Software Igor Bonifacic for Engadget The S25 FE ships with Android 16 and Samsung's One UI 8 out of the box. Samsung has promised to support the phone with at least seven generations of platform updates, so it should stay current with Google's yearly release schedule up until at least Android 23 in 2032. Notably, this means the S25 FE may end up on a more recent version of Android than the S25, S25 Edge and S25 Ultra, all of which released with Android 15. With One UI 8, the S25 FE has access to all of the latest AI features from both Samsung and Google. Some of these tools are useful; others replicate functionality that has been present in Android for a long time. For example, Google's Circle to Search is great. It makes it easy to do a visual search of anything on the phone's screen. On the other hand, I could do without Samsung's Now Brief, which offers much of the same utility you'll find on Android's Discover page (a feature that comes standard on every Android phone). Each S25 FE also comes with six months of free access to Google AI Pro. Normally priced at $20 per month, the service gives you access to some of the company's best models, including Gemini 2.5 Pro, inside of the Gemini app. Within Flow, Google's AI filmmaking app, you also get limited access to Veo 3.1, Google's latest video generation system. Some other perks include 2TB of cloud storage and higher rate limits when using NotebookLM. Wrap-up Igor Bonifacic for Engadget With changes that amount to window dressing, I can't recommend anyone buy the S25 FE at full price. There's just enough here to justify spending $650 on a phone that is barely an upgrade over its predecessor. If you're a Samsung fan, I'm sure the S25 FE will be frequently discounted, but why reward the company for a lazy effort? Besides, the S25, following a $200 discount for Prime Day, was only $10 more than the FE earlier this month. Over the past few years, Google and Nothing have shown midrange phones don't need to be boring, iterative affairs. For Samsung, I think it's time to rethink its FE strategy. If these phones offered something different — say actual fan favorite features like a headphone jack — there could be compelling reasons to recommend them. But as things stand, there's just no reason to buy a new FE phone when the company's flagships see steep price discounts within months of their release.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/samsung-galaxy-s25-fe-review-iterative-to-a-fault-183026577.html?src=rss",
          "content": "Five years after the release of the Galaxy S20 FE, Samsung has settled into a predictable pattern with its \"Fan Edition\" line of phones. Each new phone doesn't offer much new or different from its immediate predecessor, with the company opting to offer iterative updates instead. That might have been fine before, but with the arrival of the Nothing Phone 3a Pro and Pixel 10 — devices that changed the value proposition in their respective categories — the S25 FE feels woefully out of touch with a market that's changing to meet people's demands. There's not much here that makes the new Galaxy S25 FE stand out, and any \"upgrades\" aren't substantive. Hardware and display Igor Bonifacic for Engadget When I first took the S25 FE out of the box, I thought Samsung had played a cruel trick on me. The phone looks identical to its predecessor, sporting the same brushed aluminum frame that's been the company's go-to for years now. I had to dig the S24 FE out of my gadgets drawer to compare the two phones before I confirmed they were in fact different devices. The physical differences are minor. Samsung has tweaked the dimensions of the new phone, making it slightly shorter, wider and thinner. Specifically, the S25 FE measures in at 6.35 x 3.02 x 0.29 inches, while its predecessor was 6.38 x 3.04 x 0.31 inches. The new phone is also protected by Samsung's \"enhanced Armor\" aluminum frame. More noticeable is that the S25 FE is lighter than last year's model, coming in at 6.7 ounces, down from 7.51 ounces. This is despite the fact the new device has a higher-capacity 4,900mAh battery. Together, these changes don't make the S25 FE easier to hold if you have small hands (just ask my girlfriend), but it does feel better balanced than its predecessor. One issue with the size of the S25 FE is the placement of the in-display fingerprint sensor. It's right at the bottom of the screen. I found this made it awkward to unlock the phone with my thumb — and I'm someone with big hands. Another slight difference is the finish on the back of the phone. This time around, Samsung has gone with a matte coating, instead of the glossy finish it used on the S24 FE. It's a welcome change since it makes the new model less prone to smudging and attracting fingerprints. I just wish Samsung had decided to offer the S25 FE in more fun colors. At release, it's available in four colorways: white, icy blue, jet black and navy (pictured). So, if you don't like blue, I'm sorry. Amid the slight design tweaks, Samsung has gone with the same screen it did last year. The S25 FE has a 6.7-inch AMOLED display, with a panel that offers a 120Hz refresh rate and 1080p resolution. The S24 FE's vibrant screen was one of the best parts of last year's model, and it's the same with S25 FE. It's easy to see the screen in bright sunlight, thanks to the fact it can push 1,900 nits of peak brightness. It's also vibrant, and with HDR10 support included, great for watching videos on YouTube, Netflix and elsewhere. Cameras Igor Bonifacic for Engadget Samsung made a single tweak to the Galaxy S25 FE's camera hardware. Like last year's model, the new phone has a 50-megapixel main camera with optical image stabilization (OIS) and a fast f/1.8 aperture lens. Once again, it also has an 8MP telephoto camera with a 3x optical zoom and a 12MP ultrawide angle that offers a 123-degree field of view. The one addition is a higher resolution 12MP front-facing camera with a faster f/2.2 aperture lens. For selfies, the S24 FE made do with a 10MP sensor and f/2.4 lens. If the new front-facing camera included phase detection autofocus (PDAF), it would be the same one that's available on the Galaxy S25. Unfortunately, it doesn't and that's a shame because PDAF greatly increases the likelihood your photos will come out sharp and in focus. It's also a shame Samsung decided not to update the FE's telephoto camera. Before the Nothing 3a Pro, that was one of the features that made the S24 FE stand out in its price range. In 2025, however, the S25 FE's telephoto feels outdated. It doesn't offer the 5x optical zoom of the Pixel 10 nor the 50MP of resolution and periscope zoom you get with the 3a Pro. Coming from the former, the FE's telephoto camera felt limiting. With only 8MP of resolution, trying to snap a photo at anything beyond 5x zoom was pointless; it would just turn out a blurry mess. As for FE's other cameras, they're decent if uninspiring. The 50MP camera is the best of the bunch, capable of capturing detailed, good-looking photos even in low light. The ultrawide, meanwhile, is mostly forgettable. It does an okay job of capturing big scenes, but it's lacking in dynamic range and detail. The selfie camera is a noticeable upgrade from the one that came with last year's model, and produces pleasing photos that are on par with what you can expect from the S25's front-facing camera. Otherwise, snapping pictures with the S25 FE feels like using a flagship phone from a few years ago. The one thing that saves it from being a complete blast from the past is the inclusion of Samsung's generative photo editing software, which you can use to remove distracting objects from photos. Of the AI photo apps I've tested, Samsung's is among the best at editing out objects without smearing the background. You can also use the generative edit to add things to a photo, but as you might expect, this doesn't work as well as removing them. Performance and battery life Igor Bonifacic for Engadget On paper, the S25 FE should offer better performance than its predecessor, thanks to Samsung's decision to equip the phone with its Exynos 2400 chipset over the cut-down Exynos 2400e it used on last year's model. In practice the two are about on par with one another. On Geekbench's processor test, the Exynos 2400 delivered a 2,144 single-core score and a 7,059 multi-core score. That's not much better than the 2,140 and 6,690 I recorded last fall on the S24 FE. Still, it's a more impressive showing than either the Pixel 9a and Nothing 3a Pro had when my colleague Sam Rutherford and I put their Tensor G4 and Snapdragon 7s Gen 3 chips through Geekbench earlier this year. For comparison, the former delivered a modest 1,665 on single-core performance and 4,294 on multi-core performance. The latter scored an even less impressive 1,115 and 3,082 respectively. In real-world use, the Exynos 2400 feels snappy. Scrolling is fast and fluid, as is opening apps and switching between them. Gaming performance is also impressive, with the chip able to handle the 60 fps modes in graphically demanding games like Diablo Immortal and League of Legends: Wild Rift without dropping frames. Last year, Samsung said it redesigned the S24 FE's vapor chamber to make it bigger and improve cooling. With the S25 FE, that component is an additional 10 percent larger. However, if the new vapor chamber made a difference to the phone's thermals, I had a hard time telling. Both the S25 FE and S24 FE got warm after about 15 to 20 minutes of gaming. The new phone never got hot to the point I couldn't hold it anymore, but it also didn't feel noticeably cooler than the S24 FE running the same games. As mentioned at the top, the S25 FE has a larger 4,900mAh battery. That's about four percent more capacity than the S24 FE offered. As a result, any difference in battery life is minimal. I'm sure there are some scenarios the S25 FE may last longer than its predecessor, but in my testing the two phones were equal in terms of longevity. With three to four hours of active screentime, I managed to get a full day of battery life from the S25 FE, with enough power left over to get the phone through the night before charging it in the morning. That's similar to the experience I had last year. Speaking of charging, the S24 FE, with a 25 watt wired limit, was painfully slow at it. Going into this review, my hope was the S25 FE would do better and I had good reason to be hopeful. Samsung lists the new phone as capable of charging at 45 watts. However, in my testing the S25 FE was only slightly faster than its predecessor. Plugged into a 130 watt Razer GaN charger, it took the phone about an hour and 14 minutes to charge to full from a battery at 10 percent life. When I replicated that same test with a 25 watt charger, it took the S25 FE just over an hour-and-a-half to charge back up. Either way, if battery life is important to you, the Nothing 3a Pro and Pixel 9a are better bets. Both come with bigger batteries (5,000 and 5,100mAh, respectively), and with the former, you also get 50 watt charging. Software Igor Bonifacic for Engadget The S25 FE ships with Android 16 and Samsung's One UI 8 out of the box. Samsung has promised to support the phone with at least seven generations of platform updates, so it should stay current with Google's yearly release schedule up until at least Android 23 in 2032. Notably, this means the S25 FE may end up on a more recent version of Android than the S25, S25 Edge and S25 Ultra, all of which released with Android 15. With One UI 8, the S25 FE has access to all of the latest AI features from both Samsung and Google. Some of these tools are useful; others replicate functionality that has been present in Android for a long time. For example, Google's Circle to Search is great. It makes it easy to do a visual search of anything on the phone's screen. On the other hand, I could do without Samsung's Now Brief, which offers much of the same utility you'll find on Android's Discover page (a feature that comes standard on every Android phone). Each S25 FE also comes with six months of free access to Google AI Pro. Normally priced at $20 per month, the service gives you access to some of the company's best models, including Gemini 2.5 Pro, inside of the Gemini app. Within Flow, Google's AI filmmaking app, you also get limited access to Veo 3.1, Google's latest video generation system. Some other perks include 2TB of cloud storage and higher rate limits when using NotebookLM. Wrap-up Igor Bonifacic for Engadget With changes that amount to window dressing, I can't recommend anyone buy the S25 FE at full price. There's just enough here to justify spending $650 on a phone that is barely an upgrade over its predecessor. If you're a Samsung fan, I'm sure the S25 FE will be frequently discounted, but why reward the company for a lazy effort? Besides, the S25, following a $200 discount for Prime Day, was only $10 more than the FE earlier this month. Over the past few years, Google and Nothing have shown midrange phones don't need to be boring, iterative affairs. For Samsung, I think it's time to rethink its FE strategy. If these phones offered something different — say actual fan favorite features like a headphone jack — there could be compelling reasons to recommend them. But as things stand, there's just no reason to buy a new FE phone when the company's flagships see steep price discounts within months of their release.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/samsung-galaxy-s25-fe-review-iterative-to-a-fault-183026577.html?src=rss",
          "feed_position": 6,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-10/adf88820-add9-11f0-a6f7-9b48f1e9c328"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/cybersecurity/vpn/how-to-cancel-nordvpn-and-get-your-money-back-173008588.html",
          "published_at": "Mon, 20 Oct 2025 17:30:08 +0000",
          "title": "How to cancel NordVPN and get your money back",
          "standfirst": "There's a lot to like about NordVPN, as I covered in my full NordVPN review. It's one of the fastest among the best VPNs, and it's got a bunch of cool, specialized servers for various VPN tasks. But the apps can be frustrating, and beyond that, no VPN is perfect for everyone. If you've decided NordVPN isn't for you, here's how to cancel your subscription and get your money back. How to turn off auto-renewal on NordVPN Even though you've decided to part ways with NordVPN, you may want to keep your subscription active while you pick out a replacement service. If that's the case, you can simply cancel automatic renewal and let your subscription expire at the end of the billing period. If you change your mind before then, you can turn auto-renew back on. Here's how to do it. Go to my.nordaccount.com. Click Log in to Nord Account and enter your email address and password. You'll arrive at the account overview page. In the left-hand column, click on Billing. On the list of subscriptions that appears, find NordVPN. Find the line that says \"Auto-renewal: ON,\" and click the Cancel link next to it. A warning message will appear. Click Cancel auto-renewal at the bottom-right. Sam Chapman for Engadget This will turn auto-renewal off. If you decide to turn it back on, just go back to the billing tab of your Nord account overview, find your NordVPN subscription and click Enable auto-renewal. How to cancel if you subscribed through an app store If you paid for NordVPN on a mobile device through Google Play or the Apple app store, you'll need to go to the relevant app store to cancel the subscription. On Android, sign in to Google Play, touch your profile picture, tap Payments & subscriptions and tap Subscriptions. Scroll until you find NordVPN, tap it and hit Cancel subscription. If you want a refund, follow the instructions in \"How to get a refund from NordVPN\" below. On iOS, open the settings app, touch your profile picture, then tap Subscription. Scroll down to NordVPN, tap it and hit Cancel subscription. To get a refund for an Apple purchase, contact the Apple support team instead of the NordVPN team. How to delete your NordVPN account On the other hand, if you're sick of NordVPN and already have another VPN lined up, you can cancel immediately by deleting your Nord account altogether. This will also cut you off from any other Nord Security products you might be using, including NordPass and NordLocker. Go to my.nordaccount.com, click Log in to Nord Account and enter your credentials. At the top-right of the account overview page, click your email address. In the dropdown menu, click Account settings. Look at the bottom of the page to find the account deletion controls. Click Delete account. Nord will send an authentication code to your account's email address. Enter it. Follow the onscreen prompts to confirm deletion. Sam Chapman for Engadget How to get a refund from NordVPN NordVPN has a standard 30-day money-back guarantee. As long as you bought your subscription in the last 30 days, you can get a full refund. To do so, you'll need to first cancel auto-renewal on your plan as described above, then contact support to ask for the refund. You can reach NordVPN support by going to the help center at support.nordvpn.com. To reach the live chat and email ticket options, you'll need to work your way down to a bottom-level help center article, then scroll down until you reach the section titled \"Still having issues?\" It's frustrating, but you can get there by just clicking the first link on every page (or just follow this link and scroll down). Sam Chapman for Engadget Once you've found the buttons, either start a live chat or open the email form. Whichever you choose, explain that you've cancelled your subscription and would like a refund. Make sure not to end the interaction until you've received confirmation that your refund will be processed. Afterwards, it'll take up to 10 business days for your reimbursement to go through. NordVPN alternatives With NordVPN cancelled, you may be in the market for another VPN. I've collected several on my best VPN list (linked at the start of the article), but here's a few specific recommendations: Proton VPN is the best overall, Surfshark is the fastest and ExpressVPN is good for beginners and great at streaming. Good luck in your quest for a VPN that meets your needs.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-cancel-nordvpn-and-get-your-money-back-173008588.html?src=rss",
          "content": "There's a lot to like about NordVPN, as I covered in my full NordVPN review. It's one of the fastest among the best VPNs, and it's got a bunch of cool, specialized servers for various VPN tasks. But the apps can be frustrating, and beyond that, no VPN is perfect for everyone. If you've decided NordVPN isn't for you, here's how to cancel your subscription and get your money back. How to turn off auto-renewal on NordVPN Even though you've decided to part ways with NordVPN, you may want to keep your subscription active while you pick out a replacement service. If that's the case, you can simply cancel automatic renewal and let your subscription expire at the end of the billing period. If you change your mind before then, you can turn auto-renew back on. Here's how to do it. Go to my.nordaccount.com. Click Log in to Nord Account and enter your email address and password. You'll arrive at the account overview page. In the left-hand column, click on Billing. On the list of subscriptions that appears, find NordVPN. Find the line that says \"Auto-renewal: ON,\" and click the Cancel link next to it. A warning message will appear. Click Cancel auto-renewal at the bottom-right. Sam Chapman for Engadget This will turn auto-renewal off. If you decide to turn it back on, just go back to the billing tab of your Nord account overview, find your NordVPN subscription and click Enable auto-renewal. How to cancel if you subscribed through an app store If you paid for NordVPN on a mobile device through Google Play or the Apple app store, you'll need to go to the relevant app store to cancel the subscription. On Android, sign in to Google Play, touch your profile picture, tap Payments & subscriptions and tap Subscriptions. Scroll until you find NordVPN, tap it and hit Cancel subscription. If you want a refund, follow the instructions in \"How to get a refund from NordVPN\" below. On iOS, open the settings app, touch your profile picture, then tap Subscription. Scroll down to NordVPN, tap it and hit Cancel subscription. To get a refund for an Apple purchase, contact the Apple support team instead of the NordVPN team. How to delete your NordVPN account On the other hand, if you're sick of NordVPN and already have another VPN lined up, you can cancel immediately by deleting your Nord account altogether. This will also cut you off from any other Nord Security products you might be using, including NordPass and NordLocker. Go to my.nordaccount.com, click Log in to Nord Account and enter your credentials. At the top-right of the account overview page, click your email address. In the dropdown menu, click Account settings. Look at the bottom of the page to find the account deletion controls. Click Delete account. Nord will send an authentication code to your account's email address. Enter it. Follow the onscreen prompts to confirm deletion. Sam Chapman for Engadget How to get a refund from NordVPN NordVPN has a standard 30-day money-back guarantee. As long as you bought your subscription in the last 30 days, you can get a full refund. To do so, you'll need to first cancel auto-renewal on your plan as described above, then contact support to ask for the refund. You can reach NordVPN support by going to the help center at support.nordvpn.com. To reach the live chat and email ticket options, you'll need to work your way down to a bottom-level help center article, then scroll down until you reach the section titled \"Still having issues?\" It's frustrating, but you can get there by just clicking the first link on every page (or just follow this link and scroll down). Sam Chapman for Engadget Once you've found the buttons, either start a live chat or open the email form. Whichever you choose, explain that you've cancelled your subscription and would like a refund. Make sure not to end the interaction until you've received confirmation that your refund will be processed. Afterwards, it'll take up to 10 business days for your reimbursement to go through. NordVPN alternatives With NordVPN cancelled, you may be in the market for another VPN. I've collected several on my best VPN list (linked at the start of the article), but here's a few specific recommendations: Proton VPN is the best overall, Surfshark is the fastest and ExpressVPN is good for beginners and great at streaming. Good luck in your quest for a VPN that meets your needs.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-cancel-nordvpn-and-get-your-money-back-173008588.html?src=rss",
          "feed_position": 9,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-10/813933f0-ab92-11f0-befe-8b86b84e993e"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/the-best-new-computers-to-replace-your-old-windows-10-pc-134500000.html",
          "published_at": "Mon, 20 Oct 2025 14:24:36 +0000",
          "title": "The best new computers to replace your old Windows 10 PC",
          "standfirst": "It’s official: Microsoft has officially ended support for Windows 10. Thankfully, there’s a free and easy way to get another year’s worth of Extended Security Updates (which will take you to mid-October 2026). But even if your computer meets the minimum system requirements for a free Windows 11 upgrade, anything older than a year won't be able to take advantage of Microsoft's Copilot+ AI PC features, like Windows Recall or Studio Effects for video chats. So if you've already been feeling that your current aging PC is on the verge of dying — slow performance, whining fans, batteries that barely keep a charge — it's probably time to consider replacing it with a new system. We've already done the legwork of researching and selecting new hardware in our best laptop and best Windows notebook guides (we've also covered more powerful gaming and schoolwork systems), but here are some suggestions if you're just looking to snap up something quickly. The best Windows 10 laptop replacements Surface Laptop 13.8-inch In many ways, the Snapdragon-powered Surface Laptop is emblematic of where Windows PCs are headed. It's incredibly light, surprisingly powerful for something with a mobile chip and its battery lasted over 17-and-a-half hours in our testing. While you may run into some compatibility issues if you're running ancient Windows programs, for most people the Surface Laptop is one of the best PC experiences they can have today. If you're looking for something smaller and cheaper, there's also a $700 13-inch model, and the $1,200 15-inch version is worth it if you need a bigger screen. (Check out our full review of the Surface Laptop 13.8-inch.) Dell 14 Premium laptop Sam Rutherford for Engadget Dell 14 Premium We loved last year's XPS 14, and now that it’s been renamed as the Dell 14 Premium, it’s still a fantastic machine. It looks and feels luxurious, and it has one of the best screens around. You may just need some time getting used to its invisible trackpad (which is blended into the palm rest), and its capacitive function key row. (Check out our full Editor’s Choice review of the Dell 14 Premium.) ASUS ZenBook S 14 The ZenBook S14 wowed us with its powerful hardware, excellent battery life (of over 16 hours) and solid construction. It's a sign of how far ASUS has come from simply copying Apple. The S14 is also lighter than the MacBook Air, and it includes more useful ports (two USB-C, one USB-A, HDMI and a headphone jack). Its Ceraluminum case (a unique ceramic material) also feels surprisingly polished, and its OLED screen looks simply amazing. (Check out our full review of the ASUS ZenBook S 14.) Apple MacBook Air Don't yell at me — Apple's new computers are so good that Windows users should seriously consider jumping ship to Macs. While the software may take some getting used to, it's worth the struggle for the speed and incredible battery life from Apple's M-series chips. The MacBook Air remains one of the best computers around, with an incredibly thin and fan-less case and far more power than you'd think. And if you're an iPhone user, you'll also have access to features like phone mirroring that are tough to replicate on Windows. (Check out our full review of the M4 MacBook Air.) Dell Slim Desktop Dell The best Windows 10 desktop replacements Dell Slim desktop If you're just looking for a basic desktop replacement, it's hard to go wrong with the Dell Slim. While we haven't reviewed this specific model, the specs on even the entry-level configuration have all of the power you need for basic computing, despite housing everything in a frame that's notably smaller than older tower PCs. And if you need a bit more performance, consider the slightly more expensive Dell Pro, which can squeeze in up to 32GB of RAM and a handful of dedicated graphics cards. Apple Mac Mini Apple's Mac mini is one of the most powerful mini-desktops around, it's adorably small and it starts at just $599 (look for the frequent sales that drop the price by as much as $100). Just as I argued above for the MacBook Air, it's worth considering the jump to MacOS simply because Apple's hardware is so impressive now. And don't worry, you can connect any monitor to it, and you won't have to replace your existing PC keyboard and mouse. Geekom A6 Mini While I haven't tested the Geekom A6 Mini yet, it's widely considered one of the best Windows mini-desktops around $400 to $500. The A6 Mini features a very capable AMD Ryzen 7 6800H processor with a bit of gaming power, 16GB of RAM and a 512GB SSD. You honestly don't need much more for basic productivity work. Frequently Asked Questions Do I need to upgrade to a new computer if my current Windows 10 PC still works fine for me? Your computer will still continue to run following the Microsoft’s termination of default support for Windows 10 on October 15, 2025, but that’s not a wise longterm strategy. The free Extended Security Updates will buy you another year, but that's effectively a limited life support: After that, Windows 10 PCs won’t receive security updates or any sort of improvements, so they’ll be vulnerable to hacking and malware. And if you’ve still got an old Windows 10 machine, there’s a good chance that its components may wear out soon. If you choose to continue using a Windows 10 PC, be sure to back up your important data and try not to rely on it for critical tasks. Can a Mac run native Windows software? Virtualization software like VMWare and Parallels can let you run Windows apps inside of macOS, but be aware that also involves buying a copy of Windows and dedicating a large chunk of disk space for it. These days, most major apps are available across both platforms, so be sure to check if there’s a Mac version of your favorite Windows app. Can a Chromebook or iPad replace a Windows 10 PC? Chromebooks and iPads both have very specific purposes: Chromebooks are great budget-friendly machines for accessing the web and running online apps. iPads are a handy way to upgrade your mobile internet experiences, since their large screens are better for browsing the web, running apps and watching media. But neither are ideal replacements for a Windows 10 PC, which can access the full breadth of Windows software in addition to the web. If either one works for you, great; but we think the options listed above are better full-service PC replacements. I have a ton of PC games. What's my best upgrade option? It’s easy to find a decent gaming desktop from a reliable computer maker these days, just make sure you’re equipped with at least 32GB of RAM (new titles can be pretty memory intensive), and an NVIDIA RTX 40-series or AMD Radeon RX 9000-series GPU. As for CPUs, I’d recommend sticking with Intel’s 13th-gen chips or AMD’s Ryzen 8000-series processors at a minimum. Don’t count out gaming laptops either, as they’ve come a long way over the last decade. It’s not hard to find a gaming notebook that’s powerful, portable and useful for multimedia and productivity work as well. Update, October 20 2025, 9:30AM ET: This story has been updated to reflect that the Windows 10 end of support date has now passed, and we’ve included a link to an explainer on how to extend support for another year for free. This article originally appeared on Engadget at https://www.engadget.com/computing/the-best-new-computers-to-replace-your-old-windows-10-pc-134500000.html?src=rss",
          "content": "It’s official: Microsoft has officially ended support for Windows 10. Thankfully, there’s a free and easy way to get another year’s worth of Extended Security Updates (which will take you to mid-October 2026). But even if your computer meets the minimum system requirements for a free Windows 11 upgrade, anything older than a year won't be able to take advantage of Microsoft's Copilot+ AI PC features, like Windows Recall or Studio Effects for video chats. So if you've already been feeling that your current aging PC is on the verge of dying — slow performance, whining fans, batteries that barely keep a charge — it's probably time to consider replacing it with a new system. We've already done the legwork of researching and selecting new hardware in our best laptop and best Windows notebook guides (we've also covered more powerful gaming and schoolwork systems), but here are some suggestions if you're just looking to snap up something quickly. The best Windows 10 laptop replacements Surface Laptop 13.8-inch In many ways, the Snapdragon-powered Surface Laptop is emblematic of where Windows PCs are headed. It's incredibly light, surprisingly powerful for something with a mobile chip and its battery lasted over 17-and-a-half hours in our testing. While you may run into some compatibility issues if you're running ancient Windows programs, for most people the Surface Laptop is one of the best PC experiences they can have today. If you're looking for something smaller and cheaper, there's also a $700 13-inch model, and the $1,200 15-inch version is worth it if you need a bigger screen. (Check out our full review of the Surface Laptop 13.8-inch.) Dell 14 Premium laptop Sam Rutherford for Engadget Dell 14 Premium We loved last year's XPS 14, and now that it’s been renamed as the Dell 14 Premium, it’s still a fantastic machine. It looks and feels luxurious, and it has one of the best screens around. You may just need some time getting used to its invisible trackpad (which is blended into the palm rest), and its capacitive function key row. (Check out our full Editor’s Choice review of the Dell 14 Premium.) ASUS ZenBook S 14 The ZenBook S14 wowed us with its powerful hardware, excellent battery life (of over 16 hours) and solid construction. It's a sign of how far ASUS has come from simply copying Apple. The S14 is also lighter than the MacBook Air, and it includes more useful ports (two USB-C, one USB-A, HDMI and a headphone jack). Its Ceraluminum case (a unique ceramic material) also feels surprisingly polished, and its OLED screen looks simply amazing. (Check out our full review of the ASUS ZenBook S 14.) Apple MacBook Air Don't yell at me — Apple's new computers are so good that Windows users should seriously consider jumping ship to Macs. While the software may take some getting used to, it's worth the struggle for the speed and incredible battery life from Apple's M-series chips. The MacBook Air remains one of the best computers around, with an incredibly thin and fan-less case and far more power than you'd think. And if you're an iPhone user, you'll also have access to features like phone mirroring that are tough to replicate on Windows. (Check out our full review of the M4 MacBook Air.) Dell Slim Desktop Dell The best Windows 10 desktop replacements Dell Slim desktop If you're just looking for a basic desktop replacement, it's hard to go wrong with the Dell Slim. While we haven't reviewed this specific model, the specs on even the entry-level configuration have all of the power you need for basic computing, despite housing everything in a frame that's notably smaller than older tower PCs. And if you need a bit more performance, consider the slightly more expensive Dell Pro, which can squeeze in up to 32GB of RAM and a handful of dedicated graphics cards. Apple Mac Mini Apple's Mac mini is one of the most powerful mini-desktops around, it's adorably small and it starts at just $599 (look for the frequent sales that drop the price by as much as $100). Just as I argued above for the MacBook Air, it's worth considering the jump to MacOS simply because Apple's hardware is so impressive now. And don't worry, you can connect any monitor to it, and you won't have to replace your existing PC keyboard and mouse. Geekom A6 Mini While I haven't tested the Geekom A6 Mini yet, it's widely considered one of the best Windows mini-desktops around $400 to $500. The A6 Mini features a very capable AMD Ryzen 7 6800H processor with a bit of gaming power, 16GB of RAM and a 512GB SSD. You honestly don't need much more for basic productivity work. Frequently Asked Questions Do I need to upgrade to a new computer if my current Windows 10 PC still works fine for me? Your computer will still continue to run following the Microsoft’s termination of default support for Windows 10 on October 15, 2025, but that’s not a wise longterm strategy. The free Extended Security Updates will buy you another year, but that's effectively a limited life support: After that, Windows 10 PCs won’t receive security updates or any sort of improvements, so they’ll be vulnerable to hacking and malware. And if you’ve still got an old Windows 10 machine, there’s a good chance that its components may wear out soon. If you choose to continue using a Windows 10 PC, be sure to back up your important data and try not to rely on it for critical tasks. Can a Mac run native Windows software? Virtualization software like VMWare and Parallels can let you run Windows apps inside of macOS, but be aware that also involves buying a copy of Windows and dedicating a large chunk of disk space for it. These days, most major apps are available across both platforms, so be sure to check if there’s a Mac version of your favorite Windows app. Can a Chromebook or iPad replace a Windows 10 PC? Chromebooks and iPads both have very specific purposes: Chromebooks are great budget-friendly machines for accessing the web and running online apps. iPads are a handy way to upgrade your mobile internet experiences, since their large screens are better for browsing the web, running apps and watching media. But neither are ideal replacements for a Windows 10 PC, which can access the full breadth of Windows software in addition to the web. If either one works for you, great; but we think the options listed above are better full-service PC replacements. I have a ton of PC games. What's my best upgrade option? It’s easy to find a decent gaming desktop from a reliable computer maker these days, just make sure you’re equipped with at least 32GB of RAM (new titles can be pretty memory intensive), and an NVIDIA RTX 40-series or AMD Radeon RX 9000-series GPU. As for CPUs, I’d recommend sticking with Intel’s 13th-gen chips or AMD’s Ryzen 8000-series processors at a minimum. Don’t count out gaming laptops either, as they’ve come a long way over the last decade. It’s not hard to find a gaming notebook that’s powerful, portable and useful for multimedia and productivity work as well. Update, October 20 2025, 9:30AM ET: This story has been updated to reflect that the Windows 10 end of support date has now passed, and we’ve included a link to an explainer on how to extend support for another year for free. This article originally appeared on Engadget at https://www.engadget.com/computing/the-best-new-computers-to-replace-your-old-windows-10-pc-134500000.html?src=rss",
          "feed_position": 12,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/99233ff0-7236-11f0-babc-58c1851dbde8.jpeg"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/ai/adobe-foundry-wants-to-rebuild-firefly-for-your-brand-not-just-tweak-it",
          "published_at": "Mon, 20 Oct 2025 13:00:00 GMT",
          "title": "Adobe Foundry wants to rebuild Firefly for your brand — not just tweak it",
          "standfirst": "Hoping to attract more enterprise teams to its ecosystem, Adobe launched a new model customization service called Adobe AI Foundry, which would create bespoke versions of its flagship AI model, Firefly.Adobe AI Foundry will work with enterprise customers to rearchitect and retrain Firefly models specific to the client. AI Foundry version models are different from custom Firefly models in that Foundry models understand multiple concepts compared to custom models with only a single concept. These models will also be multimodal, offering a wider use case than custom Firefly models, which can only ingest and respond with images. Adobe AI Foundry models, with Firefly at its base, will know a company’s brand tone, image and video style, products and services and all its IP. The models will generate content based on this information for any use case the company wants. Hannah Elsakr, vice president, GenAI New Business Ventures at Adobe, told VentureBeat that the idea to set up AI Foundry came because enterprise customers wanted more sophisticated custom versions of Firefly. But with how complex the needs of enterprises are, Adobe will be doing the rearchitecting rather than handing the reins over to customers. “We will retrain our own Firefly commercially safe models with the enterprise IP. We keep that IP separate. We never take that back into the base model, and the enterprise itself owns that output,” Elsakr said. Adobe will deploy the Foundry version of Firefly through its API solution, Firefly Services. Elsakr likened AI Foundry to an advisory service, since Adobe will have teams working directly with enterprise customers to retrain the model. Deep tuningElsakr refers to Foundry as a deep tuning method because it goes further than simply fine-tuning a model.“The way we think about it, maybe more layman&#x27;s terms, is that we&#x27;re surgically reopening the Firefly-based models,” Elsakr said. “So you get the benefit of all the world&#x27;s knowledge from our image model or a video model. We&#x27;re going back in time and are bringing in the IP from the enterprise, like a brand. It could be footage from a shot style, whatever they have a license to contribute. We then retrain. We call this continuous pre-training, where we overweigh the model to dial some things differently. So we&#x27;re literally retraining our base model, and that&#x27;s why we call it deep tuning instead of fine-tuning.”Part of the training pipeline involves Adobe’s embedded teams working with the company to identify the data they would need. Then the data is securely transferred and ingested before being tagged. It is fed to the base model, and then Adobe begins a pre-training model run. Elsakr maintains the Foundry versions of Firefly will not be small or distilled models. Often, the additional data from companies expands the parameters of Firefly.Two early customers of Adobe AI Foundry are Home Depot and Walt Disney Imagineering, the research and development arm of Disney for its theme parks. “We are always exploring innovative ways to enhance our customer experience and streamline our creative workflows. Adobe’s AI Foundry represents an exciting step forward in embracing cutting-edge technologies to deepen customer engagement and deliver impactful content across our digital channels,” said Molly Battin, senior vice president and chief marketing officer at The Home Depot.More customizationEnterprises often turn to fine-tuning and model customization to bring large language models with their vast external knowledge closer to their company’s needs. Fine-tuning also enables enterprise users to utilize models only in the context of their organization’s data, so the model doesn’t respond with text wholly unrelated to the business.Most organizations, however, do the fine-tuning themselves. They connect to the model’s API and begin retraining it to answer based on their ground truth or their preferences. Several methods for fine-tuning exist, including some that can be done with just a prompt. Other model providers also try to make it easier for their customers to fine-tune models, such as OpenAI with its o4-mini reasoning model. Elsakr said she expects some companies will have three versions of Firefly: the Foundry version for most projects, a custom Firefly for specific single-concept use cases, and the base Firefly because some teams want a model less encumbered by corporate knowledge.",
          "content": "Hoping to attract more enterprise teams to its ecosystem, Adobe launched a new model customization service called Adobe AI Foundry, which would create bespoke versions of its flagship AI model, Firefly.Adobe AI Foundry will work with enterprise customers to rearchitect and retrain Firefly models specific to the client. AI Foundry version models are different from custom Firefly models in that Foundry models understand multiple concepts compared to custom models with only a single concept. These models will also be multimodal, offering a wider use case than custom Firefly models, which can only ingest and respond with images. Adobe AI Foundry models, with Firefly at its base, will know a company’s brand tone, image and video style, products and services and all its IP. The models will generate content based on this information for any use case the company wants. Hannah Elsakr, vice president, GenAI New Business Ventures at Adobe, told VentureBeat that the idea to set up AI Foundry came because enterprise customers wanted more sophisticated custom versions of Firefly. But with how complex the needs of enterprises are, Adobe will be doing the rearchitecting rather than handing the reins over to customers. “We will retrain our own Firefly commercially safe models with the enterprise IP. We keep that IP separate. We never take that back into the base model, and the enterprise itself owns that output,” Elsakr said. Adobe will deploy the Foundry version of Firefly through its API solution, Firefly Services. Elsakr likened AI Foundry to an advisory service, since Adobe will have teams working directly with enterprise customers to retrain the model. Deep tuningElsakr refers to Foundry as a deep tuning method because it goes further than simply fine-tuning a model.“The way we think about it, maybe more layman&#x27;s terms, is that we&#x27;re surgically reopening the Firefly-based models,” Elsakr said. “So you get the benefit of all the world&#x27;s knowledge from our image model or a video model. We&#x27;re going back in time and are bringing in the IP from the enterprise, like a brand. It could be footage from a shot style, whatever they have a license to contribute. We then retrain. We call this continuous pre-training, where we overweigh the model to dial some things differently. So we&#x27;re literally retraining our base model, and that&#x27;s why we call it deep tuning instead of fine-tuning.”Part of the training pipeline involves Adobe’s embedded teams working with the company to identify the data they would need. Then the data is securely transferred and ingested before being tagged. It is fed to the base model, and then Adobe begins a pre-training model run. Elsakr maintains the Foundry versions of Firefly will not be small or distilled models. Often, the additional data from companies expands the parameters of Firefly.Two early customers of Adobe AI Foundry are Home Depot and Walt Disney Imagineering, the research and development arm of Disney for its theme parks. “We are always exploring innovative ways to enhance our customer experience and streamline our creative workflows. Adobe’s AI Foundry represents an exciting step forward in embracing cutting-edge technologies to deepen customer engagement and deliver impactful content across our digital channels,” said Molly Battin, senior vice president and chief marketing officer at The Home Depot.More customizationEnterprises often turn to fine-tuning and model customization to bring large language models with their vast external knowledge closer to their company’s needs. Fine-tuning also enables enterprise users to utilize models only in the context of their organization’s data, so the model doesn’t respond with text wholly unrelated to the business.Most organizations, however, do the fine-tuning themselves. They connect to the model’s API and begin retraining it to answer based on their ground truth or their preferences. Several methods for fine-tuning exist, including some that can be done with just a prompt. Other model providers also try to make it easier for their customers to fine-tune models, such as OpenAI with its o4-mini reasoning model. Elsakr said she expects some companies will have three versions of Firefly: the Foundry version for most projects, a custom Firefly for specific single-concept use cases, and the base Firefly because some teams want a model less encumbered by corporate knowledge.",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/1Hg97nt1wacQ4K8pE0NfX7/5dba45daa25b361ac777c18695b45898/crimedy7_illustration_of_a_sculptor_creating_a_robot_from_a_p_501bf165-0b44-4bb1-9608-1025a42400b7_2.png"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/headphones/beats-powerbeats-fit-review-deja-vu-in-a-good-way-120058332.html",
          "published_at": "Mon, 20 Oct 2025 12:00:58 +0000",
          "title": "Beats Powerbeats Fit review: Déjà vu, in a good way",
          "standfirst": "Beats devices have been the more colorful, full-of-personality complements to Apple’s clean-and-minimal gear ever since Apple bought the company back in 2014. Beats earbuds and speakers are the more flexible alternatives to things like AirPods and HomePods, and the new Beats Powerbeats Fit keep that tradition alive. Some six months after the Powerbeats Pro 2 debuted earlier this year, Beats now has an updated version of the Fit Pro to offer folks looking for many of the conveniences of an Apple device in something with slightly more character and versatility. Rather than reinventing the wheel, Beats made small changes on the Powerbeats Fit that ultimately make for a more polished version of its predecessor. What’s new If you’re familiar with the Beats Fit Pro, you’ll be familiar with the Powerbeats Fit. Beats kept much of what worked with its previous $200 earbuds here (including the price), making very minor changes to improve the comfort and the overall design. The new buds have 20 percent more flexible wingtips and the charging case is 17 percent more compact than that of the Beats Fit Pro. More on the wingtips in a moment, but first I have to commend Beats for making the charging case feel ever so slightly more premium this time around — and since it’s smaller than before, it’s less cumbersome to tuck in your back pocket. The buds also fit snugly into the charging case with a satisfying snap every time; they always align properly to recharge, something I cannot say about past pairs of the AirPods Pro I’ve owned. When it comes to the wingtips on the Powerbeats Fit, they appear to be a hair shorter than those on the Beats Fit Pro, and certainly more malleable. I felt the biggest difference in flexibility at the base of the wingtip where it meets the earbud — those on the Powerbeats Fit have a bit more give than those on its predecessor. These small changes make it easy to pop the Powerbeats Fit into your ears and really not fuss with the wingtips at all. They’re present just to provide a more secure fit during intense workouts, and they do just that. I wore them during strength training, 5K runs and leisurely walks and I didn’t have to adjust them at all once I popped them in. When Beats announced these new buds, the company claimed its design tweaks would also make the Powerbeats Fit more comfortable to wear all day long, not just during workouts. I’ll admit that I didn’t find the previous Beats Fit Pro uncomfortable to wear when not at the gym or on the trail. Yes, the Powerbeats Fit are marginally more comfortable now and the wingtips are more supple, but the change is subtle. If you jibe with the wingtip design to begin with, you’ll safely be able to use the Powerbeats Fit as daily drivers in addition to workout companions. Notably, the Powerbeats Fit come with one extra pair of eartips in the box (four instead of the previous three), so once you find the eartips that are your best fit, you’ll be off to the races. There are also two new bold colors to choose from, orange and pink, in addition to gray and black. Valentina Palladino for Engadget What’s the same Thankfully, Beats didn’t mess with all of the good things about the Fit Pro when developing the Powerbeats Fit. The new buds have an IPX4 water resistance rating, which isn’t the highest level of protection out there, but more than enough to withstand your sweatiest training sessions. Onboard controls in the form of physical buttons remain the same, although I didn’t accidentally trigger the buttons on the Powerbeats Fit nearly as much as I did with the Fit Pro. That might be because all the small changes Beats made in the design paid off — I didn’t fuss with the new buds in my ears as much as before, therefore I didn’t accidentally press the buttons as much. The Powerbeats Fit also have Apple’s H1 chip inside, which enables features like hands-free Siri, automatic switching between devices, Adaptive EQ, Audio Sharing and Personalized Spatial Audio with dynamic head tracking. Transparency mode returns here as well, and it remains one of the standout features of any Apple-associated wireless earbuds. And if you do decide to wear the Powerbeats Fit all day long, you’ll likely make even more use of transparency mode as you need to jump in and out of conversations happening around you. In addition, you can keep track of the new earbuds in Apple’s Find My app. Beats didn’t bill any improvements in sound quality on the Powerbeats Fit, and after listening to them alongside the Beats Fit Pro, I can say they sound almost identical. While listening to some tracks with the Powerbeats Fit, I noticed an almost imperceptible increase in the clarity of vocals, but that’s about it. Bass remains punchy and strong, and the buds get decently loud. Active noise cancellation (ANC) is also the same on the new buds: strong enough to block out ambient noise around you and people’s voices. While running outside, I still heard the loudest disturbances like passing trucks and oddly sonorous cackling of nearby wildlife, but that’s arguably for the best. If you’re exercising outside, be it in a park or on city streets, you should be at least somewhat aware of your surroundings. Valentina Palladino for Engadget Battery life is consistent here as well, with Beats promising up to seven hours on a single charge (or six with ANC turned on) and up to 30 hours total when employing the Powerbeats Fit charging case. Anecdotally, after a week of using the Powerbeats Fit for an average of one hour each day, the charging case still had 75 percent battery left. If you’re using these all day, every day, you’ll obviously need to power it up more frequently. But if these are primarily your workout companions, you could get a week or two before needing to plug them in. Wrap-up The Powerbeats Fit are a fitting update to the Beats Fit Pro. The latter was one of the best devices in the Beats lineup to begin with, and the latest model only improves upon the winning formula. They offer a solid balance of a comfortable, secure design, good sound quality and ANC and handy additional features at a decent price. The latter is arguably just as important as the buds’ ability to withstand a sweaty training session: folks looking for many of the conveniences found in AirPods will find them here in an alternative design, and in a pair of buds that also works just as well with Android devices. If you’re willing to pay more, you could shell out $250 for either the Powerbeats Pro 2 to get that full over-ear hook style, or AirPods Pro 3 — both of which have built-in heart rate tracking But that feature in particular will be more of a nice-to-have than a necessity for most.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/beats-powerbeats-fit-review-deja-vu-in-a-good-way-120058332.html?src=rss",
          "content": "Beats devices have been the more colorful, full-of-personality complements to Apple’s clean-and-minimal gear ever since Apple bought the company back in 2014. Beats earbuds and speakers are the more flexible alternatives to things like AirPods and HomePods, and the new Beats Powerbeats Fit keep that tradition alive. Some six months after the Powerbeats Pro 2 debuted earlier this year, Beats now has an updated version of the Fit Pro to offer folks looking for many of the conveniences of an Apple device in something with slightly more character and versatility. Rather than reinventing the wheel, Beats made small changes on the Powerbeats Fit that ultimately make for a more polished version of its predecessor. What’s new If you’re familiar with the Beats Fit Pro, you’ll be familiar with the Powerbeats Fit. Beats kept much of what worked with its previous $200 earbuds here (including the price), making very minor changes to improve the comfort and the overall design. The new buds have 20 percent more flexible wingtips and the charging case is 17 percent more compact than that of the Beats Fit Pro. More on the wingtips in a moment, but first I have to commend Beats for making the charging case feel ever so slightly more premium this time around — and since it’s smaller than before, it’s less cumbersome to tuck in your back pocket. The buds also fit snugly into the charging case with a satisfying snap every time; they always align properly to recharge, something I cannot say about past pairs of the AirPods Pro I’ve owned. When it comes to the wingtips on the Powerbeats Fit, they appear to be a hair shorter than those on the Beats Fit Pro, and certainly more malleable. I felt the biggest difference in flexibility at the base of the wingtip where it meets the earbud — those on the Powerbeats Fit have a bit more give than those on its predecessor. These small changes make it easy to pop the Powerbeats Fit into your ears and really not fuss with the wingtips at all. They’re present just to provide a more secure fit during intense workouts, and they do just that. I wore them during strength training, 5K runs and leisurely walks and I didn’t have to adjust them at all once I popped them in. When Beats announced these new buds, the company claimed its design tweaks would also make the Powerbeats Fit more comfortable to wear all day long, not just during workouts. I’ll admit that I didn’t find the previous Beats Fit Pro uncomfortable to wear when not at the gym or on the trail. Yes, the Powerbeats Fit are marginally more comfortable now and the wingtips are more supple, but the change is subtle. If you jibe with the wingtip design to begin with, you’ll safely be able to use the Powerbeats Fit as daily drivers in addition to workout companions. Notably, the Powerbeats Fit come with one extra pair of eartips in the box (four instead of the previous three), so once you find the eartips that are your best fit, you’ll be off to the races. There are also two new bold colors to choose from, orange and pink, in addition to gray and black. Valentina Palladino for Engadget What’s the same Thankfully, Beats didn’t mess with all of the good things about the Fit Pro when developing the Powerbeats Fit. The new buds have an IPX4 water resistance rating, which isn’t the highest level of protection out there, but more than enough to withstand your sweatiest training sessions. Onboard controls in the form of physical buttons remain the same, although I didn’t accidentally trigger the buttons on the Powerbeats Fit nearly as much as I did with the Fit Pro. That might be because all the small changes Beats made in the design paid off — I didn’t fuss with the new buds in my ears as much as before, therefore I didn’t accidentally press the buttons as much. The Powerbeats Fit also have Apple’s H1 chip inside, which enables features like hands-free Siri, automatic switching between devices, Adaptive EQ, Audio Sharing and Personalized Spatial Audio with dynamic head tracking. Transparency mode returns here as well, and it remains one of the standout features of any Apple-associated wireless earbuds. And if you do decide to wear the Powerbeats Fit all day long, you’ll likely make even more use of transparency mode as you need to jump in and out of conversations happening around you. In addition, you can keep track of the new earbuds in Apple’s Find My app. Beats didn’t bill any improvements in sound quality on the Powerbeats Fit, and after listening to them alongside the Beats Fit Pro, I can say they sound almost identical. While listening to some tracks with the Powerbeats Fit, I noticed an almost imperceptible increase in the clarity of vocals, but that’s about it. Bass remains punchy and strong, and the buds get decently loud. Active noise cancellation (ANC) is also the same on the new buds: strong enough to block out ambient noise around you and people’s voices. While running outside, I still heard the loudest disturbances like passing trucks and oddly sonorous cackling of nearby wildlife, but that’s arguably for the best. If you’re exercising outside, be it in a park or on city streets, you should be at least somewhat aware of your surroundings. Valentina Palladino for Engadget Battery life is consistent here as well, with Beats promising up to seven hours on a single charge (or six with ANC turned on) and up to 30 hours total when employing the Powerbeats Fit charging case. Anecdotally, after a week of using the Powerbeats Fit for an average of one hour each day, the charging case still had 75 percent battery left. If you’re using these all day, every day, you’ll obviously need to power it up more frequently. But if these are primarily your workout companions, you could get a week or two before needing to plug them in. Wrap-up The Powerbeats Fit are a fitting update to the Beats Fit Pro. The latter was one of the best devices in the Beats lineup to begin with, and the latest model only improves upon the winning formula. They offer a solid balance of a comfortable, secure design, good sound quality and ANC and handy additional features at a decent price. The latter is arguably just as important as the buds’ ability to withstand a sweaty training session: folks looking for many of the conveniences found in AirPods will find them here in an alternative design, and in a pair of buds that also works just as well with Android devices. If you’re willing to pay more, you could shell out $250 for either the Powerbeats Pro 2 to get that full over-ear hook style, or AirPods Pro 3 — both of which have built-in heart rate tracking But that feature in particular will be more of a nice-to-have than a necessity for most.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/beats-powerbeats-fit-review-deja-vu-in-a-good-way-120058332.html?src=rss",
          "feed_position": 16,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-10/7c269cf0-ab64-11f0-ac9b-105ce8eedd80"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/best-smartphones-140004900.html",
          "published_at": "Mon, 20 Oct 2025 09:01:27 +0000",
          "title": "The best smartphones to buy in 2025",
          "standfirst": "You might already have a good idea of which smartphone you want to be your next one. But there are more solid options available now than ever before, making the decision not as cut-and-dry as it used to be. While the decision is a bit easier if you know you want an iPhone, there's even enough variation between those new models that you may have to think about it longer than you anticipated. If you’re an Android person, you have even more options to choose from — including foldables — and more questions to answer before you spend any money.At Engadget, we review phones regularly and have tested dozens over the years. Whether you’ve had your eye on one of our current top picks, one of Samsung's Galaxy S25 phones, a cheap phone or another device, we’re here to help you decide which is the best phone to buy this year. Table of contents Best smartphones for 2025 Other smartphones we've tested What to look for in a smartphone Smartphone FAQs Recent updates Best smartphones for 2025 Other smartphones we've tested iPhone Air At just 5.6mm, the iPhone Air is the thinnest iPhone ever made. But it’s so much more than that. It’s beautifully crafted and thanks to a titanium frame, Ceramic Shield 2 screen and an IP68 rating for dust and water resistance, it’s surprisingly durable too. The Air also has a gorgeous 6.5-inch display with ProMotion support and an A19 Pro processor, so it delivers nearly the same performance as you get from the iPhone 17 Pro line. And despite its super thin chassis not leaving a ton of room for a big power cell, battery life isn’t an issue. In short, this is the iPhone design that everyone wants. However, with the Air only having a single rear camera, the question you need to answer is if you’re willing to give up some extra lenses to get the most exquisitely engineered iPhone and all of its style and sleekness. — S.R. Google Pixel 10 Pro Fold While the design and performance of the Galaxy Z Fold 7 is so good that we had to pick it as our favorite foldable of this generation, the Pixel 10 Pro Fold isn’t that far behind. Sure, it’s bigger and bulkier, but it still has the best cameras on any foldable phone along with better software and a larger battery. But perhaps most importantly, it now has a proper IP68 rating for dust and water resistance — something you won’t find on any of its rivals. This could save the phone from an early demise and prevent a lot of headaches if you frequent the beach or pretty much anywhere with little particles that could threaten the insides of your device. — S.R. OnePlus 13 While the OnePlus 13 features some basic AI features like Google’s Circle to Search and Gemini assistant, it’s really just an old-fashioned flagship in all the best ways. That’s because instead of focusing on machine learning, OnePlus crammed the phone with tons of top-notch hardware. It sports a 6.8-inch OLED display with an incredible peak brightness of up to 4,500 nits. The OP13 also offers excellent performance thanks to Qualcomm’s Snapdragon 8 Elite chip, along with 16GB of RAM and 512GB of storage. There are also three 50-MP rear cameras including one with a 3x telephoto zoom and a massive 6,000 mAh battery that’s bigger than what you get in practically all of its competitors. OnePlus didn’t skimp on the phone’s design either, as the OP13 still comes with the company’s signature Alert Slider. Plus, if you opt for the blue or white variants, you’ll get a durable and very touchable vegan leather back that helps the phone stand out among all its glass brick rivals. But the best part is that starting at $900, it costs less than an equivalent Galaxy S25+ too. What to look for in a smartphone Android or iOS? When you're searching for the best smartphone, it becomes clear that each OS has its pros and cons. Apple’s tight-knit ecosystem makes it super easy to share data between iPhones, iPads and Macs or seamlessly hand-off phone calls or music from one device to another. At the same time, you’re effectively locked in, as services like Apple Messages aren’t available on other platforms. As for Android, there’s a much wider range of handsets from companies like Google, Samsung, Sony and more. However, Android phones don’t enjoy that same length of software support and often have lower trade-in values. In short, there’s no wrong answer. However, you will want to consider how your phone will fit in with the rest of your devices. So unless you’re really fed up with one OS and willing to learn another, it probably doesn’t make a lot of sense to switch from an iPhone to an Android phone (or vice versa) – especially if everyone else in your household is using the same platform. Cameras Since your cell phone often pulls double duty as your primary camera, figuring out what kind of photo tools you want is key. Nowadays, practically every mobile phone can take a great picture in bright light. But if you want a long optical zoom, you’ll probably have to upgrade to a more expensive device. Mid-range phones often only have two rear cameras (a primary wide-angle lens and a secondary ultra-wide camera) and can sometimes struggle in low-light situations. Each phone maker also has various features that might be a better fit for your style, with Apple offering four different color presets on the latest iPhones, while Google’s Pixel 9 Pro comes with neat tools like dedicated long exposure and Action Pan modes. Will you get mmWave 5G or Wi-Fi 7? The good news is that in 2025, most phones have at least Wi-Fi 6 or Wi-Fi 6e and support for some kind of 5G connectivity. However, if you want the fastest wireless speeds possible, it’s going to cost you a little extra. For example, on certain networks, mmWave 5G offers up to gigabit download speeds, less latency and better bandwidth. But mmWave 5G also requires more sophisticated (and pricier) modems, which means support for it is often missing on less expensive devices. On the bright side, mmWave 5G isn’t as widely available as other versions of 5G, so depending on where you live and what network you’re on, you may not be missing out on much right now if you buy a phone that doesn’t support it. It’s a similar situation for Wi-Fi 7, which is available on some high-end handsets like the Galaxy S25, but harder to find on cheaper devices. Wi-Fi 7 also requires you to have a compatible router, so unless you know you need it or have a specific use case in mind, the lack of support for mmWave 5G or Wi-Fi 7 shouldn’t be a dealbreaker when looking for a new phone. Other features to consider Because not everyone agrees on what makes the best phone, you should think about any other specs that might be extra important for you. Mobile gamers will almost certainly appreciate the 120Hz refresh rates you get on phones like the Samsung Galaxy S25 or the Apple iPhone 17 Pro. Alternatively, if long battery life is important, you’ll probably want to go with a larger iPhone or an Android phone with a battery that’s between 4,000 and 5,000 mAh in size. Meanwhile, if you find yourself juggling a lot of devices, it can be really nice to have a phone that supports reverse wireless charging, which on Samsung phones even lets you recharge the company’s Galaxy Watches. Smartphone FAQs How do I know which smartphone is the best for me? While choosing the best smartphone can be challenging, it mostly comes down to how you plan on using the device. All of the best phones available now get the basics right — you’ll be able to make calls, text and access the internet without many hiccups. If your smartphone is your most used gadget, you may want to consider paying for a device on the higher end of the price spectrum. That will get you better overall performance, higher-quality cameras and a phone that will last for many years. If you don’t use your phone for everything, you may be able to compromise on performance and extra perks and spend less on a still-capable handset. How much is a smartphone? Smartphones range in price from $300 to over $1,500. The best budget phones available now will usually compromise on overall performance, design, camera prowess and extra features to keep costs down. On the flip side, the most expensive phones will have powerful processors, triple-camera arrays and even flip or fold designs. Most people will find a phone that fits their needs somewhere in the middle of that wide price range — we’ve found that most of the best smartphones available right now cost between $500 and $1,000. What can you do on a smartphone? Smartphones are essentially small, portable computers that let you do things like check email, browse social media, follow map directions, make contactless payments and more. This is all on top of the basics like making phone calls and texting, which we’ve come to expect in all modern cell phones. Smartphones have also mostly replaced compact cameras thanks to their high-quality, built-in shooters, and the fact that most smartphones today as just as portable, if not more so, as compact cameras. How long do smartphones last? Smartphones can last years and people are holding on to their phones longer now than ever before. Software updates and battery life are two of the biggest factors that can affect phone longevity. Apple promises five years worth of software updates for its latest iPhones, and Google promises the same for its Pixel phones. Samsung phones will get four years worth of Android updates from the time they launch. As for charging speeds and battery life, your phone can deteriorate over time as you use and recharge your phone on a regular basis. Recent updates September 2025: Updated to include the iPhone 17 Pro. August 2025: Updated to include the Google Pixel 10 Pro. July 2025: Updated to include the Samsung Galaxy Z Fold 7. April 2025: Updated to include the Google Pixel 9a. February 2025: Updated to include the iPhone 16e. January 2025: Updated to include details about Samsung's latest Galaxy S-series phones.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/best-smartphones-140004900.html?src=rss",
          "content": "You might already have a good idea of which smartphone you want to be your next one. But there are more solid options available now than ever before, making the decision not as cut-and-dry as it used to be. While the decision is a bit easier if you know you want an iPhone, there's even enough variation between those new models that you may have to think about it longer than you anticipated. If you’re an Android person, you have even more options to choose from — including foldables — and more questions to answer before you spend any money.At Engadget, we review phones regularly and have tested dozens over the years. Whether you’ve had your eye on one of our current top picks, one of Samsung's Galaxy S25 phones, a cheap phone or another device, we’re here to help you decide which is the best phone to buy this year. Table of contents Best smartphones for 2025 Other smartphones we've tested What to look for in a smartphone Smartphone FAQs Recent updates Best smartphones for 2025 Other smartphones we've tested iPhone Air At just 5.6mm, the iPhone Air is the thinnest iPhone ever made. But it’s so much more than that. It’s beautifully crafted and thanks to a titanium frame, Ceramic Shield 2 screen and an IP68 rating for dust and water resistance, it’s surprisingly durable too. The Air also has a gorgeous 6.5-inch display with ProMotion support and an A19 Pro processor, so it delivers nearly the same performance as you get from the iPhone 17 Pro line. And despite its super thin chassis not leaving a ton of room for a big power cell, battery life isn’t an issue. In short, this is the iPhone design that everyone wants. However, with the Air only having a single rear camera, the question you need to answer is if you’re willing to give up some extra lenses to get the most exquisitely engineered iPhone and all of its style and sleekness. — S.R. Google Pixel 10 Pro Fold While the design and performance of the Galaxy Z Fold 7 is so good that we had to pick it as our favorite foldable of this generation, the Pixel 10 Pro Fold isn’t that far behind. Sure, it’s bigger and bulkier, but it still has the best cameras on any foldable phone along with better software and a larger battery. But perhaps most importantly, it now has a proper IP68 rating for dust and water resistance — something you won’t find on any of its rivals. This could save the phone from an early demise and prevent a lot of headaches if you frequent the beach or pretty much anywhere with little particles that could threaten the insides of your device. — S.R. OnePlus 13 While the OnePlus 13 features some basic AI features like Google’s Circle to Search and Gemini assistant, it’s really just an old-fashioned flagship in all the best ways. That’s because instead of focusing on machine learning, OnePlus crammed the phone with tons of top-notch hardware. It sports a 6.8-inch OLED display with an incredible peak brightness of up to 4,500 nits. The OP13 also offers excellent performance thanks to Qualcomm’s Snapdragon 8 Elite chip, along with 16GB of RAM and 512GB of storage. There are also three 50-MP rear cameras including one with a 3x telephoto zoom and a massive 6,000 mAh battery that’s bigger than what you get in practically all of its competitors. OnePlus didn’t skimp on the phone’s design either, as the OP13 still comes with the company’s signature Alert Slider. Plus, if you opt for the blue or white variants, you’ll get a durable and very touchable vegan leather back that helps the phone stand out among all its glass brick rivals. But the best part is that starting at $900, it costs less than an equivalent Galaxy S25+ too. What to look for in a smartphone Android or iOS? When you're searching for the best smartphone, it becomes clear that each OS has its pros and cons. Apple’s tight-knit ecosystem makes it super easy to share data between iPhones, iPads and Macs or seamlessly hand-off phone calls or music from one device to another. At the same time, you’re effectively locked in, as services like Apple Messages aren’t available on other platforms. As for Android, there’s a much wider range of handsets from companies like Google, Samsung, Sony and more. However, Android phones don’t enjoy that same length of software support and often have lower trade-in values. In short, there’s no wrong answer. However, you will want to consider how your phone will fit in with the rest of your devices. So unless you’re really fed up with one OS and willing to learn another, it probably doesn’t make a lot of sense to switch from an iPhone to an Android phone (or vice versa) – especially if everyone else in your household is using the same platform. Cameras Since your cell phone often pulls double duty as your primary camera, figuring out what kind of photo tools you want is key. Nowadays, practically every mobile phone can take a great picture in bright light. But if you want a long optical zoom, you’ll probably have to upgrade to a more expensive device. Mid-range phones often only have two rear cameras (a primary wide-angle lens and a secondary ultra-wide camera) and can sometimes struggle in low-light situations. Each phone maker also has various features that might be a better fit for your style, with Apple offering four different color presets on the latest iPhones, while Google’s Pixel 9 Pro comes with neat tools like dedicated long exposure and Action Pan modes. Will you get mmWave 5G or Wi-Fi 7? The good news is that in 2025, most phones have at least Wi-Fi 6 or Wi-Fi 6e and support for some kind of 5G connectivity. However, if you want the fastest wireless speeds possible, it’s going to cost you a little extra. For example, on certain networks, mmWave 5G offers up to gigabit download speeds, less latency and better bandwidth. But mmWave 5G also requires more sophisticated (and pricier) modems, which means support for it is often missing on less expensive devices. On the bright side, mmWave 5G isn’t as widely available as other versions of 5G, so depending on where you live and what network you’re on, you may not be missing out on much right now if you buy a phone that doesn’t support it. It’s a similar situation for Wi-Fi 7, which is available on some high-end handsets like the Galaxy S25, but harder to find on cheaper devices. Wi-Fi 7 also requires you to have a compatible router, so unless you know you need it or have a specific use case in mind, the lack of support for mmWave 5G or Wi-Fi 7 shouldn’t be a dealbreaker when looking for a new phone. Other features to consider Because not everyone agrees on what makes the best phone, you should think about any other specs that might be extra important for you. Mobile gamers will almost certainly appreciate the 120Hz refresh rates you get on phones like the Samsung Galaxy S25 or the Apple iPhone 17 Pro. Alternatively, if long battery life is important, you’ll probably want to go with a larger iPhone or an Android phone with a battery that’s between 4,000 and 5,000 mAh in size. Meanwhile, if you find yourself juggling a lot of devices, it can be really nice to have a phone that supports reverse wireless charging, which on Samsung phones even lets you recharge the company’s Galaxy Watches. Smartphone FAQs How do I know which smartphone is the best for me? While choosing the best smartphone can be challenging, it mostly comes down to how you plan on using the device. All of the best phones available now get the basics right — you’ll be able to make calls, text and access the internet without many hiccups. If your smartphone is your most used gadget, you may want to consider paying for a device on the higher end of the price spectrum. That will get you better overall performance, higher-quality cameras and a phone that will last for many years. If you don’t use your phone for everything, you may be able to compromise on performance and extra perks and spend less on a still-capable handset. How much is a smartphone? Smartphones range in price from $300 to over $1,500. The best budget phones available now will usually compromise on overall performance, design, camera prowess and extra features to keep costs down. On the flip side, the most expensive phones will have powerful processors, triple-camera arrays and even flip or fold designs. Most people will find a phone that fits their needs somewhere in the middle of that wide price range — we’ve found that most of the best smartphones available right now cost between $500 and $1,000. What can you do on a smartphone? Smartphones are essentially small, portable computers that let you do things like check email, browse social media, follow map directions, make contactless payments and more. This is all on top of the basics like making phone calls and texting, which we’ve come to expect in all modern cell phones. Smartphones have also mostly replaced compact cameras thanks to their high-quality, built-in shooters, and the fact that most smartphones today as just as portable, if not more so, as compact cameras. How long do smartphones last? Smartphones can last years and people are holding on to their phones longer now than ever before. Software updates and battery life are two of the biggest factors that can affect phone longevity. Apple promises five years worth of software updates for its latest iPhones, and Google promises the same for its Pixel phones. Samsung phones will get four years worth of Android updates from the time they launch. As for charging speeds and battery life, your phone can deteriorate over time as you use and recharge your phone on a regular basis. Recent updates September 2025: Updated to include the iPhone 17 Pro. August 2025: Updated to include the Google Pixel 10 Pro. July 2025: Updated to include the Samsung Galaxy Z Fold 7. April 2025: Updated to include the Google Pixel 9a. February 2025: Updated to include the iPhone 16e. January 2025: Updated to include details about Samsung's latest Galaxy S-series phones.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/best-smartphones-140004900.html?src=rss",
          "feed_position": 18,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2021-10/91a42bf0-305d-11ec-9f9f-636d29742095"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/security/agentic-ai-security-breaches-are-coming-7-ways-to-make-sure-its-not-your",
          "published_at": "Mon, 20 Oct 2025 07:00:00 GMT",
          "title": "Agentic AI security breaches are coming: 7 ways to make sure it's not your firm",
          "standfirst": "AI agents – task-specific models designed to operate autonomously or semi-autonomously given instructions — are being widely implemented across enterprises (up to 79% of all surveyed for a PwC report earlier this year). But they&#x27;re also introducing new security risks. When an agentic AI security breach happens, companies may be quick to fire employees and assign blame, but slower to identify and fix the systemic failures that enabled it.Forrester’s Predictions 2026: Cybersecurity and Risk predicts that the first agentic AI breach will lead to dismissals, adding that geopolitical turmoil and the pressure being put on CISOs and CIOs to deploy agentic AI quickly, while minimizing the risks.CISOs are in for a challenging 2026Those in organizations who compete globally are in for an especially tough next twelve months as governments move to more tightly regulate and outright control critical communication infrastructure. Forrester also predicts the EU will establish its own known exploited vulnerability database, which translates into immediate demand for regionalized security pros that CISOs will also need to find, recruit, and hire fast if this prediction happens.Forrester also predicts that quantum‑security spending will exceed 5% of overall IT security budgets, a plausible outcome given researchers’ steady progress toward quantum‑resistant cryptography and enterprises’ urgency to pre‑empt the ‘harvest now, decrypt later’ threat.”Of the five major challenges CISOs will face in 2026, none is more lethal and has the potential to completely reorder the threat landscape as agentic AI breaches and the next generation of weaponized AI.How CISOs are tacking agentic AI threats head-on “The adoption of agentic AI introduces entirely new security threats that bypass traditional controls. These risks span data exfiltration, autonomous misuse of APIs, and covert cross-agent collusion, all of which could disrupt enterprise operations or violate regulatory mandates,” Jerry R. Geisler III, Executive Vice President and Chief Information Security Officer at Walmart Inc., told VentureBeat in a recent interview.Geisler continued, articulating Walmart’s direction. “Our strategy is to build robust, proactive security controls using advanced AI Security Posture Management (AI-SPM), ensuring continuous risk monitoring, data protection, regulatory compliance and operational trust.”Implicit in agentic AI are the risks of what happens when agents don’t get along, compete for resources, or worse, lack the basic architecture to ensure minimum viable security (MVS). Forrester defines MVS as an approach to integrate security , writing that “in early-stage concept testing, without slowing down the product team. As the product evolves from early-stage concept testing to an alpha release to a beta release and onward, MVS security activities also evolve, until it is time to leave MVS behind.”Sam Evans, CISO of Clearwater Analytics provided insights into how he addressed the challenge in a recent VentureBeat interview. “I remember when one of the first board meetings I was in, they asked me, \"So what are your thoughts on ChatGPT?\" I said, \"Well, it&#x27;s an incredible productivity tool. However, I don&#x27;t know how we could let our employees use it, because my biggest fear is somebody copies and pastes customer data into it, or our source code, which is our intellectual property.\"Evans’ company manages $8.8 trillion in assets. \"The worst possible thing would be one of our employees taking customer data and putting it into an AI engine that we don&#x27;t manage,\" Evans told VentureBeat. \"The employee not knowing any different or trying to solve a problem for a customer...that data helps train the model.\"Evans elaborated, “But I didn&#x27;t just come to the board with my concerns and problems. I said, &#x27;Well, here&#x27;s my solution. I don&#x27;t want to stop people from being productive, but I also want to protect it.&#x27; When I came to the board and explained how these enterprise browsers work, they&#x27;re like, &#x27;Okay, that makes much sense, but can you really do it?&#x27; Following the board meeting, Evans and his team began an in-depth and comprehensive due diligence process that resulted in Clearwater choosing Island.Boardrooms are handing CISOs a clear, urgent mandate: secure the latest wave of AI and agentic‑AI apps, tools and platforms so organizations can unlock productivity gains immediately without sacrificing security or slowing innovation.The velocity of agent deployments across enterprises has pushed the pressure to deliver value at breakneck speed higher than it’s ever been. As George Kurtz, CEO and founder of CrowdStrike, said in a recent interview: “The speed of today’s cyberattacks requires security teams to rapidly analyze massive amounts of data to detect, investigate, and respond faster. Adversaries are setting records, with breakout times of just over two minutes, leaving no room for delay.”Productivity and security are no longer separate lanes; they’re the same road. Move fast or the competition and the adversaries will move past you is the message boards are delivering to CISOs today.Walmart’s CISO keeps the intensity up on innovation Geisler puts a high priority on keeping a continual pipeline of innovative new ideas flowing at Walmart.“An environment of our size requires a tailor-made approach, and interestingly enough, a startup mindset. Our team often takes a step back and asks, \"If we were a new company and building from ground zero, what would we build?\" Geisler continued, “Identity & access management (IAM) has gone through many iterations over the past 30+ years, and our main focus is on how to modernize our IAM stack to simplify it. While related to yet different from Zero Trust, our principle of least privilege won&#x27;t change.”Walmart has turned innovation into a practical, pragmatic strategy for continually hardening its defenses while reducing risk, all while making major contributions to the growth of the business. Having created a process that can do this at scale in an agentic AI era is one of the many ways cybersecurity delivers business value to the company.VentureBeat continues to see companies, including Clearwater Analytics, Walmart, and many others, putting cyberdefenses in place to counter agentic AI cyberattacks. Of the many interviews we’ve had with CISOs and enterprise security teams, seven battle-tested ways emerge of how enterprises are securing themselves against potential agentic AI attacks.Seven ways CISOs are securing their firms nowFrom in-depth conversations with CISOs and security leaders, seven proven strategies emerge for protecting enterprises against imminent agentic AI threats:1. Visibility is the first line of defense. “The rising use of multi‑agent systems will introduce new attack vectors and vulnerabilities that could be exploited if they aren’t secured properly from the start,” Nicole Carignan, VP Strategic Cyber AI at Darktrace, told VentureBeat earlier this year. An accurate, real‑time inventory that identifies every deployed system, tracks decision and system interdependencies to the agentic level, while also mapping unintended interactions at the agentic level, is now foundational to enterprise resilience.2. Reinforce API security now and develop muscle memory organizationally to keep them secure. Security and risk management professionals from financial services, retail and banking who spoke with VentureBeat on condition of anonymity emphasized the importance of continuously monitoring risk at API layers, stating their strategy is to leverage advanced AI Security Posture Management (AI-SPM) to maintain visibility, enforce regulatory compliance, and operational trust across complex environment. APIs represent the front lines of agentic risk, and strengthening their security transforms them from integration points into strategic enforcement layers.3. Manage autonomous identities as a strategic priority. “Identity is now the control plane for AI security. When an AI agent suddenly accesses systems outside its established pattern, we treat it identically to a compromised employee credential,” said Adam Meyers, Head of Counter‑Adversary Operations at CrowdStrike during a recent interview with VentureBeat. In the era of agentic AI, the traditional IAM playbook is obsolete. Enterprises must deploy IAM frameworks that scale to millions of dynamic identities, enforce least‑privilege continuously, integrate behavioral analytics for machines and humans alike, and revoke access in real time. Only by elevating identity management from an operational cost center to a strategic control plane will organizations tame the velocity, complexity and risk of autonomous systems.4. Upgrade to real-time observability for rapid threat detection. Static logging belongs to another era of cybersecurity. In an agentic environment, observability must evolve into a live, continuously streaming intelligence layer that captures the full scope of system behavior. The enterprises that fuse telemetry, analytics, and automated response into a single, adaptive feedback loop capable of spotting and containing anomalies in seconds rather than hours stand the best chance of thwarting an agentic AI attack.5. Embed proactive oversight to balance innovation with control. No enterprise ever excelled against its growth targets by ignoring the guardrails of the latest technologies they were using to get there. For agentic AI that’s core to the future of getting the most value possible out of this technology. CISOs who lead effectively in this new landscape ensure human-in-the-middle workflows are designed in from the beginning. Oversight at the human level also helps create clear decision points that surface issues early before they spiral. The result? Innovation can run at full throttle, knowing proactive oversight will tap the brakes just enough to keep the enterprise safely on track.6. Make governance adaptive to match AI’s rapid deployment. Static, inflexible governance might as well be yesterday’s newspaper because outdated the moment it&#x27;s printed. In an agentic world moving at machine-speed, compliance policies must adapt continuously, embedded in real-time operational workflows rather than stored on dusty shelves. The CISOs making the most impact understand governance isn&#x27;t just paperwork; it’s code, it’s culture, it’s integrated directly into the heartbeat of the enterprise to keep pace with every new deployment.7. Engineer incident response ahead of machine-speed threats. The worst time to plan your incident response? When your Active Directory and other core systems have been compromised by an agentic AI breach. Forward-thinking CISOs build, test, and refine their response playbooks before agentic threats hit, integrating automated processes that respond at the speed of attacks themselves. Incident readiness isn’t a fire drill; it needs to be muscle memory or an always-on discipline, woven into the enterprise’s operational fabric to make sure when threats inevitably arrive, the team is calm, coordinated, and already one step ahead.Agentic AI is reordering the threat landscape in real-time right nowAs Forrester predicts, the first major agentic breach won’t just claim jobs; it’ll expose every organization that chose inertia over initiative, shining a harsh spotlight on overlooked gaps in governance, API security, identity management, and real-time observability. Meanwhile, quantum threats are driving budget allocations higher, forcing security leaders to act urgently before their defenses become obsolete overnight.The CISOs who win this race are already mapping their systems in real-time, embedding governance into their operational core, and weaving proactive incident responses into the fabric of their daily operations. Enterprises that embrace this proactive stance will turn risk management into a strategic advantage, staying steps ahead of both competitors and adversaries.",
          "content": "AI agents – task-specific models designed to operate autonomously or semi-autonomously given instructions — are being widely implemented across enterprises (up to 79% of all surveyed for a PwC report earlier this year). But they&#x27;re also introducing new security risks. When an agentic AI security breach happens, companies may be quick to fire employees and assign blame, but slower to identify and fix the systemic failures that enabled it.Forrester’s Predictions 2026: Cybersecurity and Risk predicts that the first agentic AI breach will lead to dismissals, adding that geopolitical turmoil and the pressure being put on CISOs and CIOs to deploy agentic AI quickly, while minimizing the risks.CISOs are in for a challenging 2026Those in organizations who compete globally are in for an especially tough next twelve months as governments move to more tightly regulate and outright control critical communication infrastructure. Forrester also predicts the EU will establish its own known exploited vulnerability database, which translates into immediate demand for regionalized security pros that CISOs will also need to find, recruit, and hire fast if this prediction happens.Forrester also predicts that quantum‑security spending will exceed 5% of overall IT security budgets, a plausible outcome given researchers’ steady progress toward quantum‑resistant cryptography and enterprises’ urgency to pre‑empt the ‘harvest now, decrypt later’ threat.”Of the five major challenges CISOs will face in 2026, none is more lethal and has the potential to completely reorder the threat landscape as agentic AI breaches and the next generation of weaponized AI.How CISOs are tacking agentic AI threats head-on “The adoption of agentic AI introduces entirely new security threats that bypass traditional controls. These risks span data exfiltration, autonomous misuse of APIs, and covert cross-agent collusion, all of which could disrupt enterprise operations or violate regulatory mandates,” Jerry R. Geisler III, Executive Vice President and Chief Information Security Officer at Walmart Inc., told VentureBeat in a recent interview.Geisler continued, articulating Walmart’s direction. “Our strategy is to build robust, proactive security controls using advanced AI Security Posture Management (AI-SPM), ensuring continuous risk monitoring, data protection, regulatory compliance and operational trust.”Implicit in agentic AI are the risks of what happens when agents don’t get along, compete for resources, or worse, lack the basic architecture to ensure minimum viable security (MVS). Forrester defines MVS as an approach to integrate security , writing that “in early-stage concept testing, without slowing down the product team. As the product evolves from early-stage concept testing to an alpha release to a beta release and onward, MVS security activities also evolve, until it is time to leave MVS behind.”Sam Evans, CISO of Clearwater Analytics provided insights into how he addressed the challenge in a recent VentureBeat interview. “I remember when one of the first board meetings I was in, they asked me, \"So what are your thoughts on ChatGPT?\" I said, \"Well, it&#x27;s an incredible productivity tool. However, I don&#x27;t know how we could let our employees use it, because my biggest fear is somebody copies and pastes customer data into it, or our source code, which is our intellectual property.\"Evans’ company manages $8.8 trillion in assets. \"The worst possible thing would be one of our employees taking customer data and putting it into an AI engine that we don&#x27;t manage,\" Evans told VentureBeat. \"The employee not knowing any different or trying to solve a problem for a customer...that data helps train the model.\"Evans elaborated, “But I didn&#x27;t just come to the board with my concerns and problems. I said, &#x27;Well, here&#x27;s my solution. I don&#x27;t want to stop people from being productive, but I also want to protect it.&#x27; When I came to the board and explained how these enterprise browsers work, they&#x27;re like, &#x27;Okay, that makes much sense, but can you really do it?&#x27; Following the board meeting, Evans and his team began an in-depth and comprehensive due diligence process that resulted in Clearwater choosing Island.Boardrooms are handing CISOs a clear, urgent mandate: secure the latest wave of AI and agentic‑AI apps, tools and platforms so organizations can unlock productivity gains immediately without sacrificing security or slowing innovation.The velocity of agent deployments across enterprises has pushed the pressure to deliver value at breakneck speed higher than it’s ever been. As George Kurtz, CEO and founder of CrowdStrike, said in a recent interview: “The speed of today’s cyberattacks requires security teams to rapidly analyze massive amounts of data to detect, investigate, and respond faster. Adversaries are setting records, with breakout times of just over two minutes, leaving no room for delay.”Productivity and security are no longer separate lanes; they’re the same road. Move fast or the competition and the adversaries will move past you is the message boards are delivering to CISOs today.Walmart’s CISO keeps the intensity up on innovation Geisler puts a high priority on keeping a continual pipeline of innovative new ideas flowing at Walmart.“An environment of our size requires a tailor-made approach, and interestingly enough, a startup mindset. Our team often takes a step back and asks, \"If we were a new company and building from ground zero, what would we build?\" Geisler continued, “Identity & access management (IAM) has gone through many iterations over the past 30+ years, and our main focus is on how to modernize our IAM stack to simplify it. While related to yet different from Zero Trust, our principle of least privilege won&#x27;t change.”Walmart has turned innovation into a practical, pragmatic strategy for continually hardening its defenses while reducing risk, all while making major contributions to the growth of the business. Having created a process that can do this at scale in an agentic AI era is one of the many ways cybersecurity delivers business value to the company.VentureBeat continues to see companies, including Clearwater Analytics, Walmart, and many others, putting cyberdefenses in place to counter agentic AI cyberattacks. Of the many interviews we’ve had with CISOs and enterprise security teams, seven battle-tested ways emerge of how enterprises are securing themselves against potential agentic AI attacks.Seven ways CISOs are securing their firms nowFrom in-depth conversations with CISOs and security leaders, seven proven strategies emerge for protecting enterprises against imminent agentic AI threats:1. Visibility is the first line of defense. “The rising use of multi‑agent systems will introduce new attack vectors and vulnerabilities that could be exploited if they aren’t secured properly from the start,” Nicole Carignan, VP Strategic Cyber AI at Darktrace, told VentureBeat earlier this year. An accurate, real‑time inventory that identifies every deployed system, tracks decision and system interdependencies to the agentic level, while also mapping unintended interactions at the agentic level, is now foundational to enterprise resilience.2. Reinforce API security now and develop muscle memory organizationally to keep them secure. Security and risk management professionals from financial services, retail and banking who spoke with VentureBeat on condition of anonymity emphasized the importance of continuously monitoring risk at API layers, stating their strategy is to leverage advanced AI Security Posture Management (AI-SPM) to maintain visibility, enforce regulatory compliance, and operational trust across complex environment. APIs represent the front lines of agentic risk, and strengthening their security transforms them from integration points into strategic enforcement layers.3. Manage autonomous identities as a strategic priority. “Identity is now the control plane for AI security. When an AI agent suddenly accesses systems outside its established pattern, we treat it identically to a compromised employee credential,” said Adam Meyers, Head of Counter‑Adversary Operations at CrowdStrike during a recent interview with VentureBeat. In the era of agentic AI, the traditional IAM playbook is obsolete. Enterprises must deploy IAM frameworks that scale to millions of dynamic identities, enforce least‑privilege continuously, integrate behavioral analytics for machines and humans alike, and revoke access in real time. Only by elevating identity management from an operational cost center to a strategic control plane will organizations tame the velocity, complexity and risk of autonomous systems.4. Upgrade to real-time observability for rapid threat detection. Static logging belongs to another era of cybersecurity. In an agentic environment, observability must evolve into a live, continuously streaming intelligence layer that captures the full scope of system behavior. The enterprises that fuse telemetry, analytics, and automated response into a single, adaptive feedback loop capable of spotting and containing anomalies in seconds rather than hours stand the best chance of thwarting an agentic AI attack.5. Embed proactive oversight to balance innovation with control. No enterprise ever excelled against its growth targets by ignoring the guardrails of the latest technologies they were using to get there. For agentic AI that’s core to the future of getting the most value possible out of this technology. CISOs who lead effectively in this new landscape ensure human-in-the-middle workflows are designed in from the beginning. Oversight at the human level also helps create clear decision points that surface issues early before they spiral. The result? Innovation can run at full throttle, knowing proactive oversight will tap the brakes just enough to keep the enterprise safely on track.6. Make governance adaptive to match AI’s rapid deployment. Static, inflexible governance might as well be yesterday’s newspaper because outdated the moment it&#x27;s printed. In an agentic world moving at machine-speed, compliance policies must adapt continuously, embedded in real-time operational workflows rather than stored on dusty shelves. The CISOs making the most impact understand governance isn&#x27;t just paperwork; it’s code, it’s culture, it’s integrated directly into the heartbeat of the enterprise to keep pace with every new deployment.7. Engineer incident response ahead of machine-speed threats. The worst time to plan your incident response? When your Active Directory and other core systems have been compromised by an agentic AI breach. Forward-thinking CISOs build, test, and refine their response playbooks before agentic threats hit, integrating automated processes that respond at the speed of attacks themselves. Incident readiness isn’t a fire drill; it needs to be muscle memory or an always-on discipline, woven into the enterprise’s operational fabric to make sure when threats inevitably arrive, the team is calm, coordinated, and already one step ahead.Agentic AI is reordering the threat landscape in real-time right nowAs Forrester predicts, the first major agentic breach won’t just claim jobs; it’ll expose every organization that chose inertia over initiative, shining a harsh spotlight on overlooked gaps in governance, API security, identity management, and real-time observability. Meanwhile, quantum threats are driving budget allocations higher, forcing security leaders to act urgently before their defenses become obsolete overnight.The CISOs who win this race are already mapping their systems in real-time, embedding governance into their operational core, and weaving proactive incident responses into the fabric of their daily operations. Enterprises that embrace this proactive stance will turn risk management into a strategic advantage, staying steps ahead of both competitors and adversaries.",
          "feed_position": 2,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/3M3EB5A9yedEhijwMzlWx/34de6f2a40e9dc37698cfdb59c1b9840/HERO_FOR_THE_FORRESTER_ARTICLE.png"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/engadget-review-recap-new-pixel-devices-meta-ray-ban-display-asus-rog-xbox-ally-x-and-more-130000215.html",
          "published_at": "Sun, 19 Oct 2025 13:00:00 +0000",
          "title": "Engadget review recap: New Pixel devices, Meta Ray-Ban Display, ASUS ROG Xbox Ally X and more",
          "standfirst": "Techtober is a busy time for our reviews team as a deluge of new devices arrive before the holiday season. We’ve been hard at work conducting our in-depth testing, but it’s understandable if you missed a review or two over the last few weeks. Read on to catch up all the reviews you might’ve missed, including the latest trio of Google Pixel devices. Google Pixel 10 Pro Fold, Pixel Watch 4 and Pixel Buds 2a Earlier this month, a trio of new Pixel devices arrived for us to put through their paces. The Pixel 10 Pro Fold headlines the group, but the Pixel Watch 4 and Pixel Buds 2a are also highly capable devices in their own categories. Senior reviews writer Sam Rutherford wrote that Google has removed one of the last remaining issues with foldable phones: durability. “The addition of proper dust and water resistance on the Pixel 10 Pro Fold has removed one of the last two shortcomings of modern foldables, which is no mean feat,” he said. However, at $1,799, the price barrier is still hard to overcome for most folks.” Meta Ray-Ban Display The second-gen Meta Ray-Ban smart glasses may be the best option for most people right now, but the Meta Ray-Ban Display is the more exciting product for many. If you can get past the chunky look and in-progress features, you still have to contend with limited availability and a $800 price tag. “The Meta Ray-Ban Display glasses, on the other hand, still look very much like a first-gen product,” senior reporter Karissa Bell wrote. “There are some really compelling use cases for the display, but its functionality is limited.” ASUS ROG Xbox Ally X Microsoft’s collaboration with ASUS has produced a compelling gaming handheld that’s decidedly Xbox. The combination of familiar controls and a full-screen Xbox experience give this device an advantage over its Windows-based competition. “While Microsoft’s first real foray into PC gaming handhelds isn’t upending the status quo and it’s way too early to say if this gadget will save Xbox as a whole, it is bringing some notable advancements,” Sam said. “The new full-screen experience makes launching and playing games on Windows-based devices so much more seamless that it’s kind of wild it took so long to get here.” Bose QuietComfort Headphones (2nd gen) Bose never leave the top few spots on our best noise canceling headphones list, but its refresh of the QC Ultra Headphones put the company firmly back in first place. Updates to active noise cancellation, sound performance, battery life and power management are enough to recommend this model over the previous version and the Sony WH-1000XM6. “Similar to the second-gen QC Ultra Earbuds over the summer, Bose didn’t make huge upgrades for the updated version of the QC Ultra Headphones,” I explained. “But what you do get here is a decent improvement over its predecessor.” Razer Blade 18 (2025) Razer’s massive 18-inch gaming laptop has impressive performance, but it’s size and limited battery life don’t offer a lot of convenience. “Personally, if I had to choose between Razer’s current lineup, I’d go with the Blade 16 so that I could actually carry it around and occasionally use it as a productivity machine,” senior reviews editor Devindra Hardawar wrote. “Not so with the Blade 18 — its short two hour and 17 minute battery life (in PCMark 10’s battery benchmark) means you’ll always need to lug around its beefy power adapter.”This article originally appeared on Engadget at https://www.engadget.com/engadget-review-recap-new-pixel-devices-meta-ray-ban-display-asus-rog-xbox-ally-x-and-more-130000215.html?src=rss",
          "content": "Techtober is a busy time for our reviews team as a deluge of new devices arrive before the holiday season. We’ve been hard at work conducting our in-depth testing, but it’s understandable if you missed a review or two over the last few weeks. Read on to catch up all the reviews you might’ve missed, including the latest trio of Google Pixel devices. Google Pixel 10 Pro Fold, Pixel Watch 4 and Pixel Buds 2a Earlier this month, a trio of new Pixel devices arrived for us to put through their paces. The Pixel 10 Pro Fold headlines the group, but the Pixel Watch 4 and Pixel Buds 2a are also highly capable devices in their own categories. Senior reviews writer Sam Rutherford wrote that Google has removed one of the last remaining issues with foldable phones: durability. “The addition of proper dust and water resistance on the Pixel 10 Pro Fold has removed one of the last two shortcomings of modern foldables, which is no mean feat,” he said. However, at $1,799, the price barrier is still hard to overcome for most folks.” Meta Ray-Ban Display The second-gen Meta Ray-Ban smart glasses may be the best option for most people right now, but the Meta Ray-Ban Display is the more exciting product for many. If you can get past the chunky look and in-progress features, you still have to contend with limited availability and a $800 price tag. “The Meta Ray-Ban Display glasses, on the other hand, still look very much like a first-gen product,” senior reporter Karissa Bell wrote. “There are some really compelling use cases for the display, but its functionality is limited.” ASUS ROG Xbox Ally X Microsoft’s collaboration with ASUS has produced a compelling gaming handheld that’s decidedly Xbox. The combination of familiar controls and a full-screen Xbox experience give this device an advantage over its Windows-based competition. “While Microsoft’s first real foray into PC gaming handhelds isn’t upending the status quo and it’s way too early to say if this gadget will save Xbox as a whole, it is bringing some notable advancements,” Sam said. “The new full-screen experience makes launching and playing games on Windows-based devices so much more seamless that it’s kind of wild it took so long to get here.” Bose QuietComfort Headphones (2nd gen) Bose never leave the top few spots on our best noise canceling headphones list, but its refresh of the QC Ultra Headphones put the company firmly back in first place. Updates to active noise cancellation, sound performance, battery life and power management are enough to recommend this model over the previous version and the Sony WH-1000XM6. “Similar to the second-gen QC Ultra Earbuds over the summer, Bose didn’t make huge upgrades for the updated version of the QC Ultra Headphones,” I explained. “But what you do get here is a decent improvement over its predecessor.” Razer Blade 18 (2025) Razer’s massive 18-inch gaming laptop has impressive performance, but it’s size and limited battery life don’t offer a lot of convenience. “Personally, if I had to choose between Razer’s current lineup, I’d go with the Blade 16 so that I could actually carry it around and occasionally use it as a productivity machine,” senior reviews editor Devindra Hardawar wrote. “Not so with the Blade 18 — its short two hour and 17 minute battery life (in PCMark 10’s battery benchmark) means you’ll always need to lug around its beefy power adapter.”This article originally appeared on Engadget at https://www.engadget.com/engadget-review-recap-new-pixel-devices-meta-ray-ban-display-asus-rog-xbox-ally-x-and-more-130000215.html?src=rss",
          "feed_position": 24
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2025-10/c836b6e0-a60d-11f0-aff0-71a091f199fd",
      "popularity_score": 2014.0170097222222,
      "ai_summary": [
        "A severe Amazon Web Services outage took out many websites and apps.",
        "The outage impacted services like Venmo, Snapchat, Canva, and Fortnite.",
        "Amazon's own assistant Alexa also experienced issues during the outage.",
        "The company identified DNS resolution issues as the trigger of the event.",
        "AWS services returned to normal operations by the afternoon of October 20."
      ]
    },
    {
      "id": "cluster_11",
      "coverage": 2,
      "updated_at": "2025-10-20T20:14:57-04:00",
      "title": "Bryan Cranston and SAG-AFTRA say OpenAI is taking their deepfake concerns seriously",
      "neutral_headline": "Bryan Cranston and SAG-AFTRA say OpenAI is taking their deepfake concerns seriously",
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/803141/openai-sora-bryan-cranston-deepfakes",
          "published_at": "2025-10-20T20:14:57-04:00",
          "title": "Bryan Cranston and SAG-AFTRA say OpenAI is taking their deepfake concerns seriously",
          "standfirst": "Actors, studios, agents, and the actors union SAG-AFTRA have all expressed their concerns about appearing in Sora 2&#8217;s AI-generated videos ever since the deepfake machine was released last month. Now a joint statement from actor Bryan Cranston, OpenAI, the union, and others says that after videos of him appeared on Sora — one even showed [&#8230;]",
          "content": "Actors, studios, agents, and the actors union SAG-AFTRA have all expressed their concerns about appearing in Sora 2&#8217;s AI-generated videos ever since the deepfake machine was released last month. Now a joint statement from actor Bryan Cranston, OpenAI, the union, and others says that after videos of him appeared on Sora — one even showed him taking a selfie with Michael Jackson — the company has “strengthened guardrails” around its opt-in policy for likeness and voice. The joint statement said that OpenAI “expressed regret for these unintentional generations.” It also carried cosigns from talent agencies United Talent Agency, the Association of Talent Agents, and the Creative Artists Agency, which had criticized the company’s lack of protections for artists in the past. OpenAI did not give specifics on how it would change the app, or reply to The Verge’s request for comment in time for publication. OpenAI appeared to reaffirm its commitment to stronger protections for those who do not opt in: “All artists, performers, and individuals will have the right to determine how and whether they can be simulated.” It also said it would “expeditiously” review complaints about breaches of the policy. Cranston said he is “grateful to OpenAI for its policy and for improving its guardrails.” While Cranston’s case came to a positive resolution, SAG-AFTRA president Sean Astin said in the joint statement that performers need a law to protect them from “massive misappropriation by replication technology,” and pointed to the proposed Nurture Originals, Foster Art, and Keep Entertainment Safe Act, or NO FAKES Act. OpenAI launched Sora 2 with an opt-out policy for copyright holders, before reversing course following public outcry and videos of Nazi SpongeBob, promising to “give rightsholders more granular control over generation of characters, similar to the opt-in model for likeness but with additional controls.”",
          "feed_position": 1
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/251020/p29#a251020p29",
          "published_at": "Mon, 20 Oct 2025 15:35:04 -0400",
          "title": "OpenAI says it will work with SAG-AFTRA, CAA, UTA, and others to crack down on Sora 2 deepfakes, following concerns from actor Bryan Cranston and SAG-AFTRA (Jaures Yip/CNBC)",
          "standfirst": "Jaures Yip / CNBC: OpenAI says it will work with SAG-AFTRA, CAA, UTA, and others to crack down on Sora 2 deepfakes, following concerns from actor Bryan Cranston and SAG-AFTRA &mdash; OpenAI announced on Monday in a joint statement that it will be working with Bryan Cranston, SAG-AFTRA, and other actor unions &hellip;",
          "content": "Jaures Yip / CNBC: OpenAI says it will work with SAG-AFTRA, CAA, UTA, and others to crack down on Sora 2 deepfakes, following concerns from actor Bryan Cranston and SAG-AFTRA &mdash; OpenAI announced on Monday in a joint statement that it will be working with Bryan Cranston, SAG-AFTRA, and other actor unions &hellip;",
          "feed_position": 8,
          "image_url": "http://www.techmeme.com/251020/i29.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/251020/i29.jpg",
      "popularity_score": 2012.915898611111,
      "ai_summary": [
        "Actor Bryan Cranston and SAG-AFTRA expressed concerns about Sora 2 deepfakes.",
        "OpenAI is working with SAG-AFTRA and others to address deepfake concerns.",
        "The joint statement includes Bryan Cranston and other actor unions.",
        "The collaboration aims to crack down on the misuse of AI-generated videos.",
        "The focus is on preventing unauthorized use of actors' likenesses."
      ]
    },
    {
      "id": "cluster_36",
      "coverage": 2,
      "updated_at": "Mon, 20 Oct 2025 19:00:00 +0000",
      "title": "Mystery Object From ‘Space’ Strikes United Airlines Flight Over Utah",
      "neutral_headline": "Object From Space Strikes United Airlines Flight Over Utah",
      "items": [
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/mystery-space-object-strikes-united-airlines-flight-over-utah/",
          "published_at": "Mon, 20 Oct 2025 19:00:00 +0000",
          "title": "Mystery Object From ‘Space’ Strikes United Airlines Flight Over Utah",
          "standfirst": "Government investigators are gathering data to confirm what exactly cracked the windshield of a 737 Max aircraft at above 30,000 feet.",
          "content": "Government investigators are gathering data to confirm what exactly cracked the windshield of a 737 Max aircraft at above 30,000 feet.",
          "feed_position": 0,
          "image_url": "https://media.wired.com/photos/68f65dea692735b39dbd9c74/master/pass/Mystery-Object-From-%E2%80%98Space%E2%80%99-Science-2208683302.jpg"
        },
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/10/something-from-space-may-have-just-struck-a-united-airlines-flight-over-utah/",
          "published_at": "Sun, 19 Oct 2025 18:50:10 +0000",
          "title": "Something from “space” may have just struck a United Airlines flight over Utah",
          "standfirst": "\"NTSB gathering radar, weather, flight recorder data.\"",
          "content": "The National Transportation Safety Board confirmed Sunday that it is investigating an airliner that was struck by an object in its windscreen, mid-flight, over Utah. “NTSB gathering radar, weather, flight recorder data,” the federal agency said on the social media site X. “Windscreen being sent to NTSB laboratories for examination.” The strike occurred Thursday, during a United Airlines flight from Denver to Los Angeles. Images shared on social media showed that one of the two large windows at the front of a 737 MAX aircraft was significantly cracked. Related images also reveal a pilot’s arm that has been cut multiple times by what appear to be small shards of glass.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2019/03/Boeing_737_MAX_7-1-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://media.wired.com/photos/68f65dea692735b39dbd9c74/master/pass/Mystery-Object-From-%E2%80%98Space%E2%80%99-Science-2208683302.jpg",
      "popularity_score": 2007.6667319444443,
      "ai_summary": [
        "A United Airlines flight was struck by an object over Utah.",
        "Government investigators are gathering data about the incident.",
        "The object caused a crack in the windshield of a 737 Max aircraft.",
        "The incident occurred at an altitude above 30,000 feet.",
        "The source of the object is currently unknown."
      ]
    },
    {
      "id": "cluster_50",
      "coverage": 2,
      "updated_at": "Mon, 20 Oct 2025 18:15:00 GMT",
      "title": "Claude Code comes to web and mobile, letting devs launch parallel jobs on Anthropic’s managed infra",
      "neutral_headline": "Anthropic's Claude Code Launches Web and Mobile Versions",
      "items": [
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/ai/claude-code-comes-to-web-and-mobile-letting-devs-launch-parallel-jobs-on",
          "published_at": "Mon, 20 Oct 2025 18:15:00 GMT",
          "title": "Claude Code comes to web and mobile, letting devs launch parallel jobs on Anthropic’s managed infra",
          "standfirst": "Vibe coding is evolving and with it are the leading AI-powered coding services and tools, including Anthropic’s Claude Code. As of today, the service will be available via the web and, in preview, on the Claude iOS app, giving developers access to additional asynchronous capabilities. Previously, it was available through the terminal on developers&#x27; PCs with support for Git, Docker, Kubernetes, npm, pip, AWS CLI, etc., and as an extension for Microsoft&#x27;s open source VS Code editor and other JetBrains-powered integrated development environments (IDEs) via Claude Agent. “Claude Code on the web lets you kick off coding sessions without opening your terminal,” Anthropic said in a blog post. “Connect your GitHub repositories, describe what you need, and Claude handles the implementation. Each session runs in its own isolated environment with real-time progress tracking, and you can actively steer Claude to adjust course as it’s working through tasks.”This allows users to run coding projects asynchronously, a trend that many enterprises are looking for. The web version of Claude Code, currently in research preview, will be available to Pro and Max users. However, web Claude Code will be subject to the same rate limits as other versions. Anthropic throttled rate limits to Claude and Claude Code after the unexpected popularity of the coding tool in July, which enabled some users to run Claude Code overnight. Anthropic is now ensuring Claude Code comes closer to matching the availability of rival OpenAI&#x27;s Codex AI coding platform, powered by a variant of GPT-5, which launches on mobile and the web back in mid September 2025.Parallel usageAnthropic said running Claude Code in the cloud means teams can “now run multiple tasks in parallel across different repositories from a single interface and ship faster with automatic PR creation and clear change summaries.”One of the big draws of coding agents is giving developers the ability to run multiple coding projects, such as bugfixes, at the same time. Google’s two coding agents, Jules and Code Assist, both offer asynchronous code generation and checks. Codex from OpenAI also lets people work in parallel. Anthropic said bringing Claude Code to the web won’t disrupt workflows, but noted running tasks in the cloud work best for tasks such as answering questions around projects and how repositories are mapped, bugfixes and for routine, well-defined tasks, and backend changes to verify any adjustments. While most developers will likely prefer to use Claude Code on a desktop, Anthropic said the mobile version could encourage more users to “explore coding with Claude on the go.”Isolated environments Anthropic insisted that Claude Code tasks on the cloud will have the same level of security as the earlier version. It runs on an “isolated sandbox environment with network and filesystem restrictions.” Interactions go through a secure proxy service, which the company said ensures the model only accesses authorized repositories.Enterprise users can customize which domains Claude Code can connect to. Claude Code is powered by Claude Sonnet 4.5, which Anthropic claims is the best coding model around. The company recently made Claude Haiku 4.5, a smaller version of Claude that also has strong coding capabilities, available to all Claude subscribers, including free users.",
          "content": "Vibe coding is evolving and with it are the leading AI-powered coding services and tools, including Anthropic’s Claude Code. As of today, the service will be available via the web and, in preview, on the Claude iOS app, giving developers access to additional asynchronous capabilities. Previously, it was available through the terminal on developers&#x27; PCs with support for Git, Docker, Kubernetes, npm, pip, AWS CLI, etc., and as an extension for Microsoft&#x27;s open source VS Code editor and other JetBrains-powered integrated development environments (IDEs) via Claude Agent. “Claude Code on the web lets you kick off coding sessions without opening your terminal,” Anthropic said in a blog post. “Connect your GitHub repositories, describe what you need, and Claude handles the implementation. Each session runs in its own isolated environment with real-time progress tracking, and you can actively steer Claude to adjust course as it’s working through tasks.”This allows users to run coding projects asynchronously, a trend that many enterprises are looking for. The web version of Claude Code, currently in research preview, will be available to Pro and Max users. However, web Claude Code will be subject to the same rate limits as other versions. Anthropic throttled rate limits to Claude and Claude Code after the unexpected popularity of the coding tool in July, which enabled some users to run Claude Code overnight. Anthropic is now ensuring Claude Code comes closer to matching the availability of rival OpenAI&#x27;s Codex AI coding platform, powered by a variant of GPT-5, which launches on mobile and the web back in mid September 2025.Parallel usageAnthropic said running Claude Code in the cloud means teams can “now run multiple tasks in parallel across different repositories from a single interface and ship faster with automatic PR creation and clear change summaries.”One of the big draws of coding agents is giving developers the ability to run multiple coding projects, such as bugfixes, at the same time. Google’s two coding agents, Jules and Code Assist, both offer asynchronous code generation and checks. Codex from OpenAI also lets people work in parallel. Anthropic said bringing Claude Code to the web won’t disrupt workflows, but noted running tasks in the cloud work best for tasks such as answering questions around projects and how repositories are mapped, bugfixes and for routine, well-defined tasks, and backend changes to verify any adjustments. While most developers will likely prefer to use Claude Code on a desktop, Anthropic said the mobile version could encourage more users to “explore coding with Claude on the go.”Isolated environments Anthropic insisted that Claude Code tasks on the cloud will have the same level of security as the earlier version. It runs on an “isolated sandbox environment with network and filesystem restrictions.” Interactions go through a secure proxy service, which the company said ensures the model only accesses authorized repositories.Enterprise users can customize which domains Claude Code can connect to. Claude Code is powered by Claude Sonnet 4.5, which Anthropic claims is the best coding model around. The company recently made Claude Haiku 4.5, a smaller version of Claude that also has strong coding capabilities, available to all Claude subscribers, including free users.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/479x9yR2m3sOxcfXEPnxI/dd6f7e7281ced692395996331a3b5646/crimedy7_illustration_of_a_robot_coding_a_program_--ar_169_--_7dafd9d4-817a-4c5c-abbe-fb9112e639c7_0.png"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/anthropic-brings-claude-code-to-ios-and-the-web-180023611.html",
          "published_at": "Mon, 20 Oct 2025 18:00:23 +0000",
          "title": "Anthropic brings Claude Code to iOS and the web",
          "standfirst": "At the end of February, Anthropic announced Claude Code. In the eight months since then, the coding agent has arguably become the company's most important product, helping it carve out a niche for itself in the highly competitive AI market. Now, Anthropic is making it easier for developers to use Claude Code in more places with a new web interface for accessing the agent. To get started, you'll need connect Claude to your GitHub repositories. From there, the process of using the agent is the same as if it had direct terminal access. Describe what you need from it, and the agent will take it from there. Claude will provide progress updates while it works, and you can even steer it in real-time with additional prompts. Through the web interface, it's also possible to assign Claude multiple coding tasks to run in parallel. \"Every Claude Code task runs in an isolated sandbox environment with network and filesystem restrictions. Git interactions are handled through a secure proxy service that ensures Claude can only access authorized repositories — helping keep your code and credentials protected throughout the entire workflow,\" said Anthropic. In addition to making Claude Code available on the web, Anthropic is releasing a preview of the agent inside of its iOS app. The company warns the integration is early, and that it hopes \"to quickly refine the mobile experience based on your feedback.\" Pro and Max users can start using Claude Code on the web today. Anthropic notes any cloud sessions share the same rate limits with all other Claude Code usage. This article originally appeared on Engadget at https://www.engadget.com/ai/anthropic-brings-claude-code-to-ios-and-the-web-180023611.html?src=rss",
          "content": "At the end of February, Anthropic announced Claude Code. In the eight months since then, the coding agent has arguably become the company's most important product, helping it carve out a niche for itself in the highly competitive AI market. Now, Anthropic is making it easier for developers to use Claude Code in more places with a new web interface for accessing the agent. To get started, you'll need connect Claude to your GitHub repositories. From there, the process of using the agent is the same as if it had direct terminal access. Describe what you need from it, and the agent will take it from there. Claude will provide progress updates while it works, and you can even steer it in real-time with additional prompts. Through the web interface, it's also possible to assign Claude multiple coding tasks to run in parallel. \"Every Claude Code task runs in an isolated sandbox environment with network and filesystem restrictions. Git interactions are handled through a secure proxy service that ensures Claude can only access authorized repositories — helping keep your code and credentials protected throughout the entire workflow,\" said Anthropic. In addition to making Claude Code available on the web, Anthropic is releasing a preview of the agent inside of its iOS app. The company warns the integration is early, and that it hopes \"to quickly refine the mobile experience based on your feedback.\" Pro and Max users can start using Claude Code on the web today. Anthropic notes any cloud sessions share the same rate limits with all other Claude Code usage. This article originally appeared on Engadget at https://www.engadget.com/ai/anthropic-brings-claude-code-to-ios-and-the-web-180023611.html?src=rss",
          "feed_position": 7
        }
      ],
      "featured_image": "https://images.ctfassets.net/jdtwqhzvc2n1/479x9yR2m3sOxcfXEPnxI/dd6f7e7281ced692395996331a3b5646/crimedy7_illustration_of_a_robot_coding_a_program_--ar_169_--_7dafd9d4-817a-4c5c-abbe-fb9112e639c7_0.png",
      "popularity_score": 2006.9167319444443,
      "ai_summary": [
        "Claude Code is now available on the web and in preview on iOS.",
        "Developers can access additional asynchronous capabilities.",
        "The web version allows coding sessions without a terminal.",
        "Users can connect GitHub repositories and describe coding needs.",
        "Anthropic is ensuring Claude Code matches OpenAI's Codex availability."
      ]
    },
    {
      "id": "cluster_68",
      "coverage": 2,
      "updated_at": "Mon, 20 Oct 2025 16:49:58 +0000",
      "title": "FTC removes Lina Khan-era posts about AI risks and open source",
      "neutral_headline": "FTC Removes Posts About AI Risks and Open Source",
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/10/20/ftc-removes-lina-khan-era-posts-about-ai-risks-and-open-source/",
          "published_at": "Mon, 20 Oct 2025 16:49:58 +0000",
          "title": "FTC removes Lina Khan-era posts about AI risks and open source",
          "standfirst": "One post, authored by Khan’s staff, was published on January 3, 2025, with the title “AI and the Risk of Consumer Harm.” It noted that the FTC was “taking note of AI’s potential for real-world instances of harm — from incentivizing commercial surveillance to enabling fraud and impersonation to perpetuating illegal discrimination.”",
          "content": "One post, authored by Khan’s staff, was published on January 3, 2025, with the title “AI and the Risk of Consumer Harm.” It noted that the FTC was “taking note of AI’s potential for real-world instances of harm — from incentivizing commercial surveillance to enabling fraud and impersonation to perpetuating illegal discrimination.”",
          "feed_position": 9
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/ftc-removes-blog-posts-about-ai-authored-by-by-lina-khan/",
          "published_at": "Mon, 20 Oct 2025 10:00:00 +0000",
          "title": "The FTC Is Disappearing Blog Posts About AI Published During Lina Khan’s Tenure",
          "standfirst": "The Federal Trade Commission removed several blog posts in recent months about open source and potential risks to consumers from the rapid spread of commercial AI tools.",
          "content": "The Federal Trade Commission removed several blog posts in recent months about open source and potential risks to consumers from the rapid spread of commercial AI tools.",
          "feed_position": 12,
          "image_url": "https://media.wired.com/photos/68f1899c43997c1874543fc3/master/pass/GettyImages-2153112061.jpg"
        }
      ],
      "featured_image": "https://media.wired.com/photos/68f1899c43997c1874543fc3/master/pass/GettyImages-2153112061.jpg",
      "popularity_score": 2005.4995097222222,
      "ai_summary": [
        "The FTC removed blog posts about AI published during Lina Khan's tenure.",
        "The posts discussed open source and consumer risks from AI.",
        "One post was titled \"AI and the Risk of Consumer Harm.\"",
        "The FTC noted AI's potential for various real-world harms.",
        "The removal of posts has sparked some controversy."
      ]
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Tue, 21 Oct 2025 02:54:29 +0000",
      "title": "It wasn’t space debris that struck a United Airlines plane—it was a weather balloon",
      "neutral_headline": "Weather Balloon Identified as Cause of United Plane Incident",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/10/the-mystery-object-that-struck-a-plane-in-flight-it-was-probably-a-weather-balloon/",
          "published_at": "Tue, 21 Oct 2025 02:54:29 +0000",
          "title": "It wasn’t space debris that struck a United Airlines plane—it was a weather balloon",
          "standfirst": "WindBorne says its balloons are compliant with all applicable airspace regulations.",
          "content": "The mysterious impact of a United Airlines aircraft in flight last week has sparked plenty of theories as to its cause, from space debris to high-flying birds. However the question of what happened to flight 1093, and its severely damaged front window, appears to be answered in the form of a weather balloon. “I think this was a WindBorne balloon,” Kai Marshland, co-founder of the weather prediction company WindBorne Systems, told Ars in an email on Monday evening. “We learned about UA1093 and the potential that it was related to one of our balloons at 11 pm PT on Sunday and immediately looked into it. At 6 am PT, we sent our preliminary investigation to both NTSB and FAA, and are working with both of them to investigate further.”Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/68a6ba53499bdd827f510e35_54fca9353dfe2c2a33bb46167c61cd64_payload-block3-957x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/68a6ba53499bdd827f510e35_54fca9353dfe2c2a33bb46167c61cd64_payload-block3-957x648.png",
      "popularity_score": 366.5747875,
      "ai_summary": [
        "A weather balloon, not space debris, struck the United Airlines plane.",
        "The balloon was from WindBorne, a weather data company.",
        "WindBorne states its balloons comply with airspace regulations.",
        "The incident occurred over Utah, causing damage to the aircraft.",
        "The investigation has concluded the source of the impact."
      ]
    },
    {
      "id": "cluster_18",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 22:18:22 +0000",
      "title": "NSO permanently barred from targeting WhatsApp users with Pegasus spyware",
      "neutral_headline": "NSO Group Permanently Barred From Targeting WhatsApp Users",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/10/nso-permanently-barred-from-targeting-whatsapp-users-with-pegasus-spyware/",
          "published_at": "Mon, 20 Oct 2025 22:18:22 +0000",
          "title": "NSO permanently barred from targeting WhatsApp users with Pegasus spyware",
          "standfirst": "Ruling holds that defeating end-to-end encryption in WhatsApp harms Meta's business.",
          "content": "A federal judge has ordered spyware maker NSO to stop using its Pegasus app to target or infect users of WhatsApp. The ruling, issued Friday by Phyllis J. Hamilton of of the US District Court of the District of Northern California, grants a permanent injunction sought by WhatsApp owner Meta in a case it brought against NSO in 2019. The lawsuit alleged that Meta caught NSO trying to surreptitiously infect about 1,400 mobile phones—many belonging to attorneys, journalists, human-rights activists, political dissidents, diplomats, and senior foreign government officials—with Pegasus. As part of the campaign, NSO created fake WhatsApp accounts and targeted Meta infrastructure. The suit sought monetary awards and an injunction against the practice. Setting a precedent Friday’s ruling ordered NSO to permanently cease targeting WhatsApp users, attempting to infect their devices, or intercepted WhatsApp messages, which are end-to-end encrypted using the open source Signal Protocol. Hamilton also ruled that NSO must delete any data it obtained when targeting the WhatsApp users.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/whatsapp-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/whatsapp-1024x648.jpg",
      "popularity_score": 333.97284305555553,
      "ai_summary": [
        "NSO Group is permanently banned from targeting WhatsApp users.",
        "The ruling concerns the use of Pegasus spyware.",
        "Defeating end-to-end encryption harms Meta's business.",
        "The ban is a result of legal action against NSO Group.",
        "The decision protects user privacy on WhatsApp."
      ]
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 21:53:54 +0000",
      "title": "Why did NASA’s chief just shake up the agency’s plans to land on the Moon?",
      "neutral_headline": "NASA Chief Changes Moon Landing Plans",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/10/nasas-acting-leader-seeks-to-keep-his-job-with-new-lunar-lander-announcement/",
          "published_at": "Mon, 20 Oct 2025 21:53:54 +0000",
          "title": "Why did NASA’s chief just shake up the agency’s plans to land on the Moon?",
          "standfirst": "\"The president wants to make sure we beat the Chinese.\"",
          "content": "NASA acting administrator Sean Duffy made two television appearances on Monday morning in which he shook up the space agency’s plans to return humans to the Moon. Speaking on Fox News, where the secretary of transportation frequently appears in his acting role as NASA chief, Duffy said SpaceX has fallen behind in its efforts to develop the Starship vehicle as a lunar lander. Duffy also indirectly acknowledged that NASA’s projected target of a 2027 crewed lunar landing is no longer achievable. Accordingly, he said he intended to expand the competition to develop a lander capable of carrying humans down to the Moon from lunar orbit and back. “They’re behind schedule, and so the President wants to make sure we beat the Chinese,” Duffy said of SpaceX. “He wants to get there in his term. So I’m in the process of opening that contract up. I think we’ll see companies like Blue [Origin] get involved, and maybe others. We’re going to have a space race in regard to American companies competing to see who can actually lead us back to the Moon first.”Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/NHQ202507310028medium-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/NHQ202507310028medium-1152x648.jpg",
      "popularity_score": 323.56506527777776,
      "ai_summary": [
        "NASA's chief has altered the agency's plans for moon landings.",
        "The changes are reportedly influenced by political factors.",
        "The president wants to beat China in the space race.",
        "The article suggests a shift in priorities for NASA.",
        "The new plans may involve accelerating the timeline."
      ]
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 20:14:29 +0000",
      "title": "Google reportedly searching for 15 Pixel “Superfans” to test unreleased phones",
      "neutral_headline": "Google Seeking Pixel Superfans for Phone Testing",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/10/google-reportedly-searching-for-15-pixel-superfans-to-test-unreleased-phones/",
          "published_at": "Mon, 20 Oct 2025 20:14:29 +0000",
          "title": "Google reportedly searching for 15 Pixel “Superfans” to test unreleased phones",
          "standfirst": "Selected testers will have to sign an NDA and use a disguised case.",
          "content": "It took awhile, but Google’s Pixel line of smartphones has established itself as a mainstay of Android after 10 generations. The company has long operated a “Superfans” group to help promote Pixels, but now members have a slim chance to get their hands on Google’s next phones ahead of time. Google is reportedly looking for some lucky Superfans to test and provide feedback on unreleased devices, but they’ll have to promise not to leak anything. It’s not unheard of for companies to have loyal customers help test new products, but it’s not usually big companies like Google with well-established products like Pixel. Google usually keeps its circle of hardware testers small and limited to employees. According to Bloomberg, Google is running a contest among Superfans to find 15 non-employees suited to test in-development hardware. An official document reviewed by Bloomberg describes the program as a chance to “provide feedback and help shape a Pixel phone currently in development.” To apply, interested Superfans have to prove they are more super than the rest. They must demonstrate deep knowledge of the Pixel product family and suggest ways the phones can be improved. However, Google is asking this of its biggest supporters—people who still care enough about their smartphones to seek out a group specifically to talk about how much they care about their phones. Is Google going to get gushing praise or constructive criticism?Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/Pixel-10-Pro-Fold-4-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/Pixel-10-Pro-Fold-4-1152x648.jpg",
      "popularity_score": 318.9081208333333,
      "ai_summary": [
        "Google is looking for 15 Pixel \"Superfans\" to test unreleased phones.",
        "Selected testers must sign a non-disclosure agreement.",
        "Testers will be required to use a disguised case.",
        "The program allows Google to gather user feedback.",
        "The testing will involve early access to new devices."
      ]
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 20:45:26 +0000",
      "title": "Claude Code gets a web version—but it’s the new sandboxing that really matters",
      "neutral_headline": "Claude Code Web Version Focuses on Sandboxing",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/10/claude-code-gets-a-web-version-but-its-the-new-sandboxing-that-really-matters/",
          "published_at": "Mon, 20 Oct 2025 20:45:26 +0000",
          "title": "Claude Code gets a web version—but it’s the new sandboxing that really matters",
          "standfirst": "Sandboxing lessens hassle, but fire-and-forget agentic tools still pose risks.",
          "content": "Anthropic has added web and mobile interfaces for Claude Code, its immensely popular command-line interface (CLI) agentic AI coding tool. The web interface appears to be well-baked at launch, but the mobile version is limited to iOS and is in an earlier stage of development. The web version of Claude Code can be given access to a GitHub repository. Once that’s done, developers can give it general marching orders like “add real-time inventory tracking to the dashboard.” As with the CLI version, it gets to work, with updates along the way approximating where it’s at and what it’s doing. The web interface supports the recently implemented Claude Code capability to take suggestions or requested changes while it’s in the middle of working on a task. (Previously, if you saw it doing something wrong or missing something, you often had to cancel and start over.)Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/Screenshot-2025-10-20-at-3.36.24-PM.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/Screenshot-2025-10-20-at-3.36.24-PM.png",
      "popularity_score": 312.42395416666665,
      "ai_summary": [
        "Claude Code's web version emphasizes sandboxing features.",
        "Sandboxing reduces the hassle associated with coding.",
        "Agentic tools still pose risks despite sandboxing.",
        "The article discusses the benefits of sandboxing.",
        "The focus is on improving the user experience."
      ]
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 20:01:59 +0000",
      "title": "Breaking down rare earth element magnets for recycling",
      "neutral_headline": "New Method for Recycling Rare Earth Magnets",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/10/breaking-down-rare-earth-element-magnets-for-recycling/",
          "published_at": "Mon, 20 Oct 2025 20:01:59 +0000",
          "title": "Breaking down rare earth element magnets for recycling",
          "standfirst": "New method extracts desirable elements from waste magnets using less energy and acid.",
          "content": "All the world’s discarded phones, bricked laptops, and other trashed electronics are collectively a treasure trove of rare earth elements (REEs). But separating out and recovering these increasingly sought-after materials is no easy task. However, a team of researchers says it has developed a way of separating REEs from waste—magnets, in this case—that is relatively easy, uses less energy, and isn’t nearly as emissions and pollution intensive as current methods. The team published a paper describing this method in the Proceedings of the National Academy of Sciences. In short, this process involves using an electric current to heat waste magnets to very high temperatures very fast, and using chlorine gas to react with the non-REEs in the mix, keeping them in the vapor phase. James Tour, one of the authors and a professor of materials science and nanoengineering at Rice University, says that the research can help the United States meet its growing need for these elements.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/GettyImages-1359528962-e1760988838500-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/GettyImages-1359528962-e1760988838500-1152x648.jpg",
      "popularity_score": 299.6997875,
      "ai_summary": [
        "A new method extracts elements from waste magnets.",
        "The method uses less energy and acid than previous methods.",
        "The process focuses on recycling rare earth elements.",
        "The goal is to improve the sustainability of magnets.",
        "The innovation could reduce environmental impact."
      ]
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 19:15:24 +0000",
      "title": "Do animals fall for optical illusions? It’s complicated.",
      "neutral_headline": "Animal optical illusion susceptibility varies by species",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/10/do-animals-fall-for-optical-illusions-its-complicated/",
          "published_at": "Mon, 20 Oct 2025 19:15:24 +0000",
          "title": "Do animals fall for optical illusions? It’s complicated.",
          "standfirst": "Guppies are highly susceptible to the Ebbinghaus illusion. Ring doves? Not so much.",
          "content": "Chances are you’ve encountered some version of the “Ebbinghaus illusion,” in which a central circle appears to be smaller when encircled by larger circles and seems larger when surrounded by smaller circles. It’s an example of context-dependent size perception. But is this unique to humans or are some animals susceptible as well? According to a new paper published in the journal Frontiers in Psychology, it might depend on the specific sensory environment, since the illusion relies on contextual clues to be effective. Prior research has produced mixed results on the question of animals and their susceptibility to optical illusions, per the authors. Dolphins, chicks, and redtail splitfins seem to be susceptible, for example, while pigeons, baboons, and gray bamboo snakes are not. Perhaps the best-known example is cats’ undeniable love of boxes and squares—the “if it fits, I sits” phenomenon documented all over the Internet. This behavior is generally attributed to the fact that cats feel safer when squeezed into small spaces, but it also tells us something about feline visual perception. A 1988 study and a 2021 study concluded that cats are susceptible to the Kanizsa square illusion, suggesting that they perceive subjective contours much like humans.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/illusion1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/illusion1-1152x648.jpg",
      "popularity_score": 280.9233986111111,
      "ai_summary": [
        "Guppies demonstrate high susceptibility to the Ebbinghaus illusion, a visual trick.",
        "Ring doves, however, show little to no susceptibility to the same illusion.",
        "The study suggests different visual processing in these animal species.",
        "Researchers are exploring the underlying cognitive mechanisms at play.",
        "This research helps understand animal perception and visual systems."
      ]
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 18:38:02 +0000",
      "title": "SpaceX launches 10,000th Starlink satellite, with no sign of slowing down",
      "neutral_headline": "SpaceX launches 10,000th Starlink satellite milestone",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/10/spacex-launches-10000th-starlink-satellite-with-no-sign-of-slowing-down/",
          "published_at": "Mon, 20 Oct 2025 18:38:02 +0000",
          "title": "SpaceX launches 10,000th Starlink satellite, with no sign of slowing down",
          "standfirst": "Sunday was not a day of rest for SpaceX.",
          "content": "Two Falcon 9 rockets lifted off from spaceports in Florida and California on Sunday afternoon, adding 56 more satellites to SpaceX’s Starlink broadband network. The second of these two launches—originating from Vandenberg Space Force Base, California—propelled SpaceX’s Starlink program past a notable milestone. With the satellites added to the constellation Sunday, the company has delivered more than 10,000 mass-produced Starlink spacecraft to low-Earth orbit. The exact figure stands at 10,006 satellites, according to a tabulation by Jonathan McDowell, an astrophysicist who expertly tracks comings and goings between Earth and space. This number includes dozens of Starlink demo satellites, but not the dummy spacecraft carried on SpaceX’s recent Starship test flights.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/starlinkstack-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/starlinkstack-1152x648.jpg",
      "popularity_score": 278.3006208333333,
      "ai_summary": [
        "SpaceX launched its 10,000th Starlink satellite on a recent Sunday.",
        "The company continues to expand its satellite internet constellation.",
        "This launch represents a significant achievement for SpaceX.",
        "The company shows no signs of slowing down its launch cadence.",
        "Starlink aims to provide global internet access."
      ]
    },
    {
      "id": "cluster_57",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 17:55:31 +0000",
      "title": "Musk’s $1 trillion Tesla pay plan draws some protest ahead of likely approval",
      "neutral_headline": "Tesla CEO Musk's pay plan faces shareholder protest",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/10/musks-1-trillion-pay-plan-doesnt-force-him-to-keep-focus-on-tesla-critics-say/",
          "published_at": "Mon, 20 Oct 2025 17:55:31 +0000",
          "title": "Musk’s $1 trillion Tesla pay plan draws some protest ahead of likely approval",
          "standfirst": "Proxy firm says plan doesn't ensure that Musk's \"focus and time remain on Tesla.\"",
          "content": "Tesla shareholders should reject a compensation plan that could pay Elon Musk more than $1 trillion over the next decade, proxy advisory firm Institutional Shareholder Services (ISS) said in a report Friday. The plan is designed “to retain Musk and keep his time and attention on Tesla instead of his other business ventures,” but “there are no prescriptive elements within the award to ensure his focus and time remain on Tesla as opposed to his other ventures, undermining the award’s primary rationale,” the advisory firm said in a report for its clients. The “astronomical grant value” awarded to Musk could dilute value for other shareholders “due to the extreme value and number of shares being granted,” and it is questionable whether the award “is necessary or appropriate to further align his interests [with Tesla] when he currently holds a 19.8 percent ownership stake in the company,” ISS said.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/musk-cybertruck-1152x648-1760980565.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/musk-cybertruck-1152x648-1760980565.jpg",
      "popularity_score": 270.5920097222222,
      "ai_summary": [
        "Tesla CEO Elon Musk's $1 trillion pay plan is facing some opposition.",
        "A proxy firm expressed concerns about Musk's focus on Tesla.",
        "The firm suggests the plan may not ensure his dedication to the company.",
        "Shareholders will vote on the compensation package.",
        "The plan's approval is considered likely despite the protest."
      ]
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 14:27:01 +0000",
      "title": "F1 in Texas: Well, now the championship is exciting again",
      "neutral_headline": "Formula 1 US Grand Prix provides exciting championship race",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/10/f1-in-texas-well-now-the-championship-is-exciting-again/",
          "published_at": "Mon, 20 Oct 2025 14:27:01 +0000",
          "title": "F1 in Texas: Well, now the championship is exciting again",
          "standfirst": "The Circuit of the Americas was packed for the US Grand Prix.",
          "content": "Formula 1 held the third of its five North American rounds this past weekend at the Circuit of the Americas in Austin, Texas. Unlike the races in Montreal, Miami, and Las Vegas, the US Grand Prix is held on a proper road course, one purpose-built for the task of hosting F1 a little over a decade ago. It’s a circuit Ars knows quite well—along with some friends, I was on the turn-19 banking for the first race in 2012, and we checked out Caterham’s setup the following year; toured the F1 tech center in 2015, where the race broadcasts are directed; then learned about tires there with Pirelli in 2021. And we’ve driven it in everything from an Audi TT-S to a Corvette ZR1 to a Mocabene Vent Noir. Not to mention all the Lone Star Le Mans races we’ve attended. The crowds now exceed even the mass of humanity that showed up for that first race. And while Miami and Las Vegas have been pitched at the “more money than they know what to do with” people, ticket prices at COTA are more reasonable (for an F1 event). As long as you don’t mind brutal heat and humidity, it can be quite a good race to attend.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/GettyImages-2241837010-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/GettyImages-2241837010-1152x648.jpg",
      "popularity_score": 261.11700972222224,
      "ai_summary": [
        "The US Grand Prix at the Circuit of the Americas was highly attended.",
        "The race has injected excitement into the Formula 1 championship.",
        "The event saw intense competition among drivers.",
        "The championship standings have become more competitive.",
        "The race provided thrilling moments for fans."
      ]
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 11:00:09 +0000",
      "title": "Should an AI copy of you help decide if you live or die?",
      "neutral_headline": "AI surrogates in life or death decisions raise concerns",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/features/2025/10/should-an-ai-copy-of-you-help-decide-if-you-live-or-die/",
          "published_at": "Mon, 20 Oct 2025 11:00:09 +0000",
          "title": "Should an AI copy of you help decide if you live or die?",
          "standfirst": "Doctors share top concerns of AI surrogates aiding life-or-death decisions.",
          "content": "For more than a decade, researchers have wondered whether artificial intelligence could help predict what incapacitated patients might want when doctors must make life-or-death decisions on their behalf. It remains one of the most high-stakes questions in health care AI today. But as AI improves, some experts increasingly see it as inevitable that digital “clones” of patients could one day aid family members, doctors, and ethics boards in making end-of-life decisions that are aligned with a patient’s values and goals. Ars spoke with experts conducting or closely monitoring this research who confirmed that no hospital has yet deployed so-called “AI surrogates.” But AI researcher Muhammad Aurangzeb Ahmad is aiming to change that, taking the first steps toward piloting AI surrogates at a US medical facility.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/pull-the-plug-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/pull-the-plug-1152x648.jpg",
      "popularity_score": 148,
      "ai_summary": [
        "Doctors are sharing concerns about AI surrogates in medical decisions.",
        "The use of AI in life-or-death scenarios is being discussed.",
        "Concerns include data privacy and algorithmic bias.",
        "Ethical considerations are central to the debate.",
        "The role of AI in healthcare is evolving rapidly."
      ]
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Mon, 20 Oct 2025 13:51:44 +0000",
      "title": "Anti-vaccine activists want to go nationwide after Idaho law passes",
      "neutral_headline": "Anti-vaccine activists seek nationwide expansion",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/10/after-success-in-idaho-anti-vaccine-activists-want-to-export-their-idiocy-nationwide/",
          "published_at": "Mon, 20 Oct 2025 13:51:44 +0000",
          "title": "Anti-vaccine activists want to go nationwide after Idaho law passes",
          "standfirst": "The Idaho Medical Freedom Act makes it illegal to require anyone to take a vaccine.",
          "content": "ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox. Three women become choked up as they deliver news in a video posted to social media. “We did it, everybody,” says Leslie Manookian, the woman in the middle. She is a driving force in a campaign that has chipped away at the foundations of modern public health in Idaho. The group had just gotten lawmakers to pass what she called the first true “medical freedom” bill in the nation. “It’s literally landmark,” Manookian said. “It is changing everything.” With Manookian in the video are two of her allies, the leaders of Health Freedom Idaho. It was April 4, hours after the governor signed the Idaho Medical Freedom Act into law.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2022/01/GettyImages-1231265707-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2022/01/GettyImages-1231265707-1152x648.jpeg",
      "popularity_score": 135.52895416666667,
      "ai_summary": [
        "Anti-vaccine activists are seeking to expand their influence.",
        "This follows the passage of the Idaho Medical Freedom Act.",
        "The Idaho law prohibits mandatory vaccination requirements.",
        "Activists aim to replicate this legislation in other states.",
        "The movement is gaining momentum in some areas."
      ]
    }
  ]
}