{
  "updated_at": "2025-12-21T19:15:58.729Z",
  "clusters": [
    {
      "id": "cluster_9",
      "coverage": 2,
      "updated_at": "Sun, 21 Dec 2025 15:46:29 +0000",
      "title": "Waymo suspends service in San Francisco as robotaxis stall during blackout",
      "neutral_headline": "Waymo suspends service in San Francisco as robotaxis stall during blackout",
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/21/waymo-suspends-service-in-san-francisco-as-robotaxis-stall-during-blackout/",
          "published_at": "Sun, 21 Dec 2025 15:46:29 +0000",
          "title": "Waymo suspends service in San Francisco as robotaxis stall during blackout",
          "standfirst": "Waymo suspended its SF robotaxi service on Saturday evening after a massive blackout appeared to leave many of its vehicles stalled on city streets.",
          "content": "Waymo suspended its SF robotaxi service on Saturday evening after a massive blackout appeared to leave many of its vehicles stalled on city streets.",
          "feed_position": 1
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/251221/p3#a251221p3",
          "published_at": "Sun, 21 Dec 2025 01:20:10 -0500",
          "title": "Waymo says it temporarily suspended its ride-hailing service in San Francisco during a citywide blackout, as downed traffic lights appeared to halt its vehicles (Joe Rivano Barros/Mission Local)",
          "standfirst": "Joe Rivano Barros / Mission Local: Waymo says it temporarily suspended its ride-hailing service in San Francisco during a citywide blackout, as downed traffic lights appeared to halt its vehicles &mdash; Waymo said Saturday that it was stopping service across San Francisco after numerous online videos showed its autonomous vehicles &hellip;",
          "content": "Joe Rivano Barros / Mission Local: Waymo says it temporarily suspended its ride-hailing service in San Francisco during a citywide blackout, as downed traffic lights appeared to halt its vehicles &mdash; Waymo said Saturday that it was stopping service across San Francisco after numerous online videos showed its autonomous vehicles &hellip;",
          "feed_position": 8,
          "image_url": "http://www.techmeme.com/251221/i3.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/251221/i3.jpg",
      "popularity_score": 2016.508408611111
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:21:56 +0000",
      "title": "Google lobs lawsuit at search result scraping firm SerpApi",
      "neutral_headline": "Google lobs lawsuit at search result scraping firm SerpApi",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/12/google-lobs-lawsuit-at-search-result-scraping-firm-serpapi/",
          "published_at": "Fri, 19 Dec 2025 22:21:56 +0000",
          "title": "Google lobs lawsuit at search result scraping firm SerpApi",
          "standfirst": "Google says the lawsuit is its last resort.",
          "content": "Google has filed a lawsuit to protect its search results, targeting a firm called SerpApi that has turned Google’s 10 blue links into a business. According to Google, SerpApi ignores established law and Google’s terms to scrape and resell its search engine results pages (SERPs). This is not the first action against SerpApi, but Google’s decision to go after a scraper could signal a new, more aggressive stance on protecting its search data. SerpApi and similar firms do fulfill a need, but they sit in a legal gray area. Google does not provide an API for its search results, which are based on the world’s largest and most comprehensive web index. That makes Google’s SERPs especially valuable in the age of AI. A chatbot can’t summarize web links if it can’t find them, which has led companies like Perplexity to pay for SerpApi’s second-hand Google data. That prompted Reddit to file a lawsuit against SerpApi and Perplexity for grabbing its data from Google results. Google is echoing many of the things Reddit said when it publicized its lawsuit earlier this year. The search giant claims it’s not just doing this to protect itself—it’s also about protecting the websites it indexes. In Google’s blog post on the legal action, it says SerpApi “violates the choices of websites and rightsholders about who should have access to their content.”Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/google-search-yoink-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/google-search-yoink-1152x648.jpg",
      "popularity_score": 335
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Sat, 20 Dec 2025 12:15:03 +0000",
      "title": "How Europe’s new carbon tax on imported goods will change global trade",
      "neutral_headline": "How Europe’s new carbon tax on imported goods will change global trade",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/how-europes-new-carbon-tax-on-imported-goods-will-change-global-trade/",
          "published_at": "Sat, 20 Dec 2025 12:15:03 +0000",
          "title": "How Europe’s new carbon tax on imported goods will change global trade",
          "standfirst": "The new regulation arrives on New Year's Day.",
          "content": "For people living in the European Union, the price of their next car, home renovation, and even local produce may soon reflect a climate policy that many have never even heard of. This new regulation, which comes fully into force on New Year’s Day, does not just target heavy industry—it affects everyday goods which now face an added carbon cost when they enter Europe. The carbon border adjustment mechanism (CBAM) puts a carbon price on many imported goods—meaning that EU-based importers will pay for the greenhouse gases emitted during the production of certain carbon-intensive materials. If goods come from countries with weaker climate rules, then the charge will be higher. To sell to the EU, producers will effectively need to show their goods aren’t too carbon-intensive.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2192243260-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2192243260-1152x648.jpg",
      "popularity_score": 333
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 22:05:52 +0000",
      "title": "The evolution of expendability: Why some ants traded armor for numbers",
      "neutral_headline": "The evolution of expendability: Why some ants traded armor for numbers",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/the-evolution-of-expendability-why-some-ants-traded-armor-for-numbers/",
          "published_at": "Fri, 19 Dec 2025 22:05:52 +0000",
          "title": "The evolution of expendability: Why some ants traded armor for numbers",
          "standfirst": "Ants with lots of workers tend to put less energy into making them armored.",
          "content": "The trade-off between quality and quantity is a fundamental economic dilemma. Now, a team of British, American, and Japanese researchers describes how it applies to biology, as well. They have discovered that this dilemma most likely shaped the evolutionary trajectory of ants, one of Earth’s most successful groups of organisms. Their study reveals that, as ant societies grew in complexity and numbers, they didn’t just make their workers smaller—they also made them cheaper. The cost of armor In the insect world, the exoskeleton known as the cuticle serves as a protective barrier against predators, pathogens, and desiccation, while providing the structural framework for muscle attachment. But this protection comes at a price. Building a robust cuticle requires significant amounts of nitrogen and rare minerals like zinc and manganese. While skimping on armor for an individual insect may be a death sentence, the evolution of ants apparently found a way around it.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2247196489-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2247196489-1152x648.jpg",
      "popularity_score": 319
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:18:07 +0000",
      "title": "LG TVs’ unremovable Copilot shortcut is the least of smart TVs’ AI problems",
      "neutral_headline": "LG TVs’ unremovable Copilot shortcut is the least of smart TVs’ AI problems",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/lg-tvs-unremovable-copilot-shortcut-is-the-least-of-smart-tvs-ai-problems/",
          "published_at": "Fri, 19 Dec 2025 21:18:07 +0000",
          "title": "LG TVs’ unremovable Copilot shortcut is the least of smart TVs’ AI problems",
          "standfirst": "LG says it'll let people delete the Copilot icon. But TV chatbots aren't going away.",
          "content": "Online fury erupted this week after an LG TV owner claimed that a firmware update installed unremovable generative AI software on their smart TV. The controversy began on Saturday, when a Reddit user posted about the sudden appearance of a Microsoft Copilot icon on their device (something Windows users are all too familiar with). The Reddit user claimed that a “new software update installed Copilot” onto their LG TV and that it couldn’t be deleted. “Pre-installed crap is universally dogshit. If I wanted it, I’d have installed it myself eventually. The whole reason it’s bundled is because no one would choose it… Burn your television,” another Reddit user responded in the thread, which has 36,000 upvotes as of this writing.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1603701301-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1603701301-1152x648.jpg",
      "popularity_score": 308
    },
    {
      "id": "cluster_89",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 21:30:08 +0000",
      "title": "Switch 2 pub backs off Game Key Cards after leaking lower-cost cartridge options",
      "neutral_headline": "Switch 2 pub backs off Game Key Cards after leaking lower-cost cartridge options",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/cheaper-lower-capacity-switch-2-cartridges-could-mean-fewer-game-key-cards/",
          "published_at": "Fri, 19 Dec 2025 21:30:08 +0000",
          "title": "Switch 2 pub backs off Game Key Cards after leaking lower-cost cartridge options",
          "standfirst": "Inin suggests new low-cost options allowed it to \"recalculate production\" for full cartridge.",
          "content": "The Switch 2’s data-free, download-enabling Game Key Cards have proved controversial with players who worry about long-term ownership and access issues to their purchases. But they’ve remained popular with publishers that want to save production costs on a boxed Switch 2 game release, since Game Key Cards don’t include any of the expensive flash memory found on a standard Switch 2 cartridge. Now, though, at least one publisher has publicly suggested that Nintendo is offering cheaper Switch 2 cartridge options with smaller storage capacities, lowering production costs in a way that could make full cartridge releases more viable for many games on the console. Earlier this week, R-Type Dimensions III publisher Inin Games explained to customers that it couldn’t switch from Game Key Cards to a “full physical cartridge” for the retail version of the Switch 2 game without “significantly rais[ing] manufacturing costs.” Those additional costs would “force us to increase the retail price by at least €15 [about $20],” Inin Games wrote at the time.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/switch2gkc-1152x648-1766176952.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/switch2gkc-1152x648-1766176952.png",
      "popularity_score": 303
    },
    {
      "id": "cluster_96",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:27:36 +0000",
      "title": "Riot Games is making an anti-cheat change that could be rough on older PCs",
      "neutral_headline": "Riot Games is making an anti-cheat change that could be rough on older PCs",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/some-valorant-players-need-to-update-their-pc-bios-to-keep-anti-cheat-software-happy/",
          "published_at": "Fri, 19 Dec 2025 20:27:36 +0000",
          "title": "Riot Games is making an anti-cheat change that could be rough on older PCs",
          "standfirst": "BIOS checks will only affect a limited subset of Valorant players for now.",
          "content": "At this point, most competitive online multiplayer games on the PC come with some kind of kernel-level anti-cheat software. As we’ve written before, this is software that runs with more elevated privileges than most other apps and games you run on your PC, allowing it to load in earlier and detect advanced methods of cheating. More recently, anti-cheat software has started to require more Windows security features like Secure Boot, a TPM 2.0 module, and virtualization-based memory integrity protection. Riot Games, best known for titles like Valorant and League of Legends and the Vanguard anti-cheat software, has often been one of the earliest to implement new anti-cheat requirements. There’s already a long list of checks that systems need to clear before they’ll be allowed to play Riot’s games online, and now the studio is announcing a new one: a BIOS update requirement that will be imposed on “certain players” following Riot’s discovery of a UEFI bug that could allow especially dedicated and motivated cheaters to circumvent certain memory protections. In short, the bug affects the input-output memory management unit (IOMMU) “on some UEFI-based motherboards from multiple vendors.” One feature of the IOMMU is to protect system memory from direct access during boot by external hardware devices, which otherwise might manipulate the contents of your PC’s memory in ways that could enable cheating.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/riot-valorant-vanguard-1152x648-1766172890.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/riot-valorant-vanguard-1152x648-1766172890.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 20:09:30 +0000",
      "title": "Not too big, not too expensive: The Chevrolet Equinox EV",
      "neutral_headline": "Not too big, not too expensive: The Chevrolet Equinox EV",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/the-chevrolet-equinox-ev-is-high-on-comfort-and-convenience/",
          "published_at": "Fri, 19 Dec 2025 20:09:30 +0000",
          "title": "Not too big, not too expensive: The Chevrolet Equinox EV",
          "standfirst": "You get quite a lot of EV for the Equinox's sub-$35,000 starting price.",
          "content": "There’s a lot of goodwill out there for the Chevrolet Bolt. As maybe the first properly affordable longer-range electric car on the market, the Bolt wasn’t perfect. It didn’t charge very fast, and people found the seats quite uncomfortable. But it could get more than 230 miles on a single charge—a lot in 2017—and you didn’t have to be flush to afford one. Oh, and it was also pretty good to drive. I know I was a fan from the first time I tried a prototype at CES in 2016. Understandably, Bolt fans were upset when Chevy decided to kill off the car. Yes, it lacked features compared to more modern EVs, but it is also the brand‘s bestselling EV by quite a country mile. “Not to worry,” said the executives, who told us they had something better coming built on the platform they used to call Ultium but don’t anymore. Starting at around the same $35,000 price tag the Bolt launched with, this would be the new Equinox EV. That $34,995 price tag was perhaps a bit more appealing when the car was eligible for the now-dead $7,500 IRS clean vehicle tax credit. Truth be told, the LT1 spec is a little bare-boned, and you’ll need to step up to the LT2 we tested—which starts at $40,295—if you want things like heated seats or wireless charging for your devices. (The good news here is that people looking for a bargain should know that used Equinox EVs with decent specs are already much cheaper, just a year after the car’s launch.) And let’s not forget, when the Bolt was young, the more expensive trim was almost $42,000.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2024-Chevrolet-Equinox-EV-1LT-100-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2024-Chevrolet-Equinox-EV-1LT-100-1152x648.jpg",
      "popularity_score": 279
    }
  ]
}