{
  "updated_at": "2026-01-02T04:03:27.602Z",
  "clusters": [
    {
      "id": "cluster_16",
      "coverage": 2,
      "updated_at": "Thu, 01 Jan 2026 19:00:51 +0000",
      "title": "How to watch Hyundai's CES 2026 presentation live",
      "neutral_headline": "How to watch Hyundai's CES 2026 presentation live",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/transportation/how-to-watch-hyundais-ces-2026-presentation-live-190051181.html",
          "published_at": "Thu, 01 Jan 2026 19:00:51 +0000",
          "title": "How to watch Hyundai's CES 2026 presentation live",
          "standfirst": "A look at Hyundai's Holographic Windshield Display. (Hyundai) While it often feels like a full-on auto show, the car vibes feel somewhat lessened at CES 2026. Yes, the Afeela electric vehicle from the Sony-Honda joint venture will be back on the floor, but with the Trump administration yanking most EV incentives from the market, the industry isn't offering a full-court press of new vehicles in Las Vegas this year. That said, there's still plenty of in-cabin car tech on display, including Hyundai's Holographic Windshield Display. Indeed, the company's Mobis subsidiary will present \"more than 30 mobility convergence technologies\" during CES. And we'll also get to see Hyundai's AI Robotics Strategy, which will showcase its new Atlas robot fresh out of the lab. How to watch Hyundai's presentation at CES 2026 Hyundai's presentation takes place on January 5 at 4PM ET, and you can livestream it on either its HyundaiUSA YouTube channel or its global YouTube channel. We'll embed the stream here once it's available. What to expect As mentioned above, Hyundai will have its Holographic Windshield Display for viewing. It's essentially a next-gen heads-up display that projects key data from the vehicle's dash on the windshield for less distraction, and without obstructing the driver's view. It's a vertically expandable 18.1-inch large display, and passengers can even watch videos without being visible to the driver. Hyundai Mobis collaborated with German optics specialist Zeiss to develop the \"world's first system to utilize holographic film to transform the entire front windshield into an ultra-large display surface.\" It says it will begin mass production in 2029, so don't expect to see this on the market anytime soon. Beyond automotive, though, we'll also get a first-ever look at the company's new Atlas robot. In the teaser image shown in the press release, Atlas looks rather dog-like, which makes sense when you remember that Boston Dynamics was purchased by the Korean multinational back in 2020. \"This next-generation Atlas represents a tangible step toward the commercialization of AI Robotics, highlighting the Group’s commitment to building safe and adaptable robotic co-workers,\" the company said in the same press release. Hyundai said it will also discuss its other tech areas, including electronics and chassis system safety, as well as an AR head-up display, low-power display solutions and EV drive systems.This article originally appeared on Engadget at https://www.engadget.com/transportation/how-to-watch-hyundais-ces-2026-presentation-live-190051181.html?src=rss",
          "content": "A look at Hyundai's Holographic Windshield Display. (Hyundai) While it often feels like a full-on auto show, the car vibes feel somewhat lessened at CES 2026. Yes, the Afeela electric vehicle from the Sony-Honda joint venture will be back on the floor, but with the Trump administration yanking most EV incentives from the market, the industry isn't offering a full-court press of new vehicles in Las Vegas this year. That said, there's still plenty of in-cabin car tech on display, including Hyundai's Holographic Windshield Display. Indeed, the company's Mobis subsidiary will present \"more than 30 mobility convergence technologies\" during CES. And we'll also get to see Hyundai's AI Robotics Strategy, which will showcase its new Atlas robot fresh out of the lab. How to watch Hyundai's presentation at CES 2026 Hyundai's presentation takes place on January 5 at 4PM ET, and you can livestream it on either its HyundaiUSA YouTube channel or its global YouTube channel. We'll embed the stream here once it's available. What to expect As mentioned above, Hyundai will have its Holographic Windshield Display for viewing. It's essentially a next-gen heads-up display that projects key data from the vehicle's dash on the windshield for less distraction, and without obstructing the driver's view. It's a vertically expandable 18.1-inch large display, and passengers can even watch videos without being visible to the driver. Hyundai Mobis collaborated with German optics specialist Zeiss to develop the \"world's first system to utilize holographic film to transform the entire front windshield into an ultra-large display surface.\" It says it will begin mass production in 2029, so don't expect to see this on the market anytime soon. Beyond automotive, though, we'll also get a first-ever look at the company's new Atlas robot. In the teaser image shown in the press release, Atlas looks rather dog-like, which makes sense when you remember that Boston Dynamics was purchased by the Korean multinational back in 2020. \"This next-generation Atlas represents a tangible step toward the commercialization of AI Robotics, highlighting the Group’s commitment to building safe and adaptable robotic co-workers,\" the company said in the same press release. Hyundai said it will also discuss its other tech areas, including electronics and chassis system safety, as well as an AR head-up display, low-power display solutions and EV drive systems.This article originally appeared on Engadget at https://www.engadget.com/transportation/how-to-watch-hyundais-ces-2026-presentation-live-190051181.html?src=rss",
          "feed_position": 2,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/2a54c910-e5bb-11f0-9fd7-0fe99fe4214d"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-presentation-live-monday-190040380.html",
          "published_at": "Thu, 01 Jan 2026 18:01:26 +0000",
          "title": "How to watch the Hisense CES 2026 presentation live",
          "standfirst": "Xinhua News Agency via Getty Images Hisense is generally best known for its budget-friendly electronics and appliances, like TVs and refrigerators. However, at CES 2025, the China-based company showcased its high-end capabilities with a massive 136-inch micro LED TV, which has recently become available for a staggering $100,000. So what's on deck for this year's show? New leadership, for starters. The company has two new hires, including Chief Marketing Officer Sarah Larsen and Chief Commercial Officer James Fishler. In a press release, Hisense said Fishler's experience in home entertainment, appliances and HVAC is important as the company \"builds toward a milestone 2026 and its presence at CES.\" We'll give you a rundown of what to expect during Hisense's presentation and how you can watch it live. How to watch Hisense's presentation Hisense will have a livestream available on Monday, January 5 at 1PM ET on its website. We'll embed the link here once it's available. What to expect With its new hires in place, Hisense is clearly aiming to further polish its brand. Between Fishler and Larsen, the new front office is bringing to bear their experience from such high-powered competitors as LG, Samsung and Beats. And in a recent interview with Tom's Guide, Larsen emphasized a continued focus on the company's fast turnaround time from concept to market as a key differentiator for Hisense. As for actual announcements, while you can expect Hisense to tout its strength in appliances and HVAC systems (really), Larsen's aforementioned interview specifically calls out the emerging RGB TV space as a focus. We expect this year's show will be all about explaining the shades of difference between mini and micro LED display technologies, as both Samsung and LG have already thrown down pre-announcement gauntlets on the latter. Will any of them cost less than six figures? Let's hope Hisense has some good news to share on that front.This article originally appeared on Engadget at https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-presentation-live-monday-190040380.html?src=rss",
          "content": "Xinhua News Agency via Getty Images Hisense is generally best known for its budget-friendly electronics and appliances, like TVs and refrigerators. However, at CES 2025, the China-based company showcased its high-end capabilities with a massive 136-inch micro LED TV, which has recently become available for a staggering $100,000. So what's on deck for this year's show? New leadership, for starters. The company has two new hires, including Chief Marketing Officer Sarah Larsen and Chief Commercial Officer James Fishler. In a press release, Hisense said Fishler's experience in home entertainment, appliances and HVAC is important as the company \"builds toward a milestone 2026 and its presence at CES.\" We'll give you a rundown of what to expect during Hisense's presentation and how you can watch it live. How to watch Hisense's presentation Hisense will have a livestream available on Monday, January 5 at 1PM ET on its website. We'll embed the link here once it's available. What to expect With its new hires in place, Hisense is clearly aiming to further polish its brand. Between Fishler and Larsen, the new front office is bringing to bear their experience from such high-powered competitors as LG, Samsung and Beats. And in a recent interview with Tom's Guide, Larsen emphasized a continued focus on the company's fast turnaround time from concept to market as a key differentiator for Hisense. As for actual announcements, while you can expect Hisense to tout its strength in appliances and HVAC systems (really), Larsen's aforementioned interview specifically calls out the emerging RGB TV space as a focus. We expect this year's show will be all about explaining the shades of difference between mini and micro LED display technologies, as both Samsung and LG have already thrown down pre-announcement gauntlets on the latter. Will any of them cost less than six figures? Let's hope Hisense has some good news to share on that front.This article originally appeared on Engadget at https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-presentation-live-monday-190040380.html?src=rss",
          "feed_position": 3,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/834aecc0-dcf1-11f0-b7de-13a29302f310"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/how-to-watch-the-nvidia-ces-2026-press-conference-live-130028668.html",
          "published_at": "Thu, 01 Jan 2026 14:01:26 +0000",
          "title": "How to watch the NVIDIA CES 2026 presentation live",
          "standfirst": "CFOTO via Getty Images During CES 2025, we watched NVIDIA tout its leading position in the artificial intelligence arena for the bulk of the presentation. But it did reveal some new hardware, including its RTX 5000-series GPUs and Project Digits desktop supercomputer (later redubbed Spark). This year, the company's website says it's \"lighting up CES 2026 with the power of AI.\" To that end, NVIDIA is pulling out all the stops at its Vegas installation, promising hands-on demos in its booth at the Fontainebleau, replete with the \"latest NVIDIA solutions driving innovation and productivity across industries.\" But don't worry if you're not on the ground in Vegas. Here's how you can watch the livestream of the company's January 5 press conference, and what to expect from NVIDIA at CES this year. How to watch the NVIDIA CES 2026 keynote NVIDIA CEO Jensen Huang will deliver a 90-minute keynote at CES 2026. The event will be livestreamed on January 5 at 4PM ET via NVIDIA's website (and likely on YouTube as well). We'll embed the link here once it's available. What to expect NVIDIA's game plan for CES is suitably vague so far, including \"cutting-edge AI, robotics, simulation, gaming and content creation at the NVIDIA Showcase.\" It also notes there will be more than 20 demos. Although we're unsure if all of these will be shown during the keynote, we can at least expect to see them throughout the week of CES. Given NVIDIA's sky-high valuation and the fact that the health of the US and global economy seems increasingly linked to infrastructure spending on AI data centers – largely powered by chips from NVIDIA and its competitors — expect Huang's remarks to be as closely followed by Wall Street investors as technology acolytes, if not more so. Will we get any insight on a successor to the company's Blackwell chip? A more detailed look at how NVIDIA's partners are applying AI to real-world robotics? Time will tell, but you might want to keep your stock portfolio in a split screen while taking in Huang's presentation.This article originally appeared on Engadget at https://www.engadget.com/computing/how-to-watch-the-nvidia-ces-2026-press-conference-live-130028668.html?src=rss",
          "content": "CFOTO via Getty Images During CES 2025, we watched NVIDIA tout its leading position in the artificial intelligence arena for the bulk of the presentation. But it did reveal some new hardware, including its RTX 5000-series GPUs and Project Digits desktop supercomputer (later redubbed Spark). This year, the company's website says it's \"lighting up CES 2026 with the power of AI.\" To that end, NVIDIA is pulling out all the stops at its Vegas installation, promising hands-on demos in its booth at the Fontainebleau, replete with the \"latest NVIDIA solutions driving innovation and productivity across industries.\" But don't worry if you're not on the ground in Vegas. Here's how you can watch the livestream of the company's January 5 press conference, and what to expect from NVIDIA at CES this year. How to watch the NVIDIA CES 2026 keynote NVIDIA CEO Jensen Huang will deliver a 90-minute keynote at CES 2026. The event will be livestreamed on January 5 at 4PM ET via NVIDIA's website (and likely on YouTube as well). We'll embed the link here once it's available. What to expect NVIDIA's game plan for CES is suitably vague so far, including \"cutting-edge AI, robotics, simulation, gaming and content creation at the NVIDIA Showcase.\" It also notes there will be more than 20 demos. Although we're unsure if all of these will be shown during the keynote, we can at least expect to see them throughout the week of CES. Given NVIDIA's sky-high valuation and the fact that the health of the US and global economy seems increasingly linked to infrastructure spending on AI data centers – largely powered by chips from NVIDIA and its competitors — expect Huang's remarks to be as closely followed by Wall Street investors as technology acolytes, if not more so. Will we get any insight on a successor to the company's Blackwell chip? A more detailed look at how NVIDIA's partners are applying AI to real-world robotics? Time will tell, but you might want to keep your stock portfolio in a split screen while taking in Huang's presentation.This article originally appeared on Engadget at https://www.engadget.com/computing/how-to-watch-the-nvidia-ces-2026-press-conference-live-130028668.html?src=rss",
          "feed_position": 6,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/b0333b00-dcee-11f0-a993-97c527ebca4b"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/social-media/in-2025-quitting-social-media-felt-easier-than-ever-140000374.html",
          "published_at": "Thu, 01 Jan 2026 14:00:00 +0000",
          "title": "In 2025, quitting social media felt easier than ever",
          "standfirst": "For a tech writer, being very offline is sort of like being a marathon coach who doesn’t run. So in 2025, I tried to reverse years of studied avoidance towards the most ubiquitous technological phenomenon on earth — I got back on social media. The change was short-lived. My first exodus from the feeds took some work — disabling notifications, removing apps from my homescreen and then deleting accounts entirely. This time, the phone put itself down. The whole thing has simply lost its luster.I started with Instagram. Every experience went like this: I’d see a single post from one of the rare family members or IRL friends who are active on the platform. Next, I was fed a sponsored post, followed by suggestions to follow randos. After that, a series of influencer videos that, admittedly, appeal to my taste (funny/absurdist women and dissertations on urban planning). That was followed up with more sponsored posts, mostly from brands I’d looked up for work. Then it’d circle back to the influencers. My eyes glazed over and I tossed the phone aside. Years back, the platform gave off a jolt of quasi-social connection that I’d spend hours sucking up. I fed on pointless thoughts from an ex-coworker, vacation reels from a college roommate, a half-baked loaf of bread that an old friend dropped on the floor but took a picture of anyway. Now it’s a bare sliver of that stuff, shoehorned between towers of sponsored content and posts from people who make or promote their living on Instagram. The real people have left. The connection is gone. The FOMO is no more. I experienced some variation of the same disappointment on every platform I rejoined. When I got back on TikTok a few months after the ban, it felt like a frenzied shopping mall. Every video seems to be about four seconds long and most are promotional and/or shoppable. YouTube Shorts is drowning in AI-generated videos, and I don’t hit up social media to watch fake footage of desperate wild animal babies clambering onto the boats of helpful humans. My life has no need for simulated toddlers admonishing their pets. Occasionally, I’d hit on something compelling: a clip from late night TV, a stupidly decadent dessert recipe, people from other countries explaining cultural subtleties. But for me, these social media platforms are no longer velcro for the eyes. I remember losing focus, spending long hours on YouTube Shorts and IG. I’d look up bleary-eyed and shame-faced after hours scrolling TikTok’s For You Page. Now, after a few minutes, a bored ickiness sets in. I feel like I’m trapped in a carnival of bots hawking shampoo at me and I just want to go home. It’s not a mystery how or why things feel different; The answer is always money. These billion- and trillion-dollar companies have shareholders who prize year-over-year performance over anything else. So we get more sponsored posts on Instagram. TikTok purposefully, enthusiastically overloads itself with shoppable content (which isn’t going to change no matter who owns it). YouTube is obsessed with engagement so it ends up rewarding people who flood the platform with AI slop. These platforms aren’t about human connections and the spread of creativity — the stuff that used to draw me in — they’re thinly varnished ecommerce sites sprinkled with brute-forced AI oddities. I’d be sadder about the whole thing if I thought it could be any different. These companies are among the most valuable in the world. The fact that I can’t connect with my fellow common people using their services is not surprising. The change isn’t even driving everyone away. Instagram reported more users than ever this year, to the tune of 35 percent of the planet. Billions of users still scroll TikTok and watch YouTube Shorts. So maybe it’s just a me thing. And I have options. Over-monetization may have made me not want to engage with a few social media behemoths, but things aren’t so dire everywhere. Bluesky reminds me of Twitter before X. I take comfort in seeing posts that prove most people are as dismayed as I am over a government and wider economic system that are nakedly uninterested in serving the public. The hot takes aren’t quite as funny as they were on Twitter years back — maybe it’s just all been said before or perhaps things have gotten too dire for levity. I still don’t end up spending a lot of time on the platform, however. It’s not as weird as it was before the defection and I get tired of the stream of news headlines contextualized with tut-tutting and handwringing — I’m perfectly capable of doing that myself. It’d be easy to say that social media just isn’t my thing, but that’s not true because I can’t quit Reddit — the shining exception to my social media ennui. It feels filled with actual people. Ads exist, but in a subdued, manageable way. And every contributor, commenter and moderator I’ve come across on the app is militantly vigilant against the onslaught of artificially generated content. I also like the organizational structure. I know my Home tab will only expose me to my chosen subs and I derive great joy from happy cows, greeble-chasing cats, enigmatic night feelings and freaky abandoned spaces. I use my local subreddit r/Albuquerque daily to answer questions and keep tabs on the world (directly) around me. Sadly, Reddit is an outlier, a misfit exception to the rule, and now that it’s gone public, it may follow a similar monetization push. Bluesky is tiny, new and not yet profitable, so who knows where its financial journey will lead it (though the “world without Caesars” shirt gives us some hope). There’s something lamentable about the loss of the connections we gleaned from platforms that were once compelling, engrossing and rife with the creativity of our fellow humans. Ultimately, any public-facing company that prioritizes profits over everything else has no incentive to look out for its users. So I don’t expect any of the larger social platforms to pull back on their monetization marches. For now, I’ve decided I’m comfortable with my admittedly narrow interaction with the world of social media. As a Gen-Xer, online-first wasn’t how my relationship to the world started out. And I’m pretty confident I know enough about other tech-related stuff to be useful to my editors and readers without a black belt in social. (Ed. note: She is.) Besides, Karissa’s got us covered. This article originally appeared on Engadget at https://www.engadget.com/social-media/in-2025-quitting-social-media-felt-easier-than-ever-140000374.html?src=rss",
          "content": "For a tech writer, being very offline is sort of like being a marathon coach who doesn’t run. So in 2025, I tried to reverse years of studied avoidance towards the most ubiquitous technological phenomenon on earth — I got back on social media. The change was short-lived. My first exodus from the feeds took some work — disabling notifications, removing apps from my homescreen and then deleting accounts entirely. This time, the phone put itself down. The whole thing has simply lost its luster.I started with Instagram. Every experience went like this: I’d see a single post from one of the rare family members or IRL friends who are active on the platform. Next, I was fed a sponsored post, followed by suggestions to follow randos. After that, a series of influencer videos that, admittedly, appeal to my taste (funny/absurdist women and dissertations on urban planning). That was followed up with more sponsored posts, mostly from brands I’d looked up for work. Then it’d circle back to the influencers. My eyes glazed over and I tossed the phone aside. Years back, the platform gave off a jolt of quasi-social connection that I’d spend hours sucking up. I fed on pointless thoughts from an ex-coworker, vacation reels from a college roommate, a half-baked loaf of bread that an old friend dropped on the floor but took a picture of anyway. Now it’s a bare sliver of that stuff, shoehorned between towers of sponsored content and posts from people who make or promote their living on Instagram. The real people have left. The connection is gone. The FOMO is no more. I experienced some variation of the same disappointment on every platform I rejoined. When I got back on TikTok a few months after the ban, it felt like a frenzied shopping mall. Every video seems to be about four seconds long and most are promotional and/or shoppable. YouTube Shorts is drowning in AI-generated videos, and I don’t hit up social media to watch fake footage of desperate wild animal babies clambering onto the boats of helpful humans. My life has no need for simulated toddlers admonishing their pets. Occasionally, I’d hit on something compelling: a clip from late night TV, a stupidly decadent dessert recipe, people from other countries explaining cultural subtleties. But for me, these social media platforms are no longer velcro for the eyes. I remember losing focus, spending long hours on YouTube Shorts and IG. I’d look up bleary-eyed and shame-faced after hours scrolling TikTok’s For You Page. Now, after a few minutes, a bored ickiness sets in. I feel like I’m trapped in a carnival of bots hawking shampoo at me and I just want to go home. It’s not a mystery how or why things feel different; The answer is always money. These billion- and trillion-dollar companies have shareholders who prize year-over-year performance over anything else. So we get more sponsored posts on Instagram. TikTok purposefully, enthusiastically overloads itself with shoppable content (which isn’t going to change no matter who owns it). YouTube is obsessed with engagement so it ends up rewarding people who flood the platform with AI slop. These platforms aren’t about human connections and the spread of creativity — the stuff that used to draw me in — they’re thinly varnished ecommerce sites sprinkled with brute-forced AI oddities. I’d be sadder about the whole thing if I thought it could be any different. These companies are among the most valuable in the world. The fact that I can’t connect with my fellow common people using their services is not surprising. The change isn’t even driving everyone away. Instagram reported more users than ever this year, to the tune of 35 percent of the planet. Billions of users still scroll TikTok and watch YouTube Shorts. So maybe it’s just a me thing. And I have options. Over-monetization may have made me not want to engage with a few social media behemoths, but things aren’t so dire everywhere. Bluesky reminds me of Twitter before X. I take comfort in seeing posts that prove most people are as dismayed as I am over a government and wider economic system that are nakedly uninterested in serving the public. The hot takes aren’t quite as funny as they were on Twitter years back — maybe it’s just all been said before or perhaps things have gotten too dire for levity. I still don’t end up spending a lot of time on the platform, however. It’s not as weird as it was before the defection and I get tired of the stream of news headlines contextualized with tut-tutting and handwringing — I’m perfectly capable of doing that myself. It’d be easy to say that social media just isn’t my thing, but that’s not true because I can’t quit Reddit — the shining exception to my social media ennui. It feels filled with actual people. Ads exist, but in a subdued, manageable way. And every contributor, commenter and moderator I’ve come across on the app is militantly vigilant against the onslaught of artificially generated content. I also like the organizational structure. I know my Home tab will only expose me to my chosen subs and I derive great joy from happy cows, greeble-chasing cats, enigmatic night feelings and freaky abandoned spaces. I use my local subreddit r/Albuquerque daily to answer questions and keep tabs on the world (directly) around me. Sadly, Reddit is an outlier, a misfit exception to the rule, and now that it’s gone public, it may follow a similar monetization push. Bluesky is tiny, new and not yet profitable, so who knows where its financial journey will lead it (though the “world without Caesars” shirt gives us some hope). There’s something lamentable about the loss of the connections we gleaned from platforms that were once compelling, engrossing and rife with the creativity of our fellow humans. Ultimately, any public-facing company that prioritizes profits over everything else has no incentive to look out for its users. So I don’t expect any of the larger social platforms to pull back on their monetization marches. For now, I’ve decided I’m comfortable with my admittedly narrow interaction with the world of social media. As a Gen-Xer, online-first wasn’t how my relationship to the world started out. And I’m pretty confident I know enough about other tech-related stuff to be useful to my editors and readers without a black belt in social. (Ed. note: She is.) Besides, Karissa’s got us covered. This article originally appeared on Engadget at https://www.engadget.com/social-media/in-2025-quitting-social-media-felt-easier-than-ever-140000374.html?src=rss",
          "feed_position": 7
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/how-to-watch-the-bosch-ces-2026-press-conference-live-130020898.html",
          "published_at": "Thu, 01 Jan 2026 13:00:20 +0000",
          "title": "How to watch the Bosch CES 2026 press conference live",
          "standfirst": "You may know Bosch as a home appliance brand (via its partnership with Siemens), but the German multinational is generally more focused on providing underlying technology and engineering solutions to auto, home and manufacturing partners across the globe. It's fitting, then, that much of what it's showing off at CES 2026 is more intended to be licensed to other companies versus Bosch-branded products you'll be seeing on store shelves. Case in point is Bosch's automotive plans at CES. The company will present \"AI in the car,\" or more specifically, in the cockpit of the car. \"Bosch's AI-powered cockpit makes driving more comfortable, intuitive, and safer for all occupants,\" Bosch board member Markus Heyn said in a press release. We'll get into all the details below, as well as how to tune in to the press conference on Monday. How to watch Bosch's CES 2026 presentation You can livestream the event on Monday, January 5 at 12PM ET via the Bosch press page. (If the stream is embeddable, we'll also include it here.) What to expect Bosch will be setting up shop in the Central Hall of the Las Vegas Convention Center (booth 16203), where the company will be focusing on its three big themes — mobility, smart home integrations and manufacturing — all of which will include hardware, software and AI solutions. Like many other CES 2026 exhibitors, look for Bosch to emphasize its partnerships with the big dogs of the AI space at the show. For instance, that AI-powered car cockpit mentioned above will feature integrations with both Microsoft and NVIDIA. For instance, Bosch is touting the ability to use voice commands to join a Teams call, while the car's system will automatically activate adaptive cruise control. And it's noting that NVIDIA's software suites will help manage \"real-time sensor processing and vision-language models.\" Here's a glimpse of what the booth will look like: This article originally appeared on Engadget at https://www.engadget.com/ai/how-to-watch-the-bosch-ces-2026-press-conference-live-130020898.html?src=rss",
          "content": "You may know Bosch as a home appliance brand (via its partnership with Siemens), but the German multinational is generally more focused on providing underlying technology and engineering solutions to auto, home and manufacturing partners across the globe. It's fitting, then, that much of what it's showing off at CES 2026 is more intended to be licensed to other companies versus Bosch-branded products you'll be seeing on store shelves. Case in point is Bosch's automotive plans at CES. The company will present \"AI in the car,\" or more specifically, in the cockpit of the car. \"Bosch's AI-powered cockpit makes driving more comfortable, intuitive, and safer for all occupants,\" Bosch board member Markus Heyn said in a press release. We'll get into all the details below, as well as how to tune in to the press conference on Monday. How to watch Bosch's CES 2026 presentation You can livestream the event on Monday, January 5 at 12PM ET via the Bosch press page. (If the stream is embeddable, we'll also include it here.) What to expect Bosch will be setting up shop in the Central Hall of the Las Vegas Convention Center (booth 16203), where the company will be focusing on its three big themes — mobility, smart home integrations and manufacturing — all of which will include hardware, software and AI solutions. Like many other CES 2026 exhibitors, look for Bosch to emphasize its partnerships with the big dogs of the AI space at the show. For instance, that AI-powered car cockpit mentioned above will feature integrations with both Microsoft and NVIDIA. For instance, Bosch is touting the ability to use voice commands to join a Teams call, while the car's system will automatically activate adaptive cruise control. And it's noting that NVIDIA's software suites will help manage \"real-time sensor processing and vision-language models.\" Here's a glimpse of what the booth will look like: This article originally appeared on Engadget at https://www.engadget.com/ai/how-to-watch-the-bosch-ces-2026-press-conference-live-130020898.html?src=rss",
          "feed_position": 8
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/smart-home/best-smart-scale-160033523.html",
          "published_at": "Thu, 01 Jan 2026 10:00:37 +0000",
          "title": "The best smart scales for 2026",
          "standfirst": "If you are trying to stay on top of your health this year, a smart scale can make the process feel more manageable. These devices log details like body fat, muscle mass and water levels, then sync everything to your phone so you can see patterns instead of guessing. It is an easy way to track changes and stay motivated between workouts or check-ins with your doctor.Some smart scales keep things simple and focus on just your data, while others tie into big fitness platforms or support multiple users under one roof. With so many choices, we pulled together the best smart scales to help you find one that fits your goals and your budget. Table of contents Smart scale safety Best smart scales for 2026 What to look for in a smart scale How we tested and which smart scales we tested Smart scales FAQs Smart scale safety There are valid reasons to weigh yourself but your self-worth shouldn’t be defined by what number shows up between your feet. If you’re looking to alter your body shape, that figure could go up as your waistline goes down since muscle weighs more than fat. Some scales go further by providing additional metrics like visceral fat levels, giving you a more comprehensive picture of your health. Dr. Anne Swift, Director of Public Health teaching at the University of Cambridge, said “weighing yourself too often can result in [you] becoming fixated on small fluctuations day-to-day rather than the overall trend over time.” Swift added “it’s sometimes better to focus on how clothes fit, or how you feel, rather than your weight.” A meta-analysis from 2016 found there may be some negative psychological impact from self weighing. A 2018 study, however, said there may be a positive correlation between regular weigh-ins and accelerated weight loss. It can be a minefield and I’d urge you to take real care of yourself and remember success won’t happen overnight. Best smart scales for 2026 What to look for in a smart scale Weight A scale that measures weight is probably the top requirement, right? Whether you're after a basic weight scale or a full-featured body fat scale, bear in mind, with all these measurements, the readings won’t be as accurate as a calibrated clinical scale. It’s better to focus on the overall trend, up or down over time, rather than a single measurement in isolation. Scales offering high-precision measurements can help, especially if you’re looking at the data to inform a specific health or fitness goal. Connectivity Before you buy your scale, work out how you’re planning on weighing yourself and when, as it is an issue. Some lower-end smart bathroom scales connect via Bluetooth and have no internal storage, so if you don’t have your phone to hand, it won’t record your weight. If your scale has Wi-Fi, then your scale can post the data to a server, letting you access them from any compatible device. Also, you should be mindful that some smart scales aren’t built with security in mind, so there’s a small risk to your privacy should your scale be compromised. Bone density The stronger your bones are, the less risk you have of breaks and osteoporosis — common concerns as you get older. Clinical bone density tests use low-power x-rays and some scales can offer you an at-home approximation. These bone mass tests pass a small electrical current through your feet, measuring the resistance as it completes its journey. The resistance offered by bones, fat and muscle are all different, letting your scale identify the difference. A body composition monitor often includes this feature, too, providing a detailed breakdown of bone density, fat and muscle mass. Body fat percentage and muscle mass Fat and muscle are necessary parts of our makeup, but too much of either can be problematic. Much like bone density, a body composition measurement feature can monitor your body fat and muscle mass percentages using Bioelectrical Impedance Analysis (BIA). This measurement tests how well your body resists an electrical signal passing through your body. (It’s a rough rule of thumb you should have a 30/70 percent split between fat and muscle, but please consult a medical professional for figures specific to your own body and medical needs.) For those with specific athletic goals, smart scales offer an athlete mode to better tailor readings for accuracy. If body fat monitoring is a priority, look for a model marketed as a body fat scale. BMI A lot of scales offer a BMI calculation, and it’s easy to do since you just plot height and weight on a set graph line. Body Mass Index is, however, a problematic measurement that its critics say is both overly simplistic and often greatly misleading. Unfortunately, it’s also one of the most common clinical body metrics and medical professionals will use it to make judgements about your care. Pulse Wave Velocity French health-tech company Withings has offered Pulse Wave Velocity (PWV) on its flagship scale for some time, although regulatory concerns meant it was withdrawn for a period. It’s a measurement of arterial stiffness, which acts as a marker both of cardiovascular risk and other health conditions. For those looking for an even deeper understanding of their health, some scales now offer a body scan, which provides more advanced metrics such as segmental body composition and vascular health insights. Wearables and integration Pairing your smart scale with wearables like fitness trackers or smartwatches can further enhance your health-tracking ecosystem. Many smart scales sync directly with platforms like Fitbit or Apple Health, making it easier to track trends and analyze your data in one place. Display Less a specification and more a note: Smart bathroom scales have displays ranging from pre-printed LCDs or digital dot matrix layouts through to color display screens. On the high end, your scale display can show you trending charts for your weight and other vital statistics, and can even tell you the day’s weather. If you are short-sighted, and plan on weighing yourself first thing in the morning, before you’ve found your glasses or contacts, opt for a big, clear, high-contrast display. App and subscriptions You’ll spend most of your time looking at your health data through its companion scales app, and it’s vital you get a good one. This includes a clear, clean layout with powerful tools to visualize your progress and analyze your data to look for places you can improve. Given that you often don’t need to buy anything before trying the app, it’s worth testing one or two to see if you vibe with it. It’s also important you check app compatibility before making your purchase. Some health apps will only work with iOS or Android — not both. Apple Watch connectivity can also be a bonus for tracking workouts and health metrics seamlessly. Several companies also offer premium subscriptions, unlocking other features – including insights and coaching – to go along with your hardware. Data portability Using the same scale or app platform for years at a time means you’ll build up a massive trove of personal data. And it is (or should be), your right to take that data to another provider if you choose to move platforms in the future. Data portability is, however, a minefield, with different platforms offering wildly different options, making it easy (or hard) to go elsewhere. All of the devices in this round-up will allow you to export your data to a .CSV file, which you can then do with as you wish. Importing this information is trickier, with Withings and Garmin allowing it, and Omron, Xiaomi, Eufy and Fitbit not making it that easy. (Apps that engage with Apple Health, meanwhile, can output all of your health data in a .XML file.) Power It’s not a huge issue but one worth bearing in mind that each scale will either run disposable batteries (most commonly 4xAAA) or with its own, built-in battery pack. Either choice adds an environmental and financial cost to your scale’s life — either with regular purchases of fresh cells or the potential for the whole unit to become waste when the battery pack fails. How we tested and which smart scales we tested For this guide, I tested six scales from major manufacturers: Mi (Xiaomi) Body Composition Scale 2 Our cheapest model, Xiaomi / Mi’s Body Composition Scale 2 is as bare-bones as you can get, and it shows. It often takes a long while to lock on to get your body weight, and when it does you’ll have to delve into the Zepp Life-branded scales app in order to look at your extra data. But you can’t fault it for the basics, offering limited (but accurate) weight measurements and body composition for less than the price of a McDonald’s for four. Fitbit Aira Air Fitbit, now part of Google, is the household name for fitness trackers and smartwatches in the US, right? If not, then it must be at least halfway synonymous with it. The Aria Air is the company’s stripped-to-the-bare bones scale, offering your weight and a few other health metrics, but you can trust that Fitbit got the basics right. Not to mention that most of the reason for buying a Fitbit product is to leverage its fitness app anyway. Anker Eufy Smart Scale P2 Pro Eufy’s Smart Scale P2 Pro has plenty of things to commend it – the price, the overall look and feel (it’s a snazzy piece of kit) and what it offers. It offers a whole host of in-depth functionality, including Body Fat, Muscle Mass, Water Weight, Body Fat Mass and Bone Mass measurements, as well as calculating things like your Heart Rate and Basal Metabolic Rate (the amount of calories you need to eat a day to not change weight at all) all from inside its app. In fact, buried beneath the friendly graphic, the scale offers a big pile of stats and data that should, I think, give you more than a little coaching on how to improve your overall health. It’s worth noting that Anker – Eufy’s parent company – was identified as having misled users, and the media, about the security of its products a few years back. Its Eufy-branded security cameras, which the company says does not broadcast video outside of your local network, was found to be allowing third parties to access streams online. Consequently, while we have praised the Eufy Smart Scale for its own features, we cannot recommend it without a big caveat. Omron BCM-500 Body Composition and Scale with Bluetooth Given its role in making actual medical devices, you know what you’re getting with an Omron product. A solid, reliable, sturdy, strong (checks the dictionary for more synonyms) dependable piece of kit. There’s no romance or excitement on show, but you can trust that however joyless it may be, it’ll do the job in question and will be user-friendly. The hardware is limited, the app is limited, but it certainly (checks synonyms again) is steady. Joking aside, Omron’s Connect app is as bare-bones as you can get, since it acts as an interface for so many of its products. Scroll over to the Weight page, and you’ll get your weight and BMI reading, and if you’ve set a fitness goal, you can see how far you’ve got to go to reach it. You can also switch to seeing a trend graph which, again, offers the most basic visualization of your workouts and progress. Garmin Index S2 Garmin’s got a pretty massive fitness ecosystem of its own, so if you’re already part of that world, its smart scale is a no-brainer. On one hand, the scale is one of the easiest to use, and most luxurious of the bunch, with its color screen and sleek design. I’m also a big fan of the wealth of data and different metrics the scale throws at you – you can see a full color graph charting your weight measurements and goal progress, and the various metrics it tracks in good detail. If there’s a downside, it’s that Garmin’s setup won’t hold your hand, since it’s for serious fitness people, not newbies. Withings Body Comp At the highest end, Withings’ flagship Body Comp is luxurious, and luxuriously priced, a figure I’d consider to be “too much” to spend on a bathroom scale. For your money, however, you’ll get a fairly comprehensive rundown of body composition metrics including your weight, body fat percentage, vascular age, pulse wave velocity and electrodermal activity. Its monochrome dot matrix display may not be as swish as the Garmin’s, but it refreshes pretty quickly and feels very in-keeping with the hardware’s overall sleek look. Withings Body Scan If you want to flaunt your cash, you don’t buy a car, you buy a supercar, or a hypercar if you’re flush enough. What then, do we call Withings’ $400 Body Scan if not a super-smart scale, or a hyper-smart scale? As well as doing everything the Body Comp does, plus running a six-lead ECG, segmented body composition, and will even check for neuropathy in your feet. It is the best scale I’ve ever used, it is also the most expensive, and I suspect it’s too much device for almost everyone who’d consider buying one. Smart scales FAQs What's the difference between a smart scale and a regular scale? A regular scale is pretty straightforward — it tells you how much you weigh, and that’s usually it. A smart scale, on the other hand, does much more. Not only does it give you your weight measurements, but it can also track things like your body fat percentage, muscle mass, and even your BMI. Some smart scales even monitor more advanced metrics like bone density, depending on the model. What’s even better is that smart scales sync with scales apps on your phone using Wi-Fi or Bluetooth, so you can see all your health data in one place. This lets you monitor trends over time, like if your muscle mass is increasing or your body fat percentage decreasing. How do smart scales work with more than one person using it? When more than one person in a household uses the smart scale, it usually recognizes each person by their weight range and other body measurements (like body fat percentage). Most smart scales allow you to set up individual profiles in the companion app, and once your profile is linked, the scale can automatically figure out who’s standing on it. Let’s say you and a family member have fairly different weights — the scale will easily know who’s who based on that. But if you and someone else have similar weights, it might ask you to confirm the profile on your phone after the weigh-in. Some scales even let you assign a profile manually in the scales app if it’s not sure.This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/best-smart-scale-160033523.html?src=rss",
          "content": "If you are trying to stay on top of your health this year, a smart scale can make the process feel more manageable. These devices log details like body fat, muscle mass and water levels, then sync everything to your phone so you can see patterns instead of guessing. It is an easy way to track changes and stay motivated between workouts or check-ins with your doctor.Some smart scales keep things simple and focus on just your data, while others tie into big fitness platforms or support multiple users under one roof. With so many choices, we pulled together the best smart scales to help you find one that fits your goals and your budget. Table of contents Smart scale safety Best smart scales for 2026 What to look for in a smart scale How we tested and which smart scales we tested Smart scales FAQs Smart scale safety There are valid reasons to weigh yourself but your self-worth shouldn’t be defined by what number shows up between your feet. If you’re looking to alter your body shape, that figure could go up as your waistline goes down since muscle weighs more than fat. Some scales go further by providing additional metrics like visceral fat levels, giving you a more comprehensive picture of your health. Dr. Anne Swift, Director of Public Health teaching at the University of Cambridge, said “weighing yourself too often can result in [you] becoming fixated on small fluctuations day-to-day rather than the overall trend over time.” Swift added “it’s sometimes better to focus on how clothes fit, or how you feel, rather than your weight.” A meta-analysis from 2016 found there may be some negative psychological impact from self weighing. A 2018 study, however, said there may be a positive correlation between regular weigh-ins and accelerated weight loss. It can be a minefield and I’d urge you to take real care of yourself and remember success won’t happen overnight. Best smart scales for 2026 What to look for in a smart scale Weight A scale that measures weight is probably the top requirement, right? Whether you're after a basic weight scale or a full-featured body fat scale, bear in mind, with all these measurements, the readings won’t be as accurate as a calibrated clinical scale. It’s better to focus on the overall trend, up or down over time, rather than a single measurement in isolation. Scales offering high-precision measurements can help, especially if you’re looking at the data to inform a specific health or fitness goal. Connectivity Before you buy your scale, work out how you’re planning on weighing yourself and when, as it is an issue. Some lower-end smart bathroom scales connect via Bluetooth and have no internal storage, so if you don’t have your phone to hand, it won’t record your weight. If your scale has Wi-Fi, then your scale can post the data to a server, letting you access them from any compatible device. Also, you should be mindful that some smart scales aren’t built with security in mind, so there’s a small risk to your privacy should your scale be compromised. Bone density The stronger your bones are, the less risk you have of breaks and osteoporosis — common concerns as you get older. Clinical bone density tests use low-power x-rays and some scales can offer you an at-home approximation. These bone mass tests pass a small electrical current through your feet, measuring the resistance as it completes its journey. The resistance offered by bones, fat and muscle are all different, letting your scale identify the difference. A body composition monitor often includes this feature, too, providing a detailed breakdown of bone density, fat and muscle mass. Body fat percentage and muscle mass Fat and muscle are necessary parts of our makeup, but too much of either can be problematic. Much like bone density, a body composition measurement feature can monitor your body fat and muscle mass percentages using Bioelectrical Impedance Analysis (BIA). This measurement tests how well your body resists an electrical signal passing through your body. (It’s a rough rule of thumb you should have a 30/70 percent split between fat and muscle, but please consult a medical professional for figures specific to your own body and medical needs.) For those with specific athletic goals, smart scales offer an athlete mode to better tailor readings for accuracy. If body fat monitoring is a priority, look for a model marketed as a body fat scale. BMI A lot of scales offer a BMI calculation, and it’s easy to do since you just plot height and weight on a set graph line. Body Mass Index is, however, a problematic measurement that its critics say is both overly simplistic and often greatly misleading. Unfortunately, it’s also one of the most common clinical body metrics and medical professionals will use it to make judgements about your care. Pulse Wave Velocity French health-tech company Withings has offered Pulse Wave Velocity (PWV) on its flagship scale for some time, although regulatory concerns meant it was withdrawn for a period. It’s a measurement of arterial stiffness, which acts as a marker both of cardiovascular risk and other health conditions. For those looking for an even deeper understanding of their health, some scales now offer a body scan, which provides more advanced metrics such as segmental body composition and vascular health insights. Wearables and integration Pairing your smart scale with wearables like fitness trackers or smartwatches can further enhance your health-tracking ecosystem. Many smart scales sync directly with platforms like Fitbit or Apple Health, making it easier to track trends and analyze your data in one place. Display Less a specification and more a note: Smart bathroom scales have displays ranging from pre-printed LCDs or digital dot matrix layouts through to color display screens. On the high end, your scale display can show you trending charts for your weight and other vital statistics, and can even tell you the day’s weather. If you are short-sighted, and plan on weighing yourself first thing in the morning, before you’ve found your glasses or contacts, opt for a big, clear, high-contrast display. App and subscriptions You’ll spend most of your time looking at your health data through its companion scales app, and it’s vital you get a good one. This includes a clear, clean layout with powerful tools to visualize your progress and analyze your data to look for places you can improve. Given that you often don’t need to buy anything before trying the app, it’s worth testing one or two to see if you vibe with it. It’s also important you check app compatibility before making your purchase. Some health apps will only work with iOS or Android — not both. Apple Watch connectivity can also be a bonus for tracking workouts and health metrics seamlessly. Several companies also offer premium subscriptions, unlocking other features – including insights and coaching – to go along with your hardware. Data portability Using the same scale or app platform for years at a time means you’ll build up a massive trove of personal data. And it is (or should be), your right to take that data to another provider if you choose to move platforms in the future. Data portability is, however, a minefield, with different platforms offering wildly different options, making it easy (or hard) to go elsewhere. All of the devices in this round-up will allow you to export your data to a .CSV file, which you can then do with as you wish. Importing this information is trickier, with Withings and Garmin allowing it, and Omron, Xiaomi, Eufy and Fitbit not making it that easy. (Apps that engage with Apple Health, meanwhile, can output all of your health data in a .XML file.) Power It’s not a huge issue but one worth bearing in mind that each scale will either run disposable batteries (most commonly 4xAAA) or with its own, built-in battery pack. Either choice adds an environmental and financial cost to your scale’s life — either with regular purchases of fresh cells or the potential for the whole unit to become waste when the battery pack fails. How we tested and which smart scales we tested For this guide, I tested six scales from major manufacturers: Mi (Xiaomi) Body Composition Scale 2 Our cheapest model, Xiaomi / Mi’s Body Composition Scale 2 is as bare-bones as you can get, and it shows. It often takes a long while to lock on to get your body weight, and when it does you’ll have to delve into the Zepp Life-branded scales app in order to look at your extra data. But you can’t fault it for the basics, offering limited (but accurate) weight measurements and body composition for less than the price of a McDonald’s for four. Fitbit Aira Air Fitbit, now part of Google, is the household name for fitness trackers and smartwatches in the US, right? If not, then it must be at least halfway synonymous with it. The Aria Air is the company’s stripped-to-the-bare bones scale, offering your weight and a few other health metrics, but you can trust that Fitbit got the basics right. Not to mention that most of the reason for buying a Fitbit product is to leverage its fitness app anyway. Anker Eufy Smart Scale P2 Pro Eufy’s Smart Scale P2 Pro has plenty of things to commend it – the price, the overall look and feel (it’s a snazzy piece of kit) and what it offers. It offers a whole host of in-depth functionality, including Body Fat, Muscle Mass, Water Weight, Body Fat Mass and Bone Mass measurements, as well as calculating things like your Heart Rate and Basal Metabolic Rate (the amount of calories you need to eat a day to not change weight at all) all from inside its app. In fact, buried beneath the friendly graphic, the scale offers a big pile of stats and data that should, I think, give you more than a little coaching on how to improve your overall health. It’s worth noting that Anker – Eufy’s parent company – was identified as having misled users, and the media, about the security of its products a few years back. Its Eufy-branded security cameras, which the company says does not broadcast video outside of your local network, was found to be allowing third parties to access streams online. Consequently, while we have praised the Eufy Smart Scale for its own features, we cannot recommend it without a big caveat. Omron BCM-500 Body Composition and Scale with Bluetooth Given its role in making actual medical devices, you know what you’re getting with an Omron product. A solid, reliable, sturdy, strong (checks the dictionary for more synonyms) dependable piece of kit. There’s no romance or excitement on show, but you can trust that however joyless it may be, it’ll do the job in question and will be user-friendly. The hardware is limited, the app is limited, but it certainly (checks synonyms again) is steady. Joking aside, Omron’s Connect app is as bare-bones as you can get, since it acts as an interface for so many of its products. Scroll over to the Weight page, and you’ll get your weight and BMI reading, and if you’ve set a fitness goal, you can see how far you’ve got to go to reach it. You can also switch to seeing a trend graph which, again, offers the most basic visualization of your workouts and progress. Garmin Index S2 Garmin’s got a pretty massive fitness ecosystem of its own, so if you’re already part of that world, its smart scale is a no-brainer. On one hand, the scale is one of the easiest to use, and most luxurious of the bunch, with its color screen and sleek design. I’m also a big fan of the wealth of data and different metrics the scale throws at you – you can see a full color graph charting your weight measurements and goal progress, and the various metrics it tracks in good detail. If there’s a downside, it’s that Garmin’s setup won’t hold your hand, since it’s for serious fitness people, not newbies. Withings Body Comp At the highest end, Withings’ flagship Body Comp is luxurious, and luxuriously priced, a figure I’d consider to be “too much” to spend on a bathroom scale. For your money, however, you’ll get a fairly comprehensive rundown of body composition metrics including your weight, body fat percentage, vascular age, pulse wave velocity and electrodermal activity. Its monochrome dot matrix display may not be as swish as the Garmin’s, but it refreshes pretty quickly and feels very in-keeping with the hardware’s overall sleek look. Withings Body Scan If you want to flaunt your cash, you don’t buy a car, you buy a supercar, or a hypercar if you’re flush enough. What then, do we call Withings’ $400 Body Scan if not a super-smart scale, or a hyper-smart scale? As well as doing everything the Body Comp does, plus running a six-lead ECG, segmented body composition, and will even check for neuropathy in your feet. It is the best scale I’ve ever used, it is also the most expensive, and I suspect it’s too much device for almost everyone who’d consider buying one. Smart scales FAQs What's the difference between a smart scale and a regular scale? A regular scale is pretty straightforward — it tells you how much you weigh, and that’s usually it. A smart scale, on the other hand, does much more. Not only does it give you your weight measurements, but it can also track things like your body fat percentage, muscle mass, and even your BMI. Some smart scales even monitor more advanced metrics like bone density, depending on the model. What’s even better is that smart scales sync with scales apps on your phone using Wi-Fi or Bluetooth, so you can see all your health data in one place. This lets you monitor trends over time, like if your muscle mass is increasing or your body fat percentage decreasing. How do smart scales work with more than one person using it? When more than one person in a household uses the smart scale, it usually recognizes each person by their weight range and other body measurements (like body fat percentage). Most smart scales allow you to set up individual profiles in the companion app, and once your profile is linked, the scale can automatically figure out who’s standing on it. Let’s say you and a family member have fairly different weights — the scale will easily know who’s who based on that. But if you and someone else have similar weights, it might ask you to confirm the profile on your phone after the weigh-in. Some scales even let you assign a profile manually in the scales app if it’s not sure.This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/best-smart-scale-160033523.html?src=rss",
          "feed_position": 10
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/technology/four-ai-research-trends-enterprise-teams-should-watch-in-2026",
          "published_at": "Thu, 01 Jan 2026 08:00:00 GMT",
          "title": "Four AI research trends enterprise teams should watch in 2026",
          "standfirst": "The AI narrative has mostly been dominated by model performance on key industry benchmarks. But as the field matures and enterprises look to draw real value from advances in AI, we’re seeing parallel research in techniques that help productionize AI applications. At VentureBeat, we are tracking AI research that can help understand where the practical implementation of technology is heading. We are looking forward to breakthroughs that are not just about the raw intelligence of a single model, but about how we engineer the systems around them. As we approach 2026, here are four trends that can represent the blueprint for the next generation of robust, scalable enterprise applications.Continual learningContinual learning addresses one of the key challenges of current AI models: teaching them new information and skills without destroying their existing knowledge (often referred to as “catastrophic forgetting”).Traditionally, there are two ways to solve this. One is to retrain the model with a mix of old and new information, which is expensive, time-consuming, and extremely complicated. This makes it inaccessible to most companies using models.Another workaround is to provide models with in-context information through techniques such as RAG. However, these techniques do not update the model’s internal knowledge, which can prove problematic as you move away from the model’s knowledge cutoff and facts start conflicting with what was true at the time of the model’s training. They also require a lot of engineering and are limited by the context windows of the models.Continual learning enables models to update their internal knowledge without the need for retraining. Google has been working on this with several new model architectures. One of them is Titans, which proposes a different primitive: a learned long-term memory module that lets the system incorporate historical context at inference time. Intuitively, it shifts some “learning” from offline weight updates into an online memory process, closer to how teams already think about caches, indexes, and logs. Nested Learning pushes the same theme from another angle. It treats a model as a set of nested optimization problems, each with its own internal workflow, and uses that framing to address catastrophic forgetting. Standard transformer-based language models have dense layers that store the long-term memory obtained during pretraining and attention layers that hold the immediate context. Nested Learning introduces a “continuum memory system,” where memory is seen as a spectrum of modules that update at different frequencies. This creates a memory system that is more attuned to continual learning.Continual learning is complementary to the work being done on giving agents short-term memory through context engineering. As it matures, enterprises can expect a generation of models that adapt to changing environments, dynamically deciding which new information to internalize and which to preserve in short-term memory. World modelsWorld models promise to give AI systems the ability to understand their environments without the need for human-labeled data or human-generated text. With world models, AI systems can better respond to unpredictable and out-of-distribution events and become more robust against the uncertainty of the real world. More importantly, world models open the way for AI systems that can move beyond text and solve tasks that involve physical environments. World models try to learn the regularities of the physical world directly from observation and interaction.There are different approaches for creating world models. DeepMind is building Genie, a family of generative end-to-end models that simulate an environment so an agent can predict how the environment will evolve and how actions will change it. It takes in an image or prompt along with user actions and generates the sequence of video frames that reflect how the world changes. Genie can create interactive environments that can be used for different purposes, including training robots and self-driving cars. World Labs, a new startup founded by AI pioneer Fei-Fei Li, takes a slightly different approach. Marble, World Labs’ first AI system, uses generative AI to create a 3D model from an image or a prompt, which can then be used by a physics and 3D engine to render and simulate the interactive environment used to train robots.Another approach is the Joint Embedding Predictive Architecture (JEPA) espoused by Turing Award winner and former Meta AI Chief Yann LeCun. JEPA models learn latent representations from raw data so the system can anticipate what comes next without generating every pixel. JEPA models are much more efficient than generative models, which makes them suitable for fast-paced real-time AI applications that need to run on resource constrained devices. V-JEPA, the video version of the architecture, is pre-trained on unlabeled internet-scale video to learn world models through observation. It then adds a small amount of interaction data from robot trajectories to support planning. That combination hints at a path where enterprises leverage abundant passive video (training, inspection, dashcams, retail) and add limited, high-value interaction data where they need control. In November, LeCun confirmed that he will be leaving Meta and will be starting a new AI startup that will pursue “systems that understand the physical world, have persistent memory, can reason, and can plan complex action sequences.”OrchestrationFrontier LLMs continue to advance on very challenging benchmarks, often outperforming human experts. But when it comes to real-world tasks and multi-step agentic workflows, even strong models fail: They lose context, call tools with the wrong parameters, and compound small mistakes. Orchestration treats those failures as systems problems that can be addressed with the right scaffolding and engineering. For example, a router chooses between a fast small model, a bigger model for harder steps, retrieval for grounding, and deterministic tools for actions. There are now multiple frameworks that create orchestration layers to improve efficiency and accuracy of AI agents, especially when using external tools. Stanford&#x27;s OctoTools is an open-source framework that can orchestrate multiple tools without the need to fine-tune or adjust the models. OctoTools uses a modular approach that plans a solution, selects tools, and passes subtasks to different agents. OctoTools can use any general-purpose LLM as its backbone.Another approach is to train a specialized orchestrator model that can divide labor between different components of the AI system. One such example is Nvidia’s Orchestrator, an 8-billion-parameter model that coordinates different tools and LLMs to solve complex problems. Orchestrator was trained through a special reinforcement learning technique designed for model orchestration. It can tell when to use tools, when to delegate tasks to small specialized models, and when to use the reasoning capabilities and knowledge of large generalist models.One of the characteristics of these and other similar frameworks is that they can benefit from advances in the underlying models. So as we continue to see advances in frontier models, we can expect orchestration frameworks to evolve and help enterprises build robust and resource-efficient agentic applications.RefinementRefinement techniques turn “one answer” into a controlled process: propose, critique, revise, and verify. It frames the workflow as using the same model to generate an initial output, produce feedback on it, and iteratively improve, without additional training. While self-refinement techniques have been around for a few years, we might be at a point where we can see them provide a step change in agentic applications. This was put on full display in the results of the ARC Prize, which dubbed 2025 as the “Year of the Refinement Loop” and wrote, “From an information theory perspective, refinement is intelligence.” ARC tests models on complicated abstract reasoning puzzles. ARC’s own analysis reports that the top verified refinement solution, built on a frontier model and developed by Poetiq, reached 54% on ARC-AGI-2, beating the runner-up, Gemini 3 Deep Think (45%), at half the price. Poetiq’s solution is a recursive, self-improving, system that is LLM-agnostic. It is designed to leverage the reasoning capabilities and knowledge of the underlying model to reflect and refine its own solution and invoke tools such as code interpreters when needed.As models become stronger, adding self-refinement layers will make it possible to get more out of them. Poetiq is already working with partners to adapt its meta-system to “handle complex real-world problems that frontier models struggle to solve.”How to track AI research in 2026A practical way to read the research in the coming year is to watch which new techniques can help enterprises move agentic applications from proof-of-concepts into scalable systems. Continual learning shifts rigor toward memory provenance and retention. World models shift it toward robust simulation and prediction of real-world events. Orchestration shifts it toward better use of resources. Refinement shifts it toward smart reflection and correction of answers. The winners will not only pick strong models, they will build the control plane that keeps those models correct, current, and cost-efficient.",
          "content": "The AI narrative has mostly been dominated by model performance on key industry benchmarks. But as the field matures and enterprises look to draw real value from advances in AI, we’re seeing parallel research in techniques that help productionize AI applications. At VentureBeat, we are tracking AI research that can help understand where the practical implementation of technology is heading. We are looking forward to breakthroughs that are not just about the raw intelligence of a single model, but about how we engineer the systems around them. As we approach 2026, here are four trends that can represent the blueprint for the next generation of robust, scalable enterprise applications.Continual learningContinual learning addresses one of the key challenges of current AI models: teaching them new information and skills without destroying their existing knowledge (often referred to as “catastrophic forgetting”).Traditionally, there are two ways to solve this. One is to retrain the model with a mix of old and new information, which is expensive, time-consuming, and extremely complicated. This makes it inaccessible to most companies using models.Another workaround is to provide models with in-context information through techniques such as RAG. However, these techniques do not update the model’s internal knowledge, which can prove problematic as you move away from the model’s knowledge cutoff and facts start conflicting with what was true at the time of the model’s training. They also require a lot of engineering and are limited by the context windows of the models.Continual learning enables models to update their internal knowledge without the need for retraining. Google has been working on this with several new model architectures. One of them is Titans, which proposes a different primitive: a learned long-term memory module that lets the system incorporate historical context at inference time. Intuitively, it shifts some “learning” from offline weight updates into an online memory process, closer to how teams already think about caches, indexes, and logs. Nested Learning pushes the same theme from another angle. It treats a model as a set of nested optimization problems, each with its own internal workflow, and uses that framing to address catastrophic forgetting. Standard transformer-based language models have dense layers that store the long-term memory obtained during pretraining and attention layers that hold the immediate context. Nested Learning introduces a “continuum memory system,” where memory is seen as a spectrum of modules that update at different frequencies. This creates a memory system that is more attuned to continual learning.Continual learning is complementary to the work being done on giving agents short-term memory through context engineering. As it matures, enterprises can expect a generation of models that adapt to changing environments, dynamically deciding which new information to internalize and which to preserve in short-term memory. World modelsWorld models promise to give AI systems the ability to understand their environments without the need for human-labeled data or human-generated text. With world models, AI systems can better respond to unpredictable and out-of-distribution events and become more robust against the uncertainty of the real world. More importantly, world models open the way for AI systems that can move beyond text and solve tasks that involve physical environments. World models try to learn the regularities of the physical world directly from observation and interaction.There are different approaches for creating world models. DeepMind is building Genie, a family of generative end-to-end models that simulate an environment so an agent can predict how the environment will evolve and how actions will change it. It takes in an image or prompt along with user actions and generates the sequence of video frames that reflect how the world changes. Genie can create interactive environments that can be used for different purposes, including training robots and self-driving cars. World Labs, a new startup founded by AI pioneer Fei-Fei Li, takes a slightly different approach. Marble, World Labs’ first AI system, uses generative AI to create a 3D model from an image or a prompt, which can then be used by a physics and 3D engine to render and simulate the interactive environment used to train robots.Another approach is the Joint Embedding Predictive Architecture (JEPA) espoused by Turing Award winner and former Meta AI Chief Yann LeCun. JEPA models learn latent representations from raw data so the system can anticipate what comes next without generating every pixel. JEPA models are much more efficient than generative models, which makes them suitable for fast-paced real-time AI applications that need to run on resource constrained devices. V-JEPA, the video version of the architecture, is pre-trained on unlabeled internet-scale video to learn world models through observation. It then adds a small amount of interaction data from robot trajectories to support planning. That combination hints at a path where enterprises leverage abundant passive video (training, inspection, dashcams, retail) and add limited, high-value interaction data where they need control. In November, LeCun confirmed that he will be leaving Meta and will be starting a new AI startup that will pursue “systems that understand the physical world, have persistent memory, can reason, and can plan complex action sequences.”OrchestrationFrontier LLMs continue to advance on very challenging benchmarks, often outperforming human experts. But when it comes to real-world tasks and multi-step agentic workflows, even strong models fail: They lose context, call tools with the wrong parameters, and compound small mistakes. Orchestration treats those failures as systems problems that can be addressed with the right scaffolding and engineering. For example, a router chooses between a fast small model, a bigger model for harder steps, retrieval for grounding, and deterministic tools for actions. There are now multiple frameworks that create orchestration layers to improve efficiency and accuracy of AI agents, especially when using external tools. Stanford&#x27;s OctoTools is an open-source framework that can orchestrate multiple tools without the need to fine-tune or adjust the models. OctoTools uses a modular approach that plans a solution, selects tools, and passes subtasks to different agents. OctoTools can use any general-purpose LLM as its backbone.Another approach is to train a specialized orchestrator model that can divide labor between different components of the AI system. One such example is Nvidia’s Orchestrator, an 8-billion-parameter model that coordinates different tools and LLMs to solve complex problems. Orchestrator was trained through a special reinforcement learning technique designed for model orchestration. It can tell when to use tools, when to delegate tasks to small specialized models, and when to use the reasoning capabilities and knowledge of large generalist models.One of the characteristics of these and other similar frameworks is that they can benefit from advances in the underlying models. So as we continue to see advances in frontier models, we can expect orchestration frameworks to evolve and help enterprises build robust and resource-efficient agentic applications.RefinementRefinement techniques turn “one answer” into a controlled process: propose, critique, revise, and verify. It frames the workflow as using the same model to generate an initial output, produce feedback on it, and iteratively improve, without additional training. While self-refinement techniques have been around for a few years, we might be at a point where we can see them provide a step change in agentic applications. This was put on full display in the results of the ARC Prize, which dubbed 2025 as the “Year of the Refinement Loop” and wrote, “From an information theory perspective, refinement is intelligence.” ARC tests models on complicated abstract reasoning puzzles. ARC’s own analysis reports that the top verified refinement solution, built on a frontier model and developed by Poetiq, reached 54% on ARC-AGI-2, beating the runner-up, Gemini 3 Deep Think (45%), at half the price. Poetiq’s solution is a recursive, self-improving, system that is LLM-agnostic. It is designed to leverage the reasoning capabilities and knowledge of the underlying model to reflect and refine its own solution and invoke tools such as code interpreters when needed.As models become stronger, adding self-refinement layers will make it possible to get more out of them. Poetiq is already working with partners to adapt its meta-system to “handle complex real-world problems that frontier models struggle to solve.”How to track AI research in 2026A practical way to read the research in the coming year is to watch which new techniques can help enterprises move agentic applications from proof-of-concepts into scalable systems. Continual learning shifts rigor toward memory provenance and retention. World models shift it toward robust simulation and prediction of real-world events. Orchestration shifts it toward better use of resources. Refinement shifts it toward smart reflection and correction of answers. The winners will not only pick strong models, they will build the control plane that keeps those models correct, current, and cost-efficient.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/388FvHgrtREmt4SIX9wUBh/4bbed81a266f9d68770660b4b81a650b/AI_trends_2026.jpg?w=300&q=30"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/technology/open-source-qwen-image-2512-launches-to-compete-with-googles-nano-banana-pro",
          "published_at": "Wed, 31 Dec 2025 21:10:00 GMT",
          "title": "Open source Qwen-Image-2512 launches to compete with Google's Nano Banana Pro in high quality AI image generation",
          "standfirst": "When Google released its newest AI image model Nano Banana Pro (aka Gemini 3 Pro Image) in November, it reset expectations for the entire field. For the first time, uses of an image model could use natural language to generate dense, text-heavy infographics, slides, and other enterprise-grade visuals without spelling errors. But that leap forward came with a familiar tradeoff. Gemini 3 Pro Image is deeply proprietary, tightly bound to Google’s cloud stack, and priced for premium usage. For enterprises that need predictable costs, deployment sovereignty, or regional localization, the model raised the bar without offering many viable alternatives.Alibaba’s Qwen team of AI researchers — already having a banner year with numerous powerful open source AI model releases — is now answering with its own alternative, Qwen-Image-2512, once again available freely for developers and even large enterprises for commercial purposes under a standard, permissive Apache 2.0 license.The model can be used directly by consumers via Qwen Chat, and its full open-source weights are up on Hugging Face or ModelScope, and inspected or integrated from source on GitHub. For zero-install experimentation, the Qwen team also provides a hosted Hugging Face demo and a browser-based ModelScope demo. Enterprises that prefer managed inference can access the same generation capabilities through Alibaba Cloud’s Model Studio API.A response to a changing enterprise marketThe impact of Gemini 3 Pro Image was not subtle. Its ability to generate production-ready diagrams, slides, menus, and multilingual visuals pushed image generation beyond creative experimentation and into enterprise infrastructure territory—a shift reflected across broader conversations around orchestration, data pipelines, and AI security.In that framing, image models are no longer artistic tools. They are workflow components, expected to slot into documentation systems, design pipelines, marketing automation, and training platforms with consistency and control.Most responses to Google’s move have been proprietary: API-only access, usage-based pricing, and tight platform coupling — such as OpenAI&#x27;s own GPT Image 1.5 released earlier this month.Qwen-Image-2512 takes a different approach, betting that performance parity plus openness is what a large segment of the enterprise market actually wants.What Qwen-Image-2512 improves—and why it mattersThe December 2512 update focuses on three areas that have become non-negotiable for enterprise image generation.Human realism and environmental coherence: Qwen-Image-2512 significantly reduces the “AI look” that has long plagued open models. Facial features show age and texture more accurately, postures adhere more closely to prompts, and background environments are rendered with clearer semantic context. For enterprises using synthetic imagery in training, simulations, or internal communications, this realism is essential for credibility.Natural texture fidelity: Landscapes, water, animal fur, and materials are rendered with finer detail and smoother gradients. These improvements are not cosmetic; they enable synthetic imagery for ecommerce, education, and visualization without extensive manual cleanup.Structured text and layout rendering: Qwen-Image-2512 improves embedded text accuracy and layout consistency, supporting both Chinese and English prompts. Slides, posters, infographics, and mixed text-image compositions are more legible and more faithful to instructions. This is the same category where Gemini 3 Pro Image drew the loudest praise—and where many earlier open models struggled.In blind, human-evaluated testing on Alibaba’s AI Arena, Qwen-Image-2512 ranks as the strongest open-source image model and remains competitive with closed systems, reinforcing its claim as a production-ready option rather than a research preview.Open source changes the deployment calculusWhere Qwen-Image-2512 most clearly differentiates itself is licensing. Released under Apache 2.0, the model can be freely used, modified, fine-tuned, and deployed commercially.For enterprises, this unlocks options that proprietary models do not:Cost control: At scale, per-image API pricing compounds quickly. Self-hosting allows organizations to amortize infrastructure costs instead of paying perpetual usage fees.Data governance: Regulated industries often require strict control over data residency, logging, and auditability.Localization and customization: Teams can adapt models for regional languages, cultural norms, or internal style guides without waiting on a vendor roadmap.By contrast, Gemini 3 Pro Image offers strong governance assurances but remains inseparable from Google’s infrastructure and pricing model.API pricing for managed deploymentsFor teams that prefer managed inference, Qwen-Image-2512 is available via Alibaba Cloud Model Studio as qwen-image-max, priced at $0.075 per generated image. The API accepts text input and returns image output, with rate limits suitable for production workloads. Free quotas are limited, and usage transitions to paid billing once credits are exhausted.This hybrid approach—open weights paired with a commercial API—mirrors how many enterprises deploy AI today: experimentation and customization in-house, with managed services layered on where operational simplicity matters.Competitive, but philosophically differentQwen-Image-2512 is not positioned as a universal replacement for Gemini 3 Pro Image. Google’s model benefits from deep integration with Vertex AI, Workspace, Ads, and Gemini’s broader reasoning stack. For organizations already committed to Google Cloud, Nano Banana Pro fits naturally into existing pipelines.Qwen’s strategy is more modular. The model integrates cleanly with open tooling and custom orchestration layers, making it attractive to teams building their own AI stacks or combining image generation with internal data systems.A signal to the marketThe release of Qwen-Image-2512 reinforces a broader shift: open-source AI is no longer content to trail proprietary systems by a generation. Instead, it is selectively matching the capabilities that matter most for enterprise deployment—text fidelity, layout control, and realism—while preserving the freedoms enterprises increasingly demand.Google’s Gemini 3 Pro Image raised the ceiling. Qwen-Image-2512 shows that enterprises now have a serious open-source alternative—one that aligns performance with cost control, governance, and deployment choice.",
          "content": "When Google released its newest AI image model Nano Banana Pro (aka Gemini 3 Pro Image) in November, it reset expectations for the entire field. For the first time, uses of an image model could use natural language to generate dense, text-heavy infographics, slides, and other enterprise-grade visuals without spelling errors. But that leap forward came with a familiar tradeoff. Gemini 3 Pro Image is deeply proprietary, tightly bound to Google’s cloud stack, and priced for premium usage. For enterprises that need predictable costs, deployment sovereignty, or regional localization, the model raised the bar without offering many viable alternatives.Alibaba’s Qwen team of AI researchers — already having a banner year with numerous powerful open source AI model releases — is now answering with its own alternative, Qwen-Image-2512, once again available freely for developers and even large enterprises for commercial purposes under a standard, permissive Apache 2.0 license.The model can be used directly by consumers via Qwen Chat, and its full open-source weights are up on Hugging Face or ModelScope, and inspected or integrated from source on GitHub. For zero-install experimentation, the Qwen team also provides a hosted Hugging Face demo and a browser-based ModelScope demo. Enterprises that prefer managed inference can access the same generation capabilities through Alibaba Cloud’s Model Studio API.A response to a changing enterprise marketThe impact of Gemini 3 Pro Image was not subtle. Its ability to generate production-ready diagrams, slides, menus, and multilingual visuals pushed image generation beyond creative experimentation and into enterprise infrastructure territory—a shift reflected across broader conversations around orchestration, data pipelines, and AI security.In that framing, image models are no longer artistic tools. They are workflow components, expected to slot into documentation systems, design pipelines, marketing automation, and training platforms with consistency and control.Most responses to Google’s move have been proprietary: API-only access, usage-based pricing, and tight platform coupling — such as OpenAI&#x27;s own GPT Image 1.5 released earlier this month.Qwen-Image-2512 takes a different approach, betting that performance parity plus openness is what a large segment of the enterprise market actually wants.What Qwen-Image-2512 improves—and why it mattersThe December 2512 update focuses on three areas that have become non-negotiable for enterprise image generation.Human realism and environmental coherence: Qwen-Image-2512 significantly reduces the “AI look” that has long plagued open models. Facial features show age and texture more accurately, postures adhere more closely to prompts, and background environments are rendered with clearer semantic context. For enterprises using synthetic imagery in training, simulations, or internal communications, this realism is essential for credibility.Natural texture fidelity: Landscapes, water, animal fur, and materials are rendered with finer detail and smoother gradients. These improvements are not cosmetic; they enable synthetic imagery for ecommerce, education, and visualization without extensive manual cleanup.Structured text and layout rendering: Qwen-Image-2512 improves embedded text accuracy and layout consistency, supporting both Chinese and English prompts. Slides, posters, infographics, and mixed text-image compositions are more legible and more faithful to instructions. This is the same category where Gemini 3 Pro Image drew the loudest praise—and where many earlier open models struggled.In blind, human-evaluated testing on Alibaba’s AI Arena, Qwen-Image-2512 ranks as the strongest open-source image model and remains competitive with closed systems, reinforcing its claim as a production-ready option rather than a research preview.Open source changes the deployment calculusWhere Qwen-Image-2512 most clearly differentiates itself is licensing. Released under Apache 2.0, the model can be freely used, modified, fine-tuned, and deployed commercially.For enterprises, this unlocks options that proprietary models do not:Cost control: At scale, per-image API pricing compounds quickly. Self-hosting allows organizations to amortize infrastructure costs instead of paying perpetual usage fees.Data governance: Regulated industries often require strict control over data residency, logging, and auditability.Localization and customization: Teams can adapt models for regional languages, cultural norms, or internal style guides without waiting on a vendor roadmap.By contrast, Gemini 3 Pro Image offers strong governance assurances but remains inseparable from Google’s infrastructure and pricing model.API pricing for managed deploymentsFor teams that prefer managed inference, Qwen-Image-2512 is available via Alibaba Cloud Model Studio as qwen-image-max, priced at $0.075 per generated image. The API accepts text input and returns image output, with rate limits suitable for production workloads. Free quotas are limited, and usage transitions to paid billing once credits are exhausted.This hybrid approach—open weights paired with a commercial API—mirrors how many enterprises deploy AI today: experimentation and customization in-house, with managed services layered on where operational simplicity matters.Competitive, but philosophically differentQwen-Image-2512 is not positioned as a universal replacement for Gemini 3 Pro Image. Google’s model benefits from deep integration with Vertex AI, Workspace, Ads, and Gemini’s broader reasoning stack. For organizations already committed to Google Cloud, Nano Banana Pro fits naturally into existing pipelines.Qwen’s strategy is more modular. The model integrates cleanly with open tooling and custom orchestration layers, making it attractive to teams building their own AI stacks or combining image generation with internal data systems.A signal to the marketThe release of Qwen-Image-2512 reinforces a broader shift: open-source AI is no longer content to trail proprietary systems by a generation. Instead, it is selectively matching the capabilities that matter most for enterprise deployment—text fidelity, layout control, and realism—while preserving the freedoms enterprises increasingly demand.Google’s Gemini 3 Pro Image raised the ceiling. Qwen-Image-2512 shows that enterprises now have a serious open-source alternative—one that aligns performance with cost control, governance, and deployment choice.",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/3nh0udM8PXiBZTLMRhFdC9/6f049ddee65951d098ee322efbf0265d/1767215299__1_.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/social-media/instagram-chief-ai-is-so-ubiquitous-it-will-be-more-practical-to-fingerprint-real-media-than-fake-media-202620080.html",
          "published_at": "Wed, 31 Dec 2025 20:26:20 +0000",
          "title": "Instagram chief: AI is so ubiquitous 'it will be more practical to fingerprint real media than fake media'",
          "standfirst": "It's no secret that AI-generated content took over our social media feeds in 2025. Now, Instagram's top exec Adam Mosseri has made it clear that he expects AI content to overtake non-AI imagery and the significant implications that shift has for its creators and photographers.Mosseri shared the thoughts in a lengthy post about the broader trends he expects to shape Instagram in 2026. And he offered a notably candid assessment on how AI is upending the platform. \"Everything that made creators matter—the ability to be real, to connect, to have a voice that couldn’t be faked—is now suddenly accessible to anyone with the right tools,\" he wrote. \"The feeds are starting to fill up with synthetic everything.\"But Mosseri doesn't seem particularly concerned by this shift. He says that there is \"a lot of amazing AI content\" and that the platform may need to rethink its approach to labeling such imagery by \"fingerprinting real media, not just chasing fake.\"From Mosseri (emphasis his):Social media platforms are going to come under increasing pressure to identify and label AI-generated content as such. All the major platforms will do good work identifying AI content, but they will get worse at it over time as AI gets better at imitating reality. There is already a growing number of people who believe, as I do, that it will be more practical to fingerprint real media than fake media. Camera manufacturers could cryptographically sign images at capture, creating a chain of custody.On some level, it's easy to understand how this seems like a more practical approach for Meta. As we've previously reported, technologies that are meant to identify AI content, like watermarks, have proved unreliable at best. They are easy to remove and even easier to ignore altogether. Meta's own labels are far from clear and the company, which has spent tens of billions of dollars on AI this year alone, has admitted it can't reliably detect AI-generated or manipulated content on its platform.That Mosseri is so readily admitting defeat on this issue, though, is telling. AI slop has won. And when it comes to helping Instagram's 3 billion users understand what is real, that should largely be someone else's problem, not Meta's. Camera makers — presumably phone makers and actual camera manufacturers — should come up with their own system that sure sounds a lot like watermarking to \"to verify authenticity at capture.\" Mosseri offers few details about how this would work or be implemented at the scale required to make it feasible.Mosseri also doesn't really address the fact that this is likely to alienate the many photographers and other Instagram creators who have already grown frustrated with the app. The exec regularly fields complaints from the group who want to know why Instagram's algorithm doesn't consistently surface their posts to their on followers.But Mosseri suggests those complaints stem from an outdated vision of what Instagram even is. The feed of \"polished\" square images, he says, \"is dead.\" Camera companies, in his estimation, are \"are betting on the wrong aesthetic\" by trying to \"make everyone look like a professional photographer from the past.\" Instead, he says that more \"raw\" and \"unflattering\" images will be how creators can prove they are real, and not AI. In a world where Instagram has more AI content than not, creators should prioritize images and videos that intentionally make them look bad. This article originally appeared on Engadget at https://www.engadget.com/social-media/instagram-chief-ai-is-so-ubiquitous-it-will-be-more-practical-to-fingerprint-real-media-than-fake-media-202620080.html?src=rss",
          "content": "It's no secret that AI-generated content took over our social media feeds in 2025. Now, Instagram's top exec Adam Mosseri has made it clear that he expects AI content to overtake non-AI imagery and the significant implications that shift has for its creators and photographers.Mosseri shared the thoughts in a lengthy post about the broader trends he expects to shape Instagram in 2026. And he offered a notably candid assessment on how AI is upending the platform. \"Everything that made creators matter—the ability to be real, to connect, to have a voice that couldn’t be faked—is now suddenly accessible to anyone with the right tools,\" he wrote. \"The feeds are starting to fill up with synthetic everything.\"But Mosseri doesn't seem particularly concerned by this shift. He says that there is \"a lot of amazing AI content\" and that the platform may need to rethink its approach to labeling such imagery by \"fingerprinting real media, not just chasing fake.\"From Mosseri (emphasis his):Social media platforms are going to come under increasing pressure to identify and label AI-generated content as such. All the major platforms will do good work identifying AI content, but they will get worse at it over time as AI gets better at imitating reality. There is already a growing number of people who believe, as I do, that it will be more practical to fingerprint real media than fake media. Camera manufacturers could cryptographically sign images at capture, creating a chain of custody.On some level, it's easy to understand how this seems like a more practical approach for Meta. As we've previously reported, technologies that are meant to identify AI content, like watermarks, have proved unreliable at best. They are easy to remove and even easier to ignore altogether. Meta's own labels are far from clear and the company, which has spent tens of billions of dollars on AI this year alone, has admitted it can't reliably detect AI-generated or manipulated content on its platform.That Mosseri is so readily admitting defeat on this issue, though, is telling. AI slop has won. And when it comes to helping Instagram's 3 billion users understand what is real, that should largely be someone else's problem, not Meta's. Camera makers — presumably phone makers and actual camera manufacturers — should come up with their own system that sure sounds a lot like watermarking to \"to verify authenticity at capture.\" Mosseri offers few details about how this would work or be implemented at the scale required to make it feasible.Mosseri also doesn't really address the fact that this is likely to alienate the many photographers and other Instagram creators who have already grown frustrated with the app. The exec regularly fields complaints from the group who want to know why Instagram's algorithm doesn't consistently surface their posts to their on followers.But Mosseri suggests those complaints stem from an outdated vision of what Instagram even is. The feed of \"polished\" square images, he says, \"is dead.\" Camera companies, in his estimation, are \"are betting on the wrong aesthetic\" by trying to \"make everyone look like a professional photographer from the past.\" Instead, he says that more \"raw\" and \"unflattering\" images will be how creators can prove they are real, and not AI. In a world where Instagram has more AI content than not, creators should prioritize images and videos that intentionally make them look bad. This article originally appeared on Engadget at https://www.engadget.com/social-media/instagram-chief-ai-is-so-ubiquitous-it-will-be-more-practical-to-fingerprint-real-media-than-fake-media-202620080.html?src=rss",
          "feed_position": 11
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/how-to-watch-samsungs-first-look-ces-2026-presentation-190027604.html",
          "published_at": "Wed, 31 Dec 2025 19:00:27 +0000",
          "title": "How to watch Samsung's \"First Look\" CES 2026 presentation",
          "standfirst": "NurPhoto via Getty Images Samsung is arguably the 800-pound gorilla of CES, with a full spectrum of products that range from phones and computers to refrigerators to AI assistants and rolling robots. But for CES 2026, the company is shaking up the schedule a bit: Instead of its longtime midday Monday press conference position, the Korean giant will front-run the entire show with a Sunday night presentation. Samsung has already given a few hints as to what's on the agenda, but what we're really hoping to see is an update on the Ballie robot — a star of previous CES presentations that ostensibly missed its previously promised 2025 release date. How to watch Samsung's \"The First Look\" presentation at CES 2026 The event will stream live from the Wynn Hotel in Las Vegas on Sunday, January 4 at 10PM ET. There are several ways to tune in: you can watch via the Samsung Newsroom, Samsung Electronics’ official YouTube channel or via Samsung TV Plus. (We'll embed the stream here once it appears on the channel.) What to expect from Samsung at CES 2026 Keynote speaker TM Roh, the CEO of Samsung's Device eXperience (DX) Division, will discuss the company's plans for the new year and beyond, which will (of course) include \"new AI-driven customer experiences,\" the company said in a press release. In addition, we'll hear from the President and Head of the Visual Display Business, SW Yong and Executive Vice President and Head of Digital Appliances Business, Cheolgi Kim. Those two will \"share their respective business directions for the upcoming year.\" But if you're looking for more specifics, Samsung is following its \"Advent calendar\" approach to early CES announcements, with new press releases dropping nearly each day. So far, we know that — like competitors LG and Hisense — the company will be offering details on a line of micro RGB TVs (replete with confirmed screen sizes of 55 to 115 inches). Also confirmed: a full line of appliances infused with what Samsung calls Bespoke AI. It's likely Samsung will map out its CES plans in greater detail as the January 4 event approaches, so we'll update this story accordingly when it does.This article originally appeared on Engadget at https://www.engadget.com/mobile/how-to-watch-samsungs-first-look-ces-2026-presentation-190027604.html?src=rss",
          "content": "NurPhoto via Getty Images Samsung is arguably the 800-pound gorilla of CES, with a full spectrum of products that range from phones and computers to refrigerators to AI assistants and rolling robots. But for CES 2026, the company is shaking up the schedule a bit: Instead of its longtime midday Monday press conference position, the Korean giant will front-run the entire show with a Sunday night presentation. Samsung has already given a few hints as to what's on the agenda, but what we're really hoping to see is an update on the Ballie robot — a star of previous CES presentations that ostensibly missed its previously promised 2025 release date. How to watch Samsung's \"The First Look\" presentation at CES 2026 The event will stream live from the Wynn Hotel in Las Vegas on Sunday, January 4 at 10PM ET. There are several ways to tune in: you can watch via the Samsung Newsroom, Samsung Electronics’ official YouTube channel or via Samsung TV Plus. (We'll embed the stream here once it appears on the channel.) What to expect from Samsung at CES 2026 Keynote speaker TM Roh, the CEO of Samsung's Device eXperience (DX) Division, will discuss the company's plans for the new year and beyond, which will (of course) include \"new AI-driven customer experiences,\" the company said in a press release. In addition, we'll hear from the President and Head of the Visual Display Business, SW Yong and Executive Vice President and Head of Digital Appliances Business, Cheolgi Kim. Those two will \"share their respective business directions for the upcoming year.\" But if you're looking for more specifics, Samsung is following its \"Advent calendar\" approach to early CES announcements, with new press releases dropping nearly each day. So far, we know that — like competitors LG and Hisense — the company will be offering details on a line of micro RGB TVs (replete with confirmed screen sizes of 55 to 115 inches). Also confirmed: a full line of appliances infused with what Samsung calls Bespoke AI. It's likely Samsung will map out its CES plans in greater detail as the January 4 event approaches, so we'll update this story accordingly when it does.This article originally appeared on Engadget at https://www.engadget.com/mobile/how-to-watch-samsungs-first-look-ces-2026-presentation-190027604.html?src=rss",
          "feed_position": 12,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/54afdb10-dd18-11f0-b2f7-d2b3086683ec"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/transportation/evs/how-to-watch-the-sony-honda-afeela-ces-2026-press-conference-130048622.html",
          "published_at": "Wed, 31 Dec 2025 18:42:16 +0000",
          "title": "How to watch the Sony Honda Afeela CES 2026 press conference",
          "standfirst": "Sony's CES 2026 press conference is just days away, but this year has a twist: Instead of an overview of Sony's electronics, video game and Hollywood studio plans for the new year, the presser will apparently have a more narrow focus: electric vehicles. That's because the traditional end-of-press-day slot isn't just Sony, but rather Sony Honda Mobility — the joint venture responsible for the Afeela 1 electric car that has been showcased at CES for the better part of a decade. This year, however, we'll also apparently get to see a an all-new concept model at the event, too. How to watch the Sony Afeela CES 2026 press conference The event will be streamed live from Las Vegas on Monday, January 5 at 8PM ET via the Afeela official YouTube channel. (We'll embed the stream here once it appears on the channel.) What to expect from Sony Afeela at CES What's now the Afeela 1 has been shown in various incarnations since CES 2020, where it was originally announced as Vision-S. But so many more important details were confirmed in the past couple of years, including the price, which starts at a staggering $89,900. However, the earlier impressions were less than impressive, and as of CES 2025, that thought remains the same. Engadget's automotive expert Tim Stevens said earlier this year that the EV \"feels like a PlayStation 4 in the PS5 era,\" and that \"the car lost what little interesting styling it had while sticking true to some specifications that sounded good five years ago.\" Ouch. But the Afeela 1 won't be the only vehicle on display. Its CES booth will showcase \"several Afeela 1 pre-production vehicles in multiple color variations, alongside a new Afeela concept model,\" Sony Honda Mobility said in a press release. We're hoping to hear about what's new and improved at CES 2026, and we're also excited to see its newest concept model. And between booth displays and press releases, we're hoping we'll get to see at least a few new Sony Electronics products on the docket for 2026, too.This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/how-to-watch-the-sony-honda-afeela-ces-2026-press-conference-130048622.html?src=rss",
          "content": "Sony's CES 2026 press conference is just days away, but this year has a twist: Instead of an overview of Sony's electronics, video game and Hollywood studio plans for the new year, the presser will apparently have a more narrow focus: electric vehicles. That's because the traditional end-of-press-day slot isn't just Sony, but rather Sony Honda Mobility — the joint venture responsible for the Afeela 1 electric car that has been showcased at CES for the better part of a decade. This year, however, we'll also apparently get to see a an all-new concept model at the event, too. How to watch the Sony Afeela CES 2026 press conference The event will be streamed live from Las Vegas on Monday, January 5 at 8PM ET via the Afeela official YouTube channel. (We'll embed the stream here once it appears on the channel.) What to expect from Sony Afeela at CES What's now the Afeela 1 has been shown in various incarnations since CES 2020, where it was originally announced as Vision-S. But so many more important details were confirmed in the past couple of years, including the price, which starts at a staggering $89,900. However, the earlier impressions were less than impressive, and as of CES 2025, that thought remains the same. Engadget's automotive expert Tim Stevens said earlier this year that the EV \"feels like a PlayStation 4 in the PS5 era,\" and that \"the car lost what little interesting styling it had while sticking true to some specifications that sounded good five years ago.\" Ouch. But the Afeela 1 won't be the only vehicle on display. Its CES booth will showcase \"several Afeela 1 pre-production vehicles in multiple color variations, alongside a new Afeela concept model,\" Sony Honda Mobility said in a press release. We're hoping to hear about what's new and improved at CES 2026, and we're also excited to see its newest concept model. And between booth displays and press releases, we're hoping we'll get to see at least a few new Sony Electronics products on the docket for 2026, too.This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/how-to-watch-the-sony-honda-afeela-ces-2026-press-conference-130048622.html?src=rss",
          "feed_position": 13,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/3f099890-d9ef-11f0-a3f3-bb8a02df8254"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/how-to-watch-the-lg-press-conference-at-ces-2026-190159474.html",
          "published_at": "Wed, 31 Dec 2025 17:37:17 +0000",
          "title": "How to watch the LG press conference at CES 2026",
          "standfirst": "LG For years, LG has kicked off CES press day with the first event of the morning — and 2026 will be no different. The Korea-based corporation is theming its presentation as \"Innovation in Tune with You,\" and — if it follows the template of past presentations — it will highlight both the consumer electronics and large appliance sides of its mammoth global businesses. Like nearly all tech-centric events these days, expect AI to be the binding theme of the LG presentation at CES 2026. Just be aware that, like Apple, LG has its own customized abbreviation for AI: \"Affectionate Intelligence.\" The company will share \"its vision for elevating daily life through Affectionate Intelligence — delivering harmonized and seamlessly connected customer experiences.\" In other words, the company is aiming for its devices to become more connected and self-automated than ever. Here's how you can stream it and what you can expect. How to watch LG's CES 2026 presentation The event will stream live from Las Vegas on Monday, January 5 at 11AM ET. You've got a few options for tuning in — watch the livestream on the LG website, the LG Global X channel or the LG Global YouTube channel (embedded below). What to expect Here's what LG has already confirmed it will be showcasing at CES 2026: LG will debut its first Micro RGB TV, a display with a cutting-edge screen technology with multicolor backlights that should one-up mini LED displays. The size options are 100 inches, 86 inches and 75 inches. The company is countering Samsung's Frame TVs with its new LG Gallery TV, arriving in 55- and 65-inch screen sizes. Look for a new LG humanoid home automation robot named CLOiD to take the stage. In the audio realm, the Korean multinational will also introduce a Dolby-powered modular home audio system and a new line of its xboom speakers (developed with musician will.i.am). Does that leave any surprises for the CES press conference? We'll find out on January 5. Update, December 31 2025, 12:36PM ET: This story has been updated to include more LG CES pre-announcements, and to embed the YouTube stream. This article originally appeared on Engadget at https://www.engadget.com/home/how-to-watch-the-lg-press-conference-at-ces-2026-190159474.html?src=rss",
          "content": "LG For years, LG has kicked off CES press day with the first event of the morning — and 2026 will be no different. The Korea-based corporation is theming its presentation as \"Innovation in Tune with You,\" and — if it follows the template of past presentations — it will highlight both the consumer electronics and large appliance sides of its mammoth global businesses. Like nearly all tech-centric events these days, expect AI to be the binding theme of the LG presentation at CES 2026. Just be aware that, like Apple, LG has its own customized abbreviation for AI: \"Affectionate Intelligence.\" The company will share \"its vision for elevating daily life through Affectionate Intelligence — delivering harmonized and seamlessly connected customer experiences.\" In other words, the company is aiming for its devices to become more connected and self-automated than ever. Here's how you can stream it and what you can expect. How to watch LG's CES 2026 presentation The event will stream live from Las Vegas on Monday, January 5 at 11AM ET. You've got a few options for tuning in — watch the livestream on the LG website, the LG Global X channel or the LG Global YouTube channel (embedded below). What to expect Here's what LG has already confirmed it will be showcasing at CES 2026: LG will debut its first Micro RGB TV, a display with a cutting-edge screen technology with multicolor backlights that should one-up mini LED displays. The size options are 100 inches, 86 inches and 75 inches. The company is countering Samsung's Frame TVs with its new LG Gallery TV, arriving in 55- and 65-inch screen sizes. Look for a new LG humanoid home automation robot named CLOiD to take the stage. In the audio realm, the Korean multinational will also introduce a Dolby-powered modular home audio system and a new line of its xboom speakers (developed with musician will.i.am). Does that leave any surprises for the CES press conference? We'll find out on January 5. Update, December 31 2025, 12:36PM ET: This story has been updated to include more LG CES pre-announcements, and to embed the YouTube stream. This article originally appeared on Engadget at https://www.engadget.com/home/how-to-watch-the-lg-press-conference-at-ces-2026-190159474.html?src=rss",
          "feed_position": 15,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/6f089c60-db4f-11f0-ab9d-5c52fd4922f7"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/big-tech/ces-2026-what-to-expect-when-techs-biggest-conference-starts-on-january-4-120000189.html",
          "published_at": "Wed, 31 Dec 2025 17:05:00 +0000",
          "title": "CES 2026: What to expect when tech's biggest conference starts on January 4",
          "standfirst": "The new year is upon us, and that means CES 2026 is imminent. The biggest tech trade show of the calendar comes with a bevy of new and notable announcements that set the tone for trends and expectations for the subsequent 12 months. The CES 2026 show floor is officially open from January 6 through 9, but the fun kicks off with events on Sunday January 4, followed by a host of press conferences on Monday. As always, product demos, announcements and networking will be happening at the Las Vegas Convention Center and other hotels all over the city. As usual, Engadget will be covering the event in-person and remotely, bringing you news and hands-ons straight from the show floor.More specific details and pre-announcements are already trickling out as CES approaches, and thanks to the schedule of the Consumer Technology Association (the trade organization that runs the show) we have a full itinerary of press conferences. We’re also using our experience and expertise to predict what tech trends could rear their heads at the show.The CES 2026 schedulePress conferences and show floor booths are the bread and butter of CES. The CTA has already published a searchable directory of who will have an official presence at the show, along with a schedule of every official panel and presentation. However, the press conference schedule gives us a more digestible rundown of the first 48 hours of big events. On Sunday, January 4, Samsung will kick-off CES with \"The First Look,\" a presentation hosted by TM Roh, the CEO of Samsung's DX Division, on the company's \"vision for the DX (Device eXperience) Division in 2026, along with new AI-driven customer experiences.\" Ahead of that, though, Samsung has already outlined a variety of more specifics (scroll down for details). Concurrent with the Samsung presentation will be the official CES Unveiled mini-show, which is generally comprised of smaller and start-up vendors. That'll be followed by multiple press conferences throughout Monday, January 5. The LG CES 2026 press conference, titled \"Innovation in Tune with You,\" is ostensibly to share \"its vision for elevating daily life through Affectionate Intelligence.\" But, like Samsung, this fellow Korean giant has already spent the three weeks leading up to CES pre-announcing many of its new products, so this may be more of a summary than breaking news. Following LG, we’ll also see press conferences from Bosch and Hisense, as well as the first-ever CES appearance from Lego. As the Las Vegas afternoon rolls around, we get the first of three chip giants: NVIDIA CEO Jensen Huang takes the stage on January 5 at 1PM PT (4PM ET) and, according to the website, his presentation will last about 90 minutes. Based on the description on the listing, the presentation will “showcase the latest NVIDIA solutions driving innovation and productivity across industries.” NVIDIA’s presser is concurrent with one from Hyundai, where the Korean automotive company will focus on in-cabin car tech and robotics. Later in the day, we get to hear from NVIDIA frenemies Intel and AMD. Intel’s 3PM PT (6PM PT) event will ostensibly feature its new Core Ultra Series 3 processors, and AMD CEO Lisa Su will cover AMD's upcoming chip announcements at a keynote address that closes out the day. But expect both of them to be very heavy on AI applications, of course. Sandwiched in between those chip manufacturers will be Sony Honda Mobility. The joint venture will be offering yet more details on its Afeela EV. Finally, on Tuesday, January 6, Lenovo CEO Yuanqing Yang will host Lenovo's Tech World Conference at the Las Vegas Sphere, using the large and decidedly curved screen to share the company's \"commitment to delivering smarter AI for all by constantly redefining how technology can engage, inspire, and empower.\" It’s worth noting that Lenovo is the parent company of Motorola, which still makes phones and foldables that feature AI tools, so it’s possible those devices feature in the presentation as well. Samsung and LG vie for pre-show publicityAs noted above, both Samsung and LG have continued their recent trend of spoiling nearly all of their respective CES announcements in the days and weeks before the show. LG, for example, has said it will debut its first Micro RGB television at CES. While details are scarce, the company’s press release for the LG Micro RGB evo did confirm it has received certifications by Intertek for 100 percent color gamut coverage in DCI-P3 an Adobe RGB, and that it has more than a thousand dimming zones for brightness control. Elsewhere in the TV space, LG is throwing its hat into the “art TV” ring that Samsung pioneered with its Frame TVs: The LG Gallery TV will debut in 55- and 65-inch screen sizes, and it will of course show off various artwork when it’s not otherwise in use. And if PC gaming displays are more your speed, LG will have that covered, too, with a new line of 5K-capable gaming monitors on deck with built-in AI upscaling.But LG’s not just showing off displays. The Korean multinational will also introduce a Dolby-powered modular home audio system, a new line of its xboom speakers (developed with will.i.am) and the company will flex its automation muscles with a humanoid home automation robot named CLOiD. Of course, Samsung refuses to be outdone by its hometown rival, and has also released a pre-CES press release document dump. Samsung will be launching its own lineup of Micro RGB TVs at CES, for starters. The company already introduced its first Micro RGB TV at CES 2025, which was a 115-inch model available for a cool $30,000. Next year, Samsung is expanding the range with 55-, 65-, 75-, 85-, 100- and 115-inch models that use the next evolution of the company’s Micro RGB technology. Samsung is also countering LG’s 5K monitors with a 6K model that aims to deliver glasses-free 3D (another long-time CES staple). It’ll be one of several new displays in the company’s Odyssey gaming line.And on the audio front, Samsung has teased several new soundbars and speakers, including Sonos-style Wi-Fi streaming models call the Music Studio 5 and Studio 7.Outside of the formal introduction of new products and initiatives, reading the tea leaves of what was announced last year and what companies are reportedly working on, we can make some educated guesses at what we could see at CES 2026.New chips from AMD, Intel and QualcommCES is frequently the start of a cascade of new chip announcements for a given year, and one of the first places new silicon appears in real consumer products. AMD will likely use its keynote to introduce new versions of its Ryzen chips, including the recently spotted Ryzen 7 9850X3D, which is expected to offer better single-threaded performance, and the Ryzen 9000G series, which could be built with AMD's Zen 5 architecture. The company might also use its CES stage to go over its new FSR Redstone AI upscaling tech.Intel has already publicly announced that it'll launch its Panther Lake chips at CES 2026. The officially titled Intel Core Ultra Series 3 chips fit into Intel's overall \"AI PC\" push, but are specifically meant for premium laptops. Based on a preview from October 2025, Intel says the first chip made with its 2-nanometer 18A process will offer 50 percent more processing performance than previous generations and for the chip's Arc GPU, a 50 percent performance bump from last generation.Qualcomm is also rumored to be targeting laptops at the show, building on the work it's done moving its Snapdragon chips out of phones and tablets and into other types of computers. The company's Snapdragon X2 Elite and X2 Elite Premium chips should start appearing in laptops at CES 2026, offering a look at the improved speed and AI performance the company promised in 2025.Brighter, \"truer\" screensAs noted above, Samsung and LG appear to be going all-in on Micro RGB display tech for TVs. Expect that to be a huge buzzword at CES, with Hisense and Sony debuting new models, too.Sony announced a collection of new Bravia TVs in April 2025, replacing the company's flagship, filling in its midrange options and adding a new budget model to the mix. The star of this updated Bravia lineup is the Bravia 9, which features a QD-OLED panel, but Sony appears to be prepping entirely new display tech for 2026. In March 2025, Sony introduced a new RGB LED panel that uses individual Mini LED backlights colored in red, green and blue to produce even brighter, more accurate colors. In contrast to a QD-OLED, which filters a layer of blue organic light emitting diodes through quantum dots that change color, Sony's \"General RGB LED Backlight Technology\" can get as bright as a Mini LED panel without needing an extra filter layer or worrying about OLED's problems with burn-in. The company has already trademarked the name \"True RGB,\" which could end up being what Sony calls this new flavor of display if it decides to show them off at CES. It seems entirely likely, because CES is nothing if not a TV show — it’s a sure bet that we’ll see new TVs from the likes of LG and Samsung in addition to Sony. If the company doesn't introduce new display tech for its TVs, it does have a new 240Hz PlayStation monitor coming in 2026 that it could show off at CES instead.Sony isn't the only company hyped on bright screens. Samsung is reportedly pushing an updated version of the HDR10 and HDR10+ standards that could be ready to demo at CES 2026. The new HDR10+ Advanced standard would be Samsung's answer to Dolby Vision 2, which includes support for things bi-directional tone mapping and intelligent features that automatically adapt sports and gaming content. Samsung's take will reportedly offer improved brightness, genre-based tone mapping and intelligent motion smoothing options, among other improvements.And maybe your future TV won’t need a power cord, either: Displace will be showing off a mounting option that includes a 15,000mAh battery to juice up whatever giant TV screen you choose to attach.Ballie Watch 2026The ball-shaped yellow robot lovingly known as \"Ballie\" has been announced twice, first in 2020 and then again in 2024 with a projector in tow. Samsung said Ballie would go on sale in 2025 at CES last year and then shared in April 2025 that Ballie would ship this summer with Google's Gemini onboard. But it's nearly 2026, and Ballie is nowhere to be seen. It's possible Samsung could make a third attempt at announcing its robot at CES 2026, but whether or not it does, robotics will still be a big part of the show.Robot vacuums and mops were a major highlight of CES 2025, and it's safe to expect notable improvements from the new models that are announced at CES 2026. Not every company will adopt the retractable arm of the Roborock Saros Z70, but robot vacuums with legs for rising over small ledges like the Dreame X50 seem like they could become the norm. Roborock could also show off its new Roborock Qrevo Curv 2 Flow, the first of its robot vacuums to feature a retractable roller mop.Beyond just traversing spaces more efficiently, improving robots' navigation could also be a major concern at the show. Prominent members of the AI industry are turning their attention from large language models to world models, which aim to give AI a deep understanding of physical space. Those world models could be the key to making robots — like LG’s aforementioned CLOiD — competent at navigating homes and workplaces, and will likely be a significant talking point at CES 2026.We’ll be updating this article throughout the month as more rumors surface and new products are confirmed — stay tuned for future updates!Update, December 11 2025, 11:03AM ET: This story has been updated to include detail on Lenovo being Motorola’s parent company and how the latter might have a part in the Tuesday presentation.Update, December 16 2025, 1:33PM ET: This story has been updated to include the NVIDIA press conference, which was added to the CTA schedule within the last two days.Update, December 23 2025, 7:28AM ET: This story has been updated to include LG and Samsung’s Micro RGB TV announcements, which were made public in the past seven days. The intro was also tweaked to reflect how soon CES is at this point.Update, December 29 2025, 11:03AM ET: This story has been updated to include additional details on pre-announcements from Samsung, LG and Displace. Update, December 31 2025, 12:05PM ET: This story has been updated to include yet more early LG announcements.This article originally appeared on Engadget at https://www.engadget.com/big-tech/ces-2026-what-to-expect-when-techs-biggest-conference-starts-on-january-4-120000189.html?src=rss",
          "content": "The new year is upon us, and that means CES 2026 is imminent. The biggest tech trade show of the calendar comes with a bevy of new and notable announcements that set the tone for trends and expectations for the subsequent 12 months. The CES 2026 show floor is officially open from January 6 through 9, but the fun kicks off with events on Sunday January 4, followed by a host of press conferences on Monday. As always, product demos, announcements and networking will be happening at the Las Vegas Convention Center and other hotels all over the city. As usual, Engadget will be covering the event in-person and remotely, bringing you news and hands-ons straight from the show floor.More specific details and pre-announcements are already trickling out as CES approaches, and thanks to the schedule of the Consumer Technology Association (the trade organization that runs the show) we have a full itinerary of press conferences. We’re also using our experience and expertise to predict what tech trends could rear their heads at the show.The CES 2026 schedulePress conferences and show floor booths are the bread and butter of CES. The CTA has already published a searchable directory of who will have an official presence at the show, along with a schedule of every official panel and presentation. However, the press conference schedule gives us a more digestible rundown of the first 48 hours of big events. On Sunday, January 4, Samsung will kick-off CES with \"The First Look,\" a presentation hosted by TM Roh, the CEO of Samsung's DX Division, on the company's \"vision for the DX (Device eXperience) Division in 2026, along with new AI-driven customer experiences.\" Ahead of that, though, Samsung has already outlined a variety of more specifics (scroll down for details). Concurrent with the Samsung presentation will be the official CES Unveiled mini-show, which is generally comprised of smaller and start-up vendors. That'll be followed by multiple press conferences throughout Monday, January 5. The LG CES 2026 press conference, titled \"Innovation in Tune with You,\" is ostensibly to share \"its vision for elevating daily life through Affectionate Intelligence.\" But, like Samsung, this fellow Korean giant has already spent the three weeks leading up to CES pre-announcing many of its new products, so this may be more of a summary than breaking news. Following LG, we’ll also see press conferences from Bosch and Hisense, as well as the first-ever CES appearance from Lego. As the Las Vegas afternoon rolls around, we get the first of three chip giants: NVIDIA CEO Jensen Huang takes the stage on January 5 at 1PM PT (4PM ET) and, according to the website, his presentation will last about 90 minutes. Based on the description on the listing, the presentation will “showcase the latest NVIDIA solutions driving innovation and productivity across industries.” NVIDIA’s presser is concurrent with one from Hyundai, where the Korean automotive company will focus on in-cabin car tech and robotics. Later in the day, we get to hear from NVIDIA frenemies Intel and AMD. Intel’s 3PM PT (6PM PT) event will ostensibly feature its new Core Ultra Series 3 processors, and AMD CEO Lisa Su will cover AMD's upcoming chip announcements at a keynote address that closes out the day. But expect both of them to be very heavy on AI applications, of course. Sandwiched in between those chip manufacturers will be Sony Honda Mobility. The joint venture will be offering yet more details on its Afeela EV. Finally, on Tuesday, January 6, Lenovo CEO Yuanqing Yang will host Lenovo's Tech World Conference at the Las Vegas Sphere, using the large and decidedly curved screen to share the company's \"commitment to delivering smarter AI for all by constantly redefining how technology can engage, inspire, and empower.\" It’s worth noting that Lenovo is the parent company of Motorola, which still makes phones and foldables that feature AI tools, so it’s possible those devices feature in the presentation as well. Samsung and LG vie for pre-show publicityAs noted above, both Samsung and LG have continued their recent trend of spoiling nearly all of their respective CES announcements in the days and weeks before the show. LG, for example, has said it will debut its first Micro RGB television at CES. While details are scarce, the company’s press release for the LG Micro RGB evo did confirm it has received certifications by Intertek for 100 percent color gamut coverage in DCI-P3 an Adobe RGB, and that it has more than a thousand dimming zones for brightness control. Elsewhere in the TV space, LG is throwing its hat into the “art TV” ring that Samsung pioneered with its Frame TVs: The LG Gallery TV will debut in 55- and 65-inch screen sizes, and it will of course show off various artwork when it’s not otherwise in use. And if PC gaming displays are more your speed, LG will have that covered, too, with a new line of 5K-capable gaming monitors on deck with built-in AI upscaling.But LG’s not just showing off displays. The Korean multinational will also introduce a Dolby-powered modular home audio system, a new line of its xboom speakers (developed with will.i.am) and the company will flex its automation muscles with a humanoid home automation robot named CLOiD. Of course, Samsung refuses to be outdone by its hometown rival, and has also released a pre-CES press release document dump. Samsung will be launching its own lineup of Micro RGB TVs at CES, for starters. The company already introduced its first Micro RGB TV at CES 2025, which was a 115-inch model available for a cool $30,000. Next year, Samsung is expanding the range with 55-, 65-, 75-, 85-, 100- and 115-inch models that use the next evolution of the company’s Micro RGB technology. Samsung is also countering LG’s 5K monitors with a 6K model that aims to deliver glasses-free 3D (another long-time CES staple). It’ll be one of several new displays in the company’s Odyssey gaming line.And on the audio front, Samsung has teased several new soundbars and speakers, including Sonos-style Wi-Fi streaming models call the Music Studio 5 and Studio 7.Outside of the formal introduction of new products and initiatives, reading the tea leaves of what was announced last year and what companies are reportedly working on, we can make some educated guesses at what we could see at CES 2026.New chips from AMD, Intel and QualcommCES is frequently the start of a cascade of new chip announcements for a given year, and one of the first places new silicon appears in real consumer products. AMD will likely use its keynote to introduce new versions of its Ryzen chips, including the recently spotted Ryzen 7 9850X3D, which is expected to offer better single-threaded performance, and the Ryzen 9000G series, which could be built with AMD's Zen 5 architecture. The company might also use its CES stage to go over its new FSR Redstone AI upscaling tech.Intel has already publicly announced that it'll launch its Panther Lake chips at CES 2026. The officially titled Intel Core Ultra Series 3 chips fit into Intel's overall \"AI PC\" push, but are specifically meant for premium laptops. Based on a preview from October 2025, Intel says the first chip made with its 2-nanometer 18A process will offer 50 percent more processing performance than previous generations and for the chip's Arc GPU, a 50 percent performance bump from last generation.Qualcomm is also rumored to be targeting laptops at the show, building on the work it's done moving its Snapdragon chips out of phones and tablets and into other types of computers. The company's Snapdragon X2 Elite and X2 Elite Premium chips should start appearing in laptops at CES 2026, offering a look at the improved speed and AI performance the company promised in 2025.Brighter, \"truer\" screensAs noted above, Samsung and LG appear to be going all-in on Micro RGB display tech for TVs. Expect that to be a huge buzzword at CES, with Hisense and Sony debuting new models, too.Sony announced a collection of new Bravia TVs in April 2025, replacing the company's flagship, filling in its midrange options and adding a new budget model to the mix. The star of this updated Bravia lineup is the Bravia 9, which features a QD-OLED panel, but Sony appears to be prepping entirely new display tech for 2026. In March 2025, Sony introduced a new RGB LED panel that uses individual Mini LED backlights colored in red, green and blue to produce even brighter, more accurate colors. In contrast to a QD-OLED, which filters a layer of blue organic light emitting diodes through quantum dots that change color, Sony's \"General RGB LED Backlight Technology\" can get as bright as a Mini LED panel without needing an extra filter layer or worrying about OLED's problems with burn-in. The company has already trademarked the name \"True RGB,\" which could end up being what Sony calls this new flavor of display if it decides to show them off at CES. It seems entirely likely, because CES is nothing if not a TV show — it’s a sure bet that we’ll see new TVs from the likes of LG and Samsung in addition to Sony. If the company doesn't introduce new display tech for its TVs, it does have a new 240Hz PlayStation monitor coming in 2026 that it could show off at CES instead.Sony isn't the only company hyped on bright screens. Samsung is reportedly pushing an updated version of the HDR10 and HDR10+ standards that could be ready to demo at CES 2026. The new HDR10+ Advanced standard would be Samsung's answer to Dolby Vision 2, which includes support for things bi-directional tone mapping and intelligent features that automatically adapt sports and gaming content. Samsung's take will reportedly offer improved brightness, genre-based tone mapping and intelligent motion smoothing options, among other improvements.And maybe your future TV won’t need a power cord, either: Displace will be showing off a mounting option that includes a 15,000mAh battery to juice up whatever giant TV screen you choose to attach.Ballie Watch 2026The ball-shaped yellow robot lovingly known as \"Ballie\" has been announced twice, first in 2020 and then again in 2024 with a projector in tow. Samsung said Ballie would go on sale in 2025 at CES last year and then shared in April 2025 that Ballie would ship this summer with Google's Gemini onboard. But it's nearly 2026, and Ballie is nowhere to be seen. It's possible Samsung could make a third attempt at announcing its robot at CES 2026, but whether or not it does, robotics will still be a big part of the show.Robot vacuums and mops were a major highlight of CES 2025, and it's safe to expect notable improvements from the new models that are announced at CES 2026. Not every company will adopt the retractable arm of the Roborock Saros Z70, but robot vacuums with legs for rising over small ledges like the Dreame X50 seem like they could become the norm. Roborock could also show off its new Roborock Qrevo Curv 2 Flow, the first of its robot vacuums to feature a retractable roller mop.Beyond just traversing spaces more efficiently, improving robots' navigation could also be a major concern at the show. Prominent members of the AI industry are turning their attention from large language models to world models, which aim to give AI a deep understanding of physical space. Those world models could be the key to making robots — like LG’s aforementioned CLOiD — competent at navigating homes and workplaces, and will likely be a significant talking point at CES 2026.We’ll be updating this article throughout the month as more rumors surface and new products are confirmed — stay tuned for future updates!Update, December 11 2025, 11:03AM ET: This story has been updated to include detail on Lenovo being Motorola’s parent company and how the latter might have a part in the Tuesday presentation.Update, December 16 2025, 1:33PM ET: This story has been updated to include the NVIDIA press conference, which was added to the CTA schedule within the last two days.Update, December 23 2025, 7:28AM ET: This story has been updated to include LG and Samsung’s Micro RGB TV announcements, which were made public in the past seven days. The intro was also tweaked to reflect how soon CES is at this point.Update, December 29 2025, 11:03AM ET: This story has been updated to include additional details on pre-announcements from Samsung, LG and Displace. Update, December 31 2025, 12:05PM ET: This story has been updated to include yet more early LG announcements.This article originally appeared on Engadget at https://www.engadget.com/big-tech/ces-2026-what-to-expect-when-techs-biggest-conference-starts-on-january-4-120000189.html?src=rss",
          "feed_position": 16
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/cybersecurity/vpn/how-to-use-a-vpn-140000564.html",
          "published_at": "Wed, 31 Dec 2025 14:00:00 +0000",
          "title": "How to use a VPN",
          "standfirst": "Chances are that if a VPN is marketed to everyday users, it more or less runs itself. As long as you go with one of the best VPNs instead of setting up your own manual connection, the interface is likely built so you have to engage with it as little as possible. Generally, if you find yourself constantly thinking about your VPN while using it — as happened to me with Norton VPN — that's a bad thing and you should change providers.That said, it's still useful to get a high-level view of how to use a VPN, especially if you've never used one before. In this article, I'll walk you through how to download, install and configure a VPN on any platform and how to choose servers for specific situations. I'll also discuss specific steps for desktop and laptop computers, phones, tablets, smart TVs, game consoles and routers.How to download and install a VPNThere are over 100 VPNs available on the internet and the two big mobile app stores, but most of them follow a similar approach to download and installation. Except for certain free VPNs, you'll need to create an account on the VPN provider's website, install the VPN client, then use your account to log in. Here are the steps.In a web browser, navigate to a VPN provider's website. For suggestions on where to start, check out our list of the best VPN deals. Click any link that mentions getting the VPN or claiming the deal — as a rule, they aren't hard to find.Select a plan based on the length of time you need the VPN for, the features you want and the number of devices you'd like to use the VPN on simultaneously. Add a payment method. You'll be prompted to create the username and password for a new account.On desktop, you can start with the Mac or Windows app store, though some VPNs require a download directly from their respective website. That’s generally the way to get the most feature-rich version of the VPN, but just make sure you’re downloading from the provider’s website to ensure you don’t get a malicious copycat. On mobile, the app store is your only choice, but don't forget to check the reviews and make sure you're getting the service you paid for — unfortunately, rival (and sometimes less scrupulous) VPN brands can use paid placements to appear higher on search results, even for a rival product. Follow the pre-programmed installation flow. Again, don't let a VPN make any changes to your system if you haven't thoroughly vetted the provider (or gone with one of our recommendations). If it's safe, allow the VPN all the setup permissions it needs.Finally, open the VPN client and sign in with the credentials you created in step two. You're now ready to start using your new VPN.Surfshark in Mac downloads folderSam Chapman for EngadgetWith so many VPNs on the market, this process won't always be the same. Sometimes you'll have to make the account before paying, and some mobile VPNs let you handle the whole process in-app. What's always true, though, is that a good VPN will make the signup flow as easy as possible. If you have trouble before you even log in, that's a red flag.How to configure a VPN appMost VPNs are ready to go out of the box. However, even if you don't think you're a power user, it's a good idea to go through the settings and make sure they match what you need. Here are a few steps I recommend taking.Activate the kill switch. This feature monitors your connection to the VPN server. If it ever drops — either from problems in the server, your client or somewhere in between — the kill switch instantly cuts off your internet until your VPN connection is restored. This saves you from accidentally broadcasting anything sensitive while also ensuring you only connect to legitimate VPN servers (avoiding the Tunnelvision bug).Set up favorites and profiles. VPNs usually let you select servers you'll use regularly, websites you'll often connect to through the VPN and other preferences that will appear immediately when you open the app. Some go further, like Proton VPN, which lets you create user profiles that bundle several preferences together.Decide if you want the VPN to automatically launch and connect when you start up your computer.Check on split tunneling. There may be cases where you want a certain app or site to work outside the VPN, or where you want everything to go unencrypted except one site or app. You can set up a split tunnel when you need it, but if there's one you know you'll use regularly, it helps to build it early.Activate or deactivate any content blockers the VPN comes with, including ad blockers, malware detectors and parental controls, as you see fit.Decide whether you want the VPN to send you notifications, and how.Select a VPN protocol. It's almost always best to let the VPN choose for itself, but it's helpful to at least know where the protocol-switching option is. Occasionally, if one protocol isn't working, you can troubleshoot by selecting another.You can do all this by digging into your VPN's preferences control panel. A gear seems to be the universal icon for that, but Mac users may also find it by picking \"preferences\" or \"settings\" from the menu bar. When you find the preferences menu, go through each tab in turn and make sure everything is the way you like it.How to choose a VPN serverPicking a server location is the final box to check before connecting. You nearly always have the option of letting the VPN pick the best server. Most apps tend to determine the best server with a latency test, so it will almost always be a node very close to your physical location.If you just want anonymity online, that's fine — it doesn't matter which IP address you use as long as it's not your real one. But several VPN use cases do require a specific server location. For those, follow one simple rule: Pick a server in the place you want your signal to come from.Choosing locations on SurfsharkSam Chapman for EngadgetFor example, let's say you want to watch The Office, but you're only subscribed to Netflix and not Peacock. Luckily, Netflix is licensed to show The Office in the U.K. If you connect to a British server location before opening Netflix, you'll be able to access the show without paying for an extra subscription. (Of course, make sure VPNs aren’t expressly banned by the streaming service’s terms of service before accessing it while using one.)Other than streaming, the most common reason you'll need a specific VPN server is to get around firewalls that block websites. Whether it's your school doing the censorship, your workplace or your entire state, the solution is the same: Pick a VPN server outside the restricted region. Censorship systems filter by location — they can't block where they don't have jurisdiction. Get a new virtual location and you should be free and clear. (Always be cognizant of the laws on VPN usage in your location before activating them.)When to use a VPN (and when not to)It's good to get into the habit of connecting to your VPN whenever you get online. You can never be sure what information your ISP is gathering on you. If you're using unprotected Wi-Fi, or a public network with a clearly visible password, anybody might be listening in. Even if you don't need a particular location, always be using your VPN.The only reason you might want to be online without a VPN is that certain websites, especially online banks, get suspicious if they note repeated logins to the same account from too many different IP addresses. For those cases, you can either set up a split tunnel to exclude the website from encryption, or temporarily turn your VPN off altogether.Instructions for specific devicesAlthough most VPNs try to keep their apps similar on every platform, the strictures of differing hardware and software lead them to install and operate differently. In case you still have questions after reading the general guide above, this section goes into detail on every platform where you might use a VPN.How to use a VPN on desktopAfter subscribing to a VPN on Windows, you should be directed to download an EXE file — if this doesn't happen, log into your account on the website and find the downloads center. Find the folder where the EXE is saved, double-click it and follow the onscreen instructions.On Mac, the process is more or less the same, except you'll usually get a PKG file instead of an EXE. Go to your downloads folder (either in Finder or through your web browser) and double-click the PKG file. Grant the VPN whatever permissions it needs. (Again, this is why it’s important to only use a legitimate vendor, such as the ones we recommend.)Once installed, you can open the VPN client at any time by double-clicking the icon again. Some VPNs open as separate windows, while others will add icons to your toolbar. This often varies by platform; if you're concerned that your VPN doesn't look like a screenshot you've seen, check which operating system the image comes from.How to use a VPN on mobileOn Android and iOS, you'll download your VPN app through the Google Play Store or Apple App Store, respectively. Even if you get started through a mobile browser, it will probably redirect you to the app store for the actual download and installation.Follow the usual step for downloading an app: search for its name in the app store, click \"Get\" or \"Install,\" then let your phone cook. As always, so long as it's a vetted VPN, grant it the permissions it needs. You may be able to download and install the VPN first, then create your account and submit payment through the app afterward.One final note: several leading VPNs offer free trials for mobile users. If you see a button that says something like \"get free trial,\" you may be able to use the VPN for several days without paying. Just be warned that if the trial lapses, you might get automatically signed up for a plan that's longer than you'd like.How to use a VPN browser extensionVPNs offer browser extensions as lightweight versions of their main clients. While a desktop or mobile VPN reroutes everything that device sends to the internet, a browser extension only protects traffic through your web browser. You can use one as a primitive form of split tunneling, but they're mainly for basic convenience — most of what you do online goes through a browser, so it's nice to be able to protect your connection without opening a separate app.NordVPN browser extension on ChromeSam Chapman for EngadgetTo use a VPN browser extension, just create your account as normal, then download the extension from your VPN's website. You can manage it from your browser's extensions center. That's a jigsaw piece at the top-right corner on most browsers, including Chrome, Edge and Firefox.How to use a VPN on a smart TVYou can use a VPN to change your location and stream international content directly to a smart TV. The catch is that not all smart TV brands support VPN apps. For those that don't, you'll have to find a workaround.The good news is that a ton of the best smart TVs can natively host VPNs, including Google TV, Android TV, Amazon Fire TV and Apple TV (though only tvOS 17 and above). To use a VPN on Android TV or Apple TV, go through the device's app store. On Fire TV, simply type the name of your chosen VPN provider into the search bar.On smart TVs that don't have native VPN, like LG, Roku and Samsung, you have a few options. You can use a smart DNS feature like ExpressVPN's MediaStreamer to reroute smart TV traffic without full VPN encryption; the steps for this are different for every VPN, so check the provider's website. You can also install a VPN on your router (see below) so your smart TV automatically uses the router's location.Finally, you can get a temporary fix by using your computer as a Wi-Fi hotspot while it has a VPN active. Follow the steps for your operating system.On Windows:In your system settings, go to \"Network & Internet\" and turn on the mobile hotspot.Go to \"Network & Sharing Center\" and click \"Change adapter settings.\"Right-click the name of your VPN provider and go to \"Properties,\" then \"Sharing.\"Check the boxes next to \"Allow other network users to connect through this computer's internet connection\" and \"Allow other network users to control or disable the shared internet connection.\"Click the \"Home networking connection\" dropdown and select \"Microsoft Wi-Fi Direct Virtual Adapter.\"Open your VPN client and connect to a server in your desired location.On your smart TV, open the internet connections menu and select the name of your PC. Your TV is now online through the VPN server.On Mac:Open system settings and go to the \"General\" tab. Scroll down and click \"Sharing.\"Toggle \"Internet Sharing\" on, then click on \"Configure.\"Click the \"Share your connection from\" dropdown, then choose the VPN installed on the Mac. Under \"To computers using,\" select \"Wi-Fi.\"Click on \"Wi-Fi options\" and enter a name and password for your hotspot network.On your smart TV, connect to the network you just created.How to use a VPN on a game consoleRight now, there's no such thing as a game console with native VPN support. If you want to use a VPN while gaming — and I recommend that for safety if you're planning to play online — you can use two of the same methods that work for a smart TV: install a VPN on your router, or get your console online through a Mac or PC hotspot.How to install a VPN on a routerWhen you install a router VPN, anything that gets online through your home network will be protected, including game consoles, TVs and smart devices that don't support VPNs natively. It's not a process for the faint of heart, though. You'll need to get a new router and potentially install VPN firmware on it yourself. If you want to go this route, the easiest option is to get an ExpressVPN Aircove router — not only does it come with all the settings done for you, but it can be managed through the same clean interface as ExpressVPN's other apps.We don't have space here to go through the entire process, but here's a general overview. First, get a router with firmware that supports VPN configurations — most ISP default routers don't, so you'll have to go third-party.Next, go to the downloads center of your VPN's website and look for the section with VPN configurations. A \"configuration\" is a complete set of the information needed to access a certain VPN server through a certain protocol — say, a Proton VPN server in Arizona through OpenVPN. Download a configuration file for the protocol and location you want all your home devices to connect through.Finally, open your router control panel by entering your router's IP address into a web browser address bar, then log in with your router credentials (these should be marked on the router itself unless you've changed them). Go to the VPN tab — which should be there if it's a router with VPN firmware — and upload the profile you downloaded from the VPN website. Use the same router control panel to activate and deactivate the router VPN connection.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-use-a-vpn-140000564.html?src=rss",
          "content": "Chances are that if a VPN is marketed to everyday users, it more or less runs itself. As long as you go with one of the best VPNs instead of setting up your own manual connection, the interface is likely built so you have to engage with it as little as possible. Generally, if you find yourself constantly thinking about your VPN while using it — as happened to me with Norton VPN — that's a bad thing and you should change providers.That said, it's still useful to get a high-level view of how to use a VPN, especially if you've never used one before. In this article, I'll walk you through how to download, install and configure a VPN on any platform and how to choose servers for specific situations. I'll also discuss specific steps for desktop and laptop computers, phones, tablets, smart TVs, game consoles and routers.How to download and install a VPNThere are over 100 VPNs available on the internet and the two big mobile app stores, but most of them follow a similar approach to download and installation. Except for certain free VPNs, you'll need to create an account on the VPN provider's website, install the VPN client, then use your account to log in. Here are the steps.In a web browser, navigate to a VPN provider's website. For suggestions on where to start, check out our list of the best VPN deals. Click any link that mentions getting the VPN or claiming the deal — as a rule, they aren't hard to find.Select a plan based on the length of time you need the VPN for, the features you want and the number of devices you'd like to use the VPN on simultaneously. Add a payment method. You'll be prompted to create the username and password for a new account.On desktop, you can start with the Mac or Windows app store, though some VPNs require a download directly from their respective website. That’s generally the way to get the most feature-rich version of the VPN, but just make sure you’re downloading from the provider’s website to ensure you don’t get a malicious copycat. On mobile, the app store is your only choice, but don't forget to check the reviews and make sure you're getting the service you paid for — unfortunately, rival (and sometimes less scrupulous) VPN brands can use paid placements to appear higher on search results, even for a rival product. Follow the pre-programmed installation flow. Again, don't let a VPN make any changes to your system if you haven't thoroughly vetted the provider (or gone with one of our recommendations). If it's safe, allow the VPN all the setup permissions it needs.Finally, open the VPN client and sign in with the credentials you created in step two. You're now ready to start using your new VPN.Surfshark in Mac downloads folderSam Chapman for EngadgetWith so many VPNs on the market, this process won't always be the same. Sometimes you'll have to make the account before paying, and some mobile VPNs let you handle the whole process in-app. What's always true, though, is that a good VPN will make the signup flow as easy as possible. If you have trouble before you even log in, that's a red flag.How to configure a VPN appMost VPNs are ready to go out of the box. However, even if you don't think you're a power user, it's a good idea to go through the settings and make sure they match what you need. Here are a few steps I recommend taking.Activate the kill switch. This feature monitors your connection to the VPN server. If it ever drops — either from problems in the server, your client or somewhere in between — the kill switch instantly cuts off your internet until your VPN connection is restored. This saves you from accidentally broadcasting anything sensitive while also ensuring you only connect to legitimate VPN servers (avoiding the Tunnelvision bug).Set up favorites and profiles. VPNs usually let you select servers you'll use regularly, websites you'll often connect to through the VPN and other preferences that will appear immediately when you open the app. Some go further, like Proton VPN, which lets you create user profiles that bundle several preferences together.Decide if you want the VPN to automatically launch and connect when you start up your computer.Check on split tunneling. There may be cases where you want a certain app or site to work outside the VPN, or where you want everything to go unencrypted except one site or app. You can set up a split tunnel when you need it, but if there's one you know you'll use regularly, it helps to build it early.Activate or deactivate any content blockers the VPN comes with, including ad blockers, malware detectors and parental controls, as you see fit.Decide whether you want the VPN to send you notifications, and how.Select a VPN protocol. It's almost always best to let the VPN choose for itself, but it's helpful to at least know where the protocol-switching option is. Occasionally, if one protocol isn't working, you can troubleshoot by selecting another.You can do all this by digging into your VPN's preferences control panel. A gear seems to be the universal icon for that, but Mac users may also find it by picking \"preferences\" or \"settings\" from the menu bar. When you find the preferences menu, go through each tab in turn and make sure everything is the way you like it.How to choose a VPN serverPicking a server location is the final box to check before connecting. You nearly always have the option of letting the VPN pick the best server. Most apps tend to determine the best server with a latency test, so it will almost always be a node very close to your physical location.If you just want anonymity online, that's fine — it doesn't matter which IP address you use as long as it's not your real one. But several VPN use cases do require a specific server location. For those, follow one simple rule: Pick a server in the place you want your signal to come from.Choosing locations on SurfsharkSam Chapman for EngadgetFor example, let's say you want to watch The Office, but you're only subscribed to Netflix and not Peacock. Luckily, Netflix is licensed to show The Office in the U.K. If you connect to a British server location before opening Netflix, you'll be able to access the show without paying for an extra subscription. (Of course, make sure VPNs aren’t expressly banned by the streaming service’s terms of service before accessing it while using one.)Other than streaming, the most common reason you'll need a specific VPN server is to get around firewalls that block websites. Whether it's your school doing the censorship, your workplace or your entire state, the solution is the same: Pick a VPN server outside the restricted region. Censorship systems filter by location — they can't block where they don't have jurisdiction. Get a new virtual location and you should be free and clear. (Always be cognizant of the laws on VPN usage in your location before activating them.)When to use a VPN (and when not to)It's good to get into the habit of connecting to your VPN whenever you get online. You can never be sure what information your ISP is gathering on you. If you're using unprotected Wi-Fi, or a public network with a clearly visible password, anybody might be listening in. Even if you don't need a particular location, always be using your VPN.The only reason you might want to be online without a VPN is that certain websites, especially online banks, get suspicious if they note repeated logins to the same account from too many different IP addresses. For those cases, you can either set up a split tunnel to exclude the website from encryption, or temporarily turn your VPN off altogether.Instructions for specific devicesAlthough most VPNs try to keep their apps similar on every platform, the strictures of differing hardware and software lead them to install and operate differently. In case you still have questions after reading the general guide above, this section goes into detail on every platform where you might use a VPN.How to use a VPN on desktopAfter subscribing to a VPN on Windows, you should be directed to download an EXE file — if this doesn't happen, log into your account on the website and find the downloads center. Find the folder where the EXE is saved, double-click it and follow the onscreen instructions.On Mac, the process is more or less the same, except you'll usually get a PKG file instead of an EXE. Go to your downloads folder (either in Finder or through your web browser) and double-click the PKG file. Grant the VPN whatever permissions it needs. (Again, this is why it’s important to only use a legitimate vendor, such as the ones we recommend.)Once installed, you can open the VPN client at any time by double-clicking the icon again. Some VPNs open as separate windows, while others will add icons to your toolbar. This often varies by platform; if you're concerned that your VPN doesn't look like a screenshot you've seen, check which operating system the image comes from.How to use a VPN on mobileOn Android and iOS, you'll download your VPN app through the Google Play Store or Apple App Store, respectively. Even if you get started through a mobile browser, it will probably redirect you to the app store for the actual download and installation.Follow the usual step for downloading an app: search for its name in the app store, click \"Get\" or \"Install,\" then let your phone cook. As always, so long as it's a vetted VPN, grant it the permissions it needs. You may be able to download and install the VPN first, then create your account and submit payment through the app afterward.One final note: several leading VPNs offer free trials for mobile users. If you see a button that says something like \"get free trial,\" you may be able to use the VPN for several days without paying. Just be warned that if the trial lapses, you might get automatically signed up for a plan that's longer than you'd like.How to use a VPN browser extensionVPNs offer browser extensions as lightweight versions of their main clients. While a desktop or mobile VPN reroutes everything that device sends to the internet, a browser extension only protects traffic through your web browser. You can use one as a primitive form of split tunneling, but they're mainly for basic convenience — most of what you do online goes through a browser, so it's nice to be able to protect your connection without opening a separate app.NordVPN browser extension on ChromeSam Chapman for EngadgetTo use a VPN browser extension, just create your account as normal, then download the extension from your VPN's website. You can manage it from your browser's extensions center. That's a jigsaw piece at the top-right corner on most browsers, including Chrome, Edge and Firefox.How to use a VPN on a smart TVYou can use a VPN to change your location and stream international content directly to a smart TV. The catch is that not all smart TV brands support VPN apps. For those that don't, you'll have to find a workaround.The good news is that a ton of the best smart TVs can natively host VPNs, including Google TV, Android TV, Amazon Fire TV and Apple TV (though only tvOS 17 and above). To use a VPN on Android TV or Apple TV, go through the device's app store. On Fire TV, simply type the name of your chosen VPN provider into the search bar.On smart TVs that don't have native VPN, like LG, Roku and Samsung, you have a few options. You can use a smart DNS feature like ExpressVPN's MediaStreamer to reroute smart TV traffic without full VPN encryption; the steps for this are different for every VPN, so check the provider's website. You can also install a VPN on your router (see below) so your smart TV automatically uses the router's location.Finally, you can get a temporary fix by using your computer as a Wi-Fi hotspot while it has a VPN active. Follow the steps for your operating system.On Windows:In your system settings, go to \"Network & Internet\" and turn on the mobile hotspot.Go to \"Network & Sharing Center\" and click \"Change adapter settings.\"Right-click the name of your VPN provider and go to \"Properties,\" then \"Sharing.\"Check the boxes next to \"Allow other network users to connect through this computer's internet connection\" and \"Allow other network users to control or disable the shared internet connection.\"Click the \"Home networking connection\" dropdown and select \"Microsoft Wi-Fi Direct Virtual Adapter.\"Open your VPN client and connect to a server in your desired location.On your smart TV, open the internet connections menu and select the name of your PC. Your TV is now online through the VPN server.On Mac:Open system settings and go to the \"General\" tab. Scroll down and click \"Sharing.\"Toggle \"Internet Sharing\" on, then click on \"Configure.\"Click the \"Share your connection from\" dropdown, then choose the VPN installed on the Mac. Under \"To computers using,\" select \"Wi-Fi.\"Click on \"Wi-Fi options\" and enter a name and password for your hotspot network.On your smart TV, connect to the network you just created.How to use a VPN on a game consoleRight now, there's no such thing as a game console with native VPN support. If you want to use a VPN while gaming — and I recommend that for safety if you're planning to play online — you can use two of the same methods that work for a smart TV: install a VPN on your router, or get your console online through a Mac or PC hotspot.How to install a VPN on a routerWhen you install a router VPN, anything that gets online through your home network will be protected, including game consoles, TVs and smart devices that don't support VPNs natively. It's not a process for the faint of heart, though. You'll need to get a new router and potentially install VPN firmware on it yourself. If you want to go this route, the easiest option is to get an ExpressVPN Aircove router — not only does it come with all the settings done for you, but it can be managed through the same clean interface as ExpressVPN's other apps.We don't have space here to go through the entire process, but here's a general overview. First, get a router with firmware that supports VPN configurations — most ISP default routers don't, so you'll have to go third-party.Next, go to the downloads center of your VPN's website and look for the section with VPN configurations. A \"configuration\" is a complete set of the information needed to access a certain VPN server through a certain protocol — say, a Proton VPN server in Arizona through OpenVPN. Download a configuration file for the protocol and location you want all your home devices to connect through.Finally, open your router control panel by entering your router's IP address into a web browser address bar, then log in with your router credentials (these should be marked on the router itself unless you've changed them). Go to the VPN tab — which should be there if it's a router with VPN firmware — and upload the profile you downloaded from the VPN website. Use the same router control panel to activate and deactivate the router VPN connection.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-use-a-vpn-140000564.html?src=rss",
          "feed_position": 17,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Downloading_Surfshark_on_Mac.png"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/how-to-watch-the-first-ever-lego-ces-2026-press-conference-live-130005307.html",
          "published_at": "Wed, 31 Dec 2025 13:00:05 +0000",
          "title": "How to watch the first-ever Lego CES 2026 press conference live",
          "standfirst": "picture alliance via Getty Images The Lego Group is hosting its first-ever press conference at CES 2026 – but what the company is going to announce remains a mystery. While the huge toy brick creators haven't given any hints as to what they'll be showcasing, the possibilities run the gamut from new video games to Formula 1 race cars. Here's how you can watch Lego's presentation at CES, and what we might expect to see. How to watch The Lego Group's CES 2026 press conference The Lego CES press conference is scheduled for Monday, January 5 at 1PM ET. While Lego and the Consumer Technology Association haven't yet provided the details, we expect that the press conference will be available as a livestream. Once the details are confirmed, we'll update this post to confirm them. But if a livestream isn't immediately available, the Engadget team will be liveblogging the Lego presser and posting timely details. What to expect Thus far, Lego hasn't shared any public info about its CES plans, so we're largely in the dark as to what to expect. At CES 2025, for instance, the toy production giant partnered with Sony to announce the animated Lego Horizon Adventures online game. As such, Lego may spend some time talking up its new 2026 game, Lego Batman: Legacy of the Dark Knight. The company may also give some stage time to its Lego Group F1 Academy racing car, though that too would be more about brand building than consumer products. And given Lego's focus on the environment, the company may discuss its efforts to reach its 2032 ecological goals, including making its Lego bricks more sustainable and reducing carbon emissions by 37%. While there are plenty of new Lego sets for 2026, however, this is CES, not Toy Fair. So we're assuming that the company will be showcasing something that's more tech-centric. Stay tuned.This article originally appeared on Engadget at https://www.engadget.com/gaming/how-to-watch-the-first-ever-lego-ces-2026-press-conference-live-130005307.html?src=rss",
          "content": "picture alliance via Getty Images The Lego Group is hosting its first-ever press conference at CES 2026 – but what the company is going to announce remains a mystery. While the huge toy brick creators haven't given any hints as to what they'll be showcasing, the possibilities run the gamut from new video games to Formula 1 race cars. Here's how you can watch Lego's presentation at CES, and what we might expect to see. How to watch The Lego Group's CES 2026 press conference The Lego CES press conference is scheduled for Monday, January 5 at 1PM ET. While Lego and the Consumer Technology Association haven't yet provided the details, we expect that the press conference will be available as a livestream. Once the details are confirmed, we'll update this post to confirm them. But if a livestream isn't immediately available, the Engadget team will be liveblogging the Lego presser and posting timely details. What to expect Thus far, Lego hasn't shared any public info about its CES plans, so we're largely in the dark as to what to expect. At CES 2025, for instance, the toy production giant partnered with Sony to announce the animated Lego Horizon Adventures online game. As such, Lego may spend some time talking up its new 2026 game, Lego Batman: Legacy of the Dark Knight. The company may also give some stage time to its Lego Group F1 Academy racing car, though that too would be more about brand building than consumer products. And given Lego's focus on the environment, the company may discuss its efforts to reach its 2032 ecological goals, including making its Lego bricks more sustainable and reducing carbon emissions by 37%. While there are plenty of new Lego sets for 2026, however, this is CES, not Toy Fair. So we're assuming that the company will be showcasing something that's more tech-centric. Stay tuned.This article originally appeared on Engadget at https://www.engadget.com/gaming/how-to-watch-the-first-ever-lego-ces-2026-press-conference-live-130005307.html?src=rss",
          "feed_position": 19,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/ced0c170-dd13-11f0-b394-1dea3c7b6af3"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/cameras/best-cameras-151524327.html",
          "published_at": "Wed, 31 Dec 2025 10:01:26 +0000",
          "title": "The best cameras for 2026",
          "standfirst": "Choosing a camera is not just about resolution or price. It is about finding something that matches how you like to shoot. Some photographers want a compact mirrorless camera that travels easily. Others want an action cam that can handle rough hikes, or a full-frame system that delivers the best possible image quality. With so many options today, there is a camera built for almost every creative style.We tested the top models across categories to help you decide which one fits your needs. Whether you are filming your first vlog, shooting portraits or capturing fast-moving action, these are the best cameras to help you grow your skills. Best cameras for 2026 Best mirrorless cameras Mirrorless is the largest camera category in terms of models available, so it’s the best way to go if you’re looking for something with the most advanced features. Canon and Nikon recently announced they’re discontinuing development of new DSLRs, simply because most of the advantages of that category are gone, as I detailed in a video. The biggest selling feature of a mirrorless camera is the ability to change lenses depending on the type of shooting you want to do. Best action camera or gimbal camera The most important features to look for in an action cam are image quality, stabilization and battery life. GoPro has easily been beating all rivals recently in all those areas, but DJI has taken a lot of its business with the Osmo Pocket 3 gimbal camera. Best compact camera This category has fewer cameras than it did even a few years ago and many models are older, as manufacturers focus instead on mirrorless models. However, I’m still a big believer in compact cameras. They’re a noticeable step up from smartphones quality-wise, and a lot of people will take a compact traveling or to events when they’d never bother with the hassle of a DSLR or mirrorless camera. Compacts largely have type 1-inch sensors, but a few offer larger options, particularly Fujifilm’s XF-100V. Another popular model, Sony’s XV-1, is primarily aimed at content creators looking to step up. In any case, desirable qualities include image quality, a fast lens, relatively long zoom, flip-out display, good battery life, a high quality EVF, decent video and good pocketability. What to consider before choosing a camera Though smartphones get better for video and photos every year, full cameras still have an edge in many ways. The larger sensors in mirrorless cameras let more light in, and you have a wide choice of lenses with far superior optics. Dedicated cameras are also faster for shooting things like sports or wildlife, offer superior video for content creators and create more professional results. Sensor size There are a few key things to consider to get the most out of a camera. The first is sensor size: in general, the larger the sensor, the better (and usually more expensive) the camera. Full frame is the largest sensor size for mainstream cameras, and it’s available on models like the new Panasonic S9, the Nikon Z III and Canon EOS R5 II. At a size equivalent to 35mm film (36 x 24mm), it offers the best performance in terms of image quality, low-light capability and depth of field. But it’s also very expensive and finicky. While bokeh looks incredible at an aperture of f/1.4, the depth of field is so razor thin that your subject's eyebrow might be in focus but not their eye. This can also make shooting video difficult. The next size category is APS-C (around 23.5 x 15.6mm for most models and 22.2 x 14.8mm for Canon), offered on Fujifilm's X Series lineup, the Canon R10, the Sony ZV-E10 II and the Nikon Z50. It's cheaper than full frame, both for the camera body and lenses, but still brings most of the advantages like decent bokeh, high ISOs for low-light shooting and relatively high resolution. With a sensor size the same as movie cameras, it's ideal for shooting video, and it’s easier to hold focus than with full-frame cameras. Micro Four Thirds (17.3 x 13mm), a format shared by Panasonic and Olympus, is the next step down in sensor size. It offers less bokeh and light-gathering capability than APS-C and full frame, but allows for smaller and lighter cameras and lenses. For video, you can still get reasonably tight depth of field with good prime lenses, but focus is easier to control. The other common sensor size is Type 1 (1 inch), which is actually smaller than one inch at 12.7 x 9.5mm. That's used mostly by compact models like Sony’s ZV-1 vlogging camera. Finally, action cameras like the GoPro Hero 11 and DJI’s Osmo 3 have even smaller sensors (1/1.9 and 1/1.7 inches, respectively). Autofocus For photographers, another key factor is autofocus (AF) speed and accuracy. Most modern mirrorless cameras have hybrid phase-detect AF systems that allow for rapid focus and fast burst speeds. The majority also offer AI features like eye-detect AF for people and animals, which locks in on the subject’s eyes, face or body to keep them in focus. However, some models are faster and more reactive than others. Displays The electronic viewfinder (EVF) and rear display are also crucial. The best models have the sharpest and brightest EVFs that help you judge a shot before taking it. For things like street photography, it’s best to have as bright and sharp a rear display as possible, so it’s easy to see your subject and check focus in all manner of lighting conditions. You may also want a screen that flips out rather than just tilting, too. Lenses DSLRs and mirrorless cameras let you change lenses, but you're stuck with what's built into a compact camera. While that's great for portability, a single lens means you're going to sacrifice something along the way. The Fujifilm X100V, for instance, has a fast but fixed 35mm-equivalent f/2.0 lens and no zoom. The Sony RX100 V has a 24-70mm zoom, but it's slower at the telephoto end (f/2.8) and less sharp than a fixed focal (prime) lens. When choosing a lens for a mirrorless camera, you’ll need to consider the focal or zoom length, along with the minimum aperture. Smaller numbers like f/1.4 for a prime lens or f/2.8 for a zoom are best, as they let you work in darker environments and maximize background blur to isolate your subject. However, those lenses are more complex and thus more expensive. Video recording When it comes to video, there are other factors to consider. Some cameras combine or skip over pixels (line skipping or pixel binning) for video recording, which is not ideal because it can reduce sharpness. Better cameras tend to read out the entire sensor and then “downsample” to improve video sharpness (camera manufacturers don’t often say if video is pixel binned, but will say if it’s downsampled). Another important factor is sensor speed, as slower sensors tend to have more rolling shutter that can create a “jello” effect that skews video. In addition, how’s the battery life? How do you like the handling and feel? How long can you shoot before the camera heats up or stops? Does it support 10-bit HDR video? Is there a microphone and/or a headphone jack? (If you record a lot of interviews, it's preferable to have both.) How's the video autofocus? All of these things play a part in your decision.This article originally appeared on Engadget at https://www.engadget.com/cameras/best-cameras-151524327.html?src=rss",
          "content": "Choosing a camera is not just about resolution or price. It is about finding something that matches how you like to shoot. Some photographers want a compact mirrorless camera that travels easily. Others want an action cam that can handle rough hikes, or a full-frame system that delivers the best possible image quality. With so many options today, there is a camera built for almost every creative style.We tested the top models across categories to help you decide which one fits your needs. Whether you are filming your first vlog, shooting portraits or capturing fast-moving action, these are the best cameras to help you grow your skills. Best cameras for 2026 Best mirrorless cameras Mirrorless is the largest camera category in terms of models available, so it’s the best way to go if you’re looking for something with the most advanced features. Canon and Nikon recently announced they’re discontinuing development of new DSLRs, simply because most of the advantages of that category are gone, as I detailed in a video. The biggest selling feature of a mirrorless camera is the ability to change lenses depending on the type of shooting you want to do. Best action camera or gimbal camera The most important features to look for in an action cam are image quality, stabilization and battery life. GoPro has easily been beating all rivals recently in all those areas, but DJI has taken a lot of its business with the Osmo Pocket 3 gimbal camera. Best compact camera This category has fewer cameras than it did even a few years ago and many models are older, as manufacturers focus instead on mirrorless models. However, I’m still a big believer in compact cameras. They’re a noticeable step up from smartphones quality-wise, and a lot of people will take a compact traveling or to events when they’d never bother with the hassle of a DSLR or mirrorless camera. Compacts largely have type 1-inch sensors, but a few offer larger options, particularly Fujifilm’s XF-100V. Another popular model, Sony’s XV-1, is primarily aimed at content creators looking to step up. In any case, desirable qualities include image quality, a fast lens, relatively long zoom, flip-out display, good battery life, a high quality EVF, decent video and good pocketability. What to consider before choosing a camera Though smartphones get better for video and photos every year, full cameras still have an edge in many ways. The larger sensors in mirrorless cameras let more light in, and you have a wide choice of lenses with far superior optics. Dedicated cameras are also faster for shooting things like sports or wildlife, offer superior video for content creators and create more professional results. Sensor size There are a few key things to consider to get the most out of a camera. The first is sensor size: in general, the larger the sensor, the better (and usually more expensive) the camera. Full frame is the largest sensor size for mainstream cameras, and it’s available on models like the new Panasonic S9, the Nikon Z III and Canon EOS R5 II. At a size equivalent to 35mm film (36 x 24mm), it offers the best performance in terms of image quality, low-light capability and depth of field. But it’s also very expensive and finicky. While bokeh looks incredible at an aperture of f/1.4, the depth of field is so razor thin that your subject's eyebrow might be in focus but not their eye. This can also make shooting video difficult. The next size category is APS-C (around 23.5 x 15.6mm for most models and 22.2 x 14.8mm for Canon), offered on Fujifilm's X Series lineup, the Canon R10, the Sony ZV-E10 II and the Nikon Z50. It's cheaper than full frame, both for the camera body and lenses, but still brings most of the advantages like decent bokeh, high ISOs for low-light shooting and relatively high resolution. With a sensor size the same as movie cameras, it's ideal for shooting video, and it’s easier to hold focus than with full-frame cameras. Micro Four Thirds (17.3 x 13mm), a format shared by Panasonic and Olympus, is the next step down in sensor size. It offers less bokeh and light-gathering capability than APS-C and full frame, but allows for smaller and lighter cameras and lenses. For video, you can still get reasonably tight depth of field with good prime lenses, but focus is easier to control. The other common sensor size is Type 1 (1 inch), which is actually smaller than one inch at 12.7 x 9.5mm. That's used mostly by compact models like Sony’s ZV-1 vlogging camera. Finally, action cameras like the GoPro Hero 11 and DJI’s Osmo 3 have even smaller sensors (1/1.9 and 1/1.7 inches, respectively). Autofocus For photographers, another key factor is autofocus (AF) speed and accuracy. Most modern mirrorless cameras have hybrid phase-detect AF systems that allow for rapid focus and fast burst speeds. The majority also offer AI features like eye-detect AF for people and animals, which locks in on the subject’s eyes, face or body to keep them in focus. However, some models are faster and more reactive than others. Displays The electronic viewfinder (EVF) and rear display are also crucial. The best models have the sharpest and brightest EVFs that help you judge a shot before taking it. For things like street photography, it’s best to have as bright and sharp a rear display as possible, so it’s easy to see your subject and check focus in all manner of lighting conditions. You may also want a screen that flips out rather than just tilting, too. Lenses DSLRs and mirrorless cameras let you change lenses, but you're stuck with what's built into a compact camera. While that's great for portability, a single lens means you're going to sacrifice something along the way. The Fujifilm X100V, for instance, has a fast but fixed 35mm-equivalent f/2.0 lens and no zoom. The Sony RX100 V has a 24-70mm zoom, but it's slower at the telephoto end (f/2.8) and less sharp than a fixed focal (prime) lens. When choosing a lens for a mirrorless camera, you’ll need to consider the focal or zoom length, along with the minimum aperture. Smaller numbers like f/1.4 for a prime lens or f/2.8 for a zoom are best, as they let you work in darker environments and maximize background blur to isolate your subject. However, those lenses are more complex and thus more expensive. Video recording When it comes to video, there are other factors to consider. Some cameras combine or skip over pixels (line skipping or pixel binning) for video recording, which is not ideal because it can reduce sharpness. Better cameras tend to read out the entire sensor and then “downsample” to improve video sharpness (camera manufacturers don’t often say if video is pixel binned, but will say if it’s downsampled). Another important factor is sensor speed, as slower sensors tend to have more rolling shutter that can create a “jello” effect that skews video. In addition, how’s the battery life? How do you like the handling and feel? How long can you shoot before the camera heats up or stops? Does it support 10-bit HDR video? Is there a microphone and/or a headphone jack? (If you record a lot of interviews, it's preferable to have both.) How's the video autofocus? All of these things play a part in your decision.This article originally appeared on Engadget at https://www.engadget.com/cameras/best-cameras-151524327.html?src=rss",
          "feed_position": 21
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/data/six-data-shifts-that-will-shape-enterprise-ai-in-2026",
          "published_at": "Wed, 31 Dec 2025 05:00:00 GMT",
          "title": "Six data shifts that will shape enterprise AI in 2026",
          "standfirst": "For decades the data landscape was relatively static. Relational databases (hello, Oracle!) were the default and dominated, organizing information into familiar columns and rows.That stability eroded as successive waves introduced NoSQL document stores, graph databases, and most recently vector-based systems. In the era of agentic AI, data infrastructure is once again in flux — and evolving faster than at any point in recent memory.As 2026 dawns, one lesson has become unavoidable: data matters more than ever.RAG is dead. Long live RAGPerhaps the most consequential trend out of 2025 that will continue to be debated into 2026 (and maybe beyond) is the role of RAG.The problem is that the original RAG pipeline architecture is much like a basic search. The retrieval finds the result of a specific query, at a specific point in time. It is also often limited to a single data source, or at least that&#x27;s the way RAG pipelines were built in the past (the past being anytime prior to June 2025). Those limitations have led a growing conga line of vendors all claiming that RAG is dying, on the way out, or already dead.What is emerging, though, are alternative approaches (like contextual memory), as well as nuanced and improved approaches to RAG. For example, Snowflake recently announced its agentic document analytics technology, which expands the traditional RAG data pipeline to enable analysis across thousands of sources, without needing to have structured data first. There are also numerous other RAG-like approaches that are emerging including GraphRAG that will likely only grow in usage and capabilities in 2026.So now RAG isn&#x27;t (entirely) dead, at least not yet. Organizations will still find use cases in 2026 where data retrieval is needed and some enhanced version of RAG will likely still fit the bill. Enterprises in 2026 should evaluate use cases individually. Traditional RAG works for static knowledge retrieval, whereas enhanced approaches like GraphRAG suit complex, multi-source queries.Contextual memory is table stakes for agentic AIWhile RAG won&#x27;t entirely disappear in 2026, one approach that will likely surpass it in terms of usage for agentic AI is contextual memory, also known as agentic or long-context memory. This technology enables LLMs to store and access pertinent information over extended periods.Multiple such systems emerged over the course of 2025 including Hindsight, A-MEM framework, General Agentic Memory (GAM), LangMem, and Memobase. RAG will remain useful for static data, but agentic memory is critical for adaptive assistants and agentic AI workflows that must learn from feedback, maintain state, and adapt over time.In 2026, contextual memory will no longer be a novel technique; it will become table stakes for many operational agentic AI deployments.Purpose-built vector databases use cases will changeAt the beginning of the modern generative AI era, purpose-built vector databases (like Pinecone and Milvus, among others) were all the rage. In order for an LLM (generally but not exclusively via RAG) to get access to new information, it needs to access data. The best way to do that is by encoding the data in vectors — that is, a numerical representation of what the data represents.In 2025 what became painfully obvious was that vectors were no longer a specific database type but rather a specific data type that could be integrated into an existing multimodel database. So instead of an organization being required to use a purpose-built system, it could just use an existing database that supports vectors. For example, Oracle supports vectors and so does every database offered by Google.Oh, and it gets better. Amazon S3, long the de facto leader in cloud based object storage, now allows users to store vectors, further negating the need for a dedicated, unique vector database. That doesn’t mean object storage replaces vector search engines — performance, indexing, and filtering still matter — but it does narrow the set of use cases where specialized systems are required.No, that doesn&#x27;t mean purpose-built vector databases are dead. Much like with RAG, there will continue to be use cases for purpose-built vector databases in 2026. What will change is that use cases will likely narrow somewhat for organizations that need the highest levels of performance or a specific optimization that a general-purpose solution doesn&#x27;t support.PostgreSQL ascendantAs 2026 starts, what&#x27;s old is new again. The open-source PostgreSQL database will be 40 years old in 2026, yet it will be more relevant than it has ever been before.Over the course of 2025, the supremacy of PostgreSQL as the go-to database for building any type of GenAI solution became apparent. Snowflake spent $250 million to acquire PostgreSQL database vendor Crunchy Data; Databricks spent $1 billion on Neon; and Supabase raised a $100 million series E giving it a $5 billion valuation.All that money serves as a clear signal that enterprises are defaulting to PostgreSQL. The reasons are many including the open-source base, flexibility, and performance. For vibe coding (a core use case for Supabase and Neon in particular), PostgreSQL is the standard.Expect to see more growth and adoption of PostgreSQL in 2026 as more organizations come to the same conclusions as Snowflake and Databricks.Data researchers will continue to find new ways to solve already solved problems It&#x27;s likely that there will be more innovation to help problems that many organizations likely assume are already: solved problems.In 2025, we saw numerous innovations, like the notion that an AI is able to parse data from an unstructured data source like a PDF. That&#x27;s a capability that has existed for several years, but proved harder to operationalize at scale than many assumed. Databricks now has an advanced parser, and other vendors, including Mistral, have emerged with their own improvements.The same is true with natural language to SQL translation. While some might have assumed that was a solved problem, it&#x27;s one that continued to see innovation in 2025 and will see more in 2026.It&#x27;s critical for enterprises to stay vigilant in 2026. Don&#x27;t assume foundational capabilities like parsing or natural language to SQL are fully solved. Keep evaluating new approaches that may significantly outperform existing tools.Acquisitions, investments, and consolidation will continue2025 was a big year for big money going into data vendors.Meta invested $14.3 billion in data labeling vendor Scale AI; IBM said it plans to acquire data streaming vendor Confluent for $11 billion; and Salesforce picked up Informatica for $8 billion.Organizations should expect the pace of acquisitions of all sizes to continue in 2026, as big vendors realize the foundational importance of data to the success of agentic AI.The impact of acquisitions and consolidation on enterprises in 2026 is hard to predict. It can lead to vendor lock-in, and it can also potentially lead to expanded platform capabilities. In 2026, the question won’t be whether enterprises are using AI — it will be whether their data systems are capable of sustaining it. As agentic AI matures, durable data infrastructure — not clever prompts or short-lived architectures — will determine which deployments scale and which quietly stall out.",
          "content": "For decades the data landscape was relatively static. Relational databases (hello, Oracle!) were the default and dominated, organizing information into familiar columns and rows.That stability eroded as successive waves introduced NoSQL document stores, graph databases, and most recently vector-based systems. In the era of agentic AI, data infrastructure is once again in flux — and evolving faster than at any point in recent memory.As 2026 dawns, one lesson has become unavoidable: data matters more than ever.RAG is dead. Long live RAGPerhaps the most consequential trend out of 2025 that will continue to be debated into 2026 (and maybe beyond) is the role of RAG.The problem is that the original RAG pipeline architecture is much like a basic search. The retrieval finds the result of a specific query, at a specific point in time. It is also often limited to a single data source, or at least that&#x27;s the way RAG pipelines were built in the past (the past being anytime prior to June 2025). Those limitations have led a growing conga line of vendors all claiming that RAG is dying, on the way out, or already dead.What is emerging, though, are alternative approaches (like contextual memory), as well as nuanced and improved approaches to RAG. For example, Snowflake recently announced its agentic document analytics technology, which expands the traditional RAG data pipeline to enable analysis across thousands of sources, without needing to have structured data first. There are also numerous other RAG-like approaches that are emerging including GraphRAG that will likely only grow in usage and capabilities in 2026.So now RAG isn&#x27;t (entirely) dead, at least not yet. Organizations will still find use cases in 2026 where data retrieval is needed and some enhanced version of RAG will likely still fit the bill. Enterprises in 2026 should evaluate use cases individually. Traditional RAG works for static knowledge retrieval, whereas enhanced approaches like GraphRAG suit complex, multi-source queries.Contextual memory is table stakes for agentic AIWhile RAG won&#x27;t entirely disappear in 2026, one approach that will likely surpass it in terms of usage for agentic AI is contextual memory, also known as agentic or long-context memory. This technology enables LLMs to store and access pertinent information over extended periods.Multiple such systems emerged over the course of 2025 including Hindsight, A-MEM framework, General Agentic Memory (GAM), LangMem, and Memobase. RAG will remain useful for static data, but agentic memory is critical for adaptive assistants and agentic AI workflows that must learn from feedback, maintain state, and adapt over time.In 2026, contextual memory will no longer be a novel technique; it will become table stakes for many operational agentic AI deployments.Purpose-built vector databases use cases will changeAt the beginning of the modern generative AI era, purpose-built vector databases (like Pinecone and Milvus, among others) were all the rage. In order for an LLM (generally but not exclusively via RAG) to get access to new information, it needs to access data. The best way to do that is by encoding the data in vectors — that is, a numerical representation of what the data represents.In 2025 what became painfully obvious was that vectors were no longer a specific database type but rather a specific data type that could be integrated into an existing multimodel database. So instead of an organization being required to use a purpose-built system, it could just use an existing database that supports vectors. For example, Oracle supports vectors and so does every database offered by Google.Oh, and it gets better. Amazon S3, long the de facto leader in cloud based object storage, now allows users to store vectors, further negating the need for a dedicated, unique vector database. That doesn’t mean object storage replaces vector search engines — performance, indexing, and filtering still matter — but it does narrow the set of use cases where specialized systems are required.No, that doesn&#x27;t mean purpose-built vector databases are dead. Much like with RAG, there will continue to be use cases for purpose-built vector databases in 2026. What will change is that use cases will likely narrow somewhat for organizations that need the highest levels of performance or a specific optimization that a general-purpose solution doesn&#x27;t support.PostgreSQL ascendantAs 2026 starts, what&#x27;s old is new again. The open-source PostgreSQL database will be 40 years old in 2026, yet it will be more relevant than it has ever been before.Over the course of 2025, the supremacy of PostgreSQL as the go-to database for building any type of GenAI solution became apparent. Snowflake spent $250 million to acquire PostgreSQL database vendor Crunchy Data; Databricks spent $1 billion on Neon; and Supabase raised a $100 million series E giving it a $5 billion valuation.All that money serves as a clear signal that enterprises are defaulting to PostgreSQL. The reasons are many including the open-source base, flexibility, and performance. For vibe coding (a core use case for Supabase and Neon in particular), PostgreSQL is the standard.Expect to see more growth and adoption of PostgreSQL in 2026 as more organizations come to the same conclusions as Snowflake and Databricks.Data researchers will continue to find new ways to solve already solved problems It&#x27;s likely that there will be more innovation to help problems that many organizations likely assume are already: solved problems.In 2025, we saw numerous innovations, like the notion that an AI is able to parse data from an unstructured data source like a PDF. That&#x27;s a capability that has existed for several years, but proved harder to operationalize at scale than many assumed. Databricks now has an advanced parser, and other vendors, including Mistral, have emerged with their own improvements.The same is true with natural language to SQL translation. While some might have assumed that was a solved problem, it&#x27;s one that continued to see innovation in 2025 and will see more in 2026.It&#x27;s critical for enterprises to stay vigilant in 2026. Don&#x27;t assume foundational capabilities like parsing or natural language to SQL are fully solved. Keep evaluating new approaches that may significantly outperform existing tools.Acquisitions, investments, and consolidation will continue2025 was a big year for big money going into data vendors.Meta invested $14.3 billion in data labeling vendor Scale AI; IBM said it plans to acquire data streaming vendor Confluent for $11 billion; and Salesforce picked up Informatica for $8 billion.Organizations should expect the pace of acquisitions of all sizes to continue in 2026, as big vendors realize the foundational importance of data to the success of agentic AI.The impact of acquisitions and consolidation on enterprises in 2026 is hard to predict. It can lead to vendor lock-in, and it can also potentially lead to expanded platform capabilities. In 2026, the question won’t be whether enterprises are using AI — it will be whether their data systems are capable of sustaining it. As agentic AI matures, durable data infrastructure — not clever prompts or short-lived architectures — will determine which deployments scale and which quietly stall out.",
          "feed_position": 2,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/1Am5h54S0EVCRIKGeWcWmG/49983d561b05cc8f59f08aea19a9e3c9/data-in-2026.jpg?w=300&q=30"
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/2a54c910-e5bb-11f0-9fd7-0fe99fe4214d",
      "popularity_score": 2010.9564994444445
    },
    {
      "id": "cluster_17",
      "coverage": 2,
      "updated_at": "Thu, 01 Jan 2026 13:55:01 -0500",
      "title": "A look at US tech laws coming in 2026, like California's SB 53 AI transparency law and Virginia's new social media limits for minors, effective from January 1 (Adi Robertson/The Verge)",
      "neutral_headline": "Meet the new tech laws of 2026",
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260101/p13#a260101p13",
          "published_at": "Thu, 01 Jan 2026 13:55:01 -0500",
          "title": "A look at US tech laws coming in 2026, like California's SB 53 AI transparency law and Virginia's new social media limits for minors, effective from January 1 (Adi Robertson/The Verge)",
          "standfirst": "Adi Robertson / The Verge: A look at US tech laws coming in 2026, like California's SB 53 AI transparency law and Virginia's new social media limits for minors, effective from January 1 &mdash; As usual, 2025 was a year of deep congressional dysfunction in the US. But state legislatures were passing laws that govern everything &hellip;",
          "content": "Adi Robertson / The Verge: A look at US tech laws coming in 2026, like California's SB 53 AI transparency law and Virginia's new social media limits for minors, effective from January 1 &mdash; As usual, 2025 was a year of deep congressional dysfunction in the US. But state legislatures were passing laws that govern everything &hellip;",
          "feed_position": 6,
          "image_url": "http://www.techmeme.com/260101/i13.jpg"
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/policy/851664/new-tech-internet-laws-us-2026-ai-privacy-repair",
          "published_at": "2026-01-01T10:00:00-05:00",
          "title": "Meet the new tech laws of 2026",
          "standfirst": "As usual, 2025 was a year of deep congressional dysfunction in the US. But state legislatures were passing laws that govern everything from AI to social media to the right to repair. Many of these laws, alongside rules passed in past years, take effect in 2026 - either right now or in the coming months. [&#8230;]",
          "content": "As usual, 2025 was a year of deep congressional dysfunction in the US. But state legislatures were passing laws that govern everything from AI to social media to the right to repair. Many of these laws, alongside rules passed in past years, take effect in 2026 - either right now or in the coming months. As of January 1st, Americans should have the right to crypto ATM refunds in Colorado, wide-ranging electronics repairs in Colorado and Washington, and AI system transparency in California, among other things. But a last-minute court ruling offered a reprieve from one high-profile state law: Texas' App Store-based age verification rule. For … Read the full story at The Verge.",
          "feed_position": 2
        }
      ],
      "featured_image": "http://www.techmeme.com/260101/i13.jpg",
      "popularity_score": 2010.8592772222223
    },
    {
      "id": "cluster_13",
      "coverage": 1,
      "updated_at": "Thu, 01 Jan 2026 20:18:26 +0000",
      "title": "Marvel rings in new year with Wonder Man trailer",
      "neutral_headline": "Marvel rings in new year with Wonder Man trailer",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/marvel-rings-in-new-year-with-wonder-man-trailer/",
          "published_at": "Thu, 01 Jan 2026 20:18:26 +0000",
          "title": "Marvel rings in new year with Wonder Man trailer",
          "standfirst": "\"Acting is the sum of everything you've experienced. The joy. Sadness. Loss, Heartbreak.\"",
          "content": "Marvel Studios decided to ring in the new year with a fresh trailer for Wonder Man, its eight-episode miniseries premiering later this month on Disney+. Part of the MCU’s Phase Six, the miniseries was created by Destin Daniel Cretton (Shang-Chi and the Legend of Five Rings) and Andrew Guest (Hawkeye), with Guest serving as showrunner. As previously reported, Yahya Abdul-Mateen II stars as Simon Williams, aka Wonder Man, an actor and stunt person with actual superpowers who decides to audition for the lead role in a superhero TV series—a reboot of an earlier Wonder Man incarnation. Demetrius Grosse plays Simon’s brother, Eric, aka Grim Reaper; Ed Harris plays Simon’s agent, Neal Saroyan; and Arian Moayed plays P. Clearly, an agent with the Department of Damage Control. Lauren Glazier, Josh Gad, Byron Bowers, Bechir Sylvain, and Manny McCord will also appear in as-yet-undisclosed roles Rounding out the cast is Ben Kingsley, reprising his MCU role as failed actor Trevor Slattery. You may recall Slattery from 2013’s Iron Man 3, hired by the villain of that film to pretend to be the leader of an international terrorist organization called the Ten Rings.Slattery showed up again in 2021’s Shang-Chi and the Legend of the Ten Rings,rehabilitated after a stint in prison; he helped the titular Shang-Chi (Simu Liu) on his journey to the mythical village of Ta Lo.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/wonderman1-1152x648-1767297701.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/wonderman1-1152x648-1767297701.jpg",
      "popularity_score": 357.249555
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Thu, 01 Jan 2026 19:43:45 +0000",
      "title": "Research roundup: 7 cool science stories we almost missed",
      "neutral_headline": "Research roundup: 7 cool science stories we almost missed",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/research-roundup-7-cool-science-stories-we-almost-missed-2/",
          "published_at": "Thu, 01 Jan 2026 19:43:45 +0000",
          "title": "Research roundup: 7 cool science stories we almost missed",
          "standfirst": "Double-detonating \"superkilonova,\" Roman liquid gypsum burials, biomechanics of kangaroo posture, and more.",
          "content": "It’s a regrettable reality that there is never enough time to cover all the interesting scientific stories we come across each month. In the past, we’ve featured year-end roundups of cool science stories we (almost) missed. This year, we’ve experimented with a monthly collection. December’s list includes a fossilized bird that choked to death on rocks; a double-detonating \"superkilonova\"; recovering an ancient seafarer's fingerprint; the biomechanics of kangaroo movement; and cracking a dark matter puzzle that stumped fictional physicists on The Big Bang Theory, among other tantalizing tidbits Secrets of kangaroo posture Credit: Thornton et al., 2025/CC BY 4.0 Kangaroos and wallabies belong to a class of animals called macropods, with unique form and style of movement. Their four limbs and tail all contact the ground at slow speeds, while they use a hopping gait at higher speeds. Typically, high-speed movements are more energy-intensive than slow-speed motion, but the opposite is true for macropods like kangaroos; somehow the hopping speed and energy cost become uncoupled. According to a paper published in the journal eLife, this may be due to changes in a kangaroo's posture at higher hopping speeds.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Kasliwal_Mansi-Superkilonova-3-panel-SKN-WEB-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Kasliwal_Mansi-Superkilonova-3-panel-SKN-WEB-1152x648.jpg",
      "popularity_score": 334.67149944444446
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Thu, 01 Jan 2026 13:00:18 +0000",
      "title": "“Streaming stops feeling infinite”: What subscribers can expect in 2026",
      "neutral_headline": "“Streaming stops feeling infinite”: What subscribers can expect in 2026",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/streaming-stops-feeling-infinite-what-subscribers-can-expect-in-2026/",
          "published_at": "Thu, 01 Jan 2026 13:00:18 +0000",
          "title": "“Streaming stops feeling infinite”: What subscribers can expect in 2026",
          "standfirst": "Streaming may get a little worse before it gets better.",
          "content": "We’re far from streaming’s original promise: instant access to beloved and undiscovered titles without the burden of ads, bundled services, or price gouging that have long been associated with cable. Still, every year we get more dependent on streaming for entertainment. Despite streaming services’ flaws, many of us are bound to keep subscribing to at least one service next year. Here’s what we can expect in 2026 and beyond. Subscription prices keep rising, but perhaps not as expected There’s virtually no hope of streaming subscription prices plateauing in 2026. Streaming companies continue to face challenges as content production and licensing costs rise, and it's often easier to get current customers to pay slightly more than to acquire new subscribers. Meanwhile, many streaming companies are still struggling with profitability and revenue after spending years focusing on winning subscribers with content.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2240553102-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2240553102-1152x648.jpg",
      "popularity_score": 317.9473327777778
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Wed, 31 Dec 2025 16:30:33 +0000",
      "title": "Here we go again: Retiring coal plant forced to stay open by Trump Admin",
      "neutral_headline": "Here we go again: Retiring coal plant forced to stay open by Trump Admin",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/trump-admin-orders-another-coal-plant-to-stay-open/",
          "published_at": "Wed, 31 Dec 2025 16:30:33 +0000",
          "title": "Here we go again: Retiring coal plant forced to stay open by Trump Admin",
          "standfirst": "This time, a Colorado plant scheduled to shut down will be kept on standby.",
          "content": "On Tuesday, US Secretary of Energy Chris Wright issued a now familiar order: because of a supposed energy emergency, a coal plant scheduled for closure would be forced to remain open. This time, the order targeted one of the three units present at Craig Station in Colorado, which was scheduled to close at the end of this year. The remaining two units were expected to shut in 2028. The supposed reason for this order is an emergency caused by a shortage of generating capacity. \"The reliable supply of power from the coal plant is essential for keeping the region’s electric grid stable,\" according to a statement issued by the Department of Energy. Yet the Colorado Sun notes that Colorado's Public Utilities Commission had already analyzed the impact of its potential closure, and determined, \"Craig Unit 1 is not required for reliability or resource adequacy purposes.\" The order does not require the plant to actually produce electricity; instead, it is ordered to be available in case a shortfall in production occurs. As noted in the Colorado Sun article, actual operation of the plant would potentially violate Colorado laws, which regulate airborne pollution and set limits on greenhouse gas emissions. The cost of maintaining the plant is likely to fall on the local ratepayers, who had already adjusted to the closure plans.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-161350245.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-161350245.jpg",
      "popularity_score": 308
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Thu, 01 Jan 2026 12:00:40 +0000",
      "title": "Film Technica: Our top picks for the best films of 2025",
      "neutral_headline": "Film Technica: Our top picks for the best films of 2025",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/film-technica-our-top-picks-for-the-best-films-of-2025/",
          "published_at": "Thu, 01 Jan 2026 12:00:40 +0000",
          "title": "Film Technica: Our top picks for the best films of 2025",
          "standfirst": "Streamers made a strong showing this year, as did horror. Big tentpoles, superhero sagas mostly fell flat.",
          "content": "Editor’s note: Warning: Although we’ve done our best to avoid spoiling anything too major, please note this list does include a few specific references that some might consider spoiler-y. It's been a strange year for movies. Most of the big, splashy tentpole projects proved disappointing, while several more modest films either produced or acquired by streaming platforms—and only briefly released in theaters—wound up making our year-end list. This pattern was not intentional. But streaming platforms have been increasingly moving into the film space with small to medium-sized budgets—i.e., the kind of fare that used to be commonplace but has struggled to compete over the last two decades as blockbusters and elaborate superhero franchises dominated the box office. Add in lingering superhero fatigue—only one superhero saga made our final list this year—plus Netflix's controversial bid to acquire Warner Bros., and we just might be approaching a sea change in how movies are made and distributed, and by whom. How this all plays out in the coming year is anybody's guess.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-best-films-2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-best-films-2025-1152x648.jpg",
      "popularity_score": 306.9534438888889
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Wed, 31 Dec 2025 13:15:40 +0000",
      "title": "Supply chains, AI, and the cloud: The biggest failures (and one success) of 2025",
      "neutral_headline": "Supply chains, AI, and the cloud: The biggest failures (and one success) of 2025",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/12/supply-chains-ai-and-the-cloud-the-biggest-failures-and-one-success-of-2025/",
          "published_at": "Wed, 31 Dec 2025 13:15:40 +0000",
          "title": "Supply chains, AI, and the cloud: The biggest failures (and one success) of 2025",
          "standfirst": "The past year has seen plenty of hacks and outages. Here are the ones topping the list.",
          "content": "In a roundup of the top stories of 2024, Ars included a supply-chain attack that came dangerously close to inflicting a catastrophe for thousands—possibly millions—of organizations, which included a large assortment of Fortune 500 companies and government agencies. Supply-chain attacks played prominently again this year, as a seemingly unending rash of them hit organizations large and small. For threat actors, supply-chain attacks are the gift that keeps on giving—or, if you will, the hack that keeps on hacking. By compromising a single target with a large number of downstream users—say a cloud service or maintainers or developers of widely used open source or proprietary software—attackers can infect potentially millions of the target’s downstream users. That’s exactly what threat actors did in 2025. Poisoning the well One such event occurred in December 2024, making it worthy of a ranking for 2025. The hackers behind the campaign pocketed as much as $155,000 from thousands of smart-contract parties on the Solana blockchain.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/signal-quantum-security-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/signal-quantum-security-1152x648.jpg",
      "popularity_score": 298
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Wed, 31 Dec 2025 12:00:31 +0000",
      "title": "From prophet to product: How AI came back down to earth in 2025",
      "neutral_headline": "From prophet to product: How AI came back down to earth in 2025",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/from-prophet-to-product-how-ai-came-back-down-to-earth-in-2025/",
          "published_at": "Wed, 31 Dec 2025 12:00:31 +0000",
          "title": "From prophet to product: How AI came back down to earth in 2025",
          "standfirst": "In a year where lofty promises collided with inconvenient research, would-be oracles became software tools.",
          "content": "Following two years of immense hype in 2023 and 2024, this year felt more like a settling-in period for the LLM-based token prediction industry. After more than two years of public fretting over AI models as future threats to human civilization or the seedlings of future gods, it's starting to look like hype is giving way to pragmatism: Today's AI can be very useful, but it's also clearly imperfect and prone to mistakes. That view isn't universal, of course. There's a lot of money (and rhetoric) betting on a stratospheric, world-rocking trajectory for AI. But the \"when\" keeps getting pushed back, and that's because nearly everyone agrees that more significant technical breakthroughs are required. The original, lofty claims that we're on the verge of artificial general intelligence (AGI) or superintelligence (ASI) have not disappeared. Still, there's a growing awareness that such proclaimations are perhaps best viewed as venture capital marketing. And every commercial foundational model builder out there has to grapple with the reality that, if they're going to make money now, they have to sell practical AI-powered solutions that perform as reliable tools. This has made 2025 a year of wild juxtapositions. For example, in January, OpenAI's CEO, Sam Altman, claimed that the company knew how to build AGI, but by November, he was publicly celebrating that GPT-5.1 finally learned to use em dashes correctly when instructed (but not always). Nvidia soared past a $5 trillion valuation, with Wall Street still projecting high price targets for that company's stock while some banks warned of the potential for an AI bubble that might rival the 2000s dotcom crash.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ai-down-to-earth-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ai-down-to-earth-1152x648.jpg",
      "popularity_score": 288
    }
  ]
}