{
  "updated_at": "2025-12-08T11:19:23.312Z",
  "clusters": [
    {
      "id": "cluster_7",
      "coverage": 2,
      "updated_at": "Mon, 08 Dec 2025 10:01:27 +0000",
      "title": "The 5 best Mint alternatives to replace the budgeting app that shut down",
      "neutral_headline": "The 5 best Mint alternatives to replace the budgeting app that shut down",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/apps/the-best-budgeting-apps-to-replace-mint-143047346.html",
          "published_at": "Mon, 08 Dec 2025 10:01:27 +0000",
          "title": "The 5 best Mint alternatives to replace the budgeting app that shut down",
          "standfirst": "It's been over one year since Intuit shut down the popular budgeting app Mint. I was a Mint user for many years; millions of other users like me enjoyed how easily Mint allowed us to track all accounts in one place and monitor credit scores. I also used it regularly to help me track spending, set goals like pay my mortgage down faster and with general money management.Ahead of Mint’s demise, I gave Credit Karma, Intuit’s other financial app, a try but found it to be a poor Mint alternative. So I set out to find a true replacement in another budgeting app. The following guide lays out my experience testing some of the most popular Mint replacement apps available today. Our pick for best Mint alternative remains Quicken Simplifi, even this long after Mint being shut down, thanks to its easy to use app, good income and bill detection and its affordable price. But there are plenty of other solid options out there for those with different needs. If you’re also on the hunt for a budgeting app to replace Mint, we hope these details can empower you to choose which of the best budgeting apps out there will be right for you. Table of contents Best Mint alternatives in 2025 Other Mint alternatives we tested What is Plaid and how does it work? How to import your financial data from the Mint app How we tested Mint alternatives What about Rocket Money? Best Mint alternatives in 2025 No pun intended, but what I like about Quicken Simplifi is its simplicity. Whereas other budgeting apps try to distinguish themselves with dark themes and customizable emoji, Simplifi has a clean user interface, with a landing page that you just keep scrolling through to get a detailed overview of all your stats. These include your top-line balances; net worth; recent spending; upcoming recurring payments; a snapshot of your spending plan; top spending categories; achievements; and any watchlists you’ve set up. Another one of the key features I appreciate is the ability to set up savings goals elsewhere in the app. I also appreciate how it offers neat, almost playful visualizations without ever looking cluttered. I felt at home in the mobile and web dashboards after a day or so, which is faster than I adapted to some competing services (I’m looking at you, YNAB and Monarch). Getting set up with Simplifi was mostly painless. I was particularly impressed at how easily it connected to Fidelity; not all budget trackers do, for whatever reason. This is also one of the only services I tested that gives you the option of inviting a spouse or financial advisor to co-manage your account. One thing I would add to my initial assessment of the app, having used it for a few months now: I wish Simplifi offered Zillow integration for easily tracking your home value (or at least a rough estimate of it). Various competitors including Monarch Money and Copilot Money work with Zillow, so clearly there's a Zillow API available for use. As it stands, Simplifi users must add real estate manually like any other asset. Dana Wollman / Engadget In practice, Simplifi miscategorized some of my expenses, but nothing out of the ordinary compared to any of these budget trackers. As you’re reviewing transactions, you can also mark if you’re expecting a refund, which is a unique feature among the services I tested. Simplifi also estimated my regular income better than some other apps I tested. Most of all, I appreciated the option of being able to categorize some, but not all, purchases from a merchant as recurring. For instance, I can add my two Amazon subscribe-and-saves as recurring payments, without having to create a broad-strokes rule for every Amazon purchase. The budgeting feature is also self-explanatory and can likely accommodate your preferred budgeting method. Just check that your regular income is accurate and be sure to set up recurring payments, making note of which are bills and which are subscriptions. This is important because Simplifi shows you your total take-home income as well as an “income after bills” figure. That number includes, well, bills but not discretionary subscriptions. From there, you can add spending targets by category in the “planned spending” bucket. Planned spending can also include one-time expenditures, not just monthly budgets. When you create a budget, Simplifi will suggest a number based on a six-month average. Not dealbreakers, but two things to keep in mind as you get started: Simplifi is notable in that you can’t set up an account through Apple or Google. There is also no option for a free trial, though Quicken promises a “30-day money back guarantee.” Monarch Money grew on me. My first impression of the budgeting app, which was founded by a former Mint product manager, was that it's more difficult to use than others on this list, including Simplifi, NerdWallet and Copilot. And it is. Editing expense categories, adding recurring transactions and creating rules, for example, is a little more complicated than it needs to be, especially in the mobile app. (My advice: Use the web app for fine-tuning details.) Monarch also didn’t get my income right; I had to edit it. Once you’re set up, though, Monarch offers an impressive level of granularity. In the budgets section, you can see a bona fide balance sheet showing budgets and actuals for each category. You'll also find a forecast, for the year or by month. And recurring expenses can be set not just by merchant, but other parameters as well. For instance, while most Amazon purchases might be marked as “shopping,” those for the amounts of $54.18 or $34.18 are definitely baby supplies, and can be automatically marked as such each time, not to mention programmed as recurring payments. Weirdly, though, there’s no way to mark certain recurring payments as bills, specifically. Dana Wollman / Engadget Not long after I first published this story in December 2023, Monarch introduced a detailed reporting section where you can create on-demand graphs based on things like accounts, categories and tags. That feature is available just on the web version of the app for now. As part of this same update, Monarch added support for an aggregator that makes it possible to automatically update the value of your car. This, combined with the existing Zillow integration for tracking your home value, makes it easy to quickly add a non-liquid asset like a vehicle or real estate, and have it show up in your net worth graph. The mobile app is mostly self-explanatory. The main dashboard shows your net worth; your four most recent transactions; a month-over-month spending comparison; income month-to-date; upcoming bills; an investments snapshot; a list of any goals you’ve set; and, finally, a link to your month-in-review. That month-in-review is more detailed than most, delving into cash flow; top income and expense categories; cash flow trends; changes to your net worth, assets and liabilities; plus asset and liability breakdowns. In February 2024, Monarch expanded on the net worth graph, so that if you click on the Accounts tab you can see how your net worth changed over different periods of time, including one month, three months, six months, a year or all time. On the main screen, you’ll also find tabs for savings and checking accounts (and all others as well), transactions, cash flow, budget and recurring. Like many of the other apps featured here, Monarch can auto-detect recurring expenses and income, even if it gets the category wrong. (They all do to an extent.) Expense categories are marked by emoji, which you can customize if you’re so inclined. Monarch Money uses a combination of networks to connect with banks, including Plaid, MX and Finicity, a competing network owned by Mastercard. (I have a quick explainer on Plaid, the industry standard in this space, toward the end of this guide.) As part of an update in late December, Monarch has also made it easier to connect through those other two networks, if for some reason Plaid fails. Similar to NerdWallet, I found myself completing two-factor authentication every time I wanted to get past the Plaid screen to add another account. Notably, Monarch is the only other app I tested that allows you to grant access to someone else in your family — likely a spouse or financial advisor. Monarch also has a Chrome extension for importing from Mint, though really this is just a shortcut for downloading a CSV file, which you’ll have to do regardless of where you choose to take your Mint data. Additionally, Monarch just added the ability to track Apple Card, Apple Cash, and Savings accounts, thanks to new functionality brought with the iOS 17.4 update. It's not the only one either; currently, Copilot and YNAB have also added similar functionality that will be available to anyone with the latest versions of their respective apps on a device running iOS 17.4. Instead of manually uploading statements, the new functionality allows apps like Monarch's to automatically pull in transactions and balance history. That should make it easier to account for spending on Apple cards and accounts throughout the month. Monarch also recently launched investment transactions in beta. It also says bill tracking and an overhauled goals system are coming soon. Monarch hasn't provided a timeline for that last one, except to say that the improved goals feature is coming soon. Copilot Money might be the best-looking budgeting app I tested. It also has the distinction of being exclusive to iOS and Macs — at least for now. Andres Ugarte, the company’s CEO, has publicly promised that Android and web apps are coming soon. But until it follows through, I can’t recommend Copilot for most people with so many good competitors out there. Copilot Money for Web and Android!Thanks to the support from our users, and the overwhelming positive reception we're seeing from folks migrating from Mint, we can now say that we'll be building @copilotmoney for Web and Android with a goal to launch in 2024.We'll continue to…— Andres Ugarte (@chuga) November 15, 2023 There are other features that Copilot is missing, which I’ll get into. But it is promising, and one to keep an eye on. It’s just a fast, efficient, well designed app, and Android users will be in for a treat when they’ll finally be able to download it. It makes good use of colors, emoji and graphs to help you understand at a glance how you’re doing on everything from your budgets to your investment performance to your credit card debt over time. In particular, Copilot does a better job than almost any other app of visualizing your recurring monthly expenses. Behind those punchy colors and cutesy emoji, though, is some sophisticated performance. Copilot’s AI-powered “Intelligence” gets smarter as you go at categorizing your expenses. (You can also add your own categories, complete with your choice of emoji.) It’s not perfect. Copilot miscategorized some purchases (they all do), but it makes it easier to edit than most. On top of that, the internal search feature is very fast; it starts whittling down results in your transaction history as soon as you begin typing. Dana Wollman / Engadget Copilot is also unique in offering Amazon and Venmo integrations, allowing you to see transaction details. With Amazon, this requires just signing into your Amazon account via an in-app browser. For Venmo, you have to set up fwd@copilot.money as a forwarding address and then create a filter, wherein emails from venmo@venmo.com are automatically forwarded to fwd@copilot.money. Like Monarch Money, you can also add any property you own and track its value through Zillow, which is integrated with the app. While the app is heavily automated, I still appreciate that Copilot marks new transactions for review. It’s a good way to both weed out fraudulent charges, and also be somewhat intentional about your spending habits. Like Monarch Money, Copilot updated its app to make it easier to connect to banks through networks other than Plaid. As part of the same update, Copilot said it has improved its connections to both American Express and Fidelity which, again, can be a bugbear for some budget tracking apps. In an even more recent update, Copilot added a Mint import option, which other budgeting apps have begun to offer as well. Because the app is relatively new (it launched in early 2020), the company is still catching up to the competition on some table-stakes features. Ugarte told me that his team is almost done building out a detailed cash flow section as well. On its website, Copilot also promises a raft of AI-powered features that build on its current “Intelligence” platform, the one that powers its smart expense categorization. These include “smart financial goals,” natural language search, a chat interface, forecasting and benchmarking. That benchmarking, Ugarte tells me, is meant to give people a sense of how they’re doing compared to other Copilot users, on both spending and investment performance. Most of these features should arrive in the new year. Copilot does a couple interesting things for new customers that distinguish it from the competition. There’s a “demo mode” that feels like a game simulator; no need to add your own accounts. The company is also offering two free months with RIPMINT — a more generous introductory offer than most. When it finally does come time to pony up, the $7.92 monthly plan is cheaper than some competing apps, although the $95-a-year-option is in the same ballpark. You may know NerdWallet as a site that offers a mix of personal finance news, explainers and guides. I see it often when I google a financial term I don’t know and sure enough, it’s one of the sites I’m most likely to click on. As it happens, NerdWallet also has the distinction of offering one of the only free budgeting apps I tested. In fact, there is no paid version; nothing is locked behind a paywall. The main catch: There are ads everywhere. To be fair, the free version of Mint was like this, too. Even with the inescapable credit card offers, NerdWallet has a clean, easy-to-understand user interface, which includes both a web and a mobile app. The key metrics that it highlights most prominently are your cash flow, net worth and credit score. (Of note, although Mint itself offered credit score monitoring, most of its rivals do not.) I particularly enjoyed the weekly insights, which delve into things like where you spent the most money or how much you paid in fees — and how that compares to the previous month. Because this is NerdWallet, an encyclopedia of financial info, you get some particularly specific category options when setting up your accounts (think: a Roth or non-Roth IRA). Dana Wollman / Engadget As a budgeting app, NerdWallet is more than serviceable, if a bit basic. Like other apps I tested, you can set up recurring bills. Importantly, it follows the popular 50/30/20 budgeting rule, which has you putting 50% of your budget toward things you need, 30% toward things you want, and the remaining 20% into savings or debt repayments. If this works for you, great — just know that you can’t customize your budget to the same degree as some competing apps. You can’t currently create custom spending categories, though a note inside the dashboard section of the app says “you’ll be able to customize them in the future.” You also can’t move items from the wants column to “needs” or vice versa but “In the future, you'll be able to move specific transactions to actively manage what falls into each group.” A NerdWallet spokesperson declined to provide an ETA, though. Lastly, it’s worth noting that NerdWallet had one of the most onerous setup processes of any app I tested. I don’t think this is a dealbreaker, as you’ll only have to do it once and, hopefully, you aren’t setting up six or seven apps in tandem as I was. What made NerdWallet’s onboarding especially tedious is that every time I wanted to add an account, I had to go through a two-factor authentication process to even get past the Plaid splash screen, and that’s not including the 2FA I had set up at each of my banks. This is a security policy on NerdWallet’s end, not Plaid’s, a Plaid spokesperson says. Precisely because NerdWallet is one of the only budget trackers to offer credit score monitoring, it also needs more of your personal info during setup, including your birthday, address, phone number and the last four digits of your social security number. It’s the same with Credit Karma, which also does credit score monitoring. Related to the setup process, I found that NerdWallet was less adept than other apps at automatically detecting my regular income. In my case, it counted a large one-time wire transfer as income, at which point my only other option was to enter my income manually (which is slightly annoying because I would have needed my pay stub handy to double-check my take-home pay). YNAB is, by its own admission, “different from anything you’ve tried before.” The app, whose name is short for You Need a Budget, promotes a so-called zero-based budgeting system, which forces you to assign a purpose for every dollar you earn. A frequently used analogy is to put each dollar in an envelope; you can always move money from one envelope to another in a pinch. These envelopes can include rent and utilities, along with unforeseen expenses like holiday gifts and the inevitable car repair. The idea is that if you budget a certain amount for the unknowns each month, they won’t feel like they’re sneaking up on you. Importantly, YNAB is only concerned with the money you have in your accounts now. The app does not ask you to provide your take-home income or set up recurring income payments (although there is a way to do this). The money you will make later in the month through your salaried job is not relevant, because YNAB does not engage in forecasting. The app is harder to learn than any other here, and it requires more ongoing effort from the user. And YNAB knows that. Inside both the mobile and web apps are links to videos and other tutorials. Although I never quite got comfortable with the user interface, I did come to appreciate YNAB’s insistence on intentionality. Forcing users to draft a new budget each month and to review each transaction is not necessarily a bad thing. As YNAB says on its website, “Sure, you’ve got pie charts showing that you spent an obscene amount of money in restaurants — but you’ve still spent an obscene amount of money in restaurants.” I can see this approach being useful for people who don’t tend to have a lot of cash in reserve at a given time, or who have spending habits they want to correct (to riff off of YNAB’s own example, ordering Seamless four times a week). My colleague Valentina Palladino, knowing I was working on this guide, penned a respectful rebuttal, explaining why she’s been using YNAB for years. Perhaps, like her, you have major savings goals you want to achieve, whether it’s paying for a wedding or buying a house. I suggest you give her column a read. For me, though, YNAB’s approach feels like overkill. Other Mint alternatives we tested PocketGuard PocketGuard used to be a solid free budget tracker, but the company has since limited its “free” version to just a free seven-day trial. Now, you’ll have to choose between two plans once the trial is over: a $13 monthly plan or a $75 annual plan. When I first tested it, I found it to be more restricted than NerdWallet, but still a decent option. The main overview screen shows you your net worth, total assets and debts; net income and total spending for the month; upcoming bills; a handy reminder of when your next paycheck lands; any debt payoff plan you have; and any goals. Like some other apps, including Quicken Simplifi, PocketGuard promotes an “after bills” approach, where you enter all of your recurring bills, and then PocketGuard shows you what’s left, and that’s what you’re supposed to be budgeting: your disposable income. Although PocketGuard’s UI is easy enough to understand, it lacks polish. The “accounts” tab is a little busy, and doesn’t show totals for categories like cash or investments. Seemingly small details like weirdly phrased or punctuated copy occasionally make the app feel janky. More than once, it prompted me to update the app when no updates were available. The web version, meanwhile, feels like the mobile app blown up to a larger format and doesn’t take advantage of the extra screen real estate. Ultimately, now that the free tier is gone, it just doesn’t present the same value proposition as it once did. What is Plaid and how does it work? Each of the apps I tested uses the same underlying network, called Plaid, to pull in financial data, so it’s worth explaining in its own section what it is and how it works. Plaid was founded as a fintech startup in 2013 and is today the industry standard in connecting banks with third-party apps. Plaid works with over 12,000 financial institutions across the US, Canada and Europe. Additionally, more than 8,000 third-party apps and services rely on Plaid, the company claims. To be clear, you don’t need a dedicated Plaid app to use it; the technology is baked into a wide array of apps, including the budget trackers I tested for this guide. Once you find the “add an account” option in whichever one you’re using, you’ll see a menu of commonly used banks. There’s also a search field you can use to look yours up directly. Once you find yours, you’ll be prompted to enter your login credentials. If you have two-factor authentication set up, you’ll need to enter a one-time passcode as well. As the middleman, Plaid is a passthrough for information that may include your account balances, transaction history, account type and routing or account number. Plaid uses encryption, and says it has a policy of not selling or renting customer data to other companies. However, I would not be doing my job if I didn’t note that in 2022 Plaid was forced to pay $58 million to consumers in a class action suit for collecting “more financial data than was needed.” As part of the settlement, Plaid was compelled to change some of its business practices. In a statement provided to Engadget, a Plaid spokesperson said the company continues to deny the allegations underpinning the lawsuit and that “the crux of the non-financial terms in the settlement are focused on us accelerating workstreams already underway related to giving people more transparency into Plaid’s role in connecting their accounts, and ensuring that our workstreams around data minimization remain on track.” How to import your financial data from the Mint app Mint users should consider getting their data ready to migrate to their new budgeting app of choice soon. Unfortunately, importing data from Mint is not as easy as entering your credentials from inside your new app and hitting “import.” In fact, any app that advertises the ability to port over your stats from Mint is just going to have you upload a CSV file of transactions and other data. To download a CSV file from Mint, do the following: Sign into Mint.com and hit Transactions in the menu on the left side of the screen. Select an account, or all accounts. Scroll down and look for “export [number] transactions” in smaller print. Your CSV file should begin downloading. Note: Downloading on a per-account basis might seem more annoying, but could help you get set up on the other side, if the app you’re using has you importing transactions one-for-one into their corresponding accounts. How we tested Mint alternatives Before I dove into the world of budgeting apps, I had to do some research. To find a list of apps to test, I consulted trusty ol’ Google (and even trustier Reddit); read reviews of popular apps on the App Store; and also asked friends and colleagues what budget tracking apps they might be using. Some of the apps I found were free, just like Mint. These, of course, show loads of ads (excuse me, “offers”) to stay in business. But most of the available apps require paid subscriptions, with prices typically topping out around $100 a year, or $15 a month. (Spoiler: My top pick is cheaper than that.) Since this guide is meant to help Mint users find a permanent replacement, any services I chose to test needed to do several things: import all of your account data into one place; offer budgeting tools; and track your spending, net worth and credit score. Except where noted, all of these apps are available for iOS, Android and on the web. Once I had my shortlist of six apps, I got to work setting them up. For the sake of thoroughly testing these apps (and remember, I really was looking for a Mint alternative myself), I made a point of adding every account to every budgeting app, no matter how small or immaterial the balance. What ensued was a veritable Groundhog Day of two-factor authentication. Just hours of entering passwords and one-time passcodes, for the same banks half a dozen times over. Hopefully, you only have to do this once. What about Rocket Money? Rocket Money is another free financial app that tracks spending and supports things like balance alerts and account linking. If you pay for the premium tier, the service can also help you cancel unwanted subscriptions. We did not test it for this guide, but we'll consider it in future updates.This article originally appeared on Engadget at https://www.engadget.com/apps/the-best-budgeting-apps-to-replace-mint-143047346.html?src=rss",
          "content": "It's been over one year since Intuit shut down the popular budgeting app Mint. I was a Mint user for many years; millions of other users like me enjoyed how easily Mint allowed us to track all accounts in one place and monitor credit scores. I also used it regularly to help me track spending, set goals like pay my mortgage down faster and with general money management.Ahead of Mint’s demise, I gave Credit Karma, Intuit’s other financial app, a try but found it to be a poor Mint alternative. So I set out to find a true replacement in another budgeting app. The following guide lays out my experience testing some of the most popular Mint replacement apps available today. Our pick for best Mint alternative remains Quicken Simplifi, even this long after Mint being shut down, thanks to its easy to use app, good income and bill detection and its affordable price. But there are plenty of other solid options out there for those with different needs. If you’re also on the hunt for a budgeting app to replace Mint, we hope these details can empower you to choose which of the best budgeting apps out there will be right for you. Table of contents Best Mint alternatives in 2025 Other Mint alternatives we tested What is Plaid and how does it work? How to import your financial data from the Mint app How we tested Mint alternatives What about Rocket Money? Best Mint alternatives in 2025 No pun intended, but what I like about Quicken Simplifi is its simplicity. Whereas other budgeting apps try to distinguish themselves with dark themes and customizable emoji, Simplifi has a clean user interface, with a landing page that you just keep scrolling through to get a detailed overview of all your stats. These include your top-line balances; net worth; recent spending; upcoming recurring payments; a snapshot of your spending plan; top spending categories; achievements; and any watchlists you’ve set up. Another one of the key features I appreciate is the ability to set up savings goals elsewhere in the app. I also appreciate how it offers neat, almost playful visualizations without ever looking cluttered. I felt at home in the mobile and web dashboards after a day or so, which is faster than I adapted to some competing services (I’m looking at you, YNAB and Monarch). Getting set up with Simplifi was mostly painless. I was particularly impressed at how easily it connected to Fidelity; not all budget trackers do, for whatever reason. This is also one of the only services I tested that gives you the option of inviting a spouse or financial advisor to co-manage your account. One thing I would add to my initial assessment of the app, having used it for a few months now: I wish Simplifi offered Zillow integration for easily tracking your home value (or at least a rough estimate of it). Various competitors including Monarch Money and Copilot Money work with Zillow, so clearly there's a Zillow API available for use. As it stands, Simplifi users must add real estate manually like any other asset. Dana Wollman / Engadget In practice, Simplifi miscategorized some of my expenses, but nothing out of the ordinary compared to any of these budget trackers. As you’re reviewing transactions, you can also mark if you’re expecting a refund, which is a unique feature among the services I tested. Simplifi also estimated my regular income better than some other apps I tested. Most of all, I appreciated the option of being able to categorize some, but not all, purchases from a merchant as recurring. For instance, I can add my two Amazon subscribe-and-saves as recurring payments, without having to create a broad-strokes rule for every Amazon purchase. The budgeting feature is also self-explanatory and can likely accommodate your preferred budgeting method. Just check that your regular income is accurate and be sure to set up recurring payments, making note of which are bills and which are subscriptions. This is important because Simplifi shows you your total take-home income as well as an “income after bills” figure. That number includes, well, bills but not discretionary subscriptions. From there, you can add spending targets by category in the “planned spending” bucket. Planned spending can also include one-time expenditures, not just monthly budgets. When you create a budget, Simplifi will suggest a number based on a six-month average. Not dealbreakers, but two things to keep in mind as you get started: Simplifi is notable in that you can’t set up an account through Apple or Google. There is also no option for a free trial, though Quicken promises a “30-day money back guarantee.” Monarch Money grew on me. My first impression of the budgeting app, which was founded by a former Mint product manager, was that it's more difficult to use than others on this list, including Simplifi, NerdWallet and Copilot. And it is. Editing expense categories, adding recurring transactions and creating rules, for example, is a little more complicated than it needs to be, especially in the mobile app. (My advice: Use the web app for fine-tuning details.) Monarch also didn’t get my income right; I had to edit it. Once you’re set up, though, Monarch offers an impressive level of granularity. In the budgets section, you can see a bona fide balance sheet showing budgets and actuals for each category. You'll also find a forecast, for the year or by month. And recurring expenses can be set not just by merchant, but other parameters as well. For instance, while most Amazon purchases might be marked as “shopping,” those for the amounts of $54.18 or $34.18 are definitely baby supplies, and can be automatically marked as such each time, not to mention programmed as recurring payments. Weirdly, though, there’s no way to mark certain recurring payments as bills, specifically. Dana Wollman / Engadget Not long after I first published this story in December 2023, Monarch introduced a detailed reporting section where you can create on-demand graphs based on things like accounts, categories and tags. That feature is available just on the web version of the app for now. As part of this same update, Monarch added support for an aggregator that makes it possible to automatically update the value of your car. This, combined with the existing Zillow integration for tracking your home value, makes it easy to quickly add a non-liquid asset like a vehicle or real estate, and have it show up in your net worth graph. The mobile app is mostly self-explanatory. The main dashboard shows your net worth; your four most recent transactions; a month-over-month spending comparison; income month-to-date; upcoming bills; an investments snapshot; a list of any goals you’ve set; and, finally, a link to your month-in-review. That month-in-review is more detailed than most, delving into cash flow; top income and expense categories; cash flow trends; changes to your net worth, assets and liabilities; plus asset and liability breakdowns. In February 2024, Monarch expanded on the net worth graph, so that if you click on the Accounts tab you can see how your net worth changed over different periods of time, including one month, three months, six months, a year or all time. On the main screen, you’ll also find tabs for savings and checking accounts (and all others as well), transactions, cash flow, budget and recurring. Like many of the other apps featured here, Monarch can auto-detect recurring expenses and income, even if it gets the category wrong. (They all do to an extent.) Expense categories are marked by emoji, which you can customize if you’re so inclined. Monarch Money uses a combination of networks to connect with banks, including Plaid, MX and Finicity, a competing network owned by Mastercard. (I have a quick explainer on Plaid, the industry standard in this space, toward the end of this guide.) As part of an update in late December, Monarch has also made it easier to connect through those other two networks, if for some reason Plaid fails. Similar to NerdWallet, I found myself completing two-factor authentication every time I wanted to get past the Plaid screen to add another account. Notably, Monarch is the only other app I tested that allows you to grant access to someone else in your family — likely a spouse or financial advisor. Monarch also has a Chrome extension for importing from Mint, though really this is just a shortcut for downloading a CSV file, which you’ll have to do regardless of where you choose to take your Mint data. Additionally, Monarch just added the ability to track Apple Card, Apple Cash, and Savings accounts, thanks to new functionality brought with the iOS 17.4 update. It's not the only one either; currently, Copilot and YNAB have also added similar functionality that will be available to anyone with the latest versions of their respective apps on a device running iOS 17.4. Instead of manually uploading statements, the new functionality allows apps like Monarch's to automatically pull in transactions and balance history. That should make it easier to account for spending on Apple cards and accounts throughout the month. Monarch also recently launched investment transactions in beta. It also says bill tracking and an overhauled goals system are coming soon. Monarch hasn't provided a timeline for that last one, except to say that the improved goals feature is coming soon. Copilot Money might be the best-looking budgeting app I tested. It also has the distinction of being exclusive to iOS and Macs — at least for now. Andres Ugarte, the company’s CEO, has publicly promised that Android and web apps are coming soon. But until it follows through, I can’t recommend Copilot for most people with so many good competitors out there. Copilot Money for Web and Android!Thanks to the support from our users, and the overwhelming positive reception we're seeing from folks migrating from Mint, we can now say that we'll be building @copilotmoney for Web and Android with a goal to launch in 2024.We'll continue to…— Andres Ugarte (@chuga) November 15, 2023 There are other features that Copilot is missing, which I’ll get into. But it is promising, and one to keep an eye on. It’s just a fast, efficient, well designed app, and Android users will be in for a treat when they’ll finally be able to download it. It makes good use of colors, emoji and graphs to help you understand at a glance how you’re doing on everything from your budgets to your investment performance to your credit card debt over time. In particular, Copilot does a better job than almost any other app of visualizing your recurring monthly expenses. Behind those punchy colors and cutesy emoji, though, is some sophisticated performance. Copilot’s AI-powered “Intelligence” gets smarter as you go at categorizing your expenses. (You can also add your own categories, complete with your choice of emoji.) It’s not perfect. Copilot miscategorized some purchases (they all do), but it makes it easier to edit than most. On top of that, the internal search feature is very fast; it starts whittling down results in your transaction history as soon as you begin typing. Dana Wollman / Engadget Copilot is also unique in offering Amazon and Venmo integrations, allowing you to see transaction details. With Amazon, this requires just signing into your Amazon account via an in-app browser. For Venmo, you have to set up fwd@copilot.money as a forwarding address and then create a filter, wherein emails from venmo@venmo.com are automatically forwarded to fwd@copilot.money. Like Monarch Money, you can also add any property you own and track its value through Zillow, which is integrated with the app. While the app is heavily automated, I still appreciate that Copilot marks new transactions for review. It’s a good way to both weed out fraudulent charges, and also be somewhat intentional about your spending habits. Like Monarch Money, Copilot updated its app to make it easier to connect to banks through networks other than Plaid. As part of the same update, Copilot said it has improved its connections to both American Express and Fidelity which, again, can be a bugbear for some budget tracking apps. In an even more recent update, Copilot added a Mint import option, which other budgeting apps have begun to offer as well. Because the app is relatively new (it launched in early 2020), the company is still catching up to the competition on some table-stakes features. Ugarte told me that his team is almost done building out a detailed cash flow section as well. On its website, Copilot also promises a raft of AI-powered features that build on its current “Intelligence” platform, the one that powers its smart expense categorization. These include “smart financial goals,” natural language search, a chat interface, forecasting and benchmarking. That benchmarking, Ugarte tells me, is meant to give people a sense of how they’re doing compared to other Copilot users, on both spending and investment performance. Most of these features should arrive in the new year. Copilot does a couple interesting things for new customers that distinguish it from the competition. There’s a “demo mode” that feels like a game simulator; no need to add your own accounts. The company is also offering two free months with RIPMINT — a more generous introductory offer than most. When it finally does come time to pony up, the $7.92 monthly plan is cheaper than some competing apps, although the $95-a-year-option is in the same ballpark. You may know NerdWallet as a site that offers a mix of personal finance news, explainers and guides. I see it often when I google a financial term I don’t know and sure enough, it’s one of the sites I’m most likely to click on. As it happens, NerdWallet also has the distinction of offering one of the only free budgeting apps I tested. In fact, there is no paid version; nothing is locked behind a paywall. The main catch: There are ads everywhere. To be fair, the free version of Mint was like this, too. Even with the inescapable credit card offers, NerdWallet has a clean, easy-to-understand user interface, which includes both a web and a mobile app. The key metrics that it highlights most prominently are your cash flow, net worth and credit score. (Of note, although Mint itself offered credit score monitoring, most of its rivals do not.) I particularly enjoyed the weekly insights, which delve into things like where you spent the most money or how much you paid in fees — and how that compares to the previous month. Because this is NerdWallet, an encyclopedia of financial info, you get some particularly specific category options when setting up your accounts (think: a Roth or non-Roth IRA). Dana Wollman / Engadget As a budgeting app, NerdWallet is more than serviceable, if a bit basic. Like other apps I tested, you can set up recurring bills. Importantly, it follows the popular 50/30/20 budgeting rule, which has you putting 50% of your budget toward things you need, 30% toward things you want, and the remaining 20% into savings or debt repayments. If this works for you, great — just know that you can’t customize your budget to the same degree as some competing apps. You can’t currently create custom spending categories, though a note inside the dashboard section of the app says “you’ll be able to customize them in the future.” You also can’t move items from the wants column to “needs” or vice versa but “In the future, you'll be able to move specific transactions to actively manage what falls into each group.” A NerdWallet spokesperson declined to provide an ETA, though. Lastly, it’s worth noting that NerdWallet had one of the most onerous setup processes of any app I tested. I don’t think this is a dealbreaker, as you’ll only have to do it once and, hopefully, you aren’t setting up six or seven apps in tandem as I was. What made NerdWallet’s onboarding especially tedious is that every time I wanted to add an account, I had to go through a two-factor authentication process to even get past the Plaid splash screen, and that’s not including the 2FA I had set up at each of my banks. This is a security policy on NerdWallet’s end, not Plaid’s, a Plaid spokesperson says. Precisely because NerdWallet is one of the only budget trackers to offer credit score monitoring, it also needs more of your personal info during setup, including your birthday, address, phone number and the last four digits of your social security number. It’s the same with Credit Karma, which also does credit score monitoring. Related to the setup process, I found that NerdWallet was less adept than other apps at automatically detecting my regular income. In my case, it counted a large one-time wire transfer as income, at which point my only other option was to enter my income manually (which is slightly annoying because I would have needed my pay stub handy to double-check my take-home pay). YNAB is, by its own admission, “different from anything you’ve tried before.” The app, whose name is short for You Need a Budget, promotes a so-called zero-based budgeting system, which forces you to assign a purpose for every dollar you earn. A frequently used analogy is to put each dollar in an envelope; you can always move money from one envelope to another in a pinch. These envelopes can include rent and utilities, along with unforeseen expenses like holiday gifts and the inevitable car repair. The idea is that if you budget a certain amount for the unknowns each month, they won’t feel like they’re sneaking up on you. Importantly, YNAB is only concerned with the money you have in your accounts now. The app does not ask you to provide your take-home income or set up recurring income payments (although there is a way to do this). The money you will make later in the month through your salaried job is not relevant, because YNAB does not engage in forecasting. The app is harder to learn than any other here, and it requires more ongoing effort from the user. And YNAB knows that. Inside both the mobile and web apps are links to videos and other tutorials. Although I never quite got comfortable with the user interface, I did come to appreciate YNAB’s insistence on intentionality. Forcing users to draft a new budget each month and to review each transaction is not necessarily a bad thing. As YNAB says on its website, “Sure, you’ve got pie charts showing that you spent an obscene amount of money in restaurants — but you’ve still spent an obscene amount of money in restaurants.” I can see this approach being useful for people who don’t tend to have a lot of cash in reserve at a given time, or who have spending habits they want to correct (to riff off of YNAB’s own example, ordering Seamless four times a week). My colleague Valentina Palladino, knowing I was working on this guide, penned a respectful rebuttal, explaining why she’s been using YNAB for years. Perhaps, like her, you have major savings goals you want to achieve, whether it’s paying for a wedding or buying a house. I suggest you give her column a read. For me, though, YNAB’s approach feels like overkill. Other Mint alternatives we tested PocketGuard PocketGuard used to be a solid free budget tracker, but the company has since limited its “free” version to just a free seven-day trial. Now, you’ll have to choose between two plans once the trial is over: a $13 monthly plan or a $75 annual plan. When I first tested it, I found it to be more restricted than NerdWallet, but still a decent option. The main overview screen shows you your net worth, total assets and debts; net income and total spending for the month; upcoming bills; a handy reminder of when your next paycheck lands; any debt payoff plan you have; and any goals. Like some other apps, including Quicken Simplifi, PocketGuard promotes an “after bills” approach, where you enter all of your recurring bills, and then PocketGuard shows you what’s left, and that’s what you’re supposed to be budgeting: your disposable income. Although PocketGuard’s UI is easy enough to understand, it lacks polish. The “accounts” tab is a little busy, and doesn’t show totals for categories like cash or investments. Seemingly small details like weirdly phrased or punctuated copy occasionally make the app feel janky. More than once, it prompted me to update the app when no updates were available. The web version, meanwhile, feels like the mobile app blown up to a larger format and doesn’t take advantage of the extra screen real estate. Ultimately, now that the free tier is gone, it just doesn’t present the same value proposition as it once did. What is Plaid and how does it work? Each of the apps I tested uses the same underlying network, called Plaid, to pull in financial data, so it’s worth explaining in its own section what it is and how it works. Plaid was founded as a fintech startup in 2013 and is today the industry standard in connecting banks with third-party apps. Plaid works with over 12,000 financial institutions across the US, Canada and Europe. Additionally, more than 8,000 third-party apps and services rely on Plaid, the company claims. To be clear, you don’t need a dedicated Plaid app to use it; the technology is baked into a wide array of apps, including the budget trackers I tested for this guide. Once you find the “add an account” option in whichever one you’re using, you’ll see a menu of commonly used banks. There’s also a search field you can use to look yours up directly. Once you find yours, you’ll be prompted to enter your login credentials. If you have two-factor authentication set up, you’ll need to enter a one-time passcode as well. As the middleman, Plaid is a passthrough for information that may include your account balances, transaction history, account type and routing or account number. Plaid uses encryption, and says it has a policy of not selling or renting customer data to other companies. However, I would not be doing my job if I didn’t note that in 2022 Plaid was forced to pay $58 million to consumers in a class action suit for collecting “more financial data than was needed.” As part of the settlement, Plaid was compelled to change some of its business practices. In a statement provided to Engadget, a Plaid spokesperson said the company continues to deny the allegations underpinning the lawsuit and that “the crux of the non-financial terms in the settlement are focused on us accelerating workstreams already underway related to giving people more transparency into Plaid’s role in connecting their accounts, and ensuring that our workstreams around data minimization remain on track.” How to import your financial data from the Mint app Mint users should consider getting their data ready to migrate to their new budgeting app of choice soon. Unfortunately, importing data from Mint is not as easy as entering your credentials from inside your new app and hitting “import.” In fact, any app that advertises the ability to port over your stats from Mint is just going to have you upload a CSV file of transactions and other data. To download a CSV file from Mint, do the following: Sign into Mint.com and hit Transactions in the menu on the left side of the screen. Select an account, or all accounts. Scroll down and look for “export [number] transactions” in smaller print. Your CSV file should begin downloading. Note: Downloading on a per-account basis might seem more annoying, but could help you get set up on the other side, if the app you’re using has you importing transactions one-for-one into their corresponding accounts. How we tested Mint alternatives Before I dove into the world of budgeting apps, I had to do some research. To find a list of apps to test, I consulted trusty ol’ Google (and even trustier Reddit); read reviews of popular apps on the App Store; and also asked friends and colleagues what budget tracking apps they might be using. Some of the apps I found were free, just like Mint. These, of course, show loads of ads (excuse me, “offers”) to stay in business. But most of the available apps require paid subscriptions, with prices typically topping out around $100 a year, or $15 a month. (Spoiler: My top pick is cheaper than that.) Since this guide is meant to help Mint users find a permanent replacement, any services I chose to test needed to do several things: import all of your account data into one place; offer budgeting tools; and track your spending, net worth and credit score. Except where noted, all of these apps are available for iOS, Android and on the web. Once I had my shortlist of six apps, I got to work setting them up. For the sake of thoroughly testing these apps (and remember, I really was looking for a Mint alternative myself), I made a point of adding every account to every budgeting app, no matter how small or immaterial the balance. What ensued was a veritable Groundhog Day of two-factor authentication. Just hours of entering passwords and one-time passcodes, for the same banks half a dozen times over. Hopefully, you only have to do this once. What about Rocket Money? Rocket Money is another free financial app that tracks spending and supports things like balance alerts and account linking. If you pay for the premium tier, the service can also help you cancel unwanted subscriptions. We did not test it for this guide, but we'll consider it in future updates.This article originally appeared on Engadget at https://www.engadget.com/apps/the-best-budgeting-apps-to-replace-mint-143047346.html?src=rss",
          "feed_position": 1,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2023-12/9003a9c0-9dd8-11ee-8bf5-613f22f37439"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/ai/why-ai-coding-agents-arent-production-ready-brittle-context-windows-broken",
          "published_at": "Sun, 07 Dec 2025 05:00:00 GMT",
          "title": "Why AI coding agents aren’t production-ready: Brittle context windows, broken refactors, missing operational awareness",
          "standfirst": "Remember this Quora comment (which also became a meme)?(Source: Quora)In the pre-large language model (LLM) Stack Overflow era, the challenge was discerning which code snippets to adopt and adapt effectively. Now, while generating code has become trivially easy, the more profound challenge lies in reliably identifying and integrating high-quality, enterprise-grade code into production environments.This article will examine the practical pitfalls and limitations observed when engineers use modern coding agents for real enterprise work, addressing the more complex issues around integration, scalability, accessibility, evolving security practices, data privacy and maintainability in live operational settings. We hope to balance out the hype and provide a more technically-grounded view of the capabilities of AI coding agents. Limited domain understanding and service limits AI agents struggle significantly with designing scalable systems due to the sheer explosion of choices and a critical lack of enterprise-specific context. To describe the problem in broad strokes, large enterprise codebases and monorepos are often too vast for agents to directly learn from, and crucial knowledge can be frequently fragmented across internal documentation and individual expertise.More specifically, many popular coding agents encounter service limits that hinder their effectiveness in large-scale environments. Indexing features may fail or degrade in quality for repositories exceeding 2,500 files, or due to memory constraints. Furthermore, files larger than 500 KB are often excluded from indexing/search, which impacts established products with decades-old, larger code files (although newer projects may admittedly face this less frequently).For complex tasks involving extensive file contexts or refactoring, developers are expected to provide the relevant files and while also explicitly defining the refactoring procedure and the surrounding build/command sequences to validate the implementation without introducing feature regressions.Lack of hardware context and usage AI agents have demonstrated a critical lack of awareness regarding OS machine, command-line and environment installations (conda/venv). This deficiency can lead to frustrating experiences, such as the agent attempting to execute Linux commands on PowerShell, which can consistently result in ‘unrecognized command’ errors. Furthermore, agents frequently exhibit inconsistent ‘wait tolerance’ on reading command outputs, prematurely declaring an inability to read results (and moving ahead to either retry/skip) before a command has even finished, especially on slower machines.This isn&#x27;t merely about nitpicking features; rather, the devil is in these practical details. These experience gaps manifest as real points of friction and necessitate constant human vigilance to monitor the agent’s activity in real-time. Otherwise, the agent might ignore initial tool call information and either stop prematurely, or proceed with a half-baked solution requiring undoing some/all changes, re-triggering prompts and wasting tokens. Submitting a prompt on a Friday evening and expecting the code updates to be done when checking on Monday morning is not guaranteed.Hallucinations over repeated actions Working with AI coding agents often presents a longstanding challenge of hallucinations, or incorrect or incomplete pieces of information (such as small code snippets) within a larger set of changesexpected to be fixed by a developer with trivial-to-low effort. However, what becomes particularly problematic is when incorrect behavior is repeated within a single thread, forcing users to either start a new thread and re-provide all context, or intervene manually to “unblock” the agent.For instance, during a Python Function code setup, an agent tasked with implementing complex production-readiness changes encountered a file (see below) containing special characters (parentheses, period, star). These characters are very common in computer science to denote software versions. (Image created manually with boilerplate code. Source: Microsoft Learn and Editing Application Host File (host.json) in Azure Portal)The agent incorrectly flagged this as an unsafe or harmful value, halting the entire generation process. This misidentification of an adversarial attack recurred 4 to 5 times despite various prompts attempting to restart or continue the modification. This version format is in-fact boilerplate, present in a Python HTTP-trigger code template. The only successful workaround involved instructing the agent to not read the file, and instead request it to simply provide the desired configuration and assure it that the developer will manually add it to that file, confirm and ask it to continue with remaining code changes.The inability to exit a repeatedly faulty agent output loop within the same thread highlights a practical limitation that significantly wastes development time. In essence, developers tend to now spend time on debugging/refining AI-generated code rather than Stack Overflow code snippets or their own.Lack of enterprise-grade coding practices Security best practices: Coding agents often default to less secure authentication methods like key-based authentication (client secrets) rather than modern identity-based solutions (such as Entra ID or federated credentials). This oversight can introduce significant vulnerabilities and increase maintenance overhead, as key management and rotation are complex tasks increasingly restricted in enterprise environments.Outdated SDKs and reinventing the wheel: Agents may not consistently leverage the latest SDK methods, instead generating more verbose and harder-to-maintain implementations. Piggybacking on the Azure Function example, agents have outputted code using the pre-existing v1 SDK for read/write operations, rather than the much cleaner and more maintainable v2 SDK code. Developers must research the latest best practices online to have a mental map of dependencies and expected implementation that ensures long-term maintainability and reduces upcoming tech migration efforts.Limited intent recognition and repetitive code: Even for smaller-scoped, modular tasks (which are typically encouraged to minimize hallucinations or debugging downtime) like extending an existing function definition, agents may follow the instruction literally and produce logic that turns out to be near-repetitive, without anticipating the upcoming or unarticulated needs of the developer. That is, in these modular tasks the agent may not automatically identify and refactor similar logic into shared functions or improve class definitions, leading to tech debt and harder-to-manage codebases especially with vibe coding or lazy developers.Simply put, those viral YouTube reels showcasing rapid zero-to-one app development from a single-sentence prompt simply fail to capture the nuanced challenges of production-grade software, where security, scalability, maintainability and future-resistant design architectures are paramount.Confirmation bias alignmentConfirmation bias is a significant concern, as LLMs frequently affirm user premises even when the user expresses doubt and asks the agent to refine their understanding or suggest alternate ideas. This tendency, where models align with what they perceive the user wants to hear, leads to reduced overall output quality, especially for more objective/technical tasks like coding.There is ample literature to suggest that if a model begins by outputting a claim like “You are absolutely right!”, the rest of the output tokens tend to justify this claim.Constant need to babysitDespite the allure of autonomous coding, the reality of AI agents in enterprise development often demands constant human vigilance. Instances like an agent attempting to execute Linux commands on PowerShell, false-positive safety flags or introduce inaccuracies due to domain-specific reasons highlight critical gaps; developers simply cannot step away. Rather, they must constantly monitor the reasoning process and understand multi-file code additions to avoid wasting time with subpar responses.The worst possible experience with agents is a developer accepting multi-file code updates riddled with bugs, then evaporating time in debugging due to how ‘beautiful’ the code seemingly looks. This can even give rise to the sunk cost fallacy of hoping the code will work after just a few fixes, especially when the updates are across multiple files in a complex/unfamiliar codebase with connections to multiple independent services.It&#x27;s akin to collaborating with a 10-year old prodigy who has memorized ample knowledge and even addresses every piece of user intent, but prioritizes showing-off that knowledge ove solving the actual problem, and lacks the foresight required for success in real-world use cases.This \"babysitting\" requirement, coupled with the frustrating recurrence of hallucinations, means that time spent debugging AI-generated code can eclipse the time savings anticipated with agent usage. Needless to say, developers in large companies need to be very intentional and strategic in navigating modern agentic tools and use-cases.ConclusionThere is no doubt that AI coding agents have been nothing short of revolutionary, accelerating prototyping, automating boilerplate coding and transforming how developers build. The real challenge now isn’t generating code, it’s knowing what to ship, how to secure it and where to scale it. Smart teams are learning to filter the hype, use agents strategically and double down on engineering judgment. As GitHub CEO Thomas Dohmke recently observed: The most advanced developers have “moved from writing code to architecting and verifying the implementation work that is carried out by AI agents.” In the agentic era, success belongs not to those who can prompt code, but those who can engineer systems that last.Rahul Raja is a staff software engineer at LinkedIn.Advitya Gemawat is a machine learning (ML) engineer at Microsoft.Editors note: The opinions expressed in this article are the authors&#x27; personal opinions and do not reflect the opinions of their employers.",
          "content": "Remember this Quora comment (which also became a meme)?(Source: Quora)In the pre-large language model (LLM) Stack Overflow era, the challenge was discerning which code snippets to adopt and adapt effectively. Now, while generating code has become trivially easy, the more profound challenge lies in reliably identifying and integrating high-quality, enterprise-grade code into production environments.This article will examine the practical pitfalls and limitations observed when engineers use modern coding agents for real enterprise work, addressing the more complex issues around integration, scalability, accessibility, evolving security practices, data privacy and maintainability in live operational settings. We hope to balance out the hype and provide a more technically-grounded view of the capabilities of AI coding agents. Limited domain understanding and service limits AI agents struggle significantly with designing scalable systems due to the sheer explosion of choices and a critical lack of enterprise-specific context. To describe the problem in broad strokes, large enterprise codebases and monorepos are often too vast for agents to directly learn from, and crucial knowledge can be frequently fragmented across internal documentation and individual expertise.More specifically, many popular coding agents encounter service limits that hinder their effectiveness in large-scale environments. Indexing features may fail or degrade in quality for repositories exceeding 2,500 files, or due to memory constraints. Furthermore, files larger than 500 KB are often excluded from indexing/search, which impacts established products with decades-old, larger code files (although newer projects may admittedly face this less frequently).For complex tasks involving extensive file contexts or refactoring, developers are expected to provide the relevant files and while also explicitly defining the refactoring procedure and the surrounding build/command sequences to validate the implementation without introducing feature regressions.Lack of hardware context and usage AI agents have demonstrated a critical lack of awareness regarding OS machine, command-line and environment installations (conda/venv). This deficiency can lead to frustrating experiences, such as the agent attempting to execute Linux commands on PowerShell, which can consistently result in ‘unrecognized command’ errors. Furthermore, agents frequently exhibit inconsistent ‘wait tolerance’ on reading command outputs, prematurely declaring an inability to read results (and moving ahead to either retry/skip) before a command has even finished, especially on slower machines.This isn&#x27;t merely about nitpicking features; rather, the devil is in these practical details. These experience gaps manifest as real points of friction and necessitate constant human vigilance to monitor the agent’s activity in real-time. Otherwise, the agent might ignore initial tool call information and either stop prematurely, or proceed with a half-baked solution requiring undoing some/all changes, re-triggering prompts and wasting tokens. Submitting a prompt on a Friday evening and expecting the code updates to be done when checking on Monday morning is not guaranteed.Hallucinations over repeated actions Working with AI coding agents often presents a longstanding challenge of hallucinations, or incorrect or incomplete pieces of information (such as small code snippets) within a larger set of changesexpected to be fixed by a developer with trivial-to-low effort. However, what becomes particularly problematic is when incorrect behavior is repeated within a single thread, forcing users to either start a new thread and re-provide all context, or intervene manually to “unblock” the agent.For instance, during a Python Function code setup, an agent tasked with implementing complex production-readiness changes encountered a file (see below) containing special characters (parentheses, period, star). These characters are very common in computer science to denote software versions. (Image created manually with boilerplate code. Source: Microsoft Learn and Editing Application Host File (host.json) in Azure Portal)The agent incorrectly flagged this as an unsafe or harmful value, halting the entire generation process. This misidentification of an adversarial attack recurred 4 to 5 times despite various prompts attempting to restart or continue the modification. This version format is in-fact boilerplate, present in a Python HTTP-trigger code template. The only successful workaround involved instructing the agent to not read the file, and instead request it to simply provide the desired configuration and assure it that the developer will manually add it to that file, confirm and ask it to continue with remaining code changes.The inability to exit a repeatedly faulty agent output loop within the same thread highlights a practical limitation that significantly wastes development time. In essence, developers tend to now spend time on debugging/refining AI-generated code rather than Stack Overflow code snippets or their own.Lack of enterprise-grade coding practices Security best practices: Coding agents often default to less secure authentication methods like key-based authentication (client secrets) rather than modern identity-based solutions (such as Entra ID or federated credentials). This oversight can introduce significant vulnerabilities and increase maintenance overhead, as key management and rotation are complex tasks increasingly restricted in enterprise environments.Outdated SDKs and reinventing the wheel: Agents may not consistently leverage the latest SDK methods, instead generating more verbose and harder-to-maintain implementations. Piggybacking on the Azure Function example, agents have outputted code using the pre-existing v1 SDK for read/write operations, rather than the much cleaner and more maintainable v2 SDK code. Developers must research the latest best practices online to have a mental map of dependencies and expected implementation that ensures long-term maintainability and reduces upcoming tech migration efforts.Limited intent recognition and repetitive code: Even for smaller-scoped, modular tasks (which are typically encouraged to minimize hallucinations or debugging downtime) like extending an existing function definition, agents may follow the instruction literally and produce logic that turns out to be near-repetitive, without anticipating the upcoming or unarticulated needs of the developer. That is, in these modular tasks the agent may not automatically identify and refactor similar logic into shared functions or improve class definitions, leading to tech debt and harder-to-manage codebases especially with vibe coding or lazy developers.Simply put, those viral YouTube reels showcasing rapid zero-to-one app development from a single-sentence prompt simply fail to capture the nuanced challenges of production-grade software, where security, scalability, maintainability and future-resistant design architectures are paramount.Confirmation bias alignmentConfirmation bias is a significant concern, as LLMs frequently affirm user premises even when the user expresses doubt and asks the agent to refine their understanding or suggest alternate ideas. This tendency, where models align with what they perceive the user wants to hear, leads to reduced overall output quality, especially for more objective/technical tasks like coding.There is ample literature to suggest that if a model begins by outputting a claim like “You are absolutely right!”, the rest of the output tokens tend to justify this claim.Constant need to babysitDespite the allure of autonomous coding, the reality of AI agents in enterprise development often demands constant human vigilance. Instances like an agent attempting to execute Linux commands on PowerShell, false-positive safety flags or introduce inaccuracies due to domain-specific reasons highlight critical gaps; developers simply cannot step away. Rather, they must constantly monitor the reasoning process and understand multi-file code additions to avoid wasting time with subpar responses.The worst possible experience with agents is a developer accepting multi-file code updates riddled with bugs, then evaporating time in debugging due to how ‘beautiful’ the code seemingly looks. This can even give rise to the sunk cost fallacy of hoping the code will work after just a few fixes, especially when the updates are across multiple files in a complex/unfamiliar codebase with connections to multiple independent services.It&#x27;s akin to collaborating with a 10-year old prodigy who has memorized ample knowledge and even addresses every piece of user intent, but prioritizes showing-off that knowledge ove solving the actual problem, and lacks the foresight required for success in real-world use cases.This \"babysitting\" requirement, coupled with the frustrating recurrence of hallucinations, means that time spent debugging AI-generated code can eclipse the time savings anticipated with agent usage. Needless to say, developers in large companies need to be very intentional and strategic in navigating modern agentic tools and use-cases.ConclusionThere is no doubt that AI coding agents have been nothing short of revolutionary, accelerating prototyping, automating boilerplate coding and transforming how developers build. The real challenge now isn’t generating code, it’s knowing what to ship, how to secure it and where to scale it. Smart teams are learning to filter the hype, use agents strategically and double down on engineering judgment. As GitHub CEO Thomas Dohmke recently observed: The most advanced developers have “moved from writing code to architecting and verifying the implementation work that is carried out by AI agents.” In the agentic era, success belongs not to those who can prompt code, but those who can engineer systems that last.Rahul Raja is a staff software engineer at LinkedIn.Advitya Gemawat is a machine learning (ML) engineer at Microsoft.Editors note: The opinions expressed in this article are the authors&#x27; personal opinions and do not reflect the opinions of their employers.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/57iOC9GySM11PZVim8VPJd/8dc8208b48161a7b58f9b78b4c4e53e1/DDM-AI_agents_at_work.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/a-marvel-beat-em-up-long-awaited-survival-horror-and-other-new-indie-games-worth-checking-out-120000228.html",
          "published_at": "Sat, 06 Dec 2025 12:00:00 +0000",
          "title": "A Marvel beat-'em-up, long-awaited survival horror and other new indie games worth checking out",
          "standfirst": "Welcome to our latest roundup of what's going on in the indie game space. A bunch of titles that are arriving very late to make it into game of the year conversations debuted this week, and we learned some new details about upcoming projects, such as a release date for a rad-looking arena shooter called Don't Stop, Girlypop.Marvel Cosmic Invasion is one of the higher-profile indies to hit consoles and PC this week. It's from Tribute Games and publisher Dotemu, the same pair that brought us Teenage Mutant Ninja Turtles: Shredder's Revenge. Cosmic Invasion largely draws from the same playbook: it's also a retro-style side-scrolling beat-'em-up with a look that apes the Marvel animated shows from the '90s. It's an enjoyable enough game, largely thanks to the variety of characters and how differently they play. Captain America is one of my favorites. Each character has a secondary move (often a ranged attack) to go with their basic melee strikes, and Cap's one has no ammo or cooldown. I never grew tired of spamming his shield projectile attack and knocking enemies off the screen. I really enjoyed playing as She-Hulk too. Her secondary move involves grabbing an enemy and throwing them around. She-Hulk can also toss them into the air then leap with McTominay-esque athleticism to deliver a kick and send the baddie crashing into its cohorts. The character swap system (each player chooses two and can switch between them any time) evokes tag fighting games and the co-op features work well too.There isn't a ton of depth to Marvel Cosmic Invasion, unfortunately, but the presentation is spot on. It's out now on Steam, Nintendo Switch, Nintendo Switch 2, PlayStation 5 and Xbox Series X/S for $30. It's also on Game Pass Ultimate and PC Game Pass.New releasesIt only took 13 years from announcement to release but survival horror title Routine (from Lunar Software and publisher Raw Fury) has emerged on Steam, the Xbox PC app, Xbox One, Xbox Series X/S and Xbox Cloud. It's available on Game Pass Ultimate and PC Game Pass.Routine offers up a slice of liminal space terror with a dash of retro-futurism. Lunar Software based the aesthetic on \"how people from the 1980s might envision a believable moon base\" with analogue technology.Your mission is to explore the base and try to determine how it got to this state. Lunar wanted Routine to feel as immersive as possible, so there are no waypoint markers and you won't see a heads-up display. Instead, you have a personal data assistant that connects to wireless access points throughout the base and provides you with information about your current goals. Here's another horror title we've been looking forward to for several years. Sleep Awake deals with things that go bump in the night. It's a first-person psychedelic horror game in which a force called The HUSH makes anyone who falls asleep vanish. So, our hero Katja and other residents of the last-known city on Earth try various ways to stay awake, but they’ll inevitably have to deal with the effects of sleep derivation. Sleep Awake is from Eyes Out — a studio formed by Spec Ops: The Line director Cory Davis and Nine Inch Nails guitarist Robin Finck — and publisher Blumhouse Games. It's out now on Steam, PlayStation 5 and Xbox Series X/S for $30.How about another horror game? It's the last one we have this week, I promise. Tingus Goose has been on my radar for a while because it just looks so deeply strange. This is billed as \"a cozy body horror idle game\" in which you \"plant seeds in patients, bounce babies for profit and ascend through surreal worlds toward riches.\" I'm glad for that description from the game's PR team, because I don't fully know what to make of the trailer. A goose emerges from a human being's torso and grows a giant neck and human fingers stick out of it and… it's all just so strange. But I kinda dig it? Tingus Goose is from SweatyChair and co-publishers Playsaurus and UltraPlayers. It's on Steam for $5.94 until December 8, and it will cost $7 after that.I haven't seen anything that looks quite like Effulgence RPG before. It's a party-based RPG with a 3D ASCII art style. Here, you'll need to take out enemies to acquire better gear.Andrei Fomin released Effulgence RPG in early access on Steam this week for $10. The solo developer is aiming to release the full version of the game in June and to add more content and quality-of-life updates in the meantime. It's not usually the kind of game that I'd normally be drawn toward, but that art style alone is cool enough to make me want to try it.Looking for something a little more relaxing? Log Away is a cozy cabin builder from The-Mark Entertainment. There are several environments to choose from and a variety of decorations at your disposal depending on your interests. You can have a pet too, so that qualifies Log Away as this week's dog game.I've played it a bit and found it to be quite relaxing, a soothing counter punch to the non-stop action of Cosmic Invasion. It's out now on Steam for $10, but if you buy it by December 11 you'll save a dollar and get a Christmas-themed DLC at no extra cost.I adore Sayonara Wild Hearts with every fiber of my being and I appreciated what Simogo did with Lorelai and the Laser Eyes, even if I never stuck with it for long. I haven't played any of the studio's earlier games, though. That's something I'm planning to fix very soon now that the Simogo Legacy Collection is here.The studio reworked all of its first seven mobile games — including Year Walk and Device 6 — and combined them into a collection that's available on Steam, Nintendo Switch and Switch 2. It costs $15 though there's a 15 percent discount until December 12. I'm very much looking forward to digging into this over the holidays.Upcoming I've been very much looking forward to Don’t Stop, Girlypop! for a while. It's a movement-focused arena shooter with a Y2K aesthetic. Think of it as an anti-capitalist, hyperpop riff on games like Doom Eternal.The demo is a lot of fun and I'm glad there's finally a release date for this game from Funny Fintan Softworks and publisher Kwalee. It's coming to Steam on January 29.Limbot seems like it could be a fun party game. You can play it by yourself, but having three friends join you seems like the optimal way to go. In that case, each of you will take control of one of a cardboard robot's limbs. So you'll have to coordinate to move around this papercraft world effectively and complete precision-based objectives. It sounds like a recipe for an Overcooked-style tiff between friends.This physics-based game from Ionized Studios is coming to Steam, Xbox One and Xbox Series X/S. It's slated to arrive between April and June next year.Polyperfect's Zlin City: Arch Moderna is a diorama city builder inspired by historical events of the 1930s and '40s and the architecture of Zlin, a town in Czechia (Czech Republic). The developers used 3D printing, photogrammetry and 3D scanning to capture the objects that are used in the game. The result is something that — at least at first glance — looks beautifully textured. There's no confirmed release window for Zlin City: Arch Moderna as yet. It'll be available on Steam.This article originally appeared on Engadget at https://www.engadget.com/gaming/a-marvel-beat-em-up-long-awaited-survival-horror-and-other-new-indie-games-worth-checking-out-120000228.html?src=rss",
          "content": "Welcome to our latest roundup of what's going on in the indie game space. A bunch of titles that are arriving very late to make it into game of the year conversations debuted this week, and we learned some new details about upcoming projects, such as a release date for a rad-looking arena shooter called Don't Stop, Girlypop.Marvel Cosmic Invasion is one of the higher-profile indies to hit consoles and PC this week. It's from Tribute Games and publisher Dotemu, the same pair that brought us Teenage Mutant Ninja Turtles: Shredder's Revenge. Cosmic Invasion largely draws from the same playbook: it's also a retro-style side-scrolling beat-'em-up with a look that apes the Marvel animated shows from the '90s. It's an enjoyable enough game, largely thanks to the variety of characters and how differently they play. Captain America is one of my favorites. Each character has a secondary move (often a ranged attack) to go with their basic melee strikes, and Cap's one has no ammo or cooldown. I never grew tired of spamming his shield projectile attack and knocking enemies off the screen. I really enjoyed playing as She-Hulk too. Her secondary move involves grabbing an enemy and throwing them around. She-Hulk can also toss them into the air then leap with McTominay-esque athleticism to deliver a kick and send the baddie crashing into its cohorts. The character swap system (each player chooses two and can switch between them any time) evokes tag fighting games and the co-op features work well too.There isn't a ton of depth to Marvel Cosmic Invasion, unfortunately, but the presentation is spot on. It's out now on Steam, Nintendo Switch, Nintendo Switch 2, PlayStation 5 and Xbox Series X/S for $30. It's also on Game Pass Ultimate and PC Game Pass.New releasesIt only took 13 years from announcement to release but survival horror title Routine (from Lunar Software and publisher Raw Fury) has emerged on Steam, the Xbox PC app, Xbox One, Xbox Series X/S and Xbox Cloud. It's available on Game Pass Ultimate and PC Game Pass.Routine offers up a slice of liminal space terror with a dash of retro-futurism. Lunar Software based the aesthetic on \"how people from the 1980s might envision a believable moon base\" with analogue technology.Your mission is to explore the base and try to determine how it got to this state. Lunar wanted Routine to feel as immersive as possible, so there are no waypoint markers and you won't see a heads-up display. Instead, you have a personal data assistant that connects to wireless access points throughout the base and provides you with information about your current goals. Here's another horror title we've been looking forward to for several years. Sleep Awake deals with things that go bump in the night. It's a first-person psychedelic horror game in which a force called The HUSH makes anyone who falls asleep vanish. So, our hero Katja and other residents of the last-known city on Earth try various ways to stay awake, but they’ll inevitably have to deal with the effects of sleep derivation. Sleep Awake is from Eyes Out — a studio formed by Spec Ops: The Line director Cory Davis and Nine Inch Nails guitarist Robin Finck — and publisher Blumhouse Games. It's out now on Steam, PlayStation 5 and Xbox Series X/S for $30.How about another horror game? It's the last one we have this week, I promise. Tingus Goose has been on my radar for a while because it just looks so deeply strange. This is billed as \"a cozy body horror idle game\" in which you \"plant seeds in patients, bounce babies for profit and ascend through surreal worlds toward riches.\" I'm glad for that description from the game's PR team, because I don't fully know what to make of the trailer. A goose emerges from a human being's torso and grows a giant neck and human fingers stick out of it and… it's all just so strange. But I kinda dig it? Tingus Goose is from SweatyChair and co-publishers Playsaurus and UltraPlayers. It's on Steam for $5.94 until December 8, and it will cost $7 after that.I haven't seen anything that looks quite like Effulgence RPG before. It's a party-based RPG with a 3D ASCII art style. Here, you'll need to take out enemies to acquire better gear.Andrei Fomin released Effulgence RPG in early access on Steam this week for $10. The solo developer is aiming to release the full version of the game in June and to add more content and quality-of-life updates in the meantime. It's not usually the kind of game that I'd normally be drawn toward, but that art style alone is cool enough to make me want to try it.Looking for something a little more relaxing? Log Away is a cozy cabin builder from The-Mark Entertainment. There are several environments to choose from and a variety of decorations at your disposal depending on your interests. You can have a pet too, so that qualifies Log Away as this week's dog game.I've played it a bit and found it to be quite relaxing, a soothing counter punch to the non-stop action of Cosmic Invasion. It's out now on Steam for $10, but if you buy it by December 11 you'll save a dollar and get a Christmas-themed DLC at no extra cost.I adore Sayonara Wild Hearts with every fiber of my being and I appreciated what Simogo did with Lorelai and the Laser Eyes, even if I never stuck with it for long. I haven't played any of the studio's earlier games, though. That's something I'm planning to fix very soon now that the Simogo Legacy Collection is here.The studio reworked all of its first seven mobile games — including Year Walk and Device 6 — and combined them into a collection that's available on Steam, Nintendo Switch and Switch 2. It costs $15 though there's a 15 percent discount until December 12. I'm very much looking forward to digging into this over the holidays.Upcoming I've been very much looking forward to Don’t Stop, Girlypop! for a while. It's a movement-focused arena shooter with a Y2K aesthetic. Think of it as an anti-capitalist, hyperpop riff on games like Doom Eternal.The demo is a lot of fun and I'm glad there's finally a release date for this game from Funny Fintan Softworks and publisher Kwalee. It's coming to Steam on January 29.Limbot seems like it could be a fun party game. You can play it by yourself, but having three friends join you seems like the optimal way to go. In that case, each of you will take control of one of a cardboard robot's limbs. So you'll have to coordinate to move around this papercraft world effectively and complete precision-based objectives. It sounds like a recipe for an Overcooked-style tiff between friends.This physics-based game from Ionized Studios is coming to Steam, Xbox One and Xbox Series X/S. It's slated to arrive between April and June next year.Polyperfect's Zlin City: Arch Moderna is a diorama city builder inspired by historical events of the 1930s and '40s and the architecture of Zlin, a town in Czechia (Czech Republic). The developers used 3D printing, photogrammetry and 3D scanning to capture the objects that are used in the game. The result is something that — at least at first glance — looks beautifully textured. There's no confirmed release window for Zlin City: Arch Moderna as yet. It'll be available on Steam.This article originally appeared on Engadget at https://www.engadget.com/gaming/a-marvel-beat-em-up-long-awaited-survival-horror-and-other-new-indie-games-worth-checking-out-120000228.html?src=rss",
          "feed_position": 12
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2023-12/9003a9c0-9dd8-11ee-8bf5-613f22f37439",
      "popularity_score": 2018.7010244444446
    },
    {
      "id": "cluster_41",
      "coverage": 2,
      "updated_at": "2025-12-07T15:52:37-05:00",
      "title": "X cuts off the European Commission’s ad account after being fined €120 million",
      "neutral_headline": "X cuts off the European Commission’s ad account after being fined €120 million",
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/839742/x-cuts-off-the-european-commissions-ad-account",
          "published_at": "2025-12-07T15:52:37-05:00",
          "title": "X cuts off the European Commission’s ad account after being fined €120 million",
          "standfirst": "Friday, the EU slapped X with a €120 million fine (about $140 million) for violating the Digital Services Act (DSA). It was the first time that a company had been hit with a penalty for running afoul of the law. Elon Musk responded with his trademark tact and professionalism by posting “Bullshit” on X in [&#8230;]",
          "content": "Friday, the EU slapped X with a €120 million fine (about $140 million) for violating the Digital Services Act (DSA). It was the first time that a company had been hit with a penalty for running afoul of the law. Elon Musk responded with his trademark tact and professionalism by posting “Bullshit” on X in response to the announcement from the European Commission. But that wasn’t the end, because just a day later Nikita Bier, X&#8217;s head of product, accused the Commission of abusing an exploit to boost the reach of the announcement and responded by shutting down its ad account. According to Bier, the Commission had not used its ad account since 2021, but used a post format explicitly reserved for ads in its announcement of the fine against X. He claims that the Commission posted “a link that deceives users into thinking it’s a video and to artificially increase its reach.” (For the record, the post itself includes a video.) The seemingly retaliatory revocation of the European Commission’s ad account is unlikely to materially change things for either X or the EU. If, as Bier claims, the Commission has not used its ad account since 2021, holding it hostage is unlikely to give X any leverage. And, while it can appeal the decision, X is currently still on the hook for the sizable fine. Plus, it must provide details for how it plans to address the “deceptive” use of verified checkmarks in the next 60 days, or face additional penalties. We’ve reached out to the Commission for comment and will update if we hear back.",
          "feed_position": 2
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/07/x-deactivates-european-commissions-ad-account-after-the-company-was-fined-e120m/",
          "published_at": "Sun, 07 Dec 2025 19:27:13 +0000",
          "title": "X deactivates European Commission’s ad account after the company was fined €120M",
          "standfirst": "X has seemingly penalized the European Commission's account after the commission fined the company over blue checkmarks and ad transparency.",
          "content": "X has seemingly penalized the European Commission's account after the commission fined the company over blue checkmarks and ad transparency.",
          "feed_position": 1
        }
      ],
      "popularity_score": 2005.5538022222222
    },
    {
      "id": "cluster_66",
      "coverage": 2,
      "updated_at": "Sat, 06 Dec 2025 20:07:50 +0000",
      "title": "Apple's Johny Srouji could continue the company's executive exodus, according to report",
      "neutral_headline": "Apple’s chip chief might be the next exec to leave",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/big-tech/apples-johny-srouji-could-continue-the-companys-executive-exodus-according-to-report-200750252.html",
          "published_at": "Sat, 06 Dec 2025 20:07:50 +0000",
          "title": "Apple's Johny Srouji could continue the company's executive exodus, according to report",
          "standfirst": "Apple's Johny Srouji may be the latest company executive to seek greener pastures, according to a report from Bloomberg. The report said that Srouji, Apple's senior vice president of hardware technologies, told Tim Cook that he is \"seriously considering leaving in the near future.\" While the report didn't mention if Srouji has another job lined up, Bloomberg's sources claimed that he wants to join another company if he leaves Apple. Srouji joined the company in 2008 to develop Apple's first in-house system-on-a-chip and eventually led the transition to Apple silicon. If Srouji leaves Apple, he would be the latest in a string of departures of longtime execs. At the start of the month, Apple announced that John Giannandrea, the company's senior vice president for machine learning and AI strategy, would be retiring from his role in spring 2026. A couple of days later, Bloomberg reported that the company's head of interface design, Alan Dye, would be leaving for a role at Meta. Adding to those exits, Apple also revealed that Kate Adams, who has been Apple's general counsel since 2017, and Lisa Jackson, vice president for Environment, Policy, and Social Initiatives, will both be leaving in early 2026. The shakeup at the executive level comes after Bloomberg's Mark Gurman previously reported that Cook may not be preparing for his own departure as CEO next year. Gurman's prediction counters a report from the Financial Times that claimed that Apple was accelerating succession plans for Cook with an expected stepping down sometime next year.This article originally appeared on Engadget at https://www.engadget.com/big-tech/apples-johny-srouji-could-continue-the-companys-executive-exodus-according-to-report-200750252.html?src=rss",
          "content": "Apple's Johny Srouji may be the latest company executive to seek greener pastures, according to a report from Bloomberg. The report said that Srouji, Apple's senior vice president of hardware technologies, told Tim Cook that he is \"seriously considering leaving in the near future.\" While the report didn't mention if Srouji has another job lined up, Bloomberg's sources claimed that he wants to join another company if he leaves Apple. Srouji joined the company in 2008 to develop Apple's first in-house system-on-a-chip and eventually led the transition to Apple silicon. If Srouji leaves Apple, he would be the latest in a string of departures of longtime execs. At the start of the month, Apple announced that John Giannandrea, the company's senior vice president for machine learning and AI strategy, would be retiring from his role in spring 2026. A couple of days later, Bloomberg reported that the company's head of interface design, Alan Dye, would be leaving for a role at Meta. Adding to those exits, Apple also revealed that Kate Adams, who has been Apple's general counsel since 2017, and Lisa Jackson, vice president for Environment, Policy, and Social Initiatives, will both be leaving in early 2026. The shakeup at the executive level comes after Bloomberg's Mark Gurman previously reported that Cook may not be preparing for his own departure as CEO next year. Gurman's prediction counters a report from the Financial Times that claimed that Apple was accelerating succession plans for Cook with an expected stepping down sometime next year.This article originally appeared on Engadget at https://www.engadget.com/big-tech/apples-johny-srouji-could-continue-the-companys-executive-exodus-according-to-report-200750252.html?src=rss",
          "feed_position": 8
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/839700/apples-chip-chief-might-be-the-next-exec-to-leave",
          "published_at": "2025-12-06T14:55:52-05:00",
          "title": "Apple’s chip chief might be the next exec to leave",
          "standfirst": "Bloomberg’s Mark Gurman is reporting that Johny Srouji, senior vice president of hardware technologies, told Tim Cook he is “seriously considering” leaving Apple for another company in the near future. It was reported in October that Srouji was “evaluating his future at the tech giant.” While nothing is confirmed, it seems the executive is leaning [&#8230;]",
          "content": "Bloomberg’s Mark Gurman is reporting that Johny Srouji, senior vice president of hardware technologies, told Tim Cook he is “seriously considering” leaving Apple for another company in the near future. It was reported in October that Srouji was “evaluating his future at the tech giant.” While nothing is confirmed, it seems the executive is leaning toward not having a future at Cupertino. If Srouji leaves, he would be just the latest in a string of high-profile shakeups in the company’s C-suite. COO Jeff Williams announced his retirement in July, which led to some shifting of roles. But things have only accelerated in December, with AI chief John Giannandrea stepping down, policy lead Lisa Jackson and general counsel Kate Adams announcing plans to retire, and UI design lead Alan Dye departing for Meta, all in the last few days. Apple has struggled somewhat to find its footing as the industry further embraces AI. Now Tim Cook is tasked with trying to stem the bleeding, while being subject to rumors of his own departure. Gurman, who is usually reliable, has said those rumors are premature, but it still adds to the uncertainty surrounding what is typically one of the more stable companies in Silicon Valley.",
          "feed_position": 8
        }
      ],
      "popularity_score": 2000
    },
    {
      "id": "cluster_57",
      "coverage": 1,
      "updated_at": "Sun, 07 Dec 2025 12:08:58 +0000",
      "title": "Why is my dog like this? Current DNA tests won’t explain it to you.",
      "neutral_headline": "Why is my dog like this? Current DNA tests won’t explain it to you.",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/why-is-my-dog-like-this-current-dna-tests-wont-explain-it-to-you/",
          "published_at": "Sun, 07 Dec 2025 12:08:58 +0000",
          "title": "Why is my dog like this? Current DNA tests won’t explain it to you.",
          "standfirst": "Dog behavior is a lot more complicated than any one gene variant.",
          "content": "Popular genetics tests can’t tell you much about your dog’s personality, according to a recent study. A team of geneticists recently found no connection between simple genetic variants and behavioral traits in more than 3,200 dogs, even though previous studies suggested that hundreds of genes might predict aspects of a dog’s behavior and personality. That’s despite the popularity of at-home genetic tests that claim they can tell you whether your dog’s genes contain the recipe for anxiety or a fondness for cuddles. This is Max, and no single genetic variant can explain why he is the way he is. Credit: Kiona Smith Gattaca for dogs, except it doesn’t work University of Massachusetts genomicist Kathryn Lord and her colleagues compared DNA sequences and behavioral surveys from more than 3,000 dogs whose humans had enrolled them in the Darwin’s Ark project (and filled out the surveys). “Genetic tests for behavioral and personality traits in dogs are now being marketed to pet owners, but their predictive accuracy has not been validated,” wrote Lord and her colleagues in their recent paper.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1498905251-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1498905251-1152x648.jpg",
      "popularity_score": 353
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Sat, 06 Dec 2025 12:30:35 +0000",
      "title": "A massive, Chinese-backed port could push the Amazon Rainforest over the edge",
      "neutral_headline": "A massive, Chinese-backed port could push the Amazon Rainforest over the edge",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/a-massive-chinese-backed-port-could-push-the-amazon-rainforest-over-the-edge/",
          "published_at": "Sat, 06 Dec 2025 12:30:35 +0000",
          "title": "A massive, Chinese-backed port could push the Amazon Rainforest over the edge",
          "standfirst": "The port will revolutionize global trade, but it’s sparking destructive rainforest routes.",
          "content": "CHANCAY, Peru—The elevator doors leading to the fifth-floor control center open like stage curtains onto a theater-sized screen. This “Operations Productivity Dashboard” instantaneously displays a battery of data: vehicle locations, shipping times, entry times, loading data, unloading data, efficiency statistics. Most striking, though, are the bold lines arcing over the dashboard’s deep-blue Pacific—digital streaks illustrating the routes that lead thousands of miles across the ocean, from this unassuming city, to Asia’s biggest ports.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2182963624-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2182963624-1152x648.jpg",
      "popularity_score": 338
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "Streaming service makes rare decision to lower its monthly fees",
      "neutral_headline": "Streaming service makes rare decision to lower its monthly fees",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/fubo-lowers-its-prices-by-up-to-15-after-losing-nbcuniversal-channels/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "Streaming service makes rare decision to lower its monthly fees",
          "standfirst": "",
          "content": "",
          "feed_position": 2
        }
      ],
      "popularity_score": 332.99822916666665
    },
    {
      "id": "cluster_3",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "Netflix’s $72B WB acquisition confounds the future of movie theaters, streaming",
      "neutral_headline": "Netflix’s $72B WB acquisition confounds the future of movie theaters, streaming",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/netflixs-72b-wb-acquisition-confounds-the-future-of-movie-theaters-streaming/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "Netflix’s $72B WB acquisition confounds the future of movie theaters, streaming",
          "standfirst": "",
          "content": "",
          "feed_position": 3
        }
      ],
      "popularity_score": 322.99822916666665
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "Rare set of varied factors triggered Black Death",
      "neutral_headline": "Rare set of varied factors triggered Black Death",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/how-volcanoes-helped-spark-the-black-death/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "Rare set of varied factors triggered Black Death",
          "standfirst": "",
          "content": "",
          "feed_position": 4
        }
      ],
      "popularity_score": 309.99822916666665
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "SteamOS tested on dedicated GPUs: No, it’s not always faster than Windows",
      "neutral_headline": "SteamOS tested on dedicated GPUs: No, it’s not always faster than Windows",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/steamos-vs-windows-on-dedicated-gpus-its-complicated-but-windows-has-an-edge/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "SteamOS tested on dedicated GPUs: No, it’s not always faster than Windows",
          "standfirst": "",
          "content": "",
          "feed_position": 5
        }
      ],
      "popularity_score": 307.99822916666665
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "Without evidence, RFK Jr.&rsquo;s vaccine panel tosses hep B vaccine recommendation",
      "neutral_headline": "Without evidence, RFK Jr.&rsquo;s vaccine panel tosses hep B vaccine recommendation",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/without-evidence-rfk-jr-s-vaccine-panel-tosses-heb-b-vaccine-recommendation/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "Without evidence, RFK Jr.&rsquo;s vaccine panel tosses hep B vaccine recommendation",
          "standfirst": "",
          "content": "",
          "feed_position": 6
        }
      ],
      "popularity_score": 298.99822916666665
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "Elon Musk’s X first to be fined under EU’s Digital Services Act",
      "neutral_headline": "Elon Musk’s X first to be fined under EU’s Digital Services Act",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/elon-musks-x-first-to-be-fined-under-eus-digital-service-act/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "Elon Musk’s X first to be fined under EU’s Digital Services Act",
          "standfirst": "",
          "content": "",
          "feed_position": 7
        }
      ],
      "popularity_score": 282.99822916666665
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.937Z",
      "title": "Toyota’s new GR GT picks up where the 2000GT and Lexus LFA left off",
      "neutral_headline": "Toyota’s new GR GT picks up where the 2000GT and Lexus LFA left off",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/toyota-busts-out-a-new-flagship-gazoo-racing-coupe-plus-gt3-version/",
          "published_at": "2025-12-08T11:19:16.937Z",
          "title": "Toyota’s new GR GT picks up where the 2000GT and Lexus LFA left off",
          "standfirst": "",
          "content": "",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.99822916666665
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "2025-12-08T11:19:16.938Z",
      "title": "New report warns of critical climate risks in Arab region",
      "neutral_headline": "New report warns of critical climate risks in Arab region",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/new-report-warns-of-critical-climate-risks-in-arab-region/",
          "published_at": "2025-12-08T11:19:16.938Z",
          "title": "New report warns of critical climate risks in Arab region",
          "standfirst": "",
          "content": "",
          "feed_position": 9
        }
      ],
      "popularity_score": 270.99822944444446
    }
  ]
}