{
  "updated_at": "2026-01-19T19:19:38.512Z",
  "clusters": [
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "Mon, 19 Jan 2026 19:04:18 +0000",
      "title": "Elon Musk accused of making up math to squeeze $134B from OpenAI, Microsoft",
      "neutral_headline": "Elon Musk accused of making up math to squeeze $134B from OpenAI, Microsoft",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/elon-musk-accused-of-making-up-math-to-squeeze-134b-from-openai-microsoft/",
          "published_at": "Mon, 19 Jan 2026 19:04:18 +0000",
          "title": "Elon Musk accused of making up math to squeeze $134B from OpenAI, Microsoft",
          "standfirst": "Musk's math reduced ChatGPT inventors' contributions to \"zero,\" OpenAI argued.",
          "content": "Elon Musk is going for some substantial damages in his lawsuit accusing OpenAI of abandoning its nonprofit mission and \"making a fool out of him\" as an early investor. On Friday, Musk filed a notice on remedies sought in the lawsuit, confirming that he's seeking damages between $79 billion and $134 billion from OpenAI and its largest backer, co-defendant Microsoft. Musk hired an expert he has never used before, C. Paul Wazzan, who reached this estimate by concluding that Musk's early contributions to OpenAI generated 50 to 75 percent of the nonprofit's current value. He got there by analyzing four factors: Musk's total financial contributions before he left OpenAI in 2018, Musk's proposed equity stake in OpenAI in 2017, Musk's current equity stake in xAI, and Musk's nonmonetary contributions to OpenAI (like investing time or lending his reputation).Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2087343447-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2087343447-1024x648.jpg",
      "popularity_score": 379.74430222222225
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Mon, 19 Jan 2026 17:16:38 +0000",
      "title": "Reports of ad-supported Xbox game streams show Microsoft's lack of imagination",
      "neutral_headline": "Reports of ad-supported Xbox game streams show Microsoft's lack of imagination",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/reports-of-ad-supported-xbox-game-streams-show-microsofts-lack-of-imagination/",
          "published_at": "Mon, 19 Jan 2026 17:16:38 +0000",
          "title": "Reports of ad-supported Xbox game streams show Microsoft's lack of imagination",
          "standfirst": "Xbox maker needs some fresher ideas for expanding access to cloud gaming.",
          "content": "Currently, Microsoft's long-running Cloud Gaming service is limited to players that have a Microsoft's Game Pass subscription. Now, new reporting suggests Microsoft is planning to offer non-subscribers access to game streams paid for by advertising in the near future, but only in extremely limited circumstances. The latest wave of rumors was set off late last week when The Verge's Tom Warren shared an Xbox Cloud Gaming loading screen with a message mentioning \"1 hour of ad supported playtime per session.\" That leaked message comes after Windows Central reported last summer that Microsoft has been \"exploring video ads for free games for quite some time,\" à la the two-minute sponsorships that appear before free-tier game streams on Nvidia's GeForce Now service. Don't get your hopes up for easy, free, ad-supported access to the entire Xbox Cloud Gaming library, though. Windows Central now reports that Microsoft will be using ads merely to slightly expand access to its \"Stream your own game\" program. That program currently offers subscribers to the Xbox Game Pass Essentials tier (or higher) the privilege of streaming versions of some of the Xbox games they've already purchased digitally. Windows Central's unnamed sources suggest a \"session-based ad-supported access tier\" to stream those purchased games will be offered to non-subscribers as soon as \"this year.\"Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/06/Cloud-Gaming_iPadSurfaceiPhone-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/06/Cloud-Gaming_iPadSurfaceiPhone-1152x648.jpg",
      "popularity_score": 342.94985777777777
    },
    {
      "id": "cluster_2",
      "coverage": 1,
      "updated_at": "Mon, 19 Jan 2026 18:24:49 +0000",
      "title": "Asus confirms its smartphone business is on indefinite hiatus",
      "neutral_headline": "Asus confirms its smartphone business is on indefinite hiatus",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/asus-confirms-its-smartphone-business-is-on-indefinite-hiatus/",
          "published_at": "Mon, 19 Jan 2026 18:24:49 +0000",
          "title": "Asus confirms its smartphone business is on indefinite hiatus",
          "standfirst": "Asus chairman Jonney Shih sees AI applications as the company's main focus going forward.",
          "content": "An unconfirmed report early this month suggested Asus was pulling back on its smartphone plans, but the company declined to comment at the time. Asus chairman Jonney Shih has now confirmed the wind-down of its smartphone business during an event in Taiwan. Instead, Asus will focus on AI products like robots and smart glasses. Shih addressed the company's future plans during a 2026 kick-off event in Taiwan, as reported by Inside. \"Asus will no longer add new mobile phone models in the future,\" said Shih (machine translated). So don't expect a new Zenfone or ROG Phone from Asus in 2026. That said, very few phone buyers were keeping tabs on the latest Asus phones anyway, which is probably why Asus is throwing in the towel. Shih isn't saying Asus won't ever release a new phone, but the company will take an \"indefinite wait-and-see\" approach. Again, this is a translation and could be interpreted in multiple ways.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ROG-2-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ROG-2-1-1152x648.jpg",
      "popularity_score": 342.0862466666667
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "Mon, 19 Jan 2026 17:06:28 +0000",
      "title": "The race to build a super-large ground telescope is likely down to two competitors",
      "neutral_headline": "The race to build a super-large ground telescope is likely down to two competitors",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/as-europes-large-ground-telescope-project-advances-how-is-its-us-competitor-faring/",
          "published_at": "Mon, 19 Jan 2026 17:06:28 +0000",
          "title": "The race to build a super-large ground telescope is likely down to two competitors",
          "standfirst": "Ars checks in with the new president of the Giant Magellan Telescope.",
          "content": "I have been writing about the Giant Magellan Telescope for a long time. Nearly two decades ago, for example, I wrote that time was \"running out\" in the race to build the next great optical telescope on the ground. At the time the proposed telescope was one of three contenders to make a giant leap in mirror size from the roughly 10-meter diameter instruments that existed then, to approximately 30 meters. This represented a huge increase in light-gathering potential, allowing astronomers to see much further into the universe—and therefore back into time—with far greater clarity. Since then the projects have advanced at various rates. An international consortium to build the Thirty Meter Telescope in Hawaii ran into local protests that have bogged down development. Its future came further into question when the US National Science Foundation dropped support for the project in favor of the Giant Magellan Telescope. Meanwhile the European Extremely Large Telescope (ELT) has advanced on a faster schedule, and this 39.5-meter telescope could observe its first light in 2029.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GMT-Rendering-IDOM-Enclosure-2024-1-scaled-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GMT-Rendering-IDOM-Enclosure-2024-1-scaled-1-1152x648.jpg",
      "popularity_score": 320.78041333333334
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Mon, 19 Jan 2026 12:00:45 +0000",
      "title": "10 things I learned from burning myself out with AI coding agents",
      "neutral_headline": "10 things I learned from burning myself out with AI coding agents",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/10-things-i-learned-from-burning-myself-out-with-ai-coding-agents/",
          "published_at": "Mon, 19 Jan 2026 12:00:45 +0000",
          "title": "10 things I learned from burning myself out with AI coding agents",
          "standfirst": "Opinion: As software power tools, AI agents may make people busier than ever before.",
          "content": "If you've ever used a 3D printer, you may recall the wondrous feeling when you first printed something you could have never sculpted or built yourself. Download a model file, load some plastic filament, push a button, and almost like magic, a three-dimensional object appears. But the result isn't polished and ready for mass production, and creating a novel shape requires more skills than just pushing a button. Interestingly, today's AI coding agents feel much the same way. Since November, I have used Claude Code and Claude Opus 4.5 through a personal Claude Max account to extensively experiment with AI-assisted software development (I have also used OpenAI's Codex in a similar way, though not as frequently). Fifty projects later, I'll be frank: I have not had this much fun with a computer since I learned BASIC on my Apple II Plus when I was 9 years old. This opinion comes not as an endorsement but as personal experience: I voluntarily undertook this project, and I paid out of pocket for both OpenAI and Anthropic's premium AI plans. Throughout my life, I have dabbled in programming as a utilitarian coder, writing small tools or scripts when needed. In my web development career, I wrote some small tools from scratch, but I primarily modified other people's code for my needs. Since 1990, I've programmed in BASIC, C, Visual Basic, PHP, ASP, Perl, Python, Ruby, MUSHcode, and some others. I am not an expert in any of these languages—I learned just enough to get the job done. I have developed my own hobby games over the years using BASIC, Torque Game Engine, and Godot, so I have some idea of what makes a good architecture for a modular program that can be expanded over time.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/super-programmer-hes-heating-up-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/super-programmer-hes-heating-up-1152x648.jpg",
      "popularity_score": 310.6851355555556
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Mon, 19 Jan 2026 16:00:27 +0000",
      "title": "Meet Veronika, the tool-using cow",
      "neutral_headline": "Meet Veronika, the tool-using cow",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/meet-veronika-the-tool-using-cow/",
          "published_at": "Mon, 19 Jan 2026 16:00:27 +0000",
          "title": "Meet Veronika, the tool-using cow",
          "standfirst": "Veronika uses sticks to scratch herself, suggesting scientists have underestimated cow cognition",
          "content": "Far Side fans might recall a classic 1982 cartoon called \"Cow Tools,\" featuring a cow standing next to a jumble of strange objects—the joke being that cows don't use tools. That's why a pet Swiss brown cow in Austria named Veronika has caused a bit of a sensation: she likes to pick up random sticks and use them to scratch herself. According to a new paper published in the journal Current Biology, this is a form of multipurpose tool use and suggests that the cognitive capabilities of cows have been underestimated by scientists. As previously reported, tool use was once thought to be one of the defining features of humans, but examples of it were eventually observed in primates and other mammals. Dolphins can toss objects as a form of play which some scientists consider to be a type of tool use, particularly when it involves another member of the same species. Potential purposes include a means of communication, social bonding, or aggressiveness. (Octopuses have also been observed engaging in similar throwing behavior.) But the biggest surprise came when birds were observed using tools in the wild. After all, birds are the only surviving dinosaurs, and mammals and dinosaurs hadn’t shared a common ancestor for hundreds of millions of years. In the wild, observed tool use has been limited to the corvids (crows and jays), which show a variety of other complex behaviors—they’ll remember your face and recognize the passing of their dead.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/cowtool1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/cowtool1-1152x648.jpg",
      "popularity_score": 306.6801355555556
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Sun, 18 Jan 2026 12:00:56 +0000",
      "title": "Ocean damage nearly doubles the cost of climate change",
      "neutral_headline": "Ocean damage nearly doubles the cost of climate change",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/ocean-damage-nearly-doubles-the-cost-of-climate-change/",
          "published_at": "Sun, 18 Jan 2026 12:00:56 +0000",
          "title": "Ocean damage nearly doubles the cost of climate change",
          "standfirst": "Ignoring the blue economy has left a multi-trillion-dollar blind spot in climate finance.",
          "content": "The global cost of greenhouse gas emissions is nearly double what scientists previously thought, according to a study published Thursday by researchers at the University of California, San Diego’s Scripps Institution of Oceanography. It is the first time a social cost of carbon (SCC) assessment—a key measure of economic harm caused by climate change—has included damages to the ocean. Global coral loss, fisheries disruption, and coastal infrastructure destruction are estimated to cost nearly $2 trillion annually, fundamentally changing how we measure climate finance. “For decades, we’ve been estimating the economic cost of climate change while effectively assigning a value of zero to the ocean,” said Bernardo Bastien-Olvera, who led the study during his postdoctoral fellowship at Scripps. “Ocean loss is not just an environmental issue, but a central part of the economic story of climate change.”Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2245161347-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2245161347-1152x648.jpg",
      "popularity_score": 281
    }
  ]
}