{
  "updated_at": "2026-01-12T11:20:58.946Z",
  "clusters": [
    {
      "id": "cluster_12",
      "coverage": 4,
      "updated_at": "Mon, 12 Jan 2026 04:10:01 -0500",
      "title": "Investigation: Google removed AI Overviews for two liver health queries after experts warned about inaccuracy, but slight tweaks still trigger AI responses (Andrew Gregory/The Guardian)",
      "neutral_headline": "Google pulls AI overviews for some medical searches",
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260112/p5#a260112p5",
          "published_at": "Mon, 12 Jan 2026 04:10:01 -0500",
          "title": "Investigation: Google removed AI Overviews for two liver health queries after experts warned about inaccuracy, but slight tweaks still trigger AI responses (Andrew Gregory/The Guardian)",
          "standfirst": "Andrew Gregory / The Guardian: Investigation: Google removed AI Overviews for two liver health queries after experts warned about inaccuracy, but slight tweaks still trigger AI responses &mdash; Exclusive: Guardian investigation finds AI Overviews provided inaccurate and false information when queried over blood tests",
          "content": "Andrew Gregory / The Guardian: Investigation: Google removed AI Overviews for two liver health queries after experts warned about inaccuracy, but slight tweaks still trigger AI responses &mdash; Exclusive: Guardian investigation finds AI Overviews provided inaccurate and false information when queried over blood tests",
          "feed_position": 5,
          "image_url": "http://www.techmeme.com/260112/i5.jpg"
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/860356/google-pulls-alarming-dangerous-medical-ai-overviews",
          "published_at": "2026-01-11T14:19:40-05:00",
          "title": "Google pulls AI overviews for some medical searches",
          "standfirst": "Earlier this month, The Guardian published an investigation that showed Google was serving up misleading and outright false information via its AI overviews in response to certain medical inquiries. Now those results appear to have been removed. According to the original report: In one case that experts described as \"really dangerous\", Google wrongly advised people [&#8230;]",
          "content": "Earlier this month, The Guardian published an investigation that showed Google was serving up misleading and outright false information via its AI overviews in response to certain medical inquiries. Now those results appear to have been removed. According to the original report: In one case that experts described as \"really dangerous\", Google wrongly advised people with pancreatic cancer to avoid high-fat foods. Experts said this was the exact opposite of what should be recommended, and may increase the risk of patients dying from the disease. In another \"alarming\" example, the company provided bogus information about crucial liver func … Read the full story at The Verge.",
          "feed_position": 2
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/11/google-removes-ai-overviews-for-certain-medical-queries/",
          "published_at": "Sun, 11 Jan 2026 17:56:41 +0000",
          "title": "Google removes AI Overviews for certain medical queries",
          "standfirst": "This follows an investigation by the Guardian that found Google AI Overviews offering misleading information in response to some health-related queries.",
          "content": "This follows an investigation by the Guardian that found Google AI Overviews offering misleading information in response to some health-related queries.",
          "feed_position": 5
        },
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2026/jan/11/google-ai-overviews-health-guardian-investigation",
          "published_at": "Sun, 11 Jan 2026 07:00:19 GMT",
          "title": "‘Dangerous and alarming’: Google removes some of its AI summaries after users’ health put at risk",
          "standfirst": "Exclusive: Guardian investigation finds AI Overviews provided inaccurate and false information when queried over blood testsGoogle has removed some of its artificial intelligence health summaries after a Guardian investigation found people were being put at risk of harm by false and misleading information.The company has said its AI Overviews, which use generative AI to provide snapshots of essential information about a topic or question, are “helpful” and “reliable”. Continue reading...",
          "content": "Exclusive: Guardian investigation finds AI Overviews provided inaccurate and false information when queried over blood testsGoogle has removed some of its artificial intelligence health summaries after a Guardian investigation found people were being put at risk of harm by false and misleading information.The company has said its AI Overviews, which use generative AI to provide snapshots of essential information about a topic or question, are “helpful” and “reliable”. Continue reading...",
          "feed_position": 2
        }
      ],
      "featured_image": "http://www.techmeme.com/260112/i5.jpg",
      "popularity_score": 4017.817237222222
    },
    {
      "id": "cluster_37",
      "coverage": 3,
      "updated_at": "Sun, 11 Jan 2026 18:07:09 +0000",
      "title": "Wing's drone deliveries are coming to 150 more Walmarts",
      "neutral_headline": "Wing's drone deliveries are coming to 150 more Walmarts",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/transportation/wings-drone-deliveries-are-coming-to-150-more-walmarts-180708189.html",
          "published_at": "Sun, 11 Jan 2026 18:07:09 +0000",
          "title": "Wing's drone deliveries are coming to 150 more Walmarts",
          "standfirst": "Don't be surprised if you see even more drones delivering groceries across the US since the Alphabet-owned Wing announced another service expansion with Walmart over the next year. The partnership said that drone delivery services will be available at 150 more Walmart locations in Los Angeles, St. Louis, Cincinnati, Miami and more metros that have yet to be announced. According to Wing, its top 25 percent of customers have ordered its delivery drones up to three times a week. To meet growing demand, Wing and Walmart said it will serve up to 40 million US customers and build up a network of 270 delivery locations by 2027. The partnership launched its service in August 2023 with the inaugural deliveries offered to the Dallas-Fort Worth customer base. In June 2025, Wing and Walmart increased drone delivery coverage to 100 more stores across Atlanta, Charlotte, Houston, Orlando and Tampa. Last month, the two companies launched their delivery service in Atlanta and are planning to kick off deliveries in Houston on January 15. Before Walmart, Wing broke into the US market by working with Walgreens to deliver health and wellness products in April 2022. Since then, the Alphabet subsidiary has partnered with DoorDash and Apian, a London-based healthcare logistics company. Besides its commercial partnerships, Wing has been working on a larger delivery drone that will be able to fly at up to 65 mph and carry up to five pounds, or double its current capacity.This article originally appeared on Engadget at https://www.engadget.com/transportation/wings-drone-deliveries-are-coming-to-150-more-walmarts-180708189.html?src=rss",
          "content": "Don't be surprised if you see even more drones delivering groceries across the US since the Alphabet-owned Wing announced another service expansion with Walmart over the next year. The partnership said that drone delivery services will be available at 150 more Walmart locations in Los Angeles, St. Louis, Cincinnati, Miami and more metros that have yet to be announced. According to Wing, its top 25 percent of customers have ordered its delivery drones up to three times a week. To meet growing demand, Wing and Walmart said it will serve up to 40 million US customers and build up a network of 270 delivery locations by 2027. The partnership launched its service in August 2023 with the inaugural deliveries offered to the Dallas-Fort Worth customer base. In June 2025, Wing and Walmart increased drone delivery coverage to 100 more stores across Atlanta, Charlotte, Houston, Orlando and Tampa. Last month, the two companies launched their delivery service in Atlanta and are planning to kick off deliveries in Houston on January 15. Before Walmart, Wing broke into the US market by working with Walgreens to deliver health and wellness products in April 2022. Since then, the Alphabet subsidiary has partnered with DoorDash and Apian, a London-based healthcare logistics company. Besides its commercial partnerships, Wing has been working on a larger delivery drone that will be able to fly at up to 65 mph and carry up to five pounds, or double its current capacity.This article originally appeared on Engadget at https://www.engadget.com/transportation/wings-drone-deliveries-are-coming-to-150-more-walmarts-180708189.html?src=rss",
          "feed_position": 3
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/859724/wing-walmart-drone-delivery-expansion-2027",
          "published_at": "2026-01-11T10:00:00-05:00",
          "title": "Wing’s drone delivery is coming to 150 more Walmarts",
          "standfirst": "Wing is bringing drone delivery to even more Walmart stores in 2026. The Alphabet-owned company announced today that its drones will be flying above 150 more locations this year, including in four new cities: Los Angeles, St. Louis, Miami, and Cincinnati. In June 2025, the companies said they would expand their delivery partnership to 100 [&#8230;]",
          "content": "Wing is bringing drone delivery to even more Walmart stores in 2026. The Alphabet-owned company announced today that its drones will be flying above 150 more locations this year, including in four new cities: Los Angeles, St. Louis, Miami, and Cincinnati. In June 2025, the companies said they would expand their delivery partnership to 100 additional stores in Atlanta, Charlotte, Houston, Orlando, and Tampa. So far, they've launched at several stores in Atlanta, in addition to Walmart locations in Dallas-Forth Worth and Arkansas. They currently operate at approximately 27 stores, and with today's announcement, the goal is to eventually esta … Read the full story at The Verge.",
          "feed_position": 7
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/11/wing-to-expand-drone-delivery-to-another-150-walmart-stores/",
          "published_at": "Sun, 11 Jan 2026 15:00:00 +0000",
          "title": "Wing to expand drone delivery to another 150 Walmart stores",
          "standfirst": "The partnership will grow Wing's drone delivery service to more than 270 Walmart stores by 2027.",
          "content": "The partnership will grow Wing's drone delivery service to more than 270 Walmart stores by 2027.",
          "feed_position": 8
        }
      ],
      "popularity_score": 3002.7694594444442
    },
    {
      "id": "cluster_7",
      "coverage": 2,
      "updated_at": "Mon, 12 Jan 2026 10:01:26 +0000",
      "title": "The best laptop power banks for 2026",
      "neutral_headline": "The best laptop power banks for 2026",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/accessories/best-laptop-power-bank-120040388.html",
          "published_at": "Mon, 12 Jan 2026 10:01:26 +0000",
          "title": "The best laptop power banks for 2026",
          "standfirst": "Laptop power banks come in handy if you often travel or work away from your desk. These larger batteries have enough capacity to refill your computer to around 75 percent, giving you many more productive hours. Of course, they can also charge smaller devices like your phone, camera or tablet a few times over. Nearly all portable laptop chargers fall below the 100-watt-hour mark so you can bring them in your carry-on when you fly. Additional features, like built-in cables and digital displays make these battery banks easier to use, too. We tested over a dozen options and put our thoughts below, so you can find the best laptop power bank for your next trip away from an outlet. Table of contents Best laptop power banks for 2026 What to look for in a laptop power bank How we test portable laptop chargers Other laptop power banks we tested Laptop power bank FAQs Recent updates Best laptop power banks for 2026 What to look for in a laptop power bank Flying with a laptop power bank Most portable batteries top out at around 27,000mAh so you can fly with them. The TSA currently limits the capacity carry-on batteries to 100Wh, which works out to around 27,500mAh for 3.6 volt lithium-ion batteries. Note that you’re not allowed to pack any batteries in your checked luggage, regardless of capacity. The TSA rules are intended to limit fire danger — and some airlines are implementing further restrictions due to recent on-board incidents. In March 2025, a Hong Kong flight was grounded after a battery pack caught fire in an overhead bin. A similar situation happened that same year in July on a domestic Delta flight, and again in August on a transatlantic KLM flight. As a result, some airlines, including Emirates, Southwest and others have announced further restrictions on flying with battery packs. Rules include limiting the number of allowed portable chargers and requiring flyers to keep power banks in clear view when using them to recharge a device. If the battery pack isn’t actively in use, however, most rules allow them to stay in your carry-on bag in the overhead bin. Before flying, it’s wise to check your airline’s policies. Capacity If you just need to keep a smartphone from dying before you can make it home, just about any of the best power banks will do. But if you need to revive multiple devices or the substantial battery of a laptop, you’ll want something with a high milliamp-hour​​ (mAh) capacity. A power bank capable of delivering enough power to a laptop will have a capacity between 20,000 and 27,000 mAh. If you want something even bigger than a laptop power bank, and don’t need to fly with it, you’ll likely want to look into portable power stations. These can be the size of a car battery or larger and can potentially fuel an entire weekend away. Another thing to keep in mind is that the capacity listed in a power bank's specs is not what will be delivered to your devices. As I mentioned, the capacity of these banks is around 25,000mAh. Even the huge battery on a 16-inch MacBook Pro or a Dell XPS 16 has a mAh rating of around 5,000 - 6,000mAh, so you might think you’d get five full charges but in reality, you only get about a single 70-percent charge. The voltage is different (typically 3.7V for the power bank and 11.4V for a laptop) which makes the watt-hours, or the amount of energy each battery can hold, different (working out to 92Wh for the battery and 72Wh for the built-in laptop batteries). On top of that, in order to feed a charge from a power bank to a laptop, a voltage conversion takes place and that dissipates a decent amount of energy. Without turning this into a physics lesson, this all means that a power bank with a 25,000mAh (or 92Wh) capacity will typically fill a 5,000mAh (or 72Wh) laptop battery to about 75 percent. In my tests, I averaged about a 60-percent efficiency rate between a power bank’s listed capacity and the actual charge delivered. Ports Every large power bank I’ve tested has at least three USB ports, with a mix of USB-C and USB-A, which should cover nearly any portable device you need to recharge — earbuds, phones, tablets, laptops, you name it. In addition to the different plug formats, some ports supply power at different wattages. For example, one built-in USB-C port might be rated for 60 watts, while the one next to it is rated for 100 watts. So if you’ve got a device that’s capable of 70W fast charging, such as the new MacBook Air, you’d want to opt for the 100W port to get the best charging speeds possible. Note that devices with a smaller wattage draw won’t be negatively affected by connecting to ports with high ratings. For example, a Galaxy S24 Ultra, capable of 45W super fast charging, is perfectly compatible with the 100W port. A device will only draw what it can take, regardless of what a port can supply. Just remember that the port, device and charging cable need to be at or above the desired wattage rating to achieve maximum charging rates. Some of these larger batteries also have AC ports. It might seem like a natural fit to plug in your laptop’s power adapter for a recharge. But really, the AC port should only be for devices that can’t use USB — such as a lamp or a printer. Plugging a power adapter into the AC port only wastes energy through conversion. First, the battery converts its DC power to supply the port with AC power, then the power adapter converts that AC power back to DC so your laptop can take it in. And as you’ll remember from physics class, each time energy is converted, some is lost to heat and other dissipations. Better to cut out the middleman and just send that DC power straight from the battery to the device. Also, you can use more than one port at a time with these devices; just remember that the speed of whatever you’re charging will likely go down, and of course, the battery is going to drain proportionally to what you’re refilling. Wireless charging Since I first started testing portable power banks a few years ago, wireless charging capabilities have noticeably improved. The first few I tried were painfully slow and not worth recommending. Now the wireless pads built into power banks are impressively fast — particularly, in my experience, when charging Samsung Galaxy phones (though the lack of a stabilizing magnetic connection like Apple’s MagSafe means they only work when rested flat on a pad). Most wireless charging connections can be used while other ports are also being employed, making them convenient for some mobile battlestation setups. Of course, wireless charging is always less efficient than wired, and recharging from an external battery is less efficient in general. If you want to waste as little energy as possible, you’re better off sticking to wired connections. Design All power banks are designed to be portable, but there’s a big difference between a pocket-friendly 5,000mAh battery and one of these laptop-compatible bruisers. Most of the latter weigh between a pound and a half to two pounds, which is a considerable addition to a backpack. Many of the options listed here have a display to tell you how much charge remains in the battery, which is helpful when you’re trying to judiciously meet out charges to your devices. If a bank has a wireless connection, the pad is usually on the flat top and any available AC connection is usually at one end. Both may require you to engage those charging methods. Don’t be like me and grumble loudly that you got a bum unit without pressing (and sometimes double pressing) all the buttons first. How we test portable laptop chargers For the past three years, I’ve been testing and using dozens of portable batteries for our other battery guide. Some of those batteries include the higher-capacity power banks you see here. I also got a hold of a few extra banks just for this guide to make sure we covered what’s available. I went for brands I’m already familiar with, as well as battery packs from well-received manufacturers I hadn’t tried before (like UGREEN and Lion Energy). I only considered banks with at least a 20,000mAh capacity and mostly stuck with those that rated 25,000mAh and higher. Here’s everything we tested: Zendure Supertank Pro Mophie Powerstation Pro XL Mophie Powerstation Pro AC Lion Energy Eclipse Mag Lion Energy Trek Baseus Blade Laptop Anker Prime 27,650mAh Goal Zero Sherpa 100 AC Anker Retractable Cable Laptop Bank HyperJuice 245W Anker Prime Power Bank (26K, 300W) UGreen Power Bank 25,000mAh 145W I tested each power bank with an Apple phone (iPhone 15 or 16), an Android phone (Galaxy S23 Ultra), a tablet (M1 iPad Air) and a laptop (16-inch MacBook Pro with the M1 Pro chip). Even though these banks can charge multiple devices at once, I refilled one at a time, to make side-by-side comparisons more straightforward. I drained the batteries of the phones and tablets to between zero and five percent and then didn’t use any device as it refilled. For the MacBook, I let it run down to 10 percent before plugging in the power bank. That's when most laptops give display a “connect to power” warning, as draining any battery to empty will compromise the battery life. I then used it as one might in a mobile office, with a Bluetooth keyboard and mouse, while connected to Wi-Fi and a VPN. For each test, I noted how long a completely charged battery took to get a device back to full and how much of the battery’s capacity was used up in one charge. I also noted things like portability, apparent durability, helpful features and overall design. For reference, here are the battery capacities of the devices I used: iPhone 15: 3,349mAh Galaxy S23 Ultra: 4,855mAh iPad Air (5th gen): 7,729mAh 16-inch M1 Pro MacBook Pro: 27,027mAh Other laptop power banks we tested HyperJuice 245W Hyper’s HyperJuice 245W brick looks great and has a hefty 27,000mAh capacity. The four USB-C ports can combine to output 245W of power and it got my MacBook Pro from nearly dead to 75 percent before depleting itself. When testing it with a Samsung Galaxy S23 Ultra, the handset got back up to a full charge in just over an hour. The screen tells you what each port is doing as well as displaying the amount of charge remaining in the pack itself. But the lack of port variety makes it feel less versatile than other picks on this list — the price is higher than our other options, too. Laptop power bank FAQs How do laptop power banks differ from phone power banks? The main difference is size. Phone power banks tend to have a capacity ranging from 5,000mAh to 20,000mAh and laptop powerbanks are typically rated between 20,000mAh and 27,000mAh. There’s no official definition, however. Laptop batteries are simply larger and need a bigger supply of power to give them a meaningful charge. How do you fast charge a power bank? You can charge a power bank exactly as fast as the power bank’s internal mechanisms will allow. Most batteries are limited in how quickly they can accept and deliver a charge to avoid dangerously overheating. But to make sure you’re charging a bank as quickly as possible, make sure the wall adapter and the USB-C cable you are using have a high wattage rating — using a 5W power brick and a 10W cable will take a lot longer to refill your bank than a 65W wall charger and a 100W cord. What size power bank do I need for a laptop? Look for a power bank with a rating of at least 20,000mAh. Slightly smaller batteries may work, but they won’t deliver a significant charge laptops. How many mAh to charge a laptop? A milliamp hour (mAh) is how much a battery can hold, and most portable batteries list their capacity using mAh. If you get a battery rated at 20,000mAh or above, it should be able to charge your laptop. Using mAh to discuss laptop batteries can be confusing. Due to differing voltages, you can’t directly compare the mAh ratings of a power bank battery to a laptop battery. Using watt-hours is a better gauge, as that calculation takes voltage into account. Recent updates November 2025: Updated our overall top pick to the Anker Laptop Power bank. Added a premium power bank pick. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-laptop-power-bank-120040388.html?src=rss",
          "content": "Laptop power banks come in handy if you often travel or work away from your desk. These larger batteries have enough capacity to refill your computer to around 75 percent, giving you many more productive hours. Of course, they can also charge smaller devices like your phone, camera or tablet a few times over. Nearly all portable laptop chargers fall below the 100-watt-hour mark so you can bring them in your carry-on when you fly. Additional features, like built-in cables and digital displays make these battery banks easier to use, too. We tested over a dozen options and put our thoughts below, so you can find the best laptop power bank for your next trip away from an outlet. Table of contents Best laptop power banks for 2026 What to look for in a laptop power bank How we test portable laptop chargers Other laptop power banks we tested Laptop power bank FAQs Recent updates Best laptop power banks for 2026 What to look for in a laptop power bank Flying with a laptop power bank Most portable batteries top out at around 27,000mAh so you can fly with them. The TSA currently limits the capacity carry-on batteries to 100Wh, which works out to around 27,500mAh for 3.6 volt lithium-ion batteries. Note that you’re not allowed to pack any batteries in your checked luggage, regardless of capacity. The TSA rules are intended to limit fire danger — and some airlines are implementing further restrictions due to recent on-board incidents. In March 2025, a Hong Kong flight was grounded after a battery pack caught fire in an overhead bin. A similar situation happened that same year in July on a domestic Delta flight, and again in August on a transatlantic KLM flight. As a result, some airlines, including Emirates, Southwest and others have announced further restrictions on flying with battery packs. Rules include limiting the number of allowed portable chargers and requiring flyers to keep power banks in clear view when using them to recharge a device. If the battery pack isn’t actively in use, however, most rules allow them to stay in your carry-on bag in the overhead bin. Before flying, it’s wise to check your airline’s policies. Capacity If you just need to keep a smartphone from dying before you can make it home, just about any of the best power banks will do. But if you need to revive multiple devices or the substantial battery of a laptop, you’ll want something with a high milliamp-hour​​ (mAh) capacity. A power bank capable of delivering enough power to a laptop will have a capacity between 20,000 and 27,000 mAh. If you want something even bigger than a laptop power bank, and don’t need to fly with it, you’ll likely want to look into portable power stations. These can be the size of a car battery or larger and can potentially fuel an entire weekend away. Another thing to keep in mind is that the capacity listed in a power bank's specs is not what will be delivered to your devices. As I mentioned, the capacity of these banks is around 25,000mAh. Even the huge battery on a 16-inch MacBook Pro or a Dell XPS 16 has a mAh rating of around 5,000 - 6,000mAh, so you might think you’d get five full charges but in reality, you only get about a single 70-percent charge. The voltage is different (typically 3.7V for the power bank and 11.4V for a laptop) which makes the watt-hours, or the amount of energy each battery can hold, different (working out to 92Wh for the battery and 72Wh for the built-in laptop batteries). On top of that, in order to feed a charge from a power bank to a laptop, a voltage conversion takes place and that dissipates a decent amount of energy. Without turning this into a physics lesson, this all means that a power bank with a 25,000mAh (or 92Wh) capacity will typically fill a 5,000mAh (or 72Wh) laptop battery to about 75 percent. In my tests, I averaged about a 60-percent efficiency rate between a power bank’s listed capacity and the actual charge delivered. Ports Every large power bank I’ve tested has at least three USB ports, with a mix of USB-C and USB-A, which should cover nearly any portable device you need to recharge — earbuds, phones, tablets, laptops, you name it. In addition to the different plug formats, some ports supply power at different wattages. For example, one built-in USB-C port might be rated for 60 watts, while the one next to it is rated for 100 watts. So if you’ve got a device that’s capable of 70W fast charging, such as the new MacBook Air, you’d want to opt for the 100W port to get the best charging speeds possible. Note that devices with a smaller wattage draw won’t be negatively affected by connecting to ports with high ratings. For example, a Galaxy S24 Ultra, capable of 45W super fast charging, is perfectly compatible with the 100W port. A device will only draw what it can take, regardless of what a port can supply. Just remember that the port, device and charging cable need to be at or above the desired wattage rating to achieve maximum charging rates. Some of these larger batteries also have AC ports. It might seem like a natural fit to plug in your laptop’s power adapter for a recharge. But really, the AC port should only be for devices that can’t use USB — such as a lamp or a printer. Plugging a power adapter into the AC port only wastes energy through conversion. First, the battery converts its DC power to supply the port with AC power, then the power adapter converts that AC power back to DC so your laptop can take it in. And as you’ll remember from physics class, each time energy is converted, some is lost to heat and other dissipations. Better to cut out the middleman and just send that DC power straight from the battery to the device. Also, you can use more than one port at a time with these devices; just remember that the speed of whatever you’re charging will likely go down, and of course, the battery is going to drain proportionally to what you’re refilling. Wireless charging Since I first started testing portable power banks a few years ago, wireless charging capabilities have noticeably improved. The first few I tried were painfully slow and not worth recommending. Now the wireless pads built into power banks are impressively fast — particularly, in my experience, when charging Samsung Galaxy phones (though the lack of a stabilizing magnetic connection like Apple’s MagSafe means they only work when rested flat on a pad). Most wireless charging connections can be used while other ports are also being employed, making them convenient for some mobile battlestation setups. Of course, wireless charging is always less efficient than wired, and recharging from an external battery is less efficient in general. If you want to waste as little energy as possible, you’re better off sticking to wired connections. Design All power banks are designed to be portable, but there’s a big difference between a pocket-friendly 5,000mAh battery and one of these laptop-compatible bruisers. Most of the latter weigh between a pound and a half to two pounds, which is a considerable addition to a backpack. Many of the options listed here have a display to tell you how much charge remains in the battery, which is helpful when you’re trying to judiciously meet out charges to your devices. If a bank has a wireless connection, the pad is usually on the flat top and any available AC connection is usually at one end. Both may require you to engage those charging methods. Don’t be like me and grumble loudly that you got a bum unit without pressing (and sometimes double pressing) all the buttons first. How we test portable laptop chargers For the past three years, I’ve been testing and using dozens of portable batteries for our other battery guide. Some of those batteries include the higher-capacity power banks you see here. I also got a hold of a few extra banks just for this guide to make sure we covered what’s available. I went for brands I’m already familiar with, as well as battery packs from well-received manufacturers I hadn’t tried before (like UGREEN and Lion Energy). I only considered banks with at least a 20,000mAh capacity and mostly stuck with those that rated 25,000mAh and higher. Here’s everything we tested: Zendure Supertank Pro Mophie Powerstation Pro XL Mophie Powerstation Pro AC Lion Energy Eclipse Mag Lion Energy Trek Baseus Blade Laptop Anker Prime 27,650mAh Goal Zero Sherpa 100 AC Anker Retractable Cable Laptop Bank HyperJuice 245W Anker Prime Power Bank (26K, 300W) UGreen Power Bank 25,000mAh 145W I tested each power bank with an Apple phone (iPhone 15 or 16), an Android phone (Galaxy S23 Ultra), a tablet (M1 iPad Air) and a laptop (16-inch MacBook Pro with the M1 Pro chip). Even though these banks can charge multiple devices at once, I refilled one at a time, to make side-by-side comparisons more straightforward. I drained the batteries of the phones and tablets to between zero and five percent and then didn’t use any device as it refilled. For the MacBook, I let it run down to 10 percent before plugging in the power bank. That's when most laptops give display a “connect to power” warning, as draining any battery to empty will compromise the battery life. I then used it as one might in a mobile office, with a Bluetooth keyboard and mouse, while connected to Wi-Fi and a VPN. For each test, I noted how long a completely charged battery took to get a device back to full and how much of the battery’s capacity was used up in one charge. I also noted things like portability, apparent durability, helpful features and overall design. For reference, here are the battery capacities of the devices I used: iPhone 15: 3,349mAh Galaxy S23 Ultra: 4,855mAh iPad Air (5th gen): 7,729mAh 16-inch M1 Pro MacBook Pro: 27,027mAh Other laptop power banks we tested HyperJuice 245W Hyper’s HyperJuice 245W brick looks great and has a hefty 27,000mAh capacity. The four USB-C ports can combine to output 245W of power and it got my MacBook Pro from nearly dead to 75 percent before depleting itself. When testing it with a Samsung Galaxy S23 Ultra, the handset got back up to a full charge in just over an hour. The screen tells you what each port is doing as well as displaying the amount of charge remaining in the pack itself. But the lack of port variety makes it feel less versatile than other picks on this list — the price is higher than our other options, too. Laptop power bank FAQs How do laptop power banks differ from phone power banks? The main difference is size. Phone power banks tend to have a capacity ranging from 5,000mAh to 20,000mAh and laptop powerbanks are typically rated between 20,000mAh and 27,000mAh. There’s no official definition, however. Laptop batteries are simply larger and need a bigger supply of power to give them a meaningful charge. How do you fast charge a power bank? You can charge a power bank exactly as fast as the power bank’s internal mechanisms will allow. Most batteries are limited in how quickly they can accept and deliver a charge to avoid dangerously overheating. But to make sure you’re charging a bank as quickly as possible, make sure the wall adapter and the USB-C cable you are using have a high wattage rating — using a 5W power brick and a 10W cable will take a lot longer to refill your bank than a 65W wall charger and a 100W cord. What size power bank do I need for a laptop? Look for a power bank with a rating of at least 20,000mAh. Slightly smaller batteries may work, but they won’t deliver a significant charge laptops. How many mAh to charge a laptop? A milliamp hour (mAh) is how much a battery can hold, and most portable batteries list their capacity using mAh. If you get a battery rated at 20,000mAh or above, it should be able to charge your laptop. Using mAh to discuss laptop batteries can be confusing. Due to differing voltages, you can’t directly compare the mAh ratings of a power bank battery to a laptop battery. Using watt-hours is a better gauge, as that calculation takes voltage into account. Recent updates November 2025: Updated our overall top pick to the Anker Laptop Power bank. Added a premium power bank pick. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-laptop-power-bank-120040388.html?src=rss",
          "feed_position": 0
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/orchestration/why-your-llm-bill-is-exploding-and-how-semantic-caching-can-cut-it-by-73",
          "published_at": "Sat, 10 Jan 2026 19:00:00 GMT",
          "title": "Why your LLM bill is exploding — and how semantic caching can cut it by 73%",
          "standfirst": "Our LLM API bill was growing 30% month-over-month. Traffic was increasing, but not that fast. When I analyzed our query logs, I found the real problem: Users ask the same questions in different ways.\"What&#x27;s your return policy?,\" \"How do I return something?\", and \"Can I get a refund?\" were all hitting our LLM separately, generating nearly identical responses, each incurring full API costs.Exact-match caching, the obvious first solution, captured only 18% of these redundant calls. The same semantic question, phrased differently, bypassed the cache entirely.So, I implemented semantic caching based on what queries mean, not how they&#x27;re worded. After implementing it, our cache hit rate increased to 67%, reducing LLM API costs by 73%. But getting there requires solving problems that naive implementations miss.Why exact-match caching falls shortTraditional caching uses query text as the cache key. This works when queries are identical:# Exact-match cachingcache_key = hash(query_text)if cache_key in cache: return cache[cache_key]But users don&#x27;t phrase questions identically. My analysis of 100,000 production queries found:Only 18% were exact duplicates of previous queries47% were semantically similar to previous queries (same intent, different wording)35% were genuinely novel queriesThat 47% represented massive cost savings we were missing. Each semantically-similar query triggered a full LLM call, generating a response nearly identical to one we&#x27;d already computed.Semantic caching architectureSemantic caching replaces text-based keys with embedding-based similarity lookup:class SemanticCache: def __init__(self, embedding_model, similarity_threshold=0.92): self.embedding_model = embedding_model self.threshold = similarity_threshold self.vector_store = VectorStore() # FAISS, Pinecone, etc. self.response_store = ResponseStore() # Redis, DynamoDB, etc. def get(self, query: str) -> Optional[str]: \"\"\"Return cached response if semantically similar query exists.\"\"\" query_embedding = self.embedding_model.encode(query) # Find most similar cached query matches = self.vector_store.search(query_embedding, top_k=1) if matches and matches[0].similarity >= self.threshold: cache_id = matches[0].id return self.response_store.get(cache_id) return None def set(self, query: str, response: str): \"\"\"Cache query-response pair.\"\"\" query_embedding = self.embedding_model.encode(query) cache_id = generate_id() self.vector_store.add(cache_id, query_embedding) self.response_store.set(cache_id, { &#x27;query&#x27;: query, &#x27;response&#x27;: response, &#x27;timestamp&#x27;: datetime.utcnow() })The key insight: Instead of hashing query text, I embed queries into vector space and find cached queries within a similarity threshold.The threshold problemThe similarity threshold is the critical parameter. Set it too high, and you miss valid cache hits. Set it too low, and you return wrong responses.Our initial threshold of 0.85 seemed reasonable; 85% similar should be \"the same question,\" right?Wrong. At 0.85, we got cache hits like:Query: \"How do I cancel my subscription?\"Cached: \"How do I cancel my order?\"Similarity: 0.87These are different questions with different answers. Returning the cached response would be incorrect.I discovered that optimal thresholds vary by query type:Query typeOptimal thresholdRationaleFAQ-style questions0.94High precision needed; wrong answers damage trustProduct searches0.88More tolerance for near-matchesSupport queries0.92Balance between coverage and accuracyTransactional queries0.97Very low tolerance for errorsI implemented query-type-specific thresholds:class AdaptiveSemanticCache: def __init__(self): self.thresholds = { &#x27;faq&#x27;: 0.94, &#x27;search&#x27;: 0.88, &#x27;support&#x27;: 0.92, &#x27;transactional&#x27;: 0.97, &#x27;default&#x27;: 0.92 } self.query_classifier = QueryClassifier() def get_threshold(self, query: str) -> float: query_type = self.query_classifier.classify(query) return self.thresholds.get(query_type, self.thresholds[&#x27;default&#x27;]) def get(self, query: str) -> Optional[str]: threshold = self.get_threshold(query) query_embedding = self.embedding_model.encode(query) matches = self.vector_store.search(query_embedding, top_k=1) if matches and matches[0].similarity >= threshold: return self.response_store.get(matches[0].id) return NoneThreshold tuning methodologyI couldn&#x27;t tune thresholds blindly. I needed ground truth on which query pairs were actually \"the same.\"Our methodology:Step 1: Sample query pairs. I sampled 5,000 query pairs at various similarity levels (0.80-0.99).Step 2: Human labeling. Annotators labeled each pair as \"same intent\" or \"different intent.\" I used three annotators per pair and took a majority vote.Step 3: Compute precision/recall curves. For each threshold, we computed:Precision: Of cache hits, what fraction had the same intent?Recall: Of same-intent pairs, what fraction did we cache-hit?def compute_precision_recall(pairs, labels, threshold): \"\"\"Compute precision and recall at given similarity threshold.\"\"\" predictions = [1 if pair.similarity >= threshold else 0 for pair in pairs] true_positives = sum(1 for p, l in zip(predictions, labels) if p == 1 and l == 1) false_positives = sum(1 for p, l in zip(predictions, labels) if p == 1 and l == 0) false_negatives = sum(1 for p, l in zip(predictions, labels) if p == 0 and l == 1) precision = true_positives / (true_positives + false_positives) if (true_positives + false_positives) > 0 else 0 recall = true_positives / (true_positives + false_negatives) if (true_positives + false_negatives) > 0 else 0 return precision, recallStep 4: Select threshold based on cost of errors. For FAQ queries where wrong answers damage trust, I optimized for precision (0.94 threshold gave 98% precision). For search queries where missing a cache hit just costs money, I optimized for recall (0.88 threshold).Latency overheadSemantic caching adds latency: You must embed the query and search the vector store before knowing whether to call the LLM.Our measurements:OperationLatency (p50)Latency (p99)Query embedding12ms28msVector search8ms19msTotal cache lookup20ms47msLLM API call850ms2400msThe 20ms overhead is negligible compared to the 850ms LLM call we avoid on cache hits. Even at p99, the 47ms overhead is acceptable.However, cache misses now take 20ms longer than before (embedding + search + LLM call). At our 67% hit rate, the math works out favorably:Before: 100% of queries × 850ms = 850ms averageAfter: (33% × 870ms) + (67% × 20ms) = 287ms + 13ms = 300ms averageNet latency improvement of 65% alongside the cost reduction.Cache invalidationCached responses go stale. Product information changes, policies update and yesterday&#x27;s correct answer becomes today&#x27;s wrong answer.I implemented three invalidation strategies:Time-based TTLSimple expiration based on content type:TTL_BY_CONTENT_TYPE = { &#x27;pricing&#x27;: timedelta(hours=4), # Changes frequently &#x27;policy&#x27;: timedelta(days=7), # Changes rarely &#x27;product_info&#x27;: timedelta(days=1), # Daily refresh &#x27;general_faq&#x27;: timedelta(days=14), # Very stable}Event-based invalidationWhen underlying data changes, invalidate related cache entries:class CacheInvalidator: def on_content_update(self, content_id: str, content_type: str): \"\"\"Invalidate cache entries related to updated content.\"\"\" # Find cached queries that referenced this content affected_queries = self.find_queries_referencing(content_id) for query_id in affected_queries: self.cache.invalidate(query_id) self.log_invalidation(content_id, len(affected_queries))Staleness detectionFor responses that might become stale without explicit events, I implemented periodic freshness checks:def check_freshness(self, cached_response: dict) -> bool: \"\"\"Verify cached response is still valid.\"\"\" # Re-run the query against current data fresh_response = self.generate_response(cached_response[&#x27;query&#x27;]) # Compare semantic similarity of responses cached_embedding = self.embed(cached_response[&#x27;response&#x27;]) fresh_embedding = self.embed(fresh_response) similarity = cosine_similarity(cached_embedding, fresh_embedding) # If responses diverged significantly, invalidate if similarity < 0.90: self.cache.invalidate(cached_response[&#x27;id&#x27;]) return False return TrueWe run freshness checks on a sample of cached entries daily, catching staleness that TTL and event-based invalidation miss.Production resultsAfter three months in production:MetricBeforeAfterChangeCache hit rate18%67%+272%LLM API costs$47K/month$12.7K/month-73%Average latency850ms300ms-65%False-positive rateN/A0.8%—Customer complaints (wrong answers)Baseline+0.3%Minimal increaseThe 0.8% false-positive rate (queries where we returned a cached response that was semantically incorrect) was within acceptable bounds. These cases occurred primarily at the boundaries of our threshold, where similarity was just above the cutoff but intent differed slightly.Pitfalls to avoidDon&#x27;t use a single global threshold. Different query types have different tolerance for errors. Tune thresholds per category.Don&#x27;t skip the embedding step on cache hits. You might be tempted to skip embedding overhead when returning cached responses, but you need the embedding for cache key generation. The overhead is unavoidable.Don&#x27;t forget invalidation. Semantic caching without invalidation strategy leads to stale responses that erode user trust. Build invalidation from day one.Don&#x27;t cache everything. Some queries shouldn&#x27;t be cached: Personalized responses, time-sensitive information, transactional confirmations. Build exclusion rules.def should_cache(self, query: str, response: str) -> bool: \"\"\"Determine if response should be cached.\"\" # Don&#x27;t cache personalized responses if self.contains_personal_info(response): return False # Don&#x27;t cache time-sensitive information if self.is_time_sensitive(query): return False # Don&#x27;t cache transactional confirmations if self.is_transactional(query): return False return TrueKey takeawaysSemantic caching is a practical pattern for LLM cost control that captures redundancy exact-match caching misses. The key challenges are threshold tuning (use query-type-specific thresholds based on precision/recall analysis) and cache invalidation (combine TTL, event-based and staleness detection).At 73% cost reduction, this was our highest-ROI optimization for production LLM systems. The implementation complexity is moderate, but the threshold tuning requires careful attention to avoid quality degradation.Sreenivasa Reddy Hulebeedu Reddy is a lead software engineer.",
          "content": "Our LLM API bill was growing 30% month-over-month. Traffic was increasing, but not that fast. When I analyzed our query logs, I found the real problem: Users ask the same questions in different ways.\"What&#x27;s your return policy?,\" \"How do I return something?\", and \"Can I get a refund?\" were all hitting our LLM separately, generating nearly identical responses, each incurring full API costs.Exact-match caching, the obvious first solution, captured only 18% of these redundant calls. The same semantic question, phrased differently, bypassed the cache entirely.So, I implemented semantic caching based on what queries mean, not how they&#x27;re worded. After implementing it, our cache hit rate increased to 67%, reducing LLM API costs by 73%. But getting there requires solving problems that naive implementations miss.Why exact-match caching falls shortTraditional caching uses query text as the cache key. This works when queries are identical:# Exact-match cachingcache_key = hash(query_text)if cache_key in cache: return cache[cache_key]But users don&#x27;t phrase questions identically. My analysis of 100,000 production queries found:Only 18% were exact duplicates of previous queries47% were semantically similar to previous queries (same intent, different wording)35% were genuinely novel queriesThat 47% represented massive cost savings we were missing. Each semantically-similar query triggered a full LLM call, generating a response nearly identical to one we&#x27;d already computed.Semantic caching architectureSemantic caching replaces text-based keys with embedding-based similarity lookup:class SemanticCache: def __init__(self, embedding_model, similarity_threshold=0.92): self.embedding_model = embedding_model self.threshold = similarity_threshold self.vector_store = VectorStore() # FAISS, Pinecone, etc. self.response_store = ResponseStore() # Redis, DynamoDB, etc. def get(self, query: str) -> Optional[str]: \"\"\"Return cached response if semantically similar query exists.\"\"\" query_embedding = self.embedding_model.encode(query) # Find most similar cached query matches = self.vector_store.search(query_embedding, top_k=1) if matches and matches[0].similarity >= self.threshold: cache_id = matches[0].id return self.response_store.get(cache_id) return None def set(self, query: str, response: str): \"\"\"Cache query-response pair.\"\"\" query_embedding = self.embedding_model.encode(query) cache_id = generate_id() self.vector_store.add(cache_id, query_embedding) self.response_store.set(cache_id, { &#x27;query&#x27;: query, &#x27;response&#x27;: response, &#x27;timestamp&#x27;: datetime.utcnow() })The key insight: Instead of hashing query text, I embed queries into vector space and find cached queries within a similarity threshold.The threshold problemThe similarity threshold is the critical parameter. Set it too high, and you miss valid cache hits. Set it too low, and you return wrong responses.Our initial threshold of 0.85 seemed reasonable; 85% similar should be \"the same question,\" right?Wrong. At 0.85, we got cache hits like:Query: \"How do I cancel my subscription?\"Cached: \"How do I cancel my order?\"Similarity: 0.87These are different questions with different answers. Returning the cached response would be incorrect.I discovered that optimal thresholds vary by query type:Query typeOptimal thresholdRationaleFAQ-style questions0.94High precision needed; wrong answers damage trustProduct searches0.88More tolerance for near-matchesSupport queries0.92Balance between coverage and accuracyTransactional queries0.97Very low tolerance for errorsI implemented query-type-specific thresholds:class AdaptiveSemanticCache: def __init__(self): self.thresholds = { &#x27;faq&#x27;: 0.94, &#x27;search&#x27;: 0.88, &#x27;support&#x27;: 0.92, &#x27;transactional&#x27;: 0.97, &#x27;default&#x27;: 0.92 } self.query_classifier = QueryClassifier() def get_threshold(self, query: str) -> float: query_type = self.query_classifier.classify(query) return self.thresholds.get(query_type, self.thresholds[&#x27;default&#x27;]) def get(self, query: str) -> Optional[str]: threshold = self.get_threshold(query) query_embedding = self.embedding_model.encode(query) matches = self.vector_store.search(query_embedding, top_k=1) if matches and matches[0].similarity >= threshold: return self.response_store.get(matches[0].id) return NoneThreshold tuning methodologyI couldn&#x27;t tune thresholds blindly. I needed ground truth on which query pairs were actually \"the same.\"Our methodology:Step 1: Sample query pairs. I sampled 5,000 query pairs at various similarity levels (0.80-0.99).Step 2: Human labeling. Annotators labeled each pair as \"same intent\" or \"different intent.\" I used three annotators per pair and took a majority vote.Step 3: Compute precision/recall curves. For each threshold, we computed:Precision: Of cache hits, what fraction had the same intent?Recall: Of same-intent pairs, what fraction did we cache-hit?def compute_precision_recall(pairs, labels, threshold): \"\"\"Compute precision and recall at given similarity threshold.\"\"\" predictions = [1 if pair.similarity >= threshold else 0 for pair in pairs] true_positives = sum(1 for p, l in zip(predictions, labels) if p == 1 and l == 1) false_positives = sum(1 for p, l in zip(predictions, labels) if p == 1 and l == 0) false_negatives = sum(1 for p, l in zip(predictions, labels) if p == 0 and l == 1) precision = true_positives / (true_positives + false_positives) if (true_positives + false_positives) > 0 else 0 recall = true_positives / (true_positives + false_negatives) if (true_positives + false_negatives) > 0 else 0 return precision, recallStep 4: Select threshold based on cost of errors. For FAQ queries where wrong answers damage trust, I optimized for precision (0.94 threshold gave 98% precision). For search queries where missing a cache hit just costs money, I optimized for recall (0.88 threshold).Latency overheadSemantic caching adds latency: You must embed the query and search the vector store before knowing whether to call the LLM.Our measurements:OperationLatency (p50)Latency (p99)Query embedding12ms28msVector search8ms19msTotal cache lookup20ms47msLLM API call850ms2400msThe 20ms overhead is negligible compared to the 850ms LLM call we avoid on cache hits. Even at p99, the 47ms overhead is acceptable.However, cache misses now take 20ms longer than before (embedding + search + LLM call). At our 67% hit rate, the math works out favorably:Before: 100% of queries × 850ms = 850ms averageAfter: (33% × 870ms) + (67% × 20ms) = 287ms + 13ms = 300ms averageNet latency improvement of 65% alongside the cost reduction.Cache invalidationCached responses go stale. Product information changes, policies update and yesterday&#x27;s correct answer becomes today&#x27;s wrong answer.I implemented three invalidation strategies:Time-based TTLSimple expiration based on content type:TTL_BY_CONTENT_TYPE = { &#x27;pricing&#x27;: timedelta(hours=4), # Changes frequently &#x27;policy&#x27;: timedelta(days=7), # Changes rarely &#x27;product_info&#x27;: timedelta(days=1), # Daily refresh &#x27;general_faq&#x27;: timedelta(days=14), # Very stable}Event-based invalidationWhen underlying data changes, invalidate related cache entries:class CacheInvalidator: def on_content_update(self, content_id: str, content_type: str): \"\"\"Invalidate cache entries related to updated content.\"\"\" # Find cached queries that referenced this content affected_queries = self.find_queries_referencing(content_id) for query_id in affected_queries: self.cache.invalidate(query_id) self.log_invalidation(content_id, len(affected_queries))Staleness detectionFor responses that might become stale without explicit events, I implemented periodic freshness checks:def check_freshness(self, cached_response: dict) -> bool: \"\"\"Verify cached response is still valid.\"\"\" # Re-run the query against current data fresh_response = self.generate_response(cached_response[&#x27;query&#x27;]) # Compare semantic similarity of responses cached_embedding = self.embed(cached_response[&#x27;response&#x27;]) fresh_embedding = self.embed(fresh_response) similarity = cosine_similarity(cached_embedding, fresh_embedding) # If responses diverged significantly, invalidate if similarity < 0.90: self.cache.invalidate(cached_response[&#x27;id&#x27;]) return False return TrueWe run freshness checks on a sample of cached entries daily, catching staleness that TTL and event-based invalidation miss.Production resultsAfter three months in production:MetricBeforeAfterChangeCache hit rate18%67%+272%LLM API costs$47K/month$12.7K/month-73%Average latency850ms300ms-65%False-positive rateN/A0.8%—Customer complaints (wrong answers)Baseline+0.3%Minimal increaseThe 0.8% false-positive rate (queries where we returned a cached response that was semantically incorrect) was within acceptable bounds. These cases occurred primarily at the boundaries of our threshold, where similarity was just above the cutoff but intent differed slightly.Pitfalls to avoidDon&#x27;t use a single global threshold. Different query types have different tolerance for errors. Tune thresholds per category.Don&#x27;t skip the embedding step on cache hits. You might be tempted to skip embedding overhead when returning cached responses, but you need the embedding for cache key generation. The overhead is unavoidable.Don&#x27;t forget invalidation. Semantic caching without invalidation strategy leads to stale responses that erode user trust. Build invalidation from day one.Don&#x27;t cache everything. Some queries shouldn&#x27;t be cached: Personalized responses, time-sensitive information, transactional confirmations. Build exclusion rules.def should_cache(self, query: str, response: str) -> bool: \"\"\"Determine if response should be cached.\"\" # Don&#x27;t cache personalized responses if self.contains_personal_info(response): return False # Don&#x27;t cache time-sensitive information if self.is_time_sensitive(query): return False # Don&#x27;t cache transactional confirmations if self.is_transactional(query): return False return TrueKey takeawaysSemantic caching is a practical pattern for LLM cost control that captures redundancy exact-match caching misses. The key challenges are threshold tuning (use query-type-specific thresholds based on precision/recall analysis) and cache invalidation (combine TTL, event-based and staleness detection).At 73% cost reduction, this was our highest-ROI optimization for production LLM systems. The implementation complexity is moderate, but the threshold tuning requires careful attention to avoid quality degradation.Sreenivasa Reddy Hulebeedu Reddy is a lead software engineer.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/7iyQoeSwdOqqpfcE0PFWgF/48db7d0305019eee107028d9f018d2ac/Semantic_caching.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/wearables/the-ces-companies-hoping-your-brain-is-the-next-big-thing-in-computing-175048601.html",
          "published_at": "Sat, 10 Jan 2026 17:50:48 +0000",
          "title": "The CES companies hoping your brain is the next big thing in computing",
          "standfirst": "At every CES I’ve ever been to, there’s been one or two gadgets promising to boost your mental health. In recent years, the number of companies making forays into this space has grown, and will likely continue to do so in the future. Could it be, much like the number of people wearing heart-monitoring wearables today, everyone will be strapping an EEG to their skulls a decade or so down the line? It’s more likely than you think, so it’s worth asking what these devices are good for, what benefit they could bring, and where does the science end and the hype begin.An Electroencephalogram (EEG) is a clinical tool to monitor the electrical activity of our brains. Put very simply, our minds are constantly moving ions around, and when they reach the scalp, it’s possible to measure those ions. By placing electrodes on the scalp, you can record the changes in voltages pushed out by our brains more or less in real time. These voltages are commonly grouped into categories, which are often described as brain waves. Each one represents a different state of mind: Gamma (hard thinking), Beta (anxious or active), Alpha (relaxed), Theta (creative, or dreaming) and Delta (asleep). Professor Karl Friston at University College London is one of the world’s most influential neuroscientists and an expert in brain imaging. He explained that these technologies can be used to diagnose issues both in the structure and function of the brain. And while there are many technologies which can look at how our brains work, “we’re a long way away from understanding the brain like we understand the heart.” Broadly speaking, EEGs are a fairly simple tool for looking at how our minds work, but they have one benefit over more complex methods such as fMRI (functional Magnetic Resonance Imaging), since they work in real time.Consumer-use EEGs are nothing new — in 2011 I tested the Zeo Mobile, a small device which you stuck to your forehead and wore overnight. It monitored how well you slept and sounded an alarm when you were at the top of a sleep cycle, so you woke up pretty easily. It worked well but with one downside: It’s hard to sleep with a hard plastic puck stuck to your forehead.EEGs are more recently used as part of brain computer interfaces, or for neurofeedback tools to help you calibrate the quality of your meditation. InteraXon, for instance, makes the Muse headbands which will monitor your brain waves, telling you when you shift states. Last year, EEG startup Neurable partnered with Master & Dynamic to launch the MW75S Neuro, a pair of high-end headphones designed to track your focus levels. When your attention starts to wane, the system will alert you, advising you to take a rest with the hope of alleviating burnout.NeurableDaniel Cooper for EngadgetAt CES this year, Neurable announced a partnership with HP’s gaming arm HyperX to produce EEG headsets with specific benefits for gamers. As gamers are looking for any way to improve their performance, the company has developed algorithms and training programs to help. You might already know that being in a place of high stress isn’t great for your concentration and focus. Consequently, Neurable research scientist Dr. Alicia Howell-Munson walked me through a system that encourages you to reach a state of calm focus with demonstrable improvements in reaction time and accuracy. It’s a system that was initially designed in partnership with Singapore’s Air Force to help ensure pilots remain in a state of calm focus. I sat through this demo myself, initially testing my skills in Aimlabs (a tool people use to test their reflexes) where my accuracy and reaction times were measured. Then, while wearing Neurable’s headset, I had to practice focusing my attention on a galaxy of dots, the greater my focus, the slower and closer together the dots got. That wasn’t an easy process, and it took me nearly five minutes to reach the point where I could push all of the dots to coalesce into a single point on the screen. But, when I had, I retook the shooting gallery, and saw dramatic spikes in my performance. My accuracy increased from 91.3 to 99.1 percent, while my reaction time fell from 623ms to 532ms. Neurable HyperX headsetDaniel Cooper for EngadgetNeurable believes that its systems, which are designed to integrate with any manufacturer’s gear, has the potential to dramatically increase a person’s brain health and productivity. For instance, by taking a break when a person’s focus started to wane, they were able to bounce back and function for far longer than if they’d simply pushed harder. Similarly, the company can advise on your cognitive speed and brain age and guide you toward making healthy choices. The company says that this isn’t just about wellness, either, as being able to identify loss of focus is vital, for instance, to help reduce auto accidents when truck drivers feel fatigued. Co-founder Adam Molnar explained that the benefits of this technology compound over time, so the more practice a user has in finding that mental state of calm focus, the easier it will be to maintain it for longer. CEO Ramses Alcaide added the company’s aim is to enable people to visualize the often invisible symptoms of cognitive stress to ensure they’re looking after themselves. He added that one thing that separates Neurable from other companies is that it’s looking at far finer-grain detail from its EEG data. MyWavesDaniel Cooper for EngadgetThere are plenty of companies at CES that are using EEGs for more specific goals, such as MyWaves. It uses an EEG as part of its broader offering to use sound patterns to make it easier to go to sleep. It sells you a pricey forehead-worn EEG which you wear for a few nights over the course of a year. From there, the system produces a half hour audio file that will mirror the pattern of your delta brainwaves. It claims that, if you listen to the track before you go to bed, the experience of hearing your delta waves will help you fall asleep faster and experience more REM sleep.And there are plenty of companies which are building EEGs for you to wear to keep an eye on your mental health. Brain-Life, for instance, showed off an early prototype of Focus+, a headband EEG with a companion app that can offer feedback on your cognitive load. It can also tell you how long you can sustain your attention and how well your mind relaxes and recovers. The company didn’t have details on when the hardware would be available or how much it cost, as it’s still early days.BrainEULink.Daniel Cooper for EngadgetThere is broad potential to use an EEG as a brain computer interface, such as the one worked on by Braineulink. That company has combined an EEG with an AR headset to enable people to interact with the world just with their brains. For instance, in a demonstration in the show floor at CES, I was able to turn a light on and off by “focusing” on it, although it’s hard to know how useful that would be in, for instance, creating an assistive device for folks with limited mobility. Like Brain-Life, it’s early days, and so there’s no product that we can point to, but it’s clear we’re going to see more startups looking to enter this world. Brain-LifeDaniel Cooper for EngadgetAs EEGs become more commonplace, it’s likely they’ll be packaged in smaller devices which fit more seamlessly into our lives. One such example is NAOX, a French startup which has built a wearable, clinical-grade EEG into a pair of earbuds for the sort of longitudinal testing required to diagnose conditions like epilepsy. But the company is also planning on incorporating the technology into a pair of true wireless earbuds.These headphones won’t be arriving until the end of 2026, but Naox says the tech is small enough that it can be integrated with other companies earbuds. Consequently, it’s certainly plausible we could see plenty of earbuds that will keep an eye on our brain health as a side hustle. NaoxDaniel Cooper for EngadgetNAOX was co-founded by Dr. Michel Le Van Quyen who, at a talk in London in December 2025, talked about the rationale for creating an in-ear ECG. Essentially, he was looking to build a brain equivalent to the Apple Watch’s continuous heart rate monitoring (and ECG). I was curious about the science behind an ear-mounted EEG given they commonly use the scalp. Professor Friston said that an ear-mounted EEG is potentially more useful as “you can get slightly closer to the sources of activity.” And that it makes a lot of sense for a consumer-grade EEG to be added to wireless earbuds given their utility in practices like meditation.Naox's prototype TWS earbuds sensors.Daniel Cooper for EngadgetOne downside of the proliferation of wearable EEGs is that it could lead users to jump to the wrong conclusions about their mental health. For instance, if someone is to be diagnosed with a condition such as epilepsy, they need to undergo a 24-hour perambulatory EEG. As Professor Friston explained, the recording of that 24 hour EEG would be “carefully scrutinized by experts who are able to run a differential diagnosis ... to specify what further investigations are required.” He, like a lot of clinicians, is concerned about ill-informed consumers using these devices to make medical interventions without consulting a professional. Friston added that people shouldn’t expect wearable EEGs to be magic bullets for their brain health or cognition. He said the best way for a consumer to approach them is by treating them with the same level of reverence as a household thermometer. “Are thermometers useful in managing the wellness of my children?, Yes,” he explained, “can your thermometer tell you what particular virus you have? Absolutely not.” “In the context of well-being and to augment or validate practices such as mindfulness and meditation, they can be fun and useful quantitative devices.” But, fundamentally, that is all he feels they can be, especially right now.This article originally appeared on Engadget at https://www.engadget.com/wearables/the-ces-companies-hoping-your-brain-is-the-next-big-thing-in-computing-175048601.html?src=rss",
          "content": "At every CES I’ve ever been to, there’s been one or two gadgets promising to boost your mental health. In recent years, the number of companies making forays into this space has grown, and will likely continue to do so in the future. Could it be, much like the number of people wearing heart-monitoring wearables today, everyone will be strapping an EEG to their skulls a decade or so down the line? It’s more likely than you think, so it’s worth asking what these devices are good for, what benefit they could bring, and where does the science end and the hype begin.An Electroencephalogram (EEG) is a clinical tool to monitor the electrical activity of our brains. Put very simply, our minds are constantly moving ions around, and when they reach the scalp, it’s possible to measure those ions. By placing electrodes on the scalp, you can record the changes in voltages pushed out by our brains more or less in real time. These voltages are commonly grouped into categories, which are often described as brain waves. Each one represents a different state of mind: Gamma (hard thinking), Beta (anxious or active), Alpha (relaxed), Theta (creative, or dreaming) and Delta (asleep). Professor Karl Friston at University College London is one of the world’s most influential neuroscientists and an expert in brain imaging. He explained that these technologies can be used to diagnose issues both in the structure and function of the brain. And while there are many technologies which can look at how our brains work, “we’re a long way away from understanding the brain like we understand the heart.” Broadly speaking, EEGs are a fairly simple tool for looking at how our minds work, but they have one benefit over more complex methods such as fMRI (functional Magnetic Resonance Imaging), since they work in real time.Consumer-use EEGs are nothing new — in 2011 I tested the Zeo Mobile, a small device which you stuck to your forehead and wore overnight. It monitored how well you slept and sounded an alarm when you were at the top of a sleep cycle, so you woke up pretty easily. It worked well but with one downside: It’s hard to sleep with a hard plastic puck stuck to your forehead.EEGs are more recently used as part of brain computer interfaces, or for neurofeedback tools to help you calibrate the quality of your meditation. InteraXon, for instance, makes the Muse headbands which will monitor your brain waves, telling you when you shift states. Last year, EEG startup Neurable partnered with Master & Dynamic to launch the MW75S Neuro, a pair of high-end headphones designed to track your focus levels. When your attention starts to wane, the system will alert you, advising you to take a rest with the hope of alleviating burnout.NeurableDaniel Cooper for EngadgetAt CES this year, Neurable announced a partnership with HP’s gaming arm HyperX to produce EEG headsets with specific benefits for gamers. As gamers are looking for any way to improve their performance, the company has developed algorithms and training programs to help. You might already know that being in a place of high stress isn’t great for your concentration and focus. Consequently, Neurable research scientist Dr. Alicia Howell-Munson walked me through a system that encourages you to reach a state of calm focus with demonstrable improvements in reaction time and accuracy. It’s a system that was initially designed in partnership with Singapore’s Air Force to help ensure pilots remain in a state of calm focus. I sat through this demo myself, initially testing my skills in Aimlabs (a tool people use to test their reflexes) where my accuracy and reaction times were measured. Then, while wearing Neurable’s headset, I had to practice focusing my attention on a galaxy of dots, the greater my focus, the slower and closer together the dots got. That wasn’t an easy process, and it took me nearly five minutes to reach the point where I could push all of the dots to coalesce into a single point on the screen. But, when I had, I retook the shooting gallery, and saw dramatic spikes in my performance. My accuracy increased from 91.3 to 99.1 percent, while my reaction time fell from 623ms to 532ms. Neurable HyperX headsetDaniel Cooper for EngadgetNeurable believes that its systems, which are designed to integrate with any manufacturer’s gear, has the potential to dramatically increase a person’s brain health and productivity. For instance, by taking a break when a person’s focus started to wane, they were able to bounce back and function for far longer than if they’d simply pushed harder. Similarly, the company can advise on your cognitive speed and brain age and guide you toward making healthy choices. The company says that this isn’t just about wellness, either, as being able to identify loss of focus is vital, for instance, to help reduce auto accidents when truck drivers feel fatigued. Co-founder Adam Molnar explained that the benefits of this technology compound over time, so the more practice a user has in finding that mental state of calm focus, the easier it will be to maintain it for longer. CEO Ramses Alcaide added the company’s aim is to enable people to visualize the often invisible symptoms of cognitive stress to ensure they’re looking after themselves. He added that one thing that separates Neurable from other companies is that it’s looking at far finer-grain detail from its EEG data. MyWavesDaniel Cooper for EngadgetThere are plenty of companies at CES that are using EEGs for more specific goals, such as MyWaves. It uses an EEG as part of its broader offering to use sound patterns to make it easier to go to sleep. It sells you a pricey forehead-worn EEG which you wear for a few nights over the course of a year. From there, the system produces a half hour audio file that will mirror the pattern of your delta brainwaves. It claims that, if you listen to the track before you go to bed, the experience of hearing your delta waves will help you fall asleep faster and experience more REM sleep.And there are plenty of companies which are building EEGs for you to wear to keep an eye on your mental health. Brain-Life, for instance, showed off an early prototype of Focus+, a headband EEG with a companion app that can offer feedback on your cognitive load. It can also tell you how long you can sustain your attention and how well your mind relaxes and recovers. The company didn’t have details on when the hardware would be available or how much it cost, as it’s still early days.BrainEULink.Daniel Cooper for EngadgetThere is broad potential to use an EEG as a brain computer interface, such as the one worked on by Braineulink. That company has combined an EEG with an AR headset to enable people to interact with the world just with their brains. For instance, in a demonstration in the show floor at CES, I was able to turn a light on and off by “focusing” on it, although it’s hard to know how useful that would be in, for instance, creating an assistive device for folks with limited mobility. Like Brain-Life, it’s early days, and so there’s no product that we can point to, but it’s clear we’re going to see more startups looking to enter this world. Brain-LifeDaniel Cooper for EngadgetAs EEGs become more commonplace, it’s likely they’ll be packaged in smaller devices which fit more seamlessly into our lives. One such example is NAOX, a French startup which has built a wearable, clinical-grade EEG into a pair of earbuds for the sort of longitudinal testing required to diagnose conditions like epilepsy. But the company is also planning on incorporating the technology into a pair of true wireless earbuds.These headphones won’t be arriving until the end of 2026, but Naox says the tech is small enough that it can be integrated with other companies earbuds. Consequently, it’s certainly plausible we could see plenty of earbuds that will keep an eye on our brain health as a side hustle. NaoxDaniel Cooper for EngadgetNAOX was co-founded by Dr. Michel Le Van Quyen who, at a talk in London in December 2025, talked about the rationale for creating an in-ear ECG. Essentially, he was looking to build a brain equivalent to the Apple Watch’s continuous heart rate monitoring (and ECG). I was curious about the science behind an ear-mounted EEG given they commonly use the scalp. Professor Friston said that an ear-mounted EEG is potentially more useful as “you can get slightly closer to the sources of activity.” And that it makes a lot of sense for a consumer-grade EEG to be added to wireless earbuds given their utility in practices like meditation.Naox's prototype TWS earbuds sensors.Daniel Cooper for EngadgetOne downside of the proliferation of wearable EEGs is that it could lead users to jump to the wrong conclusions about their mental health. For instance, if someone is to be diagnosed with a condition such as epilepsy, they need to undergo a 24-hour perambulatory EEG. As Professor Friston explained, the recording of that 24 hour EEG would be “carefully scrutinized by experts who are able to run a differential diagnosis ... to specify what further investigations are required.” He, like a lot of clinicians, is concerned about ill-informed consumers using these devices to make medical interventions without consulting a professional. Friston added that people shouldn’t expect wearable EEGs to be magic bullets for their brain health or cognition. He said the best way for a consumer to approach them is by treating them with the same level of reverence as a household thermometer. “Are thermometers useful in managing the wellness of my children?, Yes,” he explained, “can your thermometer tell you what particular virus you have? Absolutely not.” “In the context of well-being and to augment or validate practices such as mindfulness and meditation, they can be fun and useful quantitative devices.” But, fundamentally, that is all he feels they can be, especially right now.This article originally appeared on Engadget at https://www.engadget.com/wearables/the-ces-companies-hoping-your-brain-is-the-next-big-thing-in-computing-175048601.html?src=rss",
          "feed_position": 9,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/eeg-neurablemeditation.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/the-robots-we-saw-at-ces-2026-the-lovable-the-creepy-and-the-utterly-confusing-153537930.html",
          "published_at": "Sat, 10 Jan 2026 15:35:37 +0000",
          "title": "The robots we saw at CES 2026: The lovable, the creepy and the utterly confusing",
          "standfirst": "CES always has its share of attention-grabbing robots. But this year in particular seemed to be a landmark year for robotics. The advancement in AI technology has not only given robots better “brains,” it’s enabled new levels of autonomy and given rise to an ambitious, if sometimes questionable, vision for our robot-filled future.From sassy humanoids to AI-powered pets and chore-handling assistants, we sought out as many cute, strange and capable robots as we could find in Las Vegas. These are the ones that made the biggest impression. Agibot HumanoidsAgibot's X2 humanoid robot.Karissa Bell for EngadgetOf all the humanoids we saw at CES, Agibot's made the biggest impression. The company was showing off two models: the larger A2 and the smaller X2 (pictured above). The latter impressed us with its dance moves — the company told us it can learn surprisingly complex choreography — but the A2 turned out to be surprisingly capable at chatting up CES goers.Later in the show, we came across the A2 at IntBot's booth, where the company had custom versions of both Agibot humanoids \"running\" their booth. I spent several minutes talking with \"Nylo\" and was genuinely impressed by its conversational skills, even if its roasts could use a little work. — Karissa Bell, Senior ReporterDreame's robo vac arms and legsDreame was back this year with some wild robot vacuums. The company showed of the Cyber 10 Ultra, a robot vacuum with a multipurpose extendable arm. The arm, which we got a glimpse of at last year's show, can pick up stuff, but it also has its own cleaning attachments, allowing the robot to clean hard-to-reach corners and other spots that wouldn't otherwise be accessible.Dreame also brought its latest wild concept, the Cyber X, which has legs that propel it up and down full-size staircases. The legs are somewhat unsettling — they look alarmingly similar to mini chainsaws — but watching it glide up and down stairs was impressive all the same. — KBOlloBotThe long neck version of OlloBot.Cheyenne MacDonald for EngadgetOlloBot is one of those semi-ridiculous CES robots that's just impossible not to smile at. It has the goofiest face, with top-sitting frog eyes slapped onto a tablet where its mouth is displayed. Then, on top of that, it has a patch of soft fur on its neck and nowhere else on its body, which is penguin shaped and complete with flappy little arms. There are two versions of OlloBot, one that's short with a fixed neck and another where the neck can stretch out to make it much taller. And of course, it can be dressed up in silly outfits.It's a family-focused robot that responds to voice commands and touch, and is meant to capture memories as they happen, snapping pics and videos for its diary of notable moments. It can be used to make calls and control smart home devices. Everything is stored locally in its removable heart module, and there's a companion app for additional interactions. — Cheyenne MacDonald, Weekend EditorRovieA robot with a dust pan like appendage dumps toys into a bin.Cheyenne MacDonald for EngadgetSure, we've seen multiple robots (particularly robovacuums) that can pick objects up off the floor and put them away to make homes tidier, but this one is cute and has a little face. Instead of using an arm to grab one thing at a time, Clutterbot's Rovie has a dustpan-style tray with two sweepers that fold out from its front. It drives around and, using computer vision, identifies toys that have been left on the floor and scoops them up. Then, it dumps them in a designated bin where they're consolidated and out of the way. It's still in the R&D phase, a team member said when I visited the booth, but this is one I'm hoping to see become a real, purchasable product soon. For parents of small children who are constantly leaving their toys around, it would be pretty convenient to have a tiny robot picking up after them. Also for me, who doesn't have children but a very sweet and hardworking cat who loves to steal socks and then deliver them as if they're her kills, leaving socks scattered all over the house. Clutterbot team, if you're reading this, please add socks to the list of items Rovie can sweep up. — CMSaros RoverNot to be outdone, Roborock also brought a stairclimbing robot vacuum to CES, Saros Rover. And, unlike Dreame's prototype, the Roborock can also clean the stairs while it climbs. No word on when it will be available or how much it might cost (probably a lot!) but the company says it is \"a real product in development.\" -KBCLOiDCLOiD folded laundry at LG's CES booth.Karissa Bell for EngadgetLG's CLOiD was definitely the most ambitious robot we saw at CES 2026. The company showed its home helper concept (slowly) folding and sorting laundry, fetching drinks from the fridge, putting food in the oven and retrieving a set of lost keys. But while the 15-minute demo gave us a tantalizing look at the appliance maker's vision for a \"zero labor home,\" it's unlikely to be anything more than a slick demo anytime soon. The company has made no commitment to actually make a version of CLOiD people can actually buy. — KBAllexWIRobotics' Allex robot makes a heart sign with its hands.Cheyenne MacDonald for EngadgetWIRobotics brought its new humanoid, Allex, to CES, and the robot was really hamming it up when we stopped by the booth, striking poses and engaging with visitors. It's a waist-up robot with articulated parts, from its arms to its fingers, and is meant to be a general purpose tool that could be used in manufacturing, the service industry or even households. Each hand can hold objects of up to about 6.6 lbs, and the robotic hand has 15 degrees of freedom. The company's website shows the robot's fingers are dexterous enough to do the Gen-Z heart sign, but when it looked at Karissa and me it threw a millennial heart up. Did Allex lowkey call us unc? — CMPoketomoPoketomo in one of the many outfits Sharp brought to CES.Cheyenne MacDonald for EngadgetSharp's Poketomo is an improbably adorable tiny meerkat. Well, technically it's an AI companion shaped like a fuzzy, portable meerkat. It might look like a toy, but the company says it's actually to be a companion for adults. It’s small enough you can carry it around with you throughout the day (Sharp even makes a tiny Poketomo-sized clear backpack). Like a lot of AI companion devices we saw at CES, it’s equipped with a small camera and microphone that enables it to constantly interact with you. The camera also enables its “memory” so the pet can recognize and deliver personalized updates to its person. Poketomo launched recently in Japan, but sadly Sharp says it has no current plans to sell it in other markets. — KBBiboMoony bibo (I-Type).Cheyenne MacDonald for EngadgetIt seemed like everyone was trying to cash in on Labubu hype at CES 2026. There were Pop Mart-style bag charms all over the place and countless products that looked suspiciously like the now ubiquitous toy monster. We even got one pitch for a \"a labubu-like robot that talks to you\" that, in fact, did not look like a Labubu in any way, shape or form. But there was one truly Labubu-like tiny robot that managed to stand out from the rest and kind of stole my heart, even though I'm not particularly into Labubus. (Please don't make me say Labubu ever again.)Bibo is a cute-as-hell AI toy that's meant to be a companion you bring with you everywhere. It has a little camera on its head that it uses to see the world around it, and can recognize its owner's face and tone of voice, so it can respond to interactions in an emotionally appropriate way. It'll keep a daily diary of its activities, and while the toy comes in two starting personality \"types\" — Sunny bibo (E-Type), the bubbly extrovert, and Moony bibo (I-Type), the gentle, sensitive one — they'll develop more unique personalities over time. Their fur is soft and warm, so it feels like you're petting a kitten.Why is it even cuter like this?Cheyenne MacDonaldAt the booth, the team had several of them on display wearing various outfits, in little dioramas showing them in classroom and camping scenes, and even deconstructed with the fur removed, which somehow made it look even cuter. Bibo isn't available to purchase yet, and when it is, it'll launch first in China before potentially expanding depending on its success at home. — CMSharpaSharpa's humanoid robot is seen playing ping-pong.Cheyenne MacDonald for EngadgetSharpa's booth had a lot going on and was definitely one of the bigger crowd-pullers. There was a humanoid robot playing ping-pong, another taking selfies with people and another dealing blackjack, along with a disembodied robotic hand that could mirror visitors' finger movements. The autonomous demos showed off what that highly dexterous hand can do, and it was pretty impressive — especially seeing it draw individual cards from the deck. — CMZerothZeroth's W1 robot.Cheyenne MacDonald for EngadgetChinese robotics startup Zeroth brought two adorable home robots to CES: a pint-sized humanoid companion bot and a rolling robot that looks like Wall-E, with tank-style tracked treads so it can ride around outside. We didn't see these guys doing too much, but they sure were cute. The one that resembles Wall-E, called W1, kind of melted my heart just looking at it. (Don't get attached, you can't afford it.) The tiny humanoid, M1, costs $2,400 while W1 costs $5,000. Both are expected to ship this spring, with a tentative date of April 15. — CMSweekarSweekars in their little outfits.Karissa Bell for EngadgetTakway's Sweekar pocket pet was something I looked at and immediately thought, sigh, I'm going to buy that. It's a Tamagotchi-like virtual pet with AI smarts so it can form a personality based on your interactions with it and the activities you do together. The idea is that it \"grows\" with you. Like a Tamagotchi, it will require more frequent care in the younger stages of its life cycle. But after it reaches the adult level, it autonomously cares for itself, and it never dies. It can eventually keep itself entertained, and go off on its own virtual adventures and bring you back tales of its travels. Sweekar is super cute as is, and it can be dressed up in little outfits for more personalization. The device comes in light yellow, pink, and blue, and we saw it sporting a snowboarder outfit and a full cowboy getup. — CMRealbotixOne of Realbotix' robots. Cheyenne MacDonald for EngadgetRealbotix is a company we've seen a lot at CES over the years, and it was at the show again for 2026 with several of its highly customizable, realistic humanoid robots. As always, it was among the most unnerving exhibits we saw. New for this year, Realbotix was demonstrating its Robotic Vision System, which allows its robots to see and react to their surroundings more naturally, tracking faces to look directly at whoever is talking and better reading emotion from facial expressions. Damn, it can sense my fear now… — CMOnero H1Onero H1 had an endearingly blank stare.Karissa Bell for EngadgetSwitchbot surprised us with its own chore-handling robot, Onero H1, which also won Engadget editors' pick for best robot of CES 2026. We were immediately taken by its weirdly long body and endearingly blank stare as it slowly wheeled around picking up laundry and depositing the items in a washing machine. Like a lot of robot demos we saw at CES, we only saw Onero performing a small part of what Switchbot says it's actually capable of. But Onero also seemed much more realistic in terms of the type of robot helpers that people might actually see outside of CES, and the company told us it does plan to sell Onero (albeit in limited quantities) by the end of the year. — KBCocomoLudens AI Cocomo robot.Cheyenne MacDonald for EngadgetAnother robot pet that won us over immediately was Cocomo. Created by Japanese startup Ludens AI, Cocomo is an autonomous robot friend that yes, uses AI to respond to voice and touch and is meant to bond with its owners over time. The egg-shaped creature can scoot around on a wheeled base, or you can carry it around with you. But what we loved about Cocomo is that it's not trying to be yet another AI assistant, give out life advice or perform tasks. Its goal is to provide companionship and well, be your friend. And while it can respond to voice input it doesn't exactly have a voice of its own: it communicates via cute humming sounds, which is a lot less creepy than some of the talking robots we saw. — KB Yonbo Yonbo at CES.Cheyenne MacDonald for EngadgetYonbo is a kids' AI companion robot that totally charmed us. It kind of looks like a dog, and when we visited its booth at Unveiled, there were four of them playfully bopping their heads to a pop song and cycling through different cute facial expressions and emoji eyes (including bowls of ramen). It's designed to be an intelligent playmate that can tag along for activities, talk with a child and read them stories, and even help them work through emotions, like getting frustrated during a game. Yonbo's movement is controlled by a wristband, so it doesn't require a phone to play with. It can also be used as an extra pair of eyes for parents around the house. In Parental Monitor mode, which the team says is the only time its camera will be able to stream and store video, parents are able to see what Yonbo sees. The robot costs $800 and is available now. — CMMÖFOMÖFO in a glass case at CES.Cheyenne MacDonald for EngadgetIf we're being completely honest, the pitch for will.i.am's MÖFO (yes, MOFO, like motherfucker) had us a bit, um, perplexed for a hot second. We read it and all the accompanying materials over and over trying to figure out what, exactly, this thing does. Some of the claims that added to this confusion: \"the agent 'octopuses' across your digital ecosystem through its eight USB-C connections\"; it \"converts moments into objects\"; it \"turns life notes into a life operating system.\" We get it now, (we think): It's agentic AI hardware, kind of like a Rabbit R1 or AI Pin but in the form of a teddy bear. Sadly, we didn't get to see MÖFO up close or watch it do anything, but we are nonetheless intrigued, if still a bit confused, by this strange teddy bear. — CM and KBThis article originally appeared on Engadget at https://www.engadget.com/ai/the-robots-we-saw-at-ces-2026-the-lovable-the-creepy-and-the-utterly-confusing-153537930.html?src=rss",
          "content": "CES always has its share of attention-grabbing robots. But this year in particular seemed to be a landmark year for robotics. The advancement in AI technology has not only given robots better “brains,” it’s enabled new levels of autonomy and given rise to an ambitious, if sometimes questionable, vision for our robot-filled future.From sassy humanoids to AI-powered pets and chore-handling assistants, we sought out as many cute, strange and capable robots as we could find in Las Vegas. These are the ones that made the biggest impression. Agibot HumanoidsAgibot's X2 humanoid robot.Karissa Bell for EngadgetOf all the humanoids we saw at CES, Agibot's made the biggest impression. The company was showing off two models: the larger A2 and the smaller X2 (pictured above). The latter impressed us with its dance moves — the company told us it can learn surprisingly complex choreography — but the A2 turned out to be surprisingly capable at chatting up CES goers.Later in the show, we came across the A2 at IntBot's booth, where the company had custom versions of both Agibot humanoids \"running\" their booth. I spent several minutes talking with \"Nylo\" and was genuinely impressed by its conversational skills, even if its roasts could use a little work. — Karissa Bell, Senior ReporterDreame's robo vac arms and legsDreame was back this year with some wild robot vacuums. The company showed of the Cyber 10 Ultra, a robot vacuum with a multipurpose extendable arm. The arm, which we got a glimpse of at last year's show, can pick up stuff, but it also has its own cleaning attachments, allowing the robot to clean hard-to-reach corners and other spots that wouldn't otherwise be accessible.Dreame also brought its latest wild concept, the Cyber X, which has legs that propel it up and down full-size staircases. The legs are somewhat unsettling — they look alarmingly similar to mini chainsaws — but watching it glide up and down stairs was impressive all the same. — KBOlloBotThe long neck version of OlloBot.Cheyenne MacDonald for EngadgetOlloBot is one of those semi-ridiculous CES robots that's just impossible not to smile at. It has the goofiest face, with top-sitting frog eyes slapped onto a tablet where its mouth is displayed. Then, on top of that, it has a patch of soft fur on its neck and nowhere else on its body, which is penguin shaped and complete with flappy little arms. There are two versions of OlloBot, one that's short with a fixed neck and another where the neck can stretch out to make it much taller. And of course, it can be dressed up in silly outfits.It's a family-focused robot that responds to voice commands and touch, and is meant to capture memories as they happen, snapping pics and videos for its diary of notable moments. It can be used to make calls and control smart home devices. Everything is stored locally in its removable heart module, and there's a companion app for additional interactions. — Cheyenne MacDonald, Weekend EditorRovieA robot with a dust pan like appendage dumps toys into a bin.Cheyenne MacDonald for EngadgetSure, we've seen multiple robots (particularly robovacuums) that can pick objects up off the floor and put them away to make homes tidier, but this one is cute and has a little face. Instead of using an arm to grab one thing at a time, Clutterbot's Rovie has a dustpan-style tray with two sweepers that fold out from its front. It drives around and, using computer vision, identifies toys that have been left on the floor and scoops them up. Then, it dumps them in a designated bin where they're consolidated and out of the way. It's still in the R&D phase, a team member said when I visited the booth, but this is one I'm hoping to see become a real, purchasable product soon. For parents of small children who are constantly leaving their toys around, it would be pretty convenient to have a tiny robot picking up after them. Also for me, who doesn't have children but a very sweet and hardworking cat who loves to steal socks and then deliver them as if they're her kills, leaving socks scattered all over the house. Clutterbot team, if you're reading this, please add socks to the list of items Rovie can sweep up. — CMSaros RoverNot to be outdone, Roborock also brought a stairclimbing robot vacuum to CES, Saros Rover. And, unlike Dreame's prototype, the Roborock can also clean the stairs while it climbs. No word on when it will be available or how much it might cost (probably a lot!) but the company says it is \"a real product in development.\" -KBCLOiDCLOiD folded laundry at LG's CES booth.Karissa Bell for EngadgetLG's CLOiD was definitely the most ambitious robot we saw at CES 2026. The company showed its home helper concept (slowly) folding and sorting laundry, fetching drinks from the fridge, putting food in the oven and retrieving a set of lost keys. But while the 15-minute demo gave us a tantalizing look at the appliance maker's vision for a \"zero labor home,\" it's unlikely to be anything more than a slick demo anytime soon. The company has made no commitment to actually make a version of CLOiD people can actually buy. — KBAllexWIRobotics' Allex robot makes a heart sign with its hands.Cheyenne MacDonald for EngadgetWIRobotics brought its new humanoid, Allex, to CES, and the robot was really hamming it up when we stopped by the booth, striking poses and engaging with visitors. It's a waist-up robot with articulated parts, from its arms to its fingers, and is meant to be a general purpose tool that could be used in manufacturing, the service industry or even households. Each hand can hold objects of up to about 6.6 lbs, and the robotic hand has 15 degrees of freedom. The company's website shows the robot's fingers are dexterous enough to do the Gen-Z heart sign, but when it looked at Karissa and me it threw a millennial heart up. Did Allex lowkey call us unc? — CMPoketomoPoketomo in one of the many outfits Sharp brought to CES.Cheyenne MacDonald for EngadgetSharp's Poketomo is an improbably adorable tiny meerkat. Well, technically it's an AI companion shaped like a fuzzy, portable meerkat. It might look like a toy, but the company says it's actually to be a companion for adults. It’s small enough you can carry it around with you throughout the day (Sharp even makes a tiny Poketomo-sized clear backpack). Like a lot of AI companion devices we saw at CES, it’s equipped with a small camera and microphone that enables it to constantly interact with you. The camera also enables its “memory” so the pet can recognize and deliver personalized updates to its person. Poketomo launched recently in Japan, but sadly Sharp says it has no current plans to sell it in other markets. — KBBiboMoony bibo (I-Type).Cheyenne MacDonald for EngadgetIt seemed like everyone was trying to cash in on Labubu hype at CES 2026. There were Pop Mart-style bag charms all over the place and countless products that looked suspiciously like the now ubiquitous toy monster. We even got one pitch for a \"a labubu-like robot that talks to you\" that, in fact, did not look like a Labubu in any way, shape or form. But there was one truly Labubu-like tiny robot that managed to stand out from the rest and kind of stole my heart, even though I'm not particularly into Labubus. (Please don't make me say Labubu ever again.)Bibo is a cute-as-hell AI toy that's meant to be a companion you bring with you everywhere. It has a little camera on its head that it uses to see the world around it, and can recognize its owner's face and tone of voice, so it can respond to interactions in an emotionally appropriate way. It'll keep a daily diary of its activities, and while the toy comes in two starting personality \"types\" — Sunny bibo (E-Type), the bubbly extrovert, and Moony bibo (I-Type), the gentle, sensitive one — they'll develop more unique personalities over time. Their fur is soft and warm, so it feels like you're petting a kitten.Why is it even cuter like this?Cheyenne MacDonaldAt the booth, the team had several of them on display wearing various outfits, in little dioramas showing them in classroom and camping scenes, and even deconstructed with the fur removed, which somehow made it look even cuter. Bibo isn't available to purchase yet, and when it is, it'll launch first in China before potentially expanding depending on its success at home. — CMSharpaSharpa's humanoid robot is seen playing ping-pong.Cheyenne MacDonald for EngadgetSharpa's booth had a lot going on and was definitely one of the bigger crowd-pullers. There was a humanoid robot playing ping-pong, another taking selfies with people and another dealing blackjack, along with a disembodied robotic hand that could mirror visitors' finger movements. The autonomous demos showed off what that highly dexterous hand can do, and it was pretty impressive — especially seeing it draw individual cards from the deck. — CMZerothZeroth's W1 robot.Cheyenne MacDonald for EngadgetChinese robotics startup Zeroth brought two adorable home robots to CES: a pint-sized humanoid companion bot and a rolling robot that looks like Wall-E, with tank-style tracked treads so it can ride around outside. We didn't see these guys doing too much, but they sure were cute. The one that resembles Wall-E, called W1, kind of melted my heart just looking at it. (Don't get attached, you can't afford it.) The tiny humanoid, M1, costs $2,400 while W1 costs $5,000. Both are expected to ship this spring, with a tentative date of April 15. — CMSweekarSweekars in their little outfits.Karissa Bell for EngadgetTakway's Sweekar pocket pet was something I looked at and immediately thought, sigh, I'm going to buy that. It's a Tamagotchi-like virtual pet with AI smarts so it can form a personality based on your interactions with it and the activities you do together. The idea is that it \"grows\" with you. Like a Tamagotchi, it will require more frequent care in the younger stages of its life cycle. But after it reaches the adult level, it autonomously cares for itself, and it never dies. It can eventually keep itself entertained, and go off on its own virtual adventures and bring you back tales of its travels. Sweekar is super cute as is, and it can be dressed up in little outfits for more personalization. The device comes in light yellow, pink, and blue, and we saw it sporting a snowboarder outfit and a full cowboy getup. — CMRealbotixOne of Realbotix' robots. Cheyenne MacDonald for EngadgetRealbotix is a company we've seen a lot at CES over the years, and it was at the show again for 2026 with several of its highly customizable, realistic humanoid robots. As always, it was among the most unnerving exhibits we saw. New for this year, Realbotix was demonstrating its Robotic Vision System, which allows its robots to see and react to their surroundings more naturally, tracking faces to look directly at whoever is talking and better reading emotion from facial expressions. Damn, it can sense my fear now… — CMOnero H1Onero H1 had an endearingly blank stare.Karissa Bell for EngadgetSwitchbot surprised us with its own chore-handling robot, Onero H1, which also won Engadget editors' pick for best robot of CES 2026. We were immediately taken by its weirdly long body and endearingly blank stare as it slowly wheeled around picking up laundry and depositing the items in a washing machine. Like a lot of robot demos we saw at CES, we only saw Onero performing a small part of what Switchbot says it's actually capable of. But Onero also seemed much more realistic in terms of the type of robot helpers that people might actually see outside of CES, and the company told us it does plan to sell Onero (albeit in limited quantities) by the end of the year. — KBCocomoLudens AI Cocomo robot.Cheyenne MacDonald for EngadgetAnother robot pet that won us over immediately was Cocomo. Created by Japanese startup Ludens AI, Cocomo is an autonomous robot friend that yes, uses AI to respond to voice and touch and is meant to bond with its owners over time. The egg-shaped creature can scoot around on a wheeled base, or you can carry it around with you. But what we loved about Cocomo is that it's not trying to be yet another AI assistant, give out life advice or perform tasks. Its goal is to provide companionship and well, be your friend. And while it can respond to voice input it doesn't exactly have a voice of its own: it communicates via cute humming sounds, which is a lot less creepy than some of the talking robots we saw. — KB Yonbo Yonbo at CES.Cheyenne MacDonald for EngadgetYonbo is a kids' AI companion robot that totally charmed us. It kind of looks like a dog, and when we visited its booth at Unveiled, there were four of them playfully bopping their heads to a pop song and cycling through different cute facial expressions and emoji eyes (including bowls of ramen). It's designed to be an intelligent playmate that can tag along for activities, talk with a child and read them stories, and even help them work through emotions, like getting frustrated during a game. Yonbo's movement is controlled by a wristband, so it doesn't require a phone to play with. It can also be used as an extra pair of eyes for parents around the house. In Parental Monitor mode, which the team says is the only time its camera will be able to stream and store video, parents are able to see what Yonbo sees. The robot costs $800 and is available now. — CMMÖFOMÖFO in a glass case at CES.Cheyenne MacDonald for EngadgetIf we're being completely honest, the pitch for will.i.am's MÖFO (yes, MOFO, like motherfucker) had us a bit, um, perplexed for a hot second. We read it and all the accompanying materials over and over trying to figure out what, exactly, this thing does. Some of the claims that added to this confusion: \"the agent 'octopuses' across your digital ecosystem through its eight USB-C connections\"; it \"converts moments into objects\"; it \"turns life notes into a life operating system.\" We get it now, (we think): It's agentic AI hardware, kind of like a Rabbit R1 or AI Pin but in the form of a teddy bear. Sadly, we didn't get to see MÖFO up close or watch it do anything, but we are nonetheless intrigued, if still a bit confused, by this strange teddy bear. — CM and KBThis article originally appeared on Engadget at https://www.engadget.com/ai/the-robots-we-saw-at-ces-2026-the-lovable-the-creepy-and-the-utterly-confusing-153537930.html?src=rss",
          "feed_position": 11,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/AGIBOT.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/cybersecurity/vpn/how-to-change-location-with-a-vpn-140000339.html",
          "published_at": "Sat, 10 Jan 2026 14:00:00 +0000",
          "title": "How to change location with a VPN",
          "standfirst": "Chances are that you're here because you've heard a virtual private network (VPN) can change your virtual location, and want to know what that means. If you know already, head over to my best VPN list to learn which services I recommend for changing your location. But if you're clueless, read on.Whenever any device connects to the internet — whether it's a laptop, a phone or a smart Lego brick — it's assigned a unique IP address that other devices can use to identify it. Think of the name you give the barista at a coffee shop, except instead of a hot beverage, you’re being served websites and digital audio and video.That's the upside. The downside is that a device's IP address can be used to find its location in the real world. That means service providers can show you local weather reports — as well as targeted local ads. More ominously, however, it means service providers can restrict what you see online based on where you are physically. That impacts everything from the fun (what Netflix has available to stream) to the serious (what information gets censored on the government's behalf).A VPN gets around that downside by running all your online activity through a middleman server before sending it to its destination. Instead of your real IP address, everyone sees the address of the VPN server, along with its geolocation. That means you can subvert any local restrictions getting in your way: You’re actually in Houston, but so far as the website you’re viewing is concerned, you seem to be coming from Amsterdam. Here's how to do it.How to change your virtual location with a VPNWith so many excellent commercial VPNs on the market, changing your virtual location is a lot easier than it sounds. You don't need to be a hacker — just find a good VPN app and connect to a server in your desired location. On almost any VPN, this is a simple matter of opening the app or desktop client and choosing the server location from a list.On Proton VPN, for example, you can switch locations by clicking the name of any country in the list on the left.Sam Chapman for EngadgetHowever, as with any technology, there are some potential pitfalls. For reference, I've laid out the steps below for both desktop and mobile devices.How to change location on Windows or MacUse these steps to change the virtual location of any desktop or laptop device running macOS or Windows. There may be slight variations, but in general, this process works for any top VPN.Select a VPN provider. You can rely on Engadget's best VPN list or, if you're unable to pay for a new subscription right now, our list of the best free VPNs. My personal choice is Proton VPN, but there are other good options. Look for a service with fast speeds, modern encryption and a long, non-controversial record in the industry.Create an account with the VPN and save your username and password. Unless it's a forever-free service, this is when you'll be asked to pay for a subscription. If you're sure about your provider, you can save a lot by going with a long-term deal. See our list of the best VPN deals for ideas.Download the VPN app. It's best to go through the VPN's website, even if you're on Mac — in rare cases, the App Store versions can be outdated or short on features. Look for a download center on the site, and make sure you enter it while logged in.Install the VPN app. Most VPNs have an installation flow built in, so all you have to do is follow the steps. If the VPN asks you to change your settings or grant it permissions, do it; this installs the tools it needs to do its job.Open the VPN app and find your way around the user interface. At a minimum, make sure you know how to connect, disconnect and open the location selection menu.Connect to a server in the location where you want your internet connection to appear to originate. If you're trying to get around local restrictions, you can just pick any nearby country without that censorship — for example, if you're in China, then Japan, South Korea or Singapore will work. If you're after content from a specific country, choose a server in that country.Get online through a browser or connected app as you normally would. To make sure your location has actually changed, use a site like WhatIsMyIPAddress to check where you're coming from.When you want to use your real location again, disconnect from the VPN or choose a server in the county you're in.It's not necessary, but I also recommend activating your VPN's kill switch if there is one. VPN servers aren't perfect, and they do drop connections from time to time. If this happens, an active kill switch also cuts off your internet connection so your real location isn't visible for a millisecond.How to change location on iPhone or AndroidThe process for using a VPN to change your virtual location on mobile is pretty similar to how it's done on desktop. Again, while individual installation flows have their own quirks, the following steps are broadly applicable to any iOS or Android VPN.Pick a VPN provider you like. The best VPNs also tend to be the best for mobile, including Proton VPN, ExpressVPN and Surfshark. On mobile, you can use app store reviews and comments to research. Make sure you're getting the real version of your chosen VPN and not a similarly named one trying to piggyback.Download the VPN from the Apple App Store or Google Play Store. At this point, if you haven't paid yet, you may be able to take advantage of a free trial by opening the app and proceeding through the setup flow. This is a good time to test if the VPN is changing your location in ways that can't be seen through.Follow the VPN's instructions to create an account, including paying for a subscription if necessary.Take some time to learn to use the VPN app. Mobile interfaces have to pack more features into a smaller space, usually relying on tabs. Try and find the tabs for picking server locations and toggling VPN settings.Connect to a server in your desired location. Make sure the VPN is actually active before you proceed (most of them make it pretty clear, but it's still easy to forget).Get online through a browser or another internet-capable app.When you're finished, disconnect from the VPN to return to using your real location.One more note: on both mobile and desktop, I recommend using either a paid VPN or a free VPN supported by a paid subscription. Entirely free VPNs come with risks, and some popular apps secretly share problematic connections. Why change your virtual location?Changing your virtual location isn't hard, but it's still an extra step between you and the internet. However, the benefits of location masking far outweigh the small amount of extra work. Hiding your IP address — and your location along with it — is one of the most impactful steps you can take to stay safe online.Concealing your IP address has massive benefits on its own, even if you use one close to your real location (which gets you shorter loading times). Lots of web services track you without your consent, frequently for advertising purposes. Some of this is done through third-party cookies, but a lot of it starts with building profiles about your IP address.Illicit actors can also take advantage of your IP address and its geolocation. A hacker can track you down to within your ZIP code — though an IP address can't pinpoint your location to the square foot, it makes it much easier to narrow down where you live. Even with just your IP address, hackers can launch DDoS attacks against you, use the IP to make fake social media accounts in your name or even call in SWAT teams to your location.By changing my location to the UK using ExpressVPN, I can see shows on Netflix that aren't listed in the US.Sam Chapman for EngadgetAlthough masking your virtual location can be vital to staying safe online, there are other practical and even fun reasons to do it. For one thing, when traveling abroad, you might want to use a site only available in your home country. Simply connect to a server located near home and you can use your bank account and local streaming libraries as normal.If you're home, there are lots of benefits to being virtually in another region. You can see a foreign country's streaming libraries and shop for deals that may only be available in its currency. You can also get around any nationwide online censorship and potentially download banned apps. Just be sure to be aware of your local laws to know if doing so is merely frowned upon, or if it’s truly against the law.Can a VPN change your GPS location?There's one more critical point to remember when changing location with a VPN. The VPN server only changes your IP address and the physical location associated with it. It does not change the GPS location your device might be broadcasting.GPS data can leak out in a few ways. Tablets and phones have location services turned on by default, and as anyone who's heard a true crime podcast knows, they can also give away your location by contacting cell towers. Web browsers often have similar features. Websites can also use HTML5 geolocation to access your GPS — provided you give permission, but that's easy to do without thinking.Some VPNs, including Surfshark and Windscribe, do have features designed to fool GPS, but they're not standard. When you're changing your location with a VPN, make sure to turn off location services and avoid granting any permissions that might reveal where you really are. You can also run a separate GPS spoofing app alongside your VPN.How to troubleshoot a VPN that's not changing your locationIf you've found that browsers are still seeing your old IP address while you have a VPN active, or that websites show you the same content when you're supposed to be virtually abroad, there's a chance your VPN isn't actually changing your location. To test if your real position is leaking, start by checking your IP address (with a search engine or WhatIsMyIPAddress). If it matches your home location, something has gone wrong.Note that it's not necessarily a problem if it doesn't match your home location or the stated location of your VPN server. VPNs use virtual server locations to reach a lot of locations where brick-and-mortar servers aren't practical — Windscribe, for example, does not have a physical data center in Antarctica.If you find that your VPN is leaking your real IP address, try these troubleshooting steps in order. I've arranged them roughly from least to most time-intensive.Disconnect from your VPN and reconnect to the same location. This should hook you up with a different server in that same place. Test your IP again — there's a good chance the problem was isolated to the first server you tried.Try a new location (skip this step if you need a server in a particular country).Try a different VPN protocol. If you're using WireGuard, switch to OpenVPN or IKEv2.Make sure location services are turned off.Clear your browser cache and cookies to get rid of any saved information.Test for DNS leaks. Your VPN might accidentally be sending your IP address to a public server to resolve DNS requests. IPleak.org is a good tool for catching this.Try a different VPN. Use a free service like Proton or Windscribe and test for leaks. If the problem reoccurs, it might be coming from inside your network.Contact the helpdesk for your original VPN and inform them about the problem. Get screenshots of the VPN connected to the leaky location next to IP address data confirming the leak.I've already mentioned several VPNs that do a good job of changing your location, but in case you're here for product advice, here are all my recommendations in one place. My favorite VPN is Proton VPN, which is so far the only service to receive full marks on my location-change test. I used 15 of its servers in five different countries to access Netflix. Each time, I saw the destination country's full content library like I was really there.Surfshark is a close runner-up in this category. It passed 14 out of 15 tests, only slipping up once in Japan — and a quick disconnect and reconnect was enough to fix that. I got equally great results from ExpressVPN, only having to retry one server in the UK. NordVPN performed perfectly in every location except Nigeria, and that still didn't leak my real IP address. The problem only seemed to exist on Netflix.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-change-location-with-a-vpn-140000339.html?src=rss",
          "content": "Chances are that you're here because you've heard a virtual private network (VPN) can change your virtual location, and want to know what that means. If you know already, head over to my best VPN list to learn which services I recommend for changing your location. But if you're clueless, read on.Whenever any device connects to the internet — whether it's a laptop, a phone or a smart Lego brick — it's assigned a unique IP address that other devices can use to identify it. Think of the name you give the barista at a coffee shop, except instead of a hot beverage, you’re being served websites and digital audio and video.That's the upside. The downside is that a device's IP address can be used to find its location in the real world. That means service providers can show you local weather reports — as well as targeted local ads. More ominously, however, it means service providers can restrict what you see online based on where you are physically. That impacts everything from the fun (what Netflix has available to stream) to the serious (what information gets censored on the government's behalf).A VPN gets around that downside by running all your online activity through a middleman server before sending it to its destination. Instead of your real IP address, everyone sees the address of the VPN server, along with its geolocation. That means you can subvert any local restrictions getting in your way: You’re actually in Houston, but so far as the website you’re viewing is concerned, you seem to be coming from Amsterdam. Here's how to do it.How to change your virtual location with a VPNWith so many excellent commercial VPNs on the market, changing your virtual location is a lot easier than it sounds. You don't need to be a hacker — just find a good VPN app and connect to a server in your desired location. On almost any VPN, this is a simple matter of opening the app or desktop client and choosing the server location from a list.On Proton VPN, for example, you can switch locations by clicking the name of any country in the list on the left.Sam Chapman for EngadgetHowever, as with any technology, there are some potential pitfalls. For reference, I've laid out the steps below for both desktop and mobile devices.How to change location on Windows or MacUse these steps to change the virtual location of any desktop or laptop device running macOS or Windows. There may be slight variations, but in general, this process works for any top VPN.Select a VPN provider. You can rely on Engadget's best VPN list or, if you're unable to pay for a new subscription right now, our list of the best free VPNs. My personal choice is Proton VPN, but there are other good options. Look for a service with fast speeds, modern encryption and a long, non-controversial record in the industry.Create an account with the VPN and save your username and password. Unless it's a forever-free service, this is when you'll be asked to pay for a subscription. If you're sure about your provider, you can save a lot by going with a long-term deal. See our list of the best VPN deals for ideas.Download the VPN app. It's best to go through the VPN's website, even if you're on Mac — in rare cases, the App Store versions can be outdated or short on features. Look for a download center on the site, and make sure you enter it while logged in.Install the VPN app. Most VPNs have an installation flow built in, so all you have to do is follow the steps. If the VPN asks you to change your settings or grant it permissions, do it; this installs the tools it needs to do its job.Open the VPN app and find your way around the user interface. At a minimum, make sure you know how to connect, disconnect and open the location selection menu.Connect to a server in the location where you want your internet connection to appear to originate. If you're trying to get around local restrictions, you can just pick any nearby country without that censorship — for example, if you're in China, then Japan, South Korea or Singapore will work. If you're after content from a specific country, choose a server in that country.Get online through a browser or connected app as you normally would. To make sure your location has actually changed, use a site like WhatIsMyIPAddress to check where you're coming from.When you want to use your real location again, disconnect from the VPN or choose a server in the county you're in.It's not necessary, but I also recommend activating your VPN's kill switch if there is one. VPN servers aren't perfect, and they do drop connections from time to time. If this happens, an active kill switch also cuts off your internet connection so your real location isn't visible for a millisecond.How to change location on iPhone or AndroidThe process for using a VPN to change your virtual location on mobile is pretty similar to how it's done on desktop. Again, while individual installation flows have their own quirks, the following steps are broadly applicable to any iOS or Android VPN.Pick a VPN provider you like. The best VPNs also tend to be the best for mobile, including Proton VPN, ExpressVPN and Surfshark. On mobile, you can use app store reviews and comments to research. Make sure you're getting the real version of your chosen VPN and not a similarly named one trying to piggyback.Download the VPN from the Apple App Store or Google Play Store. At this point, if you haven't paid yet, you may be able to take advantage of a free trial by opening the app and proceeding through the setup flow. This is a good time to test if the VPN is changing your location in ways that can't be seen through.Follow the VPN's instructions to create an account, including paying for a subscription if necessary.Take some time to learn to use the VPN app. Mobile interfaces have to pack more features into a smaller space, usually relying on tabs. Try and find the tabs for picking server locations and toggling VPN settings.Connect to a server in your desired location. Make sure the VPN is actually active before you proceed (most of them make it pretty clear, but it's still easy to forget).Get online through a browser or another internet-capable app.When you're finished, disconnect from the VPN to return to using your real location.One more note: on both mobile and desktop, I recommend using either a paid VPN or a free VPN supported by a paid subscription. Entirely free VPNs come with risks, and some popular apps secretly share problematic connections. Why change your virtual location?Changing your virtual location isn't hard, but it's still an extra step between you and the internet. However, the benefits of location masking far outweigh the small amount of extra work. Hiding your IP address — and your location along with it — is one of the most impactful steps you can take to stay safe online.Concealing your IP address has massive benefits on its own, even if you use one close to your real location (which gets you shorter loading times). Lots of web services track you without your consent, frequently for advertising purposes. Some of this is done through third-party cookies, but a lot of it starts with building profiles about your IP address.Illicit actors can also take advantage of your IP address and its geolocation. A hacker can track you down to within your ZIP code — though an IP address can't pinpoint your location to the square foot, it makes it much easier to narrow down where you live. Even with just your IP address, hackers can launch DDoS attacks against you, use the IP to make fake social media accounts in your name or even call in SWAT teams to your location.By changing my location to the UK using ExpressVPN, I can see shows on Netflix that aren't listed in the US.Sam Chapman for EngadgetAlthough masking your virtual location can be vital to staying safe online, there are other practical and even fun reasons to do it. For one thing, when traveling abroad, you might want to use a site only available in your home country. Simply connect to a server located near home and you can use your bank account and local streaming libraries as normal.If you're home, there are lots of benefits to being virtually in another region. You can see a foreign country's streaming libraries and shop for deals that may only be available in its currency. You can also get around any nationwide online censorship and potentially download banned apps. Just be sure to be aware of your local laws to know if doing so is merely frowned upon, or if it’s truly against the law.Can a VPN change your GPS location?There's one more critical point to remember when changing location with a VPN. The VPN server only changes your IP address and the physical location associated with it. It does not change the GPS location your device might be broadcasting.GPS data can leak out in a few ways. Tablets and phones have location services turned on by default, and as anyone who's heard a true crime podcast knows, they can also give away your location by contacting cell towers. Web browsers often have similar features. Websites can also use HTML5 geolocation to access your GPS — provided you give permission, but that's easy to do without thinking.Some VPNs, including Surfshark and Windscribe, do have features designed to fool GPS, but they're not standard. When you're changing your location with a VPN, make sure to turn off location services and avoid granting any permissions that might reveal where you really are. You can also run a separate GPS spoofing app alongside your VPN.How to troubleshoot a VPN that's not changing your locationIf you've found that browsers are still seeing your old IP address while you have a VPN active, or that websites show you the same content when you're supposed to be virtually abroad, there's a chance your VPN isn't actually changing your location. To test if your real position is leaking, start by checking your IP address (with a search engine or WhatIsMyIPAddress). If it matches your home location, something has gone wrong.Note that it's not necessarily a problem if it doesn't match your home location or the stated location of your VPN server. VPNs use virtual server locations to reach a lot of locations where brick-and-mortar servers aren't practical — Windscribe, for example, does not have a physical data center in Antarctica.If you find that your VPN is leaking your real IP address, try these troubleshooting steps in order. I've arranged them roughly from least to most time-intensive.Disconnect from your VPN and reconnect to the same location. This should hook you up with a different server in that same place. Test your IP again — there's a good chance the problem was isolated to the first server you tried.Try a new location (skip this step if you need a server in a particular country).Try a different VPN protocol. If you're using WireGuard, switch to OpenVPN or IKEv2.Make sure location services are turned off.Clear your browser cache and cookies to get rid of any saved information.Test for DNS leaks. Your VPN might accidentally be sending your IP address to a public server to resolve DNS requests. IPleak.org is a good tool for catching this.Try a different VPN. Use a free service like Proton or Windscribe and test for leaks. If the problem reoccurs, it might be coming from inside your network.Contact the helpdesk for your original VPN and inform them about the problem. Get screenshots of the VPN connected to the leaky location next to IP address data confirming the leak.I've already mentioned several VPNs that do a good job of changing your location, but in case you're here for product advice, here are all my recommendations in one place. My favorite VPN is Proton VPN, which is so far the only service to receive full marks on my location-change test. I used 15 of its servers in five different countries to access Netflix. Each time, I saw the destination country's full content library like I was really there.Surfshark is a close runner-up in this category. It passed 14 out of 15 tests, only slipping up once in Japan — and a quick disconnect and reconnect was enough to fix that. I got equally great results from ExpressVPN, only having to retry one server in the UK. NordVPN performed perfectly in every location except Nigeria, and that still didn't leak my real IP address. The problem only seemed to exist on Netflix.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-change-location-with-a-vpn-140000339.html?src=rss",
          "feed_position": 13,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Proton_VPN_Mac_interface.png"
        }
      ],
      "featured_image": "https://images.ctfassets.net/jdtwqhzvc2n1/7iyQoeSwdOqqpfcE0PFWgF/48db7d0305019eee107028d9f018d2ac/Semantic_caching.png?w=300&q=30",
      "popularity_score": 2018.6741816666668
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "Is Orion’s heat shield really safe? New NASA chief conducts final review on eve of flight.",
      "neutral_headline": "Is Orion’s heat shield really safe? New NASA chief conducts final...",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/nasa-chief-reviews-orion-heat-shield-expresses-full-confidence-in-it-for-artemis-ii/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "Is Orion’s heat shield really safe? New NASA chief conducts final review on eve of flight.",
          "standfirst": "",
          "content": "",
          "feed_position": 0
        }
      ],
      "popularity_score": 363.9999066666667
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Sun, 11 Jan 2026 20:35:33 +0000",
      "title": "That time Will Smith helped discover new species of anaconda",
      "neutral_headline": "That time Will Smith helped discover new species of anaconda",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/that-time-will-smith-helped-discover-new-species-of-anaconda/",
          "published_at": "Sun, 11 Jan 2026 20:35:33 +0000",
          "title": "That time Will Smith helped discover new species of anaconda",
          "standfirst": "Footage of the 2024 discovery appears in NatGeo's new documentary series Pole to Pole with Will Smith",
          "content": "In 2024, scientists announced the discovery of a new species of giant anaconda in South America. A National Geographic camera crew was on hand for the 2022 expedition that documented the new species—and so was actor Will Smith, since they were filming for NatGeo's new documentary series, Pole to Pole with Will Smith. Now we can all share in Smith's Amazon experience, courtesy of the three-minute clip above. Along with venom expert Bryan Fry, we follow Smith's journey by boat with a team of indigenous Waorani guides, scouring the river banks for anacondas. And they find one: a female green anaconda about 16 to 17 feet long, \"pure muscle.\" The Waorani secure the giant snake—anacondas aren't venomous but they do bite—so that Fry (with Smith's understandably reluctant help) can collect a scale sample for further analysis. Fry says that this will enable him to determine the accumulation of pollutants in the water. That and other collected samples also enabled scientists to conduct the genetic analysis that resulted in the declaration of a new species: the northern green anaconda (Eunectes akayama, which roughly translates to \"the great snake\"). It is genetically distinct from the southern green anaconda (Eunectes murinus); the two species likely diverged some 10 million years ago. The northern green anaconda's turf includes Venezuela, Colombia, Suriname, French Guyana, and the northern part of Brazil.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anaconda3-1152x648-1768069746.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anaconda3-1152x648-1768069746.jpg",
      "popularity_score": 338.24279277777777
    },
    {
      "id": "cluster_4",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "SpaceX gets FCC permission to launch another 7,500 Starlink satellites",
      "neutral_headline": "SpaceX gets FCC permission to launch another 7,500 Starlink satellites",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/spacex-gets-fcc-permission-to-launch-another-7500-starlink-satellites/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "SpaceX gets FCC permission to launch another 7,500 Starlink satellites",
          "standfirst": "",
          "content": "",
          "feed_position": 4
        }
      ],
      "popularity_score": 320.9999066666667
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Sun, 11 Jan 2026 12:00:50 +0000",
      "title": "The oceans just keep getting hotter",
      "neutral_headline": "The oceans just keep getting hotter",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/the-oceans-just-keep-getting-hotter/",
          "published_at": "Sun, 11 Jan 2026 12:00:50 +0000",
          "title": "The oceans just keep getting hotter",
          "standfirst": "For the eighth year in a row, the world’s oceans absorbed a record-breaking amount of heat in 2025.",
          "content": "Since 2018, a group of researchers from around the world has crunched the numbers on how much heat the world’s oceans are absorbing each year. In 2025, their measurements broke records once again, making this the eighth year in a row that the world’s oceans have absorbed more heat than in the years before. The study, which was published Friday in the journal Advances in Atmospheric Science, found that the world’s oceans absorbed an additional 23 zettajoules’ worth of heat in 2025, the most in any year since modern measurements began in the 1960s. That’s significantly higher than the 16 additional zettajoules they absorbed in 2024. The research comes from a team of more than 50 scientists across the United States, Europe, and China. A joule is a common way to measure energy. A single joule is a relatively small unit of measurement—it’s about enough to power a tiny lightbulb for a second, or slightly heat a gram of water. But a zettajoule is one sextillion joules; numerically, the 23 zettajoules the oceans absorbed this year can be written out as 23,000,000,000,000,000,000,000.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/sun-over-ocean-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/sun-over-ocean-1152x648.jpg",
      "popularity_score": 320
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Sat, 10 Jan 2026 12:00:21 +0000",
      "title": "Conservative lawmakers want porn taxes. Critics say they’re unconstitutional.",
      "neutral_headline": "Conservative lawmakers want porn taxes. Critics say they’re unconstitutional.",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/conservative-lawmakers-want-porn-taxes-critics-say-theyre-unconstitutional/",
          "published_at": "Sat, 10 Jan 2026 12:00:21 +0000",
          "title": "Conservative lawmakers want porn taxes. Critics say they’re unconstitutional.",
          "standfirst": "Half the country has enacted age-verification laws to prevent minors from viewing porn.",
          "content": "As age-verification laws continue to dismantle the adult industry—and determine the future of free speech on the internet—a Utah lawmaker proposed a bill this week that would enforce a tax on porn sites that operate within the state. Introduced by state senator Calvin Musselman, a Republican, the bill would impose a 7 percent tax on total receipts “from sales, distributions, memberships, subscriptions, performances, and content amounting to material harmful to minors that is produced, sold, filmed, generated, or otherwise based” in Utah. If passed, the bill would go into effect in May and would also require adult sites to pay a $500 annual fee to the State Tax Commission. Per the legislation, the money made from the tax will be used by Utah’s Department of Health and Human Services to provide more mental health support for teens. Musselman did not respond to a request for comment.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-155161689-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-155161689-1152x648.jpg",
      "popularity_score": 313
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "ESA considers righting the wrongs of Ariane 6 by turning it into a Franken-rocket",
      "neutral_headline": "ESA considers righting the wrongs of Ariane 6 by turning it into a Franken-rocket",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/esa-considers-righting-the-wrongs-of-ariane-6-by-turning-it-into-a-franken-rocket/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "ESA considers righting the wrongs of Ariane 6 by turning it into a Franken-rocket",
          "standfirst": "",
          "content": "",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.9999066666667
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "Google: Don’t make “bite-sized” content for LLMs if you care about search rank",
      "neutral_headline": "Google: Don’t make “bite-sized” content for LLMs if you care about search rank",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/01/google-dont-make-bite-sized-content-for-llms-if-you-care-about-search-rank/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "Google: Don’t make “bite-sized” content for LLMs if you care about search rank",
          "standfirst": "",
          "content": "",
          "feed_position": 7
        }
      ],
      "popularity_score": 294.9999066666667
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "Measles continues raging in South Carolina; 99 new cases since Tuesday",
      "neutral_headline": "Measles continues raging in South Carolina; 99 new cases since Tuesday",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/measles-continues-raging-in-south-carolina-99-new-cases-since-tuesday/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "Measles continues raging in South Carolina; 99 new cases since Tuesday",
          "standfirst": "",
          "content": "",
          "feed_position": 6
        }
      ],
      "popularity_score": 292.9999066666667
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "Cloudflare defies Italy’s Piracy Shield, won’t block websites on 1.1.1.1 DNS",
      "neutral_headline": "Cloudflare defies Italy’s Piracy Shield, won’t block websites on 1.1.1.1 DNS",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/cloudflare-may-pull-servers-out-of-italy-over-order-that-it-block-pirate-sites/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "Cloudflare defies Italy’s Piracy Shield, won’t block websites on 1.1.1.1 DNS",
          "standfirst": "",
          "content": "",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.9999066666667
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "2026-01-12T11:20:58.610Z",
      "title": "US Black Hawk helicopter trespasses on private Montana ranch to grab elk antlers",
      "neutral_headline": "US Black Hawk helicopter trespasses on private Montana ranch to grab elk antlers",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/us-black-hawk-helicopter-trespasses-on-private-montana-ranch-to-grab-elk-antlers/",
          "published_at": "2026-01-12T11:20:58.610Z",
          "title": "US Black Hawk helicopter trespasses on private Montana ranch to grab elk antlers",
          "standfirst": "",
          "content": "",
          "feed_position": 9
        }
      ],
      "popularity_score": 262.9999066666667
    }
  ]
}