{
  "updated_at": "2025-09-26T19:14:53.800Z",
  "clusters": [
    {
      "id": "cluster_9",
      "coverage": 3,
      "updated_at": "Fri, 26 Sep 2025 18:28:11 GMT",
      "title": "Best early Amazon Prime Day Samsung deals 2025: My 23 favorites sales ahead of October",
      "neutral_headline": "Best early Amazon Prime Day Samsung deals 2025: My 23 favorites sales ahead of October",
      "items": [
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/best-early-amazon-october-prime-day-samsung-deals/",
          "published_at": "Fri, 26 Sep 2025 18:28:11 GMT",
          "title": "Best early Amazon Prime Day Samsung deals 2025: My 23 favorites sales ahead of October",
          "standfirst": "Looking for a deal on a Samsung smartphone, tablet, or wearable ahead of Amazon's October Prime Day? Check out our top picks.",
          "content": "Looking for a deal on a Samsung smartphone, tablet, or wearable ahead of Amazon's October Prime Day? Check out our top picks.",
          "feed_position": 2
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/23449363/best-android-smartwatches-wear-os",
          "published_at": "2025-09-26T14:05:47-04:00",
          "title": "The best smartwatches for Android",
          "standfirst": "Editor’s note: Amazon’s fall Prime Day event kicks off on October 7th; however, if you want to shop ahead of the two-day sale, we’ve rounded up the best early Prime Day deals you can already get. After a long stretch of slim pickings, the last couple of years have been huge for Android smartwatches. Now [&#8230;]",
          "content": "Editor’s note: Amazon’s fall Prime Day event kicks off on October 7th; however, if you want to shop ahead of the two-day sale, we’ve rounded up the best early Prime Day deals you can already get. After a long stretch of slim pickings, the last couple of years have been huge for Android smartwatches. Now there are more good options than ever — with more on the way soon. Much like Android phones, this market is fragmented. Wear OS 5 is still what most watches are running, including older Samsung Galaxy Watches, Google’s Pixel Watch 3, and the OnePlus Watch 3. However, Wear OS 6 will come to several smartwatches later this year, although some models will likely be left behind. The Galaxy Watch 8, which was released on July 25th, shipped with One UI 8 Watch (Samsung’s version of Wear OS 6). The $349.99 Pixel Watch 4 will launch on October 9th with Wear OS 6 installed, so stay tuned for our upcoming review. It’s true that it is more complicated to shop for an Android smartwatch compared to, say, an Apple Watch; Certain models play nicer when paired to certain smartphones versus others, which is something we wish wasn’t the case. But, the upside of having more options is that there’s more diversity in terms of style, features, and price. Featured in this article Best for non-Samsung users: Google Pixel Watch 3 The Pixel Watch 3 has a bright screen and access to Google Gemini. It’s slated to receive an update to Wear OS 6 later this year. Where to Buy: $349.99 $242.99 at Amazon (41mm, Bluetooth) $349.99 $249.99 at Best Buy (41mm, Bluetooth) $349.99 $249.99 at Google (41mm, Bluetooth) Samsung Galaxy Watch 8 Samsung&#8217;s latest smartwatch features a new squircle design, Gemini, and some new health features like an Antioxidant Index and Running Coach. Where to Buy: $349.99 $279.99 at Samsung $349.99 $329.99 at Best Buy $349.99 $329.99 at Amazon If you’d rather wait until Wear OS settles down a bit, there are platform-agnostic smartwatches and fitness watches you can buy in the meantime. Otherwise, you’ll want to be aware of the Wear OS version powering your watch. Mobvoi, for instance, has generally been a step behind Google and Samsung in rolling out the latest version of Wear OS. You should also take note of whether the watch you want is using the latest processor, or a last-gen model. So long as you keep the aforementioned caveats in mind, Android users have more smartwatch options than ever before. I’ve rounded up my top picks, but if none of these is the right fit, you can always check out our fitness tracker buying guide. Best smartwatch for Samsung phonesBest Android smartwatch for non-Samsung usersBest alternative to Google and Samsung smartwatchesBest fitness smartwatch for AndroidBest hybrid smartwatchBest platform-agnostic fitness smartwatchBest budget Android smartwatch Best smartwatch for Samsung phones Samsung Galaxy Watch 8 Samsung&#8217;s latest smartwatch features a new squircle design, Gemini, and some new health features like an Antioxidant Index and Running Coach. Where to Buy: $349.99 $279.99 at Samsung $349.99 $329.99 at Best Buy $349.99 $329.99 at Amazon Sizes: 40mm, 44mm / Weight: 30g, 34g / Battery life: Up to 30 hours with AOD / Display type: Always-on OLED / GPS: Built-in GPS / Connectivity: LTE (optional), Bluetooth, Wi-Fi / Water resistance: Up to 50 meters, IP68 / Music storage: 32GB If you have a Samsung phone, you’ll get the most mileage out of a Samsung smartwatch. And of the four watches Samsung has in its current lineup, I recommend the Galaxy Watch 8, especially if you’re upgrading from a Galaxy Watch 5 or earlier. Its new squircle shape may seem like an unnecessary change, but it allowed Samsung to slim down the watch’s frame and it felt more comfortable on my wrist. I was apprehensive at first, but quickly got used to it. Internally, the Galaxy Watch 8 isn’t a huge departure from its predecessor. It has the same processor and 3-in-1 Biometric Sensor as the Galaxy Watch 7 and Galaxy Watch Ultra. Its battery is marginally larger, but the watch still lasted the same amount of time during our testing (a little over a day). Similarly, its screen has a maximum brightness of 3,000 nits as opposed to 2,000, but I couldn’t tell the difference even in direct sunlight. A new wellness feature within the Galaxy Watch 8 called the Antioxidant Index uses blue, yellow, and infrared LEDs within a sensor to measure the carotenoid levels of your skin. Carotenoids are a type of antioxidant that impacts the color of fruit. To take a reading, you press your thumb up against the sensor for about 10 seconds. However, in my tests the sensor could be fooled by pressing any colorful object against it, including a piece of broccoli, finger colored by a marker, and a Cheeze-It. Another new feature called Vascular Load measures how stressed your vascular system is by taking measurements while you sleep and exercise. It works, but Samsung is vague about what to do with this information. I did like the Galaxy Watch 8’s Running Coach feature, which creates a workout program based on how well you perform during a 12 minute test run. It gave me a fair assessment, and I found the workouts it suggested to be well-structured. The Galaxy Watch 8 ships with One UI 8 Watch, Samsung’s fork of Wear OS 6. One of the operating system update’s most significant new features is making Google Gemini accessible on your wrist. In my tests, which included asking the watch to create a 30-minute Kpop playlist and sending a message on Slack were a mixed bag. Read my full Galaxy Watch 8 review. For more outdoorsy folks, the $649.99 Galaxy Watch Ultra might be the more sensible choice. Of all Samsung’s watches, it has the best battery life, lasting around three days in our testing. (Though, we never got the full 100-hour estimated battery life.) It’s got dual-frequency GPS, a new multisport activity, an emergency siren, increased durability, 10ATM of water resistance, and a Quick Button, which acts as a customizable shortcut button. It’s basically an Apple Watch Ultra for Android. Samsung Galaxy Watch Ultra The Samsung Galaxy Watch Ultra is targeted at more outdoorsy folks with dual-frequency GPS, a new multisport activity, an emergency siren, and increased durability. Score: 7ProsConsLonger battery life than the regular Galaxy WatchDouble pinch is usefulAdds dual-frequency GPS and sleep apnea detectionCheaper than the Apple Watch UltraWhere is Samsung in this? The squircle chonk doesn’t fit small wristsSleep apnea feature is limited to Galaxy phonesAGEs metric is baffling Where to Buy: $649.99 at Amazon $649.99 at Samsung $649.99 at Best Buy The Samsung Health app also delivers a good overall fitness tracking experience, especially since you can enable turn-by-turn navigation for hiking and cycling activities. We weren’t too impressed with nightly SpO2 readings, but Samsung’s overall sleep tracking continues to improve. You also get built-in GPS, body composition analysis, irregular heart rate notifications, fall detection, emergency SOS features, and EKGs. Most recently, Samsung added a new Energy score, AI-powered wellness insights, FDA-cleared sleep apnea detection, and a confusing AGEs Index metric for metabolic health. While the Energy score is broadly accurate, I found the AI-generated features to be hit or miss and the AGEs Index to be more gimmicky than useful. The latter feature is also limited to the Galaxy Watch 7, Galaxy Watch 8, and Ultra. We don’t necessarily recommend the Galaxy Watches if you don’t have a Samsung phone. EKGs and sleep apnea detection require the Samsung Health Monitor app, which is limited to Samsung phones. You can work around it, but all Samsung watches work best with other Samsung devices. Best Android smartwatch for non-Samsung users Pixel Watch 3 (41mm, Bluetooth) The Pixel Watch 3 has a bright screen and access to Google Gemini. It’s slated to receive an update to Wear OS 6 later this year. Score: 8ProsConsWe finally get a bigger size!Moderate battery improvementsLots of neat Google integrationsGood running updatesReadiness and Cardio Load scores not locked behind paywallIt’s best with a Pixel phone Where to Buy: $349.99 $242.99 at Amazon $349.99 $249.99 at Best Buy $349.99 $249.99 at Google Sizes: 41mm, 45mm / Weight: 31g for 41mm, 37g for 45mm / Battery life: Roughly 24 hours with AOD enabled / Display type: Always-on OLED / GPS: Built-in GPS / Connectivity: LTE (optional), Bluetooth, Wi-Fi, Safety Signal with Fitbit Premium / Water resistance: 5ATM / Music storage: 32GB The $349.99 Google Pixel Watch 3 is done playing catch-up. It’s an annoying truth that if you have a Samsung phone, a Samsung smartwatch is probably the best choice for you. However, for everyone else, I highly recommend the Pixel Watch 3. There are several updates to the Pixel Watch 3, but the gist is that it’s a more refined watch than its predecessor. One major update is that there are now two sizes: 41mm and 45mm. You get extra screen real estate on the larger watch, but the bezels are also smaller on the 41mm model. (If you’re trying to pick between sizes, I prefer the 45mm.) The displays are brighter as well, ranging from a minimum of 1 nit to a maximum of 2,000 nits. Health and fitness also get several updates, especially for runners. There’s a Cardio Load metric that gauges the cardiovascular intensity of the exercises you’ve been doing over a set period of time. It’s similar to Garmin’s Training Load metric. You’re also given a Cardio Load target based on your fitness goals, readiness, and current activity. Runners also get a dashboard full of form analysis metrics as well as the ability to program custom workouts. In addition, you can get AI-generated suggested workouts. And if you’re in Europe or the US, the Pixel Watch 3 can detect if you no longer have a pulse and call emergency services. The Pixel Watch 3 also adds a bunch of nifty Google integrations. It’s excellent if you have a Google-powered smart home because you can now directly view and interact with your Nest Doorbell or camera feeds. You can also use the watch as a remote for your Google TV, and there are Google Home Tile / complications that make controlling your home from your wrist a breeze. There’s also offline Google Maps, the ability to unlock your Pixel phone hands-free, and a Call Assist feature that lets a caller know you need an extra minute to pick up your phone. A software update in June brought precise Bluetooth tracking to the device, so you can find it with “centimeter-level accuracy” with a device that supports Bluetooth 6.0. Google has committed to providing the Pixel Watch 3 with at least three years of software updates, the next of which includes Wear OS 6 later this year. Google already rolled out Gemini in a software update over the summer, and my colleague Allison Johnson had a so-so experience testing it out. Gemini on the wrist worked best when she asked low stakes questions, like asking where to get coffee, or whether you need to scrub a sweet potato before peeling it. It could add items to a calendar, but wasn’t able to find upcoming events. It shines when you take the time to experiment, which is something that not everyone wants to do. That said, while the Pixel Watch was initially framed as a watch for any Android phone, several updates this time around mean you’ll get the best experience with a Pixel phone. But compared to Samsung, there isn’t quite as much lock-in. Health features, for example, are available to everyone so long as you have a Fitbit account. Extra good news: Google removed certain metrics, like the Daily Readiness Score, from the Fitbit Premium paywall. Mostly, the features locked to Pixel phones are the Recorder app and things like the ability to unlock your phone with the watch. One thing to be mindful of is durability. Google doesn’t offer any repair options, but you can get the Preferred Care extended warranty if you want to be prepared should something happen. It’s not ideal since it’s limited to the US and Canada, but it’s a step in the right direction. For those who are thinking about what’s coming next, Google’s Pixel Watch 4 will arrive on October 9th. It starts at $349.99, and is available for preorder now. The Pixel Watch 4 will come in two sizes: 41mm and 45mm, both of which have brighter screens that have domed glass and thinner bezels. Google boasts that it should have a longer-lasting battery and faster charging, and that the Pixel Watch 4’s more powerful processor enables additional on-device smart replies. Notably, Google made repairability a focus with the Pixel Watch 4 by designing it with a replaceable battery and screen, which can be repaired instead of having to discard the device. Another hardware improvement is a subscription-free Satellite SOS mode, which allows LTE versions of the watch to connect emergency services even if you’re in a remote area without your phone or service. Read our hands on. Read my full Google Pixel Watch 3 review. Best alternative to Google and Samsung smartwatches OnePlus Watch 2 The OnePlus Watch 2 has Wear OS 4, multiday battery life, dual-frequency GPS, and helps fill the void left by Fossil exiting the Android smartwatch space. Score: 7ProsConsPraise be, the watch worksLong battery lifeLaunches with Google AssistantCompetitively pricedNo LTE optionAndroid onlyMissing EKGs, fall detectionOnly one size Where to Buy: $299.99 $227.43 at Amazon $299.99 at OnePlus Sizes: 47mm with 22mm straps / Weight: 49g case, 80g with strap / Battery life: Up to 100 hours in smart mode, 48 with AOD on, and 12 days in power-saving mode / Display type: OLED touchscreen / GPS: Dual-frequency GPS, Beidou, GPS, Galileo, GLONASS, QZSS / Connectivity: Bluetooth, Wi-Fi / Water resistance: 5ATM / Music storage: 32GB The $299.99 OnePlus Watch 2 is what a glow-up looks like. While the original OnePlus Watch was horrible, this watch helps fill the void that Fossil left when it said it was pulling out of Android smartwatches — namely, a viable alternative to Google and Samsung. The 47mm case is big for petite wrists, and unfortunately, it only comes in one size, but it’s made of durable stainless steel and sapphire crystal. Plus, it houses a 500mAh battery. That, plus a dual-chip architecture and novel dual OS system, results in super long battery life. How long a smartwatch lasts will, of course, depend on your individual usage, but I got nearly four days with normal use. That’s incredible for a flagship. On the fitness side of things, OnePlus added dual-frequency GPS. That’s a plus if you’re outdoorsy and frequent challenging GPS environments like dense forests or crowded cities. The main things you’re giving up in the Watch 2 are LTE connectivity and some features like EKGs, atrial fibrillation detection, native period tracking, and fall detection. The lack of cellular is a bummer, as it means you really should keep your phone on you when you’re out and about. Still, the $300 price tag is a competitive one and may be worth the trade-off given battery life. Something to note: it still runs Wear OS 4, which was originally released in 2023. OnePlus spokesperson Tyler Mallery confirmed to The Verge that a Wear OS 5 update is still on track to come in the “near future,” although the company declined to share a more detailed answer. You’ll find this software in OnePlus’ newer Watch 3 right now. The OnePlus Watch 3 ($299.99) is now available from OnePlus and at Amazon (and you might find a discount that brings it pretty close to the price of the older Watch 2). It features a rotating crown that actually scrolls, improved battery life, Wear OS 5, a better GPS antenna, and a bunch of new health features. If you want to learn more, here’s my hands-on. Read my full OnePlus Watch 2 review. Best fitness smartwatch for Android Mobvoi TicWatch Pro 5 Mobvoi’s TicWatch Pro 5 has superior battery life, excellent fitness tracking, and Qualcomm’s Snapdragon W5 Plus chip. Score: 7ProsConsTruly multiday battery lifeW5 Plus chip helps to futureproofGood health tracking updatesThe ULP display has an ingenious way of displaying heart rate zonesDigital crown!Why so many apps??W5 Plus doesn’t get you a huge performance bumpNo digital assistant Where to Buy: $349.99 $109.99 at Amazon $349.99 $109.99 at Mobvoi $349.99 $139.5 at Walmart Sizes: 50mm with 24mm straps / Weight: 44.3g / Battery life: Up to 80 hours / Display type: OLED touchscreen and secondary ultra-low power display / GPS: GPS, GLONASS, GALILEO, Beidou / Connectivity: Bluetooth, Wi-Fi / Water resistance: 5ATM / Music storage: 32GB Mobvoi’s TicWatch lineup has its devoted fans for a reason: super long battery life. The $349.99 TicWatch Pro 5 is no exception. It’s got an estimated 80 hours of battery life with standard use, a secondary ultra-low power display, and a massive (for a smartwatch you wear on your wrist, at least) 628mAh battery. I didn’t quite get 80 hours in my testing, but I did get a solid 48-60 hours with heavy GPS use. That outclasses most of the watches in this category (except the OnePlus Watch 2) and is useful for backpackers and endurance athletes. It might not hold a candle to a top-of-the-line Garmin, but it’s also a smarter watch for a fraction of the price. Battery life aside, the Pro 5 is a good option for fitness-focused people who aren’t keen on giving up smart capabilities for a Garmin or Polar. It’s also more durable. This time around, Mobvoi has also added a digital crown so you don’t have to worry about scrolling through menus with sweaty fingers. The flatter side button also reduces the risk of accidental presses. The Pro 5 also has an ingenious method of displaying heart rate. When you lift up your arm, the backlight changes color depending on which heart rate zone you’re in. That means you can instantly gauge whether to up the intensity or slow your roll. The Pro 5 also adds training metrics, like VO2 Max and recovery time. The TicWatch supports stress tracking, all-day blood oxygen monitoring, fatigue assessments, as well as atrial fibrillation and irregular heartbeat detection. For outdoorsy types, it also has access to multiple GNSS systems, and there’s a barometer and compass app, as well as a one-tap measurement app that gives you a quick look at five metrics (heart rate, blood oxygen, stress, respiratory rate, and overall heart health). It’s also pretty capable on the productivity front. You get contactless payments, access to the Play Store, notifications, and the ability to take calls. It runs on W5 Plus chip, which is a more powerful version of the chip inside the Google Pixel 3 and OnePlus Watch 2. This is a plus in terms of hardware futureproofing. However, it’s lagging behind in terms of software. The watch received an update to Wear OS 4 over a year after its release, although it’s unclear if it will support Wear OS 5, much less Wear OS 6. The Verge reached out for a comment on an update roadmap, but Mobvoi didn’t respond in time for publishing. Two other major concerns are the 50mm case that may not suit smaller wrists and the lack of a digital assistant. The Pro 5 has also seen a steady price drop since the start of the year, and it’s regularly available for under $150. Read my full Mobvoi TicWatch Pro 5 review. Best hybrid smartwatch Withings ScanWatch Light The Withings Scanwatch Light is a hybrid analog smartwatch that tracks the basics like steps and activities, while delivering up to 30 days of battery life. Score: 7ProsConsLong battery lifeAlso gets you lots of complimentsComfortable to wearGreat priceAdds period trackingHas fewer sensors than the ScanWatch 2Again, the OLED display is tiny Where to Buy: $249.99 at Amazon $249.99 at Target $249.95 at Withings Sizes: 37mm with 18mm straps / Weight: 45g / Battery life: Up to 39 days / Display type: OLED display / GPS: Tethered GPS / Connectivity: Bluetooth / Water resistance: 5ATM / Music storage: N/A Hybrid smartwatches are an excellent way to keep things simple and subtle. The $249.95 Withings ScanWatch Light gets you the basics like push notifications, timers, and alarms. On the health front, you can track steps, sleep, menstrual cycles, and GPS workouts. (That said, GPS is tethered from your phone, not built in.) The design reminds me of a classier Swatch, particularly if you get the more colorful options in a minty green or pale blue. But the big reason the Light has dethroned our previous pick, the Garmin Vivomove Sport, is its extra-long battery life. Withings estimates it lasts up to 30 days on a single charge, and I got pretty close to that in testing with 25 days. Despite the Vivomove’s more appealing $180 price tag, it only lasts about five days. If you want a bit more out of a hybrid, you can also opt for the ScanWatch 2. It’s an extra $120, but you get EKGs and atrial fibrillation detection, temperature sensors, SpO2 readings, and an altimeter for measuring elevation. It also looks a bit more elegant on the wrist, partly because of a secondary dial that tracks your daily step progress. If neither matches your style, the Vivomove Sport is still a good option that gets you access to Garmin’s in-depth platform. Its Vivomove Trend is a slightly more upscale option that also supports Qi charging. Read my full Withings ScanWatch Light review. Best platform-agnostic fitness smartwatch Garmin Venu 3S The Garmin Venu 3S adds a heart rate sensor, a wheelchair mode, and much-improved sleep tracking and nap detection. Score: 7ProsConsGood battery lifeBetter sleep tracking and nap detectionEKG and AFib featuresCan take calls and use your phone’s voice assistantAudio meditation sessions done wellPricey compared to other lifestyle smartwatchesLimited third-party app ecosystemNo LTE capability Where to Buy: $449.99 $398.99 at Amazon $449.99 $398.99 at Walmart $449.99 at Best Buy Sizes: 41mm with 18mm straps; 45mm with 22mm straps / Weight: 40g for the 3S; 47g for the 3 / Battery life: Up to 10 days for 3S; 14 days for 3 / Display type: OLED touchscreen / GPS: GPS, GLONASS, GALILEO / Connectivity: Bluetooth, Ant Plus, Wi-Fi / Water resistance: 5ATM / Music storage: 8GB Garmin is best known for making rugged GPS watches that have excellent fitness features but aren’t so smart otherwise. But the $449.99 Venu 3 caters to people who want top-notch fitness tracking without sacrificing productivity features. It’s got a colorful and vibrant always-on OLED display and comes in two sizes: 41mm and 45mm. Like its predecessor, the Venu 2 Plus, it also has a microphone and speaker so you can take and make calls directly from the wrist. It also has a clever workaround for digital assistants — it uses Bluetooth to work with whatever assistant is already on your phone. You’d think more fitness trackers would do this, but they don’t. It worked well in testing, though digital assistants aren’t always the smartest at understanding commands. The Venu 3 doesn’t have the best third-party app ecosystem, but it has Spotify, Deezer, and Amazon Music for offline playback. Android users can also send quick responses for texts, and the watch works with either iOS or Android for folks who want to keep their options open. It also has fall detection, live tracking, and contactless payments. As for health features, it has Garmin’s latest heart rate sensor, which enables its FDA-cleared EKG app to detect atrial fibrillation. Otherwise, you get built-in GPS, continuous heart rate monitoring, all of the advanced coaching features in the Garmin Connect app, and Garmin’s famous in-depth health data. The Venu 3 also improves sleep tracking with nap detection and adds audio-guided meditation sessions. There’s also a new wheelchair mode. This isn’t the most hardcore Garmin that money can buy, but it’s definitely one of the smartest. The price is a bit high compared to most smartwatches, but by Garmin standards, it’s middle-of-the-pack. If you need a bigger screen, Garmin just released the Venu X1, a GPS smartwatch with a 51mm display. Garmin says it can last up to eight days per charge, and Pulse Ox sensor, but cannot take an EKG. The Venu X1 is available for $799.99 at Amazon and Best Buy. Read my full Garmin Venu 3S review. Best budget Android smartwatch Amazfit Active 2 The Amazfit Active 2 delivers outsized value for the price. It looks spiffy and has a wide array of health tracking features, plus built-in GPS and AI chatbots to provide extra context to your data. Score: 7ProsConsStacked feature set for the priceLooks spiffyGood battery lifeTouchscreen and voice commands are finickyCan’t edit workoutsAI chatbots are meh Where to Buy: $99.99 $89.99 at Amazon $99.99 $89.99 at Walmart $99.99 at Amazfit Size: 43mm w/ 20mm straps / Weight: 29.5g for standard, 31.7g for premium / Battery life: Up to 10 days / Display type: OLED touchscreen / GPS: Five GNSS systems / Connectivity: Bluetooth, Wi-Fi / Water resistance: 5ATM / Music storage: N/A Amazfit’s made a name for itself making budget wearables that punch far above their weight. The $99.99 Amazfit Active 2 is no exception. The Active 2 is a surprisingly spiffy watch considering its price. The standard version has a stainless steel case with tempered glass, and if you shell out $50 extra, you can get the premium model with sapphire crystal and an extra leather strap at Amazon and Amazfit. Normally, I don’t get compliments while wearing budget smartwatches, but I got several while wearing this one. While it doesn’t run Wear OS, its proprietary Zepp OS makes for a platform-agnostic smartwatch. Feature-wise, you get all the basics and then some. That includes things like continuous heart rate monitoring, blood oxygen rate, heart rate variability, stress tracking, alerts for abnormally high and low heart rate, and skin temperature tracking. You also get offline maps with turn-by-turn navigation, 160 different sport activity profiles, and a strength training activity that automatically tracks reps. The Active 2 doesn’t have dual-frequency GPS, but it has the next best thing: access to all five of the major GNSS satellite systems. As far as health tracking goes, it also emphasizes trendy metrics like a readiness score and has a revamped sleep tracking algorithm. Battery life is estimated at about 10 days, though as a heavy user, I got around eight to nine in my testing. Something that sets the Active 2 apart at this price range is access to an AI assistant on wrist and AI chatbots within the Zepp app. The Zepp Flow assistant (on wrist) is a little finicky, but you can use it to control your watch’s on-device settings and basic queries like asking for the weather. The Zepp Aura AI bot costs an extra $77 yearly, and you can ask it to deliver insights into your readiness and sleep scores. I found it hit or miss, but at least it’s well-integrated into the app, snappy, and most importantly, optional. More useful is the Zepp Coach, which you can use to generate custom training plans. All in all, I don’t have much to gripe about this watch, which is wild given how affordable it is. It certainly delivers an outsized bang for your buck. Just make sure you wipe off any sweaty fingers, since its touchscreen doesn’t handle them well. Read my full Amazfit Active 2 review. Update, September 26th: Adjusted pricing/availability and reflect recent happenings in the space, particularly the Google Pixel Watch 4’s announcement and a comment on Wear OS 5 coming to the OnePlus Watch 2. Brandt Ranj also contributed to this post.",
          "feed_position": 3
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/best-early-best-buy-deals-october-prime-day/",
          "published_at": "Fri, 26 Sep 2025 17:52:23 GMT",
          "title": "Top Best Buy deals ahead of Amazon Prime Day 2025: My 23 favorite sales before October",
          "standfirst": "October Prime Day is coming soon, and Best Buy is expected to run its own sale with major discounts on everything from laptops to TVs. These are our favorite Best Buy deals so far.",
          "content": "October Prime Day is coming soon, and Best Buy is expected to run its own sale with major discounts on everything from laptops to TVs. These are our favorite Best Buy deals so far.",
          "feed_position": 6
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/best-early-amazon-prime-day-pc-gaming-deals/",
          "published_at": "Fri, 26 Sep 2025 17:00:00 GMT",
          "title": "Best early October Prime Day 2025 PC gaming deals: Save big on laptops and accessories",
          "standfirst": "October Prime Day is just around the corner, and you can already find great discounts on gaming desktops, laptops, and accessories at Amazon.",
          "content": "October Prime Day is just around the corner, and you can already find great discounts on gaming desktops, laptops, and accessories at Amazon.",
          "feed_position": 7
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/best-early-prime-day-2025-tv-deals/",
          "published_at": "Fri, 26 Sep 2025 16:24:00 GMT",
          "title": "Best early October Prime Day TV deals 2025: All time low prices from Samsung, LG, and more",
          "standfirst": "Amazon's October Prime Day sale is still a few weeks away, but you can already find steep markdowns on both premium and entry-level TVs from brands like Samsung, LG, Hisense, and more.",
          "content": "Amazon's October Prime Day sale is still a few weeks away, but you can already find steep markdowns on both premium and entry-level TVs from brands like Samsung, LG, Hisense, and more.",
          "feed_position": 14
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/best-early-amazon-october-prime-day-laptop-deals/",
          "published_at": "Fri, 26 Sep 2025 16:07:00 GMT",
          "title": "Best early Amazon Prime Day laptop deals 2025: My 30 favorites sales ahead of October",
          "standfirst": "Amazon October Prime Day is around the corner, but the laptop deals are already heating up. Here are the best we've found, from Apple, Lenovo, HP, and more.",
          "content": "Amazon October Prime Day is around the corner, but the laptop deals are already heating up. Here are the best we've found, from Apple, Lenovo, HP, and more.",
          "feed_position": 15
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/best-early-amazon-october-prime-day-deals/",
          "published_at": "Fri, 26 Sep 2025 15:53:39 GMT",
          "title": "Best early Amazon Prime Day deals 2025: Our 50+ favorite sales ahead of October",
          "standfirst": "Amazon's fall Prime Day event returns Oct. 7 and 8, but some deals are already live. These are our favorite sales on tech, home, and more so far.",
          "content": "Amazon's fall Prime Day event returns Oct. 7 and 8, but some deals are already live. These are our favorite sales on tech, home, and more so far.",
          "feed_position": 16
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/786445/amazon-fire-tv-stick-4k-max-october-prime-day-deals-sale",
          "published_at": "2025-09-26T11:51:01-04:00",
          "title": "Amazon’s Fire TV Stick 4K Max is already $20 off ahead of Amazon’s fall Prime Day event",
          "standfirst": "Amazon’s fall Prime Day event is now less than two weeks away, but we’re already seeing prices drop on everything from chargers to Apple devices. One notable deal, especially if you need a streaming stick before October 7th, is on Amazon’s Fire TV Stick 4K Max. Normally $59.99, right now you can buy it for [&#8230;]",
          "content": "Amazon’s Fire TV Stick 4K Max on sale for $39.99. Amazon’s fall Prime Day event is now less than two weeks away, but we’re already seeing prices drop on everything from chargers to Apple devices. One notable deal, especially if you need a streaming stick before October 7th, is on Amazon’s Fire TV Stick 4K Max. Normally $59.99, right now you can buy it for just $39.99 at Amazon, Best Buy, and Target, which is just $5 shy of its July Prime Day price. Amazon Fire TV Stick 4K Max (2023) Amazon’s latest streaming stick is faster than its predecessor with Wi-Fi 6E and double the storage. It also now displays widgets and artwork when idle while continuing to offer Alexa integration. Read our review. Where to Buy: $59.99 $39.99 at Amazon $59.99 $39.99 at Best Buy $59.99 $39.99 at Target The 4K streaming device is even better than its top-notch predecessor, building upon it with faster performance, Wi-Fi 6E support, and double the storage (16GB). At the same time, it continues to deliver an excellent viewing experience thanks to support for Dolby Atmos, Dolby Vision, and HDR 10 Plus. On top of that, the device retains deep integration with Amazon Alexa, letting you make precise commands like “Alexa, turn to ESPN on Sling TV” using the included Alexa Voice Remote. What makes the Fire TV Stick 4K Max even more interesting is that it’s more than just a streaming device. The Max lets you turn your screen into a smart display, letting you control compatible smart home devices and quick glance at reminders, your calendar, weather updates, and more. It even lets you turn your screen into a piece of home decor, one that showcases over 2,000 works of fine art, family photos, or even custom AI-generated images created through Alexa.",
          "feed_position": 9
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/early-prime-day-deals-october-2025/",
          "published_at": "Thu, 25 Sep 2025 09:01:00 +0000",
          "title": "30 Best Early Amazon Prime Day Deals on WIRED-Tested Gear (2025)",
          "standfirst": "Amazon Prime Day is back on October 7, but we've already found good deals on WIRED-approved gear.",
          "content": "Amazon Prime Day is back on October 7, but we've already found good deals on WIRED-approved gear.",
          "feed_position": 39,
          "image_url": "https://media.wired.com/photos/68d4de9ebe1b0c652d7b3103/master/pass/The%20Best%20Early%20Amazon%20Prime%20Day%20Deals.png"
        }
      ],
      "featured_image": "https://media.wired.com/photos/68d4de9ebe1b0c652d7b3103/master/pass/The%20Best%20Early%20Amazon%20Prime%20Day%20Deals.png",
      "popularity_score": 3019.2214444444444,
      "ai_summary": [
        "Amazon Prime Day is in October, but deals are already available.",
        "ZDNet highlights 23 favorite Samsung deals ahead of the event.",
        "Deals include smartphones, tablets, and wearable devices.",
        "The article provides a curated list of early deals.",
        "The deals are available before the official Prime Day sale."
      ]
    },
    {
      "id": "cluster_1",
      "coverage": 2,
      "updated_at": "Fri, 26 Sep 2025 19:02:02 +0000",
      "title": "YouTube Music tests AI hosts that share trivia and commentary",
      "neutral_headline": "YouTube Music tests AI hosts that share trivia and commentary",
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/09/26/youtube-music-tests-ai-hosts-that-share-trivia-and-commentary/",
          "published_at": "Fri, 26 Sep 2025 19:02:02 +0000",
          "title": "YouTube Music tests AI hosts that share trivia and commentary",
          "standfirst": "YouTube Music's new AI hosts are currently being tested through YouTube Labs, the platform's new hub for AI experiments.",
          "content": "YouTube Music's new AI hosts are currently being tested through YouTube Labs, the platform's new hub for AI experiments.",
          "feed_position": 0
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/786697/youtube-labs-ai-experiment-music-radio-hosts",
          "published_at": "2025-09-26T14:26:36-04:00",
          "title": "YouTube’s new AI experiment adds AI hosts to your music",
          "standfirst": "YouTube is adding AI hosts to radio and mixes in the YouTube Music app as part of a new test available through its new Labs program. The hosts are designed to “deepen your listening experience by sharing relevant stories, fan trivia, and fun commentary about your favorite music,” YouTube says in a blog post. If [&#8230;]",
          "content": "YouTube is adding AI hosts to radio and mixes in the YouTube Music app as part of a new test available through its new Labs program. The hosts are designed to “deepen your listening experience by sharing relevant stories, fan trivia, and fun commentary about your favorite music,” YouTube says in a blog post. If you want to see if you’re eligible to join YouTube Labs, which is dedicated to AI-focused experiments on the platform, to potentially try the feature out, check YouTube’s website; through the program, “a limited number of US-based participants can test early prototypes and experiments,” according the blog post. Even though I joined YouTube Labs, I don’t seem to have access to the experiment myself. I’ve been playing YouTube Music off my phone for a little while writing this article, and I haven’t heard the hosts just yet. Google has been steadily expanding the capabilities of the AI hosts with NotebookLM to help users review and study different topics, so trying out a similar idea to YouTube Music makes some sense. The new YouTube Labs program also follows Google’s broader Labs program for its AI experiments. Today, YouTube also announced that some of its Premium-only features have expanded to more platforms. For example, the jump ahead feature, which uses AI to skip to the most interesting part of a video, is now “fully available” on YouTube for TV and game consoles, YouTube says. (The feature started showing up for some TV users earlier this year.)",
          "feed_position": 1
        }
      ],
      "popularity_score": 2019.7856111111112,
      "ai_summary": [
        "YouTube Music is testing AI hosts in its app.",
        "The hosts share trivia and commentary about music.",
        "The test is part of YouTube's Labs program.",
        "The hosts are designed to enhance listening experiences.",
        "The hosts provide stories and fan trivia."
      ]
    },
    {
      "id": "cluster_13",
      "coverage": 2,
      "updated_at": "Fri, 26 Sep 2025 14:20:01 -0400",
      "title": "A US court rules that the DOD can classify DJI as a \"Chinese Military Company\", finds that there is enough evidence that DJI is supported by Chinese government (Sean Hollister/The Verge)",
      "neutral_headline": "A US court rules that the DOD can classify DJI as a \"Chinese Military Company\", finds that there is enough evidence that DJI is supported by Chinese government (Sean Hollister/The Verge)",
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/250926/p20#a250926p20",
          "published_at": "Fri, 26 Sep 2025 14:20:01 -0400",
          "title": "A US court rules that the DOD can classify DJI as a \"Chinese Military Company\", finds that there is enough evidence that DJI is supported by Chinese government (Sean Hollister/The Verge)",
          "standfirst": "Sean Hollister / The Verge: A US court rules that the DOD can classify DJI as a &ldquo;Chinese Military Company&rdquo;, finds that there is enough evidence that DJI is supported by Chinese government &mdash; DJI loses its lawsuit against the US government. &hellip; Last October, dronemaker DJI sued the US Department of Defense &hellip;",
          "content": "Sean Hollister / The Verge: A US court rules that the DOD can classify DJI as a &ldquo;Chinese Military Company&rdquo;, finds that there is enough evidence that DJI is supported by Chinese government &mdash; DJI loses its lawsuit against the US government. &hellip; Last October, dronemaker DJI sued the US Department of Defense &hellip;",
          "feed_position": 1,
          "image_url": "http://www.techmeme.com/250926/i20.jpg"
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/786540/dji-loses-chinese-military-company-lawsuit-dod",
          "published_at": "2025-09-26T13:29:15-04:00",
          "title": "Pentagon can call DJI a Chinese Military Company, court rules",
          "standfirst": "Last October, dronemaker DJI sued the US Department of Defense, arguing it should no longer face the stigma of being listed as a “Chinese Military Company” and continue to risk business as a result. It just lost. While US District Court judge Paul Friedman “cannot conclude” that DJI is “indirectly owned by the Chinese Communist [&#8230;]",
          "content": "Last October, dronemaker DJI sued the US Department of Defense, arguing it should no longer face the stigma of being listed as a “Chinese Military Company” and continue to risk business as a result. It just lost. While US District Court judge Paul Friedman “cannot conclude” that DJI is “indirectly owned by the Chinese Communist Party,” he found that the DoD has broad discretion to decide which companies do and do not belong on the list of Chinese military companies. Friedman concluded there was enough evidence that DJI is supported and recognized by the Chinese government to call it a “a military-civil fusion contributor,” and that state-sponsored entity Chengtong has “some unspecified ownership stake” in the company. Just being a “military-civil fusion contributor” is enough to label it a Chinese Military Company as well, according to the rules (section 1260H) for that designation. He also rejected quite a few of the DoD’s other claims for insufficient evidence, and pointed out that it confused two of China’s different industrial development zones when trying to prove DJI’s factories were located in a special state-sponsored zone. But the fact that China’s National Development and Reform Commission designates DJI as a “National Enterprise Technology Center,” which gives it large cash subsidies, “special financial support” and “a large number of tax benefits” was enough for this judge to agree that the DoD can call it a Chinese Military Company if it wants. And though DJI argued that the Chinese arms of Volkswagen and Nokia aren’t being treated the same way despite their “similar attributes,” Friedman says the DoD has “broad discretion to decide to place X onthe list, while also deciding not to place Y on the list.” This is just the latest blow against DJI in the United States, where it faces a total import ban on new products this December, and where US customs has already stopped blocking many consumer drone shipments, to the point that shelves have gone bare, scammers are setting up shop, loopholes may be getting exploited, and DJI doesn’t bother launching new drones here at all. But it is a decision that DJI could possibly appeal, and we’ve asked the company if it will. You can read the judge’s full opinion, including his overview of various kinds of evidence presented by the DoD and DJI, below.",
          "feed_position": 5
        }
      ],
      "featured_image": "http://www.techmeme.com/250926/i20.jpg",
      "popularity_score": 2019.0853333333334,
      "ai_summary": [
        "A US court ruled DJI can be classified as a Chinese Military Company.",
        "The court found evidence of Chinese government support for DJI.",
        "DJI lost its lawsuit against the US government.",
        "DJI had sued the US Department of Defense.",
        "The lawsuit challenged the \"Chinese Military Company\" designation."
      ]
    },
    {
      "id": "cluster_11",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 18:25:05 +0000",
      "title": "Ebola outbreak in DR Congo rages, with 61% death rate and funding running dry",
      "neutral_headline": "Ebola outbreak in DR Congo rages, with 61% death rate and funding running dry",
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/health/2025/09/ebola-outbreak-in-dr-congo-rages-with-61-death-rate-and-funding-running-dry/",
          "published_at": "Fri, 26 Sep 2025 18:25:05 +0000",
          "title": "Ebola outbreak in DR Congo rages, with 61% death rate and funding running dry",
          "standfirst": "Responders ask for $25 million to contain the disease. They have $2.2 million.",
          "content": "An Ebola outbreak in a southwestern province of the Democratic Republic of the Congo is escalating quickly, as some health responders say they have less than a tenth of the funding needed to contain the deadly disease. The first case was identified in a 34-year-old pregnant woman on August 20, when she sought care at a local hospital in the Kasai province for fever, bloody vomiting, and hemorrhages. She died on August 25. Officials declared an outbreak on September 4, when the case tally was up to 28 with 15 deaths. As of this week, there have been at least 57 cases and 35 deaths—a 61 percent fatality rate, according to the World Health Organization (WHO). Officials in DR Congo are struggling to respond to the outbreak, which is in a province known for its poor road networks, according to reporting by The Associated Press. Treating Ebola can require extensive resources, including protective equipment, medicines, and transportation to reach remote areas. Health facilities in the area of the outbreak are already overwhelmed and quickly running low on critical resources, including clean water and protective equipment. The only treatment center in the epicenter of the outbreak, the Bulape health zone, is at 119 percent capacity, the AP reported, citing information from the International Federation of Red Cross and Red Crescent Societies Africa (IFRC).Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2014/11/13717624625_c584569b9b_k-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2014/11/13717624625_c584569b9b_k-1152x648.jpg",
      "popularity_score": 352.16977777777777,
      "ai_summary": [
        "An Ebola outbreak is ongoing in the DR Congo.",
        "The death rate from the outbreak is 61%.",
        "Responders are requesting $25 million in funding.",
        "They currently have only $2.2 million in funding.",
        "The outbreak requires urgent containment efforts."
      ]
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 16:25:10 +0000",
      "title": "Trump says TikTok should be tweaked to become “100% MAGA”",
      "neutral_headline": "Trump Suggests TikTok Changes, Cites China Approval for Deal",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/09/trump-says-tiktok-should-be-tweaked-to-become-100-maga/",
          "published_at": "Fri, 26 Sep 2025 16:25:10 +0000",
          "title": "Trump says TikTok should be tweaked to become “100% MAGA”",
          "standfirst": "Uncertainty reigns as Trump claims China approved TikTok deal.",
          "content": "Fresh off Jimmy Kimmel returning to TV to warn that Donald Trump's attacks on free speech would not end with censoring comedians critical of his administration, Trump signed an executive order to \"save\" TikTok, while supposedly joking that he'd like to censor influencers by tweaking the algorithm so that content is \"100 percent MAGA.\" \"Everyone is going to be treated fairly,\" the president added—seemingly covering his tracks as critics warn that TikTok under US ownership could soon carry a right-wing bias, perhaps going the way of Twitter after Elon Musk took over and rebranded it as X. On Sunday, Trump told Fox News that media mogul Rupert Murdoch and his son Lachlan, the CEO of Fox Corporation, would likely be part of the investor group taking over TikTok's US operations. That deal—which Trump claimed Thursday was tentatively approved by Chinese President Xi Jinping—was set up to ensure that TikTok complies with a law banning majority ownership of the app by a foreign adversary in order to protect Americans from spying or foreign influence on the algorithm.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2237018670-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2237018670-1024x648.jpg",
      "popularity_score": 340.1711666666667,
      "ai_summary": [
        "Trump stated TikTok should be adjusted to align with his \"MAGA\" ideology.",
        "He claimed China approved the deal, but details remain unclear.",
        "The future of TikTok in the United States is uncertain.",
        "Trump's comments add to the ongoing debate about the platform.",
        "The situation highlights the complex relationship between technology and politics."
      ]
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 15:48:36 +0000",
      "title": "Scientists want to treat complex bone fractures with a bone-healing gun",
      "neutral_headline": "Scientists Develop Bone-Healing Gun for Complex Fractures",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/09/scientists-want-to-treat-complex-bone-fractures-with-a-bone-healing-gun/",
          "published_at": "Fri, 26 Sep 2025 15:48:36 +0000",
          "title": "Scientists want to treat complex bone fractures with a bone-healing gun",
          "standfirst": "It's a bit like a handheld 3D printer, with all the accuracy challenges that implies.",
          "content": "Most guns are tools for doing harm, but a team of American and Korean scientists has developed one that does the opposite, helping to patch up bone injuries. It comes a bit short of the Medigun from Team Fortress 2 or Ana’s Biotic Rifle, which featured in Overwatch. But it’s probably one of the first shots we have at making healing guns real. 3D printing on the fly In more complex bone problems like severe, irregular fractures or resections done as part of bone cancer treatment, the bone won’t heal on its own. The most common means of stabilizing the injured site and making recovery possible is metal-based grafts, implants usually made with titanium alloys. The problem with such implants is that they are difficult and expensive to manufacture, and it’s very hard to make them patient-specific. “3D printing has been highlighted as a novel approach to make such personalized implants, but this also requires substantial time and money,” said Jung Seung Lee, a biomedical engineering researcher at the Sungkyunkwan University in Korea. So his team wanted to find a way to make bone implants that would be faster and cheaper than a 3D printer.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1572413945-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1572413945-1024x648.jpg",
      "popularity_score": 329.5617222222222,
      "ai_summary": [
        "Scientists are developing a handheld device to treat complex bone fractures.",
        "The device functions similarly to a 3D printer, applying materials precisely.",
        "Accuracy challenges are present, mirroring those in 3D printing.",
        "The technology aims to improve bone healing processes.",
        "The device's development is ongoing, with potential for future use."
      ]
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 14:42:12 +0000",
      "title": "50+ scientific societies sign letter objecting to Trump executive order",
      "neutral_headline": "Scientific Societies Object to Trump Executive Order in Letter",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/09/50-scientific-societies-sign-letter-objecting-to-trump-executive-order/",
          "published_at": "Fri, 26 Sep 2025 14:42:12 +0000",
          "title": "50+ scientific societies sign letter objecting to Trump executive order",
          "standfirst": "Letter urges Congress to take action to safeguard integrity of independent peer-review system.",
          "content": "Last month, the Trump administration issued an executive order asserting political control over grant funding, including all federally supported research. In general, the executive order inserts a layer of political control over both the announcement of new funding opportunities and the approval of individual grants. Now, a coalition of more than 50 scientific and medical organizations is firing back, issuing a letter to the US Congress expressing grave concerns over the order's provisions and urging Congress to protect the integrity of what has long been an independent, merit-based, peer-review system for awarding federal grants. As we previously reported, the order requires that any announcement of funding opportunities be reviewed by the head of the agency or someone they designate, which means a political appointee will have the ultimate say over what areas of science the US funds. Individual grants will also require clearance from a political appointee and \"must, where applicable, demonstrably advance the President’s policy priorities.\" The order also instructs agencies to formalize the ability to cancel previously awarded grants at any time if they're considered \"no longer advance agency priorities.\" Until a system is in place to enforce the new rules, agencies are forbidden from starting new funding programs.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/GettyImages-2198935406-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/GettyImages-2198935406-1152x648.jpg",
      "popularity_score": 318.45505555555553,
      "ai_summary": [
        "Over fifty scientific societies signed a letter opposing a Trump executive order.",
        "The letter urges Congress to protect the integrity of peer-review systems.",
        "The societies express concerns about the order's potential impact.",
        "They advocate for independent and unbiased scientific processes.",
        "The letter highlights the importance of scientific integrity in policy."
      ]
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 13:06:46 +0000",
      "title": "Asus’ new ROG Xbox Ally X set to break the bank at $999.99",
      "neutral_headline": "Asus ROG Xbox Ally X Gaming Device Priced at $999.99",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/09/ready-for-a-1000-handheld-gaming-pc-asus-rog-xbox-ally-x-set-to-find-out/",
          "published_at": "Fri, 26 Sep 2025 13:06:46 +0000",
          "title": "Asus’ new ROG Xbox Ally X set to break the bank at $999.99",
          "standfirst": "The lower-powered ROG Xbox Ally comes in at a more reasonable $599.99.",
          "content": "Microsoft and Asus revealed the ROG Xbox Ally handheld PC gaming line in June and promised an October 16 launch date in August. But they waited all the way until Thursday night to reveal preorder pricing set at $599.99 for the base ROG Xbox Ally hardware and a whopping $999.99 for the souped-up ROG Xbox Ally X. Those prices put the baseline ROG Xbox Ally units in the same general price tier as competition like Valve's Steam Deck OLED, Lenovo's Legion Go S, and even Nintendo's Switch 2. But the higher-grade ROG Xbox Ally X is significantly more expensive than almost all competing gaming handhelds, thanks in part to components like a Ryzen Z2 Extreme processor and an NPU that Asus says will ensure it is ready for a future when \"AI enhancements\" are rolling out in new games. That may seem like overkill when Steam Deck users seem content using their handheld mainly for low-end games like Vampire Survivors and Hades. But Asus said that, in pre-release hardware tests, the ROG Xbox Ally X gets \"up to a 30% performance boost\" over 2024's ROG Ally X on high-end games like Indiana Jones and the Great Circle. The newer hardware also gets \"up to twice the battery life\" over the ROG Ally X on a game like Hollow Knight Silksong, Asus said.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/ROG-Xbox-Ally-X_PR2-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/ROG-Xbox-Ally-X_PR2-1152x648.jpeg",
      "popularity_score": 306.8645,
      "ai_summary": [
        "Asus's new ROG Xbox Ally X gaming device will cost $999.99.",
        "A lower-powered version of the ROG Xbox Ally is priced at $599.99.",
        "The higher-priced model offers enhanced features and capabilities.",
        "The pricing reflects the device's target market and specifications.",
        "Consumers have a choice between two versions with different price points."
      ]
    },
    {
      "id": "cluster_70",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 12:45:58 +0000",
      "title": "Rocket Report: Keeping up with Kuiper; New Glenn’s second flight slips",
      "neutral_headline": "Rocket Report: Kuiper Launches; New Glenn Flight Delayed",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/09/rocket-report-keeping-up-with-kuiper-new-glenns-second-flight-slips/",
          "published_at": "Fri, 26 Sep 2025 12:45:58 +0000",
          "title": "Rocket Report: Keeping up with Kuiper; New Glenn’s second flight slips",
          "standfirst": "Amazon plans to conduct two launches of Kuiper broadband satellites just days apart.",
          "content": "Welcome to Edition 8.12 of the Rocket Report! We often hear from satellite operators—from the military to venture-backed startups—about their appetite for more launch capacity. With so many rocket launches happening around the world, some might want to dismiss these statements as a corporate plea for more competition, and therefore lower prices. SpaceX is on pace to launch more than 150 times this year. China could end the year with more than 70 orbital launches. These are staggering numbers compared to global launch rates just a few years ago. But I'm convinced there's room for more alternatives for reliable (and reusable) rockets. All of the world's planned mega-constellations will need immense launch capacity just to get off the ground, and if successful, they'll go into regular replacement and replenishment cycles. Throw in the still-undefined Golden Dome missile shield and many nations' desire for a sovereign launch capability, and it's easy to see the demand curve going up. As always, we welcome reader submissions. If you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar. Sharp words from Astra’s Chris Kemp. Chris Kemp, the chief executive officer of Astra, apparently didn't get the memo about playing nice with his competitors in the launch business. Kemp made some spicy remarks at the Berkeley Space Symposium 2025 earlier this month, billed as the largest undergraduate aerospace event at the university (see video of the talk). During the speech, Kemp periodically deviated from building up Astra to hurling insults at several of his competitors in the launch industry, Ars reports. To be fair to Kemp, some of his criticisms are not without a kernel of truth. But they are uncharacteristically rough all the same, especially given Astra's uneven-at-best launch record and financial solvency to date.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/9333639-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/9333639-1152x648.jpg",
      "popularity_score": 296.51783333333333,
      "ai_summary": [
        "Amazon plans to launch Kuiper broadband satellites in quick succession.",
        "The launches are scheduled to occur within a few days of each other.",
        "New Glenn's second flight has been postponed.",
        "The report covers developments in space launch activities.",
        "The information provides updates on ongoing space projects."
      ]
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 12:16:04 +0000",
      "title": "Raspberry Pi 500+ puts the Pi, 16GB of RAM, and a real SSD in a mechanical keyboard",
      "neutral_headline": "Raspberry Pi 500+ Integrates Pi, RAM, and SSD in Keyboard",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/09/raspberry-pi-supercharges-its-keyboard-pc-with-16gb-ram-ssd-mechanical-switches/",
          "published_at": "Fri, 26 Sep 2025 12:16:04 +0000",
          "title": "Raspberry Pi 500+ puts the Pi, 16GB of RAM, and a real SSD in a mechanical keyboard",
          "standfirst": "Keyboard uses low-profile Gateron Blue switches and an RP2040 controller.",
          "content": "The Raspberry Pi 500 (and 400) systems are versions of the Raspberry Pi built for people who use the Raspberry Pi as a general-purpose computer rather than a hobbyist appliance. Now the company is leaning into that even more with the Raspberry Pi 500+, an amped-up version of the keyboard computer with 16GB of RAM instead of 8GB, a 256GB NVMe SSD instead of microSD storage, and a fancier keyboard with mechanical switches, replaceable keycaps, and individually programmable RGB LEDs. The computer is currently available to purchase from the usual suspects like CanaKit and Micro Center, and generally starts at $200, twice the price of the Pi 500. Raspberry Pi CEO Eben Upton's blog post about the 500+ says that the upgraded version of the computer has been in the works since the regular 500 was released last year.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/500-clicky-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/500-clicky-1152x648.jpg",
      "popularity_score": 286.0195,
      "ai_summary": [
        "The Raspberry Pi 500+ integrates a Raspberry Pi, 16GB RAM, and SSD.",
        "It is housed within a mechanical keyboard design.",
        "The keyboard utilizes low-profile Gateron Blue switches.",
        "It incorporates an RP2040 controller for functionality.",
        "The device offers a compact computing solution within a keyboard."
      ]
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Fri, 26 Sep 2025 11:15:11 +0000",
      "title": "Fiji’s ants might be the canary in the coal mine for the insect apocalypse",
      "neutral_headline": "Fiji Ants Serve as Indicator for Insect Population Decline",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/09/fijis-ants-might-be-the-canary-in-the-coal-mine-for-the-insect-apocalypse/",
          "published_at": "Fri, 26 Sep 2025 11:15:11 +0000",
          "title": "Fiji’s ants might be the canary in the coal mine for the insect apocalypse",
          "standfirst": "A new genetic technique lets museum samples track population dynamics.",
          "content": "In late 2017, a study by Krefeld Entomological Society looked at protected areas across Germany and discovered that two-thirds of the insect populations living in there had vanished over the last 25 years. The results spurred the media to declare we’re living through an “insect apocalypse,” but the reasons behind their absence were unclear. Now, a joint team of Japanese and Australian scientists have completed a new, multi-year study designed to get us some answers. Insect microcosm “In our work, we focused on ants because we have systematic ways for collecting them,” says Alexander Mikheyev, an evolutionary biologist at the Australian National University. “They are also a group with the right level of diversity, where you have enough species to do comparative studies.” Choosing the right location, he explained, was just as important. “We did it in Fiji, because Fiji had the right balance between isolation—which gave us a discrete group of animals to study—but at the same time was diverse enough to make comparisons,” Mikheyev adds. Thus, the Fijian archipelago, with its 330 islands, became the model the team used to get some insights into insect population dynamics. A key difference from the earlier study was that Mikheyev and his colleagues could look at those populations across thousands of years, not just the last 25.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-504677809-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-504677809-1024x648.jpg",
      "popularity_score": 275.0047777777778,
      "ai_summary": [
        "Fiji's ant populations may indicate a broader insect decline.",
        "A new genetic technique allows tracking of population dynamics.",
        "Museum samples are used to analyze ant population changes.",
        "The research provides insights into insect population trends.",
        "The findings contribute to understanding the insect apocalypse."
      ]
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 22:19:46 +0000",
      "title": "Senate staff probes DOGE, finds locked doors and windows covered with trash bags",
      "neutral_headline": "Senate Staff Investigates DOGE, Finds Security Concerns",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/09/senate-staff-probes-doge-finds-locked-doors-and-windows-covered-with-trash-bags/",
          "published_at": "Thu, 25 Sep 2025 22:19:46 +0000",
          "title": "Senate staff probes DOGE, finds locked doors and windows covered with trash bags",
          "standfirst": "Democratic report describes Social Security risk and secretive DOGE offices.",
          "content": "Multiple whistleblowers alleged that DOGE uploaded a highly sensitive Social Security Administration (SSA) database to an unmonitored cloud environment, according to a report by Senate Democratic staff. The staff report describes an investigation into DOGE activities at three agencies, including a site visit at the General Services Administration (GSA) in which DOGE officials appeared to be hiding certain areas from view. As we reported last month, then-SSA Chief Data Officer Chuck Borges alleged that DOGE officials created \"a live copy of the country's Social Security information in a cloud environment that circumvents oversight.\" At least one other whistleblower has apparently made the same allegation. Whistleblowers, including Borges, alleged \"that Edward Coristine, the 19-year-old DOGE staffer who was previously fired from a job for leaking company data to a competitor, and other DOGE personnel had been granted permission to move highly sensitive SSA data into an unmonitored cloud environment,\" the Senate Democratic report said. \"The whistleblowers said that DOGE has uploaded a live copy of NUMIDENT, which contains highly sensitive personal data on anyone who has held a Social Security number, including every American. This includes Social Security numbers (SSNs), place and date of birth, work permit status, and parents' names, among other sensitive personal information, for all Americans, to a cloud environment.\"Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/delete-doge-scaled-1152x648-1740426647.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/delete-doge-scaled-1152x648-1740426647.jpg",
      "popularity_score": 253,
      "ai_summary": [
        "Senate staff investigated DOGE, uncovering security concerns.",
        "The report describes locked doors and windows covered with trash bags.",
        "The report highlights potential risks to Social Security.",
        "The investigation focused on the secretive DOGE offices.",
        "The findings raise questions about the organization's operations."
      ]
    },
    {
      "id": "cluster_100",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 22:00:43 +0000",
      "title": "Sierra’s Dream Chaser is starting to resemble a nightmare",
      "neutral_headline": "Sierra’s Dream Chaser Development Faces Challenges",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/09/sierras-dream-chaser-is-starting-to-resemble-a-nightmare/",
          "published_at": "Thu, 25 Sep 2025 22:00:43 +0000",
          "title": "Sierra’s Dream Chaser is starting to resemble a nightmare",
          "standfirst": "\"Development of new space transportation systems is difficult.\"",
          "content": "The Dream Chaser spaceplane, which has been under development for two decades, now seems like it might be further than ever from taking flight. On Thursday, NASA, confirming an earlier Ars Technica report, said the first flight of the winged spacecraft will no longer berth with the International Space Station. Rather, the space agency said, the Dream Chaser program would be \"best served\" by a free flight demonstration. \"Development of new space transportation systems is difficult and can take longer than what’s originally planned,\" said Dana Weigel, manager of NASA's International Space Station Program, in a news release. \"As NASA and its partners look toward space station deorbit in 2030, this mutually agreed to decision enables testing and verification to continue on Dream Chaser, as well as demonstrating the capabilities of the spaceplane for future resupply missions in low Earth orbit.\"Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/dcart1-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/dcart1-1152x648.jpeg",
      "popularity_score": 243,
      "ai_summary": [
        "The development of Sierra's Dream Chaser faces difficulties.",
        "The project's progress is proving challenging.",
        "The statement acknowledges the complexities of space transportation.",
        "The challenges are typical of new space system development.",
        "The project's future is uncertain due to these issues."
      ]
    },
    {
      "id": "cluster_130",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 16:00:59 +0000",
      "title": "Google DeepMind unveils its first “thinking” robotics AI",
      "neutral_headline": "Google DeepMind Unveils \"Thinking\" Robotics AI",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/09/google-deepmind-unveils-its-first-thinking-robotics-ai/",
          "published_at": "Thu, 25 Sep 2025 16:00:59 +0000",
          "title": "Google DeepMind unveils its first “thinking” robotics AI",
          "standfirst": "DeepMind researchers believe this is the dawn of agentic robots.",
          "content": "Generative AI systems that create text, images, audio, and even video are becoming commonplace. In the same way AI models output those data types, they can also be used to output robot actions. That's the foundation of Google DeepMind's Gemini Robotics project, which has announced a pair of new models that work together to create the first robots that \"think\" before acting. Traditional LLMs have their own set of problems, but the introduction of simulated reasoning did significantly upgrade their capabilities, and now the same could be happening with AI robotics. The team at DeepMind contends that generative AI is a uniquely important technology for robotics because it unlocks general functionality. Current robots have to be trained intensively on specific tasks, and they are typically bad at doing anything else. \"Robots today are highly bespoke and difficult to deploy, often taking many months in order to install a single cell that can do a single task,\" said Carolina Parada, head of robotics at Google DeepMind. The fundamentals of generative systems make AI-powered robots more general. They can be presented with entirely new situations and workspaces without needing to be reprogrammed. DeepMind's current approach to robotics relies on two models: one that thinks and one that does.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/Gemini-Robotics-1.5_Agentic-Capabilitiies-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/Gemini-Robotics-1.5_Agentic-Capabilitiies-1152x648.jpg",
      "popularity_score": 160,
      "ai_summary": [
        "Google DeepMind has introduced its first \"thinking\" robotics AI.",
        "Researchers believe this marks the beginning of agentic robots.",
        "The AI is designed to enhance robotic capabilities.",
        "The development represents a significant advancement in robotics.",
        "The technology aims to create more autonomous robots."
      ]
    },
    {
      "id": "cluster_128",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 16:10:46 +0000",
      "title": "Apple iPhone 17 review: Sometimes boring is best",
      "neutral_headline": "Apple iPhone 17 Review: Sometimes Boring Is Best",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/09/review-apples-injects-just-the-right-amount-of-pro-into-the-regular-iphone-17/",
          "published_at": "Thu, 25 Sep 2025 16:10:46 +0000",
          "title": "Apple iPhone 17 review: Sometimes boring is best",
          "standfirst": "The least exciting iPhone this year is also the best value for the money.",
          "content": "Apple seems determined to leave a persistent gap between the cameras of its Pro iPhones and the regular ones, but most other features—the edge-to-edge-screen design with FaceID, the Dynamic Island, OLED display panels, Apple Intelligence compatibility—eventually trickle down to the regular-old iPhone after a generation or two of timed exclusivity. One feature that Apple has been particularly slow to move down the chain is ProMotion, the branding the company uses to refer to a screen that can refresh up to 120 times per second rather than the more typical 60 times per second. ProMotion isn't a necessary feature, but since Apple added it to the iPhone 13 Pro in 2021, the extra fluidity and smoothness, plus the always-on display feature, have been big selling points for the Pro phones. This year, ProMotion finally comes to the regular-old iPhone 17, years after midrange and even lower-end Android phones made the swap to 90 or 120 Hz display panels. And it sounds like a small thing, but the screen upgrade—together with a doubling of base storage from 128GB to 256GB—makes the gap between this year's iPhone and iPhone Pro feel narrower than it's been in a long time. If you jumped on the Pro train a few years back and don't want to spend that much again, this might be a good year to switch back. If you've ever been tempted by the Pro but never made the upgrade, you can continue not doing that and miss out on relatively little.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/IMG_3399-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/IMG_3399-1152x648.jpeg",
      "popularity_score": 153,
      "ai_summary": [
        "The iPhone 17 is considered the least exciting iPhone this year.",
        "It is also considered the best value for the money.",
        "The review focuses on the phone's overall performance.",
        "The assessment highlights the phone's cost-effectiveness.",
        "The review suggests that simplicity can be beneficial."
      ]
    },
    {
      "id": "cluster_110",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 20:30:52 +0000",
      "title": "ChatGPT Pulse delivers morning updates based on your chat history",
      "neutral_headline": "ChatGPT Pulse Delivers Morning Updates Based on Chat History",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/09/chatgpt-pulse-delivers-morning-updates-based-on-your-chat-history/",
          "published_at": "Thu, 25 Sep 2025 20:30:52 +0000",
          "title": "ChatGPT Pulse delivers morning updates based on your chat history",
          "standfirst": "New mobile chatbot feature analyzes conversations overnight.",
          "content": "On Thursday, OpenAI announced ChatGPT Pulse, a new \"push\" feature that generates personalized daily updates for users without having to ask each time. The preview feature, available now for Pro subscribers on mobile, marks OpenAI's latest attempt to make ChatGPT proactive rather than reactive, with the AI model conducting overnight research to deliver morning updates based on user history and connected apps. OpenAI calls it \"personalized research and timely updates that appear regularly to keep you informed.\" ChatGPT Pulse works by analyzing a user's chat history, saved preferences, and optional connections to Gmail and Google Calendar each night. The next morning, users receive visual \"cards\" (small illustrated squares with topic summaries that can be expanded for detail) containing updates on topics the model determines are relevant, such as project follow-ups, dinner suggestions, or travel recommendations. Users can provide feedback through thumbs up or down ratings and request specific topics through a \"curate\" button. OpenAI says that rather than waiting for users to initiate conversations, ChatGPT now attempts to deliver information preemptively using what OpenAI calls \"asynchronous research,\" essentially having the model generate queries and responses overnight using traditional methods. Updates appear once daily and disappear after 24 hours unless users save them or ask follow-up questions, which converts them into standard chat conversations.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/chatgpt_pulse-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/chatgpt_pulse-1152x648.jpg",
      "popularity_score": 148,
      "ai_summary": [
        "ChatGPT Pulse provides morning updates based on chat history.",
        "The feature analyzes conversations from the previous night.",
        "It offers a summary of relevant information.",
        "The feature is available on mobile devices.",
        "It aims to provide users with personalized information."
      ]
    },
    {
      "id": "cluster_122",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 18:10:50 +0000",
      "title": "Experts urge caution about using ChatGPT to pick stocks",
      "neutral_headline": "Experts Urge Caution About Using ChatGPT to Pick Stocks",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/09/experts-urge-caution-about-using-chatgpt-to-pick-stocks/",
          "published_at": "Thu, 25 Sep 2025 18:10:50 +0000",
          "title": "Experts urge caution about using ChatGPT to pick stocks",
          "standfirst": "AI-selected portfolios might perform well in a growing market, but experts warn of downturn risks.",
          "content": "With AI chatbots growing in popular usage, it was only a matter of time before large numbers of people began applying them to the stock market. In fact, at least 1 in 10 retail investors now consult ChatGPT or other AI chatbots for stock-picking advice, according to a Reuters report published Thursday. Data from a survey by trading platform eToro of 11,000 retail investors worldwide suggests that 13 percent of individual investors already use AI tools like ChatGPT or Google's Gemini for stock selection, while about half say they would consider using these tools for portfolio decisions. Unlike algorithmic trading, where computers automatically execute thousands of trades per second, investors are using ChatGPT as an advisory tool in place of human experts. They type questions, read the AI model's analysis, and then manually decide whether to place trades through their brokers.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/robot_stocks-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/robot_stocks-1152x648.jpg",
      "popularity_score": 148,
      "ai_summary": [
        "Experts advise caution when using ChatGPT for stock selection.",
        "AI-selected portfolios might perform well in a growing market.",
        "Experts warn of potential risks during market downturns.",
        "The advice focuses on the limitations of AI in investing.",
        "The warning highlights the importance of human oversight."
      ]
    },
    {
      "id": "cluster_123",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 17:56:43 +0000",
      "title": "Amazon blamed AI for layoffs, then hired cheap H1-B workers, senators allege",
      "neutral_headline": "Amazon blamed AI for layoffs, then hired cheap H1-B workers, senators allege",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/09/amazon-blamed-ai-for-layoffs-then-hired-cheap-h1-b-workers-senators-allege/",
          "published_at": "Thu, 25 Sep 2025 17:56:43 +0000",
          "title": "Amazon blamed AI for layoffs, then hired cheap H1-B workers, senators allege",
          "standfirst": "Tech firms pressed to explain if H-1B workers are paid less than US workers.",
          "content": "Senators are demanding answers from Big Tech companies accused of \"filing thousands of H-1B skilled labor visa petitions after conducting mass layoffs of American employees.\" In letters sent to Amazon, Meta, Apple, Google, and Microsoft—among some of the largest sponsors of H-1B visas—Senators Chuck Grassley (R-Iowa) and Dick Durbin (D-Ill.) requested \"information and data from each company regarding their recruitment and hiring practices, as well as any variation in salary and benefits between H-1B visa holders and American employees.\" The letters came shortly after Grassley sent a letter to Department of Homeland Security Secretary Kristi Noem requesting that DHS stop \"issuing work authorizations to student visa holders.\" According to Grassley, \"foreign student work authorizations put America at risk of technological and corporate espionage,\" in addition to allegedly \"contributing to rising unemployment rates among college-educated Americans.\"Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1573672488-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1573672488-1152x648.jpg",
      "popularity_score": 148,
      "ai_summary": [
        "Senators allege Amazon blamed AI for layoffs.",
        "They also allege Amazon hired cheaper H-1B workers.",
        "Tech firms are pressed to explain H-1B worker pay.",
        "The allegations raise questions about labor practices.",
        "The situation involves scrutiny of AI and employment."
      ]
    },
    {
      "id": "cluster_104",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 21:27:55 +0000",
      "title": "Amazon Fire TV devices expected to ditch Android for Linux in 2025",
      "neutral_headline": "Amazon Fire TV devices expected to ditch Android for Linux in 2025",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/09/amazon-fire-tv-devices-expected-to-ditch-android-for-linux-in-2025/",
          "published_at": "Thu, 25 Sep 2025 21:27:55 +0000",
          "title": "Amazon Fire TV devices expected to ditch Android for Linux in 2025",
          "standfirst": "Ditching Google could help Amazon better monetize its streaming gadgets.",
          "content": "After the posting—and apparent editing—of a job opening spotted this week, it's expected that Amazon will bring its homegrown operating system to Fire TV devices this year. Most of Amazon’s Fire-branded devices, which include tablets, currently run some version of Fire OS, which is an Android fork based on the Android Open Source Project (AOSP). For years, Fire OS’s reliance on AOSP has resulted in Amazon devices coming out with older software, such as 2024’s Amazon Fire HD 8 tablet, which came out with Fire OS 8, which is based on 2020’s Android 11. Some devices already run Amazon’s proprietary software, reportedly codenamed Vega OS. The current Echo Hub smart home control panel, Echo Show 5 (3rd Gen) smart home display, and Echo Spot smart speaker all run an OS based on the Linux 5.16 kernel, per details in Amazon’s source code notice for Alexa devices. However, Amazon has never publicly acknowledged that the OS exists.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1678218591-1152x648-1758832163.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1678218591-1152x648-1758832163.jpg",
      "popularity_score": 139,
      "ai_summary": [
        "Amazon Fire TV devices are expected to switch to Linux in 2025.",
        "Ditching Google could help Amazon monetize its streaming gadgets.",
        "The change could impact the devices' functionality.",
        "The move aims to give Amazon more control.",
        "The transition is planned for future device models."
      ]
    },
    {
      "id": "cluster_120",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 18:34:59 +0000",
      "title": "Study: Planned budget cuts would hurt drug development badly",
      "neutral_headline": "Budget cuts could negatively impact drug development research",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/09/study-planned-budget-cuts-would-hurt-drug-development-badly/",
          "published_at": "Thu, 25 Sep 2025 18:34:59 +0000",
          "title": "Study: Planned budget cuts would hurt drug development badly",
          "standfirst": "Drug patents frequently cite research that the NIH wouldn't be able to fund.",
          "content": "The proposed federal budget would see drastic cuts made to most of the agencies that fund science. The sheer magnitude of the cuts—including a 40 percent slashing of money going to the National Institutes of Health—would do severe harm to biomedical researchers and the industries that serve or rely on them. And, ultimately, that is likely to do harm to all of us. In today's issue of Science, some researchers have attempted to put numbers on those indirect effects that fall within that \"ultimately\" category. They've identified which grants wouldn't have been funded had similar cuts been made earlier in this century and tracked the impact that likely had on drug patents. Their conclusion: Development of roughly half the newly approved drugs relied on work that was funded by a grant that would need to be cut. From grants to drugs It's uncertain whether the proposed budget cuts will go through. At the moment, Congress is looking to fund most science agencies at levels similar to their current budgets. Should cuts eventually happen, then it's also difficult to predict how they'll be spread among the more than 20 institutes that make up the NIH (a number that the administration also wants to see reduced via consolidation). So, the researchers make a big simplifying assumption: Every institute within the NIH will take a 40 percent hit to its budget.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2234956387-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2234956387-1024x648.jpg",
      "popularity_score": 139,
      "ai_summary": [
        "Planned budget cuts would significantly hinder drug development, according to a new study.",
        "Drug patents frequently cite research that the National Institutes of Health would fund.",
        "The study suggests that reduced funding would slow down the creation of new medications.",
        "This could lead to fewer breakthroughs in treating various diseases and conditions.",
        "The impact would be felt across the pharmaceutical industry and patient care."
      ]
    },
    {
      "id": "cluster_101",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 21:42:07 +0000",
      "title": "Felony charges after South Carolina high school filled with “fart spray”… for weeks",
      "neutral_headline": "Felony charges filed after high school \"fart spray\" incident",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/09/felony-charges-after-south-carolina-high-school-filled-with-fart-spray-for-weeks/",
          "published_at": "Thu, 25 Sep 2025 21:42:07 +0000",
          "title": "Felony charges after South Carolina high school filled with “fart spray”… for weeks",
          "standfirst": "Let's dig into the science of stink.",
          "content": "As a boy, I once owned a whoopee cushion. I thought it was hilarious; my aging and extremely \"proper\" great aunt—God rest her soul—did not, and at one Thanksgiving dinner, she let me know. Chastened, I never used a whoopee cushion again. Nor, as the decades passed, did I think much more about the possible humor value of fake farts. Until this week, when I came across the strange case of Alexander Paul Robertson Lewis, who has been charged with a felony in South Carolina for—and let me quote from the official police press release here—using \"an Internet-acquired spray designed to imitate fecal odor.\" The nanny state run amok? The criminalization of fun? Authorities who Just Can't Take A Joke?Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1754174324-1152x648-1758833472.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-1754174324-1152x648-1758833472.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "A South Carolina high school was filled with a foul-smelling spray for weeks.",
        "Authorities have filed felony charges related to the incident.",
        "The article will explore the science behind the odor and its effects.",
        "The investigation aims to determine the source and the extent of the damage.",
        "The incident caused disruption and health concerns within the school community."
      ]
    },
    {
      "id": "cluster_108",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 20:54:24 +0000",
      "title": "High above the equator, Russia is stalking satellites used by NATO armed forces",
      "neutral_headline": "Russia is monitoring satellites used by NATO armed forces",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/09/in-a-major-policy-shift-germany-considers-offensive-weapons-in-space/",
          "published_at": "Thu, 25 Sep 2025 20:54:24 +0000",
          "title": "High above the equator, Russia is stalking satellites used by NATO armed forces",
          "standfirst": "\"Russia and China already occupy important strategic hills and mountains in space.\"",
          "content": "Germany's defense minister, Boris Pistorius, said Thursday that it's time for his country to consider putting \"offensive capabilities\" in space after revealing Russian spacecraft are tracking two communications satellites used by the German military. Speaking at the German industry's Space Congress event in Berlin, Pistorius said the country must ramp up its investment in space security to counter threats from Russia and China, which he said have rapidly expanded their capacity for space warfare. \"They can jam, blind, manipulate, or kinetically destroy satellites,\" Pistorius said. \"There are no borders or continents in space. Russia and China are our direct neighbors there.\"Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2235231209-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2235231209-1152x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "Russia is monitoring satellites used by NATO forces above the equator.",
        "Russia and China control strategic locations in space, according to the article.",
        "This activity raises concerns about potential threats to space-based assets.",
        "The article discusses the implications of this monitoring for global security.",
        "The situation highlights the increasing militarization of outer space."
      ]
    },
    {
      "id": "cluster_129",
      "coverage": 1,
      "updated_at": "Thu, 25 Sep 2025 16:05:47 +0000",
      "title": "Amazon agrees to make canceling Prime easy, will refund customers $1.5B",
      "neutral_headline": "Amazon agrees to simplify Prime cancellation, refund customers",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/09/amazon-agrees-to-make-canceling-prime-easy-will-refund-customers-1-5b/",
          "published_at": "Thu, 25 Sep 2025 16:05:47 +0000",
          "title": "Amazon agrees to make canceling Prime easy, will refund customers $1.5B",
          "standfirst": "Amazon’s settlement with FTC kills the “No, I don’t want free shipping” button.",
          "content": "Amazon has agreed to settle a Federal Trade Commission lawsuit accusing the e-commerce giants of tricking customers into signing up for Prime and then making it frustratingly hard to cancel. In a press release Thursday, the FTC confirmed that, pending court approval, Amazon will pay a $1 billion civil penalty and provide $1.5 billion in refunds to an estimated 35 million customers \"harmed by their deceptive Prime enrollment practices.\" Former FTC chair Lina Khan initiated the lawsuit, accusing customers of trapping customers in a “labyrinthine” Prime cancellation process the company named after Homer’s Iliad. The civil penalty, the FTC noted, is \"the largest ever in a case involving an FTC rule violation,\" and the refunds to customers are \"the second-highest restitution award ever obtained by FTC action.\"Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2234419194-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/GettyImages-2234419194-1024x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "Amazon will make canceling Prime easier and refund customers $1.5 billion.",
        "The settlement with the Federal Trade Commission addresses cancellation issues.",
        "The \"No, I don't want free shipping\" button will be removed.",
        "This change aims to improve customer experience and transparency.",
        "The agreement reflects regulatory scrutiny of Amazon's business practices."
      ]
    }
  ]
}