{
  "updated_at": "2026-01-05T19:20:46.223Z",
  "clusters": [
    {
      "id": "cluster_2",
      "coverage": 2,
      "updated_at": "Mon, 05 Jan 2026 19:09:29 +0000",
      "title": "The biggest TV announcements at CES 2026",
      "neutral_headline": "The biggest TV announcements at CES 2026",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/the-biggest-tv-announcements-at-ces-2026-190929976.html",
          "published_at": "Mon, 05 Jan 2026 19:09:29 +0000",
          "title": "The biggest TV announcements at CES 2026",
          "standfirst": "CES is once again where TV manufacturers lay out their plans for the year ahead, and CES 2026 is shaping up to be a showcase of both familiar rivalries and genuinely new display tech. While OLED and Mini LED remain central to most lineups, Micro RGB has emerged as one of the most talked-about developments at the show so far, especially at the higher end of the market. Below are the TV announcements that stood out most from the pre-show events and early press conferences, with more expected as CES continues. Samsung Micro RGB TVs Samsung's flagship Micro RGB TV Engadget Samsung’s Micro RGB push at CES 2026 isn’t just about big screens — it’s also about how the technology tries to redefine color accuracy and brightness in LCD-based TVs. Unlike traditional Mini LED backlights that rely on white LEDs and filters, Samsung’s Micro RGB TVs use microscopic red, green and blue LEDs in the backlight plane, which help deliver a wider color gamut and more precise local luminance control than conventional backlit LCDs. The standout of the lineup so far is the jaw-dropping 130-inch Micro RGB concept, shown suspended on a massive gallery-style stand at Samsung’s First Look event. It’s powered by Samsung’s Micro RGB AI Engine Pro, a processing suite that includes Micro RGB Color Booster Pro and Micro RGB HDR Pro to refine contrast and push color depth and detail frame by frame, with HDR10+ Advanced support built in. Compared with previous Micro RGB models, Samsung says this expanded family will start at more practical sizes — 55- and 65-inch — and go up to sizes as large as 75, 85 and 100 inches, all with next-gen AI-driven picture and sound features baked in. Samsung’s Micro RGB sets also carry the company’s Glare Free anti-reflection finish and tie into its broader Vision AI platform, which supports things like conversational search and contextual content discovery. While the 130-inch concept may remain more of a statement piece than a consumer product, the move underscores how Samsung continues to push next-gen TV tech forward. Samsung OLED TVs Samsung’s new 2026 OLED slate — including the S95H, S90H and S85H models — continues the brand’s use of quantum dot-enhanced OLED panels, bringing brighter highlights and richer colors than older WOLED approaches. These TVs also benefit from Samsung’s continued refinement of processing and anti-glare screen treatments, which make them more adaptable in bright living rooms than traditional OLEDs. The flagship S95H retains its position as the most premium, using a quantum dot layer to help improve brightness and color purity. Below that, the S90H brings glare-reducing optical layers and robust picture processing to a slightly more affordable price point, while the S85H is designed to offer core OLED benefits, like deep blacks and wide viewing angles, in a more accessible package that now includes a new 48-inch size for smaller spaces or gaming setups. Across the OLED family, Samsung’s Vision AI-powered tools such as AI Motion Enhancer Pro and AI Sound Controller (which dynamically adjusts audio based on content) are also part of the story, making these sets not just about panel tech but about richer, more adaptable viewing experiences. LG OLED evo W6 Wallpaper TV LG's 2026 Wallpaper wireless OLED TV Devindra Hardawar for Engadget LG’s OLED evo W6 Wallpaper TV makes a striking return at CES 2026, and this year’s version manages to blend design flair with high-end performance. The panel itself is an astonishing 9mm thick, designed to sit almost flush against a wall, and pairs with a Zero Connect Box that hosts all inputs and delivers wireless video feeds up to 10 meters away. Under the ultra-thin exterior, the W6 uses LG’s Hyper Radiant Color technology coupled with Brightness Booster Ultra to push improved brightness and color saturation compared with previous Wallpaper models. It also received Intertek’s “Reflection Free with Premium” certification, indicating some of the lowest reflectance levels yet on an OLED TV. Gaming shooters and fast action fans might appreciate support for up to 165Hz refresh rates and both G-SYNC and FreeSync Premium compatibility, making this one of the most technically ambitious Wallpaper designs LG has shown. LG Micro RGB evo TVs LG is also entering the premium RGB-backlit arena at CES with its Micro RGB evo lineup, bringing a similar focus on wider color gamut and intense brightness. Early coverage indicates the Micro RGB evo models will arrive in 75-, 86- and 100-inch sizes, and are built around LG’s α11 AI Processor Gen3, which handles advanced upscaling, local dimming and dynamic HDR optimization. LG’s Micro RGB evo TVs have been certified for full coverage of BT.2020, DCI-P3 and Adobe RGB color spaces, suggesting an exceptionally wide palette and precise color fidelity. Under the hood, the Micro Dimming Ultra system is said to deliver 1,000+ local dimming zones, which narrows the gap between LCD-based displays and self-emissive technologies like OLED in terms of contrast management. This early positioning of RGB LED tech by LG also highlights a growing industry shift, with multiple brands teasing similar systems designed to improve brightness and color performance on large screen sizes — especially where OLED’s peak luminance traditionally struggles. LG OLED TVs (C6 and C6H) OLED remains a core focus for LG, and CES 2026 brought updates to its popular C-series. The LG C6 OLED continues the company’s tradition of balancing performance and price, while the C6H OLED steps things up with a new Primary RGB Tandem panel designed to deliver higher brightness and improved color volume. These models are clearly aimed at buyers who want OLED’s deep blacks and wide viewing angles without jumping to LG’s most expensive designs, making them likely to be among the most popular TVs LG releases this year. TCL X11L SQD-Mini LED TV TCL used CES 2026 to make a strong case for Mini LED’s continued relevance with the X11L SQD-Mini LED TV, its new flagship model aimed squarely at large-screen home theater setups. Rather than chasing Micro RGB, TCL is refining its own approach with SQD, or Super Quantum Dot, technology, which combines an enhanced quantum dot layer with a dense Mini LED backlight to improve color purity and brightness. The headline number here is brightness. TCL claims the X11L can hit up to 10,000 nits peak brightness, putting it among the brightest TVs shown at CES this year. That’s paired with an extremely dense local dimming system, with up to 20,000 dimming zones, which is designed to improve contrast and keep blooming in check despite the extreme luminance. TCL also says the panel covers 100 percent of the BT.2020 color space, a bold claim that, if it holds up in real-world testing, would put it in rare company. The X11L is a 4K TV available in 75-inch, 85-inch and 98-inch sizes, with the largest models clearly intended to rival premium OLED and Micro RGB sets in dedicated home theaters. It supports a 144Hz refresh rate, making it appealing for gaming as well as fast-moving sports, and includes support for advanced HDR formats, including Dolby Vision, with further enhancements expected via software updates. With CES press day underway and the show floor opening on January 6, more TV announcements are expected from major manufacturers. As additional models are revealed or details are confirmed, we’ll continue updating this roundup with the latest information. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/the-biggest-tv-announcements-at-ces-2026-190929976.html?src=rss",
          "content": "CES is once again where TV manufacturers lay out their plans for the year ahead, and CES 2026 is shaping up to be a showcase of both familiar rivalries and genuinely new display tech. While OLED and Mini LED remain central to most lineups, Micro RGB has emerged as one of the most talked-about developments at the show so far, especially at the higher end of the market. Below are the TV announcements that stood out most from the pre-show events and early press conferences, with more expected as CES continues. Samsung Micro RGB TVs Samsung's flagship Micro RGB TV Engadget Samsung’s Micro RGB push at CES 2026 isn’t just about big screens — it’s also about how the technology tries to redefine color accuracy and brightness in LCD-based TVs. Unlike traditional Mini LED backlights that rely on white LEDs and filters, Samsung’s Micro RGB TVs use microscopic red, green and blue LEDs in the backlight plane, which help deliver a wider color gamut and more precise local luminance control than conventional backlit LCDs. The standout of the lineup so far is the jaw-dropping 130-inch Micro RGB concept, shown suspended on a massive gallery-style stand at Samsung’s First Look event. It’s powered by Samsung’s Micro RGB AI Engine Pro, a processing suite that includes Micro RGB Color Booster Pro and Micro RGB HDR Pro to refine contrast and push color depth and detail frame by frame, with HDR10+ Advanced support built in. Compared with previous Micro RGB models, Samsung says this expanded family will start at more practical sizes — 55- and 65-inch — and go up to sizes as large as 75, 85 and 100 inches, all with next-gen AI-driven picture and sound features baked in. Samsung’s Micro RGB sets also carry the company’s Glare Free anti-reflection finish and tie into its broader Vision AI platform, which supports things like conversational search and contextual content discovery. While the 130-inch concept may remain more of a statement piece than a consumer product, the move underscores how Samsung continues to push next-gen TV tech forward. Samsung OLED TVs Samsung’s new 2026 OLED slate — including the S95H, S90H and S85H models — continues the brand’s use of quantum dot-enhanced OLED panels, bringing brighter highlights and richer colors than older WOLED approaches. These TVs also benefit from Samsung’s continued refinement of processing and anti-glare screen treatments, which make them more adaptable in bright living rooms than traditional OLEDs. The flagship S95H retains its position as the most premium, using a quantum dot layer to help improve brightness and color purity. Below that, the S90H brings glare-reducing optical layers and robust picture processing to a slightly more affordable price point, while the S85H is designed to offer core OLED benefits, like deep blacks and wide viewing angles, in a more accessible package that now includes a new 48-inch size for smaller spaces or gaming setups. Across the OLED family, Samsung’s Vision AI-powered tools such as AI Motion Enhancer Pro and AI Sound Controller (which dynamically adjusts audio based on content) are also part of the story, making these sets not just about panel tech but about richer, more adaptable viewing experiences. LG OLED evo W6 Wallpaper TV LG's 2026 Wallpaper wireless OLED TV Devindra Hardawar for Engadget LG’s OLED evo W6 Wallpaper TV makes a striking return at CES 2026, and this year’s version manages to blend design flair with high-end performance. The panel itself is an astonishing 9mm thick, designed to sit almost flush against a wall, and pairs with a Zero Connect Box that hosts all inputs and delivers wireless video feeds up to 10 meters away. Under the ultra-thin exterior, the W6 uses LG’s Hyper Radiant Color technology coupled with Brightness Booster Ultra to push improved brightness and color saturation compared with previous Wallpaper models. It also received Intertek’s “Reflection Free with Premium” certification, indicating some of the lowest reflectance levels yet on an OLED TV. Gaming shooters and fast action fans might appreciate support for up to 165Hz refresh rates and both G-SYNC and FreeSync Premium compatibility, making this one of the most technically ambitious Wallpaper designs LG has shown. LG Micro RGB evo TVs LG is also entering the premium RGB-backlit arena at CES with its Micro RGB evo lineup, bringing a similar focus on wider color gamut and intense brightness. Early coverage indicates the Micro RGB evo models will arrive in 75-, 86- and 100-inch sizes, and are built around LG’s α11 AI Processor Gen3, which handles advanced upscaling, local dimming and dynamic HDR optimization. LG’s Micro RGB evo TVs have been certified for full coverage of BT.2020, DCI-P3 and Adobe RGB color spaces, suggesting an exceptionally wide palette and precise color fidelity. Under the hood, the Micro Dimming Ultra system is said to deliver 1,000+ local dimming zones, which narrows the gap between LCD-based displays and self-emissive technologies like OLED in terms of contrast management. This early positioning of RGB LED tech by LG also highlights a growing industry shift, with multiple brands teasing similar systems designed to improve brightness and color performance on large screen sizes — especially where OLED’s peak luminance traditionally struggles. LG OLED TVs (C6 and C6H) OLED remains a core focus for LG, and CES 2026 brought updates to its popular C-series. The LG C6 OLED continues the company’s tradition of balancing performance and price, while the C6H OLED steps things up with a new Primary RGB Tandem panel designed to deliver higher brightness and improved color volume. These models are clearly aimed at buyers who want OLED’s deep blacks and wide viewing angles without jumping to LG’s most expensive designs, making them likely to be among the most popular TVs LG releases this year. TCL X11L SQD-Mini LED TV TCL used CES 2026 to make a strong case for Mini LED’s continued relevance with the X11L SQD-Mini LED TV, its new flagship model aimed squarely at large-screen home theater setups. Rather than chasing Micro RGB, TCL is refining its own approach with SQD, or Super Quantum Dot, technology, which combines an enhanced quantum dot layer with a dense Mini LED backlight to improve color purity and brightness. The headline number here is brightness. TCL claims the X11L can hit up to 10,000 nits peak brightness, putting it among the brightest TVs shown at CES this year. That’s paired with an extremely dense local dimming system, with up to 20,000 dimming zones, which is designed to improve contrast and keep blooming in check despite the extreme luminance. TCL also says the panel covers 100 percent of the BT.2020 color space, a bold claim that, if it holds up in real-world testing, would put it in rare company. The X11L is a 4K TV available in 75-inch, 85-inch and 98-inch sizes, with the largest models clearly intended to rival premium OLED and Micro RGB sets in dedicated home theaters. It supports a 144Hz refresh rate, making it appealing for gaming as well as fast-moving sports, and includes support for advanced HDR formats, including Dolby Vision, with further enhancements expected via software updates. With CES press day underway and the show floor opening on January 6, more TV announcements are expected from major manufacturers. As additional models are revealed or details are confirmed, we’ll continue updating this roundup with the latest information. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/the-biggest-tv-announcements-at-ces-2026-190929976.html?src=rss",
          "feed_position": 0,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/a087c5f0-e9f4-11f0-87f1-6f39e4849c7d.jpeg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/entertainment/lego-unveils-a-technology-packed-smart-brick-at-ces-2026-190000511.html",
          "published_at": "Mon, 05 Jan 2026 19:00:00 +0000",
          "title": "Lego unveils a technology-packed Smart Brick at CES 2026",
          "standfirst": "Lego bricks come in a ridiculously vast array of sizes and shapes, but the company is unveiling an entirely new take on its classic shape at CES 2026. Meet the Lego Smart Brick, a standard-sized 2 x 4 brick that’s packed with modern technology to enable sets that can respond to how they’re played with or the sets you build. It’s part of a new initiative called Smart Play, which encompasses the Smart Brick as well as Smart Minifigures and Smart Tags. While we obviously don’t know yet how Lego fans will take to this new system, it’s still fair to say it’s the biggest move Lego has every made to infuse its products with connected technology.The Smart Brick has a 4.1mm ASIC chip inside of it that Lego says is smaller than a standard Lego stud. It runs something called the Play Engine that can sense things like motion, orientation and magnetic fields. Thanks to this and some integrated copper coils, the Smart Brick can sense distance, direction and orientation of other Smart Bricks near it when you’re building. The brick also has a tiny built-in speaker, an accelerometer and an LED array. Lego says the speaker can produce audio that is “tied to live play actions” rather than just playing pre-recorded clips. The Smart Tag and Smart Minifigures are a lot simpler. The Tag is a 2 x 2 studless tile with a digital ID embedded in it that the Smart Brick can read via “near-field magnetic communication.” This obviously sounds a lot like NFC, but we can’t be sure that these new Lego pieces will be able to communicate with any other NFC devices. Similarly, the Smart Minifigure also has a digital ID readable by NFC. The purpose of the Smart Tag as well as the similar tech in a Smart Minifigure is to let the Smart Brick know what kind of context it is being used in. As Lego puts it, “The role of the Smart Tag is to tell the Smart Brick how it should play back with you.” The Tag tells the Brick what kind of object, animal, vehicle and so forth it should become. A Smart Tag in a Lego Star Wars X-Wing set, for example, will contain the unique ID and instructions for how the Smart Brick should behave.If this isn’t enough, Lego has also built a local wireless layer that connects this all together called BrickNet. It’s based on Bluetooth and uses Lego’s proprietary “Neighbor Position Measurement\" system, which is what lets the Smart Bricks know how close they are to each other and how they’re oriented. Lego says that this lets the bricks “talk” to each other directly without the need for apps, internet connections or external controls. It sounds like the idea is all three of these new Smart pieces can communicate and interact without any need for setup, which should make it refreshingly like a traditional Lego set.That said, these bricks naturally will need some power. Lego says that their batteries should still perform even after “years” of inactivity, and the coils and power system is designed so that multiple bricks can be charged wirelessly on a shared charging pad.Lego Star Wars set with Smart BricksLegoSpeaking of sets, Lego is unsurprisingly launching the Smart Play system with its biggest licensed partner: Star Wars. There will be three “all-in-one” Star Wars sets available; those sets will include a Smart Brick and charger as well as at least one Smart Tag and Smart Minifigure. Judging from the press images Lego shared, these sets are on the smaller side and definitely geared towards kids, rather than the 1,000 piece and up sets that the company has released to get adults (like me) interested.It’s an entirely new direction for Lego, and you won’t have to wait long to check it out. The company is putting those three sets up for pre-order on January 9, and they’ll launch on March 1. No pricing info is available yet, but we’ll get that info in a few days when they go up on pre-order. There’s obviously a lot of technology here that’s entirely new to Lego, and as such it’s hard to imagine just how this will all look when it comes together — but we’re hoping that Lego will have some sets on hand here at CES so we can get a closer look at how the Smart Play system works.In the meantime, you can find a few videos on how Smart Play works here.This article originally appeared on Engadget at https://www.engadget.com/entertainment/lego-unveils-a-technology-packed-smart-brick-at-ces-2026-190000511.html?src=rss",
          "content": "Lego bricks come in a ridiculously vast array of sizes and shapes, but the company is unveiling an entirely new take on its classic shape at CES 2026. Meet the Lego Smart Brick, a standard-sized 2 x 4 brick that’s packed with modern technology to enable sets that can respond to how they’re played with or the sets you build. It’s part of a new initiative called Smart Play, which encompasses the Smart Brick as well as Smart Minifigures and Smart Tags. While we obviously don’t know yet how Lego fans will take to this new system, it’s still fair to say it’s the biggest move Lego has every made to infuse its products with connected technology.The Smart Brick has a 4.1mm ASIC chip inside of it that Lego says is smaller than a standard Lego stud. It runs something called the Play Engine that can sense things like motion, orientation and magnetic fields. Thanks to this and some integrated copper coils, the Smart Brick can sense distance, direction and orientation of other Smart Bricks near it when you’re building. The brick also has a tiny built-in speaker, an accelerometer and an LED array. Lego says the speaker can produce audio that is “tied to live play actions” rather than just playing pre-recorded clips. The Smart Tag and Smart Minifigures are a lot simpler. The Tag is a 2 x 2 studless tile with a digital ID embedded in it that the Smart Brick can read via “near-field magnetic communication.” This obviously sounds a lot like NFC, but we can’t be sure that these new Lego pieces will be able to communicate with any other NFC devices. Similarly, the Smart Minifigure also has a digital ID readable by NFC. The purpose of the Smart Tag as well as the similar tech in a Smart Minifigure is to let the Smart Brick know what kind of context it is being used in. As Lego puts it, “The role of the Smart Tag is to tell the Smart Brick how it should play back with you.” The Tag tells the Brick what kind of object, animal, vehicle and so forth it should become. A Smart Tag in a Lego Star Wars X-Wing set, for example, will contain the unique ID and instructions for how the Smart Brick should behave.If this isn’t enough, Lego has also built a local wireless layer that connects this all together called BrickNet. It’s based on Bluetooth and uses Lego’s proprietary “Neighbor Position Measurement\" system, which is what lets the Smart Bricks know how close they are to each other and how they’re oriented. Lego says that this lets the bricks “talk” to each other directly without the need for apps, internet connections or external controls. It sounds like the idea is all three of these new Smart pieces can communicate and interact without any need for setup, which should make it refreshingly like a traditional Lego set.That said, these bricks naturally will need some power. Lego says that their batteries should still perform even after “years” of inactivity, and the coils and power system is designed so that multiple bricks can be charged wirelessly on a shared charging pad.Lego Star Wars set with Smart BricksLegoSpeaking of sets, Lego is unsurprisingly launching the Smart Play system with its biggest licensed partner: Star Wars. There will be three “all-in-one” Star Wars sets available; those sets will include a Smart Brick and charger as well as at least one Smart Tag and Smart Minifigure. Judging from the press images Lego shared, these sets are on the smaller side and definitely geared towards kids, rather than the 1,000 piece and up sets that the company has released to get adults (like me) interested.It’s an entirely new direction for Lego, and you won’t have to wait long to check it out. The company is putting those three sets up for pre-order on January 9, and they’ll launch on March 1. No pricing info is available yet, but we’ll get that info in a few days when they go up on pre-order. There’s obviously a lot of technology here that’s entirely new to Lego, and as such it’s hard to imagine just how this will all look when it comes together — but we’re hoping that Lego will have some sets on hand here at CES so we can get a closer look at how the Smart Play system works.In the meantime, you can find a few videos on how Smart Play works here.This article originally appeared on Engadget at https://www.engadget.com/entertainment/lego-unveils-a-technology-packed-smart-brick-at-ces-2026-190000511.html?src=rss",
          "feed_position": 1,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/75427_Lifestyle_cons_4.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/what-are-micro-rgb-tvs-and-why-are-they-everywhere-at-ces-2026-182441543.html",
          "published_at": "Mon, 05 Jan 2026 18:24:42 +0000",
          "title": "What are Micro RGB TVs and why are they everywhere at CES 2026?",
          "standfirst": "Micro RGB TVs first arrived last year with little fanfare and a confusing name, so you may have mistaken it for other panel tech or not even noticed. That is not likely to be the case this year, though — it’s the hot new “luxury” display technology and is all over the place at CES 2026. So why do we even need these new TVs and how are they different from OLED, Micro LED and Mini LED models? Here’s how it works and how it compares. A brief history of flat panel display tech To better understand Micro RGB, it helps to see how flat panel display technology has evolved over the last 20 years. The first LCD TVs used liquid crystals that become transparent to light when voltage is applied, letting a rear backlight shine through as a pixel. Those pixels combine to create moving or still images, with color created via an RGB filter layer placed in front. The main problem is that LCD crystals let some light partially leak through, so blacks are dark grey instead of pure black. And for a backlight, early LCD TVs used a white screen lit by dim and power-hungry fluorescent lights, which caused uneven light distribution. And finally, the RGB filter color layer reduced a panel’s brightness. The next step up, then, was to use LED backlights instead, placed at first at the edges of the white screen and then later directly behind it (the first TV with this tech was Sony’s 2004 Qualia). That added the benefits of higher brightness, lower power consumption, improved color balance and even light distribution. It also allowed individual dimming zones that improve contrast by allowing near-pure blacks in shadow areas of an image. Samsung's Neo QLED 8K TV from CES 2025Samsung Quantum dot (QD) technology came on the scene around 2013 with Sony’s Triluminos televisions. This type of LCD panel employs a semiconductor nanocrystal layer (rather than an RGB filter layer) that can produce pure monochromatic red, green, and blue light when struck with a blue backlight. Unlike previous LCDs, they offer higher brightness and color accuracy thanks to the purity (narrowness) of the base RGB colors. The best-known TVs using this tech are Samsung’s QLED models. The latest evolution of QD LED technology is Mini LED. That combines the accuracy of quantum dot tech with hundreds or even thousands of LED dimming zones. Those models offer high brightness and color accuracy along with good contrast, but still don’t deliver perfect blacks and can display “blooming” in scenes with bright points of light due to leakage into neighboring pixels. Both of those problems were solved with OLED technology, which first came on the market in 2007 with Sony’s XEL-1 model. The panels are made using sheets coated with organic LEDs, each paired with a transistor that can switch the LED on or off. On regular OLED TVs, OLED pixels are white and a filter layer generates colors, much as with LED TVs. However, with QD-OLEDs, OLED pixels are blue and color is created via a quantum dot layer, like LED QD displays. The latest version of QD-OLED featured on several new monitors at CES 2026 (Samsung’s 5th-gen QD-OLED) uses an RGB stripe pattern to reduce color “fringing” on text. This is the first, and still the only widely commercialized TV tech that can switch its light source off on a pixel-by-pixel basis, allowing perfect black levels and near-infinite contrast. However, due to their organic nature, OLED TVs suffer from a lack of brightness and the potential for “burn-in” that can kill pixels. There is another type of self-illuminating tech called Micro LED. Rather than organic, it uses microscopic inorganic LEDs to form the individual pixel elements. Those can also be turned on or off individually, so they offer the same pure blacks and sky-high contrast as OLED. At the same time they’re potentially brighter than OLED and don’t suffer from burn-in. The tech is still prohibitively expensive to manufacture, though, so none have arrived to market other than Samsung’s The Wall, which costs a cool $40,000. Micro RGB Devindra Hardawar for Engadget Before talking about Micro RGB, let’s look at color space and gamut both for HDR, which uses the BT.2020 standard, and SDR, commonly associated with the REC.709 standard. REC.709 is ideal for regular HD content like TV broadcasts and YouTube videos. It can display a limited set of colors and brightness is generally capped at 100 nits. BT.2020, however, is designed for high-end HDR streaming and 4K or 8K content creation (via Dolby Vision, HDR 10 or HDR10+). It has a much wider color gamut, meaning it can display a wider variety of colors and a bigger chunk of the visible color spectrum. It’s also designed for significantly higher brightness levels of 1,000 nits or more. To achieve the color accuracy required for BT.2020, TVs must have extremely accurate red, green and blue pixels. Up until last year, the most color-accurate TVs used quantum dot technology and achieved a maximum of around 85 percent BT.2020 coverage (some projectors can cover 100 percent or more of the BT.2020 spectrum as they use RGB lasers to create colors). That brings us to Micro RGB (also known as RGB Mini LED), the most advanced LED panel yet. Unlike the uniform white or blue backlights found on Mini LED models, it features individually-controlled, precise red, green and blue LED backlights that shine through a liquid crystal layer. It also offers more local dimming zones. The net result is higher color accuracy and better contrast than regular Mini LED displays, but with potentially greater brightness than OLED. Since each pixel still can’t be turned on and off like OLED or Micro LED, though, contrast falls short of those technologies. Wikipedia So far, there is one and only one Micro RGB TV on the market, Samsung’s 115-inch 4K MR95F model. The color accuracy is impressive with 100 percent coverage of the challenging BT.2020 HDR standard, an industry-first and huge leap over quantum dot tech. That means it can produce billions of colors natively and display a higher percentage of them in the visible spectrum than any TV to date. Samsung left out a few key specs like the local dimming zone count, only saying that it has four times more than its similarly-priced 115-inch Q90F QLED model (so likely around 3,600). The company also failed to disclose the total brightness in nits, but the figure should be impressive given the potential of Micro RGB. We were gobsmacked with the MR95F Micro RGB model in person. Engadget editor Sam Rutherford said it produced “stunningly rich and vivid colors that put Samsung’s other top-tier TVs to shame,” including the aforementioned Q90F. It also came with an equally stunning $29,999 price tag. A couple of other manufacturers including HiSense have also released RGB Mini LED models similar to Samsung’s Micro RGB, but they differ slightly in that the RGB modules are larger than the ones found on Samsung’s latest TVs. Which companies will have Micro RGB tech at CES 2026? Samsung Luckily, the number of Micro RGB TVs is about to dramatically increase. Earlier this month, Samsung announced a full lineup using the technology with 55-, 65-, 75-, 85-, 100- and 115-inch screen sizes, saying they’d set “a new standard for premium home viewing.” Those sets will also offer 100 percent BT.2020 HDR coverage under a new certification standard called Micro RGB Precision Color 100. While certainly likely to carry more reasonable prices than the first model, they’ll probably still be Samsung’s most expensive TVs when released later this year. And on Sunday, Samsung also revealed a 130-inch Micro RGB prototype meant to showcase the technology. Once again, it blew us away partially just because of the huge size, but also due to the incredible \"color accuracy and richness,\" as Engadget editor Devindra Hardawar put it. \"I couldn’t help but notice how everyone just looked a bit stunned, like the monkeys from 2001 seeing the monolith for the first time,\" he added. At the same time, LG announced its first Micro RGB “evo” TV lineup in 75-, 86- and 100-inch models. The company is also promising 100 percent BT.2020 color gamut coverage and said the sets will have over a thousand local dimming zones for color control. Not only that, it said that its new TVs will deliver 100 percent coverage in SDR modes as well, both for Adobe RGB and the challenge P3 standard. It was interesting to compare LG's Wallpaper and other OLED sets with the new Micro RGB tech, with our editor Devindra again being amazed. \"LG already announced its Micro RGB set a few weeks ago, but that didn't prepare me for standing in front of the 100-inch demo TV it brought to CES,\" he said. \"Throughout a variety of clips, colors looked wonderfully rich, and the overall texture of the images looked surprisingly life-like.\"This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/what-are-micro-rgb-tvs-and-why-are-they-everywhere-at-ces-2026-182441543.html?src=rss",
          "content": "Micro RGB TVs first arrived last year with little fanfare and a confusing name, so you may have mistaken it for other panel tech or not even noticed. That is not likely to be the case this year, though — it’s the hot new “luxury” display technology and is all over the place at CES 2026. So why do we even need these new TVs and how are they different from OLED, Micro LED and Mini LED models? Here’s how it works and how it compares. A brief history of flat panel display tech To better understand Micro RGB, it helps to see how flat panel display technology has evolved over the last 20 years. The first LCD TVs used liquid crystals that become transparent to light when voltage is applied, letting a rear backlight shine through as a pixel. Those pixels combine to create moving or still images, with color created via an RGB filter layer placed in front. The main problem is that LCD crystals let some light partially leak through, so blacks are dark grey instead of pure black. And for a backlight, early LCD TVs used a white screen lit by dim and power-hungry fluorescent lights, which caused uneven light distribution. And finally, the RGB filter color layer reduced a panel’s brightness. The next step up, then, was to use LED backlights instead, placed at first at the edges of the white screen and then later directly behind it (the first TV with this tech was Sony’s 2004 Qualia). That added the benefits of higher brightness, lower power consumption, improved color balance and even light distribution. It also allowed individual dimming zones that improve contrast by allowing near-pure blacks in shadow areas of an image. Samsung's Neo QLED 8K TV from CES 2025Samsung Quantum dot (QD) technology came on the scene around 2013 with Sony’s Triluminos televisions. This type of LCD panel employs a semiconductor nanocrystal layer (rather than an RGB filter layer) that can produce pure monochromatic red, green, and blue light when struck with a blue backlight. Unlike previous LCDs, they offer higher brightness and color accuracy thanks to the purity (narrowness) of the base RGB colors. The best-known TVs using this tech are Samsung’s QLED models. The latest evolution of QD LED technology is Mini LED. That combines the accuracy of quantum dot tech with hundreds or even thousands of LED dimming zones. Those models offer high brightness and color accuracy along with good contrast, but still don’t deliver perfect blacks and can display “blooming” in scenes with bright points of light due to leakage into neighboring pixels. Both of those problems were solved with OLED technology, which first came on the market in 2007 with Sony’s XEL-1 model. The panels are made using sheets coated with organic LEDs, each paired with a transistor that can switch the LED on or off. On regular OLED TVs, OLED pixels are white and a filter layer generates colors, much as with LED TVs. However, with QD-OLEDs, OLED pixels are blue and color is created via a quantum dot layer, like LED QD displays. The latest version of QD-OLED featured on several new monitors at CES 2026 (Samsung’s 5th-gen QD-OLED) uses an RGB stripe pattern to reduce color “fringing” on text. This is the first, and still the only widely commercialized TV tech that can switch its light source off on a pixel-by-pixel basis, allowing perfect black levels and near-infinite contrast. However, due to their organic nature, OLED TVs suffer from a lack of brightness and the potential for “burn-in” that can kill pixels. There is another type of self-illuminating tech called Micro LED. Rather than organic, it uses microscopic inorganic LEDs to form the individual pixel elements. Those can also be turned on or off individually, so they offer the same pure blacks and sky-high contrast as OLED. At the same time they’re potentially brighter than OLED and don’t suffer from burn-in. The tech is still prohibitively expensive to manufacture, though, so none have arrived to market other than Samsung’s The Wall, which costs a cool $40,000. Micro RGB Devindra Hardawar for Engadget Before talking about Micro RGB, let’s look at color space and gamut both for HDR, which uses the BT.2020 standard, and SDR, commonly associated with the REC.709 standard. REC.709 is ideal for regular HD content like TV broadcasts and YouTube videos. It can display a limited set of colors and brightness is generally capped at 100 nits. BT.2020, however, is designed for high-end HDR streaming and 4K or 8K content creation (via Dolby Vision, HDR 10 or HDR10+). It has a much wider color gamut, meaning it can display a wider variety of colors and a bigger chunk of the visible color spectrum. It’s also designed for significantly higher brightness levels of 1,000 nits or more. To achieve the color accuracy required for BT.2020, TVs must have extremely accurate red, green and blue pixels. Up until last year, the most color-accurate TVs used quantum dot technology and achieved a maximum of around 85 percent BT.2020 coverage (some projectors can cover 100 percent or more of the BT.2020 spectrum as they use RGB lasers to create colors). That brings us to Micro RGB (also known as RGB Mini LED), the most advanced LED panel yet. Unlike the uniform white or blue backlights found on Mini LED models, it features individually-controlled, precise red, green and blue LED backlights that shine through a liquid crystal layer. It also offers more local dimming zones. The net result is higher color accuracy and better contrast than regular Mini LED displays, but with potentially greater brightness than OLED. Since each pixel still can’t be turned on and off like OLED or Micro LED, though, contrast falls short of those technologies. Wikipedia So far, there is one and only one Micro RGB TV on the market, Samsung’s 115-inch 4K MR95F model. The color accuracy is impressive with 100 percent coverage of the challenging BT.2020 HDR standard, an industry-first and huge leap over quantum dot tech. That means it can produce billions of colors natively and display a higher percentage of them in the visible spectrum than any TV to date. Samsung left out a few key specs like the local dimming zone count, only saying that it has four times more than its similarly-priced 115-inch Q90F QLED model (so likely around 3,600). The company also failed to disclose the total brightness in nits, but the figure should be impressive given the potential of Micro RGB. We were gobsmacked with the MR95F Micro RGB model in person. Engadget editor Sam Rutherford said it produced “stunningly rich and vivid colors that put Samsung’s other top-tier TVs to shame,” including the aforementioned Q90F. It also came with an equally stunning $29,999 price tag. A couple of other manufacturers including HiSense have also released RGB Mini LED models similar to Samsung’s Micro RGB, but they differ slightly in that the RGB modules are larger than the ones found on Samsung’s latest TVs. Which companies will have Micro RGB tech at CES 2026? Samsung Luckily, the number of Micro RGB TVs is about to dramatically increase. Earlier this month, Samsung announced a full lineup using the technology with 55-, 65-, 75-, 85-, 100- and 115-inch screen sizes, saying they’d set “a new standard for premium home viewing.” Those sets will also offer 100 percent BT.2020 HDR coverage under a new certification standard called Micro RGB Precision Color 100. While certainly likely to carry more reasonable prices than the first model, they’ll probably still be Samsung’s most expensive TVs when released later this year. And on Sunday, Samsung also revealed a 130-inch Micro RGB prototype meant to showcase the technology. Once again, it blew us away partially just because of the huge size, but also due to the incredible \"color accuracy and richness,\" as Engadget editor Devindra Hardawar put it. \"I couldn’t help but notice how everyone just looked a bit stunned, like the monkeys from 2001 seeing the monolith for the first time,\" he added. At the same time, LG announced its first Micro RGB “evo” TV lineup in 75-, 86- and 100-inch models. The company is also promising 100 percent BT.2020 color gamut coverage and said the sets will have over a thousand local dimming zones for color control. Not only that, it said that its new TVs will deliver 100 percent coverage in SDR modes as well, both for Adobe RGB and the challenge P3 standard. It was interesting to compare LG's Wallpaper and other OLED sets with the new Micro RGB tech, with our editor Devindra again being amazed. \"LG already announced its Micro RGB set a few weeks ago, but that didn't prepare me for standing in front of the 100-inch demo TV it brought to CES,\" he said. \"Throughout a variety of clips, colors looked wonderfully rich, and the overall texture of the images looked surprisingly life-like.\"This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/what-are-micro-rgb-tvs-and-why-are-they-everywhere-at-ces-2026-182441543.html?src=rss",
          "feed_position": 2,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2026-01/de40ab00-ea62-11f0-9dff-31cb26633672"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-press-conference-live-190040504.html",
          "published_at": "Mon, 05 Jan 2026 17:55:28 +0000",
          "title": "How to watch the Hisense CES 2026 press conference live",
          "standfirst": "Xinhua News Agency via Getty Images Hisense is typically best known for its affordable electronics and home appliances, from TVs to refrigerators. But at CES 2025, the China-based company showed off its premium side with a massive 136-inch micro LED TV — now available for a jaw-dropping $100,000. So what's in store for this year's show? New leadership, for starters. The company has two new hires, including Chief Marketing Officer Sarah Larsen and Chief Commercial Officer James Fishler. In a press release, Hisense said Fishler's experience in home entertainment, appliances and HVAC is important as the company \"builds toward a milestone 2026 and its presence at CES.\" We'll give you a rundown of what to expect during Hisense's presentation and how you can watch it live. How to watch Hisense's presentation Hisense is livestreaming the event on its YouTube channel today (Monday, January 5) at 1PM ET. We've embedded it below. You can also follow the Engadget CES 2026 liveblog for real-time updates from the show. What to expect With its new hires in place, Hisense is clearly aiming to further polish its brand. Between Fishler and Larsen, the new front office is bringing to bear their experience from such high-powered competitors as LG, Samsung and Beats. And in a recent interview with Tom's Guide, Larsen emphasized a continued focus on the company's fast turnaround time from concept to market as a key differentiator for Hisense. As for actual announcements, Hisense has already revealed the following products on its website: Hisense S6 FollowMe display: This is a TV on wheels (really!) that apparently can follow you from room to room. Hisense XR10 and PX4-PRO laser projectors: The company's latest laser projectors can deliver up to 6,000 lumens of brightness and screen sizes as big as 300 inches. ConnectLife AI-enhanced appliances: In an early press release, the company touted (what else) the enhanced AI smarts of its ConnectLife platform, stretching across everything from HVAC systems to kitchen gear to washer/dryers (\"... with the enhanced AI Laundry Agent, fabric types and soil levels are automatically identified...\"). Meanwhile, Larsen's aforementioned interview specifically calls out the emerging RGB TV space as a focus. We expect this year's show will be all about explaining the shades of difference between mini and micro LED display technologies, as both Samsung and LG have already thrown down pre-announcement gauntlets on the latter. Will any of them cost less than six figures? Let's hope Hisense has some good news to share on that front. Update, January 4 2026, 2:17PM ET: This story has been updated to include information on the Hisense ConnectLife AI platform. Update, January 5 2026, 10:45AM ET: This story has been updated to include info on Hisense's S6 FollowMe display and laser projectors. Update, January 5 2026, 11:31AM ET: This story has been updated to include the embedded YouTube livestream.This article originally appeared on Engadget at https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-press-conference-live-190040504.html?src=rss",
          "content": "Xinhua News Agency via Getty Images Hisense is typically best known for its affordable electronics and home appliances, from TVs to refrigerators. But at CES 2025, the China-based company showed off its premium side with a massive 136-inch micro LED TV — now available for a jaw-dropping $100,000. So what's in store for this year's show? New leadership, for starters. The company has two new hires, including Chief Marketing Officer Sarah Larsen and Chief Commercial Officer James Fishler. In a press release, Hisense said Fishler's experience in home entertainment, appliances and HVAC is important as the company \"builds toward a milestone 2026 and its presence at CES.\" We'll give you a rundown of what to expect during Hisense's presentation and how you can watch it live. How to watch Hisense's presentation Hisense is livestreaming the event on its YouTube channel today (Monday, January 5) at 1PM ET. We've embedded it below. You can also follow the Engadget CES 2026 liveblog for real-time updates from the show. What to expect With its new hires in place, Hisense is clearly aiming to further polish its brand. Between Fishler and Larsen, the new front office is bringing to bear their experience from such high-powered competitors as LG, Samsung and Beats. And in a recent interview with Tom's Guide, Larsen emphasized a continued focus on the company's fast turnaround time from concept to market as a key differentiator for Hisense. As for actual announcements, Hisense has already revealed the following products on its website: Hisense S6 FollowMe display: This is a TV on wheels (really!) that apparently can follow you from room to room. Hisense XR10 and PX4-PRO laser projectors: The company's latest laser projectors can deliver up to 6,000 lumens of brightness and screen sizes as big as 300 inches. ConnectLife AI-enhanced appliances: In an early press release, the company touted (what else) the enhanced AI smarts of its ConnectLife platform, stretching across everything from HVAC systems to kitchen gear to washer/dryers (\"... with the enhanced AI Laundry Agent, fabric types and soil levels are automatically identified...\"). Meanwhile, Larsen's aforementioned interview specifically calls out the emerging RGB TV space as a focus. We expect this year's show will be all about explaining the shades of difference between mini and micro LED display technologies, as both Samsung and LG have already thrown down pre-announcement gauntlets on the latter. Will any of them cost less than six figures? Let's hope Hisense has some good news to share on that front. Update, January 4 2026, 2:17PM ET: This story has been updated to include information on the Hisense ConnectLife AI platform. Update, January 5 2026, 10:45AM ET: This story has been updated to include info on Hisense's S6 FollowMe display and laser projectors. Update, January 5 2026, 11:31AM ET: This story has been updated to include the embedded YouTube livestream.This article originally appeared on Engadget at https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-press-conference-live-190040504.html?src=rss",
          "feed_position": 6,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/834aecc0-dcf1-11f0-b7de-13a29302f310"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/wearables/voccis-ai-note-taking-ring-aims-to-do-much-more-170536442.html",
          "published_at": "Mon, 05 Jan 2026 17:05:36 +0000",
          "title": "Vocci's AI note-taking ring aims to do much more",
          "standfirst": "One trend emerging from CES 2026 is wearable microphones you can use to dictate your thoughts. Vocci is one such gadget, a titanium ring with a single button capable of recording audio for up to eight hours on a charge. Unlike some of its competitors, Vocci isn’t just for catching your own thoughts as they spring forth from your scalp. Instead, you’ll be able to record whole conversations and meetings from the comfort of your proximal phalanx. Users can start and end recordings by double clicking the ring’s single button, while single clicks are used to mark important moments within the recording. Tagged moments will instruct the AI app to add more context, highlights or reminders, where appropriate. Once the file has been processed, you’ll receive a transcript, complete with a summary and commentary.I’m told the ring has a range of five meters, but I was unable to hear an example recording or see a working demo of the technology. I did ask why a ring would be more effective at capturing a room’s worth of chat over, say, using a recording app on one’s phone laid on a table. But the response was to point out a user may forget to start the recording, and you can’t disagree with that.Vocci will ship with a charging case, and will be able to recharge to full in half an hour, but it’s not clear yet how much (if at all) power will be stored in the case’s batteries. We also don’t know how much the ring will cost, but it’s likely to be available for pre-order at some point in February. As for the ring’s pedigree, it comes from Gyges Labs, the company which leant its name, manufacturing and engineering expertise to last year’s Halliday Smart Glasses.This article originally appeared on Engadget at https://www.engadget.com/wearables/voccis-ai-note-taking-ring-aims-to-do-much-more-170536442.html?src=rss",
          "content": "One trend emerging from CES 2026 is wearable microphones you can use to dictate your thoughts. Vocci is one such gadget, a titanium ring with a single button capable of recording audio for up to eight hours on a charge. Unlike some of its competitors, Vocci isn’t just for catching your own thoughts as they spring forth from your scalp. Instead, you’ll be able to record whole conversations and meetings from the comfort of your proximal phalanx. Users can start and end recordings by double clicking the ring’s single button, while single clicks are used to mark important moments within the recording. Tagged moments will instruct the AI app to add more context, highlights or reminders, where appropriate. Once the file has been processed, you’ll receive a transcript, complete with a summary and commentary.I’m told the ring has a range of five meters, but I was unable to hear an example recording or see a working demo of the technology. I did ask why a ring would be more effective at capturing a room’s worth of chat over, say, using a recording app on one’s phone laid on a table. But the response was to point out a user may forget to start the recording, and you can’t disagree with that.Vocci will ship with a charging case, and will be able to recharge to full in half an hour, but it’s not clear yet how much (if at all) power will be stored in the case’s batteries. We also don’t know how much the ring will cost, but it’s likely to be available for pre-order at some point in February. As for the ring’s pedigree, it comes from Gyges Labs, the company which leant its name, manufacturing and engineering expertise to last year’s Halliday Smart Glasses.This article originally appeared on Engadget at https://www.engadget.com/wearables/voccis-ai-note-taking-ring-aims-to-do-much-more-170536442.html?src=rss",
          "feed_position": 8
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/xgimis-titan-noir-max-4k-projector-has-a-dynamic-iris-for-increased-contrast-170044625.html",
          "published_at": "Mon, 05 Jan 2026 17:00:44 +0000",
          "title": "XGIMI's Titan Noir Max 4K projector has a dynamic IRIS for increased contrast",
          "standfirst": "XGIMI, which burst on the scene in 2025 with several impressive projectors, has unveiled its latest high-end model called the Titan Noir Max. The new model revealed at CES 2026 has many of the bells and whistles found on professional-level projectors including a dynamic IRIS system for improved contrast, along with a new thermal system designed to boost brightness. The Titan Noir Max has a design to XGIMI's Titan model announced last year, but it's taller and a bit squarer with an elegant grille-like pattern on the front. As with other XGIMI models, it features a laser light engine and 4K video quality, though the company didn't say if it had the same big Texas Instruments 0.78-inch DMD (digital micromirror device) chip as the original Titan model. The key new feature is a dynamic IRIS system that boosts native contrast to 10,000:1 for deeper blacks and brighter highlights. At the same time, it boasts new \"precision tuned optics\" (ie a better lens) also designed to improve contrast and color nuance. Another key feature is a re-engineered DMD architecture that can handle \"substantially higher light power densities,\" XGIMI says. This should allow for increased brightness, though the company didn't provide a figure in ANSI Lumens. It would be impressive if it topped the 5,000 Lumen Titan, though. Many other specs are lacking, like color accuracy in the Rec.2020 space. However, the company is promising a lot, saying that the Titan Noir Max will offer \"the stability, accuracy, and reliability required for color-critical work, studio environments, and high-end installations.\" At the same time, it's also targeted at home enthusiasts, promising to \"turn a blank wall into a cinematic event.\" XGIMI's Titan was only recently released for $3,999 but there's no word yet on the price or release date of the Titan Noir Max. Unlike the Horizon 20 series (which has a smaller 0.47-inch DMD chip) the Titan has received very few reviews so far, but one French projector site gave it a solid score. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/xgimis-titan-noir-max-4k-projector-has-a-dynamic-iris-for-increased-contrast-170044625.html?src=rss",
          "content": "XGIMI, which burst on the scene in 2025 with several impressive projectors, has unveiled its latest high-end model called the Titan Noir Max. The new model revealed at CES 2026 has many of the bells and whistles found on professional-level projectors including a dynamic IRIS system for improved contrast, along with a new thermal system designed to boost brightness. The Titan Noir Max has a design to XGIMI's Titan model announced last year, but it's taller and a bit squarer with an elegant grille-like pattern on the front. As with other XGIMI models, it features a laser light engine and 4K video quality, though the company didn't say if it had the same big Texas Instruments 0.78-inch DMD (digital micromirror device) chip as the original Titan model. The key new feature is a dynamic IRIS system that boosts native contrast to 10,000:1 for deeper blacks and brighter highlights. At the same time, it boasts new \"precision tuned optics\" (ie a better lens) also designed to improve contrast and color nuance. Another key feature is a re-engineered DMD architecture that can handle \"substantially higher light power densities,\" XGIMI says. This should allow for increased brightness, though the company didn't provide a figure in ANSI Lumens. It would be impressive if it topped the 5,000 Lumen Titan, though. Many other specs are lacking, like color accuracy in the Rec.2020 space. However, the company is promising a lot, saying that the Titan Noir Max will offer \"the stability, accuracy, and reliability required for color-critical work, studio environments, and high-end installations.\" At the same time, it's also targeted at home enthusiasts, promising to \"turn a blank wall into a cinematic event.\" XGIMI's Titan was only recently released for $3,999 but there's no word yet on the price or release date of the Titan Noir Max. Unlike the Horizon 20 series (which has a smaller 0.47-inch DMD chip) the Titan has received very few reviews so far, but one French projector site gave it a solid score. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/xgimis-titan-noir-max-4k-projector-has-a-dynamic-iris-for-increased-contrast-170044625.html?src=rss",
          "feed_position": 10
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/wearables/xgimi-best-known-for-projectors-launches-its-own-smart-glasses-170000968.html",
          "published_at": "Mon, 05 Jan 2026 17:00:00 +0000",
          "title": "XGIMI, best known for projectors, launches its own smart glasses",
          "standfirst": "Projector maker XGIMI has turned up at CES to launch its own range of AR glasses, but don’t get the champagne out too soon. MemoMind is a new brand under which its AI-infused eyewear will be sold, with two distinct units arriving at some point in the near future. The company says it has leveraged its know-how in optics and engineering to produce glasses which are unobtrusively light, all the better for blending into your daily life. Fashionistas will even be overjoyed to learn the glasses’ ship in eight different frame styles, five different temple designs and can be worn with prescription lenses. Memo One is the company’s flagship option, with dual-eye displays and integrated speakers so you can see and hear your AI assistant. The Memo Air, meanwhile, is a more stripped down model weighing just 28.9 grams which just has a single eye display. Unfortunately, the company is using microLED displays rather than waveguides, making them a far harder sell for a lot of would-be users. After all, putting something that small so close to your eye but behind your prescription means it’s a painful experience for short sighted folks to focus on text. As I explained in my Halliday review, this technology is no friend to the glasses wearers who would otherwise be the ideal early adopters.MemoMind LineupXGIMIThe glasses are just a vehicle for the company’s AI assistant, promising translation, summarization, note-taking, reminders and contextual guidance. Unlike some of its would-be rivals, XGIMI says its platform will switch between OpenAI, Azure and (Alibaba’s) Qwen depending on what it thinks will offer you the best result for each task. Naturally, we’ll need to get them in to test before passing final judgment on their qualities but, you can color us naturally hostile to those damn microLEDs until we’re convinced otherwise.XGIMI says the flagship Memo One will be available to pre-order “soon,” priced at $599, with additional models available further down the line. This article originally appeared on Engadget at https://www.engadget.com/wearables/xgimi-best-known-for-projectors-launches-its-own-smart-glasses-170000968.html?src=rss",
          "content": "Projector maker XGIMI has turned up at CES to launch its own range of AR glasses, but don’t get the champagne out too soon. MemoMind is a new brand under which its AI-infused eyewear will be sold, with two distinct units arriving at some point in the near future. The company says it has leveraged its know-how in optics and engineering to produce glasses which are unobtrusively light, all the better for blending into your daily life. Fashionistas will even be overjoyed to learn the glasses’ ship in eight different frame styles, five different temple designs and can be worn with prescription lenses. Memo One is the company’s flagship option, with dual-eye displays and integrated speakers so you can see and hear your AI assistant. The Memo Air, meanwhile, is a more stripped down model weighing just 28.9 grams which just has a single eye display. Unfortunately, the company is using microLED displays rather than waveguides, making them a far harder sell for a lot of would-be users. After all, putting something that small so close to your eye but behind your prescription means it’s a painful experience for short sighted folks to focus on text. As I explained in my Halliday review, this technology is no friend to the glasses wearers who would otherwise be the ideal early adopters.MemoMind LineupXGIMIThe glasses are just a vehicle for the company’s AI assistant, promising translation, summarization, note-taking, reminders and contextual guidance. Unlike some of its would-be rivals, XGIMI says its platform will switch between OpenAI, Azure and (Alibaba’s) Qwen depending on what it thinks will offer you the best result for each task. Naturally, we’ll need to get them in to test before passing final judgment on their qualities but, you can color us naturally hostile to those damn microLEDs until we’re convinced otherwise.XGIMI says the flagship Memo One will be available to pre-order “soon,” priced at $599, with additional models available further down the line. This article originally appeared on Engadget at https://www.engadget.com/wearables/xgimi-best-known-for-projectors-launches-its-own-smart-glasses-170000968.html?src=rss",
          "feed_position": 11,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/20251218-110941_%281%29.png"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/laptops/the-hp-omnibook-ultra-14-at-ces-2026-super-sleek-and-surprisingly-durable-170000330.html",
          "published_at": "Mon, 05 Jan 2026 17:00:00 +0000",
          "title": "The HP Omnibook Ultra 14 at CES 2026: Super sleek and surprisingly durable",
          "standfirst": "At CES 2026, HP is showing off its latest flagship consumer laptop: The Omnibook Ultra 14. It features an all-new super thin design that’s much tougher than it looks. According to HP, the Omnibook Ultra 14 is the “world’s most durably slim 14-inch consumer notebook,” which is a somewhat convoluted way of saying the system remains quite portable — just 0.42 inches thick — while still passing 20 different military standard tests (MIL-STD-810) for things like shock resistance, drops and extreme temperatures. The whole system is crafted from aluminum, though instead of taking a unibody approach like you see on Apple’s MacBooks, HP opted for forge stamped manufacturing which is said to give the laptop added strength and bend resistance. The result is a notebook that’s both 52 percent lighter than the previous model at 2.8 pounds and five percent thinner than a 2025 M4 MacBook Air 13. And after seeing it in person, I have to say it looks pretty slick, too. As you’d expect from a premium ultraportable, the Omnibook comes with a vivid 3K OLED display, up to 64GB of memory, 2TB of storage and your choice of either an Intel Core Ultra 3 CPU or a Snapdragon Elite X2 chip. That said, thanks to an exclusive partnership with Qualcomm, anyone planning on running a lot of AI-based apps on the Ultra 14 may want to go with the Snapdragon variant as it’ll come with a slightly more powerful NPU that maxes out at 85 TOPS (that’s trillions of operations per second) rather than the 80 TOPS you’d get from other OEMs. Furthermore, to help support strong sustained performance, the Ultra 14 is also the first Omnibook to feature a built-in vapor chamber. Granted, as a pretty straightforward ultraportable, this thing doesn’t have a ton of special features. But even so, I appreciate that HP didn’t cut corners regarding its keyboard, which has a nice feel that’s not too stiff or bouncy and sits above a rather large touchpad. The company even found room for quad speakers and three USB-C ports that offer Thunderbolt 4, power delivery (USB PD 3.1) and DisplayPort 2.1. My one small nitpick is that I would have liked to see an SD or microSD card reader as well, but considering HP’s emphasis on portability and toughness, I’m not surprised that it didn't make it. The other thing I’m not so sure about is the Omnibook name in general. It’s been a little while since HP axed the Spectre branding for its top tier consumer laptops and I kind of wish HP would bring it back as it sounds better and feels more befitting of a flagship system like this. Regardless, if you’re in the market for a premium 14-inch Windows laptop, the Omnibook Ultra 14 looks like it will be a very strong contender when it goes on sale later this month starting at $1,550.This article originally appeared on Engadget at https://www.engadget.com/computing/laptops/the-hp-omnibook-ultra-14-at-ces-2026-super-sleek-and-surprisingly-durable-170000330.html?src=rss",
          "content": "At CES 2026, HP is showing off its latest flagship consumer laptop: The Omnibook Ultra 14. It features an all-new super thin design that’s much tougher than it looks. According to HP, the Omnibook Ultra 14 is the “world’s most durably slim 14-inch consumer notebook,” which is a somewhat convoluted way of saying the system remains quite portable — just 0.42 inches thick — while still passing 20 different military standard tests (MIL-STD-810) for things like shock resistance, drops and extreme temperatures. The whole system is crafted from aluminum, though instead of taking a unibody approach like you see on Apple’s MacBooks, HP opted for forge stamped manufacturing which is said to give the laptop added strength and bend resistance. The result is a notebook that’s both 52 percent lighter than the previous model at 2.8 pounds and five percent thinner than a 2025 M4 MacBook Air 13. And after seeing it in person, I have to say it looks pretty slick, too. As you’d expect from a premium ultraportable, the Omnibook comes with a vivid 3K OLED display, up to 64GB of memory, 2TB of storage and your choice of either an Intel Core Ultra 3 CPU or a Snapdragon Elite X2 chip. That said, thanks to an exclusive partnership with Qualcomm, anyone planning on running a lot of AI-based apps on the Ultra 14 may want to go with the Snapdragon variant as it’ll come with a slightly more powerful NPU that maxes out at 85 TOPS (that’s trillions of operations per second) rather than the 80 TOPS you’d get from other OEMs. Furthermore, to help support strong sustained performance, the Ultra 14 is also the first Omnibook to feature a built-in vapor chamber. Granted, as a pretty straightforward ultraportable, this thing doesn’t have a ton of special features. But even so, I appreciate that HP didn’t cut corners regarding its keyboard, which has a nice feel that’s not too stiff or bouncy and sits above a rather large touchpad. The company even found room for quad speakers and three USB-C ports that offer Thunderbolt 4, power delivery (USB PD 3.1) and DisplayPort 2.1. My one small nitpick is that I would have liked to see an SD or microSD card reader as well, but considering HP’s emphasis on portability and toughness, I’m not surprised that it didn't make it. The other thing I’m not so sure about is the Omnibook name in general. It’s been a little while since HP axed the Spectre branding for its top tier consumer laptops and I kind of wish HP would bring it back as it sounds better and feels more befitting of a flagship system like this. Regardless, if you’re in the market for a premium 14-inch Windows laptop, the Omnibook Ultra 14 looks like it will be a very strong contender when it goes on sale later this month starting at $1,550.This article originally appeared on Engadget at https://www.engadget.com/computing/laptops/the-hp-omnibook-ultra-14-at-ces-2026-super-sleek-and-surprisingly-durable-170000330.html?src=rss",
          "feed_position": 13
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/lg-tvs-at-ces-2026-a-stunning-wallpaper-set-glorious-micro-rgb-colors-and-a-better-gallery-tv-033739600.html",
          "published_at": "Mon, 05 Jan 2026 16:46:20 +0000",
          "title": "LG TVs at CES 2026: A stunning Wallpaper set, glorious Micro RGB colors and a better Gallery TV",
          "standfirst": "We typically see LG TV announcements a bit before CES, but this year the company had a surprise in store. CES 2026 marks the return of LG's ultra-thin \"Wallpaper\" TV. The latest version sports a gorgeous OLED screen and wireless connectivity, and it's about as thin as a pencil. We were able to check out the new Wallpaper TV during a CES preview event, along with LG’s Gallery and Micro RGB sets. The company also announced refreshed OLED and LED sets for this year, but it's clear that 2026 will be filled with intriguing TVs for a variety of consumers.LG's 2026 Wallpaper OLED TVDevindra Hardawar for EngadgetThe Wallpaper TV (LG W6)If money were no object, I'd want a 100-inch LG Wallpaper TV in my family room immediately. It looks shockingly thin in person — almost as if it's some sort of sci-fi prop — and it delivers the rich colors and dark levels we expect from OLED. Cable management is also a cinch, since it requires just a single power cable. The A/V inputs are handled by LG's One Connect box, which you can position wirelessly up to 10 meters away from the TV. LG's 2026 Wallpaper OLED TV from the rearDevindra Hardawar for EngadgetThe LG W6 combines the best of LG's OLED technology, including \"Hyper Radiant Color\" for improved black levels and color, \"Brightness Booster Ultra\" to crank up luminance 3.9 times more than conventional OLEDs and a reflection free screen material. LG's Alpha 9 Gen 3 processor beefs up its performance, and its NPU also helps to improve upscaling and overall image performance. (And yes, you can also access generative AI features via Microsoft Copilot and Google Gemini, if you're into that sort of thing.)All of that adds up to one of the most remarkable TVs I've seen in years. I haven't been too enamored with other TV gimmicks lately, like everything trying to mimic Samsung's The Frame, or the usless 8K sets. But a super-thin wireless TV with the best OLED panel available? That's the stuff dreams are made of. LG's 2026 Gallery TVDevindra Hardawar for EngadgetThe Gallery TV competes with Samsung’s FrameWhile LG has made Gallery TVs before, in 2026 it's making a more concerted effort to take on Samsung's popular Frame TV. LG says the new sets were designed with the help of museum curators, which helps the \"Gallery Mode\" adjust brightness and contrast to specific works of art. They also ship with magnetic frame-like bezels, and they have anti-reflective screens to help make the art shine. In person, the new Gallery TV looks fine, though it's easy to tell that the colors and contrast levels don't match LG's premium OLED TVs. To avoid burn-in issues, these sets feature Mini LED panels. As I noted above, I'm not the core consumer for one of these TVs, but it's nice to see more competition against Samsung's Frame TVs. (Despite pioneering the idea of TVs displaying art, the Frame sets are still fairly mediocre when it comes to actually watching TV shows and movies.) LG's Micro RGB TVDevindra Hardawar for EngadgetMicro RGB looks like a genuine Mini LED upgradeAs if we needed more TV acronyms to worry about, say hello to Micro RGB, a new technology built atop Mini LED to cover vastly more color range. Just don't confuse it with Micro LED, which is the wildly expensive evolutionary step forward for OLED. LG already announced its Micro RGB set a few weeks ago, but that didn't prepare me for standing in front of the 100-inch demo TV it brought to CES. Throughout a variety of clips, colors looked wonderfully rich, and the overall texture of the images looked surprisingly life-like. I'd have to compare it to LG's Wall TV side-by-side to truly see how Micro RGB competes with OLED, but technically OLED should still offer better contrast and black levels, since each of its pixels are self-emissive. But sure, if I couldn't get a 100-inch Wall TV in my family room, I certainly wouldn't turn down an enormous Micro RGB. What about LG's other OLED TVs?All of the next-generation OLED technology in the wallpaper TV will also make its way into LG's G6 OLED models, while the new C6 and other lines will see improvements of their own. All I can say is that the new G6 OLED looked impressive, with a noticeably brighter picture and HDR elements compared to G-series OLEDs from several years ago. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/lg-tvs-at-ces-2026-a-stunning-wallpaper-set-glorious-micro-rgb-colors-and-a-better-gallery-tv-033739600.html?src=rss",
          "content": "We typically see LG TV announcements a bit before CES, but this year the company had a surprise in store. CES 2026 marks the return of LG's ultra-thin \"Wallpaper\" TV. The latest version sports a gorgeous OLED screen and wireless connectivity, and it's about as thin as a pencil. We were able to check out the new Wallpaper TV during a CES preview event, along with LG’s Gallery and Micro RGB sets. The company also announced refreshed OLED and LED sets for this year, but it's clear that 2026 will be filled with intriguing TVs for a variety of consumers.LG's 2026 Wallpaper OLED TVDevindra Hardawar for EngadgetThe Wallpaper TV (LG W6)If money were no object, I'd want a 100-inch LG Wallpaper TV in my family room immediately. It looks shockingly thin in person — almost as if it's some sort of sci-fi prop — and it delivers the rich colors and dark levels we expect from OLED. Cable management is also a cinch, since it requires just a single power cable. The A/V inputs are handled by LG's One Connect box, which you can position wirelessly up to 10 meters away from the TV. LG's 2026 Wallpaper OLED TV from the rearDevindra Hardawar for EngadgetThe LG W6 combines the best of LG's OLED technology, including \"Hyper Radiant Color\" for improved black levels and color, \"Brightness Booster Ultra\" to crank up luminance 3.9 times more than conventional OLEDs and a reflection free screen material. LG's Alpha 9 Gen 3 processor beefs up its performance, and its NPU also helps to improve upscaling and overall image performance. (And yes, you can also access generative AI features via Microsoft Copilot and Google Gemini, if you're into that sort of thing.)All of that adds up to one of the most remarkable TVs I've seen in years. I haven't been too enamored with other TV gimmicks lately, like everything trying to mimic Samsung's The Frame, or the usless 8K sets. But a super-thin wireless TV with the best OLED panel available? That's the stuff dreams are made of. LG's 2026 Gallery TVDevindra Hardawar for EngadgetThe Gallery TV competes with Samsung’s FrameWhile LG has made Gallery TVs before, in 2026 it's making a more concerted effort to take on Samsung's popular Frame TV. LG says the new sets were designed with the help of museum curators, which helps the \"Gallery Mode\" adjust brightness and contrast to specific works of art. They also ship with magnetic frame-like bezels, and they have anti-reflective screens to help make the art shine. In person, the new Gallery TV looks fine, though it's easy to tell that the colors and contrast levels don't match LG's premium OLED TVs. To avoid burn-in issues, these sets feature Mini LED panels. As I noted above, I'm not the core consumer for one of these TVs, but it's nice to see more competition against Samsung's Frame TVs. (Despite pioneering the idea of TVs displaying art, the Frame sets are still fairly mediocre when it comes to actually watching TV shows and movies.) LG's Micro RGB TVDevindra Hardawar for EngadgetMicro RGB looks like a genuine Mini LED upgradeAs if we needed more TV acronyms to worry about, say hello to Micro RGB, a new technology built atop Mini LED to cover vastly more color range. Just don't confuse it with Micro LED, which is the wildly expensive evolutionary step forward for OLED. LG already announced its Micro RGB set a few weeks ago, but that didn't prepare me for standing in front of the 100-inch demo TV it brought to CES. Throughout a variety of clips, colors looked wonderfully rich, and the overall texture of the images looked surprisingly life-like. I'd have to compare it to LG's Wall TV side-by-side to truly see how Micro RGB competes with OLED, but technically OLED should still offer better contrast and black levels, since each of its pixels are self-emissive. But sure, if I couldn't get a 100-inch Wall TV in my family room, I certainly wouldn't turn down an enormous Micro RGB. What about LG's other OLED TVs?All of the next-generation OLED technology in the wallpaper TV will also make its way into LG's G6 OLED models, while the new C6 and other lines will see improvements of their own. All I can say is that the new G6 OLED looked impressive, with a noticeably brighter picture and HDR elements compared to G-series OLEDs from several years ago. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/lg-tvs-at-ces-2026-a-stunning-wallpaper-set-glorious-micro-rgb-colors-and-a-better-gallery-tv-033739600.html?src=rss",
          "feed_position": 15,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/LG_CES_2026-5.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/how-to-watch-the-amd-ces-2026-keynote-with-ceo-lisa-su-live-190012438.html",
          "published_at": "Mon, 05 Jan 2026 16:42:47 +0000",
          "title": "How to watch the AMD CES 2026 keynote with CEO Lisa Su live",
          "standfirst": "You'll want to tune into AMD's kickoff for CES 2026 today if you're interested in the company's latest AI development and (possibly) new Ryzen chips. This is where the company will lay out its vision for AI applications across its consumer and enterprise offerings. The presentation — which is the lead keynote for CES 2026 — will be led by CEO Dr. Lisa Su. We'll tell you how to tune in to the livestream and what else you can expect to see. How to watch AMD's keynote live Dr. Su will deliver a keynote speech from the Palazzo Ballroom at the Venetian on Monday, January 5 at 9:30PM ET (6:30PM PT). You can watch the event live on the CES YouTube channel (we've embedded the livestream below). What to expect While AMD says it's keeping its product details under wraps, we can expect \"updates on AI solutions, from cloud to enterprise, edge and devices.\" It's also likely that AMD will unveil its new versions of the Ryzen chips during its keynote on Monday, as Su will talk about the \"advancements driven by Ryzen CPUs.\" That could include the Ryzen 7 9850X3D, which is expected to have better single-threaded performance. Additionally, we can expect to see the Ryzen 9000G series, which is potentially built with AMD's Zen 5 architecture. Regarding AI, AMD could further discuss its new FSR Redstone technology, which it previously previewed on December 10. AMD's upscaling tech aims to close the gap on NVIDIA's DLSS 4, which was announced during CES 2025. Su's presentation caps off CES's press day, so she'll be taking the stage in the hours after rivals NVIDIA and Intel present their chipmaking and AI plans to the world. As a reminder of how cross-linked these companies have become: OpenAI has pledged billions of dollars of hardware orders to AMD, while rival NVIDIA has invested billions in OpenAI — and taken a stake worth billions in Intel, too. This article originally appeared on Engadget at https://www.engadget.com/computing/how-to-watch-the-amd-ces-2026-keynote-with-ceo-lisa-su-live-190012438.html?src=rss",
          "content": "You'll want to tune into AMD's kickoff for CES 2026 today if you're interested in the company's latest AI development and (possibly) new Ryzen chips. This is where the company will lay out its vision for AI applications across its consumer and enterprise offerings. The presentation — which is the lead keynote for CES 2026 — will be led by CEO Dr. Lisa Su. We'll tell you how to tune in to the livestream and what else you can expect to see. How to watch AMD's keynote live Dr. Su will deliver a keynote speech from the Palazzo Ballroom at the Venetian on Monday, January 5 at 9:30PM ET (6:30PM PT). You can watch the event live on the CES YouTube channel (we've embedded the livestream below). What to expect While AMD says it's keeping its product details under wraps, we can expect \"updates on AI solutions, from cloud to enterprise, edge and devices.\" It's also likely that AMD will unveil its new versions of the Ryzen chips during its keynote on Monday, as Su will talk about the \"advancements driven by Ryzen CPUs.\" That could include the Ryzen 7 9850X3D, which is expected to have better single-threaded performance. Additionally, we can expect to see the Ryzen 9000G series, which is potentially built with AMD's Zen 5 architecture. Regarding AI, AMD could further discuss its new FSR Redstone technology, which it previously previewed on December 10. AMD's upscaling tech aims to close the gap on NVIDIA's DLSS 4, which was announced during CES 2025. Su's presentation caps off CES's press day, so she'll be taking the stage in the hours after rivals NVIDIA and Intel present their chipmaking and AI plans to the world. As a reminder of how cross-linked these companies have become: OpenAI has pledged billions of dollars of hardware orders to AMD, while rival NVIDIA has invested billions in OpenAI — and taken a stake worth billions in Intel, too. This article originally appeared on Engadget at https://www.engadget.com/computing/how-to-watch-the-amd-ces-2026-keynote-with-ceo-lisa-su-live-190012438.html?src=rss",
          "feed_position": 16
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html",
          "published_at": "Mon, 05 Jan 2026 16:08:29 +0000",
          "title": "Everything announced at CES 2026",
          "standfirst": "It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future. Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung has already held its First Look presentation, which focuses on home products, while LG has shown off a wide array of TVs. Presentations from NVIDIA, Sony, Lego, Hyundai and others are yet to come.You can catch up on all of the big CES 2026 announcements (and some of the more offbeat gizmos that are being shown off at the event) right here. We'll be keeping this story updated throughout the week. Micro RGB TVs Samsung's 130-inch Micro RGB TV. Devindra Hardawar for EngadgetMicro RGB is a term you can expect to hear about quite a bit in the coming months and years, especially when you're shopping for your next TV. Micro RGB is a new tech that's similar to Mini LED, though it uses red, green and blue LEDs instead of white backlights. Contrast ratios aren't quite as high as those on Micro LED and OLED displays, since the pixels can't be turned on and off individually. However, Micro RGB units are said to be brighter and more color accurate than TVs that use other display tech, in part because the LEDs in these screens offer smaller, more customizable dimming zones. We're seeing more of these TVs pop up at CES 2026, including a mammoth 130-inch concept model that Samsung brought to Las Vegas. The company unveiled its first Micro RGB TV in August, — that’s a 115-inch, $29,999 model. This year, you can expect it to start offering Micro RGB TVs in 55-, 65- and 75-inch sizes. There are also 85-, 100- and 115-inch models on the way.LG revealed its first Micro RGB set at CES as well. The largest variant is 100 inches, but there are 86- and 75-inch models too. Elsewhere, LG showed off its latest Wallpaper TV, which is a 100-inch OLED display. We also got a look at LG's new Gallery TV — The Gallery is the company's take on Samsung's Frame TV format.Other new TVs and OS updatesEmber Artline TV.AmazonWe’ve got another competitor to The Frame, as Amazon has entered that scene with the Ember Artline TV. The 4K OLED model has Amazon Photos integration and you can choose from 2,000 pieces of free art to show on the screen. The Ember Artline can switch on or off automatically when someone enters or leaves the room. It runs on the Fire TV platform and (of course) there’s Alexa+ integration, along with support for Dolby Vision, HDR10+ and Wi-Fi 6. The Ember Artline is expected to start shipping this spring. It starts at $899 for the 55-inch model.The rounder redesigned Fire TV UI.AmazonSpeaking of Fire TV, Amazon has revamped the platform’s user interface with rounded corners for show, movie and app tiles; a little more space for said tiles; and typography and color gradient changes. The company has reworked the platform’s codebase as well, and it says the Fire TV OS will deliver speed boosts of up to 20 to 30 percent. Amazon will start rolling out the updated UI next month.On the Google side of TV land, you can expect more Gemini-powered features. The company is bringing the ability to search Google Photos for certain moments and people to Google TV, along with the options to remix photos into different styles and create slideshows on the fly. The Veo and Nano Banana AI video and photo generation models are coming to Google TV as well. You can also expect the ability to adjust TV settings using your voice. These Gemini features are coming to Google TV-powered TCL models first, then other devices in the following months.SamsungSamsung's Music Studio 5 speakers at CES 2026.Billy Steele for EngadgetSamsung being Samsung, the company had a lot more up its sleeve at CES than just TVs. In the leadup to the event, it announced its two new soundbars (we're had some hands-on time with one of those), the stylish Music Studio speakers (we've got some IRL impressions of those), a bunch of monitors, the refreshed FreeStyle+ projector (we've checked that out too). It also announced plans to bring Google Photos to TVs.At the First Look showcase on Sunday, Samsung talked up \"AI experiences everywhere. For everyone\" (sigh). Here, we saw more TVs, such as the thin S95H OLED, which has a zero-gap mount that allows you to position the unit flush against a wall. First Look has long been focused on home products. Naturally, Samsung execs discussed some features for the company's fridges, such as ​​recipe selection updates, AI cooling tech and Google Gemini-powered AI Vision that's said to be able to recognize more items and help you figure out what you need to buy without having to manually take inventory. FoodNote, meanwhile, is a weekly summary that breaks down what has gone in and out of your fridge.Moreover, Samsung highlighted the Samsung Bespoke AI Laundry Combo and its new AI wash cycle. With the new Air Dresser — which has an Auto Wrinkle Care feature — Samsung aims to do away with irons (thank you, Samsung). As for the Bespoke AI smart vacuum and mop, that can apparently keep an eye on your pets when you're not home.LGLG's CLOiD robot.LGLikewise, LG brought other non-TV tech to CES. The company is shining the spotlight on its CLOiD robot. Like the far creepier-looking 1X Neo, the CLOiD is designed to help with household tasks such as starting laundry cycles, folding clothes, unloading the dishwasher and serving food. This appears to be more of a concept than something you'll be able to buy anytime soon, but we should get a closer look at the CLOiD in person this week.The company also debuted the LG Sound Suite, a modular home audio system it developed in conjunction with Dolby to take on the likes of Sonos. Just ahead of CES, LG pulled back the curtain on a new batch of xboom speakers as well as some monitors and ultralight Gram laptops that are made with a material it's calling Aerominum. L'OrealA pair of transparent eye masks with wires and bulbs inside them.L'Oréal L'Oreal often brings some interesting beauty tech to CES and the company did so again this year with a trio of gadgets. The LED Eye Mask uses red light and near-infrared light to address the likes of puffiness, discoloration and fine lines.The LED Face Mask seems to be a more pliable version of masks that we've seen from the likes of Dr. Dennis Gross, Omnilux, Therabody and Shark in recent years. However, it's only in prototype form for now and it isn't expected to hit the market until next year. The Light Straight + Multi-styler uses infrared light to help dry and style hair in similar fashion to L'Oreal's AirLight Pro. It's said to have sensors that employ \"built-in proprietary algorithms and machine learning\" so they can adapt to your gestures and \"maximize individual experience.\" L'Oreal claims that while traditional straighteners can operate at 400°F or higher (temperatures that can damage hair), its latest innovation \"effectively straightens hair while never exceeding 320°F.\" You can expect the Light Straight to arrive in 2027 as well.Laptops and desktopsLG Gram ProEngadgetIt's CES, so of course we're going to see a bunch of laptops and desktops. The majority of those will surely emerge after NVIDIA's press conference on Monday evening, though we've already had a peek at LG's Aerominum laptops.MobileBack at CES 2024, we got to try out a physical keyboard phone accessory from Clicks. Fast forward two years, and the brand is making its own Blackberry-esque phones, as well as a new physical phone keyboard accessory. The Android 16-based Clicks Communicator has a tactile keyboard with a fingerprint sensor in the spacebar, a 4-inch OLED display, a 3.5mm headphone jack (hooray!) and expandable microSD storage up to 2TB. You can reserve one now for $399 — the price will increase to $499 on February 27.As for the new accessory, Clicks is calling that the Power Keyboard. It connects to an iOS or Android phone via MagSafe or Qi2, and it can operate as a power bank in a pinch thanks to the 2,150 mAh battery. The Power Keyboard has Bluetooth functionality as well, so you can use it with devices like tablets, smart TVs and virtual reality headsets. Pre-orders are open now and the Power Keyboard is expected to ship in the spring. Early adopters can lock in a pre-order for $79 before the retail price jumps to $110.The Punkt MC03 phone.PunktThose who prefer their mobile phones to have fewer bells and whistles might be interested in the latest model from Punkt. The MC03 is a nifty-looking touchscreen model that runs on the privacy- and security-centric AphyOS, which is based on the Android Open Source Project. It has a UI that borrows a page out of the Light Phone's playbook, though you can still install any Android app. The MC03 will hit European markets this month for €699 / CHF699 / £610. There's a mandatory subscription, however. You get a year of access included with a phone purchase, then it's a €10 / CHF10 / £9 monthly fee (paying for a long-term plan up front can reduce the cost by up to 60 percent).AI Amazon introduced Alexa.com to Alexa+ Early Access customers.AmazonNo prizes for guessing that there's going to be a ton of AI-related news at CES this year. Amazon, for one, announced that it's rolling out a web-based version of Alexa+. That means you won't necessarily need to have an Amazon device to try out the generative AI-powered assistant. However, Alexa+ Early Access customers are getting first dibs on the web version.Two Sweekar devices are pictured on a table, one wearing a pink and blue snowboarder outfit and the other (behind it) wearing a cowboy hat and outfitKarissa Bell for EngadgetThere are a boatload of AI-powered devices on the CES show floor too. One that we saw early on is a Tamagotchi-style virtual pet from a startup called Takway. The Sweekar will remember your interactions with it (you'll need to feed and play with the pet to keep it healthy and happy). Once it's all grown up, the Sweekar will head off on virtual adventures and tell you about its exploits when it \"returns.\" Takway will soon start a Kickstarter campaign for the Sweekar, which will likely cost between $100 and $150.The Fraimic art display at CESAmy Skorheim for EngadgetWe also saw the Fraimic, an E Ink display that can tap into OpenAI to generate images. There's no subscription for the Fraimic (which costs $399 for the standard size, which has a 13-inch display) and you get 100 AI-generated images per year included with your purchase. Pre-orders are open now and the Fraimic is expected to start shipping in this spring.MindClip held in a hand.Daniel Cooper for EngadgetSome companies still trying to make wearable AI devices happen. SwitchBot has a wearable mic called the AI MindClip, which can seemingly record and transcribe everything you say (no, thank you!). Plaid, meanwhile, brought its NotePin follow up to the dance. This time around, the NotePin S has a button that you can push to record conversations. You can also press the button to flag key moments for an AI-generated summary to focus on. The NotePin S is available now for $179, should you be enticed to buy such a thing.This article originally appeared on Engadget at https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss",
          "content": "It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future. Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung has already held its First Look presentation, which focuses on home products, while LG has shown off a wide array of TVs. Presentations from NVIDIA, Sony, Lego, Hyundai and others are yet to come.You can catch up on all of the big CES 2026 announcements (and some of the more offbeat gizmos that are being shown off at the event) right here. We'll be keeping this story updated throughout the week. Micro RGB TVs Samsung's 130-inch Micro RGB TV. Devindra Hardawar for EngadgetMicro RGB is a term you can expect to hear about quite a bit in the coming months and years, especially when you're shopping for your next TV. Micro RGB is a new tech that's similar to Mini LED, though it uses red, green and blue LEDs instead of white backlights. Contrast ratios aren't quite as high as those on Micro LED and OLED displays, since the pixels can't be turned on and off individually. However, Micro RGB units are said to be brighter and more color accurate than TVs that use other display tech, in part because the LEDs in these screens offer smaller, more customizable dimming zones. We're seeing more of these TVs pop up at CES 2026, including a mammoth 130-inch concept model that Samsung brought to Las Vegas. The company unveiled its first Micro RGB TV in August, — that’s a 115-inch, $29,999 model. This year, you can expect it to start offering Micro RGB TVs in 55-, 65- and 75-inch sizes. There are also 85-, 100- and 115-inch models on the way.LG revealed its first Micro RGB set at CES as well. The largest variant is 100 inches, but there are 86- and 75-inch models too. Elsewhere, LG showed off its latest Wallpaper TV, which is a 100-inch OLED display. We also got a look at LG's new Gallery TV — The Gallery is the company's take on Samsung's Frame TV format.Other new TVs and OS updatesEmber Artline TV.AmazonWe’ve got another competitor to The Frame, as Amazon has entered that scene with the Ember Artline TV. The 4K OLED model has Amazon Photos integration and you can choose from 2,000 pieces of free art to show on the screen. The Ember Artline can switch on or off automatically when someone enters or leaves the room. It runs on the Fire TV platform and (of course) there’s Alexa+ integration, along with support for Dolby Vision, HDR10+ and Wi-Fi 6. The Ember Artline is expected to start shipping this spring. It starts at $899 for the 55-inch model.The rounder redesigned Fire TV UI.AmazonSpeaking of Fire TV, Amazon has revamped the platform’s user interface with rounded corners for show, movie and app tiles; a little more space for said tiles; and typography and color gradient changes. The company has reworked the platform’s codebase as well, and it says the Fire TV OS will deliver speed boosts of up to 20 to 30 percent. Amazon will start rolling out the updated UI next month.On the Google side of TV land, you can expect more Gemini-powered features. The company is bringing the ability to search Google Photos for certain moments and people to Google TV, along with the options to remix photos into different styles and create slideshows on the fly. The Veo and Nano Banana AI video and photo generation models are coming to Google TV as well. You can also expect the ability to adjust TV settings using your voice. These Gemini features are coming to Google TV-powered TCL models first, then other devices in the following months.SamsungSamsung's Music Studio 5 speakers at CES 2026.Billy Steele for EngadgetSamsung being Samsung, the company had a lot more up its sleeve at CES than just TVs. In the leadup to the event, it announced its two new soundbars (we're had some hands-on time with one of those), the stylish Music Studio speakers (we've got some IRL impressions of those), a bunch of monitors, the refreshed FreeStyle+ projector (we've checked that out too). It also announced plans to bring Google Photos to TVs.At the First Look showcase on Sunday, Samsung talked up \"AI experiences everywhere. For everyone\" (sigh). Here, we saw more TVs, such as the thin S95H OLED, which has a zero-gap mount that allows you to position the unit flush against a wall. First Look has long been focused on home products. Naturally, Samsung execs discussed some features for the company's fridges, such as ​​recipe selection updates, AI cooling tech and Google Gemini-powered AI Vision that's said to be able to recognize more items and help you figure out what you need to buy without having to manually take inventory. FoodNote, meanwhile, is a weekly summary that breaks down what has gone in and out of your fridge.Moreover, Samsung highlighted the Samsung Bespoke AI Laundry Combo and its new AI wash cycle. With the new Air Dresser — which has an Auto Wrinkle Care feature — Samsung aims to do away with irons (thank you, Samsung). As for the Bespoke AI smart vacuum and mop, that can apparently keep an eye on your pets when you're not home.LGLG's CLOiD robot.LGLikewise, LG brought other non-TV tech to CES. The company is shining the spotlight on its CLOiD robot. Like the far creepier-looking 1X Neo, the CLOiD is designed to help with household tasks such as starting laundry cycles, folding clothes, unloading the dishwasher and serving food. This appears to be more of a concept than something you'll be able to buy anytime soon, but we should get a closer look at the CLOiD in person this week.The company also debuted the LG Sound Suite, a modular home audio system it developed in conjunction with Dolby to take on the likes of Sonos. Just ahead of CES, LG pulled back the curtain on a new batch of xboom speakers as well as some monitors and ultralight Gram laptops that are made with a material it's calling Aerominum. L'OrealA pair of transparent eye masks with wires and bulbs inside them.L'Oréal L'Oreal often brings some interesting beauty tech to CES and the company did so again this year with a trio of gadgets. The LED Eye Mask uses red light and near-infrared light to address the likes of puffiness, discoloration and fine lines.The LED Face Mask seems to be a more pliable version of masks that we've seen from the likes of Dr. Dennis Gross, Omnilux, Therabody and Shark in recent years. However, it's only in prototype form for now and it isn't expected to hit the market until next year. The Light Straight + Multi-styler uses infrared light to help dry and style hair in similar fashion to L'Oreal's AirLight Pro. It's said to have sensors that employ \"built-in proprietary algorithms and machine learning\" so they can adapt to your gestures and \"maximize individual experience.\" L'Oreal claims that while traditional straighteners can operate at 400°F or higher (temperatures that can damage hair), its latest innovation \"effectively straightens hair while never exceeding 320°F.\" You can expect the Light Straight to arrive in 2027 as well.Laptops and desktopsLG Gram ProEngadgetIt's CES, so of course we're going to see a bunch of laptops and desktops. The majority of those will surely emerge after NVIDIA's press conference on Monday evening, though we've already had a peek at LG's Aerominum laptops.MobileBack at CES 2024, we got to try out a physical keyboard phone accessory from Clicks. Fast forward two years, and the brand is making its own Blackberry-esque phones, as well as a new physical phone keyboard accessory. The Android 16-based Clicks Communicator has a tactile keyboard with a fingerprint sensor in the spacebar, a 4-inch OLED display, a 3.5mm headphone jack (hooray!) and expandable microSD storage up to 2TB. You can reserve one now for $399 — the price will increase to $499 on February 27.As for the new accessory, Clicks is calling that the Power Keyboard. It connects to an iOS or Android phone via MagSafe or Qi2, and it can operate as a power bank in a pinch thanks to the 2,150 mAh battery. The Power Keyboard has Bluetooth functionality as well, so you can use it with devices like tablets, smart TVs and virtual reality headsets. Pre-orders are open now and the Power Keyboard is expected to ship in the spring. Early adopters can lock in a pre-order for $79 before the retail price jumps to $110.The Punkt MC03 phone.PunktThose who prefer their mobile phones to have fewer bells and whistles might be interested in the latest model from Punkt. The MC03 is a nifty-looking touchscreen model that runs on the privacy- and security-centric AphyOS, which is based on the Android Open Source Project. It has a UI that borrows a page out of the Light Phone's playbook, though you can still install any Android app. The MC03 will hit European markets this month for €699 / CHF699 / £610. There's a mandatory subscription, however. You get a year of access included with a phone purchase, then it's a €10 / CHF10 / £9 monthly fee (paying for a long-term plan up front can reduce the cost by up to 60 percent).AI Amazon introduced Alexa.com to Alexa+ Early Access customers.AmazonNo prizes for guessing that there's going to be a ton of AI-related news at CES this year. Amazon, for one, announced that it's rolling out a web-based version of Alexa+. That means you won't necessarily need to have an Amazon device to try out the generative AI-powered assistant. However, Alexa+ Early Access customers are getting first dibs on the web version.Two Sweekar devices are pictured on a table, one wearing a pink and blue snowboarder outfit and the other (behind it) wearing a cowboy hat and outfitKarissa Bell for EngadgetThere are a boatload of AI-powered devices on the CES show floor too. One that we saw early on is a Tamagotchi-style virtual pet from a startup called Takway. The Sweekar will remember your interactions with it (you'll need to feed and play with the pet to keep it healthy and happy). Once it's all grown up, the Sweekar will head off on virtual adventures and tell you about its exploits when it \"returns.\" Takway will soon start a Kickstarter campaign for the Sweekar, which will likely cost between $100 and $150.The Fraimic art display at CESAmy Skorheim for EngadgetWe also saw the Fraimic, an E Ink display that can tap into OpenAI to generate images. There's no subscription for the Fraimic (which costs $399 for the standard size, which has a 13-inch display) and you get 100 AI-generated images per year included with your purchase. Pre-orders are open now and the Fraimic is expected to start shipping in this spring.MindClip held in a hand.Daniel Cooper for EngadgetSome companies still trying to make wearable AI devices happen. SwitchBot has a wearable mic called the AI MindClip, which can seemingly record and transcribe everything you say (no, thank you!). Plaid, meanwhile, brought its NotePin follow up to the dance. This time around, the NotePin S has a button that you can push to record conversations. You can also press the button to flag key moments for an AI-generated summary to focus on. The NotePin S is available now for $179, should you be enticed to buy such a thing.This article originally appeared on Engadget at https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss",
          "feed_position": 17,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Samsung_Micro_RGB-1.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/soundcores-nebula-p1i-portable-projector-launches-in-early-2026-for-369-160020321.html",
          "published_at": "Mon, 05 Jan 2026 16:00:20 +0000",
          "title": "Soundcore's Nebula P1i portable projector launches in early 2026 for $369",
          "standfirst": "If you had your eye on Nebula P1 projector but $799 is too rich for your blood, Soundcore has a new option at CES 2026. The Anker affiliate just unveiled the 1080p Nebula P1i portable projector that's less than half the price and even more portable, albeit with less brightness. Instead of detachable speakers like the Nebula P1, the P1i's speakers are embedded in the projector and can be flipped open and tilted through 180 degrees. It also lacks the P1's tilting projector body and instead offers a stand that can incline the projector from zero to 12 degrees. Though it offers the same 1080p maximum resolution as the Nebula P1, it's a bit less bright at 400 instead of 650 ANSI Lumens. Like the more expensive model, though, it supports autofocus, auto keystone correction and screen fit, which will make setup easy for spontaneous outdoor use. And like other projectors in the Nebula lineup, it supports Google TV so you can stream Netflix, Prime Video, Disney and other apps. Best of all, the Nebula P1i is priced at a very reasonable $369 and is set to arrive in \"early 2026,\" according to Soundcore. Soundcore Soundcore also revealed availability for its Nebula X1 Pro party projector that marries its impressive Nebula X1 projector with a 160W sound system, all in one assembly. As a reminder, the projector delivers 3,500 ANSI lumens and an impressive 110 percent coverage of the Rec.2020 HDR color space. The sound system, meanwhile, features a floating subwoofer, 80W soundbar speakers and two wireless satellite speakers for 7.1.4 surround sound. It even supports Dolby Atmos, which the projector on its own doesn't do, while offering IP43 protection from light rain and dust if you want to use it outdoors. The Nebula X1 Pro is tentatively set to launch on January 20, 2026 for $4,999, though you currently preorder one on Soundcore.com for $4,499. If you need a screen, the company is offering a 200-inch inflatable model for $2,000. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/soundcores-nebula-p1i-portable-projector-launches-in-early-2026-for-369-160020321.html?src=rss",
          "content": "If you had your eye on Nebula P1 projector but $799 is too rich for your blood, Soundcore has a new option at CES 2026. The Anker affiliate just unveiled the 1080p Nebula P1i portable projector that's less than half the price and even more portable, albeit with less brightness. Instead of detachable speakers like the Nebula P1, the P1i's speakers are embedded in the projector and can be flipped open and tilted through 180 degrees. It also lacks the P1's tilting projector body and instead offers a stand that can incline the projector from zero to 12 degrees. Though it offers the same 1080p maximum resolution as the Nebula P1, it's a bit less bright at 400 instead of 650 ANSI Lumens. Like the more expensive model, though, it supports autofocus, auto keystone correction and screen fit, which will make setup easy for spontaneous outdoor use. And like other projectors in the Nebula lineup, it supports Google TV so you can stream Netflix, Prime Video, Disney and other apps. Best of all, the Nebula P1i is priced at a very reasonable $369 and is set to arrive in \"early 2026,\" according to Soundcore. Soundcore Soundcore also revealed availability for its Nebula X1 Pro party projector that marries its impressive Nebula X1 projector with a 160W sound system, all in one assembly. As a reminder, the projector delivers 3,500 ANSI lumens and an impressive 110 percent coverage of the Rec.2020 HDR color space. The sound system, meanwhile, features a floating subwoofer, 80W soundbar speakers and two wireless satellite speakers for 7.1.4 surround sound. It even supports Dolby Atmos, which the projector on its own doesn't do, while offering IP43 protection from light rain and dust if you want to use it outdoors. The Nebula X1 Pro is tentatively set to launch on January 20, 2026 for $4,999, though you currently preorder one on Soundcore.com for $4,499. If you need a screen, the company is offering a 200-inch inflatable model for $2,000. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/soundcores-nebula-p1i-portable-projector-launches-in-early-2026-for-369-160020321.html?src=rss",
          "feed_position": 21,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2026-01/78936520-ea0f-11f0-b93d-34c3841957f7"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/smart-home/ankers-ces-smart-home-lineup-includes-a-1600-eufy-robovac-160000133.html",
          "published_at": "Mon, 05 Jan 2026 16:00:00 +0000",
          "title": "Anker's CES smart home lineup includes a $1,600 Eufy robovac",
          "standfirst": "It seems like only a few years ago that Anker made nothing more than batteries and chargers. But 15 years into its history, the company's CES portfolio continues to illustrate how much it's expanded. Among other announcements, the company has a new robot vacuum, video doorbell, outdoor light and smart lock. They're all rolling out under Anker's Eufy smart home brand.The company hopes its Eufy Clean Robot Vacuum Omni S2 will be your next robovac. The $1,600 device vacuums with 100 AW suction, and it mops, too. Anker claims the vac works on shag carpets up to about 2 inches (5 cm) in pile height. It has an 11.4-inch rolling mop that applies up to 15 N of downward pressure.As is increasingly common in robovacs, Omni S2 uses AI to identify floor types and adjust several factors on the fly. These include cleaning mode, suction, scrubbing force and wheel height. The machine can also generate lightly oxidizing disinfectants (a hypochlorous acid and ozone water solution) inside its tank.Presales for the Eufy Clean Robot Vacuum Omni S2 begin on January 6. Shipping and in-store availability for the $1,600 robovac kicks off on January 20.Eufy Video Doorbell S4AnkerAnker also has a new doorbell, the Eufy Video Doorbell S4. It includes an AI-powered people detection feature with auto-framing. The doorbell has 3,024 x 3,024 resolution at 24 FPS and offers a panoramic (180 x 180-degree) view.You can use the doorbell in either wired or wireless mode, and it supports solar charging. The Video Doorbell S4 is scheduled to launch \"later in Q1\" for $280.Eufy Solar Wall Light Cam S4AnkerAlong similar lines, there's the Solar Wall Light Cam S4. The outdoor light has a built-in 4K camera with an f/1.6 aperture. The light has a color temperature ranging from warm white (2700K) to cool white (6500K).As its name suggests, it supports solar charging. It’s bundled with a detachable 2W solar panel. It also has a 10,000mAh battery that's rated for up to two months. Anker says the Solar Wall Light Cam S4 will arrive in Q1 for $200.Eufy Smart Lock E40AnkerFinally, Anker has a new lock / camera combo: the Eufy Smart Lock E40. It has \"advanced 3D face recognition\" that can identify you and your family from up to 10 feet away, unlocking accordingly. Its camera has 2K resolution and a 135-degree field of view, which should capture visitors from head to toe. The lock has a removable 15,000mAh battery (rated for six months) and a smaller 800mAh backup battery to keep things running while the main one is charging.The Smart Lock E40 supports Matter, Apple Home, Amazon Alexa, Google Home Assistant and Samsung SmartThings. It's expected to launch in Q1 at Home Depot (online and in stores) for $300.This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/ankers-ces-smart-home-lineup-includes-a-1600-eufy-robovac-160000133.html?src=rss",
          "content": "It seems like only a few years ago that Anker made nothing more than batteries and chargers. But 15 years into its history, the company's CES portfolio continues to illustrate how much it's expanded. Among other announcements, the company has a new robot vacuum, video doorbell, outdoor light and smart lock. They're all rolling out under Anker's Eufy smart home brand.The company hopes its Eufy Clean Robot Vacuum Omni S2 will be your next robovac. The $1,600 device vacuums with 100 AW suction, and it mops, too. Anker claims the vac works on shag carpets up to about 2 inches (5 cm) in pile height. It has an 11.4-inch rolling mop that applies up to 15 N of downward pressure.As is increasingly common in robovacs, Omni S2 uses AI to identify floor types and adjust several factors on the fly. These include cleaning mode, suction, scrubbing force and wheel height. The machine can also generate lightly oxidizing disinfectants (a hypochlorous acid and ozone water solution) inside its tank.Presales for the Eufy Clean Robot Vacuum Omni S2 begin on January 6. Shipping and in-store availability for the $1,600 robovac kicks off on January 20.Eufy Video Doorbell S4AnkerAnker also has a new doorbell, the Eufy Video Doorbell S4. It includes an AI-powered people detection feature with auto-framing. The doorbell has 3,024 x 3,024 resolution at 24 FPS and offers a panoramic (180 x 180-degree) view.You can use the doorbell in either wired or wireless mode, and it supports solar charging. The Video Doorbell S4 is scheduled to launch \"later in Q1\" for $280.Eufy Solar Wall Light Cam S4AnkerAlong similar lines, there's the Solar Wall Light Cam S4. The outdoor light has a built-in 4K camera with an f/1.6 aperture. The light has a color temperature ranging from warm white (2700K) to cool white (6500K).As its name suggests, it supports solar charging. It’s bundled with a detachable 2W solar panel. It also has a 10,000mAh battery that's rated for up to two months. Anker says the Solar Wall Light Cam S4 will arrive in Q1 for $200.Eufy Smart Lock E40AnkerFinally, Anker has a new lock / camera combo: the Eufy Smart Lock E40. It has \"advanced 3D face recognition\" that can identify you and your family from up to 10 feet away, unlocking accordingly. Its camera has 2K resolution and a 135-degree field of view, which should capture visitors from head to toe. The lock has a removable 15,000mAh battery (rated for six months) and a smaller 800mAh backup battery to keep things running while the main one is charging.The Smart Lock E40 supports Matter, Apple Home, Amazon Alexa, Google Home Assistant and Samsung SmartThings. It's expected to launch in Q1 at Home Depot (online and in stores) for $300.This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/ankers-ces-smart-home-lineup-includes-a-1600-eufy-robovac-160000133.html?src=rss",
          "feed_position": 24,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/anker_2.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/how-to-watch-todays-bosch-ces-2026-press-conference-live-130020554.html",
          "published_at": "Mon, 05 Jan 2026 15:31:25 +0000",
          "title": "How to watch today's Bosch CES 2026 press conference live",
          "standfirst": "You might think of Bosch as the modern European equivalent to what the GE brand once was in America. It's a home appliance name (thanks to its partnership with Siemens), but the German multinational brand's core business is really about providing the underlying technology and engineering that powers cars, homes and factories around the world. That focus is reflected at CES 2026, where much of what Bosch is unveiling is intended to be licensed to other companies rather than sold as Bosch-branded products on store shelves. Case in point is Bosch's automotive plans at CES. The company is showcasing what it calls \"AI in the car,\" or more specifically, in the cockpit of the car. \"Bosch's AI-powered cockpit makes driving more comfortable, intuitive, and safer for all occupants,\" Bosch board member Markus Heyn said in a press release. We'll get into all the details below, as well as how to tune in to the press conference on Monday. How to watch Bosch's CES 2026 presentation You can livestream the event on Monday, January 5 at 12PM ET via the Bosch press page or YouTube. (We've embedded the stream link below.) We'll also be highlighting any relevant info from Bosch's presentation in the main Engadget CES 2026 liveblog. What to expect Bosch will be setting up shop in the Central Hall of the Las Vegas Convention Center (booth 16203), where the company will be focusing on its three big themes — mobility, smart home integrations and manufacturing — all of which will include hardware, software and AI solutions. Like many other CES 2026 exhibitors, look for Bosch to emphasize its partnerships with the big dogs of the AI space at the show. For instance, that AI-powered car cockpit mentioned above will feature integrations with both Microsoft and NVIDIA. Bosch is touting the ability to use voice commands to join a Teams call, while the car's system will automatically activate adaptive cruise control. And it's noting that NVIDIA's software suites will help manage \"real-time sensor processing and vision-language models.\" Here's a glimpse of what the booth will look like: This article originally appeared on Engadget at https://www.engadget.com/ai/how-to-watch-todays-bosch-ces-2026-press-conference-live-130020554.html?src=rss",
          "content": "You might think of Bosch as the modern European equivalent to what the GE brand once was in America. It's a home appliance name (thanks to its partnership with Siemens), but the German multinational brand's core business is really about providing the underlying technology and engineering that powers cars, homes and factories around the world. That focus is reflected at CES 2026, where much of what Bosch is unveiling is intended to be licensed to other companies rather than sold as Bosch-branded products on store shelves. Case in point is Bosch's automotive plans at CES. The company is showcasing what it calls \"AI in the car,\" or more specifically, in the cockpit of the car. \"Bosch's AI-powered cockpit makes driving more comfortable, intuitive, and safer for all occupants,\" Bosch board member Markus Heyn said in a press release. We'll get into all the details below, as well as how to tune in to the press conference on Monday. How to watch Bosch's CES 2026 presentation You can livestream the event on Monday, January 5 at 12PM ET via the Bosch press page or YouTube. (We've embedded the stream link below.) We'll also be highlighting any relevant info from Bosch's presentation in the main Engadget CES 2026 liveblog. What to expect Bosch will be setting up shop in the Central Hall of the Las Vegas Convention Center (booth 16203), where the company will be focusing on its three big themes — mobility, smart home integrations and manufacturing — all of which will include hardware, software and AI solutions. Like many other CES 2026 exhibitors, look for Bosch to emphasize its partnerships with the big dogs of the AI space at the show. For instance, that AI-powered car cockpit mentioned above will feature integrations with both Microsoft and NVIDIA. Bosch is touting the ability to use voice commands to join a Teams call, while the car's system will automatically activate adaptive cruise control. And it's noting that NVIDIA's software suites will help manage \"real-time sensor processing and vision-language models.\" Here's a glimpse of what the booth will look like: This article originally appeared on Engadget at https://www.engadget.com/ai/how-to-watch-todays-bosch-ces-2026-press-conference-live-130020554.html?src=rss",
          "feed_position": 28
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/smart-home/samsung-unveiled-ai-powered-products-at-ces-2026-everything-announced-from-the-years-first-press-conference-230059247.html",
          "published_at": "Mon, 05 Jan 2026 15:27:02 +0000",
          "title": "Samsung unveiled AI-powered products at CES 2026: Everything announced from the year's first press conference",
          "standfirst": "CES 2026 kicked off with a big press conference from one of the biggest companies at the show: Samsung. The tech giant held its \"first look\" presentation to show off new home products and make a plethora of AI-infused announcements. New TVs, speakers, projectors and more were among the headliners, along with updated gaming monitors and soundbars. Many of the products announced on stage were not actually new, but instead had been dripped out by Samsung recently. Like its minimalist Music Studio speakers or new Micro RGB TVs. We did get a closer look a previously undisclosed set, a flagship 130-inch Micro RGB TV framed by a giant metal easel with embedded speakers. It's one of the most striking sets we've ever seen, but it's much more in the realm of concept than reality. (That's not to say they won't sell it, just that we've heard no plans and if they do it will be hideously expensive.) Samsung's flagship Micro RGB TV.Devindra Hardawar for Engadget As for the rest of Samsung's Micro RGB TV line, that may actually be slightly more affordable. The company released its first set last year for an eye-watering $30,000, but that was a 115-inch proof of concept. This year it'll be offering TVs in more reasonable sizes, including the ever-popular 55-, 65- and 75-inch sets. We don't know pricing on those but those smaller models will definitely be cheaper than $30,000. For those that want something bigger, there'll also be 85-, 100- and 115-inch models. As before, the Micro RGB range will offer a purported 100% coverage of the Rec.2020 color space, which is something that even the highest-end OLEDs can't match. While they may have been announced prior to CES, we did get a few minutes in person with Samsung's Music Studio speakers in the demo area after the big show. The Music Studio 5 and 7 are wireles speakers supporting both Bluetooth and Wi-Fi. The Studio 5 has a four-inch woofer and dual tweeters, while the Studio 7 has a 3.1.1 setup with top-, front-, left- and right-firing speakers to give an \"immersive 3D audio experience.\" For all of that, it's clear the main draw of these new speakers is the design, which is definitely striking. Another thing from those heady pre-CES days was the Freestyle+, the latest attempt at a micro projector from Samsung. Like previous Freestyle models, it's small and unobtrusive, but this one is a little brighter and has \"smarter AI capabilities.\" “The Freestyle+ reflects Samsung’s vision to create displays that adapt naturally to how people live and move between spaces,” said Hun Lee, Executive Vice President of the Visual Display Business at Samsung Electronics. “By combining true portability with intelligent AI that optimizes both the viewing environment and the content itself, The Freestyle+ makes it easier to enjoy a consistent, high-quality experience wherever you are.” Samsung's Music Studio 5 speakers at CES 2026.Billy Steele for Engadget There were even products that Samsung didn't mention on stage that we then found in the demo area. Like the Samsung HW-QS90H soundbar, a new skew on its popular HW-QS90 line that targets those of us that would rather not have a subwoofer sitting in our living rooms. It's an all-in-one 7.1.2 soundbar with 13 drivers, including four (we're assuming) woofers for its \"Quad Bass Woofer system.\" Or the And that was really that for the big announcements. The rest of the stage show was focused on how Samsung thinks (or really, at this point, insists) AI is going to make all of its products more useful. Demos included using AI noise cancelling to turn off the commentators in a soccer match, using AI to watch recipes on your fridge door, using AI to wash your clothes better (?) and... to cut a long story short, Samsung would very much appreciate it if you could please use AI. We're expecting to see and hear more from Samsung during CES, but for now you can find all of our news stories and more detailed hands-on impressions below, or if you want to relieve the event in extruciating detail there's the livestream replay too. (Don't worry, though the video is three hours long the event itself was a tight hour.) Samsung hands-on impressions at CES 2026: Samsung brought an absolute beast of a 130-inch Micro RGB TV to CES 2026 Samsung Music Studio 5 and 7 hands-on: Unique speaker designs debut at CES 2026 Samsung HW-QS90H soundbar hands-on: Impressive bass performance without a subwoofer Samsung’s Freestyle+ projector hands-on: Much brighter and impressively adaptable Samsung's biggest announcements at CES 2026 so far: Samsung will show off its expanded Micro RGB TV series at CES Samsung's latest Odyssey gaming monitor has a 32-inch 6K screen with glasses-free 3D Samsung's two new speakers will deliver crisp audio while blending into your decor Samsung's latest Freestyle portable projector is brighter and smarter This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/samsung-unveiled-ai-powered-products-at-ces-2026-everything-announced-from-the-years-first-press-conference-230059247.html?src=rss",
          "content": "CES 2026 kicked off with a big press conference from one of the biggest companies at the show: Samsung. The tech giant held its \"first look\" presentation to show off new home products and make a plethora of AI-infused announcements. New TVs, speakers, projectors and more were among the headliners, along with updated gaming monitors and soundbars. Many of the products announced on stage were not actually new, but instead had been dripped out by Samsung recently. Like its minimalist Music Studio speakers or new Micro RGB TVs. We did get a closer look a previously undisclosed set, a flagship 130-inch Micro RGB TV framed by a giant metal easel with embedded speakers. It's one of the most striking sets we've ever seen, but it's much more in the realm of concept than reality. (That's not to say they won't sell it, just that we've heard no plans and if they do it will be hideously expensive.) Samsung's flagship Micro RGB TV.Devindra Hardawar for Engadget As for the rest of Samsung's Micro RGB TV line, that may actually be slightly more affordable. The company released its first set last year for an eye-watering $30,000, but that was a 115-inch proof of concept. This year it'll be offering TVs in more reasonable sizes, including the ever-popular 55-, 65- and 75-inch sets. We don't know pricing on those but those smaller models will definitely be cheaper than $30,000. For those that want something bigger, there'll also be 85-, 100- and 115-inch models. As before, the Micro RGB range will offer a purported 100% coverage of the Rec.2020 color space, which is something that even the highest-end OLEDs can't match. While they may have been announced prior to CES, we did get a few minutes in person with Samsung's Music Studio speakers in the demo area after the big show. The Music Studio 5 and 7 are wireles speakers supporting both Bluetooth and Wi-Fi. The Studio 5 has a four-inch woofer and dual tweeters, while the Studio 7 has a 3.1.1 setup with top-, front-, left- and right-firing speakers to give an \"immersive 3D audio experience.\" For all of that, it's clear the main draw of these new speakers is the design, which is definitely striking. Another thing from those heady pre-CES days was the Freestyle+, the latest attempt at a micro projector from Samsung. Like previous Freestyle models, it's small and unobtrusive, but this one is a little brighter and has \"smarter AI capabilities.\" “The Freestyle+ reflects Samsung’s vision to create displays that adapt naturally to how people live and move between spaces,” said Hun Lee, Executive Vice President of the Visual Display Business at Samsung Electronics. “By combining true portability with intelligent AI that optimizes both the viewing environment and the content itself, The Freestyle+ makes it easier to enjoy a consistent, high-quality experience wherever you are.” Samsung's Music Studio 5 speakers at CES 2026.Billy Steele for Engadget There were even products that Samsung didn't mention on stage that we then found in the demo area. Like the Samsung HW-QS90H soundbar, a new skew on its popular HW-QS90 line that targets those of us that would rather not have a subwoofer sitting in our living rooms. It's an all-in-one 7.1.2 soundbar with 13 drivers, including four (we're assuming) woofers for its \"Quad Bass Woofer system.\" Or the And that was really that for the big announcements. The rest of the stage show was focused on how Samsung thinks (or really, at this point, insists) AI is going to make all of its products more useful. Demos included using AI noise cancelling to turn off the commentators in a soccer match, using AI to watch recipes on your fridge door, using AI to wash your clothes better (?) and... to cut a long story short, Samsung would very much appreciate it if you could please use AI. We're expecting to see and hear more from Samsung during CES, but for now you can find all of our news stories and more detailed hands-on impressions below, or if you want to relieve the event in extruciating detail there's the livestream replay too. (Don't worry, though the video is three hours long the event itself was a tight hour.) Samsung hands-on impressions at CES 2026: Samsung brought an absolute beast of a 130-inch Micro RGB TV to CES 2026 Samsung Music Studio 5 and 7 hands-on: Unique speaker designs debut at CES 2026 Samsung HW-QS90H soundbar hands-on: Impressive bass performance without a subwoofer Samsung’s Freestyle+ projector hands-on: Much brighter and impressively adaptable Samsung's biggest announcements at CES 2026 so far: Samsung will show off its expanded Micro RGB TV series at CES Samsung's latest Odyssey gaming monitor has a 32-inch 6K screen with glasses-free 3D Samsung's two new speakers will deliver crisp audio while blending into your decor Samsung's latest Freestyle portable projector is brighter and smarter This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/samsung-unveiled-ai-powered-products-at-ces-2026-everything-announced-from-the-years-first-press-conference-230059247.html?src=rss",
          "feed_position": 29,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2026-01/a087c5f0-e9f4-11f0-87f1-6f39e4849c7d"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/amazon-is-rolling-out-alexa-for-the-web-so-you-can-use-its-assistant-without-a-dedicated-device-150053826.html",
          "published_at": "Mon, 05 Jan 2026 15:00:53 +0000",
          "title": "Amazon is rolling out Alexa+ for the web so you can use its assistant without a dedicated device",
          "standfirst": "You no longer need an Amazon device to summon Alexa since the AI assistant will be available on the Alexa.com website. Amazon will roll out the web client to its Alexa+ Early Access customers first, still featuring the company's new and improved AI assistant that was announced in February. The web model won't be much different from the existing Alexa+ that's already available on Echo devices, Fire TV and Fire tablets. However, instead of buying into the Amazon ecosystem, Early Access customers can use any web browser to get Alexa+'s help with everything from basic questions to complex tasks, like controlling your smart home devices, customizing a recipe to account for dietary restrictions or making restaurant reservations if you don't feel like cooking. The Alexa+ web version will also feature a navigation sidebar that will be home to your most-used Alexa features. Amazon recently revamped its Alexa mobile app, while also integrating Alexa+ with Ring doorbells and BMW cars. However, introducing its AI assistant to web browsers could indicate that Amazon wants to encroach on a competitive market, which is currently dominated by OpenAI's ChatGPT and Google Gemini. To see how Amazon's Alexa+ on web compares to the rest, you need to set up the Alexa+ Early Access first. After that, you can log into your Amazon account on Alexa.com to get started.This article originally appeared on Engadget at https://www.engadget.com/ai/amazon-is-rolling-out-alexa-for-the-web-so-you-can-use-its-assistant-without-a-dedicated-device-150053826.html?src=rss",
          "content": "You no longer need an Amazon device to summon Alexa since the AI assistant will be available on the Alexa.com website. Amazon will roll out the web client to its Alexa+ Early Access customers first, still featuring the company's new and improved AI assistant that was announced in February. The web model won't be much different from the existing Alexa+ that's already available on Echo devices, Fire TV and Fire tablets. However, instead of buying into the Amazon ecosystem, Early Access customers can use any web browser to get Alexa+'s help with everything from basic questions to complex tasks, like controlling your smart home devices, customizing a recipe to account for dietary restrictions or making restaurant reservations if you don't feel like cooking. The Alexa+ web version will also feature a navigation sidebar that will be home to your most-used Alexa features. Amazon recently revamped its Alexa mobile app, while also integrating Alexa+ with Ring doorbells and BMW cars. However, introducing its AI assistant to web browsers could indicate that Amazon wants to encroach on a competitive market, which is currently dominated by OpenAI's ChatGPT and Google Gemini. To see how Amazon's Alexa+ on web compares to the rest, you need to set up the Alexa+ Early Access first. After that, you can log into your Amazon account on Alexa.com to get started.This article originally appeared on Engadget at https://www.engadget.com/ai/amazon-is-rolling-out-alexa-for-the-web-so-you-can-use-its-assistant-without-a-dedicated-device-150053826.html?src=rss",
          "feed_position": 30
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/ember-artline-is-amazons-answer-to-samsungs-the-frame-150015104.html",
          "published_at": "Mon, 05 Jan 2026 15:00:15 +0000",
          "title": "Ember Artline is Amazon's answer to Samsung's The Frame",
          "standfirst": "Amazon just revealed the Ember Artline TV at CES 2026. This is a lifestyle TV that displays art, putting it in direct competition with Samsung's The Frame. The 4K QLED screen is extremely thin, at 1.5-inches, so it'll likely fit just about anywhere. It also features a glare-reducing matte screen that has been \"designed to make your art and photos look great.\" The Artline integrates with Amazon Photos and offers access to 2,000 pieces of free art to display. For those worried about electricity usage, the TV includes proprietary technology that senses when someone has entered or left the room and turns on or off accordingly. The display comes with Amazon's new smart assistant Alexa+, allowing it to double as a smart TV. This is helped along by the inclusion of far-field microphones. Alexa+ is a beefier version of the company's long-standing digital assistant. You can talk to it like a person, if that's your bag. There's even a new use case in which Alexa+ analyzes the aesthetics of a room and recommends art to throw on the screen. Amazon This is also a standard TV. It features support for Dolby Vision, HDR10+ and Wi-Fi 6 and will operate on the Fire TV platform. Customers can choose from 10 magnetic frames in a wide variety of colorways, further diversifying the aesthetics. We don't have a release date yet, other than \"later this spring.\" Amazon has released pricing, however, as this TV starts at $899 for the 55-inch version.This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/ember-artline-is-amazons-answer-to-samsungs-the-frame-150015104.html?src=rss",
          "content": "Amazon just revealed the Ember Artline TV at CES 2026. This is a lifestyle TV that displays art, putting it in direct competition with Samsung's The Frame. The 4K QLED screen is extremely thin, at 1.5-inches, so it'll likely fit just about anywhere. It also features a glare-reducing matte screen that has been \"designed to make your art and photos look great.\" The Artline integrates with Amazon Photos and offers access to 2,000 pieces of free art to display. For those worried about electricity usage, the TV includes proprietary technology that senses when someone has entered or left the room and turns on or off accordingly. The display comes with Amazon's new smart assistant Alexa+, allowing it to double as a smart TV. This is helped along by the inclusion of far-field microphones. Alexa+ is a beefier version of the company's long-standing digital assistant. You can talk to it like a person, if that's your bag. There's even a new use case in which Alexa+ analyzes the aesthetics of a room and recommends art to throw on the screen. Amazon This is also a standard TV. It features support for Dolby Vision, HDR10+ and Wi-Fi 6 and will operate on the Fire TV platform. Customers can choose from 10 magnetic frames in a wide variety of colorways, further diversifying the aesthetics. We don't have a release date yet, other than \"later this spring.\" Amazon has released pricing, however, as this TV starts at $899 for the 55-inch version.This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/ember-artline-is-amazons-answer-to-samsungs-the-frame-150015104.html?src=rss",
          "feed_position": 32,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-12/877150a0-e683-11f0-82fe-0fd2cae385ac"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/amazon-is-redesigning-its-fire-tv-ui-for-streaming-sticks-and-tvs-150000622.html",
          "published_at": "Mon, 05 Jan 2026 15:00:00 +0000",
          "title": "Amazon is redesigning its Fire TV UI for streaming sticks and TVs",
          "standfirst": "Amazon is kicking off the new year by announcing a redesign of its Fire TV UI at CES 2026. The new UI is designed to make finding things to watch on the platform faster, while making it easier to access more of Fire TV's features straight from the home screen.On first blush, the biggest difference in the new Fire TV UI is that everything is rounder. Shows, movies and apps have rounded corners, and Amazon's changed the spacing in the interface to give everything more room to breathe. Tweaks to typography and color gradients also give the UI a more modern feel, and Amazon says it's rebuilt the code of the Fire TV software to make everything faster, too, in some cases demonstrating \"up to 20-30 percent gains in speed.\"The fundamentals haven't changed all that much, however. There's a menu bar of different tabs at the top of the interface that separates the Home page from things like Movies, TV Shows and Sports. Each page shows content in carousels, and Amazon still lets you pin streaming apps like Netflix or Apple TV underneath recommended content, with the biggest difference being you can now pin more apps at once (20 rather than six). Amazon is also changing up how the Fire TV Remote works. Pressing the Menu button now lets you quickly access Fire TV's Art & Photos, Games and Ambient Experience features, and a long press of the Home button pulls up a shortcut panel with access to things like settings and connected Ring cameras. Alexa+, Amazon's rebuilt AI assistant, is also available directly inside of the Fire TV interface for adding things to your watchlist, recommending content and controlling your smart home.The new Fire TV mobile app can act as a remote and a way to search Amazon's library of content.AmazonAmazon offers the Fire TV mobile app as a way to control its streaming devices and TVs with a smartphone, but alongside this redesign, the company is also expanding what the app can do. The new Fire TV app lets you browse content, edit your watchlist and start playing things on your TV, in much the same way Roku and Google's streaming apps do.Both the new Fire TV mobile app and redesigned Fire TV UI will be available for free for all users, Amazon says. The new Fire TV UI will launch in February on the Fire TV Stick 4K Plus, the second-generation Fire TV Stick 4K Max and Fire TV Omni Mini-LED series. Later in the spring, Amazon says it will bring the redesign to more countries and devices, including the latest Fire TV 4K streaming devices, TVs like the Fire TV 2-series, 4-series and Fire TV Omni QLED series and TVs from third-party partners like Hisense, Insignia, Panasonic and TCL.This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/amazon-is-redesigning-its-fire-tv-ui-for-streaming-sticks-and-tvs-150000622.html?src=rss",
          "content": "Amazon is kicking off the new year by announcing a redesign of its Fire TV UI at CES 2026. The new UI is designed to make finding things to watch on the platform faster, while making it easier to access more of Fire TV's features straight from the home screen.On first blush, the biggest difference in the new Fire TV UI is that everything is rounder. Shows, movies and apps have rounded corners, and Amazon's changed the spacing in the interface to give everything more room to breathe. Tweaks to typography and color gradients also give the UI a more modern feel, and Amazon says it's rebuilt the code of the Fire TV software to make everything faster, too, in some cases demonstrating \"up to 20-30 percent gains in speed.\"The fundamentals haven't changed all that much, however. There's a menu bar of different tabs at the top of the interface that separates the Home page from things like Movies, TV Shows and Sports. Each page shows content in carousels, and Amazon still lets you pin streaming apps like Netflix or Apple TV underneath recommended content, with the biggest difference being you can now pin more apps at once (20 rather than six). Amazon is also changing up how the Fire TV Remote works. Pressing the Menu button now lets you quickly access Fire TV's Art & Photos, Games and Ambient Experience features, and a long press of the Home button pulls up a shortcut panel with access to things like settings and connected Ring cameras. Alexa+, Amazon's rebuilt AI assistant, is also available directly inside of the Fire TV interface for adding things to your watchlist, recommending content and controlling your smart home.The new Fire TV mobile app can act as a remote and a way to search Amazon's library of content.AmazonAmazon offers the Fire TV mobile app as a way to control its streaming devices and TVs with a smartphone, but alongside this redesign, the company is also expanding what the app can do. The new Fire TV app lets you browse content, edit your watchlist and start playing things on your TV, in much the same way Roku and Google's streaming apps do.Both the new Fire TV mobile app and redesigned Fire TV UI will be available for free for all users, Amazon says. The new Fire TV UI will launch in February on the Fire TV Stick 4K Plus, the second-generation Fire TV Stick 4K Max and Fire TV Omni Mini-LED series. Later in the spring, Amazon says it will bring the redesign to more countries and devices, including the latest Fire TV 4K streaming devices, TVs like the Fire TV 2-series, 4-series and Fire TV Omni QLED series and TVs from third-party partners like Hisense, Insignia, Panasonic and TCL.This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/amazon-is-redesigning-its-fire-tv-ui-for-streaming-sticks-and-tvs-150000622.html?src=rss",
          "feed_position": 33,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Fire-TV-mobile-app.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/ces-2026-opening-night-recap-all-the-early-news-you-missed-from-samsung-and-lg-142611832.html",
          "published_at": "Mon, 05 Jan 2026 14:26:11 +0000",
          "title": "CES 2026 opening night recap: All the early news you missed from Samsung and LG",
          "standfirst": "CES 2026 is still a day away from officially opening, but Sunday, January 4, delivered the first real wave of news. As has become tradition, the pre-show slate set the tone for the week ahead, anchored by Samsung’s annual First Look press conference and CES Unveiled, the latter of which where hundreds of companies previewed products before the show floor opens on January 6.Samsung once again dominated the early conversation with its First Look event, using the stage to outline how it sees AI shaping everything from TVs to home appliances in the year ahead. Rather than focusing on individual specs, Samsung framed its 2026 lineup around adaptive experiences, with screens and devices designed to respond more intelligently to their environment and the people using them. TVs remained the centerpiece, with updates like the new 130-inch Micro RGB model aimed at improving picture quality, content discovery and personalization through AI-driven tools.Among the more concrete pieces of tech tied to Samsung’s CES run was The Freestyle+, a successor to the company’s portable projector that doubles down on AI-powered picture optimization, brighter output and smarter calibration for different surfaces. The unit also supports immersive audio features and syncs with Samsung’s soundbars for a more complete entertainment package. The company further bolstered its audio portfolio with the new Music Studio wireless speakers, which offer an eye-catching design.Samsung’s broader display strategy was also on show: Samsung Display revealed next-generation QD-OLED panels capable of peak brightness up to 4,500 nits, which are expected to be used in TVs and monitors that debut on the show floor, and introduced new concepts illustrating how OLED tech can blend into future AI-enhanced lifestyles.Software also played a role in Samsung’s early messaging. The company confirmed that Google Photos will be coming to Samsung TVs later this year, bringing photo libraries and Memories directly into the living room. It’s the kind of addition that doesn’t grab headlines in the same way as new hardware, but it’s exactly the type of update that quietly shapes how people actually use their TVs regularly.Outside of Samsung’s event, CES Unveiled — the convention’s kickoff mini-show — offered an early look at what smaller companies and startups are bringing to Las Vegas this year. The show floor was packed with a familiar mix of near-ready consumer products and more experimental ideas, spanning robotics, smart home gear, health tech and personal electronics. Companion-style robots, updated AR glasses and AI-powered household gadgets were common sights, reflecting broader trends that are likely to show up repeatedly across the main halls this week.Unveiled is rarely about big-name launches, but it often reveals where the industry’s attention is drifting. This year, that meant a noticeable emphasis on AI-assisted hardware that blends into everyday routines, whether that’s home devices designed to act more autonomously or personal tech that prioritizes context and convenience over raw performance.LG also kicked off its pre-show efforts with some notable display news that’s certain to shape conversations on the CES floor. The company reintroduced its ultra-thin Wallpaper OLED evo W6 TV, a panel that sits just 9mm deep and can be mounted flush against a wall, boasting improvements in brightness and color accuracy with Hyper Radiant Color Technology and support for FreeSync and G-Sync.LG's 2026 Wallpaper wireless OLED TVDevindra Hardawar for EngadgetLG’s display lineup extends into the PC space too, where the division plans to debut a 27-inch OLED gaming panel hitting a 720Hz refresh rate and response times as low as 0.02 ms. On the lifestyle front, the Gallery TV aims to compete more directly with Samsung’s art-style screens by combining a specialized anti-glare panel with an expanding Gallery+ service that brings thousands of artworks to the living room.Some CES-related announcements also landed ahead of Sunday, underscoring how stretched the show’s news cycle has become. Samsung and LG both shared display and ecosystem updates in the days leading up to January 4, ensuring their products were already part of the CES conversation before pre-show events even began.Sunday’s announcements served as a clear warm-up for what’s coming next. Monday, January 5, marks the start of press day, when major companies will take the stage for individual conferences and a large number of embargoes are expected to lift. Then, on Tuesday, January 6, CES officially opens its doors, shifting the focus from presentations to hands-on demos and real-world impressions.We’ll be updating this recap as more news breaks, but if Sunday was any indication, CES 2026 is already moving fast — and the show hasn’t even started yet.This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/ces-2026-opening-night-recap-all-the-early-news-you-missed-from-samsung-and-lg-142611832.html?src=rss",
          "content": "CES 2026 is still a day away from officially opening, but Sunday, January 4, delivered the first real wave of news. As has become tradition, the pre-show slate set the tone for the week ahead, anchored by Samsung’s annual First Look press conference and CES Unveiled, the latter of which where hundreds of companies previewed products before the show floor opens on January 6.Samsung once again dominated the early conversation with its First Look event, using the stage to outline how it sees AI shaping everything from TVs to home appliances in the year ahead. Rather than focusing on individual specs, Samsung framed its 2026 lineup around adaptive experiences, with screens and devices designed to respond more intelligently to their environment and the people using them. TVs remained the centerpiece, with updates like the new 130-inch Micro RGB model aimed at improving picture quality, content discovery and personalization through AI-driven tools.Among the more concrete pieces of tech tied to Samsung’s CES run was The Freestyle+, a successor to the company’s portable projector that doubles down on AI-powered picture optimization, brighter output and smarter calibration for different surfaces. The unit also supports immersive audio features and syncs with Samsung’s soundbars for a more complete entertainment package. The company further bolstered its audio portfolio with the new Music Studio wireless speakers, which offer an eye-catching design.Samsung’s broader display strategy was also on show: Samsung Display revealed next-generation QD-OLED panels capable of peak brightness up to 4,500 nits, which are expected to be used in TVs and monitors that debut on the show floor, and introduced new concepts illustrating how OLED tech can blend into future AI-enhanced lifestyles.Software also played a role in Samsung’s early messaging. The company confirmed that Google Photos will be coming to Samsung TVs later this year, bringing photo libraries and Memories directly into the living room. It’s the kind of addition that doesn’t grab headlines in the same way as new hardware, but it’s exactly the type of update that quietly shapes how people actually use their TVs regularly.Outside of Samsung’s event, CES Unveiled — the convention’s kickoff mini-show — offered an early look at what smaller companies and startups are bringing to Las Vegas this year. The show floor was packed with a familiar mix of near-ready consumer products and more experimental ideas, spanning robotics, smart home gear, health tech and personal electronics. Companion-style robots, updated AR glasses and AI-powered household gadgets were common sights, reflecting broader trends that are likely to show up repeatedly across the main halls this week.Unveiled is rarely about big-name launches, but it often reveals where the industry’s attention is drifting. This year, that meant a noticeable emphasis on AI-assisted hardware that blends into everyday routines, whether that’s home devices designed to act more autonomously or personal tech that prioritizes context and convenience over raw performance.LG also kicked off its pre-show efforts with some notable display news that’s certain to shape conversations on the CES floor. The company reintroduced its ultra-thin Wallpaper OLED evo W6 TV, a panel that sits just 9mm deep and can be mounted flush against a wall, boasting improvements in brightness and color accuracy with Hyper Radiant Color Technology and support for FreeSync and G-Sync.LG's 2026 Wallpaper wireless OLED TVDevindra Hardawar for EngadgetLG’s display lineup extends into the PC space too, where the division plans to debut a 27-inch OLED gaming panel hitting a 720Hz refresh rate and response times as low as 0.02 ms. On the lifestyle front, the Gallery TV aims to compete more directly with Samsung’s art-style screens by combining a specialized anti-glare panel with an expanding Gallery+ service that brings thousands of artworks to the living room.Some CES-related announcements also landed ahead of Sunday, underscoring how stretched the show’s news cycle has become. Samsung and LG both shared display and ecosystem updates in the days leading up to January 4, ensuring their products were already part of the CES conversation before pre-show events even began.Sunday’s announcements served as a clear warm-up for what’s coming next. Monday, January 5, marks the start of press day, when major companies will take the stage for individual conferences and a large number of embargoes are expected to lift. Then, on Tuesday, January 6, CES officially opens its doors, shifting the focus from presentations to hands-on demos and real-world impressions.We’ll be updating this recap as more news breaks, but if Sunday was any indication, CES 2026 is already moving fast — and the show hasn’t even started yet.This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/ces-2026-opening-night-recap-all-the-early-news-you-missed-from-samsung-and-lg-142611832.html?src=rss",
          "feed_position": 35,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2026-01/c3537010-e9f5-11f0-bdef-1bc2c48a4dbd"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/google-tv-is-getting-gemini-powered-photo-editing-at-ces-140000172.html",
          "published_at": "Mon, 05 Jan 2026 14:00:00 +0000",
          "title": "Google TV is getting Gemini-powered photo editing at CES",
          "standfirst": "Google is working even more Gemini features into Google TV at CES 2026. The company demoed how the AI assistant would work on its TV platform at last year's show, and this time, it's expanding the AI's features to make it easier to do things like adjust your TV's settings or edit photos.The ability to view photos stored in Google Photos has long been a feature of Google TV, but as part of this new update, Gemini will be able to do a lot more with them, too. Google says Gemini will be able to search your Google Photos library for specific people and moments, and remix those photos into different styles or compile them into a custom slideshow. Using Google's Veo and Nano Banana models, you'll also be able to ask Gemini to create entirely new media from scratch.Gemini can adjust TV settings as part of the new update.GoogleWhen you don't want to spend time digging through menus, Google says Gemini will also be able to adjust picture and sound settings for you based on a natural language request. Rather than asking for your brightness to be set to a specific level, simply telling Gemini that \"the screen is too dim\" will be enough to prompt the AI to adjust the image. Gemini's ability to display information and answer questions through your TV is also expanding. The AI will now use a TV-friendly, \"visually rich framework\" to answer questions and explain topics, pulling on high-resolution images and video. When you need even more information, clicking on \"Dive deeper\" under a Gemini response will prompt the AI to create \"narrated, interactive overviews\" of whatever you want to learn more about.Google only recently rolled out Gemini to its Google TV Streamer, and it sounds like it could be a bit before these new features are widely available. Google says the new Gemini update will arrive on TCL TVs running Google TV first, before rolling out to \"other Google TV devices over the coming months.\" This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/google-tv-is-getting-gemini-powered-photo-editing-at-ces-140000172.html?src=rss",
          "content": "Google is working even more Gemini features into Google TV at CES 2026. The company demoed how the AI assistant would work on its TV platform at last year's show, and this time, it's expanding the AI's features to make it easier to do things like adjust your TV's settings or edit photos.The ability to view photos stored in Google Photos has long been a feature of Google TV, but as part of this new update, Gemini will be able to do a lot more with them, too. Google says Gemini will be able to search your Google Photos library for specific people and moments, and remix those photos into different styles or compile them into a custom slideshow. Using Google's Veo and Nano Banana models, you'll also be able to ask Gemini to create entirely new media from scratch.Gemini can adjust TV settings as part of the new update.GoogleWhen you don't want to spend time digging through menus, Google says Gemini will also be able to adjust picture and sound settings for you based on a natural language request. Rather than asking for your brightness to be set to a specific level, simply telling Gemini that \"the screen is too dim\" will be enough to prompt the AI to adjust the image. Gemini's ability to display information and answer questions through your TV is also expanding. The AI will now use a TV-friendly, \"visually rich framework\" to answer questions and explain topics, pulling on high-resolution images and video. When you need even more information, clicking on \"Dive deeper\" under a Gemini response will prompt the AI to create \"narrated, interactive overviews\" of whatever you want to learn more about.Google only recently rolled out Gemini to its Google TV Streamer, and it sounds like it could be a bit before these new features are widely available. Google says the new Gemini update will arrive on TCL TVs running Google TV first, before rolling out to \"other Google TV devices over the coming months.\" This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/google-tv-is-getting-gemini-powered-photo-editing-at-ces-140000172.html?src=rss",
          "feed_position": 37,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Device_Controls.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/apps/best-meditation-app-140047993.html",
          "published_at": "Mon, 05 Jan 2026 10:01:27 +0000",
          "title": "The 5 best meditation apps for 2026",
          "standfirst": "Daily life can get loud, and meditation apps offer a simple way to carve out a little breathing room. You do not need experience to start, and you do not need to commit to long sessions either. Most apps guide you through short practices that help with focus, sleep and stress, making it easy to build a routine even on busy days.There are plenty of meditation apps to choose from, each with its own style and approach. Some focus on mindfulness basics, others offer structured programs and a few add community features for accountability. I tested the most popular options to find the best meditation apps for anyone who wants more calm and clarity in their day. How we tested meditation apps Every brain is different, so I did not rate these apps based on if they sync up with my preferred meditation style. First and foremost, I looked for apps that cater to various methods and those that offer guided meditations that go beyond what’s free on YouTube. All of the items on this list are available on both Android and iOS, so you won’t have to worry about something being only for iPhone owners. Of course, there’s lots of free stuff out there, from podcasts and videos on YouTube to audio tracks on streaming services. You can even find guided breathing sessions on an Apple Watch or Fitbit, as well as meditations in Fitness+, Samsung Health or any number of workout video providers. For this guide, I focused on apps that stood out in some way. I liked apps with huge libraries of guided meditations and those that offer additional mindfulness activities, like yoga routines. I also looked for easy-to-use apps with well-designed layouts. You don’t want to start your meditation journey with a clunky app that actually increases anxiety. The most important thing with meditation is to keep doing it, so I awarded points for clever gamification elements, simple social network integration and anything else that encourages repeat visits. Finally, I considered extra features that set an app apart from the glut of competitors out there. For example, some meditation apps offer novel ways to track your progress, access to yoga routines and a whole lot more. At the end of the day, each of these apps has its strengths. But if installing an app or using a device is not how you prefer to meditate, you can always turn off your phone and find a quiet room or environment. For those of us who need a little help from a digital guru, though, here are our favorite apps for meditation. Other meditation gear we tested Brain-tracking wearables have been around for years, but there are some newer devices that have been tailor-made for meditators. These gadgets track the brain during meditations and offer real-time feedback. It’s a real boon for the data-obsessed, but also a real bank account drainer, with some gadgets costing thousands of dollars. I took two of the more-popular options for a spin to see what they’d make of my brain. Sens.ai Neurofeedback System Sens.ai is a weird contraption that not only claims to track brainwaves, but gives real-time feedback to “teach” people how to meditate and enter a flow state. The device involves a giant headset that’s stuffed with brainwave sensors that detect beta, alpha, theta and gamma waves, in addition to heart-rate sensors. It also comes with a truly bizarre companion gadget that uses light stimulation (transcranial photobiomodulation) to keep an eye on focus and attention levels. The whole thing is combined with an app that keeps track of dozens of data metrics and allows access to various guided meditations. I’m as surprised as you to say that this thing appears to work, with some caveats. It’s uncanny how well it monitors the brain during meditations. If I got lost in a thought spiral about lasagna at six minutes in, sure enough, there would be a dip in analytics at the six-minute mark. It’s also fairly easy to use, despite a process that involves wetting a number of electrodes. As magical as the accurate brain-tracking seems to be, however, I wasn’t as keen on the actual training portion, which often involves staring at a screen throughout the entirety of the practice. It’s also not for the financial faint of heart, as the Sens.ai device costs $1,500. NeoRhythm Omnipemf NeoRhythm’s Omnipemf is another wearable to help people get into that ever-elusive flow state. It doesn’t track your brain, but rather floods it with electromagnetic fields at specific frequencies to make it more susceptible to meditation and focus. This is supposed to prime your brain for the meditative state and, in theory, make it easier to capture that zen. However, I didn’t get much from it, other than a placebo-esque buzzing in my head. To use it, you simply pop on the wearable and go about your day. You aren’t tied to an app, so you can meditate in whatever way you like. There are multiple modes that go beyond meditation, as this thing is supposed to help with focus, pain relief and sleep. I’d wait for some peer-reviewed studies, however, before buying this. Check out more from our spring cleaning guide.This article originally appeared on Engadget at https://www.engadget.com/apps/best-meditation-app-140047993.html?src=rss",
          "content": "Daily life can get loud, and meditation apps offer a simple way to carve out a little breathing room. You do not need experience to start, and you do not need to commit to long sessions either. Most apps guide you through short practices that help with focus, sleep and stress, making it easy to build a routine even on busy days.There are plenty of meditation apps to choose from, each with its own style and approach. Some focus on mindfulness basics, others offer structured programs and a few add community features for accountability. I tested the most popular options to find the best meditation apps for anyone who wants more calm and clarity in their day. How we tested meditation apps Every brain is different, so I did not rate these apps based on if they sync up with my preferred meditation style. First and foremost, I looked for apps that cater to various methods and those that offer guided meditations that go beyond what’s free on YouTube. All of the items on this list are available on both Android and iOS, so you won’t have to worry about something being only for iPhone owners. Of course, there’s lots of free stuff out there, from podcasts and videos on YouTube to audio tracks on streaming services. You can even find guided breathing sessions on an Apple Watch or Fitbit, as well as meditations in Fitness+, Samsung Health or any number of workout video providers. For this guide, I focused on apps that stood out in some way. I liked apps with huge libraries of guided meditations and those that offer additional mindfulness activities, like yoga routines. I also looked for easy-to-use apps with well-designed layouts. You don’t want to start your meditation journey with a clunky app that actually increases anxiety. The most important thing with meditation is to keep doing it, so I awarded points for clever gamification elements, simple social network integration and anything else that encourages repeat visits. Finally, I considered extra features that set an app apart from the glut of competitors out there. For example, some meditation apps offer novel ways to track your progress, access to yoga routines and a whole lot more. At the end of the day, each of these apps has its strengths. But if installing an app or using a device is not how you prefer to meditate, you can always turn off your phone and find a quiet room or environment. For those of us who need a little help from a digital guru, though, here are our favorite apps for meditation. Other meditation gear we tested Brain-tracking wearables have been around for years, but there are some newer devices that have been tailor-made for meditators. These gadgets track the brain during meditations and offer real-time feedback. It’s a real boon for the data-obsessed, but also a real bank account drainer, with some gadgets costing thousands of dollars. I took two of the more-popular options for a spin to see what they’d make of my brain. Sens.ai Neurofeedback System Sens.ai is a weird contraption that not only claims to track brainwaves, but gives real-time feedback to “teach” people how to meditate and enter a flow state. The device involves a giant headset that’s stuffed with brainwave sensors that detect beta, alpha, theta and gamma waves, in addition to heart-rate sensors. It also comes with a truly bizarre companion gadget that uses light stimulation (transcranial photobiomodulation) to keep an eye on focus and attention levels. The whole thing is combined with an app that keeps track of dozens of data metrics and allows access to various guided meditations. I’m as surprised as you to say that this thing appears to work, with some caveats. It’s uncanny how well it monitors the brain during meditations. If I got lost in a thought spiral about lasagna at six minutes in, sure enough, there would be a dip in analytics at the six-minute mark. It’s also fairly easy to use, despite a process that involves wetting a number of electrodes. As magical as the accurate brain-tracking seems to be, however, I wasn’t as keen on the actual training portion, which often involves staring at a screen throughout the entirety of the practice. It’s also not for the financial faint of heart, as the Sens.ai device costs $1,500. NeoRhythm Omnipemf NeoRhythm’s Omnipemf is another wearable to help people get into that ever-elusive flow state. It doesn’t track your brain, but rather floods it with electromagnetic fields at specific frequencies to make it more susceptible to meditation and focus. This is supposed to prime your brain for the meditative state and, in theory, make it easier to capture that zen. However, I didn’t get much from it, other than a placebo-esque buzzing in my head. To use it, you simply pop on the wearable and go about your day. You aren’t tied to an app, so you can meditate in whatever way you like. There are multiple modes that go beyond meditation, as this thing is supposed to help with focus, pain relief and sleep. I’d wait for some peer-reviewed studies, however, before buying this. Check out more from our spring cleaning guide.This article originally appeared on Engadget at https://www.engadget.com/apps/best-meditation-app-140047993.html?src=rss",
          "feed_position": 44
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/science/loreals-ces-2026-beauty-devices-include-a-skin-like-flexible-led-mask-070000576.html",
          "published_at": "Mon, 05 Jan 2026 07:00:00 +0000",
          "title": "L'Oréal’s CES 2026 beauty devices include a skin-like flexible LED mask",
          "standfirst": "Over the last ten or so years, L'Oréal has brought a taste of beauty tech to the masses at CES 2026. This time, it has three devices to show off: the “Light Straight + Multi-styler” as well as the helpfully named LED Face Mask and LED Eye Mask. Don’t let the unassuming names mislead you. These three products actually harbor some unique traits. The Light Straight (and multi-styler, which I’m going to just call the Light Straight from here on), for instance, uses infrared light to help generate the heat required to style your hair. Meanwhile, the LED Face Mask is different from those made by companies like Dr. Dennis Gross, Omnilux, Therabody and Shark. Instead of fairly hard shells that sit rigidly on your face, L'Oréal’s version looks to be pliable and thin. I haven’t seen this in person yet, though I do intend to do so as soon as possible, but the pictures of the LED Eye Mask look, and I mean this in the best way, ridonkulous. Not only do they appear supple, but they also seem to be transparent, with bulbs and wires you can see inside. In some of the images that the company provided, the masks are completely awash in red as the lights are on. In others, only parts of it are red. One of them even shows the masks sitting in a little carrying case and they almost look like wireless earbuds. I haven’t seen any photos of the LED Face Mask but I can imagine they’d be fairly similar to these.The L'Oréal LED Eye Mask in a carrying caseL'Oréal According to the press release, this “ultra-thin, flexible silicone mask” is currently “in prototype form” and was developed in collaboration with LED solutions company iSmart. The company said this mask “delivers light directly to the face” in 10-minute automatically timed sessions. That’s not too different from existing red light masks, but L’Oréal said it believes “the key to the mask’s effectiveness is its advanced, transparent support, which integrates a skin-safe microcircuit to precisely control the emission of two selected wavelengths of light—red light (630 nm) and near-infrared light (830 nm).”Since the mask is only launching in 2027, there aren’t details yet on pricing and availability, though the company’s global vice president of tech and open innovation Guive Balooch told Engadget that it would be a premium product that would sit somewhere below the highest priced offerings currently out there.One of my problems with full-face LED masks is that my skin always feels too parched under them, because you have to use them on clean, dry skin for 10 minutes at a time. Balooch told me that L'Oréal would have a serum developed to be used with its mask that would help with that, while also improving the effectiveness of the light treatment.That certainly is intriguing, and Balooch indicated that creating formulations that are designed to work with devices like the LED masks is a future direction for the company. A pair of hands using the L'Oréal Light Straight and multi-styler on a person's hair. L'Oréal I’m also interested in the Light Straight, which like the company’s AirLight Pro uses infrared light to help dry or style hair. According to the company’s press release, hair straighteners with “ordinary heating places can reach temperatures of 400°F and higher—above the threshold at which keratin denatures, leading to weakened cuticles, breakage and reduced shine.” For context, I used to turn my flatiron all the way up to 425 degrees Fahrenheit to tame my tresses (though these days I find a more reasonable 330 degrees is good enough).L’Oréal says the Light Straight and its “patented infrared light technology” can “help provide exceptional styling results at lower temperatures, to better protect the health of the hair.” The device’s glass plates never exceed 320 degrees, and the company says its testing found that the Light Straight is three times faster and leaves hair twice as smooth as “leading premium hair stylers.” I’m not sure how you would quantify smoothness, but I’m hopeful the results do pan out in the real world. The Light Straight uses near-infrared light that L’Oréal says “penetrates deeply into hair fibers” to “reshape internal hydrogen bonds.” It also has sensors onboard with “built-in proprietary algorithms and machine learning” to adapt to your gestures “to maximize individual experience.” I’m not sure what that means, but I hope to find out more this week at CES. Given the Light Straight doesn’t launch till 2027, it’s not surprising that pricing and other details aren’t yet available. But for now, I’m keen to see companies continue to investigate novel, hopefully healthier ways for us to look and feel beautiful.This article originally appeared on Engadget at https://www.engadget.com/science/loreals-ces-2026-beauty-devices-include-a-skin-like-flexible-led-mask-070000576.html?src=rss",
          "content": "Over the last ten or so years, L'Oréal has brought a taste of beauty tech to the masses at CES 2026. This time, it has three devices to show off: the “Light Straight + Multi-styler” as well as the helpfully named LED Face Mask and LED Eye Mask. Don’t let the unassuming names mislead you. These three products actually harbor some unique traits. The Light Straight (and multi-styler, which I’m going to just call the Light Straight from here on), for instance, uses infrared light to help generate the heat required to style your hair. Meanwhile, the LED Face Mask is different from those made by companies like Dr. Dennis Gross, Omnilux, Therabody and Shark. Instead of fairly hard shells that sit rigidly on your face, L'Oréal’s version looks to be pliable and thin. I haven’t seen this in person yet, though I do intend to do so as soon as possible, but the pictures of the LED Eye Mask look, and I mean this in the best way, ridonkulous. Not only do they appear supple, but they also seem to be transparent, with bulbs and wires you can see inside. In some of the images that the company provided, the masks are completely awash in red as the lights are on. In others, only parts of it are red. One of them even shows the masks sitting in a little carrying case and they almost look like wireless earbuds. I haven’t seen any photos of the LED Face Mask but I can imagine they’d be fairly similar to these.The L'Oréal LED Eye Mask in a carrying caseL'Oréal According to the press release, this “ultra-thin, flexible silicone mask” is currently “in prototype form” and was developed in collaboration with LED solutions company iSmart. The company said this mask “delivers light directly to the face” in 10-minute automatically timed sessions. That’s not too different from existing red light masks, but L’Oréal said it believes “the key to the mask’s effectiveness is its advanced, transparent support, which integrates a skin-safe microcircuit to precisely control the emission of two selected wavelengths of light—red light (630 nm) and near-infrared light (830 nm).”Since the mask is only launching in 2027, there aren’t details yet on pricing and availability, though the company’s global vice president of tech and open innovation Guive Balooch told Engadget that it would be a premium product that would sit somewhere below the highest priced offerings currently out there.One of my problems with full-face LED masks is that my skin always feels too parched under them, because you have to use them on clean, dry skin for 10 minutes at a time. Balooch told me that L'Oréal would have a serum developed to be used with its mask that would help with that, while also improving the effectiveness of the light treatment.That certainly is intriguing, and Balooch indicated that creating formulations that are designed to work with devices like the LED masks is a future direction for the company. A pair of hands using the L'Oréal Light Straight and multi-styler on a person's hair. L'Oréal I’m also interested in the Light Straight, which like the company’s AirLight Pro uses infrared light to help dry or style hair. According to the company’s press release, hair straighteners with “ordinary heating places can reach temperatures of 400°F and higher—above the threshold at which keratin denatures, leading to weakened cuticles, breakage and reduced shine.” For context, I used to turn my flatiron all the way up to 425 degrees Fahrenheit to tame my tresses (though these days I find a more reasonable 330 degrees is good enough).L’Oréal says the Light Straight and its “patented infrared light technology” can “help provide exceptional styling results at lower temperatures, to better protect the health of the hair.” The device’s glass plates never exceed 320 degrees, and the company says its testing found that the Light Straight is three times faster and leaves hair twice as smooth as “leading premium hair stylers.” I’m not sure how you would quantify smoothness, but I’m hopeful the results do pan out in the real world. The Light Straight uses near-infrared light that L’Oréal says “penetrates deeply into hair fibers” to “reshape internal hydrogen bonds.” It also has sensors onboard with “built-in proprietary algorithms and machine learning” to adapt to your gestures “to maximize individual experience.” I’m not sure what that means, but I hope to find out more this week at CES. Given the Light Straight doesn’t launch till 2027, it’s not surprising that pricing and other details aren’t yet available. But for now, I’m keen to see companies continue to investigate novel, hopefully healthier ways for us to look and feel beautiful.This article originally appeared on Engadget at https://www.engadget.com/science/loreals-ces-2026-beauty-devices-include-a-skin-like-flexible-led-mask-070000576.html?src=rss",
          "feed_position": 45,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Loreal-LED-Eye-Mask-7.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/samsung-freestyle-plus-projector-hands-on-ces-2026-060840386.html",
          "published_at": "Mon, 05 Jan 2026 06:08:41 +0000",
          "title": "Samsung’s Freestyle+ projector hands-on: Much brighter and impressively adaptable",
          "standfirst": "Samsung announced its newest portable projector ahead of its First Look showcase at CES 2026, but you might have been a little confused as to what’s changed. The company says the Freestyle+ is nearly twice as bright as the 2022 Freestyle projector, rated at 230 ISO lumens, which was pretty underwhelming. The new Freestyle+ can output at 430 ISO lumens. If this is the first you’re hearing of ISO Lumens, it’s an internationally standardized rating for projectors, intended to standardize manufacturers' claims of brightness. It still looks very similar to its predecessors, with 160 degrees of rotation that makes it easy to set up in most homes, Airbnbs or meeting rooms. Samsung added support for Q-Symphony, allowing you to connect it to the company’s soundbars, if you conveniently have one nearby. While the sound quality of its built-in speaker was hard to test in the middle of a post-keynote trade show floor, you’ll probably want to augment the built-in speaker, if only because it’s so small. Vision AI, mentioned several times during Samsung’s CES keynote, is also built into the portable projector. You can summon Bixby to adjust settings and whatever you’re watching. Based on the demos I saw, you’ll need to speak into the remote to access Bixby. Other improvements bring the projector into 2026, with keystone correction and focus. The Freestyle+’s AI OptiScreen can calibrate projections to different wall surfaces and colors to improve visibility even on your most vivid walls. Mat Smith for Engadget The updated 3D Auto Keystone corrects distortion even when projecting onto uneven or non-flat surfaces, such as corners, curtains or angled walls. It’s hard to put into words, but pointing the Freestyle+ to a corner, or at an undulating curtain, and watching the image morph and contort was almost hypnotic. The premise is that you can point this at any area of your home (or even, say, the side of a tent), and the 3D Auto Keystone will flatten the image in seconds. There’s also Screen Fit, which automatically adjusts the image to match a projector screen size. The Freestyle+ can project up to a 100-inch 1080p image, at maximum. However, Wall Calibration might be the most technically impressive in a device this size. It detects and analyzes the color of the projection surface and recalibrates the image’s color tone to minimize the effect. It can even detect and match a wall pattern to reduce visual interference, which worked well in person. The Samsung spokesperson used the aforementioned Bixby voice commands to calibrate the screen. If there’s still something to address, it’s that this portable projector must be plugged in to operate. When that can be either a power bank or a wall outlet, it seems a bit cheeky to call it portable. Samsung typically announces prices and launch dates once the CES dust has settled, but it's set to arrive in the first half of 2026. Previous iterations cost around $900, but early impressions suggest it’s a versatile, petite projector. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsung-freestyle-plus-projector-hands-on-ces-2026-060840386.html?src=rss",
          "content": "Samsung announced its newest portable projector ahead of its First Look showcase at CES 2026, but you might have been a little confused as to what’s changed. The company says the Freestyle+ is nearly twice as bright as the 2022 Freestyle projector, rated at 230 ISO lumens, which was pretty underwhelming. The new Freestyle+ can output at 430 ISO lumens. If this is the first you’re hearing of ISO Lumens, it’s an internationally standardized rating for projectors, intended to standardize manufacturers' claims of brightness. It still looks very similar to its predecessors, with 160 degrees of rotation that makes it easy to set up in most homes, Airbnbs or meeting rooms. Samsung added support for Q-Symphony, allowing you to connect it to the company’s soundbars, if you conveniently have one nearby. While the sound quality of its built-in speaker was hard to test in the middle of a post-keynote trade show floor, you’ll probably want to augment the built-in speaker, if only because it’s so small. Vision AI, mentioned several times during Samsung’s CES keynote, is also built into the portable projector. You can summon Bixby to adjust settings and whatever you’re watching. Based on the demos I saw, you’ll need to speak into the remote to access Bixby. Other improvements bring the projector into 2026, with keystone correction and focus. The Freestyle+’s AI OptiScreen can calibrate projections to different wall surfaces and colors to improve visibility even on your most vivid walls. Mat Smith for Engadget The updated 3D Auto Keystone corrects distortion even when projecting onto uneven or non-flat surfaces, such as corners, curtains or angled walls. It’s hard to put into words, but pointing the Freestyle+ to a corner, or at an undulating curtain, and watching the image morph and contort was almost hypnotic. The premise is that you can point this at any area of your home (or even, say, the side of a tent), and the 3D Auto Keystone will flatten the image in seconds. There’s also Screen Fit, which automatically adjusts the image to match a projector screen size. The Freestyle+ can project up to a 100-inch 1080p image, at maximum. However, Wall Calibration might be the most technically impressive in a device this size. It detects and analyzes the color of the projection surface and recalibrates the image’s color tone to minimize the effect. It can even detect and match a wall pattern to reduce visual interference, which worked well in person. The Samsung spokesperson used the aforementioned Bixby voice commands to calibrate the screen. If there’s still something to address, it’s that this portable projector must be plugged in to operate. When that can be either a power bank or a wall outlet, it seems a bit cheeky to call it portable. Samsung typically announces prices and launch dates once the CES dust has settled, but it's set to arrive in the first half of 2026. Previous iterations cost around $900, but early impressions suggest it’s a versatile, petite projector. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsung-freestyle-plus-projector-hands-on-ces-2026-060840386.html?src=rss",
          "feed_position": 46,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2026-01/6825cde0-e9f6-11f0-bb3b-f9df6ed116f0"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/samsung-brought-an-absolute-beast-of-a-130-inch-micro-rgb-tv-to-ces-2026-060245387.html",
          "published_at": "Mon, 05 Jan 2026 06:02:45 +0000",
          "title": "Samsung brought an absolute beast of a 130-inch Micro RGB TV to CES 2026",
          "standfirst": "Amid endless AI hype and a guest visit from the CEO of Hartford Steam Boiler (?!), Samsung had a big surprise for us tonight at CES 2026: A massive 130-inch Micro RGB TV. It’s so large, it’s suspended by a large metal stand that surrounds the entire screen, which also lets you tilt the screen just a bit. (For the Samsung diehards, it’s basically a reinvention of its “timeless gallery” stand from 2013.) I imagine bringing this TV home would be like Bart Simpson adopting his beloved elephant Stampy: Your pets would be terrified, and your family would probably be annoyed at this television dominating so much of your home.But boy, it sure looks amazing in person. Just like LG’s Micro RGB set, it’s using an evolved form of Mini LED technology that allows for far better color accuracy and richness. As I fought through the crowds of Samsung’s CES First Look event to catch a glimpse of it, I couldn’t help but notice how everyone just looked a bit stunned, like the monkeys from 2001 seeing the monolith for the first time.Samsung's 130-inch Micro RGB TV from the side.Devindra Hardawar for EngadgetSamsung representatives were clear that this Micro RGB set was only a concept of what the company could do with the technology, it’s not an actual product it plans to ship. In another demo, Samsung took the 130-inch screen and mounted it directly on a wall (below). Of course, it still looked stunning. I also learned that if you wanted to wall mount the “timeless gallery” stand concept, you actually have to mount the entire stand to the wall, since it’s part of the TV’s speaker system.Samsung didn’t have too many details about the technical aspects of the 130-inch Micro RGB TV, but it did shout buzzwords at us during its announcement. it’s powered by the company’s “Micro RGB AI Engine Pro” processor, which includes “Micro RGB Color Booster Pro” and “Micro RGB HDR Pro” technology, using AI to “enhance dull tones and refine contrast, delivering vivid color and subtle detail across bright and dark scenes alike for realism and picture fidelity.”Samsung's 130-inch Micro RGB TV mounted in a wall.Devindra Hardawar for EngadgetThe Micro RGB set also sports the company’s Glare Free technology to reduce reflections, and it supports HDR 10+ Advanced and the company’s Eclipsa Audio. It can also tap into Samsung’s Vision AI Companion for conversational search, as well as Microsoft Copilot and Perplexity.But of course, those details really don’t matter, because you won’t be able to buy the 130-inch Micro RGB TV in its current form. We were impressed by last year’s 115-inch model, but its $30,000 price didn’t make it feasible for anyone but the ultra-rich. And those folks would be better off investing in Samsung’s own Micro LED sets, which offer the benefits of OLED that Micro RGB does not. (Sure, those TVs start at $110,000, but for that’s not exactly a huge leap for those with deep pockets.) Samsung's 130-inch Micro RGB TV from the rear.Devindra Hardawar for EngadgetThis article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsung-brought-an-absolute-beast-of-a-130-inch-micro-rgb-tv-to-ces-2026-060245387.html?src=rss",
          "content": "Amid endless AI hype and a guest visit from the CEO of Hartford Steam Boiler (?!), Samsung had a big surprise for us tonight at CES 2026: A massive 130-inch Micro RGB TV. It’s so large, it’s suspended by a large metal stand that surrounds the entire screen, which also lets you tilt the screen just a bit. (For the Samsung diehards, it’s basically a reinvention of its “timeless gallery” stand from 2013.) I imagine bringing this TV home would be like Bart Simpson adopting his beloved elephant Stampy: Your pets would be terrified, and your family would probably be annoyed at this television dominating so much of your home.But boy, it sure looks amazing in person. Just like LG’s Micro RGB set, it’s using an evolved form of Mini LED technology that allows for far better color accuracy and richness. As I fought through the crowds of Samsung’s CES First Look event to catch a glimpse of it, I couldn’t help but notice how everyone just looked a bit stunned, like the monkeys from 2001 seeing the monolith for the first time.Samsung's 130-inch Micro RGB TV from the side.Devindra Hardawar for EngadgetSamsung representatives were clear that this Micro RGB set was only a concept of what the company could do with the technology, it’s not an actual product it plans to ship. In another demo, Samsung took the 130-inch screen and mounted it directly on a wall (below). Of course, it still looked stunning. I also learned that if you wanted to wall mount the “timeless gallery” stand concept, you actually have to mount the entire stand to the wall, since it’s part of the TV’s speaker system.Samsung didn’t have too many details about the technical aspects of the 130-inch Micro RGB TV, but it did shout buzzwords at us during its announcement. it’s powered by the company’s “Micro RGB AI Engine Pro” processor, which includes “Micro RGB Color Booster Pro” and “Micro RGB HDR Pro” technology, using AI to “enhance dull tones and refine contrast, delivering vivid color and subtle detail across bright and dark scenes alike for realism and picture fidelity.”Samsung's 130-inch Micro RGB TV mounted in a wall.Devindra Hardawar for EngadgetThe Micro RGB set also sports the company’s Glare Free technology to reduce reflections, and it supports HDR 10+ Advanced and the company’s Eclipsa Audio. It can also tap into Samsung’s Vision AI Companion for conversational search, as well as Microsoft Copilot and Perplexity.But of course, those details really don’t matter, because you won’t be able to buy the 130-inch Micro RGB TV in its current form. We were impressed by last year’s 115-inch model, but its $30,000 price didn’t make it feasible for anyone but the ultra-rich. And those folks would be better off investing in Samsung’s own Micro LED sets, which offer the benefits of OLED that Micro RGB does not. (Sure, those TVs start at $110,000, but for that’s not exactly a huge leap for those with deep pockets.) Samsung's 130-inch Micro RGB TV from the rear.Devindra Hardawar for EngadgetThis article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsung-brought-an-absolute-beast-of-a-130-inch-micro-rgb-tv-to-ces-2026-060245387.html?src=rss",
          "feed_position": 47,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/Samsung_Micro_RGB-2.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/speakers/samsung-music-studio-5-and-7-hands-on-unique-speaker-designs-debut-at-ces-2026-052009007.html",
          "published_at": "Mon, 05 Jan 2026 05:20:09 +0000",
          "title": "Samsung Music Studio 5 and 7 hands-on: Unique speaker designs debut at CES 2026",
          "standfirst": "In addition to its annual soundbar updates, Samsung debuted two new home speakers at CES 2026. The Music Studio 5 and 7 are Bluetooth and Wi-Fi units designed to blend in with your home decor thanks to their minimalist look. They certainly don’t look like your typical speakers, and Samsung has packed them with features that it says will ensure optimal sound quality from each one. The Music Studio 5 has a four-inch woofer and two tweeters, and a sound profile that’s optimized by AI Dynamic Bass Control. The design is an interesting interplay between a circle and a square, but the speaker delivers crisp, clear sound — even in the roar of a CES demo area. The Music Studio 5 will also come in a smattering of colors, which could lend a pop to a bookshelf. Controls line the top edge, including one-touch access to Spotify.Samsung Music Studio 7Billy Steele for EngadgetIf you’re looking for something more robust, the Music Studio 7 is a 3.1.1-channel unit that’s capable of four-direction spatial audio and high-resolution listening. Samsung says you can enjoy tunes at up to up to 24-bit/96kHz and the speaker can be used as part of a turntable setup. The sound here is more robust as I heard noticeably more bass from the 7 than on the 5. The various control buttons are up top here as well, positioned near the front of the speaker for easy access. You can also use up to four Music Studio speakers as a surround sound setup in your living room. I listened to a brief demo where Samsung was using four Music Studio 7 units in a makeshift home theater. This combo provided great immersion, with lots of detail in the directional sound in the clips being broadcast on the connected TV. Samsung also says you can use up to 10 Music Studio speakers for audio only.The company didn’t announce any pricing details yet, but that’s likely to come just before the Music Studio speakers are available for purchase. That date is TBD as well. This article originally appeared on Engadget at https://www.engadget.com/audio/speakers/samsung-music-studio-5-and-7-hands-on-unique-speaker-designs-debut-at-ces-2026-052009007.html?src=rss",
          "content": "In addition to its annual soundbar updates, Samsung debuted two new home speakers at CES 2026. The Music Studio 5 and 7 are Bluetooth and Wi-Fi units designed to blend in with your home decor thanks to their minimalist look. They certainly don’t look like your typical speakers, and Samsung has packed them with features that it says will ensure optimal sound quality from each one. The Music Studio 5 has a four-inch woofer and two tweeters, and a sound profile that’s optimized by AI Dynamic Bass Control. The design is an interesting interplay between a circle and a square, but the speaker delivers crisp, clear sound — even in the roar of a CES demo area. The Music Studio 5 will also come in a smattering of colors, which could lend a pop to a bookshelf. Controls line the top edge, including one-touch access to Spotify.Samsung Music Studio 7Billy Steele for EngadgetIf you’re looking for something more robust, the Music Studio 7 is a 3.1.1-channel unit that’s capable of four-direction spatial audio and high-resolution listening. Samsung says you can enjoy tunes at up to up to 24-bit/96kHz and the speaker can be used as part of a turntable setup. The sound here is more robust as I heard noticeably more bass from the 7 than on the 5. The various control buttons are up top here as well, positioned near the front of the speaker for easy access. You can also use up to four Music Studio speakers as a surround sound setup in your living room. I listened to a brief demo where Samsung was using four Music Studio 7 units in a makeshift home theater. This combo provided great immersion, with lots of detail in the directional sound in the clips being broadcast on the connected TV. Samsung also says you can use up to 10 Music Studio speakers for audio only.The company didn’t announce any pricing details yet, but that’s likely to come just before the Music Studio speakers are available for purchase. That date is TBD as well. This article originally appeared on Engadget at https://www.engadget.com/audio/speakers/samsung-music-studio-5-and-7-hands-on-unique-speaker-designs-debut-at-ces-2026-052009007.html?src=rss",
          "feed_position": 48,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/sound-studio-4.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/home-theater/samsung-hw-qs90h-soundbar-hands-on-impressive-bass-performance-without-a-subwoofer-045727939.html",
          "published_at": "Mon, 05 Jan 2026 04:57:27 +0000",
          "title": "Samsung HW-QS90H soundbar hands-on: Impressive bass performance without a subwoofer",
          "standfirst": "We’re used to Samsung updating its Q990 soundbar at CES every year, and 2026 is no different. However, the company also debuted the HW-QS90H: a new all-in-one option that Samsung says won’t require a standalone subwoofer due to its Quad Bass Woofer system. The QS90H offers 7.1.2-channel audio with 13 total drivers. Before the show properly kicks off, we got to listen to the new soundbar for a quick judge of its merits. The first thing I noticed about the QS90H is its impressive bass performance. Most of the time when a company claims its soundbar doesn’t need a subwoofer, that proves to be untrue. But even in the chaos of a noisy demo area, I could clearly hear the bassy thump coming from the QS90H’s built-in subwoofers. For once, I think would-be buyers could get by without a sub, especially in smaller living rooms. Samsung achieved this with two of those Quad woofers. These drivers push air in two directions rather than just one, which helps with the extra low-end tone. The company didn’t sacrifice clarity either. The nine additional drivers, positioned for front, side, wide and up firing sound, provide the clear detail I’ve come to expect from Samsung.Samsung QS90H soundbarBilly Steele for EngadgetThe QS90H also features Samsung’s Convertible Fit Design technology that debuted on the QS700F last year. This tool allows you to sit the soundbar flat on a shelf or mantle, or rotate it to mount on the wall. Built-in sensors automatically adjust the driver performance for each orientation, so that sound quality isn’t affected by the selected positioning. During my demo, I didn’t notice any difference in performance when the orientation changed. In fact, the QS90H looks a lot like the QS700F on the outside, with similar grille patters and control designs. Samsung didn’t announce pricing or availability tonight, but that’s likely to come just prior to any on-sale date. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsung-hw-qs90h-soundbar-hands-on-impressive-bass-performance-without-a-subwoofer-045727939.html?src=rss",
          "content": "We’re used to Samsung updating its Q990 soundbar at CES every year, and 2026 is no different. However, the company also debuted the HW-QS90H: a new all-in-one option that Samsung says won’t require a standalone subwoofer due to its Quad Bass Woofer system. The QS90H offers 7.1.2-channel audio with 13 total drivers. Before the show properly kicks off, we got to listen to the new soundbar for a quick judge of its merits. The first thing I noticed about the QS90H is its impressive bass performance. Most of the time when a company claims its soundbar doesn’t need a subwoofer, that proves to be untrue. But even in the chaos of a noisy demo area, I could clearly hear the bassy thump coming from the QS90H’s built-in subwoofers. For once, I think would-be buyers could get by without a sub, especially in smaller living rooms. Samsung achieved this with two of those Quad woofers. These drivers push air in two directions rather than just one, which helps with the extra low-end tone. The company didn’t sacrifice clarity either. The nine additional drivers, positioned for front, side, wide and up firing sound, provide the clear detail I’ve come to expect from Samsung.Samsung QS90H soundbarBilly Steele for EngadgetThe QS90H also features Samsung’s Convertible Fit Design technology that debuted on the QS700F last year. This tool allows you to sit the soundbar flat on a shelf or mantle, or rotate it to mount on the wall. Built-in sensors automatically adjust the driver performance for each orientation, so that sound quality isn’t affected by the selected positioning. During my demo, I didn’t notice any difference in performance when the orientation changed. In fact, the QS90H looks a lot like the QS700F on the outside, with similar grille patters and control designs. Samsung didn’t announce pricing or availability tonight, but that’s likely to come just prior to any on-sale date. This article originally appeared on Engadget at https://www.engadget.com/home/home-theater/samsung-hw-qs90h-soundbar-hands-on-impressive-bass-performance-without-a-subwoofer-045727939.html?src=rss",
          "feed_position": 49,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/qs90h-1.jpg"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/technology/intelition-changes-everything-ai-is-no-longer-a-tool-you-invoke",
          "published_at": "Sun, 04 Jan 2026 19:00:00 GMT",
          "title": "'Intelition' changes everything: AI is no longer a tool you invoke",
          "standfirst": "AI is evolving faster than our vocabulary for describing it. We may need a few new words. We have “cognition” for how a single mind thinks, but we don&#x27;t have a word for what happens when human and machine intelligence work together to perceive, decide, create and act. Let’s call that process intelition. Intelition isn’t a feature; it’s the organizing principle for the next wave of software where humans and AI operate inside the same shared model of the enterprise. Today’s systems treat AI models as things you invoke from the outside. You act as a “user,” prompting for responses or wiring a “human in the loop” step into agentic workflows. But that&#x27;s evolving into continuous co-production: People and agents are shaping decisions, logic and actions together, in real time. Read on for a breakdown of the three forces driving this new paradigm. A unified ontology is just the beginningIn a recent shareholder letter, Palantir CEO Alex Karp wrote that “all the value in the market is going to go to chips and what we call ontology,” and argued that this shift is “only the beginning of something much larger and more significant.” By ontology, Karp means a shared model of objects (customers, policies, assets, events) and their relationships. This also includes what Palantir calls an ontology’s “kinetic layer” that defines the actions and security permissions connecting objects.In the SaaS era, every enterprise application creates its own object and process models. Combined with a host of legacy systems and often chaotic models, enterprises face the challenge of stitching all this together. It’s a big and difficult job, with redundancies, incomplete structures and missing data. The reality: No matter how many data warehouse or data lake projects commissioned, few enterprises come close to creating a consolidated enterprise ontology. A unified ontology is essential for today’s agentic AI tools. As organizations link and federate ontologies, a new software paradigm emerges: Agentic AI can reason and act across suppliers, regulators, customers and operations, not just within a single app. As Karp describes it, the aim is “to tether the power of artificial intelligence to objects and relationships in the real world.” World models and continuous learningToday’s models can hold extensive context, but holding information isn’t the same as learning from it. Continual learning requires the accumulation of understanding, rather than resets with each retraining. To his aim, Google recently announced “Nested Learning” as a potential solution, grounded direclty into existing LLM architecture and training data. The authors don’t claim to have solved the challenges of building world models. But, Nested Learning could supply the raw ingredients for them: Durable memory with continual learning layered into the system. The endpoint would make retraining obsolete. In June 2022, Meta&#x27;s chief AI scientist Yann LeCun created a blueprint for “autonomous machine intelligence” that featured a hierarchical approach to using joint embeddings to make predictions using world models. He called the technique H-JEPA, and later put bluntly: “LLMs are good at manipulating language, but not at thinking.”Over the past three years, LeCun and his colleagues at Meta have moved H-JEPA theory into practice with open source models V-JEPA and I-JEPA, which learn image and video representations of the world. The personal intelition interface The third force in this agentic, ontology-driven world is the personal interface. This puts people at the center rather than as “users” on the periphery. This is not another app; it is the primary way a person participates in the next era of work and life. Rather than treating AI as something we visit through a chat window or API cal, the personal intelition interface will be always-on, aware of our context, preferences and goals and capable of acting on our behalf across the entire federated economy. Let’s analyze how this is already coming together.In May, Jony Ive sold his AI device company io to OpenAI to accelerate a new AI device category. He noted at the time: “If you make something new, if you innovate, there will be consequences unforeseen, and some will be wonderful, and some will be harmful. While some of the less positive consequences were unintentional, I still feel responsibility. And the manifestation of that is a determination to try and be useful.” That is, getting the personal intelligence device right means more than an attractive venture opportunity. Apple is looking beyond LLMs for on-device solutions that require less processing power and result in less latency when creating AI apps to understand “user intent.” Last year, they created UI-JEPA, an innovation that moves to “on-device analysis” of what the user wants. This strikes directly at the business model of today’s digital economy, where centralized profiling of “users” transforms intent and behavior data into vast revenue streams.Tim Berners-Lee, the inventor of the World Wide Web, recently noted: “The user has been reduced to a consumable product for the advertiser ... there&#x27;s still time to build machines that work for humans, and not the other way around.\" Moving user intent to the device will drive interest in a secure personal data management standard, Solid, that Berners-Lee and his colleagues have been developing since 2022. The standard is ideally suited to pair with new personal AI devices. For instance, Inrupt, Inc., a company founded by Berners-Lee, recently combined Solid with Anthropic’s MCP standard for Agentic Wallets. Personal control is more than a feature of this paradigm; it is the architectural safeguard as systems gain the ability to learn and act continuously.Ultimately, these three forces are moving and converging faster than most realize. Enterprise ontologies provide the nouns and verbs, world-model research supplies durable memory and learning and the personal interface becomes the permissioned point of control. The next software era isn&#x27;t coming. It&#x27;s already here.Brian Mulconrey is SVP at Sureify Labs.",
          "content": "AI is evolving faster than our vocabulary for describing it. We may need a few new words. We have “cognition” for how a single mind thinks, but we don&#x27;t have a word for what happens when human and machine intelligence work together to perceive, decide, create and act. Let’s call that process intelition. Intelition isn’t a feature; it’s the organizing principle for the next wave of software where humans and AI operate inside the same shared model of the enterprise. Today’s systems treat AI models as things you invoke from the outside. You act as a “user,” prompting for responses or wiring a “human in the loop” step into agentic workflows. But that&#x27;s evolving into continuous co-production: People and agents are shaping decisions, logic and actions together, in real time. Read on for a breakdown of the three forces driving this new paradigm. A unified ontology is just the beginningIn a recent shareholder letter, Palantir CEO Alex Karp wrote that “all the value in the market is going to go to chips and what we call ontology,” and argued that this shift is “only the beginning of something much larger and more significant.” By ontology, Karp means a shared model of objects (customers, policies, assets, events) and their relationships. This also includes what Palantir calls an ontology’s “kinetic layer” that defines the actions and security permissions connecting objects.In the SaaS era, every enterprise application creates its own object and process models. Combined with a host of legacy systems and often chaotic models, enterprises face the challenge of stitching all this together. It’s a big and difficult job, with redundancies, incomplete structures and missing data. The reality: No matter how many data warehouse or data lake projects commissioned, few enterprises come close to creating a consolidated enterprise ontology. A unified ontology is essential for today’s agentic AI tools. As organizations link and federate ontologies, a new software paradigm emerges: Agentic AI can reason and act across suppliers, regulators, customers and operations, not just within a single app. As Karp describes it, the aim is “to tether the power of artificial intelligence to objects and relationships in the real world.” World models and continuous learningToday’s models can hold extensive context, but holding information isn’t the same as learning from it. Continual learning requires the accumulation of understanding, rather than resets with each retraining. To his aim, Google recently announced “Nested Learning” as a potential solution, grounded direclty into existing LLM architecture and training data. The authors don’t claim to have solved the challenges of building world models. But, Nested Learning could supply the raw ingredients for them: Durable memory with continual learning layered into the system. The endpoint would make retraining obsolete. In June 2022, Meta&#x27;s chief AI scientist Yann LeCun created a blueprint for “autonomous machine intelligence” that featured a hierarchical approach to using joint embeddings to make predictions using world models. He called the technique H-JEPA, and later put bluntly: “LLMs are good at manipulating language, but not at thinking.”Over the past three years, LeCun and his colleagues at Meta have moved H-JEPA theory into practice with open source models V-JEPA and I-JEPA, which learn image and video representations of the world. The personal intelition interface The third force in this agentic, ontology-driven world is the personal interface. This puts people at the center rather than as “users” on the periphery. This is not another app; it is the primary way a person participates in the next era of work and life. Rather than treating AI as something we visit through a chat window or API cal, the personal intelition interface will be always-on, aware of our context, preferences and goals and capable of acting on our behalf across the entire federated economy. Let’s analyze how this is already coming together.In May, Jony Ive sold his AI device company io to OpenAI to accelerate a new AI device category. He noted at the time: “If you make something new, if you innovate, there will be consequences unforeseen, and some will be wonderful, and some will be harmful. While some of the less positive consequences were unintentional, I still feel responsibility. And the manifestation of that is a determination to try and be useful.” That is, getting the personal intelligence device right means more than an attractive venture opportunity. Apple is looking beyond LLMs for on-device solutions that require less processing power and result in less latency when creating AI apps to understand “user intent.” Last year, they created UI-JEPA, an innovation that moves to “on-device analysis” of what the user wants. This strikes directly at the business model of today’s digital economy, where centralized profiling of “users” transforms intent and behavior data into vast revenue streams.Tim Berners-Lee, the inventor of the World Wide Web, recently noted: “The user has been reduced to a consumable product for the advertiser ... there&#x27;s still time to build machines that work for humans, and not the other way around.\" Moving user intent to the device will drive interest in a secure personal data management standard, Solid, that Berners-Lee and his colleagues have been developing since 2022. The standard is ideally suited to pair with new personal AI devices. For instance, Inrupt, Inc., a company founded by Berners-Lee, recently combined Solid with Anthropic’s MCP standard for Agentic Wallets. Personal control is more than a feature of this paradigm; it is the architectural safeguard as systems gain the ability to learn and act continuously.Ultimately, these three forces are moving and converging faster than most realize. Enterprise ontologies provide the nouns and verbs, world-model research supplies durable memory and learning and the personal interface becomes the permissioned point of control. The next software era isn&#x27;t coming. It&#x27;s already here.Brian Mulconrey is SVP at Sureify Labs.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/7nS0fhhd8rb4GWzz2aXNYd/2f0ea05e1f3753e57a1ef4b14cc773d0/Thinking_together.png?w=300&q=30"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/orchestration/why-which-api-do-i-call-is-the-wrong-question-in-the-llm-era",
          "published_at": "Sat, 03 Jan 2026 22:00:00 GMT",
          "title": "Why “which API do I call?” is the wrong question in the LLM era",
          "standfirst": "For decades, we have adapted to software. We learned shell commands, memorized HTTP method names and wired together SDKs. Each interface assumed we would speak its language. In the 1980s, we typed &#x27;grep&#x27;, &#x27;ssh&#x27; and &#x27;ls&#x27; into a shell; by the mid-2000s, we were invoking REST endpoints like GET /users; by the 2010s, we imported SDKs (client.orders.list()) so we didn’t have to think about HTTP. But underlying each of those steps was the same premise: Expose capabilities in a structured form so others can invoke them.But now we are entering the next interface paradigm. Modern LLMs are challenging the notion that a user must choose a function or remember a method signature. Instead of “Which API do I call?” the question becomes: “What outcome am I trying to achieve?” In other words, the interface is shifting from code → to language. In this shift, Model Context Protocol (MCP) emerges as the abstraction that allows models to interpret human intent, discover capabilities and execute workflows, effectively exposing software functions not as programmers know them, but as natural-language requests.MCP is not a hype-term; multiple independent studies identify the architectural shift required for “LLM-consumable” tool invocation. One blog by Akamai engineers describes the transition from traditional APIs to “language-driven integrations” for LLMs. Another academic paper on “AI agentic workflows and enterprise APIs” talks about how enterprise API architecture must evolve to support goal-oriented agents rather than human-driven calls. In short: We are no longer merely designing APIs for code; we are designing capabilities for intent.Why does this matter for enterprises? Because enterprises are drowning in internal systems, integration sprawl and user training costs. Workers struggle not because they don’t have tools, but because they have too many tools, each with its own interface. When natural language becomes the primary interface, the barrier of “which function do I call?” disappears. One recent business blog observed that natural‐language interfaces (NLIs) are enabling self-serve data access for marketers who previously had to wait for analysts to write SQL. When the user just states intent (like “fetch last quarter revenue for region X and flag anomalies”), the system underneath can translate that into calls, orchestration, context memory and deliver results. Natural language becomes not a convenience, but the interfaceTo understand how this evolution works, consider the interface ladder:EraInterfaceWho it was built forCLIShell commandsExpert users typing textAPIWeb or RPC endpointsDevelopers integrating systemsSDKLibrary functionsProgrammers using abstractionsNatural language (MCP)Intent-based requestsHuman + AI agents stating what they wantThrough each step, humans had to “learn the machine’s language.” With MCP, the machine absorbs the human’s language and works out the rest. That’s not just UX improvement, it’s an architectural shift.Under MCP, functions of code are still there: data access, business logic and orchestration. But they’re discovered rather than invoked manually. For example, rather than calling \"billingApi.fetchInvoices(customerId=…),\" you say “Show all invoices for Acme Corp since January and highlight any late payments.” The model resolves the entities, calls the right systems, filters and returns structured insight. The developer’s work shifts from wiring endpoints to defining capability surfaces and guardrails.This shift transforms developer experience and enterprise integration. Teams often struggle to onboard new tools because they require mapping schemas, writing glue code and training users. With a natural-language front, onboarding involves defining business entity names, declaring capabilities and exposing them via the protocol. The human (or AI agent) no longer needs to know parameter names or call order. Studies show that using LLMs as interfaces to APIs can reduce the time and resources required to develop chatbots or tool-invoked workflows.The change also brings productivity benefits. Enterprises that adopt LLM-driven interfaces can turn data access latency (hours/days) into conversation latency (seconds). For instance, if an analyst previously had to export CSVs, run transforms and deploy slides, a language interface allows “Summarize the top five risk factors for churn over the last quarter” and generate narrative + visuals in one go. The human then reviews, adjusts and acts — shifting from data plumber to decision maker. That matters: According to a survey by McKinsey & Company, 63% of organizations using gen AI are already creating text outputs, and more than one-third are generating images or code. (While many are still in the early days of capturing enterprise-wide ROI, the signal is clear: Language as interface unlocks new value.In architectural terms, this means software design must evolve. MCP demands systems that publish capability metadata, support semantic routing, maintain context memory and enforce guardrails. An API design no longer needs to ask “What function will the user call?”, but rather “What intent might the user express?” A recently published framework for improving enterprise APIs for LLMs shows how APIs can be enriched with natural-language-friendly metadata so that agents can select tools dynamically. The implication: Software becomes modular around intent surfaces rather than function surfaces.Language-first systems also bring risks and requirements. Natural language is ambiguous by nature, so enterprises must implement authentication, logging, provenance and access control, just as they did for APIs. Without these guardrails, an agent might call the wrong system, expose data or misinterpret intent. One post on “prompt collapse” calls out the danger: As natural-language UI becomes dominant, software may turn into “a capability accessed through conversation” and the company into “an API with a natural-language frontend”. That transformation is powerful, but only safe if systems are designed for introspection, audit and governance.The shift also has cultural and organizational ramifications. For decades, enterprises hired integration engineers to design APIs and middleware. With MCP-driven models, companies will increasingly hire ontology engineers, capability architects and agent enablement specialists. These roles focus on defining the semantics of business operations, mapping business entities to system capabilities and curating context memory. Because the interface is now human-centric, skills such as domain knowledge, prompt framing, oversight and evaluation become central.What should enterprise leaders do today? First, think of natural language as the interface layer, not as a fancy add-on. Map your business workflows that can safely be invoked via language. Then catalogue the underlying capabilities you already have: data services, analytics and APIs. Then ask: “Are these discoverable? Can they be called via intent?” Finally, pilot an MCP-style layer: Build a small domain (customer support triage) where a user or agent can express outcomes in language, and let systems do the orchestration. Then iterate and scale.Natural language is not just the new front-end. It is becoming the default interface layer for software, replacing CLI, then APIs, then SDKs. MCP is the abstraction that makes this possible. Benefits include faster integration, modular systems, higher productivity and new roles. For those organizations still tethered to calling endpoints manually, the shift will feel like learning a new platform all over again. The question is no longer “which function do I call?” but “what do I want to do?”Dhyey Mavani is accelerating gen AI and computational mathematics.",
          "content": "For decades, we have adapted to software. We learned shell commands, memorized HTTP method names and wired together SDKs. Each interface assumed we would speak its language. In the 1980s, we typed &#x27;grep&#x27;, &#x27;ssh&#x27; and &#x27;ls&#x27; into a shell; by the mid-2000s, we were invoking REST endpoints like GET /users; by the 2010s, we imported SDKs (client.orders.list()) so we didn’t have to think about HTTP. But underlying each of those steps was the same premise: Expose capabilities in a structured form so others can invoke them.But now we are entering the next interface paradigm. Modern LLMs are challenging the notion that a user must choose a function or remember a method signature. Instead of “Which API do I call?” the question becomes: “What outcome am I trying to achieve?” In other words, the interface is shifting from code → to language. In this shift, Model Context Protocol (MCP) emerges as the abstraction that allows models to interpret human intent, discover capabilities and execute workflows, effectively exposing software functions not as programmers know them, but as natural-language requests.MCP is not a hype-term; multiple independent studies identify the architectural shift required for “LLM-consumable” tool invocation. One blog by Akamai engineers describes the transition from traditional APIs to “language-driven integrations” for LLMs. Another academic paper on “AI agentic workflows and enterprise APIs” talks about how enterprise API architecture must evolve to support goal-oriented agents rather than human-driven calls. In short: We are no longer merely designing APIs for code; we are designing capabilities for intent.Why does this matter for enterprises? Because enterprises are drowning in internal systems, integration sprawl and user training costs. Workers struggle not because they don’t have tools, but because they have too many tools, each with its own interface. When natural language becomes the primary interface, the barrier of “which function do I call?” disappears. One recent business blog observed that natural‐language interfaces (NLIs) are enabling self-serve data access for marketers who previously had to wait for analysts to write SQL. When the user just states intent (like “fetch last quarter revenue for region X and flag anomalies”), the system underneath can translate that into calls, orchestration, context memory and deliver results. Natural language becomes not a convenience, but the interfaceTo understand how this evolution works, consider the interface ladder:EraInterfaceWho it was built forCLIShell commandsExpert users typing textAPIWeb or RPC endpointsDevelopers integrating systemsSDKLibrary functionsProgrammers using abstractionsNatural language (MCP)Intent-based requestsHuman + AI agents stating what they wantThrough each step, humans had to “learn the machine’s language.” With MCP, the machine absorbs the human’s language and works out the rest. That’s not just UX improvement, it’s an architectural shift.Under MCP, functions of code are still there: data access, business logic and orchestration. But they’re discovered rather than invoked manually. For example, rather than calling \"billingApi.fetchInvoices(customerId=…),\" you say “Show all invoices for Acme Corp since January and highlight any late payments.” The model resolves the entities, calls the right systems, filters and returns structured insight. The developer’s work shifts from wiring endpoints to defining capability surfaces and guardrails.This shift transforms developer experience and enterprise integration. Teams often struggle to onboard new tools because they require mapping schemas, writing glue code and training users. With a natural-language front, onboarding involves defining business entity names, declaring capabilities and exposing them via the protocol. The human (or AI agent) no longer needs to know parameter names or call order. Studies show that using LLMs as interfaces to APIs can reduce the time and resources required to develop chatbots or tool-invoked workflows.The change also brings productivity benefits. Enterprises that adopt LLM-driven interfaces can turn data access latency (hours/days) into conversation latency (seconds). For instance, if an analyst previously had to export CSVs, run transforms and deploy slides, a language interface allows “Summarize the top five risk factors for churn over the last quarter” and generate narrative + visuals in one go. The human then reviews, adjusts and acts — shifting from data plumber to decision maker. That matters: According to a survey by McKinsey & Company, 63% of organizations using gen AI are already creating text outputs, and more than one-third are generating images or code. (While many are still in the early days of capturing enterprise-wide ROI, the signal is clear: Language as interface unlocks new value.In architectural terms, this means software design must evolve. MCP demands systems that publish capability metadata, support semantic routing, maintain context memory and enforce guardrails. An API design no longer needs to ask “What function will the user call?”, but rather “What intent might the user express?” A recently published framework for improving enterprise APIs for LLMs shows how APIs can be enriched with natural-language-friendly metadata so that agents can select tools dynamically. The implication: Software becomes modular around intent surfaces rather than function surfaces.Language-first systems also bring risks and requirements. Natural language is ambiguous by nature, so enterprises must implement authentication, logging, provenance and access control, just as they did for APIs. Without these guardrails, an agent might call the wrong system, expose data or misinterpret intent. One post on “prompt collapse” calls out the danger: As natural-language UI becomes dominant, software may turn into “a capability accessed through conversation” and the company into “an API with a natural-language frontend”. That transformation is powerful, but only safe if systems are designed for introspection, audit and governance.The shift also has cultural and organizational ramifications. For decades, enterprises hired integration engineers to design APIs and middleware. With MCP-driven models, companies will increasingly hire ontology engineers, capability architects and agent enablement specialists. These roles focus on defining the semantics of business operations, mapping business entities to system capabilities and curating context memory. Because the interface is now human-centric, skills such as domain knowledge, prompt framing, oversight and evaluation become central.What should enterprise leaders do today? First, think of natural language as the interface layer, not as a fancy add-on. Map your business workflows that can safely be invoked via language. Then catalogue the underlying capabilities you already have: data services, analytics and APIs. Then ask: “Are these discoverable? Can they be called via intent?” Finally, pilot an MCP-style layer: Build a small domain (customer support triage) where a user or agent can express outcomes in language, and let systems do the orchestration. Then iterate and scale.Natural language is not just the new front-end. It is becoming the default interface layer for software, replacing CLI, then APIs, then SDKs. MCP is the abstraction that makes this possible. Benefits include faster integration, modular systems, higher productivity and new roles. For those organizations still tethered to calling endpoints manually, the shift will feel like learning a new platform all over again. The question is no longer “which function do I call?” but “what do I want to do?”Dhyey Mavani is accelerating gen AI and computational mathematics.",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/P8UEbu2620zRqcW1UFux1/d072a1aa21ec528b2c6b98ca1701e800/MCP.jpeg?w=300&q=30"
        }
      ],
      "featured_image": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/a087c5f0-e9f4-11f0-87f1-6f39e4849c7d.jpeg",
      "popularity_score": 2019.8118825
    },
    {
      "id": "cluster_75",
      "coverage": 2,
      "updated_at": "Mon, 05 Jan 2026 07:00:14 -0500",
      "title": "African fintech Flutterwave acquires Nigerian open banking startup Mono, sources say in an all-stock deal valued at $25M to $40M; Mono raised $17.5M since 2020 (Tage Kene-Okafor/TechCrunch)",
      "neutral_headline": "Flutterwave buys Nigeria&#8217;s Mono in rare African fintech exit",
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260105/p13#a260105p13",
          "published_at": "Mon, 05 Jan 2026 07:00:14 -0500",
          "title": "African fintech Flutterwave acquires Nigerian open banking startup Mono, sources say in an all-stock deal valued at $25M to $40M; Mono raised $17.5M since 2020 (Tage Kene-Okafor/TechCrunch)",
          "standfirst": "Tage Kene-Okafor / TechCrunch: African fintech Flutterwave acquires Nigerian open banking startup Mono, sources say in an all-stock deal valued at $25M to $40M; Mono raised $17.5M since 2020 &mdash; Africa's largest fintech company, Flutterwave, has acquired Nigerian open banking startup Mono in an all-stock deal valued between $25 million &hellip;",
          "content": "Tage Kene-Okafor / TechCrunch: African fintech Flutterwave acquires Nigerian open banking startup Mono, sources say in an all-stock deal valued at $25M to $40M; Mono raised $17.5M since 2020 &mdash; Africa's largest fintech company, Flutterwave, has acquired Nigerian open banking startup Mono in an all-stock deal valued between $25 million &hellip;",
          "feed_position": 10,
          "image_url": "http://www.techmeme.com/260105/i13.jpg"
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/05/flutterwave-buys-nigerias-mono-in-rare-african-fintech-exit/",
          "published_at": "Mon, 05 Jan 2026 08:55:28 +0000",
          "title": "Flutterwave buys Nigeria&#8217;s Mono in rare African fintech exit",
          "standfirst": "Africa’s largest fintech company, Flutterwave, has acquired Nigerian open banking startup Mono in an all-stock deal.",
          "content": "Africa’s largest fintech company, Flutterwave, has acquired Nigerian open banking startup Mono in an all-stock deal.",
          "feed_position": 12
        }
      ],
      "featured_image": "http://www.techmeme.com/260105/i13.jpg",
      "popularity_score": 2012.6577158333334
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 17:51:36 +0000",
      "title": "Google TV’s big Gemini update adds image and video generation, voice control for settings",
      "neutral_headline": "Google TV’s big Gemini update adds image and video...",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/01/gemini-expands-on-google-tv-bringing-nano-banana-and-veo-models-to-your-tv/",
          "published_at": "Mon, 05 Jan 2026 17:51:36 +0000",
          "title": "Google TV’s big Gemini update adds image and video generation, voice control for settings",
          "standfirst": "Google TV will let you generate and watch AI content on the big screen.",
          "content": "Soon, even loafing around on the couch won't help you steer clear of AI. TV makers are busily integrating AI models into the experience, and Google is no different. At CES, the company announced a big expansion of Gemini features on the Google TV platform, starting with TCL smart TVs. Google began integrating Gemini with the TV Streamer box this past fall, but the new expansion brings some of the company's most popular AI features to TVs: Nano Banana (image) and Veo (video), which offered a huge leap in visual fidelity at launch and have only improved with subsequent updates. Both models will be part of the TV experience, allowing users to modify or create new content. Google Photos AI remixing in Google TV. Credit: Google The Google TV platform connects to Google Photos, allowing Gemini to access those images with your approval. Gemini can generate a slideshow of your choosing on the spot, but it can also feed those images into Veo or Nano Banana. Using Gemini voice controls, you can remix a photo or turn a still image into a video. You can also enter a solo prompt to generate a totally new image or video with Google's AI on your TV.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/We_previewed_new_Gemini_for_Google_TV-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/We_previewed_new_Gemini_for_Google_TV-1152x648.png",
      "popularity_score": 363.5138269444444
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 19:15:09 +0000",
      "title": "BioWare’s Anthem will soon be completely unplayable",
      "neutral_headline": "BioWare’s Anthem will soon be completely unplayable",
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/gaming/2026/01/biowares-anthem-will-soon-be-completely-unplayable/",
          "published_at": "Mon, 05 Jan 2026 19:15:09 +0000",
          "title": "BioWare’s Anthem will soon be completely unplayable",
          "standfirst": "Replay the troubled jetpack shooter before the servers shut down for good on Jan. 12.",
          "content": "We'll admit that we weren't paying enough attention to the state of Anthem—BioWare's troubled 2019 jetpack-powered open-world shooter—to notice EA's July announcement that it was planning to shut down the game's servers. But with that planned server shutdown now just a week away, we thought it was worth alerting you readers to your final opportunity to play one of BioWare's most ambitious failures. Anthem was first unveiled at E3 2017 in a demo that was later revealed to have been largely faked to paper over major issues with the game's early development. Anthem’s early 2019 release was met with a lot of middling-to-poor reviews (including one from Ars itself), followed about a year later by a promise from BioWare General Manager Casey Hudson that a \"longer-term redesign\" and \"substantial reinvention\" of the overall game experience were coming. Hudson left BioWare in December of 2020, though, and a few months later that planned Anthem overhaul was officially canceled. But while active development on Anthem has been dormant for years, the game's servers have remained up and running in the interim. And though the game didn't exactly explode in popularity during that period of benign neglect, estimates from MMO Populations suggest a few hundred to a few thousand players have been jetpacking around the game's world daily. The game also still sees a smattering of daily Subreddit posts, including some hoping against hope for a fan-led private server revival, a la the Pretendo Network. And there are still a small handful of Twitch streamers sharing the game while they still can, including one racing to obtain all of the in-game Achievements after picking up a $4 copy at Goodwill.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anthem-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anthem-1152x648.jpg",
      "popularity_score": 352.90632694444446
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 17:42:45 +0000",
      "title": "X blames users for Grok-generated CSAM; no fixes announced",
      "neutral_headline": "X blames users for Grok-generated CSAM; no fixes announced",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/x-blames-users-for-grok-generated-csam-no-fixes-announced/",
          "published_at": "Mon, 05 Jan 2026 17:42:45 +0000",
          "title": "X blames users for Grok-generated CSAM; no fixes announced",
          "standfirst": "Critics call for App Store ban after Grok sexualized images of minors.",
          "content": "It seems that instead of updating Grok to prevent outputs of sexualized images of minors, X is planning to purge users generating content that the platform deems illegal, including Grok-generated child sexual abuse material (CSAM). On Saturday, X Safety finally posted an official response after nearly a week of backlash over Grok outputs that sexualized real people without consent. Offering no apology for Grok's functionality, X Safety blamed users for prompting Grok to produce CSAM while reminding them that such prompts can trigger account suspensions and possible legal consequences. \"We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary,\" X Safety said. \"Anyone using or prompting Grok to make illegal content will suffer the same consequences as if they upload illegal content.\"Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2233914159-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2233914159-1024x648.jpg",
      "popularity_score": 341.36632694444444
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 16:48:07 +0000",
      "title": "Providers dropping common anesthesia drug that’s also a climate super pollutant",
      "neutral_headline": "Providers dropping common anesthesia drug that’s also a climate super pollutant",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/providers-dropping-common-anesthesia-drug-thats-also-a-climate-super-pollutant/",
          "published_at": "Mon, 05 Jan 2026 16:48:07 +0000",
          "title": "Providers dropping common anesthesia drug that’s also a climate super pollutant",
          "standfirst": "The European Union now prohibits desflurane's use during most procedures.",
          "content": "Desflurane is a common anesthetic used in hospital operating rooms worldwide. It’s also a climate super pollutant. Now, several decades after the drug was first introduced, a growing number of US hospitals have stopped using the anesthetic because of its outsized environmental impact. On January 1, the European Union went a step further, prohibiting its use in all but medically necessary cases. Desflurane is more than 7,000 times more effective at warming the planet over a 20-year period than carbon dioxide on a pound-for-pound basis. However, curbing its use alone won’t solve climate change. The anesthetic contributes only a small fraction of total global warming, which is driven by far larger volumes of carbon dioxide and methane emissions. Still, emissions from the drug add up. Approximately 1,000 tons of the gas are vented from hospitals and other health care facilities worldwide each year. The emissions have a near-term climate impact equivalent to the annual greenhouse gas emissions from approximately 1.6 million automobiles.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-596435371-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-596435371-1152x648.jpg",
      "popularity_score": 328.4557713888889
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 17:10:55 +0000",
      "title": "Earliest African cremation was 9,500 years ago",
      "neutral_headline": "Earliest African cremation was 9,500 years ago",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/earliest-african-cremation-was-9500-years-ago/",
          "published_at": "Mon, 05 Jan 2026 17:10:55 +0000",
          "title": "Earliest African cremation was 9,500 years ago",
          "standfirst": "New findings prompt a rethinking of group labor and ritual in ancient hunter-gatherer communities.",
          "content": "Archaeologists have discovered Africa's oldest known cremation pyre at the base of Mount Hora in Malawi. According to a paper published in the journal Science Advances, radiocarbon testing dates the site to about 9,500 years ago, prompting a rethinking of group labor and ritual in such ancient hunter-gatherer communities. Many cultures have practiced some form of cremation. There is a Viking cremation site known as Kalvestene on the small island of Hjarnø in Denmark, for instance. And back in 2023, we reported on an unusual Roman burial site where cremated remains had not been transported to a separate final resting place but remained in place, covered in brick tiles and a layer of lime and surrounded by several dozen bent and twisted nails—possibly an attempt to prevent the deceased from rising from the grave to haunt the living.) But the practice was extremely rare among hunter-gatherer societies, since building a pyre is labor-intensive and requires a great deal of communal resources. There is very little evidence of cremation predating the mid-Holocene (between 5,000 and 7,000 years ago). According to the authors of this latest paper, the earliest known concentration of burnt human remains was found at Lake Mungo in Australia and dates back 40,000 years, but there is no evidence of a pyre, making it challenging to determine specific details.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hora5-TOP-CROP-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hora5-TOP-CROP-1152x648.jpg",
      "popularity_score": 327.8357713888889
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 15:26:35 +0000",
      "title": "Ars readers gave over $42,000 in our 2025 Charity Drive",
      "neutral_headline": "Ars readers gave over $42,000 in our 2025 Charity Drive",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/ars-readers-gave-over-42000-in-our-2025-charity-drive/",
          "published_at": "Mon, 05 Jan 2026 15:26:35 +0000",
          "title": "Ars readers gave over $42,000 in our 2025 Charity Drive",
          "standfirst": "Ars’ total charity haul since 2007 now tops $585,000.",
          "content": "Last month, we asked readers to donate to a couple of good causes in our 2025 Charity Drive sweepstakes. And boy, did you deliver. With the drive now complete and the donations all tallied, we can report that Ars Technica readers gave an incredible $42,936.83 to Child's Play and the Electronic Frontier Foundation in this year's drive. That doesn't set a new record, but it beats last year's total and raises our lifetime Ars Charity Drive donation haul since 2007 to over $585,000. Well done, Arsians! Thanks to everyone who gave whatever they could. We're still early in the process of selecting and notifying winners of our swag giveaway, so don't fret if you haven't heard if you're a winner yet. In the meantime, enjoy these quick stats from the 2025 drive. 2024 fundraising total: $42,936.83 Total given to Child's Play: $19,424.27 Total given to the EFF: $23,512.56 Number of individual donations: 474 Child's Play donations: 272 EFF donations: 202 Average donation: $90.58 Child's Play average donation: $71.41 EFF average donation: $116.40 Median donation: $50.00 Median Child's Play donation: $26.25 Median EFF donation: $66.95 Top single donation: $3,000 (to EFF) Donations of $1,000 or more: 8 Donations of $100 or more: 133 Donation of $10 or less: 72 (every little bit helps!) Total charity donations from Ars Technica drives since 2007 (approximate): $585,872.01 2025: $42,936.83 2024: $39,047.66 2023: $39,830.36 2022: $31,656.07 2021: $40,261.71 2020: $58,758.11 2019: $33,181.11 2018: $20,210.66 2017: $36,012.37 2016: $38,738.11 2015: $38,861.06 2014: $25,094.31 2013: $23,570.13 2012: $28,713.52 2011: ~$26,000 2010: ~$24,000 2009: ~$17,000 2008: ~$12,000 2007: ~$10,000 Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2017/01/charity.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2017/01/charity.jpg",
      "popularity_score": 309.0968825
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 14:00:47 +0000",
      "title": "Hands off! An on-the-road demo of Mercedes’ advanced new driver assist",
      "neutral_headline": "Hands off. An on-the-road demo of Mercedes’ advanced new driver assist",
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/cars/2026/01/mercedes-teaches-its-driver-assist-how-to-handle-surface-streets/",
          "published_at": "Mon, 05 Jan 2026 14:00:47 +0000",
          "title": "Hands off! An on-the-road demo of Mercedes’ advanced new driver assist",
          "standfirst": "It's like Tesla Autopilot, but made by a company with a culture of safety.",
          "content": "Mercedes-Benz provided flights from Washington to San Francisco and accommodation so Ars could drive the CLA, as well as receive a demonstration of Drive Assist Pro. Ars does not accept paid editorial content. There's some debate as to when adaptive cruise control first showed up, but if you ask Mercedes-Benz, it will say in 1999 with that year's S-Class. Instead of just keeping a set speed, radar-enabled adaptive cruise control allowed the car to react to deceleration by the car ahead, and thus, the first partially automated car was created. From there, automakers added a function to keep cars in their lanes, and now we have location-aware, GPS-geofenced vehicles that, as long as the driver is paying attention, will do most of the driving—on the highway at least. But the goal for developers of both autonomous and partially automated vehicles is to remove as much of the burden of driving from the human as possible, not just on controlled access highways but at lower speeds, on surface streets. Which is what Mercedes' latest Drive Assist Pro has been designed to do. And after a recent demo—albeit from the passenger seat—on the streets of downtown San Francisco, it appears to be a very credible effort. CLA gets it first The big, powerful, comfortable S-Class is normally the standard-bearer for the latest and greatest tech Mercedes has cooked up, but not always. In December, we drove the production version of its new entry-level EV, the CLA. At under $50,000, the sleek Mercedes sedan (or four-door coupé) is already available with the current version of the automaker's Drive Assist suite, with better control of braking and deceleration. A particular improvement, which I'm not sure made the final version of our first drive report, is the way you can use the brake while adaptive cruise control is active without canceling the system.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Mercedes-Benz-drive-pilot-pro-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Mercedes-Benz-drive-pilot-pro-1-1152x648.jpg",
      "popularity_score": 287.6668825
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 12:00:58 +0000",
      "title": "Our annual power ranking of US rocket companies has changes near the top and bottom",
      "neutral_headline": "Our annual power ranking of US rocket companies has changes near the top and bottom",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/theres-a-big-shake-up-near-the-top-of-our-annual-us-launch-company-rankings/",
          "published_at": "Mon, 05 Jan 2026 12:00:58 +0000",
          "title": "Our annual power ranking of US rocket companies has changes near the top and bottom",
          "standfirst": "There are some fresh faces entering the rankings this year.",
          "content": "Which US rocket companies achieved the most during 2025? Once again, Ars Technica is here to provide some answers in the form of our annual power ranking of US launch companies. We began doing this in 2022 and have since put out a top-10 list every year (see 2023 and 2024). Our intent, as always, is to spark debate, discussion, and appreciation for the challenge of operating a successful rocket company. It's a demanding business, both technically and financially. We respect the grit and hustle because we know just how hard this stuff is. Please also note that this is a subjective list, although hard metrics such as total launches, tonnage to orbit, success rate, and more were all important factors in the decision. And finally, our focus remains on what each company accomplished in 2025, not on what they might do in the future.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/NG-2-Ascent-11-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/NG-2-Ascent-11-1152x648.jpg",
      "popularity_score": 285.6699380555556
    }
  ]
}