{
  "updated_at": "2026-02-03T11:34:45.531Z",
  "clusters": [
    {
      "id": "cluster_16",
      "coverage": 2,
      "updated_at": "Tue, 03 Feb 2026 08:00:35 +0000",
      "title": "The best Bluetooth trackers for 2026",
      "neutral_headline": "Best Bluetooth Trackers For 2026",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/accessories/best-bluetooth-tracker-140028377.html",
          "published_at": "Tue, 03 Feb 2026 08:00:35 +0000",
          "title": "The best Bluetooth trackers for 2026",
          "standfirst": "Most people think of AirTags when they picture a Bluetooth tracker. And indeed, Apple’s little white discs were once the only capable option, relying on a vast finding network of nearby iPhones to pinpoint lost tags. But now Google has a finding network of its own, and third party brands like Chipolo, Hyper and Pebblebee have trackers that pair with your choice of Google or Apple’s network. That means you’ve got a lot of options for tagging and tracking your keys, backpacks, luggage and more. We tested the major brands out there to see how well they work, how loud they are and how they look to put together a guide to help you get the most out of your chosen tracker. Here are the best Bluetooth trackers you can buy.Editor's note: Apple just released a new version of its AirTag trackers. We are in the process of testing the new model and will update this guide once we're done. Best Bluetooth trackers for 2026 What to look for in a Bluetooth tracking device Bluetooth trackers are small discs or cards that rely on short-range, low-energy wireless signals to communicate with your smartphone. Attach one of these gadgets your stuff and, if it’s in range, your phone can “ring” the chip so you can find it. These tracking devices offer other features like separation alerts to tell you when you’ve left a tagged item behind, or where a lost item was last detected. Some can even tap into a larger network of smartphones to track down your device when you’re out of range. Depending on what you want the tracker to do, there are a few specs to look for when deciding which to get. Device compatibility Like most things from the folks in Cupertino, AirTags only work with products in the Apple ecosystem. Both Apple and Google have opened up access to the Find My and Find Hub networks to third-party manufacturers, including Chipolo and Pebblebee. Those two companies make device-agnostic models that will work with the larger tracking network from either brand, so iPhone and Android users can buy the same tag. Tile trackers work with either Android or Apple devices, but use Tile’s own Life 360 finding network. Samsung’s latest fob, the Galaxy SmartTag2, only works with Samsung phones and taps into a finding system that relies on other Samsung devices to locate lost tags. Finding network Crowd-sourced finding capabilities are what make headlines, with stories about recovering stolen equipment or tracking lost luggage across the globe. Using anonymous signals that ping other people’s devices, these Bluetooth tracking devices can potentially tell you where a tagged item is, even if your smartphone is out of Bluetooth range. Apple’s Find My network is the largest, with over a billion iPhones and iPads in service all running Apple’s Find My app by default. So unless an iPhone user opts out, their phone silently acts as a location detector for any nearby AirTags. Apple recently increased the AirTag’s finding power by enabling you to share the tracker's location with a third party, party, like an airline. Chipolo fobs that work on Apple’s network have the same ability. Google launched its Find My Device network in 2024 and has since renamed it Find Hub, which, like Apple's fining app, combines devices and people finding in one place. That network is now a close second for the largest in the US Now that Google’s Find Hub network is up and running, it’s a close second for the largest in the US. Like Apple, Android users are automatically part of the network, but can opt-out by selecting the Google services option in their phone’s Settings app and toggling the option in the Find Hub menu. Samsung’s SmartTag 2 and related network also defaults to an opt-in status for finding tags and other devices. Tile offers a large finding grid that includes Tile users, Amazon Sidewalk customers and people running the Life360 network. Life360 acquired Tile in 2021, and, according to the company, the Life360 network has more than 70 million monthly active users. In our tests, AirTags and third-party tags using its network, like the Chipolo Loop and Pop and the Pebblebee Clip 5, were the fastest to track down lost items. They offered nearly real-time location data in moderately to heavily trafficked spots around Albuquerque, including a bar, bookstore and coffee shops in Nob Hill, along with various outdoor hangouts on UNM’s campus. Samsung's SmartTags were able to locate our lost items most of the time, though not with the same precision finding accuracy as AirTags. When we tested Google’s Find Hub (then called Find My Device) network right after launch, it was noticeably slower than Apple’s network when using the community finding feature. Testing it again in mid 2025, the time it took to locate a lost item was considerably improved, taking less than 20 minutes on average for the community to track a fob. In our tests, Tile’s finding network wasn’t able to consistently locate its lost fobs. Amy Skorheim / Engadget Separation alerts A tracker’s day-to-day utility becomes really apparent when it prevents you from losing something in the first place. Separation alerts tell you when you’ve traveled too far from your tagged items. Useful if you want to make sure your laptop bag, jacket or umbrella always comes with you when you leave the house. Apple’s Find My app delivers these notifications, but Google’s Find Hub does not. However, if you have a Chipolo device and allow its companion app to run in the background on your Android phone, left-behind alerts are enabled. Tile trackers require a yearly subscription to enable the alerts (currently $7 to $25 monthly). Both AirTags and Tiles allow you to turn off separation alerts at certain locations, meaning you can set your home as a “safe” place where items can be left behind, but alerts will still trigger elsewhere. In our tests, AirTags and others using the Find My network alerted us between the 600- and 1,400-foot mark. Tiles sent a notification after about an average of 1,500 feet and were more consistent when using an Android phone than an iPhone. Chipolo Pop tags paired with an Android phone and using its own app sent an alert when we got around 450 feet away from our tagged item. Connectivity and volume The feature you may use most often is the key finder function, which makes the tracker ring when you hit a button in the app. With Apple's AirTags, you can say \"Hey Siri, where are my keys?\" and the assistant will ring the tag (assuming it doesn't mistakenly think you're asking for directions to the Floridian archipelago). You can also use the Find Item app in your Apple Watch to ring your fob. Asking smart home/personal assistants like Alexa or the Google Assistant to find your keys will work with Chipolo, Tile and Pebblebee trackers linked to your Android device. If you have your tag but can’t find your phone, some trackers will let you ring them to find your handset. SmartTag2 fobs reliably rang our Galaxy phone when we double-pressed it. Tile trackers have the same feature. Chipolo Pop and Loop trackers can ring your phone, but uses the Chipolo app to do so, which can run concurrently with the Find My or Find Hub connection. AirTags and third-party tags using Google’s network don’t offer this feature. The volume of the Bluetooth tracking device may determine whether you can find an item buried in your couch cushions or in a noisy room. AirTags have a reputation for being on the quiet side, and that aligned with what we saw (measuring roughly 65 decibels). Chipolo’s Pop tags and Tile’s Pro model measure between 83 and 86 decibels on average. Pebblebee’s new Clip 5 was the loudest of any tag we’ve tested, clocking in at 97 ear-splitting decibels. Design and alternative formats Design will determine what you can attach the tracker to. AirTags are small, smooth discs that can’t be secured to anything without accessories, which are numerous, but that is an additional cost to consider. Chipolo, Pebblebee and Tile offer trackers with holes that easily attach to your key ring, and all three companies also offer card-shaped versions designed to fit in your wallet. Pebblebee Clip 5 tags come with a handy carabiner-style key ring. You can even get trackers embedded into useful items like luggage locks. The SmartLock from KeySmart is a TSA-approved luggage lock, but in addition to the three digit code, it’s also a Bluetooth tracker that’s compatible with Apple Find My. It wasn’t quite as loud as other trackers in my tests, and the range wasn’t as long, but it paired easily and worked with Apple’s finding network just like an AirTag. Battery life AirTag, Tile Pro, SmartTag2, HyperShield and Chipolo Pop fobs use replaceable batteries and each should go for at least a year before needing to be swapped. Pebblebee Clip 5 and Chipolo Loop trackers are rechargeable via a standard USB-C port. The Clip 5 has a long battery life claim at 12 months. The Loop should go for six months on a charge. Trackers shaped like credit cards, aka wallet trackers, don't have replaceable batteries, but some, like the Chipolo Card and the Pebblebee Card 5 are USB-C rechargeable. Stalking, theft and data privacy AirTags have gotten a lot of attention and even prompted some lawsuits for Apple due to bad actors planting them on people in order to stalk them. While this fact may not influence your buying decision, any discussion of Bluetooth trackers should note what steps Apple, Google and Tile have taken to address the issue. Last year, all the major players in the Bluetooth tracker business teamed up to combat misuse and standardize how unauthorized tracking detection and alerts work for iOS and Android. Last year, Tile launched a feature called Anti-Theft Mode, which enables you to render one of its trackers undetectable by others. That means if someone steals your tagged item, they won’t be able to use the anti-stalking features to find and disable the tracker. That sort of negates one of the major ways potential stalking victims can stay safe, so Tile hopes ID verification and a $1 million penalty will deter misuse. As a theft deterrent, a Bluetooth tracker may or may not be the best option. Anecdotal stories abound in which people have recovered stolen goods using a tracker — but other tales are more cautionary. Neither Apple nor Google promotes its trackers or finding networks as a way to deal with theft. GPS trackers, on the other hand, are typically marketed for just that purpose. How we tested Bluetooth trackers Before deciding on which trackers to test, we researched the field, looking at user reviews on Amazon, Best Buy and other retailers, along with discussions on sites like Reddit. We also checked out what other publications had to say on the matter before narrowing down our options. Here’s the full list of every tracker we tested: Apple AirTag Chipolo Card Spot Chipolo One Spot Chipolo One Chipolo Card Chipolo Loop Chipolo Pop HyperShield KeySmart SmartLock Motorola Moto Tag Pebblebee Clip 5 Pebblebee Clip Universal Pebblebee Clip Samsung SmartTag 2 Chipolo One Point Pebblebee Clip for Android Tile Pro (2024) Tile Mate (2024) Tile Mate (2022) Tile Pro (2022) Tile Slim (2022) After acquiring the trackers, I tested each one over the course of a few weeks using both an iPhone 11 followed by an iPhone 16 and a Samsung Galaxy S22 then an S23 Ultra. I recreated likely user experiences, such as losing and leaving items behind at home and out in the city. I planted trackers at different spots near downtown Albuquerque, mostly concentrated in and around the University of New Mexico and the surrounding neighborhood of Nob Hill. Later, I conducted tests in the Queen Anne neighborhood of Seattle. Each test was performed multiple times, both while walking and driving and I used the measure distance feature on Google Maps to track footage for alerts. I paid attention to how easy the app was to use, how reliable the phone-to-tracker connection was and any other perks and drawbacks that came up during regular use. As new trackers come to market, or as we learn of worthy models to try, I'll test them and add the results to this guide. Other Bluetooth trackers we tested Motorola Moto Tag The Moto Tag haunts me. At this very moment, my Galaxy phone says the fob is “Near you right now.” But I don’t know where. I tap to play a sound and the Find Hub tries, but ultimately says it can’t. I tap the Find Nearby function that’s supposed to visually guide you to the tag. I parade my phone around the house like a divining rod, take it down into the basement, walk it all over the garage. Nothing. But the Hub app unendingly says the Moto Tag is “Near you right now” and I get flashes of every old-school horror movie where the telephone operator tells the soon-to-be victim that the call is coming from inside the house. It’s partly my fault. I tend to keep good tabs on the gadgets I test for work. But during my most recent move, the tiny green disc didn’t make it into the safety of my review unit cabinet after relocation. Perhaps in retribution for my neglect, the Moto Tag keeps itself just out of reach. Taunting me. I’ll let you know if I ever find it, but in the meantime, it’s clear this finding device doesn’t want to be found. The recommended tags in this guide will serve you better. Tile Pro and Tile Mate (2024) Tile recently came out with a new suite of trackers, replacing the Tile Mate, Tile Pro, Tile Sticker and Tile Slim with updated models. In addition to fun new colors for the Mate and Slim, Tile added an SOS feature that can send a notification to your Life360 Circle when you triple press the button on the tracker. It’s a clever addition that turns your keys into a panic button, something offered by personal safety companies as standalone devices. There are a few caveats: You and the people you want to notify in an emergency will need the Life360 app installed on your phones. If you want your Tile to also trigger a call to emergency services, you’ll need a $15-per-month Life360 subscription (that’s in addition to a Tile membership, which starts at $3/month or $30 annually). And enabling the SOS triple-press disables the ability to ring your phone with the fob. I tested the SOS feature and it did indeed send a text message to my Circle, with the message that I had triggered an SOS and a link to a website that showed my current location. I thought it odd that the link didn’t open the Life360 app (which shows the location of users' phones), but I wasn’t as much concerned with Tile’s personal safety features as I was with the tracking capabilities, which turned out to be less than ideal. For my tests, I planted Tile trackers in a densely populated area of Seattle (about 15,000 people per square mile). After setting the trackers to “lost” in the Tile app, I waited. After four hours, one of the trackers was not discovered by the finding community, so I went and retrieved it. Another fob I planted alerted me that the tracker had been found by the Tile community after three hours — but the location it gave me was off by a third of a mile. I then decided to plant a tracker in the busiest place I could think of — the dried fruit and nuts aisle of a Trader Joes on a Friday evening before a major holiday. It still took over a half an hour before another Tile user anonymously pinged my lost tracker. In my tests with Samsung’s trackers and the fobs on Google’s Find Hub network, it took around ten minutes for them to be discovered. AirTags took half that time and all were tested in a far less populated city. Tile's four hours with no ping and over a half hour before getting a hit in a crowded TJs were pretty long stretches. Tile devices work with both mobile operating systems and its latest models are indeed louder than they were before. But they aren’t as quick to connect and you need to pay for a membership to activate left-behind alerts. And when you do, those notifications don’t kick in as quickly as they do with competing trackers. Bluetooth tracker FAQs Which Bluetooth tracker has the longest range? Both the Tile Pro and the Samsung Galaxy SmartTag2 claim a maximum range of around 400 feet, which is longer than the 300-foot claim for Chipolo’s Pop tags. The Pebblebee Clip 5 claims a 500-foot range, though other trackers with a shorter claimed range often performed better in our tests. Apple doesn’t make range claims for AirTags, but 30 meters (100 feet) seems to be the general consensus for those fobs. Any Bluetooth signal, of course, is dependent on a few factors. Obstacles like walls and people can block the signal, so a clear line of sight is the only way to achieve the maximum range. Other signals, like Wi-Fi, can also interfere with Bluetooth connections. Even high humidity can have an effect and lessen the distance at which your phone will connect to your tracker. Remember, when considering the range of Bluetooth trackers, the size of the “finding network” also comes into play. This is the number of nearby phones that can be used to anonymously ping your tracker when your own phone is out of Bluetooth range. As of now, Apple AirTags have the largest network, followed by Google’s Find Hub, Samsung’s finding community and finally, Tile’s Life360 members. What is the best Bluetooth tracker for a car? Bluetooth trackers are designed to track small, personal items like keys, jackets, backpacks and the like. All trackers have safeguards to prohibit the tag from being used to stalk people, so most will alert someone if a tracker that does not belong to them is detected following them. That means a car thief may get tipped off that there’s a tracker in the car they’re trying to steal. That said, you’ll see plenty of stories about people finding their car thanks to a Bluetooth tracker. Some police departments have even handed out trackers to combat high rates of carjacking. In most instances, the tracker of choice has been AirTags thanks to their wide finding network. If you’re looking for a tracker for your car, you may want to look into GPS trackers, some of which are designed for just that purpose. How accurate are Bluetooth trackers? Accuracy for Bluetooth trackers can be looked at in two ways: Finding items nearby and finding items misplaced outside your home. For nearby items, you’ll most often use the ring function on the device to hunt it down. Apple’s AirTags also use ultra-wideband technology, which creates directional navigation on your phone to get you within a foot of the tracker. Accurately finding lost items outside your home depends on the size of the finding network. Since this relies on the serendipity of a random phone passing within Bluetooth range of your tracker, the more phones on a given network, the better. And since Bluetooth ranges and distance estimates are only precise within about a meter or so, getting pings from more than one phone will help locating items. Here again, it’s worth noting that Apple’s Find My network is the largest, followed by Google, Samsung and Tile (both Chipolo and Pebblebee have fobs that work with the Apple and Google networks). Recent Updates February 2026: Added Pebblebee Clip 5 as the best rechargeable device. Added HyperShield tag as a budget pick. Updated FAQs for accuracy. October 2025: Added Chipolo Loop as a new pick for best rechargeable Bluetooth tracker. Detailed our experience with the Moto Tag and KeySmart SmartLock. Updated details about separation alerts and Ultra Wideband tech. August 2025: Updated the name of Google's finding network to Find Hub, instead of Find My Device. Added details about Pebblebee's new Alert feature. Added a table of contents. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-bluetooth-tracker-140028377.html?src=rss",
          "content": "Most people think of AirTags when they picture a Bluetooth tracker. And indeed, Apple’s little white discs were once the only capable option, relying on a vast finding network of nearby iPhones to pinpoint lost tags. But now Google has a finding network of its own, and third party brands like Chipolo, Hyper and Pebblebee have trackers that pair with your choice of Google or Apple’s network. That means you’ve got a lot of options for tagging and tracking your keys, backpacks, luggage and more. We tested the major brands out there to see how well they work, how loud they are and how they look to put together a guide to help you get the most out of your chosen tracker. Here are the best Bluetooth trackers you can buy.Editor's note: Apple just released a new version of its AirTag trackers. We are in the process of testing the new model and will update this guide once we're done. Best Bluetooth trackers for 2026 What to look for in a Bluetooth tracking device Bluetooth trackers are small discs or cards that rely on short-range, low-energy wireless signals to communicate with your smartphone. Attach one of these gadgets your stuff and, if it’s in range, your phone can “ring” the chip so you can find it. These tracking devices offer other features like separation alerts to tell you when you’ve left a tagged item behind, or where a lost item was last detected. Some can even tap into a larger network of smartphones to track down your device when you’re out of range. Depending on what you want the tracker to do, there are a few specs to look for when deciding which to get. Device compatibility Like most things from the folks in Cupertino, AirTags only work with products in the Apple ecosystem. Both Apple and Google have opened up access to the Find My and Find Hub networks to third-party manufacturers, including Chipolo and Pebblebee. Those two companies make device-agnostic models that will work with the larger tracking network from either brand, so iPhone and Android users can buy the same tag. Tile trackers work with either Android or Apple devices, but use Tile’s own Life 360 finding network. Samsung’s latest fob, the Galaxy SmartTag2, only works with Samsung phones and taps into a finding system that relies on other Samsung devices to locate lost tags. Finding network Crowd-sourced finding capabilities are what make headlines, with stories about recovering stolen equipment or tracking lost luggage across the globe. Using anonymous signals that ping other people’s devices, these Bluetooth tracking devices can potentially tell you where a tagged item is, even if your smartphone is out of Bluetooth range. Apple’s Find My network is the largest, with over a billion iPhones and iPads in service all running Apple’s Find My app by default. So unless an iPhone user opts out, their phone silently acts as a location detector for any nearby AirTags. Apple recently increased the AirTag’s finding power by enabling you to share the tracker's location with a third party, party, like an airline. Chipolo fobs that work on Apple’s network have the same ability. Google launched its Find My Device network in 2024 and has since renamed it Find Hub, which, like Apple's fining app, combines devices and people finding in one place. That network is now a close second for the largest in the US Now that Google’s Find Hub network is up and running, it’s a close second for the largest in the US. Like Apple, Android users are automatically part of the network, but can opt-out by selecting the Google services option in their phone’s Settings app and toggling the option in the Find Hub menu. Samsung’s SmartTag 2 and related network also defaults to an opt-in status for finding tags and other devices. Tile offers a large finding grid that includes Tile users, Amazon Sidewalk customers and people running the Life360 network. Life360 acquired Tile in 2021, and, according to the company, the Life360 network has more than 70 million monthly active users. In our tests, AirTags and third-party tags using its network, like the Chipolo Loop and Pop and the Pebblebee Clip 5, were the fastest to track down lost items. They offered nearly real-time location data in moderately to heavily trafficked spots around Albuquerque, including a bar, bookstore and coffee shops in Nob Hill, along with various outdoor hangouts on UNM’s campus. Samsung's SmartTags were able to locate our lost items most of the time, though not with the same precision finding accuracy as AirTags. When we tested Google’s Find Hub (then called Find My Device) network right after launch, it was noticeably slower than Apple’s network when using the community finding feature. Testing it again in mid 2025, the time it took to locate a lost item was considerably improved, taking less than 20 minutes on average for the community to track a fob. In our tests, Tile’s finding network wasn’t able to consistently locate its lost fobs. Amy Skorheim / Engadget Separation alerts A tracker’s day-to-day utility becomes really apparent when it prevents you from losing something in the first place. Separation alerts tell you when you’ve traveled too far from your tagged items. Useful if you want to make sure your laptop bag, jacket or umbrella always comes with you when you leave the house. Apple’s Find My app delivers these notifications, but Google’s Find Hub does not. However, if you have a Chipolo device and allow its companion app to run in the background on your Android phone, left-behind alerts are enabled. Tile trackers require a yearly subscription to enable the alerts (currently $7 to $25 monthly). Both AirTags and Tiles allow you to turn off separation alerts at certain locations, meaning you can set your home as a “safe” place where items can be left behind, but alerts will still trigger elsewhere. In our tests, AirTags and others using the Find My network alerted us between the 600- and 1,400-foot mark. Tiles sent a notification after about an average of 1,500 feet and were more consistent when using an Android phone than an iPhone. Chipolo Pop tags paired with an Android phone and using its own app sent an alert when we got around 450 feet away from our tagged item. Connectivity and volume The feature you may use most often is the key finder function, which makes the tracker ring when you hit a button in the app. With Apple's AirTags, you can say \"Hey Siri, where are my keys?\" and the assistant will ring the tag (assuming it doesn't mistakenly think you're asking for directions to the Floridian archipelago). You can also use the Find Item app in your Apple Watch to ring your fob. Asking smart home/personal assistants like Alexa or the Google Assistant to find your keys will work with Chipolo, Tile and Pebblebee trackers linked to your Android device. If you have your tag but can’t find your phone, some trackers will let you ring them to find your handset. SmartTag2 fobs reliably rang our Galaxy phone when we double-pressed it. Tile trackers have the same feature. Chipolo Pop and Loop trackers can ring your phone, but uses the Chipolo app to do so, which can run concurrently with the Find My or Find Hub connection. AirTags and third-party tags using Google’s network don’t offer this feature. The volume of the Bluetooth tracking device may determine whether you can find an item buried in your couch cushions or in a noisy room. AirTags have a reputation for being on the quiet side, and that aligned with what we saw (measuring roughly 65 decibels). Chipolo’s Pop tags and Tile’s Pro model measure between 83 and 86 decibels on average. Pebblebee’s new Clip 5 was the loudest of any tag we’ve tested, clocking in at 97 ear-splitting decibels. Design and alternative formats Design will determine what you can attach the tracker to. AirTags are small, smooth discs that can’t be secured to anything without accessories, which are numerous, but that is an additional cost to consider. Chipolo, Pebblebee and Tile offer trackers with holes that easily attach to your key ring, and all three companies also offer card-shaped versions designed to fit in your wallet. Pebblebee Clip 5 tags come with a handy carabiner-style key ring. You can even get trackers embedded into useful items like luggage locks. The SmartLock from KeySmart is a TSA-approved luggage lock, but in addition to the three digit code, it’s also a Bluetooth tracker that’s compatible with Apple Find My. It wasn’t quite as loud as other trackers in my tests, and the range wasn’t as long, but it paired easily and worked with Apple’s finding network just like an AirTag. Battery life AirTag, Tile Pro, SmartTag2, HyperShield and Chipolo Pop fobs use replaceable batteries and each should go for at least a year before needing to be swapped. Pebblebee Clip 5 and Chipolo Loop trackers are rechargeable via a standard USB-C port. The Clip 5 has a long battery life claim at 12 months. The Loop should go for six months on a charge. Trackers shaped like credit cards, aka wallet trackers, don't have replaceable batteries, but some, like the Chipolo Card and the Pebblebee Card 5 are USB-C rechargeable. Stalking, theft and data privacy AirTags have gotten a lot of attention and even prompted some lawsuits for Apple due to bad actors planting them on people in order to stalk them. While this fact may not influence your buying decision, any discussion of Bluetooth trackers should note what steps Apple, Google and Tile have taken to address the issue. Last year, all the major players in the Bluetooth tracker business teamed up to combat misuse and standardize how unauthorized tracking detection and alerts work for iOS and Android. Last year, Tile launched a feature called Anti-Theft Mode, which enables you to render one of its trackers undetectable by others. That means if someone steals your tagged item, they won’t be able to use the anti-stalking features to find and disable the tracker. That sort of negates one of the major ways potential stalking victims can stay safe, so Tile hopes ID verification and a $1 million penalty will deter misuse. As a theft deterrent, a Bluetooth tracker may or may not be the best option. Anecdotal stories abound in which people have recovered stolen goods using a tracker — but other tales are more cautionary. Neither Apple nor Google promotes its trackers or finding networks as a way to deal with theft. GPS trackers, on the other hand, are typically marketed for just that purpose. How we tested Bluetooth trackers Before deciding on which trackers to test, we researched the field, looking at user reviews on Amazon, Best Buy and other retailers, along with discussions on sites like Reddit. We also checked out what other publications had to say on the matter before narrowing down our options. Here’s the full list of every tracker we tested: Apple AirTag Chipolo Card Spot Chipolo One Spot Chipolo One Chipolo Card Chipolo Loop Chipolo Pop HyperShield KeySmart SmartLock Motorola Moto Tag Pebblebee Clip 5 Pebblebee Clip Universal Pebblebee Clip Samsung SmartTag 2 Chipolo One Point Pebblebee Clip for Android Tile Pro (2024) Tile Mate (2024) Tile Mate (2022) Tile Pro (2022) Tile Slim (2022) After acquiring the trackers, I tested each one over the course of a few weeks using both an iPhone 11 followed by an iPhone 16 and a Samsung Galaxy S22 then an S23 Ultra. I recreated likely user experiences, such as losing and leaving items behind at home and out in the city. I planted trackers at different spots near downtown Albuquerque, mostly concentrated in and around the University of New Mexico and the surrounding neighborhood of Nob Hill. Later, I conducted tests in the Queen Anne neighborhood of Seattle. Each test was performed multiple times, both while walking and driving and I used the measure distance feature on Google Maps to track footage for alerts. I paid attention to how easy the app was to use, how reliable the phone-to-tracker connection was and any other perks and drawbacks that came up during regular use. As new trackers come to market, or as we learn of worthy models to try, I'll test them and add the results to this guide. Other Bluetooth trackers we tested Motorola Moto Tag The Moto Tag haunts me. At this very moment, my Galaxy phone says the fob is “Near you right now.” But I don’t know where. I tap to play a sound and the Find Hub tries, but ultimately says it can’t. I tap the Find Nearby function that’s supposed to visually guide you to the tag. I parade my phone around the house like a divining rod, take it down into the basement, walk it all over the garage. Nothing. But the Hub app unendingly says the Moto Tag is “Near you right now” and I get flashes of every old-school horror movie where the telephone operator tells the soon-to-be victim that the call is coming from inside the house. It’s partly my fault. I tend to keep good tabs on the gadgets I test for work. But during my most recent move, the tiny green disc didn’t make it into the safety of my review unit cabinet after relocation. Perhaps in retribution for my neglect, the Moto Tag keeps itself just out of reach. Taunting me. I’ll let you know if I ever find it, but in the meantime, it’s clear this finding device doesn’t want to be found. The recommended tags in this guide will serve you better. Tile Pro and Tile Mate (2024) Tile recently came out with a new suite of trackers, replacing the Tile Mate, Tile Pro, Tile Sticker and Tile Slim with updated models. In addition to fun new colors for the Mate and Slim, Tile added an SOS feature that can send a notification to your Life360 Circle when you triple press the button on the tracker. It’s a clever addition that turns your keys into a panic button, something offered by personal safety companies as standalone devices. There are a few caveats: You and the people you want to notify in an emergency will need the Life360 app installed on your phones. If you want your Tile to also trigger a call to emergency services, you’ll need a $15-per-month Life360 subscription (that’s in addition to a Tile membership, which starts at $3/month or $30 annually). And enabling the SOS triple-press disables the ability to ring your phone with the fob. I tested the SOS feature and it did indeed send a text message to my Circle, with the message that I had triggered an SOS and a link to a website that showed my current location. I thought it odd that the link didn’t open the Life360 app (which shows the location of users' phones), but I wasn’t as much concerned with Tile’s personal safety features as I was with the tracking capabilities, which turned out to be less than ideal. For my tests, I planted Tile trackers in a densely populated area of Seattle (about 15,000 people per square mile). After setting the trackers to “lost” in the Tile app, I waited. After four hours, one of the trackers was not discovered by the finding community, so I went and retrieved it. Another fob I planted alerted me that the tracker had been found by the Tile community after three hours — but the location it gave me was off by a third of a mile. I then decided to plant a tracker in the busiest place I could think of — the dried fruit and nuts aisle of a Trader Joes on a Friday evening before a major holiday. It still took over a half an hour before another Tile user anonymously pinged my lost tracker. In my tests with Samsung’s trackers and the fobs on Google’s Find Hub network, it took around ten minutes for them to be discovered. AirTags took half that time and all were tested in a far less populated city. Tile's four hours with no ping and over a half hour before getting a hit in a crowded TJs were pretty long stretches. Tile devices work with both mobile operating systems and its latest models are indeed louder than they were before. But they aren’t as quick to connect and you need to pay for a membership to activate left-behind alerts. And when you do, those notifications don’t kick in as quickly as they do with competing trackers. Bluetooth tracker FAQs Which Bluetooth tracker has the longest range? Both the Tile Pro and the Samsung Galaxy SmartTag2 claim a maximum range of around 400 feet, which is longer than the 300-foot claim for Chipolo’s Pop tags. The Pebblebee Clip 5 claims a 500-foot range, though other trackers with a shorter claimed range often performed better in our tests. Apple doesn’t make range claims for AirTags, but 30 meters (100 feet) seems to be the general consensus for those fobs. Any Bluetooth signal, of course, is dependent on a few factors. Obstacles like walls and people can block the signal, so a clear line of sight is the only way to achieve the maximum range. Other signals, like Wi-Fi, can also interfere with Bluetooth connections. Even high humidity can have an effect and lessen the distance at which your phone will connect to your tracker. Remember, when considering the range of Bluetooth trackers, the size of the “finding network” also comes into play. This is the number of nearby phones that can be used to anonymously ping your tracker when your own phone is out of Bluetooth range. As of now, Apple AirTags have the largest network, followed by Google’s Find Hub, Samsung’s finding community and finally, Tile’s Life360 members. What is the best Bluetooth tracker for a car? Bluetooth trackers are designed to track small, personal items like keys, jackets, backpacks and the like. All trackers have safeguards to prohibit the tag from being used to stalk people, so most will alert someone if a tracker that does not belong to them is detected following them. That means a car thief may get tipped off that there’s a tracker in the car they’re trying to steal. That said, you’ll see plenty of stories about people finding their car thanks to a Bluetooth tracker. Some police departments have even handed out trackers to combat high rates of carjacking. In most instances, the tracker of choice has been AirTags thanks to their wide finding network. If you’re looking for a tracker for your car, you may want to look into GPS trackers, some of which are designed for just that purpose. How accurate are Bluetooth trackers? Accuracy for Bluetooth trackers can be looked at in two ways: Finding items nearby and finding items misplaced outside your home. For nearby items, you’ll most often use the ring function on the device to hunt it down. Apple’s AirTags also use ultra-wideband technology, which creates directional navigation on your phone to get you within a foot of the tracker. Accurately finding lost items outside your home depends on the size of the finding network. Since this relies on the serendipity of a random phone passing within Bluetooth range of your tracker, the more phones on a given network, the better. And since Bluetooth ranges and distance estimates are only precise within about a meter or so, getting pings from more than one phone will help locating items. Here again, it’s worth noting that Apple’s Find My network is the largest, followed by Google, Samsung and Tile (both Chipolo and Pebblebee have fobs that work with the Apple and Google networks). Recent Updates February 2026: Added Pebblebee Clip 5 as the best rechargeable device. Added HyperShield tag as a budget pick. Updated FAQs for accuracy. October 2025: Added Chipolo Loop as a new pick for best rechargeable Bluetooth tracker. Detailed our experience with the Moto Tag and KeySmart SmartLock. Updated details about separation alerts and Ultra Wideband tech. August 2025: Updated the name of Google's finding network to Find Hub, instead of Find My Device. Added details about Pebblebee's new Alert feature. Added a table of contents. This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-bluetooth-tracker-140028377.html?src=rss",
          "feed_position": 3,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2023-02/94489620-abc7-11ed-b375-842957054bf1"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/orchestration/openai-launches-a-codex-desktop-app-for-macos-to-run-multiple-ai-coding",
          "published_at": "Mon, 02 Feb 2026 18:00:00 GMT",
          "title": "OpenAI launches a Codex desktop app for macOS to run multiple AI coding agents in parallel",
          "standfirst": "OpenAI on Monday released a new desktop application for its Codex artificial intelligence coding system, a tool the company says transforms software development from a collaborative exercise with a single AI assistant into something more akin to managing a team of autonomous workers.The Codex app for macOS functions as what OpenAI executives describe as a \"command center for agents,\" allowing developers to delegate multiple coding tasks simultaneously, automate repetitive work, and supervise AI systems that can run for up to 30 minutes independently before returning completed code.\"This is the most loved internal product we&#x27;ve ever had,\" Sam Altman, OpenAI&#x27;s chief executive, told VentureBeat in a press briefing ahead of Monday&#x27;s launch. \"It&#x27;s been totally an amazing thing for us to be using recently at OpenAI.\"The release arrives at a pivotal moment for the enterprise AI market. According to a survey of 100 Global 2000 companies published last week by venture capital firm Andreessen Horowitz, 78% of enterprise CIOs now use OpenAI models in production, though competitors Anthropic and Google are gaining ground rapidly. Anthropic posted the largest share increase of any frontier lab since May 2025, growing 25% in enterprise penetration, with 44% of enterprises now using Anthropic in production.The timing of OpenAI&#x27;s Codex app launch — with its focus on professional software engineering workflows — appears designed to defend the company&#x27;s position in what has become the most contested segment of the AI market: coding tools.Why developers are abandoning their IDEs for AI agent managementThe Codex app introduces a fundamentally different approach to AI-assisted coding. While previous tools like GitHub Copilot focused on autocompleting lines of code in real-time, the new application enables developers to \"effortlessly manage multiple agents at once, run work in parallel, and collaborate with agents over long-running tasks.\"Alexander Embiricos, the product lead for Codex, explained the evolution during the press briefing by tracing the product&#x27;s lineage back to 2021, when OpenAI first introduced a model called Codex that powered GitHub Copilot.\"Back then, people were using AI to write small chunks of code in their IDEs,\" Embiricos said. \"GPT-5 in August last year was a big jump, and then 5.2 in December was another massive jump, where people started doing longer and longer tasks, asking models to do work end to end. So what we saw is that developers, instead of working closely with the model, pair coding, they started delegating entire features.\"The shift has been so profound that Altman said he recently completed a substantial coding project without ever opening a traditional integrated development environment.\"I was astonished by this…I did this fairly big project in a few days earlier this week and over the weekend. I did not open an IDE during the process. Not a single time,\" Altman said. \"I did look at some code, but I was not doing it the old-fashioned way, and I did not think that was going to be happening by now.\"How skills and automations extend AI coding beyond simple code generationThe Codex app introduces several new capabilities designed to extend AI coding beyond writing lines of code. Chief among these are \"Skills,\" which bundle instructions, resources, and scripts so that Codex can \"reliably connect to tools, run workflows, and complete tasks according to your team&#x27;s preferences.\"The app includes a dedicated interface for creating and managing skills, and users can explicitly invoke specific skills or allow the system to automatically select them based on the task at hand. OpenAI has published a library of skills for common workflows, including tools to fetch design context from Figma, manage projects in Linear, deploy web applications to cloud hosts like Cloudflare and Vercel, generate images using GPT Image, and create professional documents in PDF, spreadsheet, and Word formats.To demonstrate the system&#x27;s capabilities, OpenAI asked Codex to build a racing game from a single prompt. Using an image generation skill and a web game development skill, Codex built the game by working independently using more than 7 million tokens with just one initial user prompt, taking on \"the roles of designer, game developer, and QA tester to validate its work by actually playing the game.\"The company has also introduced \"Automations,\" which allow developers to schedule Codex to work in the background on an automatic schedule. \"When an Automation finishes, the results land in a review queue so you can jump back in and continue working if needed.\"Thibault Sottiaux, who leads the Codex team at OpenAI, described how the company uses these automations internally: \"We&#x27;ve been using Automations to handle the repetitive but important tasks, like daily issue triage, finding and summarizing CI failures, generating daily release briefs, checking for bugs, and more.\"The app also includes built-in support for \"worktrees,\" allowing multiple agents to work on the same repository without conflicts. \"Each agent works on an isolated copy of your code, allowing you to explore different paths without needing to track how they impact your codebase.\"OpenAI battles Anthropic and Google for control of enterprise AI spendingThe launch comes as enterprise spending on AI coding tools accelerates dramatically. According to the Andreessen Horowitz survey, average enterprise AI spend on large language models has risen from approximately $4.5 million to $7 million over the last two years, with enterprises expecting growth of another 65% this year to approximately $11.6 million.Leadership in the enterprise AI market varies significantly by use case. OpenAI dominates \"early, horizontal use cases like general purpose chatbots, enterprise knowledge management and customer support,\" while Anthropic leads in \"software development and data analysis, where CIOs consistently cite rapid capability gains since the second half of 2024.\"When asked during the press briefing how Codex differentiates from Anthropic&#x27;s Claude Code, which has been described as having its \"ChatGPT moment,\" Sottiaux emphasized OpenAI&#x27;s focus on model capability for long-running tasks.\"One of the things that our models are extremely good at—they really sit at the frontier of intelligence and doing reliable work for long periods of time,\" Sottiaux said. \"This is also what we&#x27;re optimizing this new surface to be very good at, so that you can start many parallel agents and coordinate them over long periods of time and not get lost.\"Altman added that while many tools can handle \"vibe coding front ends,\" OpenAI&#x27;s 5.2 model remains \"the strongest model by far\" for sophisticated work on complex systems.\"Taking that level of model capability and putting it in an interface where you can do what Thibault was saying, we think is going to matter quite a bit,\" Altman said. \"That&#x27;s probably the, at least listening to users and sort of looking at the chatter on social that&#x27;s that&#x27;s the single biggest differentiator.\"The surprising satisfies on AI progress: how fast humans can typeThe philosophical underpinning of the Codex app reflects a view that OpenAI executives have been articulating for months: that human limitations — not AI capabilities — now constitute the primary constraint on productivity.In a December appearance on Lenny’s Podcast, Embiricos described human typing speed as \"the current underappreciated limiting factor\" to achieving artificial general intelligence. The logic: if AI can perform complex coding tasks but humans can&#x27;t write prompts or review outputs fast enough, progress stalls.The Codex app attempts to address this by enabling what the team calls an \"abundance mindset\" — running multiple tasks in parallel rather than perfecting single requests. During the briefing, Embiricos described how power users at OpenAI work with the tool.\"Last night, I was working on the app, and I was making a few changes, and all of these changes are able to run in parallel together. And I was just sort of going between them, managing them,\" Embiricos said. \"Behind the scenes, all these tasks are running on something called gate work trees, which means that the agents are running independently, and you don&#x27;t have to manage them.\"In the Sequoia Capital podcast \"Training Data,\" Embiricos elaborated on this mindset shift: \"The mindset that works really well for Codex is, like, kind of like this abundance mindset and, like, hey, let&#x27;s try anything. Let&#x27;s try anything even multiple times and see what works.\" He noted that when users run 20 or more tasks in a day or an hour, \"they&#x27;ve probably understood basically how to use the tool.\"Building trust through sandboxes: how OpenAI secures autonomous coding agentsOpenAI has built security measures into the Codex architecture from the ground up. The app uses \"native, open-source and configurable system-level sandboxing,\" and by default, \"Codex agents are limited to editing files in the folder or branch where they&#x27;re working and using cached web search, then asking for permission to run commands that require elevated permissions like network access.\"Embiricos elaborated on the security approach during the briefing, noting that OpenAI has open-sourced its sandbox technology.\"Codex has this sandbox that we&#x27;re actually incredibly proud of, and it&#x27;s open source, so you can go check it out,\" Embiricos said. The sandbox \"basically ensures that when the agent is working on your computer, it can only make writes in a specific folder that you want it to make rights into, and it doesn&#x27;t access network without information.\"The system also includes a granular permission model that allows users to configure persistent approvals for specific actions, avoiding the need to repeatedly authorize routine operations. \"If the agent wants to do something and you find yourself annoyed that you&#x27;re constantly having to approve it, instead of just saying, &#x27;All right, you can do everything,&#x27; you can just say, &#x27;Hey, remember this one thing — I&#x27;m actually okay with you doing this going forward,&#x27;\" Embiricos explained.Altman emphasized that the permission architecture signals a broader philosophy about AI safety in agentic systems.\"I think this is going to be really important. I mean, it&#x27;s been so clear to us using this, how much you want it to have control of your computer, and how much you need it,\" Altman said. \"And the way the team built Codex such that you can sensibly limit what&#x27;s happening and also pick the level of control you&#x27;re comfortable with is important.\"He also acknowledged the dual-use nature of the technology. \"We do expect to get to our internal cybersecurity high moment of our models very soon. We&#x27;ve been preparing for this. We&#x27;ve talked about our mitigation plan,\" Altman said. \"A real thing for the world to contend with is going to be defending against a lot of capable cybersecurity threats using these models very quickly.\"The same capabilities that make Codex valuable for fixing bugs and refactoring code could, in the wrong hands, be used to discover vulnerabilities or write malicious software—a tension that will only intensify as AI coding agents become more capable.From Android apps to research breakthroughs: how Codex transformed OpenAI&#x27;s own operationsPerhaps the most compelling evidence for Codex&#x27;s capabilities comes from OpenAI&#x27;s own use of the tool. Sottiaux described how the system has accelerated internal development.\"A Sora Android app is an example of that where four engineers shipped in only 18 days internally, and then within the month we give access to the world,\" Sottiaux said. \"I had never noticed such speed at this scale before.\"Beyond product development, Sottiaux described how Codex has become integral to OpenAI&#x27;s research operations.\"Codex is really involved in all parts of the research — making new data sets, investigating its own screening runs,\" he said. \"When I sit in meetings with researchers, they all send Codex off to do an investigation while we&#x27;re having a chat, and then it will come back with useful information, and we&#x27;re able to debug much faster.\"The tool has also begun contributing to its own development. \"Codex also is starting to build itself,\" Sottiaux noted. \"There&#x27;s no screen within the Codex engineering team that doesn&#x27;t have Codex running on multiple, six, eight, ten, tasks at a time.\"When asked whether this constitutes evidence of \"recursive self-improvement\" — a concept that has long concerned AI safety researchers — Sottiaux was measured in his response.\"There is a human in the loop at all times,\" he said. \"I wouldn&#x27;t necessarily call it recursive self-improvement, a glimpse into the future there.\"Altman offered a more expansive view of the research implications.\"There&#x27;s two parts of what people talk about when they talk about automating research to a degree where you can imagine that happening,\" Altman said. \"One is, can you write software, extremely complex infrastructure, software to run training jobs across hundreds of thousands of GPUs and babysit them. And the second is, can you come up with the new scientific ideas that make algorithms more efficient.\"He noted that OpenAI is \"seeing early but promising signs on both of those.\"The end of technical debt? AI agents take on the work engineers hate mostOne of the more unexpected applications of Codex has been addressing technical debt — the accumulated maintenance burden that plagues most software projects.Altman described how AI coding agents excel at the unglamorous work that human engineers typically avoid.\"The kind of work that human engineers hate to do — go refactor this, clean up this code base, rewrite this, write this test — this is where the model doesn&#x27;t care. The model will do anything, whether it&#x27;s fun or not,\" Altman said.He reported that some infrastructure teams at OpenAI that \"had sort of like, given up hope that you were ever really going to long term win the war against tech debt, are now like, we&#x27;re going to win this, because the model is going to constantly be working behind us, making sure we have great test coverage, making sure that we refactor when we&#x27;re supposed to.\"The observation speaks to a broader theme that emerged repeatedly during the briefing: AI coding agents don&#x27;t experience the motivational fluctuations that affect human programmers. As Altman noted, a team member recently observed that \"the hardest mental adjustment to make about working with these sort of like aI coding teammates, unlike a human, is the models just don&#x27;t run out of dopamine. They keep trying. They don&#x27;t run out of motivation. They don&#x27;t get, you know, they don&#x27;t lose energy when something&#x27;s not working. They just keep going and, you know, they figure out how to get it done.\"What the Codex app costs and who can use it starting todayThe Codex app launches today on macOS and is available to anyone with a ChatGPT Plus, Pro, Business, Enterprise, or Edu subscription. Usage is included in ChatGPT subscriptions, with the option to purchase additional credits if needed.In a promotional push, OpenAI is temporarily making Codex available to ChatGPT Free and Go users \"to help more people try agentic workflows.\" The company is also doubling rate limits for existing Codex users across all paid plans during this promotional period.The pricing strategy reflects OpenAI&#x27;s determination to establish Codex as the default tool for AI-assisted development before competitors can gain further traction. More than a million developers have used Codex in the past month, and usage has nearly doubled since the launch of GPT-5.2-Codex in mid-December, building on more than 20x usage growth since August 2025.Customers using Codex include large enterprises like Cisco, Ramp, Virgin Atlantic, Vanta, Duolingo, and Gap, as well as startups like Harvey, Sierra, and Wonderful. Individual developers have also embraced the tool: Peter Steinberger, creator of OpenClaw, built the project entirely with Codex and reports that since fully switching to the tool, his productivity has roughly doubled across more than 82,000 GitHub contributions.OpenAI&#x27;s ambitious roadmap: Windows support, cloud triggers, and continuous background agentsOpenAI outlined an aggressive development roadmap for Codex. The company plans to make the app available on Windows, continue pushing \"the frontier of model capabilities,\" and roll out faster inference.Within the app, OpenAI will \"keep refining multi-agent workflows based on real-world feedback\" and is \"building out Automations with support for cloud-based triggers, so Codex can run continuously in the background—not just when your computer is open.\"The company also announced a new \"plan mode\" feature that allows Codex to read through complex changes in read-only mode, then discuss with the user before executing. \"This means that it lets you build a lot of confidence before, again, sending it to do a lot of work by itself, independently, in parallel to you,\" Embiricos explained.Additionally, OpenAI is introducing customizable personalities for Codex. \"The default personality for Codex has been quite terse. A lot of people love it, but some people want something more engaging,\" Embiricos said. Users can access the new personalities using the /personality command.Altman also hinted at future integration with ChatGPT&#x27;s broader ecosystem.\"There will be all kinds of cool things we can do over time to connect people&#x27;s ChatGPT accounts and leverage sort of all the history they&#x27;ve built up there,\" Altman said.Microsoft still dominates enterprise AI, but the window for disruption is openThe Codex app launch occurs as most enterprises have moved beyond single-vendor strategies. According to the Andreessen Horowitz survey, \"81% now use three or more model families in testing or production, up from 68% less than a year ago.\"Despite the proliferation of AI coding tools, Microsoft continues to dominate enterprise adoption through its existing relationships. \"Microsoft 365 Copilot leads enterprise chat though ChatGPT has closed the gap meaningfully,\" and \"Github Copilot is still the coding leader for enterprises.\" The survey found that \"65% of enterprises noted they preferred to go with incumbent solutions when available,\" citing trust, integration, and procurement simplicity.However, the survey also suggests significant opportunity for challengers: \"Enterprises consistently say they value faster innovation, deeper AI focus, and greater flexibility paired with cutting edge capabilities that AI native startups bring.\"OpenAI appears to be positioning Codex as a bridge between these worlds. \"Codex is built on a simple premise: everything is controlled by code,\" the company stated. \"The better an agent is at reasoning about and producing code, the more capable it becomes across all forms of technical and knowledge work.\"The company&#x27;s ambition extends beyond coding. \"We&#x27;ve focused on making Codex the best coding agent, which has also laid the foundation for it to become a strong agent for a broad range of knowledge work tasks that extend beyond writing code.\"When asked whether AI coding tools could eventually move beyond early adopters to become mainstream, Altman suggested the transition may be closer than many expect.\"Can it go from vibe coding to serious software engineering? That&#x27;s what this is about,\" Altman said. \"I think we are over the bar on that. I think this will be the way that most serious coders do their job — and very rapidly from now.\"He then pivoted to an even bolder prediction: that code itself could become the universal interface for all computer-based work.\"Code is a universal language to get computers to do what you want. And it&#x27;s gotten so good that I think, very quickly, we can go not just from vibe coding silly apps but to doing all the non-coding knowledge work,\" Altman said.At the close of the briefing, Altman urged journalists to try the product themselves: \"Please try the app. There&#x27;s no way to get this across just by talking about it. It&#x27;s a crazy amount of power.\"For developers who have spent careers learning to write code, the message was clear: the future belongs to those who learn to manage the machines that write it for them.",
          "content": "OpenAI on Monday released a new desktop application for its Codex artificial intelligence coding system, a tool the company says transforms software development from a collaborative exercise with a single AI assistant into something more akin to managing a team of autonomous workers.The Codex app for macOS functions as what OpenAI executives describe as a \"command center for agents,\" allowing developers to delegate multiple coding tasks simultaneously, automate repetitive work, and supervise AI systems that can run for up to 30 minutes independently before returning completed code.\"This is the most loved internal product we&#x27;ve ever had,\" Sam Altman, OpenAI&#x27;s chief executive, told VentureBeat in a press briefing ahead of Monday&#x27;s launch. \"It&#x27;s been totally an amazing thing for us to be using recently at OpenAI.\"The release arrives at a pivotal moment for the enterprise AI market. According to a survey of 100 Global 2000 companies published last week by venture capital firm Andreessen Horowitz, 78% of enterprise CIOs now use OpenAI models in production, though competitors Anthropic and Google are gaining ground rapidly. Anthropic posted the largest share increase of any frontier lab since May 2025, growing 25% in enterprise penetration, with 44% of enterprises now using Anthropic in production.The timing of OpenAI&#x27;s Codex app launch — with its focus on professional software engineering workflows — appears designed to defend the company&#x27;s position in what has become the most contested segment of the AI market: coding tools.Why developers are abandoning their IDEs for AI agent managementThe Codex app introduces a fundamentally different approach to AI-assisted coding. While previous tools like GitHub Copilot focused on autocompleting lines of code in real-time, the new application enables developers to \"effortlessly manage multiple agents at once, run work in parallel, and collaborate with agents over long-running tasks.\"Alexander Embiricos, the product lead for Codex, explained the evolution during the press briefing by tracing the product&#x27;s lineage back to 2021, when OpenAI first introduced a model called Codex that powered GitHub Copilot.\"Back then, people were using AI to write small chunks of code in their IDEs,\" Embiricos said. \"GPT-5 in August last year was a big jump, and then 5.2 in December was another massive jump, where people started doing longer and longer tasks, asking models to do work end to end. So what we saw is that developers, instead of working closely with the model, pair coding, they started delegating entire features.\"The shift has been so profound that Altman said he recently completed a substantial coding project without ever opening a traditional integrated development environment.\"I was astonished by this…I did this fairly big project in a few days earlier this week and over the weekend. I did not open an IDE during the process. Not a single time,\" Altman said. \"I did look at some code, but I was not doing it the old-fashioned way, and I did not think that was going to be happening by now.\"How skills and automations extend AI coding beyond simple code generationThe Codex app introduces several new capabilities designed to extend AI coding beyond writing lines of code. Chief among these are \"Skills,\" which bundle instructions, resources, and scripts so that Codex can \"reliably connect to tools, run workflows, and complete tasks according to your team&#x27;s preferences.\"The app includes a dedicated interface for creating and managing skills, and users can explicitly invoke specific skills or allow the system to automatically select them based on the task at hand. OpenAI has published a library of skills for common workflows, including tools to fetch design context from Figma, manage projects in Linear, deploy web applications to cloud hosts like Cloudflare and Vercel, generate images using GPT Image, and create professional documents in PDF, spreadsheet, and Word formats.To demonstrate the system&#x27;s capabilities, OpenAI asked Codex to build a racing game from a single prompt. Using an image generation skill and a web game development skill, Codex built the game by working independently using more than 7 million tokens with just one initial user prompt, taking on \"the roles of designer, game developer, and QA tester to validate its work by actually playing the game.\"The company has also introduced \"Automations,\" which allow developers to schedule Codex to work in the background on an automatic schedule. \"When an Automation finishes, the results land in a review queue so you can jump back in and continue working if needed.\"Thibault Sottiaux, who leads the Codex team at OpenAI, described how the company uses these automations internally: \"We&#x27;ve been using Automations to handle the repetitive but important tasks, like daily issue triage, finding and summarizing CI failures, generating daily release briefs, checking for bugs, and more.\"The app also includes built-in support for \"worktrees,\" allowing multiple agents to work on the same repository without conflicts. \"Each agent works on an isolated copy of your code, allowing you to explore different paths without needing to track how they impact your codebase.\"OpenAI battles Anthropic and Google for control of enterprise AI spendingThe launch comes as enterprise spending on AI coding tools accelerates dramatically. According to the Andreessen Horowitz survey, average enterprise AI spend on large language models has risen from approximately $4.5 million to $7 million over the last two years, with enterprises expecting growth of another 65% this year to approximately $11.6 million.Leadership in the enterprise AI market varies significantly by use case. OpenAI dominates \"early, horizontal use cases like general purpose chatbots, enterprise knowledge management and customer support,\" while Anthropic leads in \"software development and data analysis, where CIOs consistently cite rapid capability gains since the second half of 2024.\"When asked during the press briefing how Codex differentiates from Anthropic&#x27;s Claude Code, which has been described as having its \"ChatGPT moment,\" Sottiaux emphasized OpenAI&#x27;s focus on model capability for long-running tasks.\"One of the things that our models are extremely good at—they really sit at the frontier of intelligence and doing reliable work for long periods of time,\" Sottiaux said. \"This is also what we&#x27;re optimizing this new surface to be very good at, so that you can start many parallel agents and coordinate them over long periods of time and not get lost.\"Altman added that while many tools can handle \"vibe coding front ends,\" OpenAI&#x27;s 5.2 model remains \"the strongest model by far\" for sophisticated work on complex systems.\"Taking that level of model capability and putting it in an interface where you can do what Thibault was saying, we think is going to matter quite a bit,\" Altman said. \"That&#x27;s probably the, at least listening to users and sort of looking at the chatter on social that&#x27;s that&#x27;s the single biggest differentiator.\"The surprising satisfies on AI progress: how fast humans can typeThe philosophical underpinning of the Codex app reflects a view that OpenAI executives have been articulating for months: that human limitations — not AI capabilities — now constitute the primary constraint on productivity.In a December appearance on Lenny’s Podcast, Embiricos described human typing speed as \"the current underappreciated limiting factor\" to achieving artificial general intelligence. The logic: if AI can perform complex coding tasks but humans can&#x27;t write prompts or review outputs fast enough, progress stalls.The Codex app attempts to address this by enabling what the team calls an \"abundance mindset\" — running multiple tasks in parallel rather than perfecting single requests. During the briefing, Embiricos described how power users at OpenAI work with the tool.\"Last night, I was working on the app, and I was making a few changes, and all of these changes are able to run in parallel together. And I was just sort of going between them, managing them,\" Embiricos said. \"Behind the scenes, all these tasks are running on something called gate work trees, which means that the agents are running independently, and you don&#x27;t have to manage them.\"In the Sequoia Capital podcast \"Training Data,\" Embiricos elaborated on this mindset shift: \"The mindset that works really well for Codex is, like, kind of like this abundance mindset and, like, hey, let&#x27;s try anything. Let&#x27;s try anything even multiple times and see what works.\" He noted that when users run 20 or more tasks in a day or an hour, \"they&#x27;ve probably understood basically how to use the tool.\"Building trust through sandboxes: how OpenAI secures autonomous coding agentsOpenAI has built security measures into the Codex architecture from the ground up. The app uses \"native, open-source and configurable system-level sandboxing,\" and by default, \"Codex agents are limited to editing files in the folder or branch where they&#x27;re working and using cached web search, then asking for permission to run commands that require elevated permissions like network access.\"Embiricos elaborated on the security approach during the briefing, noting that OpenAI has open-sourced its sandbox technology.\"Codex has this sandbox that we&#x27;re actually incredibly proud of, and it&#x27;s open source, so you can go check it out,\" Embiricos said. The sandbox \"basically ensures that when the agent is working on your computer, it can only make writes in a specific folder that you want it to make rights into, and it doesn&#x27;t access network without information.\"The system also includes a granular permission model that allows users to configure persistent approvals for specific actions, avoiding the need to repeatedly authorize routine operations. \"If the agent wants to do something and you find yourself annoyed that you&#x27;re constantly having to approve it, instead of just saying, &#x27;All right, you can do everything,&#x27; you can just say, &#x27;Hey, remember this one thing — I&#x27;m actually okay with you doing this going forward,&#x27;\" Embiricos explained.Altman emphasized that the permission architecture signals a broader philosophy about AI safety in agentic systems.\"I think this is going to be really important. I mean, it&#x27;s been so clear to us using this, how much you want it to have control of your computer, and how much you need it,\" Altman said. \"And the way the team built Codex such that you can sensibly limit what&#x27;s happening and also pick the level of control you&#x27;re comfortable with is important.\"He also acknowledged the dual-use nature of the technology. \"We do expect to get to our internal cybersecurity high moment of our models very soon. We&#x27;ve been preparing for this. We&#x27;ve talked about our mitigation plan,\" Altman said. \"A real thing for the world to contend with is going to be defending against a lot of capable cybersecurity threats using these models very quickly.\"The same capabilities that make Codex valuable for fixing bugs and refactoring code could, in the wrong hands, be used to discover vulnerabilities or write malicious software—a tension that will only intensify as AI coding agents become more capable.From Android apps to research breakthroughs: how Codex transformed OpenAI&#x27;s own operationsPerhaps the most compelling evidence for Codex&#x27;s capabilities comes from OpenAI&#x27;s own use of the tool. Sottiaux described how the system has accelerated internal development.\"A Sora Android app is an example of that where four engineers shipped in only 18 days internally, and then within the month we give access to the world,\" Sottiaux said. \"I had never noticed such speed at this scale before.\"Beyond product development, Sottiaux described how Codex has become integral to OpenAI&#x27;s research operations.\"Codex is really involved in all parts of the research — making new data sets, investigating its own screening runs,\" he said. \"When I sit in meetings with researchers, they all send Codex off to do an investigation while we&#x27;re having a chat, and then it will come back with useful information, and we&#x27;re able to debug much faster.\"The tool has also begun contributing to its own development. \"Codex also is starting to build itself,\" Sottiaux noted. \"There&#x27;s no screen within the Codex engineering team that doesn&#x27;t have Codex running on multiple, six, eight, ten, tasks at a time.\"When asked whether this constitutes evidence of \"recursive self-improvement\" — a concept that has long concerned AI safety researchers — Sottiaux was measured in his response.\"There is a human in the loop at all times,\" he said. \"I wouldn&#x27;t necessarily call it recursive self-improvement, a glimpse into the future there.\"Altman offered a more expansive view of the research implications.\"There&#x27;s two parts of what people talk about when they talk about automating research to a degree where you can imagine that happening,\" Altman said. \"One is, can you write software, extremely complex infrastructure, software to run training jobs across hundreds of thousands of GPUs and babysit them. And the second is, can you come up with the new scientific ideas that make algorithms more efficient.\"He noted that OpenAI is \"seeing early but promising signs on both of those.\"The end of technical debt? AI agents take on the work engineers hate mostOne of the more unexpected applications of Codex has been addressing technical debt — the accumulated maintenance burden that plagues most software projects.Altman described how AI coding agents excel at the unglamorous work that human engineers typically avoid.\"The kind of work that human engineers hate to do — go refactor this, clean up this code base, rewrite this, write this test — this is where the model doesn&#x27;t care. The model will do anything, whether it&#x27;s fun or not,\" Altman said.He reported that some infrastructure teams at OpenAI that \"had sort of like, given up hope that you were ever really going to long term win the war against tech debt, are now like, we&#x27;re going to win this, because the model is going to constantly be working behind us, making sure we have great test coverage, making sure that we refactor when we&#x27;re supposed to.\"The observation speaks to a broader theme that emerged repeatedly during the briefing: AI coding agents don&#x27;t experience the motivational fluctuations that affect human programmers. As Altman noted, a team member recently observed that \"the hardest mental adjustment to make about working with these sort of like aI coding teammates, unlike a human, is the models just don&#x27;t run out of dopamine. They keep trying. They don&#x27;t run out of motivation. They don&#x27;t get, you know, they don&#x27;t lose energy when something&#x27;s not working. They just keep going and, you know, they figure out how to get it done.\"What the Codex app costs and who can use it starting todayThe Codex app launches today on macOS and is available to anyone with a ChatGPT Plus, Pro, Business, Enterprise, or Edu subscription. Usage is included in ChatGPT subscriptions, with the option to purchase additional credits if needed.In a promotional push, OpenAI is temporarily making Codex available to ChatGPT Free and Go users \"to help more people try agentic workflows.\" The company is also doubling rate limits for existing Codex users across all paid plans during this promotional period.The pricing strategy reflects OpenAI&#x27;s determination to establish Codex as the default tool for AI-assisted development before competitors can gain further traction. More than a million developers have used Codex in the past month, and usage has nearly doubled since the launch of GPT-5.2-Codex in mid-December, building on more than 20x usage growth since August 2025.Customers using Codex include large enterprises like Cisco, Ramp, Virgin Atlantic, Vanta, Duolingo, and Gap, as well as startups like Harvey, Sierra, and Wonderful. Individual developers have also embraced the tool: Peter Steinberger, creator of OpenClaw, built the project entirely with Codex and reports that since fully switching to the tool, his productivity has roughly doubled across more than 82,000 GitHub contributions.OpenAI&#x27;s ambitious roadmap: Windows support, cloud triggers, and continuous background agentsOpenAI outlined an aggressive development roadmap for Codex. The company plans to make the app available on Windows, continue pushing \"the frontier of model capabilities,\" and roll out faster inference.Within the app, OpenAI will \"keep refining multi-agent workflows based on real-world feedback\" and is \"building out Automations with support for cloud-based triggers, so Codex can run continuously in the background—not just when your computer is open.\"The company also announced a new \"plan mode\" feature that allows Codex to read through complex changes in read-only mode, then discuss with the user before executing. \"This means that it lets you build a lot of confidence before, again, sending it to do a lot of work by itself, independently, in parallel to you,\" Embiricos explained.Additionally, OpenAI is introducing customizable personalities for Codex. \"The default personality for Codex has been quite terse. A lot of people love it, but some people want something more engaging,\" Embiricos said. Users can access the new personalities using the /personality command.Altman also hinted at future integration with ChatGPT&#x27;s broader ecosystem.\"There will be all kinds of cool things we can do over time to connect people&#x27;s ChatGPT accounts and leverage sort of all the history they&#x27;ve built up there,\" Altman said.Microsoft still dominates enterprise AI, but the window for disruption is openThe Codex app launch occurs as most enterprises have moved beyond single-vendor strategies. According to the Andreessen Horowitz survey, \"81% now use three or more model families in testing or production, up from 68% less than a year ago.\"Despite the proliferation of AI coding tools, Microsoft continues to dominate enterprise adoption through its existing relationships. \"Microsoft 365 Copilot leads enterprise chat though ChatGPT has closed the gap meaningfully,\" and \"Github Copilot is still the coding leader for enterprises.\" The survey found that \"65% of enterprises noted they preferred to go with incumbent solutions when available,\" citing trust, integration, and procurement simplicity.However, the survey also suggests significant opportunity for challengers: \"Enterprises consistently say they value faster innovation, deeper AI focus, and greater flexibility paired with cutting edge capabilities that AI native startups bring.\"OpenAI appears to be positioning Codex as a bridge between these worlds. \"Codex is built on a simple premise: everything is controlled by code,\" the company stated. \"The better an agent is at reasoning about and producing code, the more capable it becomes across all forms of technical and knowledge work.\"The company&#x27;s ambition extends beyond coding. \"We&#x27;ve focused on making Codex the best coding agent, which has also laid the foundation for it to become a strong agent for a broad range of knowledge work tasks that extend beyond writing code.\"When asked whether AI coding tools could eventually move beyond early adopters to become mainstream, Altman suggested the transition may be closer than many expect.\"Can it go from vibe coding to serious software engineering? That&#x27;s what this is about,\" Altman said. \"I think we are over the bar on that. I think this will be the way that most serious coders do their job — and very rapidly from now.\"He then pivoted to an even bolder prediction: that code itself could become the universal interface for all computer-based work.\"Code is a universal language to get computers to do what you want. And it&#x27;s gotten so good that I think, very quickly, we can go not just from vibe coding silly apps but to doing all the non-coding knowledge work,\" Altman said.At the close of the briefing, Altman urged journalists to try the product themselves: \"Please try the app. There&#x27;s no way to get this across just by talking about it. It&#x27;s a crazy amount of power.\"For developers who have spent careers learning to write code, the message was clear: the future belongs to those who learn to manage the machines that write it for them.",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/5ixq6lS6l5yrO3RJxCtr5w/c11ddd394c8969826452a5a30312234b/nuneybits_Vector_art_of_an_Apple_iMac_monitor_displaying_cascad_ecce1621-251d-41d9-ac6e-72eb25b2fd35.webp?w=300&q=30"
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2023-02/94489620-abc7-11ed-b375-842957054bf1",
      "popularity_score": 2016.4304080555555,
      "ai_summary": [
        "Bluetooth trackers use low energy signals",
        "Devices offer features like separation alerts",
        "Trackers can tap into larger smartphone networks",
        "Options available for Apple and Google devices",
        "Guide helps choose the best tracker for needs"
      ]
    },
    {
      "id": "cluster_18",
      "coverage": 2,
      "updated_at": "Tue, 03 Feb 2026 07:25:18 GMT",
      "title": "Elon Musk merges SpaceX with xAI at $1.25tn valuation",
      "neutral_headline": "Elon Musk Merges SpaceX With XAI At $1.25tn Valuation",
      "items": [
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/science/2026/feb/02/elon-musk-spacex-xai-merger",
          "published_at": "Tue, 03 Feb 2026 07:25:18 GMT",
          "title": "Elon Musk merges SpaceX with xAI at $1.25tn valuation",
          "standfirst": "Aerospace business and artificial intelligence firm to unite for IPO as world’s most valuable private companyBusiness live – latest updatesElon Musk’s aerospace company SpaceX has acquired his artificial intelligence business xAI, in a $1.25tn (£910bn) merger that consolidates part of Musk’s empire as SpaceX prepares to go public later this year.The two companies announced the deal on Monday in a statement on SpaceX’s website, saying the merger would form “the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world’s foremost real-time information and free speech platform”. Continue reading...",
          "content": "Aerospace business and artificial intelligence firm to unite for IPO as world’s most valuable private companyBusiness live – latest updatesElon Musk’s aerospace company SpaceX has acquired his artificial intelligence business xAI, in a $1.25tn (£910bn) merger that consolidates part of Musk’s empire as SpaceX prepares to go public later this year.The two companies announced the deal on Monday in a statement on SpaceX’s website, saying the merger would form “the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world’s foremost real-time information and free speech platform”. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/872619/elon-musk-merges-spacex-with-xai-and-x",
          "published_at": "2026-02-02T16:53:11-05:00",
          "title": "Elon Musk merges SpaceX with xAI (and X)",
          "standfirst": "Elon Musk is merging two of the companies that he leads, SpaceX and xAI (which also owns X), into one. According to an announcement from Musk: SpaceX has acquired xAI to form the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world's foremost real-time [&#8230;]",
          "content": "Elon Musk is merging two of the companies that he leads, SpaceX and xAI (which also owns X), into one. According to an announcement from Musk: SpaceX has acquired xAI to form the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world's foremost real-time information and free speech platform. This marks not just the next chapter, but the next book in SpaceX and xAI's mission: scaling to make a sentient sun to understand the Universe and extend the light of consciousness to the stars! Current advances in AI are dependent on la … Read the full story at The Verge.",
          "feed_position": 5
        }
      ],
      "popularity_score": 2015.8423525,
      "ai_summary": [
        "SpaceX acquires xAI in massive merger",
        "Deal values the company at $1.25 trillion",
        "Merger aims to create innovation engine",
        "SpaceX prepares to go public later this year",
        "xAI to be integrated into SpaceX operations"
      ]
    },
    {
      "id": "cluster_19",
      "coverage": 2,
      "updated_at": "Tue, 03 Feb 2026 02:25:00 -0500",
      "title": "Nintendo says the Switch 1 sold 155.37M units as of December 31 since its 2017 launch, topping the DS' 154.02M units, becoming its best-selling console ever (Jess Weatherbed/The Verge)",
      "neutral_headline": "Nintendo Switch Becomes Best Selling Console",
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260203/p4#a260203p4",
          "published_at": "Tue, 03 Feb 2026 02:25:00 -0500",
          "title": "Nintendo says the Switch 1 sold 155.37M units as of December 31 since its 2017 launch, topping the DS' 154.02M units, becoming its best-selling console ever (Jess Weatherbed/The Verge)",
          "standfirst": "Jess Weatherbed / The Verge: Nintendo says the Switch 1 sold 155.37M units as of December 31 since its 2017 launch, topping the DS' 154.02M units, becoming its best-selling console ever &mdash; &#65279;The DS has been overthrown, 12 years after it was discontinued. &hellip; The original Switch is officially Nintendo's best-selling console &hellip;",
          "content": "Jess Weatherbed / The Verge: Nintendo says the Switch 1 sold 155.37M units as of December 31 since its 2017 launch, topping the DS' 154.02M units, becoming its best-selling console ever &mdash; &#65279;The DS has been overthrown, 12 years after it was discontinued. &hellip; The original Switch is officially Nintendo's best-selling console &hellip;",
          "feed_position": 5,
          "image_url": "http://www.techmeme.com/260203/i4.jpg"
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/games/872768/nintendo-earnings-switch-best-selling-console-ds",
          "published_at": "2026-02-03T02:05:22-05:00",
          "title": "The Switch is now Nintendo’s best-selling console of all time",
          "standfirst": "The original Switch is officially Nintendo's best-selling console of all time after surpassing the DS handheld in lifetime sales. In its latest earnings release, Nintendo reports that the Nintendo Switch has, as of December 31, 2025, sold 155.37 million units since its launch in 2017, compared to 154.02 million units for the 2004 Nintendo DS. [&#8230;]",
          "content": "The original Switch is officially Nintendo's best-selling console of all time after surpassing the DS handheld in lifetime sales. In its latest earnings release, Nintendo reports that the Nintendo Switch has, as of December 31, 2025, sold 155.37 million units since its launch in 2017, compared to 154.02 million units for the 2004 Nintendo DS. In November, Nintendo reported that the Switch and DS were neck and neck. We expected the holiday sales period would see the Switch surpass the DS, even with Nintendo announcing that primary development would focus on the Switch 2. Nintendo previously said that it would continue to sell the original Sw … Read the full story at The Verge.",
          "feed_position": 1
        }
      ],
      "featured_image": "http://www.techmeme.com/260203/i4.jpg",
      "popularity_score": 2015.8373525,
      "ai_summary": [
        "Nintendo Switch sells 155.37 million units",
        "Surpasses DS as best selling console ever",
        "Sales figures announced in latest earnings report",
        "Switch sales continue to grow and break records",
        "Nintendo celebrates the console's success"
      ]
    },
    {
      "id": "cluster_47",
      "coverage": 2,
      "updated_at": "Mon, 02 Feb 2026 19:05:03 -0500",
      "title": "Elon Musk's SpaceX-xAI merger further intermingles his companies, creates the world's most valuable private company, and provides a financial lifeline to xAI (New York Times)",
      "neutral_headline": "Elon Musk's SpaceX-xAI Merger Creates Valuable Company",
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260202/p44#a260202p44",
          "published_at": "Mon, 02 Feb 2026 19:05:03 -0500",
          "title": "Elon Musk's SpaceX-xAI merger further intermingles his companies, creates the world's most valuable private company, and provides a financial lifeline to xAI (New York Times)",
          "standfirst": "New York Times: Elon Musk's SpaceX-xAI merger further intermingles his companies, creates the world's most valuable private company, and provides a financial lifeline to xAI &mdash; SpaceX, the rocket and satellite maker led by Elon Musk, said on Monday it had acquired xAI, the artificial intelligence company controlled by Mr. Musk.",
          "content": "New York Times: Elon Musk's SpaceX-xAI merger further intermingles his companies, creates the world's most valuable private company, and provides a financial lifeline to xAI &mdash; SpaceX, the rocket and satellite maker led by Elon Musk, said on Monday it had acquired xAI, the artificial intelligence company controlled by Mr. Musk.",
          "feed_position": 14,
          "image_url": "http://www.techmeme.com/260202/i44.jpg"
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/spacex-acquires-xai-elon-musk/",
          "published_at": "Mon, 02 Feb 2026 23:07:19 +0000",
          "title": "Elon Musk Is Rolling xAI Into SpaceX—Creating the World’s Most Valuable Private Company",
          "standfirst": "By fusing SpaceX and xAI—which acquired X last year—Elon Musk tightens his grip over technologies that shape national security, social media, and artificial intelligence.",
          "content": "By fusing SpaceX and xAI—which acquired X last year—Elon Musk tightens his grip over technologies that shape national security, social media, and artificial intelligence.",
          "feed_position": 4,
          "image_url": "https://media.wired.com/photos/69811faf5fea9b4898ac924e/master/pass/SpaceX-Aquires-xAI-Business-2256970109.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/260202/i44.jpg",
      "popularity_score": 2008.5048525,
      "ai_summary": [
        "SpaceX and xAI merge to create valuable company",
        "Deal provides financial lifeline to xAI",
        "Merger further intermingles Musk's companies",
        "Creates the world's most valuable private company",
        "Musk tightens grip on technologies and industries"
      ]
    },
    {
      "id": "cluster_15",
      "coverage": 1,
      "updated_at": "Tue, 03 Feb 2026 08:06:50 +0000",
      "title": "Unable to tame hydrogen leaks, NASA delays launch of Artemis II until March",
      "neutral_headline": "NASA Delays Artemis II Launch Due To Hydrogen Leaks",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/unable-to-tame-hydrogen-leaks-nasa-delays-launch-of-artemis-ii-until-march/",
          "published_at": "Tue, 03 Feb 2026 08:06:50 +0000",
          "title": "Unable to tame hydrogen leaks, NASA delays launch of Artemis II until March",
          "standfirst": "NASA spent most of Monday trying to overcome hydrogen leaks on the Artemis II rocket.",
          "content": "The launch of NASA's Artemis II mission, the first flight of astronauts to the Moon in more than 53 years, will have to wait another month after a fueling test Monday uncovered hydrogen leaks in the connection between the rocket and its launch platform at Kennedy Space Center in Florida. \"Engineers pushed through several challenges during the two-day test and met many of the planned objectives,\" NASA said in a statement following the conclusion of the mock countdown, or Wet Dress Rehearsal (WDR), early Tuesday morning. \"To allow teams to review data and conduct a second Wet Dress Rehearsal, NASA now will target March as the earliest possible launch opportunity for the flight test.\" The practice countdown was designed to identify problems and provide NASA an opportunity to fix them before launch. Most importantly, the test revealed NASA still has not fully resolved recurring hydrogen leaks that delayed the launch of the unpiloted Artemis I test flight by several months in 2022. Artemis I finally launched successfully after engineers revised their hydrogen loading procedures to overcome the leak.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/AFRC2026-0017-15orig-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/AFRC2026-0017-15orig-1152x648.jpg",
      "popularity_score": 349.5345747222222,
      "ai_summary": [
        "NASA delays Artemis II launch until March",
        "Hydrogen leaks cause the delay",
        "NASA spent Monday trying to overcome leaks",
        "Artemis II rocket requires repairs and testing",
        "Launch delayed to ensure safety and success"
      ]
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 22:31:46 +0000",
      "title": "Streaming service Crunchyroll raises prices weeks after killing its free tier",
      "neutral_headline": "Crunchyroll Raises Prices After Killing Free Tier",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/streaming-service-crunchyroll-raises-prices-weeks-after-killing-its-free-tier/",
          "published_at": "Mon, 02 Feb 2026 22:31:46 +0000",
          "title": "Streaming service Crunchyroll raises prices weeks after killing its free tier",
          "standfirst": "Sony has made streaming anime pricier since buying Crunchyroll.",
          "content": "Crunchyroll is one of the most popular streaming platforms for anime viewers. Over the past six years, the service has raised prices for fans, and today, it announced that it's increasing monthly subscription prices by up to 20 percent. Sony bought Crunchyroll from AT&T in 2020. At the time, Crunchyroll had 3 million paid subscribers and an additional 197 million users with free accounts, which let people watch a limited number of titles with commercials. At the time, Crunchyroll monthly subscription tiers cost $8, $10, or $15. After its acquisition by Sony, like many large technology companies that buy a smaller, beloved product, the company made controversial changes. The Tokyo-based company folded rival Funimation into Crunchyroll; Sony shut down Funimation, which it bought in 2017, in April 2024.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2258531948-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2258531948-1024x648.jpg",
      "popularity_score": 334.95013027777776,
      "ai_summary": [
        "Crunchyroll raises prices for streaming service",
        "Free tier eliminated from the service",
        "Price increase follows Sony's acquisition",
        "Users must now pay for streaming anime",
        "Crunchyroll aims to improve service and content"
      ]
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 21:55:44 +0000",
      "title": "SpaceX acquires xAI, plans to launch a massive satellite constellation to power it",
      "neutral_headline": "SpaceX Acquires XAI And Plans Satellite Constellation",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/02/spacex-acquires-xai-plans-1-million-satellite-constellation-to-power-it/",
          "published_at": "Mon, 02 Feb 2026 21:55:44 +0000",
          "title": "SpaceX acquires xAI, plans to launch a massive satellite constellation to power it",
          "standfirst": "\"This marks not just the next chapter, but the next book in SpaceX and xAI's mission.\"",
          "content": "SpaceX has formally acquired another one of Elon Musk's companies, xAi, the space company announced on Monday afternoon. \"SpaceX has acquired xAI to form the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile device communications and the world’s foremost real-time information and free speech platform,\" the company said. \"This marks not just the next chapter, but the next book in SpaceX and xAI's mission: scaling to make a sentient sun to understand the Universe and extend the light of consciousness to the stars!\" The merging of what is arguably Musk's most successful company, SpaceX, with the more speculative xAI venture is a risk. Founded in 2023, xAI's main products are the generative AI chatbot, Grok, and the social media site X, formerly known as Twitter. The company aims to compete with OpenAI and other artificial intelligence firms. However, Grok has been controversial, including the sexualization of women and children through AI-generated images, as has Musk's management of Twitter.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/starship_march2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/starship_march2025-1152x648.jpg",
      "popularity_score": 332.3495747222222,
      "ai_summary": [
        "SpaceX acquires xAI in major deal",
        "Plans to launch massive satellite constellation",
        "Constellation to power xAI operations",
        "Deal marks new chapter for SpaceX and xAI",
        "Satellite launch to support xAI's mission"
      ]
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 22:57:56 +0000",
      "title": "Looking back at Catacomb 3D, the game that led to Wolfenstein 3D",
      "neutral_headline": "Catacomb 3D Led To Wolfenstein 3D Development",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/02/looking-back-at-catacomb-3d-the-game-that-led-to-wolfenstein-3d/",
          "published_at": "Mon, 02 Feb 2026 22:57:56 +0000",
          "title": "Looking back at Catacomb 3D, the game that led to Wolfenstein 3D",
          "standfirst": "Romero, Carmack, and colleagues discuss an oft-forgotten piece of PC gaming history",
          "content": "If you know anything about the history of id Software, you know how 1992's Wolfenstein 3D helped establish the company's leadership in the burgeoning first-person shooter genre, leading directly to subsequent hits like Doom and Quake. But only the serious id Software nerds remember Catacomb 3D, id's first-person adventure game that directly preceded and inspired work on Wolfenstein 3D. Now, nearly 35 years after Catacomb 3D's initial release, id co-founder John Romero brought the company's founding members together for an informative retrospective video on the creation of the oft-forgotten game. But the pioneering game—which included mouse support, color-coded keys, and shooting walls to find secrets—almost ended up being a gimmicky dead end for the company. id Software's founders look back at an oft-forgotten piece of gaming history Texture maps and \"undo\" animation Catacomb 3D was a follow-up to id's earlier Catacomb, which was a simplified clone of the popular arcade hit Gauntlet. As such, the 3D game still has some of that \"quarter eater\" mentality that was not very fashionable in PC gaming at the time, as John Carmack remembered.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/c3d-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/c3d-1152x648.jpg",
      "popularity_score": 330.3862413888889,
      "ai_summary": [
        "Catacomb 3D was released in 1991",
        "Wolfenstein 3D was developed by id Software",
        "Romero and Carmack worked on Catacomb 3D",
        "Catacomb 3D used 3D graphics technology",
        "Game influenced later first person shooters"
      ]
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 21:32:18 +0000",
      "title": "Russian drones use Starlink, but Ukraine has plan to block their Internet access",
      "neutral_headline": "Russian Drones Use Starlink Internet Access",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/russian-drones-use-starlink-but-ukraine-has-plan-to-block-their-internet-access/",
          "published_at": "Mon, 02 Feb 2026 21:32:18 +0000",
          "title": "Russian drones use Starlink, but Ukraine has plan to block their Internet access",
          "standfirst": "Defense chief: \"No Ukrainians have been killed by Russian drones using Starlink.\"",
          "content": "Ukraine and SpaceX say they recently collaborated to stop strikes by Russian drones using Starlink and will soon block all unregistered use of Starlink terminals in an attempt to stop Russia's military from using the satellite broadband network over Ukraine territory. Ukrainians will soon be required to register their Starlink terminals to get on a whitelist. After that, \"only verified and registered terminals will be allowed to operate in the country. All others will be disconnected,\" the Ukraine Ministry of Defense said in a press release today. Ukraine Minister of Defense Mykhailo Fedorov \"emphasized that the only technical solution to counter this threat is to introduce a 'whitelist' and authorize all terminals,\" according to the ministry. \"This is a necessary step by the Government to save Ukrainian lives and protect critical energy infrastructure,\" Fedorov said.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/getty-ukraine-starlink-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/getty-ukraine-starlink-1152x648.jpg",
      "popularity_score": 313.9590191666667,
      "ai_summary": [
        "Russian drones use Starlink for internet access",
        "Ukraine plans to block Russian drone access",
        "No Ukrainians killed by Russian drones using Starlink",
        "Defense chief comments on Russian drone usage",
        "Ukraine seeks to counter Russian drone operations"
      ]
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 20:43:31 +0000",
      "title": "Court orders restart of all US offshore wind construction",
      "neutral_headline": "US Offshore Wind Construction To Restart",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/court-orders-restart-of-all-us-offshore-wind-construction/",
          "published_at": "Mon, 02 Feb 2026 20:43:31 +0000",
          "title": "Court orders restart of all US offshore wind construction",
          "standfirst": "Trump admin's \"it's classified\" ploy put on hold in five different cases.",
          "content": "The Trump administration is no fan of renewable energy, but it reserves special ire for wind power. Trump himself has repeatedly made false statements about the cost of wind power, its use around the world, and its environmental impacts. That animosity was paired with an executive order that blocked all permitting for offshore wind and some land-based projects, an order that has since been thrown out by a court that ruled it arbitrary and capricious. Not content to block all future developments, the administration has also gone after the five offshore wind projects currently under construction. After temporarily blocking two of them for reasons that were never fully elaborated, the Department of the Interior settled on a single justification for blocking turbine installation: a classified national security risk. The response to that late-December announcement has been uniform: The companies building each of the projects sued the administration. As of Monday, every single one of them has achieved the same result: a temporary injunction that allows them to continue construction. This, despite the fact that the suits were filed in three different courts and heard by four different judges.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1623091024.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1623091024.jpg",
      "popularity_score": 288.1459636111111,
      "ai_summary": [
        "Court orders restart of offshore wind construction",
        "Trump administration's classified ploy put on hold",
        "Five different cases affected by court order",
        "Offshore wind construction to resume immediately",
        "Court ruling impacts US renewable energy plans"
      ]
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 20:30:56 +0000",
      "title": "Notepad++ users take note: It's time to check if you're hacked",
      "neutral_headline": "Notepad++ Users At Risk Of Hacking",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/02/notepad-updater-was-compromised-for-6-months-in-supply-chain-attack/",
          "published_at": "Mon, 02 Feb 2026 20:30:56 +0000",
          "title": "Notepad++ users take note: It's time to check if you're hacked",
          "standfirst": "Suspected China-state hackers used update infrastructure to deliver backdoored version.",
          "content": "Infrastructure delivering updates for Notepad++—a widely used text editor for Windows—was compromised for six months by suspected China-state hackers who used their control to deliver backdoored versions of the app to select targets, developers said Monday. “I deeply apologize to all users affected by this hijacking,” the author of a post published to the official notepad-plus-plus.org site wrote Monday. The post said that the attack began last June with an “infrastructure-level compromise that allowed malicious actors to intercept and redirect update traffic destined for notepad-plus-plus.org.” The attackers, whom multiple investigators tied to the Chinese government, then selectively redirected certain targeted users to malicious update servers where they received backdoored updates. Notepad++ didn’t regain control of its infrastructure until December. The attackers used their access to install a never-before-seen payload that has been dubbed Chrysalis. Security firm Rapid 7 descrbed it as a \"custom, feature-rich backdoor.\"Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/exploit-vulnerability-security.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/exploit-vulnerability-security.jpg",
      "popularity_score": 287.9362413888889,
      "ai_summary": [
        "Notepad++ users may be hacked through updates",
        "Suspected China-state hackers deliver backdoor",
        "Users advised to check for hacking attempts",
        "Notepad++ update infrastructure compromised",
        "Hackers used update system to deliver malware"
      ]
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 20:00:35 +0000",
      "title": "A century of hair samples proves leaded gas ban worked",
      "neutral_headline": "Leaded Gas Ban Proven Effective",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/a-century-of-hair-samples-proves-leaded-gas-ban-worked/",
          "published_at": "Mon, 02 Feb 2026 20:00:35 +0000",
          "title": "A century of hair samples proves leaded gas ban worked",
          "standfirst": "“We should not forget the lessons of history. And the lesson is those regulations have been very important.”",
          "content": "The Environmental Protection Agency (EPA) cracked down on lead-based products—including lead paint and leaded gasoline—in the 1970s because of its toxic effects on human health. Scientists at the University of Utah have analyzed human hair samples spanning nearly 100 years and found a 100-fold decrease in lead concentrations, concluding that this regulatory action was highly effective in achieving its stated objectives. They described their findings in a new paper published in the Proceedings of the National Academy of Sciences. We've known about the dangers of lead exposure for a very long time—arguably since the second century BCE—so why conduct this research now? Per the authors, it's because there are growing concerns over the Trump administration's move last year to deregulate many key elements of the EPA's mission. Lead specifically has not yet been deregulated, but there are hints that there could be a loosening of enforcement of the 2024 Lead and Cooper rule requiring water systems to replace old lead pipes. “We should not forget the lessons of history. And the lesson is those regulations have been very important,” said co-author Thure Cerling. “Sometimes they seem onerous and mean that industry can't do exactly what they'd like to do when they want to do it or as quickly as they want to do it. But it's had really, really positive effects.”Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/lead2-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/lead2-1152x648.jpg",
      "popularity_score": 282.4304080555556,
      "ai_summary": [
        "Leaded gas ban reduced lead levels significantly",
        "Hair samples show decrease in lead levels",
        "Regulations played crucial role in reduction",
        "Study analyzed hair samples over 100 years",
        "Findings support importance of environmental regulations"
      ]
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 19:52:32 +0000",
      "title": "Ongoing RAM crisis prompts Raspberry Pi's second price hike in two months",
      "neutral_headline": "Raspberry Pi Price Increase Due To RAM",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/ongoing-ram-crisis-prompts-raspberry-pis-second-price-hike-in-two-months/",
          "published_at": "Mon, 02 Feb 2026 19:52:32 +0000",
          "title": "Ongoing RAM crisis prompts Raspberry Pi's second price hike in two months",
          "standfirst": "The more RAM the Pi board has, the more its price is increasing.",
          "content": "The ongoing AI-fueled shortages of memory and storage chips has hit RAM kits and SSDs for PC builders the fastest and hardest, meaning it's likely that, for other products that use these chips, we'll be seeing price hikes for the entire rest of the year, if not for longer. The latest price hike news comes courtesy of Raspberry Pi CEO Eben Upton, who announced today that the company would be raising prices on most of its single-board computers for the second time in two months. Prices are going up for all Raspberry Pi 4 and Raspberry Pi 5 boards with 2GB of more of LPDDR4 RAM, including the Compute Module 4 and 5 and the Raspberry Pi 500 computer-inside-a-keyboard. The 2GB boards' pricing will go up by $10, 4GB boards will go up by $15, 8GB boards will go up by $30, and 16GB boards will increase by a whopping $60.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/IMG_0625-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/IMG_0625-1152x648.jpeg",
      "popularity_score": 257.2962413888889,
      "ai_summary": [
        "Raspberry Pi experiences second price hike",
        "Price increase due to ongoing RAM crisis",
        "More RAM on Pi board increases price",
        "Raspberry Pi affected by global component shortage",
        "Price hike may impact demand for Raspberry Pi"
      ]
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 19:40:40 +0000",
      "title": "Judge rules Department of Energy's climate working group was illegal",
      "neutral_headline": "Department Of Energy Climate Group Ruled Illegal",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/us-forced-to-disclose-its-climate-working-groups-communications/",
          "published_at": "Mon, 02 Feb 2026 19:40:40 +0000",
          "title": "Judge rules Department of Energy's climate working group was illegal",
          "standfirst": "Meant to undercut EPA regulations, the group tried to work in secret.",
          "content": "On Friday, a judge ruled that the Trump administration violated the law in forming its Climate Working Group, which released a report that was intended to undercut the rationale behind greenhouse gas regulations. The judge overseeing the case determined that the government tried to treat the Climate Working Group as a formal advisory body, while not having it obey many of the statutory requirements that govern such bodies. While the Department of Energy (DOE) later disbanded the Climate Working Group in the hopes of avoiding legal scrutiny, documents obtained during the proceedings have now revealed the group's electronic communications. As such, the judge ruled that the trial itself had essentially overcome the government's illegal attempts to hide those communications. Legal and scientific flaws The whole saga derives from a Supreme Court Ruling that compelled the Environmental Protection Agency (EPA) to evaluate the risks posed to the US public by greenhouse gases. During the Obama administration, this resulted in an endangerment finding that created the foundation for the EPA to regulate carbon emissions under the Clean Air Act. The science underlying the endangerment finding was so solid that it was left unchallenged during the first Trump administration.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1804069599-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1804069599-1152x648.jpg",
      "popularity_score": 255.0984636111111,
      "ai_summary": [
        "Judge rules Department of Energy group illegal",
        "Group aimed to undercut EPA regulations",
        "Climate working group tried to work in secret",
        "Ruling impacts Department of Energy operations",
        "Group's actions deemed unlawful by court"
      ]
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 18:00:20 +0000",
      "title": "OpenAI picks up pace against Claude Code with new Codex desktop app",
      "neutral_headline": "OpenAI Releases New Codex Desktop App",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/02/openai-picks-up-pace-against-claude-code-with-new-codex-desktop-app/",
          "published_at": "Mon, 02 Feb 2026 18:00:20 +0000",
          "title": "OpenAI picks up pace against Claude Code with new Codex desktop app",
          "standfirst": "The macOS app does everything the CLI, IDE, and web interfaces do.",
          "content": "Today, OpenAI launched a macOS desktop app for Codex, its large language model-based coding tool that was previously used through a command line interface (CLI) on the web or inside an integrated development environment (IDE) via extensions. By launching a desktop app, OpenAI is catching up to Anthropic's popular Claude Code, which already offered a macOS version. Whether the desktop app makes sense compared to the existing interfaces depends a little bit on who you are and how you intend to use it. The Codex macOS app aims to make it easier to manage multiple coding agents in tandem, sometimes with parallel tasks running over several hours—the company argues that neither the CLI nor the IDE extensions are ideal interfaces for that.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Codex-dark-1152x648-1770052639.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Codex-dark-1152x648-1770052639.jpg",
      "popularity_score": 150.42624138888888,
      "ai_summary": [
        "OpenAI launches new Codex desktop application",
        "App available for macOS operating system",
        "Codex app offers same functionality as CLI",
        "OpenAI competes with Claude Code",
        "New app expands OpenAI's product offerings"
      ]
    },
    {
      "id": "cluster_90",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 18:23:56 +0000",
      "title": "Intel Panther Lake Core Ultra review: Intel's best laptop CPU in a very long time",
      "neutral_headline": "Intel Panther Lake Core Ultra Review",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/intel-panther-lake-core-ultra-review-intels-best-laptop-cpu-in-a-very-long-time/",
          "published_at": "Mon, 02 Feb 2026 18:23:56 +0000",
          "title": "Intel Panther Lake Core Ultra review: Intel's best laptop CPU in a very long time",
          "standfirst": "Intel manages big boosts to CPU and GPU speed without blowing up battery life.",
          "content": "Intel's Core Ultra lineup of desktop and laptop processors has been frustrating to review. None of them has been across-the-board awful or totally without redeeming qualities. But Intel has struggled mightily this decade to produce new processors that are straightforward, easy-to-recommend improvements over their predecessors. The company's 12th- and 13th-generation Core chips offered big boosts to CPU performance over the 11th-generation CPUs, for example, but they also usually came with a significant hit to battery life, and they only minimally improved the GPU. The first-generation Core Ultra chips, codenamed Meteor Lake, improved the GPU but couldn't beat the CPU performance of older chips. Last year's Core Ultra 200V series, codenamed Lunar Lake, boasted good battery life and solid graphics performance but weaker CPU performance; better-performing Core Ultra 200H chips (codenamed Arrow Lake) improved CPU performance but came with lesser GPUs and some other missing features. The Core Ultra Series 3 processors, codenamed Panther Lake, finally put an end to the years of uneven zig-zagging advancement we've seen in the last half-decade.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/IMG_3607-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/IMG_3607-1152x648.jpeg",
      "popularity_score": 146.81957472222223,
      "ai_summary": [
        "Intel Panther Lake Core Ultra reviewed",
        "Intel's best laptop CPU in a long time",
        "CPU and GPU speed increased significantly",
        "Battery life not impacted by upgrades",
        "Review praises Intel's latest laptop CPU"
      ]
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 17:00:49 +0000",
      "title": "Why Civilization VII is the way it is, and how its devs plan to win critics back",
      "neutral_headline": "Civilization VII Developers Plan Updates",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/02/interview-civilization-viis-devs-on-the-big-update-meant-to-win-critics-back/",
          "published_at": "Mon, 02 Feb 2026 17:00:49 +0000",
          "title": "Why Civilization VII is the way it is, and how its devs plan to win critics back",
          "standfirst": "Firaxis' Ed Beach and Dennis Shirk talk major overhauls in \"Test of Time\" update.",
          "content": "It has been difficult at times for new mainline releases in the Civilization series of games to win over new players right out of the gate. For Civilization VII—which launched just shy of one year ago—the struggles seemed to go deeper, with some players saying it didn't feel like a Civilization game. Civ VII’s developer, Firaxis Games, announced today it is planning an update this spring called \"Test of Time\" that rethinks a few unpopular changes, in some cases replacing key mechanics from the original release. I spoke with Ed Beach, the Civilization franchise's creative director, as well as Dennis Shirk, its executive producer, about what's changing, the team's interpretation of the player backlash to the choices in the initial release, and Firaxis and 2K's plans for the future of the Civilization model.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/yields-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/yields-1152x648.jpg",
      "popularity_score": 140.43429694444444,
      "ai_summary": [
        "Civilization VII developers plan major updates",
        "Updates aim to address critic concerns",
        "Firaxis talks about upcoming changes",
        "Developers discuss \"Test of Time\" update",
        "Update plans include major overhauls"
      ]
    },
    {
      "id": "cluster_101",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 16:32:52 +0000",
      "title": "Here's what Cities: Skylines 2’s new developer is updating first",
      "neutral_headline": "Cities Skylines 2 Developer Updates Game",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/02/heres-what-cities-skylines-2s-new-developer-is-updating-first/",
          "published_at": "Mon, 02 Feb 2026 16:32:52 +0000",
          "title": "Here's what Cities: Skylines 2’s new developer is updating first",
          "standfirst": "Visual upgrades include new UI, realistic snow cover, better lighting.",
          "content": "Back in November, Cities: Skylines 2 publisher Paradox made the surprising announcement that longtime series developer Colossal Order would be ceasing work on the series as part of a \"mutual\" breakup. Now, we're getting our first glimpse into the kinds of patches and upgrades new developer Iceflake (Surviving the Aftermath) is prioritizing for the popular city-builder going forward. In a City Corner Developer Diary posted late last week, Iceflake focuses mainly on the visual improvements it's planning for its first major Cities: Skylines 2 patch. Chief among these is improvements to the game's user interface that Iceflake admits can \"sometimes be a bit confusing when it comes to communicating things.\" The new patch will include a \"streamlined\" onboarding process for new cities, more expressive and context-aware icons, and toolbars with clearer colors and visual style. A new in-game Encyclopedia will also let players search through information about different gameplay topics, though that feature likely won't be ready for Iceflake's first patch.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/citiessnow-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/citiessnow-1152x648.png",
      "popularity_score": 139.9684636111111,
      "ai_summary": [
        "Cities Skylines 2 developer updates game first",
        "Visual upgrades include new UI and lighting",
        "Realistic snow cover added to game",
        "Developer prioritizes visual improvements",
        "Updates aim to enhance gameplay experience"
      ]
    },
    {
      "id": "cluster_116",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 13:41:54 +0000",
      "title": "NASA gears up for one more key test before launching Artemis II to the Moon",
      "neutral_headline": "NASA Prepares For Artemis II Launch",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/nasa-gears-up-for-one-more-key-test-before-launching-artemis-ii-to-the-moon/",
          "published_at": "Mon, 02 Feb 2026 13:41:54 +0000",
          "title": "NASA gears up for one more key test before launching Artemis II to the Moon",
          "standfirst": "A good test would clear the way for launch of Artemis II as soon as next Sunday, February 8.",
          "content": "If all goes according to plan Monday, NASA's launch team at Kennedy Space Center in Florida will load more than 700,000 gallons of super-cold propellants into the rocket built to send the Artemis II mission toward the Moon. The fuel loading is part of a simulated countdown for the Space Launch System rocket, a final opportunity for engineers to rehearse for the day NASA will send four astronauts on a nearly 10-day voyage around the far side of the Moon and back to Earth. The Artemis II mission will send humans farther from Earth than ever before. The astronauts will be the first to launch on NASA's SLS rocket and the first people to travel to the vicinity of the Moon in more than 53 years. Charlie Blackwell-Thompson, NASA's launch director for the Artemis II mission, will supervise the practice countdown from a firing room inside the Launch Control Center a few miles away from the SLS rocket at Kennedy Space Center. In a recent briefing with reporters, she called the Wet Dress Rehearsal—\"wet\" refers to the loading of liquid propellants—the \"best risk reduction test\" for verifying all is ready to proceed into the real countdown.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/55050650260_2530fea74e_k-1152x648-1770023686.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/55050650260_2530fea74e_k-1152x648-1770023686.jpg",
      "popularity_score": 138,
      "ai_summary": [
        "NASA gears up for Artemis II launch",
        "Final test before launch scheduled soon",
        "Successful test would clear launch for February 8",
        "Artemis II mission aims for Moon launch",
        "NASA prepares for critical mission milestone"
      ]
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 18:58:10 +0000",
      "title": "DOJ released Epstein files with dozens of nudes and victims' names, reports say",
      "neutral_headline": "DOJ Releases Epstein Files With Errors",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/doj-released-epstein-files-with-dozens-of-nudes-and-victims-names-reports-say/",
          "published_at": "Mon, 02 Feb 2026 18:58:10 +0000",
          "title": "DOJ released Epstein files with dozens of nudes and victims' names, reports say",
          "standfirst": "DOJ reportedly failed to redact nearly 40 nude photos and 43 victims' names.",
          "content": "The Epstein files released by the Department of Justice on Friday included at least a few dozen unredacted nude photos and names of at least 43 victims, according to news reports. The DOJ missed a December 19 deadline set by the Epstein Files Transparency Act by more than a month, but still released the files without fully redacting nude photos and names of Jeffrey Epstein's victims. The New York Times reported yesterday that it found \"nearly 40 unredacted images that appeared to be part of a personal photo collection, showing both nude bodies and the faces of the people portrayed.\" While the people in the photos were young, \"it was unclear whether they were minors,\" the article said. \"Some of the images seemed to show Mr. Epstein’s private island, including a beach. Others were taken in bedrooms and other private spaces.\" The photos \"appeared to show at least seven different people,\" the article said.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/epstein-files-1152x648-1770057497.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/epstein-files-1152x648-1770057497.jpg",
      "popularity_score": 136.39013027777779,
      "ai_summary": [
        "DOJ releases Epstein files with unredacted content",
        "Files contain dozens of nude photos and names",
        "Victims' names and photos not redacted",
        "DOJ reportedly failed to follow protocols",
        "Release of files sparks concern and criticism"
      ]
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 18:08:54 +0000",
      "title": "Guinea worm on track to be 2nd eradicated human disease; only 10 cases in 2025",
      "neutral_headline": "Guinea Worm Disease Near Eradication",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/02/guinea-worm-on-track-to-be-2nd-eradicated-human-disease-only-10-cases-in-2025/",
          "published_at": "Mon, 02 Feb 2026 18:08:54 +0000",
          "title": "Guinea worm on track to be 2nd eradicated human disease; only 10 cases in 2025",
          "standfirst": "When the eradication program began in 1986, there were a 3.5 million cases.",
          "content": "A debilitating infection from the parasitic Guinea worm is inching closer to global eradication, with an all-time low of only 10 human cases reported worldwide in 2025, the Carter Center announced. If health workers can fully wipe out the worms, it will be only the second human disease to be eradicated, after smallpox. Guinea worm (Dracunculus medinensis) is a parasitic nematode transmitted in water. More specifically, it's found in waters that contain small crustacean copepods, which harbor the worm's larvae. If a person consumes water contaminated with Guinea worm, the parasites burrow through the intestinal tract and migrate through the body. About a year later, a spaghetti noodle-length worm emerges from a painful blister, usually in the feet or legs. It can take up to eight weeks for the adult worm to fully emerge. To ease the searing pain, infected people may put their blistered limbs in water, allowing the parasite to release more larvae and continue the cycle.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-594370432-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-594370432-1152x648.jpg",
      "popularity_score": 135.56901916666666,
      "ai_summary": [
        "Guinea worm disease near eradication",
        "Only 10 cases reported in 2025",
        "Eradication program started in 1986",
        "Program reduced cases from 3.5 million",
        "Disease may become second human disease eradicated"
      ]
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Mon, 02 Feb 2026 14:43:30 +0000",
      "title": "Narwhals become quieter as the Arctic Ocean grows louder",
      "neutral_headline": "Narwhals Become Quieter In Arctic Ocean",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/narwhals-become-quieter-as-the-arctic-ocean-grows-louder/",
          "published_at": "Mon, 02 Feb 2026 14:43:30 +0000",
          "title": "Narwhals become quieter as the Arctic Ocean grows louder",
          "standfirst": "Increasing shipping traffic is interfering with the whales’ ability to hunt and communicate.",
          "content": "For most of their evolutionary history, narwhals have relied more on sound than sight to survive in the Arctic’s dark icy waters. The speckled toothed whales—sometimes referred to as “unicorns of the sea” for the long, spiral tusks that protrude from the heads of males—navigate, hunt, and communicate using echolocation. By emitting a series of calls, whistles, and high frequency clicks—as many as a thousand per second—and listening for the echoes that bounce back, they are able to locate prey hundreds to thousands of feet deep and detect narrow cracks in sea ice where they can surface to breathe. But as global temperatures continue to rise, the acoustic world narwhals depend on is rapidly shifting throughout their range, from northeastern Canada and Greenland to Norway’s Svalbard archipelago and Arctic waters in Russia. It’s getting louder.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/narwhal-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/narwhal-1152x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "Narwhals become quieter in Arctic Ocean",
        "Increasing shipping traffic interferes with whales",
        "Whales' ability to hunt and communicate impacted",
        "Arctic Ocean growing louder due to human activity",
        "Noise pollution affects narwhal behavior and habitat"
      ]
    },
    {
      "id": "cluster_143",
      "coverage": 1,
      "updated_at": "Sun, 01 Feb 2026 12:15:50 +0000",
      "title": "At NIH, a power struggle over institute directorships deepens",
      "neutral_headline": "NIH Institute Directorships Face Power Struggle",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/at-nih-a-power-struggle-over-institute-directorships-deepens/",
          "published_at": "Sun, 01 Feb 2026 12:15:50 +0000",
          "title": "At NIH, a power struggle over institute directorships deepens",
          "standfirst": "The research agency has 27 institute and center directors. Will those roles become politicized?",
          "content": "When a new presidential administration comes in, it is responsible for filling around 4,000 jobs sprinkled across the federal government’s vast bureaucracy. These political appointees help carry out the president’s agenda, and, at least in theory, make government agencies responsive to elected officials. Some of these roles—the secretary of state, for example—are well-known. Others, such as the deputy assistant secretary for textiles, consumer goods, materials, critical minerals & metals industry & analysis, are more obscure. Historically, science agencies like NASA or the National Institutes of Health tend to have fewer political appointees than many other parts of the federal government. Sometimes, very senior roles—with authority over billions of dollars of spending, and the power to shape entire fields of research—are filled without any direct input from the White House or Congress. The arrangement reflects a long-running argument that scientists should oversee the work of funding and conducting research with very little interference from political leaders.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-1291108057-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-1291108057-1152x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "27 institute and center directors are at NIH",
        "Research agency faces potential politicization",
        "Director roles may become more political",
        "NIH has various research focuses and goals",
        "Agency structure and leadership are important"
      ]
    },
    {
      "id": "cluster_145",
      "coverage": 1,
      "updated_at": "Sun, 01 Feb 2026 12:00:13 +0000",
      "title": "Fungus could be the insecticide of the future",
      "neutral_headline": "Fungus Could Replace Insecticides",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/fungus-could-be-the-insecticide-of-the-future/",
          "published_at": "Sun, 01 Feb 2026 12:00:13 +0000",
          "title": "Fungus could be the insecticide of the future",
          "standfirst": "Plant chemicals made more potent by insect pests are detoxified by the fungus.",
          "content": "Exterminators keep getting calls for a reason. Wood-devouring insects, such as beetles, termites, and carpenter ants, are constantly chewing through walls or infecting trees and breaking them down. The fight against these insects usually involved noxious insecticides; but now, at least some of them can be eliminated using a certain species of fungus. Infestations of bark beetles are the bane of spruce trees. Eurasian spruce bark beetles (Ips typographus) ingest bark high in phenolic compounds, organic molecules that often act as antioxidants and antimicrobials. They protect spruce bark from pathogenic fungi—and the beetles take advantage. Their bodies boost the antimicrobial power of these compounds by turning them into substances that are even more toxic to fungi. This would seem to make the beetles invulnerable to fungi. There is a way to get past the beetles’ borrowed defenses, though. Led by biochemist Ruo Sun, a team of researchers from the Max Planck Institute for Chemical Ecology in Jena, Germany, found that some strains of the fungus Beauveria bassiana are capable of infecting and killing the pests.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1541622283-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1541622283-1024x648.jpg",
      "popularity_score": 130,
      "ai_summary": [
        "Fungus detoxifies plant chemicals made potent",
        "Insect pests trigger plant chemical production",
        "Fungus has potential as insecticide alternative",
        "Plant chemicals are made more potent by pests",
        "Fungus could reduce environmental harm"
      ]
    }
  ]
}