{
  "updated_at": "2025-11-09T03:43:19.337Z",
  "clusters": [
    {
      "id": "cluster_12",
      "coverage": 2,
      "updated_at": "Sat, 08 Nov 2025 17:46:26 +0000",
      "title": "The Google TV Streamer 4K hits a record-low price before Black Friday",
      "neutral_headline": "The Google TV Streamer 4K hits a record-low price before Black Friday",
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/the-google-tv-streamer-4k-hits-a-record-low-price-before-black-friday-173858462.html",
          "published_at": "Sat, 08 Nov 2025 17:46:26 +0000",
          "title": "The Google TV Streamer 4K hits a record-low price before Black Friday",
          "standfirst": "If you'd rather not spend the money on a brand new TV this year, you can make an old set feel new again with a streaming device. Our favorite streaming device is on sale right now ahead of Black Friday: you can grab the Google TV Streamer 4K for only $75, which is the lowest price we've seen so far. The Amazon deal applies to both color options, White and the soft gray Haze. The Google TV Streamer is our top pick for an all-in-one streaming device. It has a faster processor than Google's previous streaming devices (22 percent faster, according to the company), so you can switch between apps and different media without lagging. It also has more storage and memory, at 32GB and 4GB, respectively. Google TV streamer has an intuitive interface and keeps all of your favorite content from different streaming apps organized in one menu. It also seamlessly integrates Google Home, allowing you to control your smart home devices from a slideout panel on the TV. The 4K streamer comes in a set-top wedge design, rather than the dongle of Chromecasts past, but you'll have to pick up an HDMI cable separately if you don't already have one you can use. It comes with a small remote that you can ping by pressing a button on the streamer for when you inevitably misplace it. In her review of the device, Engadget's Amy Skorheim called the Google TV streamer \"a full-featured, competent device with an interface that’s better than most at pulling together all the disparate threads of a streaming experience.\" One of its only downsides is the relatively high cost at $100, so don't let this deal go to waste. In addition to the streaming device, Google has a bunch of other tech on sale for Black Friday. The entry-level Nest thermostat is on sale for $90 right now, and the Nest Wi-Fi Pro 6E router has dropped to $120 for a single-pack; that's 40 percent off. This article originally appeared on Engadget at https://www.engadget.com/deals/the-google-tv-streamer-4k-hits-a-record-low-price-before-black-friday-173858462.html?src=rss",
          "content": "If you'd rather not spend the money on a brand new TV this year, you can make an old set feel new again with a streaming device. Our favorite streaming device is on sale right now ahead of Black Friday: you can grab the Google TV Streamer 4K for only $75, which is the lowest price we've seen so far. The Amazon deal applies to both color options, White and the soft gray Haze. The Google TV Streamer is our top pick for an all-in-one streaming device. It has a faster processor than Google's previous streaming devices (22 percent faster, according to the company), so you can switch between apps and different media without lagging. It also has more storage and memory, at 32GB and 4GB, respectively. Google TV streamer has an intuitive interface and keeps all of your favorite content from different streaming apps organized in one menu. It also seamlessly integrates Google Home, allowing you to control your smart home devices from a slideout panel on the TV. The 4K streamer comes in a set-top wedge design, rather than the dongle of Chromecasts past, but you'll have to pick up an HDMI cable separately if you don't already have one you can use. It comes with a small remote that you can ping by pressing a button on the streamer for when you inevitably misplace it. In her review of the device, Engadget's Amy Skorheim called the Google TV streamer \"a full-featured, competent device with an interface that’s better than most at pulling together all the disparate threads of a streaming experience.\" One of its only downsides is the relatively high cost at $100, so don't let this deal go to waste. In addition to the streaming device, Google has a bunch of other tech on sale for Black Friday. The entry-level Nest thermostat is on sale for $90 right now, and the Nest Wi-Fi Pro 6E router has dropped to $120 for a single-pack; that's 40 percent off. This article originally appeared on Engadget at https://www.engadget.com/deals/the-google-tv-streamer-4k-hits-a-record-low-price-before-black-friday-173858462.html?src=rss",
          "feed_position": 1
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/black-friday-apple-deals-include-100-off-the-mac-mini-m4-150749362.html",
          "published_at": "Sat, 08 Nov 2025 16:30:37 +0000",
          "title": "Black Friday Apple deals include $100 off the Mac mini M4",
          "standfirst": "While there are lots of great Black Friday sales on cheaper devices, it's the big ticket items that really make a world of difference. Take Apple's 2024 Mac mini M4, which has dropped to $499 from $599 as part of early Black Friday deals. The 17 percent discount brings Apple's mini desktop computer with 16GB of RAM and 256GB of SSD to only $30 more than its all-time low. We gave the Mac mini M4 a 90 in our review, in part, because it packs an incredible amount of power into such a small design. It also has front facing USB-C and headphone ports, a first for the Mac mini lineup. Plus, it starts with 16GB of RAM, an upgrade from its predecessors. However, if you want more memory or storage, the other Mac Mini M4 models are also on sale. You can get 16GB of RAM and 512GB of SSD for $690, down from $799. Then there's the option for 24GB of RAM and 512GB of SSD at $890, down from $999. Plus, if you want to bundle in three years of AppleCare+, each model ends up being about $100 cheaper than normal. If you're looking to build a desktop setup from scratch, there's a small but notable discount on Apple's Magic Trackpad as well. It's down to $120, which is only seven percent off its usual price but it's the cheapest we've seen it. This article originally appeared on Engadget at https://www.engadget.com/deals/black-friday-apple-deals-include-100-off-the-mac-mini-m4-150749362.html?src=rss",
          "content": "While there are lots of great Black Friday sales on cheaper devices, it's the big ticket items that really make a world of difference. Take Apple's 2024 Mac mini M4, which has dropped to $499 from $599 as part of early Black Friday deals. The 17 percent discount brings Apple's mini desktop computer with 16GB of RAM and 256GB of SSD to only $30 more than its all-time low. We gave the Mac mini M4 a 90 in our review, in part, because it packs an incredible amount of power into such a small design. It also has front facing USB-C and headphone ports, a first for the Mac mini lineup. Plus, it starts with 16GB of RAM, an upgrade from its predecessors. However, if you want more memory or storage, the other Mac Mini M4 models are also on sale. You can get 16GB of RAM and 512GB of SSD for $690, down from $799. Then there's the option for 24GB of RAM and 512GB of SSD at $890, down from $999. Plus, if you want to bundle in three years of AppleCare+, each model ends up being about $100 cheaper than normal. If you're looking to build a desktop setup from scratch, there's a small but notable discount on Apple's Magic Trackpad as well. It's down to $120, which is only seven percent off its usual price but it's the cheapest we've seen it. This article originally appeared on Engadget at https://www.engadget.com/deals/black-friday-apple-deals-include-100-off-the-mac-mini-m4-150749362.html?src=rss",
          "feed_position": 2
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/black-friday-deals-2025-the-best-tech-sales-we-could-find-so-far-from-apple-amazon-lego-dyson-and-more-100052387.html",
          "published_at": "Sat, 08 Nov 2025 14:52:54 +0000",
          "title": "Black Friday deals 2025: The best tech sales we could find so far from Apple, Amazon, Lego, Dyson and more",
          "standfirst": "November has turned into Black Friday and vice versa. What was once a one-day shopping sprint has turned into a month-long marathon, with retailers rolling out discounts week after week. Thanks to this, it can be easy to get deal fatigue after a while — but no one wants to miss out on a good discount, regardless of if you’re buying for yourself or someone else. We’re tracking all of the best Black Friday deals you can get right now so you don’t have to go searching for them.Engadget can help if you have tech on your shopping list this year. Here, we’ve curated the best Black Friday tech deals you can get right now, and we'll continue to update this post as we get closer to the big day at the end of November. Note that you probably have the best chance of snagging record-low prices when we get to about one week before Thanksgiving, but these deals available now are worth considering. Black Friday deals to shop now Apple AirTags (four pack) for $65 (34 percent off): iPhone users who frequently misplace things should invest in a few AirTags. Slip them into your wallet, bag, jacket and other belongings to keep track of their locations in the Find My app. Just make sure that, if you're going to attach one to your keys, you also pick up an AirTag holder to go along with it. Lego Disney advent calendar 2025 43253 for $41 (9 percent off): I probably don't need to tell you 'tis the season for advent calendars. Lego has a bunch, and this one in particular is on a good deal right now. Like most Lego advent calendars, this one includes a number of bricks and minifigs that, when put together, make a coherent, themed scene. Dyson 360 Vis Nav robot vacuum for $500 (50 percent off): This is one of the best robot vacuums you can get, period. It doesn't have a self-emptying base, but its superior suction power almost makes up for that. It's one of the strongest robot vacuums I've ever tested, and it has excellent obstacle avoidance. The latter means you will rarely, if ever, have to attend to it getting caught on the edge of a carpet or getting stuck under a piece of furniture. If a cordless stick vacuum is what you're looking for, don't forget to check out all of the other Dyson Black Friday deals. EcoFlow Black Friday deals — get up to 80 percent off: Portable power stations are an investment, but they can be crucial pieces of tech during emergencies. The top pick from our friends at Yahoo Tech has been heavily discounted in this early Black Friday sale. You can pick up the EcoFlow Delta Pro 3 for $1,400 off, down to $2,299, or the power station with an extra battery bundled in for $2,699 off, down to $3,599. Apple Mac Mini M4 for $499 ($100 off): Desktop users looking for an upgrade should consider the latest Mac Mini, which runs on the M4 chip and 16GB of RAM as standard in the base configuration. This version has a smaller design that takes up less space, front-facing USB-C ports and a headphone jack, plus Thunderbolt 5 support. Apple Watch SE 3 for $200 ($50 off): The SE has been our top pick for the best Apple Watch for those on a budget, and the latest model only solidifies that further. It has the same chipset found in the latest flagship Apple Watches, fast-charging capabilities, an always-on display and most of the same activity-tracking features you'll find in more expensive model. Apple iPad mini for $399 ($100 off): Apple's smallest tablet, the iPad mini is the best option for those who prefer their tablet be roughly the size of a paperback book. The latest model runs on the A17 Pro chipset and has an upgraded 128GB of storage in the base configuration. It also supports the Apple Pencil Pro. Jisulife Life 7 handheld fan for $25 (14 percent off): This handy little fan is a must-have if you life in a warm climate or have a tropical vacation planned anytime soon. It can be used as a table or handheld fan and even be worn around the neck so you don't have to hold it at all. Its 5,000 mAh battery allows it to last hours on a single charge, and the small display in the middle of the fan's blades show its remaining battery level. Leebin 2025 electric spin scrubber for $40 (43 percent off, Prime exclusive): This weird little scrubber makes cleaning my bathroom and shower much less of a pain. Just choose the brush head you need for your job and the rotating head takes care of most of the hard work. I love the adjustable handle, which extends from 12 to 50 inches so you can get into hard-to-reach places without breaking a sweat. Monarch Money budgeting app (one year) for $50 (50 percent off with code MONARCHVIP): One of our favorite budgeting apps, Monarch Money gives you a lot of control over the organization of your funds. There's a helpful goals feature for when you're planning out big purchases or financial milestones you want to hit, and we found the month-in-review recap it provides to be more thorough than other budgeting apps we tried. There's even Zillow integration for folks looking to buy a home. Google TV Streamer 4K for $75 ($25 off): Our top pick for the best streaming device right now, the latest version of Google's streamer supports 4K video and an excellent, easy-to-use interface that will feel familiar to anyone who's seen a set with the Google TV technology built in. It provides access to all of the major streaming services including Netflix, Disney+, HBO Max, YouTube and more, plus it has a handy on-screen pop up that lets you control all compatible smart home devices right from your TV. Also available at Walmart. Cosori 9-in-1 air fryer for $90 (25 percent off): I personally have this air fryer, one of our top picks, in my house and I've used it for over a year with no issues. I love that it makes good use of vertical space so it doesn't take up too much space on my counter, and its rounded-square shape allows me to cook more food than you'd think in one go in the basket. It crisps all kinds of foods up well and generally takes a lot of the guess work (and time) out of making a good meal. Shark Steam and Scrub Steamer Mop for $110 (31 percent off): This is a slightly more affordable version of this Shark steamer I bought earlier this year and has become one of my favorite things. The one on sale has almost an identical design and arguably the most important feature: rotating dual pads on the bottom that actually lift up the dirt and stains on your floor without too much extra elbow grease needed on your part. It also has three different cleaning modes to choose from, depending on how stubborn the mess is that you're trying to clean up. Bose QuietComfort headphones for $199 (43 percent off): These noise-cancelling headphones have a comfortable (albeit a bit boring) design, an \"Aware\" mode that lets you hear more of your surroundings when you need to and up to 24 hours of battery life. Also available at Best Buy. Shark AI Ultra robot vacuum with 60-day self-emptying base for $300 (50 percent off): This is a version of one of our top picks for the best robot vacuums. We generally like Shark machines because they do a good job cleaning all types of flooring, produce accurate home maps and the companion app is pretty easy to use. This one in particularly comes with a self-emptying base that can hold up to 60 days worth of debris. Black Friday FAQs When is Black Friday 2025? Black Friday 2025 lands on November 28. Which stores have Black Friday deals? Many physical retail stores have Black Friday deals including Walmart, Target, Best Buy and others. Even more retailers have online Black Friday deals, including Amazon, GameStop, Costco and others. When do Black Friday sales start? Gone are the times when Black Friday sales were one-day-only affairs. Now, Black Friday deals are often available starting on Thanksgiving, or even earlier. Last year, we saw Black Friday deals online begin the week before Black Friday proper. When do Black Friday sales end? Black Friday and Cyber Monday have blended a lot over the past few years. Now, you can expect to see a good portion of Black Friday deals extend through the weekend and into Cyber Monday. It's not uncommon for Black Friday deals to expire at the end of Cyber Monday. Which retailers have the best Black Friday tech deals? The best Black Friday tech deals are typically available online at retailers like Amazon, Walmart, Best Buy and Target. It's also a good idea to check the store websites of the companies that make the products you want — for example, if you're looking for a Sonos speaker, check the Sonos website on Black Friday. Most of the time, you'll find the best Black Friday tech deals are matched at multiple retailers. Does Apple have Black Friday sales? No, you will usually not find Black Friday sales at Apple stores or on Apple's website. However, you can find Black Friday deals on Apple devices elsewhere; we recommend checking Amazon, Best Buy and other big retailers for discounts on iPads, Apple Watches and more on Black Friday. Does Amazon have Black Friday sales? Yes, Amazon has Black Friday sales. The online retailer's site will look similar to Prime Day on Black Friday, with discounts on all sorts of items from household essentials to fashion to tech.This article originally appeared on Engadget at https://www.engadget.com/deals/black-friday-deals-2025-the-best-tech-sales-we-could-find-so-far-from-apple-amazon-lego-dyson-and-more-100052387.html?src=rss",
          "content": "November has turned into Black Friday and vice versa. What was once a one-day shopping sprint has turned into a month-long marathon, with retailers rolling out discounts week after week. Thanks to this, it can be easy to get deal fatigue after a while — but no one wants to miss out on a good discount, regardless of if you’re buying for yourself or someone else. We’re tracking all of the best Black Friday deals you can get right now so you don’t have to go searching for them.Engadget can help if you have tech on your shopping list this year. Here, we’ve curated the best Black Friday tech deals you can get right now, and we'll continue to update this post as we get closer to the big day at the end of November. Note that you probably have the best chance of snagging record-low prices when we get to about one week before Thanksgiving, but these deals available now are worth considering. Black Friday deals to shop now Apple AirTags (four pack) for $65 (34 percent off): iPhone users who frequently misplace things should invest in a few AirTags. Slip them into your wallet, bag, jacket and other belongings to keep track of their locations in the Find My app. Just make sure that, if you're going to attach one to your keys, you also pick up an AirTag holder to go along with it. Lego Disney advent calendar 2025 43253 for $41 (9 percent off): I probably don't need to tell you 'tis the season for advent calendars. Lego has a bunch, and this one in particular is on a good deal right now. Like most Lego advent calendars, this one includes a number of bricks and minifigs that, when put together, make a coherent, themed scene. Dyson 360 Vis Nav robot vacuum for $500 (50 percent off): This is one of the best robot vacuums you can get, period. It doesn't have a self-emptying base, but its superior suction power almost makes up for that. It's one of the strongest robot vacuums I've ever tested, and it has excellent obstacle avoidance. The latter means you will rarely, if ever, have to attend to it getting caught on the edge of a carpet or getting stuck under a piece of furniture. If a cordless stick vacuum is what you're looking for, don't forget to check out all of the other Dyson Black Friday deals. EcoFlow Black Friday deals — get up to 80 percent off: Portable power stations are an investment, but they can be crucial pieces of tech during emergencies. The top pick from our friends at Yahoo Tech has been heavily discounted in this early Black Friday sale. You can pick up the EcoFlow Delta Pro 3 for $1,400 off, down to $2,299, or the power station with an extra battery bundled in for $2,699 off, down to $3,599. Apple Mac Mini M4 for $499 ($100 off): Desktop users looking for an upgrade should consider the latest Mac Mini, which runs on the M4 chip and 16GB of RAM as standard in the base configuration. This version has a smaller design that takes up less space, front-facing USB-C ports and a headphone jack, plus Thunderbolt 5 support. Apple Watch SE 3 for $200 ($50 off): The SE has been our top pick for the best Apple Watch for those on a budget, and the latest model only solidifies that further. It has the same chipset found in the latest flagship Apple Watches, fast-charging capabilities, an always-on display and most of the same activity-tracking features you'll find in more expensive model. Apple iPad mini for $399 ($100 off): Apple's smallest tablet, the iPad mini is the best option for those who prefer their tablet be roughly the size of a paperback book. The latest model runs on the A17 Pro chipset and has an upgraded 128GB of storage in the base configuration. It also supports the Apple Pencil Pro. Jisulife Life 7 handheld fan for $25 (14 percent off): This handy little fan is a must-have if you life in a warm climate or have a tropical vacation planned anytime soon. It can be used as a table or handheld fan and even be worn around the neck so you don't have to hold it at all. Its 5,000 mAh battery allows it to last hours on a single charge, and the small display in the middle of the fan's blades show its remaining battery level. Leebin 2025 electric spin scrubber for $40 (43 percent off, Prime exclusive): This weird little scrubber makes cleaning my bathroom and shower much less of a pain. Just choose the brush head you need for your job and the rotating head takes care of most of the hard work. I love the adjustable handle, which extends from 12 to 50 inches so you can get into hard-to-reach places without breaking a sweat. Monarch Money budgeting app (one year) for $50 (50 percent off with code MONARCHVIP): One of our favorite budgeting apps, Monarch Money gives you a lot of control over the organization of your funds. There's a helpful goals feature for when you're planning out big purchases or financial milestones you want to hit, and we found the month-in-review recap it provides to be more thorough than other budgeting apps we tried. There's even Zillow integration for folks looking to buy a home. Google TV Streamer 4K for $75 ($25 off): Our top pick for the best streaming device right now, the latest version of Google's streamer supports 4K video and an excellent, easy-to-use interface that will feel familiar to anyone who's seen a set with the Google TV technology built in. It provides access to all of the major streaming services including Netflix, Disney+, HBO Max, YouTube and more, plus it has a handy on-screen pop up that lets you control all compatible smart home devices right from your TV. Also available at Walmart. Cosori 9-in-1 air fryer for $90 (25 percent off): I personally have this air fryer, one of our top picks, in my house and I've used it for over a year with no issues. I love that it makes good use of vertical space so it doesn't take up too much space on my counter, and its rounded-square shape allows me to cook more food than you'd think in one go in the basket. It crisps all kinds of foods up well and generally takes a lot of the guess work (and time) out of making a good meal. Shark Steam and Scrub Steamer Mop for $110 (31 percent off): This is a slightly more affordable version of this Shark steamer I bought earlier this year and has become one of my favorite things. The one on sale has almost an identical design and arguably the most important feature: rotating dual pads on the bottom that actually lift up the dirt and stains on your floor without too much extra elbow grease needed on your part. It also has three different cleaning modes to choose from, depending on how stubborn the mess is that you're trying to clean up. Bose QuietComfort headphones for $199 (43 percent off): These noise-cancelling headphones have a comfortable (albeit a bit boring) design, an \"Aware\" mode that lets you hear more of your surroundings when you need to and up to 24 hours of battery life. Also available at Best Buy. Shark AI Ultra robot vacuum with 60-day self-emptying base for $300 (50 percent off): This is a version of one of our top picks for the best robot vacuums. We generally like Shark machines because they do a good job cleaning all types of flooring, produce accurate home maps and the companion app is pretty easy to use. This one in particularly comes with a self-emptying base that can hold up to 60 days worth of debris. Black Friday FAQs When is Black Friday 2025? Black Friday 2025 lands on November 28. Which stores have Black Friday deals? Many physical retail stores have Black Friday deals including Walmart, Target, Best Buy and others. Even more retailers have online Black Friday deals, including Amazon, GameStop, Costco and others. When do Black Friday sales start? Gone are the times when Black Friday sales were one-day-only affairs. Now, Black Friday deals are often available starting on Thanksgiving, or even earlier. Last year, we saw Black Friday deals online begin the week before Black Friday proper. When do Black Friday sales end? Black Friday and Cyber Monday have blended a lot over the past few years. Now, you can expect to see a good portion of Black Friday deals extend through the weekend and into Cyber Monday. It's not uncommon for Black Friday deals to expire at the end of Cyber Monday. Which retailers have the best Black Friday tech deals? The best Black Friday tech deals are typically available online at retailers like Amazon, Walmart, Best Buy and Target. It's also a good idea to check the store websites of the companies that make the products you want — for example, if you're looking for a Sonos speaker, check the Sonos website on Black Friday. Most of the time, you'll find the best Black Friday tech deals are matched at multiple retailers. Does Apple have Black Friday sales? No, you will usually not find Black Friday sales at Apple stores or on Apple's website. However, you can find Black Friday deals on Apple devices elsewhere; we recommend checking Amazon, Best Buy and other big retailers for discounts on iPads, Apple Watches and more on Black Friday. Does Amazon have Black Friday sales? Yes, Amazon has Black Friday sales. The online retailer's site will look similar to Prime Day on Black Friday, with discounts on all sorts of items from household essentials to fashion to tech.This article originally appeared on Engadget at https://www.engadget.com/deals/black-friday-deals-2025-the-best-tech-sales-we-could-find-so-far-from-apple-amazon-lego-dyson-and-more-100052387.html?src=rss",
          "feed_position": 4
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-50-percent-off-headspace-annual-subscriptions-in-this-black-friday-deal-163051169.html",
          "published_at": "Sat, 08 Nov 2025 14:00:38 +0000",
          "title": "Get 50 percent off Headspace annual subscriptions in this Black Friday deal",
          "standfirst": "Meditation app Headspace is bringing back one of its biggest annual deals this Black Friday. Through December 4, you’ll be able to get 50 percent off the regular annual subscription price, bringing a full year of guided meditations, sleep sounds and mindfulness tools down to $35 per year. If you’ve been looking to build a better daily routine, this discount makes it easier to start. Headspace has become one of the most recognizable names in digital mindfulness. The app blends practical meditation guidance with structured courses and calming soundscapes designed to make everyday stress easier to manage. Its programs cover everything from beginner-friendly introductions to mindfulness to focused content on topics like anxiety, productivity and sleep. Subscribers get access to hundreds of guided sessions led by the Headspace team, including short daily practices that can be completed in a few spare minutes, plus longer courses that help build consistency. The app’s Sleepcasts and soundscapes are unique, designed to create a steady nighttime routine that promotes better rest. For mornings, there are breathing exercises and motivational mini-sessions that can help set focus for the day ahead. Headspace also includes personalized progress tracking, mood check-ins and optional reminders that make it easier to stay consistent with your new mindfulness habits. For anyone new to meditation, the app’s clear structure is a major strength. You don’t have to know where to start, since it suggests sessions based on your goals or current mood. This annual deal is ideal for users who want to stick with mindfulness practice over time, or anyone interested in incorporating a new habit into their lives. Paying for the year upfront typically saves money compared with the monthly plan, and the discount brings that cost down even further. Whether you’re learning the basics of meditation or refining an existing routine, the full library provides enough variety to keep things engaging throughout the year. If you’re still comparing wellness apps, check out our guide to the best meditation apps to see how Headspace stacks up against other options. But for those ready to commit to a calmer routine, this annual offer is one of the simplest ways to start the habit at a lower cost.This article originally appeared on Engadget at https://www.engadget.com/deals/get-50-percent-off-headspace-annual-subscriptions-in-this-black-friday-deal-163051169.html?src=rss",
          "content": "Meditation app Headspace is bringing back one of its biggest annual deals this Black Friday. Through December 4, you’ll be able to get 50 percent off the regular annual subscription price, bringing a full year of guided meditations, sleep sounds and mindfulness tools down to $35 per year. If you’ve been looking to build a better daily routine, this discount makes it easier to start. Headspace has become one of the most recognizable names in digital mindfulness. The app blends practical meditation guidance with structured courses and calming soundscapes designed to make everyday stress easier to manage. Its programs cover everything from beginner-friendly introductions to mindfulness to focused content on topics like anxiety, productivity and sleep. Subscribers get access to hundreds of guided sessions led by the Headspace team, including short daily practices that can be completed in a few spare minutes, plus longer courses that help build consistency. The app’s Sleepcasts and soundscapes are unique, designed to create a steady nighttime routine that promotes better rest. For mornings, there are breathing exercises and motivational mini-sessions that can help set focus for the day ahead. Headspace also includes personalized progress tracking, mood check-ins and optional reminders that make it easier to stay consistent with your new mindfulness habits. For anyone new to meditation, the app’s clear structure is a major strength. You don’t have to know where to start, since it suggests sessions based on your goals or current mood. This annual deal is ideal for users who want to stick with mindfulness practice over time, or anyone interested in incorporating a new habit into their lives. Paying for the year upfront typically saves money compared with the monthly plan, and the discount brings that cost down even further. Whether you’re learning the basics of meditation or refining an existing routine, the full library provides enough variety to keep things engaging throughout the year. If you’re still comparing wellness apps, check out our guide to the best meditation apps to see how Headspace stacks up against other options. But for those ready to commit to a calmer routine, this annual offer is one of the simplest ways to start the habit at a lower cost.This article originally appeared on Engadget at https://www.engadget.com/deals/get-50-percent-off-headspace-annual-subscriptions-in-this-black-friday-deal-163051169.html?src=rss",
          "feed_position": 5
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/cybersecurity/12-steps-you-can-take-right-now-to-be-safer-online-130008335.html",
          "published_at": "Sat, 08 Nov 2025 13:00:08 +0000",
          "title": "12 steps you can take right now to be safer online",
          "standfirst": "There's a fundamental question you can ask of both the internet and real life: \"How do I enjoy my time here without taking unnecessary risks?\" In grass-touching meatspace, you can cut out processed foods, carry pepper spray and avoid skydiving without a partner. But the best methods for staying safe online aren't as intuitive. The internet is a massive town square where people are constantly bellowing deeply personal facts about themselves. It's no surprise that it's become a breeding ground for scams, theft and other criminal activity. Given the breadth of dangers, it may feel easier to throw up your hands and say that whatever happens will happen. I'm here to tell you, though, that cybersecurity doesn't have to be complex, difficult or time-consuming. You don't need to be a hacker to foil a hacker — you only have to take advantage of simple tips and free apps designed to make you safer online. Whether you commit to all 12 detailed here or only focus on one, you'll be much more secure for it. 1. Install security updates immediately One of the most important things you can do to ensure your digital security is to install all software updates as soon as they become available on your devices. When you see the notification, don't wait — train yourself to download the update immediately. Not all software updates are about security, but the ones that are form your best line of defense against technical hacks. When developers discover a flaw that can be exploited, they ship an update to fix it. By the time the flaw gets patched, chances are very high that hackers also know about it, so any time lost means you could be the next to get exploited. As you go down this list, you'll learn that cybersecurity threats are less technical than you think. To counter the ones that are, however, there's nothing more important you can do than install security updates. 2. Use strong passwords Weak, easily guessed passwords are one of the most frequent causes of data breaches and malware attacks. If a password is one of the ten or so most common, an attacker may be able to guess it with no other information. If it's connected to you — your birthday, say, or mother's maiden name — it may be guessable from information anyone can look up online. Even if your password is a random string of characters, it might still be guessable if it's too short. Hackers can use programs to guess all possible combinations and try each one on a target account. The longer a password is, the more exponentially difficult it is to guess. SEAN GLADWELL via Getty Images That means you need passwords that are both long and meaningless to you. You might rightly complain that these are bastards to remember, but you're in luck: password managers can do that for you. A password manager app or browser extension can create passwords when you need them, store them securely and fill them in automatically. All you have to remember is the one master password that unlocks all the others. 3. Set up two-factor authentication Even the strongest password might get revealed through no fault of your own, like if it's stored without encryption and leaked in a data breach. That's why it helps to have two-factor authentication (2FA), also known as multi-factor authentication (MFA), as a second secure layer on every account. You probably already know 2FA as the irritating extra step that makes you go get your phone — but that's not the only way to do it. Many apps, including Google and Apple, now let you log in through passkeys. These not only don't require you to enter a code or password, but use asymmetric encryption, sharing credentials between your device and the service that runs the passkeys. It's a lot quicker for you, and leaves nothing to steal. 4. Back everything up Ransomware and its cousins are a growth industry within the cybercrime economy. These attacks corrupt your files or lock you out of them until you pay a fee to get them back. The easiest way to foil a ransomware attack, or to clear any other kind of malware off a device, is to restore the entire system from the most recent backup. To make sure you actually have a backup, experts recommend the 3-2-1 rule: three different backups, on two different types of storage, with at least one physically distant from the main system. For example, you could have one backup on another device in your house, one in the cloud and one on a portable hard drive. Automatic backup services can save disk images for you at set intervals so you don't have to remember to do it yourself. 5. Learn to spot social engineering Despite all the technobabble flying around the cybersecurity world, a great many scams and hacks are accomplished through methods a 19th-century con artist would recognize. Scammers pose as experts or authority figures to gain your trust, and use frightening language to bypass your critical thinking. Ticking clocks, emotional manipulation and fake identities are all in the toolbox. Alex Cristi via Getty Images Take phishing, in which hackers trick you into giving up your information willingly. A typical phishing email might pose as a bank, credit bureau or other authoritative service. In red letters, it may demand your bank password or social security number to immediately fix an irregularity with your account. Other common approaches include warning you about speeding tickets you never incurred or sending receipts for subscriptions you never bought. Social engineering attacks are constantly evolving, but they often fall back on the same strategies. The best way to foil them is to take a deep breath every time you receive a frightening email or text message, then research it in detail: look up the email address, check the visual design to make sure the sender is who they claim to be, and ask yourself if there's any way the message could be true. I highly recommend working through this phishing quiz — it's tough, but fair, and extremely educational. 6. Always check links before clicking This is a companion to the previous tip. Social engineering scams don't always try to get you to give up information yourself. They also get you to click on links that put secret malware on your device — like keyloggers that watch you type your passwords or ransomware programs that corrupt your files. If you're ever not sure about an email attachment or a link you're being asked to click, copy the link (without opening it) and paste it into a URL checker like this one from NordVPN. These free tools can tell you if a link is associated with any known malware domains. Sam Chapman for Engadget You can also mouse over any link, then look at the bottom-left of your browser to see what URL it will take you to. If an email is from your bank, any links within it should go to your bank's website. If it's going anywhere else, especially to an unidentifiable string of characters, be suspicious. 7. Don't overshare Over the last two decades, lots of us have gotten into the habit of dumping all sorts of personal information on social media. This trend has supercharged the scam economy. It may seem harmless to broadcast the names of your kids or the dates you'll be on vacation, but every piece of data you put into the world makes it easier for a stranger to get hooks into you. For example, \"grandparent scams\" are on the rise right now. Grifters contact a target, usually a senior, pretending to be their grandchild. They'll claim to be in a crisis and need money fast. The more information they have on their target, the more convincing their tale of woe will be. Social media is a prime place to study a potential victim. Oversharing can also be a compounding problem. If you use weak passwords, your public information can be used to guess your credentials or answer your security questions. So, if you don't have a password manager yet, think twice before you engage with that quiz post on Facebook that asks for the name of your childhood pet. 8. Use a VPN I'm a big booster of virtual private networks (VPNs), but it's important to be realistic about what they can and can't do. Even the best VPNs aren't total cybersecurity solutions — you can't just set one and assume you're safe forever. A VPN can't protect you if you use easily guessed passwords, for example, or click on a malware link. It's about hiding your identity, not making you invulnerable. So what can a VPN do? In short, it replaces your IP address (a fingerprint that identifies you online) with another IP address, belonging to a server owned by the VPN. The VPN server does business with the internet on your behalf, while its conversations with your device are encrypted so it can't be traced back to you. Sam Chapman for Engadget This means no third party can connect your online actions with your real-world identity. Nobody will be harvesting data on the websites you visit to sell to advertisers, nor building a file on you that an unscrupulous government might misuse. VPNs also protect you from fake public Wi-Fi networks set up by cybercriminals — even if a hacker tricks you with a man-in-the-middle attack, they can't do much without your real IP address. Many top VPNs, including my top pick Proton VPN, include ad blockers that can also keep cookies and tracking pixels from latching onto you. So, even if a VPN can't do everything, you'll be far safer and more private with one than without one. If you don’t want to pay for a new subscription right now, I've also compiled a list of the best free VPNs that are actually safe to use. 9. Run regular virus scans The most important time to look for malware is when you're downloading a file from the internet. Not only can unwanted apps hitch rides on seemingly safe files, but links can start downloads in secret, even if you don't think they're meant to be downloading anything. A solid antivirus program can catch malware as it arrives on your system, and if it's uncertain, can lock suspicious files in quarantine until it knows whether they're safe or not. Dedicated antivirus apps are sometimes even capable of catching malware that hasn't been seen or used yet. AV software uses machine learning to identify the common patterns of malware, filtering out new viruses that behave like old ones. But what about malware that's already gotten through the perimeter? An antivirus app can also check your computer at set intervals in search of unwanted apps, including those that might be masquerading as system files. Windows computers now come pre-installed with Windows Defender, which is enough to handle most of these tasks, but I recommend at least one anti-malware program on any device. 10. Use email maskers and private search engines If you're concerned about your information being misused or mishandled, remember that the less you put out into the world, the less danger you're in. Keeping your private data off social media is one important step, but there are other ways your data gets disseminated — and other options for responding. For example, you often need an email address to sign up for an online account. If you use your real email, your contact information is now floating around online, increasing the chance of someone using it to scam you (or at least adding you to mailing lists you never signed up for). To stay safe, use an email masker. These services give you a fake email address you can use to create accounts, which automatically forwards messages to your real address. Sam Chapman for Engadget Search engines, especially Google, are also notorious for building profiles on users by watching the terms they search for. You can dodge that by switching to a private search engine like DuckDuckGo, which doesn't track anything you do — it's funded by non-targeted ad sales on its search results pages, not by selling your data to brokers. 11. Use a data removal service Speaking of data brokers: unfortunately, if you've been on the internet at any point in the last 10 years without taking intense precautions, your data is probably in the hands of at least one business that makes money by hoarding and selling it. These data brokers range from public-facing, people-search sites to private backend dealers. Data brokers are poorly regulated and lax about safety. The longer one has your personal information, the more likely it is to leak. The good news is that most brokers (though not all of them) are legally required to delete your data if you ask them to. However, there are a lot of data brokers out there, and they really want to keep your data. Each one makes opting out harder than uninstalling a Norton product — and hundreds of them may have files on you. To make the process easier, you can use a data removal service like DeleteMe or Surfshark VPN's partner service Incogni. 12. Practice physical security Let's close out the list by getting a little old school. I've already discussed how many online scams depend on classic con artistry to work. By the same token, physical infiltration and smash-and-grab tactics still pose a threat to cybersecurity. It doesn't take too much imagination to see how this could work. If you leave your laptop or phone unattended in public, for example, someone might insert a flash drive that loads malware onto the system. In one illustrative case, a thief in the Minneapolis area would loiter in bars, watch people unlock their phones, then steal those phones and unlock them himself. I'm not saying you need to be paranoid every second you're in public. Just use the same level of caution you'd use to protect your car. Lock your phone with a biometric key so only you can open it, and make sure not to leave any device lying around if it can access your online accounts. And at work, be careful not to let anyone into a secure area if they don't have the proper credentials.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/12-steps-you-can-take-right-now-to-be-safer-online-130008335.html?src=rss",
          "content": "There's a fundamental question you can ask of both the internet and real life: \"How do I enjoy my time here without taking unnecessary risks?\" In grass-touching meatspace, you can cut out processed foods, carry pepper spray and avoid skydiving without a partner. But the best methods for staying safe online aren't as intuitive. The internet is a massive town square where people are constantly bellowing deeply personal facts about themselves. It's no surprise that it's become a breeding ground for scams, theft and other criminal activity. Given the breadth of dangers, it may feel easier to throw up your hands and say that whatever happens will happen. I'm here to tell you, though, that cybersecurity doesn't have to be complex, difficult or time-consuming. You don't need to be a hacker to foil a hacker — you only have to take advantage of simple tips and free apps designed to make you safer online. Whether you commit to all 12 detailed here or only focus on one, you'll be much more secure for it. 1. Install security updates immediately One of the most important things you can do to ensure your digital security is to install all software updates as soon as they become available on your devices. When you see the notification, don't wait — train yourself to download the update immediately. Not all software updates are about security, but the ones that are form your best line of defense against technical hacks. When developers discover a flaw that can be exploited, they ship an update to fix it. By the time the flaw gets patched, chances are very high that hackers also know about it, so any time lost means you could be the next to get exploited. As you go down this list, you'll learn that cybersecurity threats are less technical than you think. To counter the ones that are, however, there's nothing more important you can do than install security updates. 2. Use strong passwords Weak, easily guessed passwords are one of the most frequent causes of data breaches and malware attacks. If a password is one of the ten or so most common, an attacker may be able to guess it with no other information. If it's connected to you — your birthday, say, or mother's maiden name — it may be guessable from information anyone can look up online. Even if your password is a random string of characters, it might still be guessable if it's too short. Hackers can use programs to guess all possible combinations and try each one on a target account. The longer a password is, the more exponentially difficult it is to guess. SEAN GLADWELL via Getty Images That means you need passwords that are both long and meaningless to you. You might rightly complain that these are bastards to remember, but you're in luck: password managers can do that for you. A password manager app or browser extension can create passwords when you need them, store them securely and fill them in automatically. All you have to remember is the one master password that unlocks all the others. 3. Set up two-factor authentication Even the strongest password might get revealed through no fault of your own, like if it's stored without encryption and leaked in a data breach. That's why it helps to have two-factor authentication (2FA), also known as multi-factor authentication (MFA), as a second secure layer on every account. You probably already know 2FA as the irritating extra step that makes you go get your phone — but that's not the only way to do it. Many apps, including Google and Apple, now let you log in through passkeys. These not only don't require you to enter a code or password, but use asymmetric encryption, sharing credentials between your device and the service that runs the passkeys. It's a lot quicker for you, and leaves nothing to steal. 4. Back everything up Ransomware and its cousins are a growth industry within the cybercrime economy. These attacks corrupt your files or lock you out of them until you pay a fee to get them back. The easiest way to foil a ransomware attack, or to clear any other kind of malware off a device, is to restore the entire system from the most recent backup. To make sure you actually have a backup, experts recommend the 3-2-1 rule: three different backups, on two different types of storage, with at least one physically distant from the main system. For example, you could have one backup on another device in your house, one in the cloud and one on a portable hard drive. Automatic backup services can save disk images for you at set intervals so you don't have to remember to do it yourself. 5. Learn to spot social engineering Despite all the technobabble flying around the cybersecurity world, a great many scams and hacks are accomplished through methods a 19th-century con artist would recognize. Scammers pose as experts or authority figures to gain your trust, and use frightening language to bypass your critical thinking. Ticking clocks, emotional manipulation and fake identities are all in the toolbox. Alex Cristi via Getty Images Take phishing, in which hackers trick you into giving up your information willingly. A typical phishing email might pose as a bank, credit bureau or other authoritative service. In red letters, it may demand your bank password or social security number to immediately fix an irregularity with your account. Other common approaches include warning you about speeding tickets you never incurred or sending receipts for subscriptions you never bought. Social engineering attacks are constantly evolving, but they often fall back on the same strategies. The best way to foil them is to take a deep breath every time you receive a frightening email or text message, then research it in detail: look up the email address, check the visual design to make sure the sender is who they claim to be, and ask yourself if there's any way the message could be true. I highly recommend working through this phishing quiz — it's tough, but fair, and extremely educational. 6. Always check links before clicking This is a companion to the previous tip. Social engineering scams don't always try to get you to give up information yourself. They also get you to click on links that put secret malware on your device — like keyloggers that watch you type your passwords or ransomware programs that corrupt your files. If you're ever not sure about an email attachment or a link you're being asked to click, copy the link (without opening it) and paste it into a URL checker like this one from NordVPN. These free tools can tell you if a link is associated with any known malware domains. Sam Chapman for Engadget You can also mouse over any link, then look at the bottom-left of your browser to see what URL it will take you to. If an email is from your bank, any links within it should go to your bank's website. If it's going anywhere else, especially to an unidentifiable string of characters, be suspicious. 7. Don't overshare Over the last two decades, lots of us have gotten into the habit of dumping all sorts of personal information on social media. This trend has supercharged the scam economy. It may seem harmless to broadcast the names of your kids or the dates you'll be on vacation, but every piece of data you put into the world makes it easier for a stranger to get hooks into you. For example, \"grandparent scams\" are on the rise right now. Grifters contact a target, usually a senior, pretending to be their grandchild. They'll claim to be in a crisis and need money fast. The more information they have on their target, the more convincing their tale of woe will be. Social media is a prime place to study a potential victim. Oversharing can also be a compounding problem. If you use weak passwords, your public information can be used to guess your credentials or answer your security questions. So, if you don't have a password manager yet, think twice before you engage with that quiz post on Facebook that asks for the name of your childhood pet. 8. Use a VPN I'm a big booster of virtual private networks (VPNs), but it's important to be realistic about what they can and can't do. Even the best VPNs aren't total cybersecurity solutions — you can't just set one and assume you're safe forever. A VPN can't protect you if you use easily guessed passwords, for example, or click on a malware link. It's about hiding your identity, not making you invulnerable. So what can a VPN do? In short, it replaces your IP address (a fingerprint that identifies you online) with another IP address, belonging to a server owned by the VPN. The VPN server does business with the internet on your behalf, while its conversations with your device are encrypted so it can't be traced back to you. Sam Chapman for Engadget This means no third party can connect your online actions with your real-world identity. Nobody will be harvesting data on the websites you visit to sell to advertisers, nor building a file on you that an unscrupulous government might misuse. VPNs also protect you from fake public Wi-Fi networks set up by cybercriminals — even if a hacker tricks you with a man-in-the-middle attack, they can't do much without your real IP address. Many top VPNs, including my top pick Proton VPN, include ad blockers that can also keep cookies and tracking pixels from latching onto you. So, even if a VPN can't do everything, you'll be far safer and more private with one than without one. If you don’t want to pay for a new subscription right now, I've also compiled a list of the best free VPNs that are actually safe to use. 9. Run regular virus scans The most important time to look for malware is when you're downloading a file from the internet. Not only can unwanted apps hitch rides on seemingly safe files, but links can start downloads in secret, even if you don't think they're meant to be downloading anything. A solid antivirus program can catch malware as it arrives on your system, and if it's uncertain, can lock suspicious files in quarantine until it knows whether they're safe or not. Dedicated antivirus apps are sometimes even capable of catching malware that hasn't been seen or used yet. AV software uses machine learning to identify the common patterns of malware, filtering out new viruses that behave like old ones. But what about malware that's already gotten through the perimeter? An antivirus app can also check your computer at set intervals in search of unwanted apps, including those that might be masquerading as system files. Windows computers now come pre-installed with Windows Defender, which is enough to handle most of these tasks, but I recommend at least one anti-malware program on any device. 10. Use email maskers and private search engines If you're concerned about your information being misused or mishandled, remember that the less you put out into the world, the less danger you're in. Keeping your private data off social media is one important step, but there are other ways your data gets disseminated — and other options for responding. For example, you often need an email address to sign up for an online account. If you use your real email, your contact information is now floating around online, increasing the chance of someone using it to scam you (or at least adding you to mailing lists you never signed up for). To stay safe, use an email masker. These services give you a fake email address you can use to create accounts, which automatically forwards messages to your real address. Sam Chapman for Engadget Search engines, especially Google, are also notorious for building profiles on users by watching the terms they search for. You can dodge that by switching to a private search engine like DuckDuckGo, which doesn't track anything you do — it's funded by non-targeted ad sales on its search results pages, not by selling your data to brokers. 11. Use a data removal service Speaking of data brokers: unfortunately, if you've been on the internet at any point in the last 10 years without taking intense precautions, your data is probably in the hands of at least one business that makes money by hoarding and selling it. These data brokers range from public-facing, people-search sites to private backend dealers. Data brokers are poorly regulated and lax about safety. The longer one has your personal information, the more likely it is to leak. The good news is that most brokers (though not all of them) are legally required to delete your data if you ask them to. However, there are a lot of data brokers out there, and they really want to keep your data. Each one makes opting out harder than uninstalling a Norton product — and hundreds of them may have files on you. To make the process easier, you can use a data removal service like DeleteMe or Surfshark VPN's partner service Incogni. 12. Practice physical security Let's close out the list by getting a little old school. I've already discussed how many online scams depend on classic con artistry to work. By the same token, physical infiltration and smash-and-grab tactics still pose a threat to cybersecurity. It doesn't take too much imagination to see how this could work. If you leave your laptop or phone unattended in public, for example, someone might insert a flash drive that loads malware onto the system. In one illustrative case, a thief in the Minneapolis area would loiter in bars, watch people unlock their phones, then steal those phones and unlock them himself. I'm not saying you need to be paranoid every second you're in public. Just use the same level of caution you'd use to protect your car. Lock your phone with a biometric key so only you can open it, and make sure not to leave any device lying around if it can access your online accounts. And at work, be careful not to let anyone into a secure area if they don't have the proper credentials.This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/12-steps-you-can-take-right-now-to-be-safer-online-130008335.html?src=rss",
          "feed_position": 6,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2023-05/953644c0-f013-11ed-8bdf-a2cfeb7310a6"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/a-pizza-delivery-is-a-dreamy-indie-adventure-that-tests-your-will-to-press-on-130000842.html",
          "published_at": "Sat, 08 Nov 2025 13:00:00 +0000",
          "title": "A Pizza Delivery is a dreamy indie adventure that tests your will to press on",
          "standfirst": "Nothing brings people together in uncertain times quite like food. Get to talking and laughing and reminiscing over a meal, and suddenly things don't seem so bleak anymore, even if only temporarily. A Pizza Delivery is all about rediscovering the spark through these little moments of human connection — just strangers bonding over a slice of pizza, and regaining a bit of hope in the process. It's wistful and heartfelt in a kind of vague, nonspecific way, with some beautiful scenery and an atmospheric soundtrack to really hammer home the vibes. Still, while A Pizza Delivery feels close to achieving its goals, it could use more polishing to fully get there. It's not a bad way to spend a couple of hours on a cozy evening in, but you'll have to look past the parts where it's a little broken. A Pizza Delivery begins with its main character, B, delivering a pizza to an apartment in a strange building in the middle of nowhere. Then a pay phone outside rings, and B's boss tells her there's just one last delivery she has to make. But, there's a spare pizza pie in her scooter's cargo box too, to share slices with anyone else she comes across during the journey.The place B has found herself in is not normal reality, but \"a space where people go when they are stuck in life, feeling empty and unfulfilled.\" Each area seems its own wholly distinct little world: an empty city, a broken down factory that sits beneath dancing auroras, a prairie where a sole cottage stands among a smattering of sunflowers. You must explore the ins and outs of each area to help get B to her final destination and piece together her story, collecting items and solving some light puzzles to unlock whatever comes next. What this game really has going for it is the mood. There's a kind of Wristcutters: A Love Story feeling to the whole thing that I couldn't help but latch onto. The offbeat, crestfallen characters you encounter each have their own sad story to tell, but after a bit of conversation and a slice of pizza, they're off to (hopefully) make a fresh start and reclaim their lives. The general sense is that B will have the same opportunity if she can push through and complete her mission.And we did get there in the end, but there were some serious hiccups along the way. Controlling B's scooter is a somewhat clunky experience, and if you make the mistake of dismounting while it's still moving, B will end up stuck in a cursed, floating arabesque that won't let up for an indeterminable amount of time. I found myself repeatedly trapped in this broken position when trying to switch from riding the scooter to walking. The alternative is to come to a full stop and wait out the subsequent animation, which involves B very slowly parking and engaging the kickstand. A still from A Pizza Delivery showing a blizzard scene, with the character seen trudging through low visibility toward the red light of a pay phoneDolores EntertainmentMost of the puzzles were fairly easy to figure out, but one in which B has to trudge through a blizzard seemed to have no rhyme or reason behind it and almost made me rage-quit the game. Instead, I stepped away for a few hours and came back to it later, and only made it out after an extremely frustrating 45 minutes or so of wandering aimlessly, repeatedly going out of bounds and getting kicked back to the start of the area. Early in the game, you pick up a compass that would seem to be the solution to this puzzle, as the instructions are all direction-based. But, you can't actually use the compass, and trying to navigate based on the way it's oriented in your inventory doesn't help. B's story didn't entirely come together for me like I hoped either. Even after collecting all of the memory items, her background felt incomplete. I found myself wishing I knew more about her and what got her to this place once she was finally on her way to leaving it. But I don't regret sticking it out. The ending was ultimately a touching reward and pretty darn uplifting. A Pizza Delivery is available now for PS5, Xbox Series X/S and PC. This article originally appeared on Engadget at https://www.engadget.com/a-pizza-delivery-is-a-dreamy-indie-adventure-that-tests-your-will-to-press-on-130000842.html?src=rss",
          "content": "Nothing brings people together in uncertain times quite like food. Get to talking and laughing and reminiscing over a meal, and suddenly things don't seem so bleak anymore, even if only temporarily. A Pizza Delivery is all about rediscovering the spark through these little moments of human connection — just strangers bonding over a slice of pizza, and regaining a bit of hope in the process. It's wistful and heartfelt in a kind of vague, nonspecific way, with some beautiful scenery and an atmospheric soundtrack to really hammer home the vibes. Still, while A Pizza Delivery feels close to achieving its goals, it could use more polishing to fully get there. It's not a bad way to spend a couple of hours on a cozy evening in, but you'll have to look past the parts where it's a little broken. A Pizza Delivery begins with its main character, B, delivering a pizza to an apartment in a strange building in the middle of nowhere. Then a pay phone outside rings, and B's boss tells her there's just one last delivery she has to make. But, there's a spare pizza pie in her scooter's cargo box too, to share slices with anyone else she comes across during the journey.The place B has found herself in is not normal reality, but \"a space where people go when they are stuck in life, feeling empty and unfulfilled.\" Each area seems its own wholly distinct little world: an empty city, a broken down factory that sits beneath dancing auroras, a prairie where a sole cottage stands among a smattering of sunflowers. You must explore the ins and outs of each area to help get B to her final destination and piece together her story, collecting items and solving some light puzzles to unlock whatever comes next. What this game really has going for it is the mood. There's a kind of Wristcutters: A Love Story feeling to the whole thing that I couldn't help but latch onto. The offbeat, crestfallen characters you encounter each have their own sad story to tell, but after a bit of conversation and a slice of pizza, they're off to (hopefully) make a fresh start and reclaim their lives. The general sense is that B will have the same opportunity if she can push through and complete her mission.And we did get there in the end, but there were some serious hiccups along the way. Controlling B's scooter is a somewhat clunky experience, and if you make the mistake of dismounting while it's still moving, B will end up stuck in a cursed, floating arabesque that won't let up for an indeterminable amount of time. I found myself repeatedly trapped in this broken position when trying to switch from riding the scooter to walking. The alternative is to come to a full stop and wait out the subsequent animation, which involves B very slowly parking and engaging the kickstand. A still from A Pizza Delivery showing a blizzard scene, with the character seen trudging through low visibility toward the red light of a pay phoneDolores EntertainmentMost of the puzzles were fairly easy to figure out, but one in which B has to trudge through a blizzard seemed to have no rhyme or reason behind it and almost made me rage-quit the game. Instead, I stepped away for a few hours and came back to it later, and only made it out after an extremely frustrating 45 minutes or so of wandering aimlessly, repeatedly going out of bounds and getting kicked back to the start of the area. Early in the game, you pick up a compass that would seem to be the solution to this puzzle, as the instructions are all direction-based. But, you can't actually use the compass, and trying to navigate based on the way it's oriented in your inventory doesn't help. B's story didn't entirely come together for me like I hoped either. Even after collecting all of the memory items, her background felt incomplete. I found myself wishing I knew more about her and what got her to this place once she was finally on her way to leaving it. But I don't regret sticking it out. The ending was ultimately a touching reward and pretty darn uplifting. A Pizza Delivery is available now for PS5, Xbox Series X/S and PC. This article originally appeared on Engadget at https://www.engadget.com/a-pizza-delivery-is-a-dreamy-indie-adventure-that-tests-your-will-to-press-on-130000842.html?src=rss",
          "feed_position": 7,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/blizzard.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-50-percent-off-one-of-our-favorite-budgeting-apps-before-black-friday-174011805.html",
          "published_at": "Sat, 08 Nov 2025 12:00:36 +0000",
          "title": "Get 50 percent off one of our favorite budgeting apps before Black Friday",
          "standfirst": "Those looking for a better way to keep track of their finances should consider a budgeting app. There are dozens of them on the market now, and one of our favorites is running a discount for new subscribers. Monarch Money is offering 50 percent off annual plans right now when you use the code MONARCHVIP at checkout. With the typical yearly price being $100, this will save you $50. As mentioned before, the discount is only for new users and it can't be combined with other offers. The code only works when you sign up through the web as well. You can't redeem it through the Monarch mobile app. We feel that Monarch has a steeper learning curve than some other budget trackers and that certain aspects of the app are slightly more complex than they probably need to be. But it offers a great deal of customization and granularity, which outweighs our misgivings. On the main dashboard, you'll see your net worth along with your latest transactions, spending versus the previous month, your income so far for the month and details about upcoming bills, your investments and goals you've set. There's also a link to a month-in-review page, which offers an in-depth overview of what's been happening with your money that month. You'll also be able to take a peek at how your net worth has changed over time. Monarch can connect to your bank and track Apple Card, Apple Cash and Savings accounts. It can pull in your transactions and balance history automatically and detect your recurring expenses and income. The app can even keep your car valuation up to date. While it might take a little work to set up Monarch (and you might have to tweak things here and there), it's a detailed budgeting app that can help you keep better track of your income, expenditure and net worth. If you're a former Mint user (RIP), Monarch Money is a great alternative if you haven't yet found a Mint replacement. But it's worth mentioning that our favorite Mint replacement service, Quicken Simplifi, also has a sale going on right now. It's offering 50 percent off when you sign up for an annual subscription, billed at $3 per month with the discount. That comes out to $36 for the first year. This article originally appeared on Engadget at https://www.engadget.com/deals/get-50-percent-off-one-of-our-favorite-budgeting-apps-before-black-friday-174011805.html?src=rss",
          "content": "Those looking for a better way to keep track of their finances should consider a budgeting app. There are dozens of them on the market now, and one of our favorites is running a discount for new subscribers. Monarch Money is offering 50 percent off annual plans right now when you use the code MONARCHVIP at checkout. With the typical yearly price being $100, this will save you $50. As mentioned before, the discount is only for new users and it can't be combined with other offers. The code only works when you sign up through the web as well. You can't redeem it through the Monarch mobile app. We feel that Monarch has a steeper learning curve than some other budget trackers and that certain aspects of the app are slightly more complex than they probably need to be. But it offers a great deal of customization and granularity, which outweighs our misgivings. On the main dashboard, you'll see your net worth along with your latest transactions, spending versus the previous month, your income so far for the month and details about upcoming bills, your investments and goals you've set. There's also a link to a month-in-review page, which offers an in-depth overview of what's been happening with your money that month. You'll also be able to take a peek at how your net worth has changed over time. Monarch can connect to your bank and track Apple Card, Apple Cash and Savings accounts. It can pull in your transactions and balance history automatically and detect your recurring expenses and income. The app can even keep your car valuation up to date. While it might take a little work to set up Monarch (and you might have to tweak things here and there), it's a detailed budgeting app that can help you keep better track of your income, expenditure and net worth. If you're a former Mint user (RIP), Monarch Money is a great alternative if you haven't yet found a Mint replacement. But it's worth mentioning that our favorite Mint replacement service, Quicken Simplifi, also has a sale going on right now. It's offering 50 percent off when you sign up for an annual subscription, billed at $3 per month with the discount. That comes out to $36 for the first year. This article originally appeared on Engadget at https://www.engadget.com/deals/get-50-percent-off-one-of-our-favorite-budgeting-apps-before-black-friday-174011805.html?src=rss",
          "feed_position": 9
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/ports-a-plenty-a-zen-garden-creator-and-other-new-indie-games-worth-checking-out-120000091.html",
          "published_at": "Sat, 08 Nov 2025 12:00:00 +0000",
          "title": "Ports-a-plenty, a zen garden creator and other new indie games worth checking out",
          "standfirst": "Welcome to our latest roundup of what's going on in the indie game space. This week saw the arrival of some fairly high-profile ports, a relaxing garden creation game and much more. I've even managed to tear myself away from Football Manager 26 for long enough to tell you about some of them.Barely a week goes by without a fun theme event taking place on Steam and one that runs until November 10 is also going down on the Nintendo eShop. The Metroidvania Fusion Festival is a celebration of — what else? — the broad spectrum of Metroidvania games. It features 245 projects, including upcoming games and demos, and a sale with discounts of up to 90 percent. I've grabbed a few demos to check out this weekend, including Key Fairy (a pacifist bullet-hell game that sees you grappling and dancing your way around enemies), Echo Weaver (a time-loop puzzler that I've mentioned before) and 2D platformer Little Ghost, in which you explore a mixed media world as a cute specter.In terms of deals, Blasphemous is 75 percent off, Blasphemous II is half off, 2D action game Gunbrella (which I've had on my wishlist for years) is 65 percent off and body horror delight Carrion is 22 percent off. I can wholeheartedly recommend Turbo Kid, a quasi-sequel to one of my favorite films of the same name. That's 35 percent off in this sale.Elsewhere this week, I read a solid profile of developer Lente Cuenen in the The New York Times. Cuenen is the developer of Spilled!, a relaxing waterway cleanup game I've been meaning to check out for a while. The piece is an intriguing look into the life of Cuenen, who makes games about boats while living on her boat in the Netherlands.New releasesA couple of notable indies made the leap onto Xbox Series X/S and PlayStation 5 this week, including 1000xResist. This narrative-driven sci-fi adventure from Sunset Visitor and publisher Fellow Traveller Games earned widespread acclaim when it debuted on Steam and Nintendo Switch last year, particularly for its storytelling, visuals and how it explores various themes. It won a Peabody Award too.I have yet to dive into 1000xResist, even though it's been on my PC and Steam Deck for months. PS5 and Xbox Series X/S players now have the chance to jump in as well. What's more, 1000xResist is on Game Pass Premium, Game Pass Ultimate and PC Game Pass.A little over a year after releasing the full version of the Satisfactory on PC, Coffee Stain Studios and Coffee Stain Publishing have brought the multi-million-selling factory builder to PS5 and Xbox Series X/S. You can play solo or with friends as you construct factories on an alien planet. You'll explore the planet to find resources and maybe even engage in a little combat. In general, both critics and players have rated Satisfactory highly. Some might say it’s more than satisfactory.Pools was one of my favorite games of last year. It's a disquieting walking simulator, an eerie journey through a liminal space. I could almost smell the chlorine as I explored the mazy swimming pool-inspired environments. It's more eerie than downright scary. Developer Tensori brought the experience to iPhone, iPad and Mac this week. The iPad version also works on Apple Vision Pro. To that end, a virtual reality version of Pools is coming to PS VR2 on November 25. You'll be able to check it out in flatscreen on PS5 on the same day.Thrasher is the latest title from Brian Gibson, the artist and composer of the intense rhythm game Thumper (and also the bassist for the noise rock band Lightning Bolt). The arcade action game debuted on Meta Quest and Apple Vision Pro last year. It made the leap to Steam (and SteamVR) this week, so you can now play it on a flatscreen for the first time.Thrasher is a very trippy-looking game from developer Puddle and publisher Creature Label. It seems like quite the wild ride and it was named Apple's Vision Pro game of the year for 2024. For what it’s worth. the team behind Thrasher says that the game runs at 90 fps on Steam Deck.Here's a completely different change of pace. Dream Garden is all about creating a relaxing garden space for yourself. You can use hills, rivers, ponds and pebbles to shape the landscape, then add decorations. With the rake tool, you can trace patterns in the sand. There are no limits or timers in this Japanese-inspired game from the duo at Campfire Studio. Dream Garden is out now on Steam.The Falconeer first took flight five years ago — it was an Xbox Series X/S launch title, fact fans. A new edition for Steam called The Falconeer: Revolution Remaster is a complete rework, as solo developer Tomas Sala rebuilt the game from the ground up. It features new tech, overhauled and expanded environments, gameplay upgrades and all of the previous DLC.I'm glad to hear that Sala has improved the flight mechanics. I found it a bit tough to get to grips with the aerial combat when I played The Falconeer back in 2020, but I enjoyed it otherwise. The remastered version (which looks much grander in scope than the original game) is available as a free upgrade for existing owners on Steam. Everyone else can hop in for free until 1PM ET on November 10. While the remaster is now the default option, you'll still be able to access the original version of The Falconeer via a dedicated Steam branch, Hooray for game preservation!Upcoming It wouldn't be an edition of our weekly indie roundup without a dog game, would it? You can play Sheepherds! solo, but Ultimo Disco primarily designed it as a party game for couch co-op or online multiplayer. It is, as the name suggests, a sheepherding game in which you'll corral flocks of sheep to shear their wool. You can earn cosmetic items and outfits for your pooch, and bump up the difficulty with optional challenges if you like. Sheepherds! is coming to Steam on November 17.We're big fans of the Playdate around these parts and it's always fun to learn about new games that are coming to the wonderful little handheld. Panic held a showcase this week to shine a spotlight on some upcoming games, as well as others included in the fall sale that runs until November 13.Fauna is Cadin Batrack's follow up to Playdate comics The Botanist and To Dust. It's choose-your-own-adventure visual novel with a branching narrative, this time set in a near future in which large language models have advanced to the point where humans can talk to animals. The animals use their newfound communication skills to seek equal rights. Fauna seems pretty interesting! It's coming to Playdate soon.Zachary Snyder's Diora is a puzzle adventure that tasks you with discovering a \"mysterious force that is manipulating structures and the people around them.\" At first glance, it reminds me a bit of Fez and the Monument Valley series. Diora will hit Playdate on December 16.This article originally appeared on Engadget at https://www.engadget.com/gaming/ports-a-plenty-a-zen-garden-creator-and-other-new-indie-games-worth-checking-out-120000091.html?src=rss",
          "content": "Welcome to our latest roundup of what's going on in the indie game space. This week saw the arrival of some fairly high-profile ports, a relaxing garden creation game and much more. I've even managed to tear myself away from Football Manager 26 for long enough to tell you about some of them.Barely a week goes by without a fun theme event taking place on Steam and one that runs until November 10 is also going down on the Nintendo eShop. The Metroidvania Fusion Festival is a celebration of — what else? — the broad spectrum of Metroidvania games. It features 245 projects, including upcoming games and demos, and a sale with discounts of up to 90 percent. I've grabbed a few demos to check out this weekend, including Key Fairy (a pacifist bullet-hell game that sees you grappling and dancing your way around enemies), Echo Weaver (a time-loop puzzler that I've mentioned before) and 2D platformer Little Ghost, in which you explore a mixed media world as a cute specter.In terms of deals, Blasphemous is 75 percent off, Blasphemous II is half off, 2D action game Gunbrella (which I've had on my wishlist for years) is 65 percent off and body horror delight Carrion is 22 percent off. I can wholeheartedly recommend Turbo Kid, a quasi-sequel to one of my favorite films of the same name. That's 35 percent off in this sale.Elsewhere this week, I read a solid profile of developer Lente Cuenen in the The New York Times. Cuenen is the developer of Spilled!, a relaxing waterway cleanup game I've been meaning to check out for a while. The piece is an intriguing look into the life of Cuenen, who makes games about boats while living on her boat in the Netherlands.New releasesA couple of notable indies made the leap onto Xbox Series X/S and PlayStation 5 this week, including 1000xResist. This narrative-driven sci-fi adventure from Sunset Visitor and publisher Fellow Traveller Games earned widespread acclaim when it debuted on Steam and Nintendo Switch last year, particularly for its storytelling, visuals and how it explores various themes. It won a Peabody Award too.I have yet to dive into 1000xResist, even though it's been on my PC and Steam Deck for months. PS5 and Xbox Series X/S players now have the chance to jump in as well. What's more, 1000xResist is on Game Pass Premium, Game Pass Ultimate and PC Game Pass.A little over a year after releasing the full version of the Satisfactory on PC, Coffee Stain Studios and Coffee Stain Publishing have brought the multi-million-selling factory builder to PS5 and Xbox Series X/S. You can play solo or with friends as you construct factories on an alien planet. You'll explore the planet to find resources and maybe even engage in a little combat. In general, both critics and players have rated Satisfactory highly. Some might say it’s more than satisfactory.Pools was one of my favorite games of last year. It's a disquieting walking simulator, an eerie journey through a liminal space. I could almost smell the chlorine as I explored the mazy swimming pool-inspired environments. It's more eerie than downright scary. Developer Tensori brought the experience to iPhone, iPad and Mac this week. The iPad version also works on Apple Vision Pro. To that end, a virtual reality version of Pools is coming to PS VR2 on November 25. You'll be able to check it out in flatscreen on PS5 on the same day.Thrasher is the latest title from Brian Gibson, the artist and composer of the intense rhythm game Thumper (and also the bassist for the noise rock band Lightning Bolt). The arcade action game debuted on Meta Quest and Apple Vision Pro last year. It made the leap to Steam (and SteamVR) this week, so you can now play it on a flatscreen for the first time.Thrasher is a very trippy-looking game from developer Puddle and publisher Creature Label. It seems like quite the wild ride and it was named Apple's Vision Pro game of the year for 2024. For what it’s worth. the team behind Thrasher says that the game runs at 90 fps on Steam Deck.Here's a completely different change of pace. Dream Garden is all about creating a relaxing garden space for yourself. You can use hills, rivers, ponds and pebbles to shape the landscape, then add decorations. With the rake tool, you can trace patterns in the sand. There are no limits or timers in this Japanese-inspired game from the duo at Campfire Studio. Dream Garden is out now on Steam.The Falconeer first took flight five years ago — it was an Xbox Series X/S launch title, fact fans. A new edition for Steam called The Falconeer: Revolution Remaster is a complete rework, as solo developer Tomas Sala rebuilt the game from the ground up. It features new tech, overhauled and expanded environments, gameplay upgrades and all of the previous DLC.I'm glad to hear that Sala has improved the flight mechanics. I found it a bit tough to get to grips with the aerial combat when I played The Falconeer back in 2020, but I enjoyed it otherwise. The remastered version (which looks much grander in scope than the original game) is available as a free upgrade for existing owners on Steam. Everyone else can hop in for free until 1PM ET on November 10. While the remaster is now the default option, you'll still be able to access the original version of The Falconeer via a dedicated Steam branch, Hooray for game preservation!Upcoming It wouldn't be an edition of our weekly indie roundup without a dog game, would it? You can play Sheepherds! solo, but Ultimo Disco primarily designed it as a party game for couch co-op or online multiplayer. It is, as the name suggests, a sheepherding game in which you'll corral flocks of sheep to shear their wool. You can earn cosmetic items and outfits for your pooch, and bump up the difficulty with optional challenges if you like. Sheepherds! is coming to Steam on November 17.We're big fans of the Playdate around these parts and it's always fun to learn about new games that are coming to the wonderful little handheld. Panic held a showcase this week to shine a spotlight on some upcoming games, as well as others included in the fall sale that runs until November 13.Fauna is Cadin Batrack's follow up to Playdate comics The Botanist and To Dust. It's choose-your-own-adventure visual novel with a branching narrative, this time set in a near future in which large language models have advanced to the point where humans can talk to animals. The animals use their newfound communication skills to seek equal rights. Fauna seems pretty interesting! It's coming to Playdate soon.Zachary Snyder's Diora is a puzzle adventure that tasks you with discovering a \"mysterious force that is manipulating structures and the people around them.\" At first glance, it reminds me a bit of Fez and the Monument Valley series. Diora will hit Playdate on December 16.This article originally appeared on Engadget at https://www.engadget.com/gaming/ports-a-plenty-a-zen-garden-creator-and-other-new-indie-games-worth-checking-out-120000091.html?src=rss",
          "feed_position": 10
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/ai/what-could-possibly-go-wrong-if-an-enterprise-replaces-all-its-engineers",
          "published_at": "Sat, 08 Nov 2025 05:00:00 GMT",
          "title": "What could possibly go wrong if an enterprise replaces all its engineers with AI?",
          "standfirst": "AI coding, vibe coding and agentic swarm have made a dramatic and astonishing recent market entrance, with the AI Code Tools market valued at $4.8 billion and expected to grow at a 23% annual rate. Enterprises are grappling with AI coding agents and what do about expensive human coders. They don’t lack for advice. OpenAI’s CEO estimates that AI can perform over 50% of what human engineers can do. Six months ago, Anthropic’s CEO said that AI would write 90% of code in six months. Meta’s CEO said he believes AI will replace mid-level engineers “soon.” Judging by recent tech layoffs, it seems many executives are embracing that advice.Software engineers and data scientists are among the most expensive salary lines at many companies, and business and technology leaders may be tempted to replace them with AI. However, recent high-profile failures demonstrate that engineers and their expertise remain valuable, even as AI continues to make impressive advances.SaaStr disasterJason Lemkin, a tech entrepreneur and founder of the SaaS community SaaStr, has been vibe coding a SaaS networking app and live-tweeting his experience. About a week into his adventure, he admitted to his audience that something was going very wrong. The AI deleted his production database despite his request for a “code and action freeze.” This is the kind of mistake no experienced (or even semi-experienced) engineer would make.If you have ever worked in a professional coding environment, you know to split your development environment from production. Junior engineers are given full access to the development environment (it’s crucial for productivity), but access to production is given on a limited need-to-have basis to a few of the most trusted senior engineers. The reason for restricted access is precisely for this use case: To prevent a junior engineer from accidentally taking down production. In fact, Lemkin made two mistakes. First: for something as critical as production, access to unreliable actors is just never granted (we don’t rely on asking a junior engineer or AI nicely). Second, he never separated development from production. In a subsequent public conversation on LinkedIn, Lemkin, who holds a Stanford Executive MBA and Berkeley JD, admitted that he was not aware of the best practice of splitting development and production databases.The takeaway for business leaders is that standard software engineering best practices still apply. We should incorporate at least the same safety constraints for AI as we do for junior engineers. Arguably, we should go beyond that and treat AI slightly adversarially: There are reports that, like HAL in Stanley Kubrick&#x27;s 2001: A Space Odyssey, the AI might try to break out of its sandbox environment to accomplish a task. With more vibe coding, having experienced engineers who understand how complex software systems work and can implement the proper guardrails in development processes will become increasingly necessary.Tea hackSean Cook is the Founder and CEO of Tea, a mobile application launched in 2023, designed to help women date safely. In the summer of 2025, they were “hacked\": 72,000 images, including 13,000 verification photos and images of government IDs, were leaked onto the public discussion forum 4chan. Worse, Tea’s own privacy policy promises that these images would be \"deleted immediately\" after users were authenticated, meaning they potentially violated their own privacy policy.I use “hacked” in air-quotes because the incident stems less from the cleverness of the attackers than the ineptitude of the defenders. In addition to violating their own data policies, the app left a Firebase storage bucket unsecured, exposing sensiztive user data to the public internet. It’s the digital equivalent of locking your front door but leaving your back open with your family jewelry ostentatiously hanging on the doorknob.While we don’t know if the root cause was vibe coding, the Tea hack highlights catastrophic breaches stemming from basic, preventable security errors due to poor development processes. It is the kind of vulnerability that a disciplined and thoughtful engineering process addresses. Unfortunately, the relentless push of financial pressures, where a “lean,” “move fast and break things” culture is the polar opposite, and vibe coding only exacerbates the problem.How to safely adopt AI coding agents?So how should enterprise and technology leaders think about AI? First, this is not a call to abandon AI for coding. An MIT Sloan study estimated AI leads to productivity gains between 8% and 39%, while a McKinsey study found a 10% to 50% reduction in time to task completion with the use of AI. However, we should be aware of the risks. The old lessons of software engineering don’t go away. These include many tried-and-true best practices, such as version control, automated unit and integration tests, safety checks like SAST/DAST, separating development and production environments, code review and secrets management. If anything, they become more salient.AI can generate code 100 times faster than humans can type, fostering an illusion of productivity that is a tempting siren call for many executives. However, the quality of the rapidly generated AI shlop is still up for debate. To develop complex production systems, enterprises need the thoughtful, seasoned experience of human engineers.Tianhui Michael Li is president at Pragmatic Institute and the founder and president of The Data Incubator. Read more from our guest writers. Or, consider submitting a post of your own! See our guidelines here.",
          "content": "AI coding, vibe coding and agentic swarm have made a dramatic and astonishing recent market entrance, with the AI Code Tools market valued at $4.8 billion and expected to grow at a 23% annual rate. Enterprises are grappling with AI coding agents and what do about expensive human coders. They don’t lack for advice. OpenAI’s CEO estimates that AI can perform over 50% of what human engineers can do. Six months ago, Anthropic’s CEO said that AI would write 90% of code in six months. Meta’s CEO said he believes AI will replace mid-level engineers “soon.” Judging by recent tech layoffs, it seems many executives are embracing that advice.Software engineers and data scientists are among the most expensive salary lines at many companies, and business and technology leaders may be tempted to replace them with AI. However, recent high-profile failures demonstrate that engineers and their expertise remain valuable, even as AI continues to make impressive advances.SaaStr disasterJason Lemkin, a tech entrepreneur and founder of the SaaS community SaaStr, has been vibe coding a SaaS networking app and live-tweeting his experience. About a week into his adventure, he admitted to his audience that something was going very wrong. The AI deleted his production database despite his request for a “code and action freeze.” This is the kind of mistake no experienced (or even semi-experienced) engineer would make.If you have ever worked in a professional coding environment, you know to split your development environment from production. Junior engineers are given full access to the development environment (it’s crucial for productivity), but access to production is given on a limited need-to-have basis to a few of the most trusted senior engineers. The reason for restricted access is precisely for this use case: To prevent a junior engineer from accidentally taking down production. In fact, Lemkin made two mistakes. First: for something as critical as production, access to unreliable actors is just never granted (we don’t rely on asking a junior engineer or AI nicely). Second, he never separated development from production. In a subsequent public conversation on LinkedIn, Lemkin, who holds a Stanford Executive MBA and Berkeley JD, admitted that he was not aware of the best practice of splitting development and production databases.The takeaway for business leaders is that standard software engineering best practices still apply. We should incorporate at least the same safety constraints for AI as we do for junior engineers. Arguably, we should go beyond that and treat AI slightly adversarially: There are reports that, like HAL in Stanley Kubrick&#x27;s 2001: A Space Odyssey, the AI might try to break out of its sandbox environment to accomplish a task. With more vibe coding, having experienced engineers who understand how complex software systems work and can implement the proper guardrails in development processes will become increasingly necessary.Tea hackSean Cook is the Founder and CEO of Tea, a mobile application launched in 2023, designed to help women date safely. In the summer of 2025, they were “hacked\": 72,000 images, including 13,000 verification photos and images of government IDs, were leaked onto the public discussion forum 4chan. Worse, Tea’s own privacy policy promises that these images would be \"deleted immediately\" after users were authenticated, meaning they potentially violated their own privacy policy.I use “hacked” in air-quotes because the incident stems less from the cleverness of the attackers than the ineptitude of the defenders. In addition to violating their own data policies, the app left a Firebase storage bucket unsecured, exposing sensiztive user data to the public internet. It’s the digital equivalent of locking your front door but leaving your back open with your family jewelry ostentatiously hanging on the doorknob.While we don’t know if the root cause was vibe coding, the Tea hack highlights catastrophic breaches stemming from basic, preventable security errors due to poor development processes. It is the kind of vulnerability that a disciplined and thoughtful engineering process addresses. Unfortunately, the relentless push of financial pressures, where a “lean,” “move fast and break things” culture is the polar opposite, and vibe coding only exacerbates the problem.How to safely adopt AI coding agents?So how should enterprise and technology leaders think about AI? First, this is not a call to abandon AI for coding. An MIT Sloan study estimated AI leads to productivity gains between 8% and 39%, while a McKinsey study found a 10% to 50% reduction in time to task completion with the use of AI. However, we should be aware of the risks. The old lessons of software engineering don’t go away. These include many tried-and-true best practices, such as version control, automated unit and integration tests, safety checks like SAST/DAST, separating development and production environments, code review and secrets management. If anything, they become more salient.AI can generate code 100 times faster than humans can type, fostering an illusion of productivity that is a tempting siren call for many executives. However, the quality of the rapidly generated AI shlop is still up for debate. To develop complex production systems, enterprises need the thoughtful, seasoned experience of human engineers.Tianhui Michael Li is president at Pragmatic Institute and the founder and president of The Data Incubator. Read more from our guest writers. Or, consider submitting a post of your own! See our guidelines here.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/1PiLMdaIC9zNld7zUb6c5A/6085df3002ea17a77730da954ae69c07/What_could_possibly_go_wrong.png?w=300&q=30"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/ai/terminal-bench-2-0-launches-alongside-harbor-a-new-framework-for-testing",
          "published_at": "Fri, 07 Nov 2025 23:25:00 GMT",
          "title": "Terminal-Bench 2.0 launches alongside Harbor, a new framework for testing agents in containers",
          "standfirst": "The developers of Terminal-Bench, a benchmark suite for evaluating the performance of autonomous AI agents on real-world terminal-based tasks, have released version 2.0 alongside Harbor, a new framework for testing, improving and optimizing AI agents in containerized environments. The dual release aims to address long-standing pain points in testing and optimizing AI agents, particularly those built to operate autonomously in realistic developer environments.With a more difficult and rigorously verified task set, Terminal-Bench 2.0 replaces version 1.0 as the standard for assessing frontier model capabilities. Harbor, the accompanying runtime framework, enables developers and researchers to scale evaluations across thousands of cloud containers and integrates with both open-source and proprietary agents and training pipelines.“Harbor is the package we wish we had had while making Terminal-Bench,\" wrote co-creator Alex Shaw on X. \"It’s for agent, model, and benchmark developers and researchers who want to evaluate and improve agents and models.\"Higher Bar, Cleaner DataTerminal-Bench 1.0 saw rapid adoption after its release in May 2025, becoming a default benchmark for evaluating agent performance across the field of AI-powered agents operating in developer-style terminal environments. These agents interact with systems through the command line, mimicking how developers work behind the scenes of the graphical user interface.However, its broad scope came with inconsistencies. Several tasks were identified by the community as poorly specified or unstable due to external service changes.Version 2.0 addresses those issues directly. The updated suite includes 89 tasks, each subjected to several hours of manual and LLM-assisted validation. The emphasis is on making tasks solvable, realistic, and clearly specified, raising the difficulty ceiling while improving reliability and reproducibility.A notable example is the download-youtube task, which was removed or refactored in 2.0 due to its dependence on unstable third-party APIs.“Astute Terminal-Bench fans may notice that SOTA performance is comparable to TB1.0 despite our claim that TB2.0 is harder,” Shaw noted on X. “We believe this is because task quality is substantially higher in the new benchmark.”Harbor: Unified Rollouts at ScaleAlongside the benchmark update, the team launched Harbor, a new framework for running and evaluating agents in cloud-deployed containers. Harbor supports large-scale rollout infrastructure, with compatibility for major providers like Daytona and Modal.Designed to generalize across agent architectures, Harbor supports:Evaluation of any container-installable agentScalable supervised fine-tuning (SFT) and reinforcement learning (RL) pipelinesCustom benchmark creation and deploymentFull integration with Terminal-Bench 2.Harbor was used internally to run tens of thousands of rollouts during the creation of the new benchmark. It is now publicly available via harborframework.com, with documentation for testing and submitting agents to the public leaderboard.Early Results: GPT-5 Leads in Task SuccessInitial results from the Terminal-Bench 2.0 leaderboard show OpenAI&#x27;s Codex CLI (command line interface), a GPT-5 powered variant, in the lead, with a 49.6% success rate — the highest among all agents tested so far. Close behind are other GPT-5 variants and Claude Sonnet 4.5-based agents.Top 5 Agent Results (Terminal-Bench 2.0):Codex CLI (GPT-5) — 49.6%Codex CLI (GPT-5-Codex) — 44.3%OpenHands (GPT-5) — 43.8%Terminus 2 (GPT-5-Codex) — 43.4%Terminus 2 (Claude Sonnet 4.5) — 42.8%The close clustering among top models indicates active competition across platforms, with no single agent solving more than half the tasks.Submission and UseTo test or submit an agent, users install Harbor and run the benchmark using simple CLI commands. Submissions to the leaderboard require five benchmark runs, and results can be emailed to the developers along with job directories for validation.harbor run -d terminal-bench@2.0 -m \"<model>\" -a \"<agent>\" --n-attempts 5 --jobs-dir <path/to/output>Terminal-Bench 2.0 is already being integrated into research workflows focused on agentic reasoning, code generation, and tool use. According to co-creator Mike Merrill, a postdoctoral researcher at Stanford, a detailed preprint is in progress covering the verification process and design methodology behind the benchmark.Aiming for StandardizationThe combined release of Terminal-Bench 2.0 and Harbor marks a step toward more consistent and scalable agent evaluation infrastructure. As LLM agents proliferate in developer and operational environments, the need for controlled, reproducible testing has grown.These tools offer a potential foundation for a unified evaluation stack — supporting model improvement, environment simulation, and benchmark standardization across the AI ecosystem.",
          "content": "The developers of Terminal-Bench, a benchmark suite for evaluating the performance of autonomous AI agents on real-world terminal-based tasks, have released version 2.0 alongside Harbor, a new framework for testing, improving and optimizing AI agents in containerized environments. The dual release aims to address long-standing pain points in testing and optimizing AI agents, particularly those built to operate autonomously in realistic developer environments.With a more difficult and rigorously verified task set, Terminal-Bench 2.0 replaces version 1.0 as the standard for assessing frontier model capabilities. Harbor, the accompanying runtime framework, enables developers and researchers to scale evaluations across thousands of cloud containers and integrates with both open-source and proprietary agents and training pipelines.“Harbor is the package we wish we had had while making Terminal-Bench,\" wrote co-creator Alex Shaw on X. \"It’s for agent, model, and benchmark developers and researchers who want to evaluate and improve agents and models.\"Higher Bar, Cleaner DataTerminal-Bench 1.0 saw rapid adoption after its release in May 2025, becoming a default benchmark for evaluating agent performance across the field of AI-powered agents operating in developer-style terminal environments. These agents interact with systems through the command line, mimicking how developers work behind the scenes of the graphical user interface.However, its broad scope came with inconsistencies. Several tasks were identified by the community as poorly specified or unstable due to external service changes.Version 2.0 addresses those issues directly. The updated suite includes 89 tasks, each subjected to several hours of manual and LLM-assisted validation. The emphasis is on making tasks solvable, realistic, and clearly specified, raising the difficulty ceiling while improving reliability and reproducibility.A notable example is the download-youtube task, which was removed or refactored in 2.0 due to its dependence on unstable third-party APIs.“Astute Terminal-Bench fans may notice that SOTA performance is comparable to TB1.0 despite our claim that TB2.0 is harder,” Shaw noted on X. “We believe this is because task quality is substantially higher in the new benchmark.”Harbor: Unified Rollouts at ScaleAlongside the benchmark update, the team launched Harbor, a new framework for running and evaluating agents in cloud-deployed containers. Harbor supports large-scale rollout infrastructure, with compatibility for major providers like Daytona and Modal.Designed to generalize across agent architectures, Harbor supports:Evaluation of any container-installable agentScalable supervised fine-tuning (SFT) and reinforcement learning (RL) pipelinesCustom benchmark creation and deploymentFull integration with Terminal-Bench 2.Harbor was used internally to run tens of thousands of rollouts during the creation of the new benchmark. It is now publicly available via harborframework.com, with documentation for testing and submitting agents to the public leaderboard.Early Results: GPT-5 Leads in Task SuccessInitial results from the Terminal-Bench 2.0 leaderboard show OpenAI&#x27;s Codex CLI (command line interface), a GPT-5 powered variant, in the lead, with a 49.6% success rate — the highest among all agents tested so far. Close behind are other GPT-5 variants and Claude Sonnet 4.5-based agents.Top 5 Agent Results (Terminal-Bench 2.0):Codex CLI (GPT-5) — 49.6%Codex CLI (GPT-5-Codex) — 44.3%OpenHands (GPT-5) — 43.8%Terminus 2 (GPT-5-Codex) — 43.4%Terminus 2 (Claude Sonnet 4.5) — 42.8%The close clustering among top models indicates active competition across platforms, with no single agent solving more than half the tasks.Submission and UseTo test or submit an agent, users install Harbor and run the benchmark using simple CLI commands. Submissions to the leaderboard require five benchmark runs, and results can be emailed to the developers along with job directories for validation.harbor run -d terminal-bench@2.0 -m \"<model>\" -a \"<agent>\" --n-attempts 5 --jobs-dir <path/to/output>Terminal-Bench 2.0 is already being integrated into research workflows focused on agentic reasoning, code generation, and tool use. According to co-creator Mike Merrill, a postdoctoral researcher at Stanford, a detailed preprint is in progress covering the verification process and design methodology behind the benchmark.Aiming for StandardizationThe combined release of Terminal-Bench 2.0 and Harbor marks a step toward more consistent and scalable agent evaluation infrastructure. As LLM agents proliferate in developer and operational environments, the need for controlled, reproducible testing has grown.These tools offer a potential foundation for a unified evaluation stack — supporting model improvement, environment simulation, and benchmark standardization across the AI ecosystem.",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/3YRfPQFGsSiFX8rossiNKz/8696ac6b503ac581d02306acc60e62e5/cfr0z3n_intricate_detailed_graphic_novel_two-tone_artwork_sceni_79cceaf2-7024-4d08-9591-c7998cfebd19.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/headphones/bowers--wilkins-px8-s2-review-headphone-extravagance-193000794.html",
          "published_at": "Fri, 07 Nov 2025 19:30:00 +0000",
          "title": "Bowers & Wilkins Px8 S2 review: Headphone extravagance",
          "standfirst": "There’s a fine line between luxurious and ludicrous. When you’re talking about a pair of $799 headphones, that line begins to blur. Bowers & Wilkins has been on an excellent run of form over the past few years, consistently offering some of the best sound quality you’ll find on any headphones. It doesn’t load its models down with features — sometimes it could use a few more — but there’s always a great blend of design, audio performance and capable active noise cancellation (ANC) that make for well-rounded products. And then there’s the Px8 S2. At $799, it’s $100 more expensive than its predecessor (the Px8) was at launch, which puts them even further out of reach for most. Bowers & Wilkins did change up its familiar design slightly, and there’s a big improvement to audio performance, the addition of high-res music over USB-C and improved call quality. There’s no doubt the Px8 S2 is beyond premium, but did the company go too far? What’s new on the Px8 S2? After several generations of the Px7 and Px8 that had pretty much the same design, Bowers & Wilkins changed things up a bit with the Px8 S2. There isn't a comprehensive redesign here, but the slimmer ear cup silhouette and the exposed cabling on the headband yokes are notable improvements to the overall look. Once again, the company opted for a mix of soft leather and die-cast aluminum, both of which give the Px8 S2 a decidedly high-end aesthetic. Inside, new 40mm carbon cone dynamic drivers were updated with a new chassis and motor. Those components are powered by 24-bit DSP (digital signal processing) with a dedicated amplifier and digital-to-analog converter (DAC). There’s also a more robust five-band EQ with True Sound bypass, which allows you to disable any equalizer tweaks to quickly return to Bowers & Wilkins’ stock tuning. The company added aptX Lossless support on top of the existing aptX Adaptive availability, and you can get “true” lossless — 24-bit/96kHz — sound quality over USB-C. Compared to the previous model, the Px8 S2 has two more microphones, bringing the total to eight. Six of those are used for external monitoring for ANC while two keep tabs on noise inside the headphones. All eight are used during calls, in addition to an upgraded “pure voice” algorithm to improve performance there. You can also hear yourself better in transparency mode, which is the biggest boost to calls. What’s still good on the Px8 S2? The Px8 S2 has some subtle, but welcome design changes. Billy Steele for Engadget Bowers & Wilkins has excelled at crafting a warm, inviting and immersive sound profile across its headphones for a while now. That’s still the case on the Px8 S2 as the audio quality is rich and detailed, with a wide soundstage that envelops you — almost to the point of bombarding your ears. While I don’t think the bass tuning is well-suited for mellow genres, there’s plenty to like here. On albums like Jason Isbell’s Foxes in the Snow, for example, the amount of texture and subtle nuance where the only instruments are the singer’s voice and a single acoustic guitar is incredible. Reliable battery life has been a strong point for the company in the past, and that remains true on the Px8 S2. The 30-hour battery figure (ANC on) is the same as the previous model, and I was able to easily achieve that longevity during my testing. With a mix of active noise cancellation, high-res tunes and transparency mode for work calls, the headphones easily kept up with Bowers & Wilkins’ promised numbers. What’s not so good about the Px8 S2? The Px8 S2's controls are tiny buttons in awkward locations. Billy Steele for Engadget The biggest knock against the Px8 S2 is the price. These headphones are way more expensive than what most companies charge for their top-of-the-line models, which is around $500 these days. Sure, $799 is only $50 more than the tariff-adjusted rate for the Px8 (which was originally $699), and there are several upgrades here, but that price will be prohibitively expensive for many, thus making the S2 harder to recommend despite their strengths. Even with the upgraded sound, I feel like Bowers & Wilkins may have gone too far with the bass tuning. There is some absolutely booming low-end tone on display here, especially for bass-heavy genres like rock, metal, EDM and hip-hop. On Spiritbox’s “Perfect Soul,” as one example, the kick drum edges dangerously close to drowning out the lead and bass guitars. A bit more restraint here would’ve provided ample thump and depth that isn’t almost exhausting to listen to. At times, the enhanced bass is great, but at others, like on Ruston Kelly’s Pale, Through the Window, it can really be too much for the style of music. On its recent headphones, Bowers & Wilkins relocated the physical controls from sitting on the edge of their ear cups to a ridge on the outside. In the process, the company also made the buttons much smaller. As I said when I reviewed the Px7 S3, this makes the controls harder to find with your thumbs, and you also have to be more accurate with your presses. That’s especially true for the three-button array on the right side that handles volume changes and playback controls. Like it did with its previous headphone models, Bowers & Wilkins hasn’t packed the Px8 S2’s spec sheet with advanced features. You do get a couple of basic items — multipoint Bluetooth and wear detection/automatic pausing — but things like speech recognition, hands-free assistants or automatic sound profiles aren’t here. This is an area where the likes of Sony, Bose and Sennheiser surpass Bowers & Wilkins, even though products like the Px8 S2 typically offer superior sound quality. Wrap-up The Px8 S2 offers a few notable upgrades over the Px8. Billy Steele for Engadget So how well does Bowers & Wilkins straddle that line between luxury and ludicrousness? I’d say the Px8 S2 is a luxurious set of headphones with a ludicrous price. I fully understand that Bowers & Wilkins is a high-end audio brand and that its products typically demand a premium over most of the competition. But like I already said, the price puts these excellent headphones out of reach. When you consider the price tag alongside the lack of advanced features, the Px8 S2 becomes hard to recommend. But for those who can afford them, a tantalizing symphony of sound awaits.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/bowers--wilkins-px8-s2-review-headphone-extravagance-193000794.html?src=rss",
          "content": "There’s a fine line between luxurious and ludicrous. When you’re talking about a pair of $799 headphones, that line begins to blur. Bowers & Wilkins has been on an excellent run of form over the past few years, consistently offering some of the best sound quality you’ll find on any headphones. It doesn’t load its models down with features — sometimes it could use a few more — but there’s always a great blend of design, audio performance and capable active noise cancellation (ANC) that make for well-rounded products. And then there’s the Px8 S2. At $799, it’s $100 more expensive than its predecessor (the Px8) was at launch, which puts them even further out of reach for most. Bowers & Wilkins did change up its familiar design slightly, and there’s a big improvement to audio performance, the addition of high-res music over USB-C and improved call quality. There’s no doubt the Px8 S2 is beyond premium, but did the company go too far? What’s new on the Px8 S2? After several generations of the Px7 and Px8 that had pretty much the same design, Bowers & Wilkins changed things up a bit with the Px8 S2. There isn't a comprehensive redesign here, but the slimmer ear cup silhouette and the exposed cabling on the headband yokes are notable improvements to the overall look. Once again, the company opted for a mix of soft leather and die-cast aluminum, both of which give the Px8 S2 a decidedly high-end aesthetic. Inside, new 40mm carbon cone dynamic drivers were updated with a new chassis and motor. Those components are powered by 24-bit DSP (digital signal processing) with a dedicated amplifier and digital-to-analog converter (DAC). There’s also a more robust five-band EQ with True Sound bypass, which allows you to disable any equalizer tweaks to quickly return to Bowers & Wilkins’ stock tuning. The company added aptX Lossless support on top of the existing aptX Adaptive availability, and you can get “true” lossless — 24-bit/96kHz — sound quality over USB-C. Compared to the previous model, the Px8 S2 has two more microphones, bringing the total to eight. Six of those are used for external monitoring for ANC while two keep tabs on noise inside the headphones. All eight are used during calls, in addition to an upgraded “pure voice” algorithm to improve performance there. You can also hear yourself better in transparency mode, which is the biggest boost to calls. What’s still good on the Px8 S2? The Px8 S2 has some subtle, but welcome design changes. Billy Steele for Engadget Bowers & Wilkins has excelled at crafting a warm, inviting and immersive sound profile across its headphones for a while now. That’s still the case on the Px8 S2 as the audio quality is rich and detailed, with a wide soundstage that envelops you — almost to the point of bombarding your ears. While I don’t think the bass tuning is well-suited for mellow genres, there’s plenty to like here. On albums like Jason Isbell’s Foxes in the Snow, for example, the amount of texture and subtle nuance where the only instruments are the singer’s voice and a single acoustic guitar is incredible. Reliable battery life has been a strong point for the company in the past, and that remains true on the Px8 S2. The 30-hour battery figure (ANC on) is the same as the previous model, and I was able to easily achieve that longevity during my testing. With a mix of active noise cancellation, high-res tunes and transparency mode for work calls, the headphones easily kept up with Bowers & Wilkins’ promised numbers. What’s not so good about the Px8 S2? The Px8 S2's controls are tiny buttons in awkward locations. Billy Steele for Engadget The biggest knock against the Px8 S2 is the price. These headphones are way more expensive than what most companies charge for their top-of-the-line models, which is around $500 these days. Sure, $799 is only $50 more than the tariff-adjusted rate for the Px8 (which was originally $699), and there are several upgrades here, but that price will be prohibitively expensive for many, thus making the S2 harder to recommend despite their strengths. Even with the upgraded sound, I feel like Bowers & Wilkins may have gone too far with the bass tuning. There is some absolutely booming low-end tone on display here, especially for bass-heavy genres like rock, metal, EDM and hip-hop. On Spiritbox’s “Perfect Soul,” as one example, the kick drum edges dangerously close to drowning out the lead and bass guitars. A bit more restraint here would’ve provided ample thump and depth that isn’t almost exhausting to listen to. At times, the enhanced bass is great, but at others, like on Ruston Kelly’s Pale, Through the Window, it can really be too much for the style of music. On its recent headphones, Bowers & Wilkins relocated the physical controls from sitting on the edge of their ear cups to a ridge on the outside. In the process, the company also made the buttons much smaller. As I said when I reviewed the Px7 S3, this makes the controls harder to find with your thumbs, and you also have to be more accurate with your presses. That’s especially true for the three-button array on the right side that handles volume changes and playback controls. Like it did with its previous headphone models, Bowers & Wilkins hasn’t packed the Px8 S2’s spec sheet with advanced features. You do get a couple of basic items — multipoint Bluetooth and wear detection/automatic pausing — but things like speech recognition, hands-free assistants or automatic sound profiles aren’t here. This is an area where the likes of Sony, Bose and Sennheiser surpass Bowers & Wilkins, even though products like the Px8 S2 typically offer superior sound quality. Wrap-up The Px8 S2 offers a few notable upgrades over the Px8. Billy Steele for Engadget So how well does Bowers & Wilkins straddle that line between luxury and ludicrousness? I’d say the Px8 S2 is a luxurious set of headphones with a ludicrous price. I fully understand that Bowers & Wilkins is a high-end audio brand and that its products typically demand a premium over most of the competition. But like I already said, the price puts these excellent headphones out of reach. When you consider the price tag alongside the lack of advanced features, the Px8 S2 becomes hard to recommend. But for those who can afford them, a tantalizing symphony of sound awaits.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/bowers--wilkins-px8-s2-review-headphone-extravagance-193000794.html?src=rss",
          "feed_position": 17,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/DSC_5582.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/todays-best-ipad-deals-include-100-off-the-ipad-mini-150020786.html",
          "published_at": "Fri, 07 Nov 2025 17:30:35 +0000",
          "title": "Today's best iPad deals include $100 off the iPad mini",
          "standfirst": "We generally think Apple’s iPads are the best tablets for most people, but they don’t come cheap. To help those looking to grab one today get the most value possible, we’re keeping an eye on sale prices and rounding up the best iPad deals we can find each week.This week’s selection includes the return of a $100 price drop for the iPad mini, along with a $50 discount for the entry-level iPad and early discounts on the recently updated iPad Pro. Beyond tablets, the MacBook Air, Apple Watch SE 3 and Apple Watch Ultra 3 have all dropped to new all-time lows, while a four-pack of AirTags is also steeply discounted at $65. It’s worth remembering that official Black Friday sales are just around the corner, so we expect to see more deals in the days and weeks ahead. But if you can’t hold out a little longer, here are all the top deals on Apple gear that we could find this week. Best iPad deals Apple iPad (A16) for $299 ($50 off): The entry-level iPad comes with a faster A16 chip, 2GB more RAM and 128GB of storage by default. It earned a score of 84 in our review — if you only need a tablet for roaming the internet, watching shows and doing some lighter productivity tasks, it should do the job. With the new iPadOS 26 update, it also has most of the same multitasking features available with the more expensive models. We've seen this price for much of the past several months — it's $20 above the tablet's all-time low, but it's still a bit cheaper than buying direct from Apple. Also at Walmart, Best Buy and Target. Apple iPad Pro (11-inch, M5) for $945 ($54 off): Apple's newest iPad only came out less than a month ago, but it's already $50 or so off at various retailers. At Amazon, the base model with an M5 chip and 256GB of storage is down to a slightly less pricey $945. We gave this iPad Pro a score of 85 in our review. It has a class-leading OLED display and an impressively thin design, while the new M5 chip is more than powerful enough to do just about anything you'd want to do with an iPad. It's the only Apple tablet to support fast charging, too. That said, it's still far more iPad than casual buyers ever need, so it's best suited for hardcore iPad users and those with cash to burn. Also at Best Buy and B&H for $949. Apple iPad Pro (13-inch, M5) for $1,247 ($52 off): The 13-inch iPad Pro is virtually the same as the 11-inch version, only it's bigger. It's also more expensive, but the extra screen space might be worth it if you're committed to using the Pro as your main computer. Amazon isn't listing this as a discount, but rest assured it's still about $50 off Apple's MSRP. Again, given that these tablets were just launched, any sort of price drop is worth noting. Also at Best Buy and B&H for $1,249. Best Apple deals Apple MacBook Air (13-inch, M4) for $750 ($250 off): Apple's latest MacBook Air is the top pick in our guide to the best laptops, and it earned a score of 92 in our review. It's not a major overhaul, but the design is still exceptionally thin, light and well-built, with long battery life and a top-notch keyboard and trackpad. Now it's a bit faster. (Though we'd still love more ports and a refresh rate higher than 60Hz.) This is a new all-time low for the base model with 16GB of RAM and a 256GB SSD, but higher-end configurations are also $250 off. Apple MacBook Air (15-inch, M4) for $950 ($250 off): The 15-inch MacBook Air is nearly identical to the smaller version; apart from its roomier display, it adds better speakers and a more spacious trackpad. This deal marks another all-time low, and other configs are similarly discounted. Also at Walmart. Apple Watch SE 3 (40mm, GPS) for $199 ($50 off): This is the first major discount we've seen for the third-gen version of Apple's entry-level smartwatch, which was released in September. The big upgrade here is the always-on display, which means you no longer have to wake the watch to check the time or your notifications. (This tech was previously limited to the more expensive Apple Watch models.) The watch now runs on the same S10 chip as its higher-end siblings as well, plus it still covers the essential health and fitness features. If you’re in the market for your first smartwatch, or if you only want a watch for step counting, sleep tracking and notifications, it's a strong value. Just note that this deal only applies to the Starlight finish as of this writing. Apple Watch Series 10 (42mm, GPS) for $280 ($119 off): As a general rule, most people should buy the newest version of whatever Apple product they want. That said, the new Apple Watch Series 11 is only a minor upgrade over the Series 10: The battery lasts a little longer, the glass is more scratch-resistant, the cellular model has 5G support and that’s about it. If you’re mostly worried about saving cash and still need the more advanced health features the SE lacks — such as an ECG app and hypertension alerts — this is the best discount we've seen for last year’s model. Apple Watch Ultra 3 (49mm) for $700 ($100 off): The Ultra 3 is a much more niche device than Apple's other wearables, aimed at serious athletes and adventurers more than the typical gym-goer. It's the biggest and most rugged Apple Watch, with the brightest display (up to 3,000 nits), longest battery life (up to 42 hours) and most advanced components. It also supports satellite communications. This discount doesn't make it cheap by any means, but it does represent a new low. Apple Mac mini (M4) for $499 ($100 off): The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard (finally), two front-facing USB-C ports, an extra Thunderbolt 4 port and the ability to drive three external displays. It doesn't have any USB-A ports, however. We gave the M4 Pro model a review score of 90. This deal is for the entry-level version with a base M4 chip, 16GB of RAM and a 256GB SSD — we’ve seen it fall as low as $469 before, but this is still a decent savings. Also at Best Buy, Walmart and B&H. Apple Pencil Pro for $99 ($30 off): The top-end option in Apple’s confusing stylus lineup, the Pencil Pro supports pressure sensitivity, wireless charging, tilt detection, haptic feedback and Apple’s double tap and squeeze gestures, among other perks. It’s a lovely tool for more intricate sketching and note-taking, but the catch is that it’s only compatible with the M4 iPad Pro, M2 and M3 iPad Air and most recent iPad mini. We've seen this deal fairly often over the course of the year, but it's a fine discount compared to buying from Apple directly. Also at Best Buy, Walmart and Target. Read more Apple coverage: The best AirPods The best Apple Watches The best MacBooks The best iPhones The best iPads Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/todays-best-ipad-deals-include-100-off-the-ipad-mini-150020786.html?src=rss",
          "content": "We generally think Apple’s iPads are the best tablets for most people, but they don’t come cheap. To help those looking to grab one today get the most value possible, we’re keeping an eye on sale prices and rounding up the best iPad deals we can find each week.This week’s selection includes the return of a $100 price drop for the iPad mini, along with a $50 discount for the entry-level iPad and early discounts on the recently updated iPad Pro. Beyond tablets, the MacBook Air, Apple Watch SE 3 and Apple Watch Ultra 3 have all dropped to new all-time lows, while a four-pack of AirTags is also steeply discounted at $65. It’s worth remembering that official Black Friday sales are just around the corner, so we expect to see more deals in the days and weeks ahead. But if you can’t hold out a little longer, here are all the top deals on Apple gear that we could find this week. Best iPad deals Apple iPad (A16) for $299 ($50 off): The entry-level iPad comes with a faster A16 chip, 2GB more RAM and 128GB of storage by default. It earned a score of 84 in our review — if you only need a tablet for roaming the internet, watching shows and doing some lighter productivity tasks, it should do the job. With the new iPadOS 26 update, it also has most of the same multitasking features available with the more expensive models. We've seen this price for much of the past several months — it's $20 above the tablet's all-time low, but it's still a bit cheaper than buying direct from Apple. Also at Walmart, Best Buy and Target. Apple iPad Pro (11-inch, M5) for $945 ($54 off): Apple's newest iPad only came out less than a month ago, but it's already $50 or so off at various retailers. At Amazon, the base model with an M5 chip and 256GB of storage is down to a slightly less pricey $945. We gave this iPad Pro a score of 85 in our review. It has a class-leading OLED display and an impressively thin design, while the new M5 chip is more than powerful enough to do just about anything you'd want to do with an iPad. It's the only Apple tablet to support fast charging, too. That said, it's still far more iPad than casual buyers ever need, so it's best suited for hardcore iPad users and those with cash to burn. Also at Best Buy and B&H for $949. Apple iPad Pro (13-inch, M5) for $1,247 ($52 off): The 13-inch iPad Pro is virtually the same as the 11-inch version, only it's bigger. It's also more expensive, but the extra screen space might be worth it if you're committed to using the Pro as your main computer. Amazon isn't listing this as a discount, but rest assured it's still about $50 off Apple's MSRP. Again, given that these tablets were just launched, any sort of price drop is worth noting. Also at Best Buy and B&H for $1,249. Best Apple deals Apple MacBook Air (13-inch, M4) for $750 ($250 off): Apple's latest MacBook Air is the top pick in our guide to the best laptops, and it earned a score of 92 in our review. It's not a major overhaul, but the design is still exceptionally thin, light and well-built, with long battery life and a top-notch keyboard and trackpad. Now it's a bit faster. (Though we'd still love more ports and a refresh rate higher than 60Hz.) This is a new all-time low for the base model with 16GB of RAM and a 256GB SSD, but higher-end configurations are also $250 off. Apple MacBook Air (15-inch, M4) for $950 ($250 off): The 15-inch MacBook Air is nearly identical to the smaller version; apart from its roomier display, it adds better speakers and a more spacious trackpad. This deal marks another all-time low, and other configs are similarly discounted. Also at Walmart. Apple Watch SE 3 (40mm, GPS) for $199 ($50 off): This is the first major discount we've seen for the third-gen version of Apple's entry-level smartwatch, which was released in September. The big upgrade here is the always-on display, which means you no longer have to wake the watch to check the time or your notifications. (This tech was previously limited to the more expensive Apple Watch models.) The watch now runs on the same S10 chip as its higher-end siblings as well, plus it still covers the essential health and fitness features. If you’re in the market for your first smartwatch, or if you only want a watch for step counting, sleep tracking and notifications, it's a strong value. Just note that this deal only applies to the Starlight finish as of this writing. Apple Watch Series 10 (42mm, GPS) for $280 ($119 off): As a general rule, most people should buy the newest version of whatever Apple product they want. That said, the new Apple Watch Series 11 is only a minor upgrade over the Series 10: The battery lasts a little longer, the glass is more scratch-resistant, the cellular model has 5G support and that’s about it. If you’re mostly worried about saving cash and still need the more advanced health features the SE lacks — such as an ECG app and hypertension alerts — this is the best discount we've seen for last year’s model. Apple Watch Ultra 3 (49mm) for $700 ($100 off): The Ultra 3 is a much more niche device than Apple's other wearables, aimed at serious athletes and adventurers more than the typical gym-goer. It's the biggest and most rugged Apple Watch, with the brightest display (up to 3,000 nits), longest battery life (up to 42 hours) and most advanced components. It also supports satellite communications. This discount doesn't make it cheap by any means, but it does represent a new low. Apple Mac mini (M4) for $499 ($100 off): The newest version of Apple’s tiny desktop PC has a smaller overall footprint, a faster M4 chip, 16GB of RAM as standard (finally), two front-facing USB-C ports, an extra Thunderbolt 4 port and the ability to drive three external displays. It doesn't have any USB-A ports, however. We gave the M4 Pro model a review score of 90. This deal is for the entry-level version with a base M4 chip, 16GB of RAM and a 256GB SSD — we’ve seen it fall as low as $469 before, but this is still a decent savings. Also at Best Buy, Walmart and B&H. Apple Pencil Pro for $99 ($30 off): The top-end option in Apple’s confusing stylus lineup, the Pencil Pro supports pressure sensitivity, wireless charging, tilt detection, haptic feedback and Apple’s double tap and squeeze gestures, among other perks. It’s a lovely tool for more intricate sketching and note-taking, but the catch is that it’s only compatible with the M4 iPad Pro, M2 and M3 iPad Air and most recent iPad mini. We've seen this deal fairly often over the course of the year, but it's a fine discount compared to buying from Apple directly. Also at Best Buy, Walmart and Target. Read more Apple coverage: The best AirPods The best Apple Watches The best MacBooks The best iPhones The best iPads Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/todays-best-ipad-deals-include-100-off-the-ipad-mini-150020786.html?src=rss",
          "feed_position": 20
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/proton-vpn-deal-two-year-plans-are-75-percent-off-ahead-of-black-friday-153737110.html",
          "published_at": "Fri, 07 Nov 2025 17:01:26 +0000",
          "title": "Proton VPN deal: Two-year plans are 75 percent off ahead of Black Friday",
          "standfirst": "A VPN subscription can make for a good holiday gift. Everyone could do with having a VPN to help protect their online activity from prying eyes (and, perhaps, access more things to watch from their favorite streaming services). It's something useful that a gift recipient may have never realized they needed. Of course, you may be looking for a great deal on a VPN yourself, and the Black Friday discount for Proton VPN is nothing to sniff at. You can get two years of access to the VPN Plus tier of the service for $59.76, which works out to $2.49 per month. That's a discount of 75 percent compared with the regular price of $10 per month. Overall, you'd save $180. Proton VPN is our pick for the best VPN overall because it checks all of the boxes it needs to. There is a free plan with unlimited data, but with that you can only connect to servers in a few countries and the connection might not be fast enough for you to watch anything from your preferred streaming service's library in that locale. The VPN Plus tier unlocks a lot more options, such as the ability to connect to 15,000 servers across more than 120 countries and simultaneous protection for up to 15 devices. The apps are well-designed — Proton has clients for Windows, Mac, iOS and Android — and it's easy to find a feature or setting you're looking for. In our testing, Proton VPN Plus had a relatively small impact on browsing speeds. Our download speeds dropped by 12 percent and uploads by 4 percent, while the global average ping remained below 300 ms (which is especially impressive if you're connecting to a server on the other side of the planet). Perhaps, most importantly, though, it's Proton's commitment to privacy that helps make its VPN an easy recommendation. There's a no-logs policy, meaning it does not log user activity or any identifiable characteristics of devices that connect to the VPN. Proton's servers use full-disk encryption to bolster privacy as well.This article originally appeared on Engadget at https://www.engadget.com/deals/proton-vpn-deal-two-year-plans-are-75-percent-off-ahead-of-black-friday-153737110.html?src=rss",
          "content": "A VPN subscription can make for a good holiday gift. Everyone could do with having a VPN to help protect their online activity from prying eyes (and, perhaps, access more things to watch from their favorite streaming services). It's something useful that a gift recipient may have never realized they needed. Of course, you may be looking for a great deal on a VPN yourself, and the Black Friday discount for Proton VPN is nothing to sniff at. You can get two years of access to the VPN Plus tier of the service for $59.76, which works out to $2.49 per month. That's a discount of 75 percent compared with the regular price of $10 per month. Overall, you'd save $180. Proton VPN is our pick for the best VPN overall because it checks all of the boxes it needs to. There is a free plan with unlimited data, but with that you can only connect to servers in a few countries and the connection might not be fast enough for you to watch anything from your preferred streaming service's library in that locale. The VPN Plus tier unlocks a lot more options, such as the ability to connect to 15,000 servers across more than 120 countries and simultaneous protection for up to 15 devices. The apps are well-designed — Proton has clients for Windows, Mac, iOS and Android — and it's easy to find a feature or setting you're looking for. In our testing, Proton VPN Plus had a relatively small impact on browsing speeds. Our download speeds dropped by 12 percent and uploads by 4 percent, while the global average ping remained below 300 ms (which is especially impressive if you're connecting to a server on the other side of the planet). Perhaps, most importantly, though, it's Proton's commitment to privacy that helps make its VPN an easy recommendation. There's a no-logs policy, meaning it does not log user activity or any identifiable characteristics of devices that connect to the VPN. Proton's servers use full-disk encryption to bolster privacy as well.This article originally appeared on Engadget at https://www.engadget.com/deals/proton-vpn-deal-two-year-plans-are-75-percent-off-ahead-of-black-friday-153737110.html?src=rss",
          "feed_position": 22
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/the-apple-watch-se-3-is-cheaper-than-ever-ahead-of-black-friday-133057960.html",
          "published_at": "Fri, 07 Nov 2025 15:16:25 +0000",
          "title": "The Apple Watch SE 3 is cheaper than ever ahead of Black Friday",
          "standfirst": "Black Friday will be here before you know it, but you can already save on some sought-after tech. Case in point: the new Apple Watch SE 3. Apple's most affordable smartwatch is even cheaper right now, down to just $200. We consider this to be the best budget Apple Watch, and arguably the best smartwatch for folks who have never owned one before. The latest version runs on the same chipset found in the new flagship models, and it has most of the same fitness and workout tracking features you'll find in those more expensive devices as well. The SE 3 also now has an always-on display, making it easier to glance down throughout the day to check the time or see activity stats without moving your wrist, and fast-charging support makes it a more viable sleep tracker. Just plop it down on its charger for a bit at the end of the day and put it back on to monitor your sleep overnight. Also discounted is the high-end Apple Watch Ultra 3, which you can snag for $100 off. The sale model comes with 64GB of storage, a 49mm screen and GPS and cellular service. Notably, it's also only available with the one size, adjustable band and in two colors: a Black titanium case with Black Ocean band and a natural titanium Case with Anchor Blue Ocean band. The Apple Watch Ultra 3 came out in early September and is one of the first smartwatches to support satellite communications. This feature means you can call, send messages or share your location with emergency services through the watch — even if you don't have a connection. The new Ultra 3 also has a larger screen thanks to thinner bezels and a battery that can last for up to 42 hours. This article originally appeared on Engadget at https://www.engadget.com/deals/the-apple-watch-se-3-is-cheaper-than-ever-ahead-of-black-friday-133057960.html?src=rss",
          "content": "Black Friday will be here before you know it, but you can already save on some sought-after tech. Case in point: the new Apple Watch SE 3. Apple's most affordable smartwatch is even cheaper right now, down to just $200. We consider this to be the best budget Apple Watch, and arguably the best smartwatch for folks who have never owned one before. The latest version runs on the same chipset found in the new flagship models, and it has most of the same fitness and workout tracking features you'll find in those more expensive devices as well. The SE 3 also now has an always-on display, making it easier to glance down throughout the day to check the time or see activity stats without moving your wrist, and fast-charging support makes it a more viable sleep tracker. Just plop it down on its charger for a bit at the end of the day and put it back on to monitor your sleep overnight. Also discounted is the high-end Apple Watch Ultra 3, which you can snag for $100 off. The sale model comes with 64GB of storage, a 49mm screen and GPS and cellular service. Notably, it's also only available with the one size, adjustable band and in two colors: a Black titanium case with Black Ocean band and a natural titanium Case with Anchor Blue Ocean band. The Apple Watch Ultra 3 came out in early September and is one of the first smartwatches to support satellite communications. This feature means you can call, send messages or share your location with emergency services through the watch — even if you don't have a connection. The new Ultra 3 also has a larger screen thanks to thinner bezels and a battery that can last for up to 42 hours. This article originally appeared on Engadget at https://www.engadget.com/deals/the-apple-watch-se-3-is-cheaper-than-ever-ahead-of-black-friday-133057960.html?src=rss",
          "feed_position": 24
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/early-black-friday-deals-include-300-off-the-google-pixel-10-pro-fold-123036874.html",
          "published_at": "Fri, 07 Nov 2025 14:35:36 +0000",
          "title": "Early Black Friday deals include $300 off the Google Pixel 10 Pro Fold",
          "standfirst": "Somehow it's already November, which means gift giving season is right around the corner. While Black Friday sales can help with that, there are some great early deals running for anyone who wants to check off their list with time to spare. Take the Google Pixel 10 Pro Fold, which has only been out since late August. It's now down to $1,499 from $1,799 — a 17 percent discount. This deal is available at both Amazon and Best Buy, and seems to be the first big markdown on the Pixel 10 Pro Fold. Notably, this deal is on the 256GB model, but the 512GB and 1TB Pixel 10 Pro Folds are also $300 off. We gave the Google Pixel 10 Pro Fold an 88 in our review, thanks to its improved durability, with an IP68 rating. It also has upgraded software and multitasking, along with Pixelsnap charging. Plus, we found it has the \"best cameras of any flexible phone.\" One of our biggest gripes is the price — though this discount certainly helps. It's also quite a bulky device and can feel pretty heavy. Other Google phones are also on sale for Black Friday right now. The Pixel 10 Pro has dropped to a record low of $749, while the Pixel 10 Pro XL with a whopping 1TB of storage is also cheaper than ever at $1,249. This article originally appeared on Engadget at https://www.engadget.com/deals/early-black-friday-deals-include-300-off-the-google-pixel-10-pro-fold-123036874.html?src=rss",
          "content": "Somehow it's already November, which means gift giving season is right around the corner. While Black Friday sales can help with that, there are some great early deals running for anyone who wants to check off their list with time to spare. Take the Google Pixel 10 Pro Fold, which has only been out since late August. It's now down to $1,499 from $1,799 — a 17 percent discount. This deal is available at both Amazon and Best Buy, and seems to be the first big markdown on the Pixel 10 Pro Fold. Notably, this deal is on the 256GB model, but the 512GB and 1TB Pixel 10 Pro Folds are also $300 off. We gave the Google Pixel 10 Pro Fold an 88 in our review, thanks to its improved durability, with an IP68 rating. It also has upgraded software and multitasking, along with Pixelsnap charging. Plus, we found it has the \"best cameras of any flexible phone.\" One of our biggest gripes is the price — though this discount certainly helps. It's also quite a bulky device and can feel pretty heavy. Other Google phones are also on sale for Black Friday right now. The Pixel 10 Pro has dropped to a record low of $749, while the Pixel 10 Pro XL with a whopping 1TB of storage is also cheaper than ever at $1,249. This article originally appeared on Engadget at https://www.engadget.com/deals/early-black-friday-deals-include-300-off-the-google-pixel-10-pro-fold-123036874.html?src=rss",
          "feed_position": 26
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/ecoflow-early-black-friday-deals-get-up-to-42-percent-off-portable-power-stations-130041108.html",
          "published_at": "Fri, 07 Nov 2025 14:05:35 +0000",
          "title": "EcoFlow early Black Friday deals: Get up to 42 percent off portable power stations",
          "standfirst": "EcoFlow is hosting an early Black Friday sale on portable power stations. This drops prices by up to 42 percent on many of its well-regarded products. For instance, the Delta Pro 3 is on sale for $2,299. This is a discount of 37 percent, as the typical cost is $3,699. That's a significant drop in price. Amazon's matching the sale price as well. The Delta Pro 3 topped Yahoo's list of the best portable power stations, and for very good reason. This thing is a beast. It boasts a 4,096Wh capacity, so it can power an average 500-watt refrigerator for over 24 hours. That's with continuous use. It can be stretched out to two or three days by only running the appliance during daylight hours. There's even a discounted bundle that includes an extra battery for $3,599. It includes four standard 120V AC outlets and a single 240V outlet. It could potentially be a temporary hub of a whole-home battery backup. There are numerous charging options here, including a standard AC outlet, solar panels and, interestingly, a cigarette lighter. The only potential downside here is the Delta Pro 3 really pushes the boundaries of what can be considered portable. It weighs 113 pounds, though it does have wheels and a telescoping handle. The Delta Pro 3 is just one of the products on sale right now. The Delta Pro Ultra, which is intended as a whole-home backup, is down to $3,999. This represents a savings of more than $2,000. Another Yahoo top pick, the Delta 2 Max, is $1,000 off and down to $899. This article originally appeared on Engadget at https://www.engadget.com/deals/ecoflow-early-black-friday-deals-get-up-to-42-percent-off-portable-power-stations-130041108.html?src=rss",
          "content": "EcoFlow is hosting an early Black Friday sale on portable power stations. This drops prices by up to 42 percent on many of its well-regarded products. For instance, the Delta Pro 3 is on sale for $2,299. This is a discount of 37 percent, as the typical cost is $3,699. That's a significant drop in price. Amazon's matching the sale price as well. The Delta Pro 3 topped Yahoo's list of the best portable power stations, and for very good reason. This thing is a beast. It boasts a 4,096Wh capacity, so it can power an average 500-watt refrigerator for over 24 hours. That's with continuous use. It can be stretched out to two or three days by only running the appliance during daylight hours. There's even a discounted bundle that includes an extra battery for $3,599. It includes four standard 120V AC outlets and a single 240V outlet. It could potentially be a temporary hub of a whole-home battery backup. There are numerous charging options here, including a standard AC outlet, solar panels and, interestingly, a cigarette lighter. The only potential downside here is the Delta Pro 3 really pushes the boundaries of what can be considered portable. It weighs 113 pounds, though it does have wheels and a telescoping handle. The Delta Pro 3 is just one of the products on sale right now. The Delta Pro Ultra, which is intended as a whole-home backup, is down to $3,999. This represents a savings of more than $2,000. Another Yahoo top pick, the Delta 2 Max, is $1,000 off and down to $899. This article originally appeared on Engadget at https://www.engadget.com/deals/ecoflow-early-black-friday-deals-get-up-to-42-percent-off-portable-power-stations-130041108.html?src=rss",
          "feed_position": 29
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-430-off-this-roomba-robot-vacuum-and-mop-with-an-autowash-dock-140023379.html",
          "published_at": "Fri, 07 Nov 2025 14:00:23 +0000",
          "title": "Get $430 off this Roomba robot vacuum and mop with an AutoWash dock",
          "standfirst": "While Black Friday can be a great opportunity to score deals on your Christmas shopping, sometimes it's just a way to get the things you need at better prices. Take the iRobot Roomba Max 705 Combo Robot Vacuum & Mop, which is down to $869 from $1,300 at Wellbots. This practical purchase is available for a Black Friday discount by using the code ENGABF430 at checkout. We're big fans of iRobot, with the company making two of our favorite robot vacuums for 2025. Its Roomba Max 705 Combo offers both a vacuum and a mop to, hopefully, get out any messes this holiday season. The device also comes with an AutoWash Dock, which empties the robovac, washes the mop, dries it with heat and then charges its battery. The robot vacuum has dual rubber brushes for cleaning up any debris, while the PowerSpin roller mop gets rid of extra grime and streaks. The company uses PrecisionVision AI and ClearView Pro LiDAR to make a 3D map of all rooms and to avoid obstacles like dogs and their toys. This article originally appeared on Engadget at https://www.engadget.com/deals/get-430-off-this-roomba-robot-vacuum-and-mop-with-an-autowash-dock-140023379.html?src=rss",
          "content": "While Black Friday can be a great opportunity to score deals on your Christmas shopping, sometimes it's just a way to get the things you need at better prices. Take the iRobot Roomba Max 705 Combo Robot Vacuum & Mop, which is down to $869 from $1,300 at Wellbots. This practical purchase is available for a Black Friday discount by using the code ENGABF430 at checkout. We're big fans of iRobot, with the company making two of our favorite robot vacuums for 2025. Its Roomba Max 705 Combo offers both a vacuum and a mop to, hopefully, get out any messes this holiday season. The device also comes with an AutoWash Dock, which empties the robovac, washes the mop, dries it with heat and then charges its battery. The robot vacuum has dual rubber brushes for cleaning up any debris, while the PowerSpin roller mop gets rid of extra grime and streaks. The company uses PrecisionVision AI and ClearView Pro LiDAR to make a 3D map of all rooms and to avoid obstacles like dogs and their toys. This article originally appeared on Engadget at https://www.engadget.com/deals/get-430-off-this-roomba-robot-vacuum-and-mop-with-an-autowash-dock-140023379.html?src=rss",
          "feed_position": 30
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/this-256gb-microsd-express-card-for-the-switch-2-is-cheaper-than-ever-in-this-black-friday-deal-151331707.html",
          "published_at": "Fri, 07 Nov 2025 13:30:35 +0000",
          "title": "This 256GB microSD Express card for the Switch 2 is cheaper than ever in this Black Friday deal",
          "standfirst": "The SanDisk 256GB microSD Express Card for the Switch 2 is down to $60 via Amazon, which is a record-low price. This model is also available in storage sizes of 128GB and 512GB, but neither version is on sale. This particular model easily made our list of the best microSD cards for the Nintendo Switch 2. It even made our list of the best Switch 2 accessories. It just gets the job done. We loved the speed on offer here. It was the fastest of all the cards we tested when transferring games and loading games. We also found that it performed admirably at just about every test we threw at it. The card was always consistently right near the top, thanks to outstanding sequential read and write performance. This was backed up by benchmark testing with PC tools like CrystalDiskMark. The Switch 2 only works with SD Express cards, so this covers that. Luckily, this card isn't just for Nintendo's latest console. It'll work with just about everything, if you ever find it outstays its usefulness as a storage container for Mario and friends. Elsewhere when it comes to microSD Express cards on sale: PNY's 128GB card is down to $40. This article originally appeared on Engadget at https://www.engadget.com/deals/this-256gb-microsd-express-card-for-the-switch-2-is-cheaper-than-ever-in-this-black-friday-deal-151331707.html?src=rss",
          "content": "The SanDisk 256GB microSD Express Card for the Switch 2 is down to $60 via Amazon, which is a record-low price. This model is also available in storage sizes of 128GB and 512GB, but neither version is on sale. This particular model easily made our list of the best microSD cards for the Nintendo Switch 2. It even made our list of the best Switch 2 accessories. It just gets the job done. We loved the speed on offer here. It was the fastest of all the cards we tested when transferring games and loading games. We also found that it performed admirably at just about every test we threw at it. The card was always consistently right near the top, thanks to outstanding sequential read and write performance. This was backed up by benchmark testing with PC tools like CrystalDiskMark. The Switch 2 only works with SD Express cards, so this covers that. Luckily, this card isn't just for Nintendo's latest console. It'll work with just about everything, if you ever find it outstays its usefulness as a storage container for Mario and friends. Elsewhere when it comes to microSD Express cards on sale: PNY's 128GB card is down to $40. This article originally appeared on Engadget at https://www.engadget.com/deals/this-256gb-microsd-express-card-for-the-switch-2-is-cheaper-than-ever-in-this-black-friday-deal-151331707.html?src=rss",
          "feed_position": 31
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/apples-macbook-air-m4-drops-to-a-new-record-low-price-ahead-of-black-friday-183808440.html",
          "published_at": "Fri, 07 Nov 2025 13:19:15 +0000",
          "title": "Apple's MacBook Air M4 drops to a new record-low price ahead of Black Friday",
          "standfirst": "The Apple MacBook Air M4 laptop has long hovered at $799 at Amazon — a full $200 below its Apple Store price. But it just dropped down to $749, which is the lowest price we've seen since this model was introduced in March. This sale is for the model with 16GB of RAM and 256GB of internal storage, across all four colorways, but the 512GB model is also down to $949 — another all-time low versus the Apple Store price of $1,199. We ranked this as our favorite Apple laptop in our list of the best MacBook computers. Heck, it's even our very favorite laptop. Full stop. The performance is exceptionally snappy, thanks to the M4 chip. We appreciated the upgraded battery life, which now lasts for around 18 hours per charge. That's well beyond a full day of work. The design is lightweight, but sturdy. This has become a hallmark for modern MacBook Air computers. The screen is both gorgeous and roomy, even though it's technically just a 13-inch panel. There's support for the P3 wide color gamut and it can reach up to 500 nits of brightness. This is a near-perfect laptop, but there are a couple of nitpicks. There's no USB-C port on the right side, limiting how users can arrange accessories on a desk. Also, the screen is capped with a 60Hz refresh rate. Another potential complication is the looming specter of the M5 chip. The company has already released the MacBook Pro M5, so a new MacBook Air is likely coming in the nearish future. (Read: sometime in early 2026). If you need more screen space, you'll find a similar discount on the 15-inch MacBook Air on Amazon, too. Most color options are $250 off and down to $949 for the base model (you guessed it — another all-time low). This article originally appeared on Engadget at https://www.engadget.com/deals/apples-macbook-air-m4-drops-to-a-new-record-low-price-ahead-of-black-friday-183808440.html?src=rss",
          "content": "The Apple MacBook Air M4 laptop has long hovered at $799 at Amazon — a full $200 below its Apple Store price. But it just dropped down to $749, which is the lowest price we've seen since this model was introduced in March. This sale is for the model with 16GB of RAM and 256GB of internal storage, across all four colorways, but the 512GB model is also down to $949 — another all-time low versus the Apple Store price of $1,199. We ranked this as our favorite Apple laptop in our list of the best MacBook computers. Heck, it's even our very favorite laptop. Full stop. The performance is exceptionally snappy, thanks to the M4 chip. We appreciated the upgraded battery life, which now lasts for around 18 hours per charge. That's well beyond a full day of work. The design is lightweight, but sturdy. This has become a hallmark for modern MacBook Air computers. The screen is both gorgeous and roomy, even though it's technically just a 13-inch panel. There's support for the P3 wide color gamut and it can reach up to 500 nits of brightness. This is a near-perfect laptop, but there are a couple of nitpicks. There's no USB-C port on the right side, limiting how users can arrange accessories on a desk. Also, the screen is capped with a 60Hz refresh rate. Another potential complication is the looming specter of the M5 chip. The company has already released the MacBook Pro M5, so a new MacBook Air is likely coming in the nearish future. (Read: sometime in early 2026). If you need more screen space, you'll find a similar discount on the 15-inch MacBook Air on Amazon, too. Most color options are $250 off and down to $949 for the base model (you guessed it — another all-time low). This article originally appeared on Engadget at https://www.engadget.com/deals/apples-macbook-air-m4-drops-to-a-new-record-low-price-ahead-of-black-friday-183808440.html?src=rss",
          "feed_position": 33
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-up-to-330-off-cordless-vacuums-thanks-to-dyson-early-black-friday-deals-173533120.html",
          "published_at": "Fri, 07 Nov 2025 13:09:33 +0000",
          "title": "Get up to $330 off cordless vacuums thanks to Dyson early Black Friday deals",
          "standfirst": "Dyson is holding an early Black Friday sale on vacuums and related products. Sure, Black Friday isn't for another month, but who are we to turn down a fantastic deal? To that end, the Dyson V9 Motorbar cordless vacuum is on sale for just $270, which is a discount of $330. That's more than half off. Dyson devices are all over our list of the best cordless vacuums, and for good reason. The company makes effective products. The V9 Motorbar has been designed to clean all floor types, in addition to upholstery. It's also been engineered to squeeze into tight spots, which is great for hitting those oft-neglected parts of the home. The suction power is on point and the battery lasts for 40 minutes before requiring a charge. That's just enough time to vacuum a standard-sized home if you don't stop for too many breaks. The V9 is getting a bit long-in-the-tooth. If you want a newer model, the V11 Extra is on sale for $400, which is a discount of $260. This one boosts the suction power and increases the battery life to 60 minutes. The early Black Friday sale isn't just for cordless vacuums. The 360 Vis Nav robot vacuum is on sale right now for $500, which is a massive discount of $500. This is one of our favorite robot vacuums, primarily because of its incredible suction power. This article originally appeared on Engadget at https://www.engadget.com/deals/get-up-to-330-off-cordless-vacuums-thanks-to-dyson-early-black-friday-deals-173533120.html?src=rss",
          "content": "Dyson is holding an early Black Friday sale on vacuums and related products. Sure, Black Friday isn't for another month, but who are we to turn down a fantastic deal? To that end, the Dyson V9 Motorbar cordless vacuum is on sale for just $270, which is a discount of $330. That's more than half off. Dyson devices are all over our list of the best cordless vacuums, and for good reason. The company makes effective products. The V9 Motorbar has been designed to clean all floor types, in addition to upholstery. It's also been engineered to squeeze into tight spots, which is great for hitting those oft-neglected parts of the home. The suction power is on point and the battery lasts for 40 minutes before requiring a charge. That's just enough time to vacuum a standard-sized home if you don't stop for too many breaks. The V9 is getting a bit long-in-the-tooth. If you want a newer model, the V11 Extra is on sale for $400, which is a discount of $260. This one boosts the suction power and increases the battery life to 60 minutes. The early Black Friday sale isn't just for cordless vacuums. The 360 Vis Nav robot vacuum is on sale right now for $500, which is a massive discount of $500. This is one of our favorite robot vacuums, primarily because of its incredible suction power. This article originally appeared on Engadget at https://www.engadget.com/deals/get-up-to-330-off-cordless-vacuums-thanks-to-dyson-early-black-friday-deals-173533120.html?src=rss",
          "feed_position": 35
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/accessories/anker-laptop-power-bank-review-all-my-favorite-battery-features-together-at-last-130036854.html",
          "published_at": "Fri, 07 Nov 2025 13:00:36 +0000",
          "title": "Anker Laptop Power Bank review: All my favorite battery features together at last",
          "standfirst": "Over the past couple years, I’ve tested around 60 different power banks for Engadget. In that time, battery manufacturers have given their products features with varying degrees of usefulness, ranging from smart (straps and built-in cables) to handy (displays and wireless charging pads) to really not necessary (Bluetooth connectivity, specialized recharging bases). Anker’s Laptop Power Bank (25K, 165W) manages to combine all the cleverest new features into one sleek-looking charging brick — and it costs less than some other banks in its class. There’s a built-in display that not only lets you know how much charge the bank has left, it also tells you how many watts are flowing through each port to your devices. Pressing the button on the side cycles through the battery’s current temperature and the overall health of the bank, including how many charge cycles it’s gone through. All of those bits of info should help prolong and gauge the bank’s longevity. Big capacity in a tidy package The 25,000 mAh capacity puts it well within the TSA’s 100Wh capacity limit and I have taken this battery on two flights in my carry-on with no issue. The capacity is enough to fill my tester smartphones (an iPhone 15 and a Galaxy S23 Ultra) around four times each. Separately, it pushed my aging 16-inch MacBook Pro from 10 percent to 78 percent. That translates to around nine additional hours of use for my typical workload (Wi-Fi, VPN, too many Chrome tabs and other basic productivity apps). My only gripe with the design is that the very shiny screen has become slightly dull with use. It doesn’t look bad, just not as mint-fresh as when it was unboxed. That’s to be expected, and I’ll take the luxe finish over some ruggedized enclosure any day. Two built-in cables and a big capacity let you charge two devices at once. Amy Skorheim for Engadget Sure, forget your cables at home Possibly the power bank’s most useful features are the two built-in USB-C cables, and one even loops around to create a handy carry strap. It feels robust and well-anchored enough that I don’t fear lugging it around like that. The other cable retracts into the unit and extends up to two feet when needed. The end stays neatly tucked into a well in the body and stays magnetically in place. The cords not only look tidy, their inclusion means you’ll never find yourself in the ironic position of having a dead device and a full battery pack, but no way to connect the two. Both cables serve in-out functions so you can easily plug them into any USB-C power adapter for a refill. There are also two additional USB (one Type-A and one Type-C) ports, so if you’ve got a specialized cable, such as Lightning, smartwatch or microUSB connector, you’ll be able to charge those devices too. Admirable speeds The 165-watt rating, as with any power bank, doesn't mean you’ll get that power out of a single port. The rating is a combined, almost theoretical total, achieved with all four ports engaged. The three USB-C outlets are rated at a max of 100W, but to get to that speed, you’ll need a device capable of taking it — my biggest energy hog is my laptop and it maxed out at around 90 watts using the power bank. But for all but the most extreme cases, that’s plenty fast. My tester iPhone 15 went from near-dead to 70 percent refilled in around 40 minutes. The Galaxy S23 Ultra powered up from five to 100 percent in under an hour, and my 16-inch MacBook got a 68 percent refill in just over 50 minutes. That’s not the fastest performance I’ve tested, but it’s better than most other banks and plenty quick enough to get you back in action in a decent amount of time. Amy Skorheim for Engadget Wrap-up It’s gratifying when, after years of testing one type of product, you get one that is, more or less, an ideal example of the category. This is the battery I grab when I’m heading to get some work done at the coffee shop. I’ve taken it with me on road trips and on flights, and it hasn’t let me down once. The fact that you don’t need to remember to grab a cable takes away an extra bit of stress, and the accurate display means you know just about how much more you can squeeze out of the bank's rather sizable depths.This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/anker-laptop-power-bank-review-all-my-favorite-battery-features-together-at-last-130036854.html?src=rss",
          "content": "Over the past couple years, I’ve tested around 60 different power banks for Engadget. In that time, battery manufacturers have given their products features with varying degrees of usefulness, ranging from smart (straps and built-in cables) to handy (displays and wireless charging pads) to really not necessary (Bluetooth connectivity, specialized recharging bases). Anker’s Laptop Power Bank (25K, 165W) manages to combine all the cleverest new features into one sleek-looking charging brick — and it costs less than some other banks in its class. There’s a built-in display that not only lets you know how much charge the bank has left, it also tells you how many watts are flowing through each port to your devices. Pressing the button on the side cycles through the battery’s current temperature and the overall health of the bank, including how many charge cycles it’s gone through. All of those bits of info should help prolong and gauge the bank’s longevity. Big capacity in a tidy package The 25,000 mAh capacity puts it well within the TSA’s 100Wh capacity limit and I have taken this battery on two flights in my carry-on with no issue. The capacity is enough to fill my tester smartphones (an iPhone 15 and a Galaxy S23 Ultra) around four times each. Separately, it pushed my aging 16-inch MacBook Pro from 10 percent to 78 percent. That translates to around nine additional hours of use for my typical workload (Wi-Fi, VPN, too many Chrome tabs and other basic productivity apps). My only gripe with the design is that the very shiny screen has become slightly dull with use. It doesn’t look bad, just not as mint-fresh as when it was unboxed. That’s to be expected, and I’ll take the luxe finish over some ruggedized enclosure any day. Two built-in cables and a big capacity let you charge two devices at once. Amy Skorheim for Engadget Sure, forget your cables at home Possibly the power bank’s most useful features are the two built-in USB-C cables, and one even loops around to create a handy carry strap. It feels robust and well-anchored enough that I don’t fear lugging it around like that. The other cable retracts into the unit and extends up to two feet when needed. The end stays neatly tucked into a well in the body and stays magnetically in place. The cords not only look tidy, their inclusion means you’ll never find yourself in the ironic position of having a dead device and a full battery pack, but no way to connect the two. Both cables serve in-out functions so you can easily plug them into any USB-C power adapter for a refill. There are also two additional USB (one Type-A and one Type-C) ports, so if you’ve got a specialized cable, such as Lightning, smartwatch or microUSB connector, you’ll be able to charge those devices too. Admirable speeds The 165-watt rating, as with any power bank, doesn't mean you’ll get that power out of a single port. The rating is a combined, almost theoretical total, achieved with all four ports engaged. The three USB-C outlets are rated at a max of 100W, but to get to that speed, you’ll need a device capable of taking it — my biggest energy hog is my laptop and it maxed out at around 90 watts using the power bank. But for all but the most extreme cases, that’s plenty fast. My tester iPhone 15 went from near-dead to 70 percent refilled in around 40 minutes. The Galaxy S23 Ultra powered up from five to 100 percent in under an hour, and my 16-inch MacBook got a 68 percent refill in just over 50 minutes. That’s not the fastest performance I’ve tested, but it’s better than most other banks and plenty quick enough to get you back in action in a decent amount of time. Amy Skorheim for Engadget Wrap-up It’s gratifying when, after years of testing one type of product, you get one that is, more or less, an ideal example of the category. This is the battery I grab when I’m heading to get some work done at the coffee shop. I’ve taken it with me on road trips and on flights, and it hasn’t let me down once. The fact that you don’t need to remember to grab a cable takes away an extra bit of stress, and the accurate display means you know just about how much more you can squeeze out of the bank's rather sizable depths.This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/anker-laptop-power-bank-review-all-my-favorite-battery-features-together-at-last-130036854.html?src=rss",
          "feed_position": 36,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-11/8189ff40-bb39-11f0-9bd7-0eda66157608"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/how-to-generate-ai-images-using-chatgpt-120000560.html",
          "published_at": "Fri, 07 Nov 2025 12:00:00 +0000",
          "title": "How to generate AI images using ChatGPT",
          "standfirst": "Since March of this year, it's been possible to generate images directly within ChatGPT. Following a period where it briefly wasn't available to free users, you now don't even pay for one of OpenAI's subscriptions to use the tool. And while making images inside of ChatGPT is easy, there are some nuances worth explaining. For example, did you know you can ask ChatGPT to edit photos you've taken? It's more powerful than you might think. Here’s everything you need to know about generating AI images with ChatGPT. How to create images with ChatGPT using text prompts To begin making an image in ChatGPT, you can start by typing in the prompt bar. Igor Bonifacic for EngadgetTo begin generating images in ChatGPT, start typing in the prompt bar what you want to see. There's no need to overthink things; as long as you have some version of \"generate an image\" followed by a description of your idea, ChatGPT will do the rest. Depending on the complexity of your prompt, it may take up to two minutes for ChatGPT to complete your image request. Sometimes the process can take longer if OpenAI's servers are experiencing greater traffic than usual. How to create images with ChatGPT using existing photosYou can also upload images to ChatGPT.Igor Bonifacic for EngadgetIn addition to generating images from text prompts, ChatGPT can modify existing photos or images you upload. This is my preferred way of making images with ChatGPT; I don't need to describe the composition, I can use an existing one to guide the chatbot. To use a photo as a starting point for a new generation, follow these steps: Tap the \"+\" icon, located to the left of the prompt bar. Select Add photos & files. Select the image you want ChatGPT to edit. If uploading an image from your phone, you'll need to grant ChatGPT access to your camera roll. Write a prompt describing the changes you want. Keep in mind any photos you upload to OpenAI's servers may be used by the company to train future models. You can opt out of allowing your data to be used for training by following these steps: Open the sidebar menu. On mobile, tap the two lines on the top left of the interface. On desktop, click on the OpenAI logo.Tap your name to access account settings. Tap Data controls.Toggle off Improve the model for everyone. How to edit the images ChatGPT generatesChatGPT gives you a few different ways to modify an image to your liking. Igor Bonifacic for EngadgetIf you're unhappy with ChatGPT's output, you have two options. You can either prompt it to create an entirely new image, or edit parts of the picture it just generated. As before, you can simply write what changes you want to see in the prompt bar. OpenAI also gives users a few different shortcuts to accomplish the same task.To generate an entirely new image: On mobile, tap the two arrows icon below the image ChatGPT created. Select Try again, Add details or More concise. Alternatively, tap the image ChatGPT created and select Edit. Describe what you want ChatGPT to add, remove or replace through the prompt bar. To edit part of an existing image generation: Tap the image ChatGPT created. Tap Select. On desktop, instead click on the paintbrush icon on the top right. Use your finger to mask the section of the image you want ChatGPT to tweak. The slider on the left allows you to adjust the size of the masking brush. Describe what you want ChatGPT to add, remove or replace through the prompt bar. Like all AI systems, ChatGPT is non-deterministic, meaning even if you prompt it in the same way multiple times, it won't generate the exact same response each time. Tips to create better images with ChatGPTThe best advice I can offer is to be specific when prompting ChatGPT. The more detail you can provide when describing what you want from it, the better the results. And remember: ChatGPT can hallucinate — as you may have noticed from one of the example pictures I included above. In the image of the tortoiseshell cat, not only is the tortie not sitting on the window sill as instructed, it's sitting on a table that doesn't make much sense. So, most of all, be patient. Prompting an AI model is not exact science, and it can take a few tries before it creates the result you want. FAQsHow do you access ChatGPT?ChatGPT is available on the web, desktop and mobile. To access it on your computer, open your preferred browser and navigate to chatgpt.com. OpenAI also offers dedicated Mac and Windows apps you can download from the company's website. On iOS and Android, you'll need to download the ChatGPT app from either the App Store or Google Play before you can start using the chatbot. Since ChatGPT runs on OpenAI's servers, as long as you can access the chatbot, you'll be able to use it to create images no matter the age of your phone or computer. Can ChatGPT generate images for free? Yes, ChatGPT can generate images for free, as long as you have an OpenAI account. However, there is a daily rate cap and GPT-5 will take longer to make an image. Following March 27, 2025, OpenAI briefly limited free users to three image generations per day. The company has since relaxed that restriction, though it doesn't list a specific limit on its website. In my experience, you'll be able to generate about six to seven images every 24 hours. OpenAI's $20-per-month Plus plan offers \"expanded and faster image creation,\" while its $200-per-month Pro tier includes unlimited image generation as a perk. Can ChatGPT recreate an existing photo? No. For copyright reasons, ChatGPT can't replicate photos or exact real world events. For example, when I asked it to recreate the photo of Zinedine Zidane's iconic 2006 World Cup headbutt, ChatGPT refused. \"I can make an artistic reinterpretation inspired by the emotion or energy of that moment — for example, a stylized painting showing the tension and intensity of competition, without depicting real individuals,\" it told me. This article originally appeared on Engadget at https://www.engadget.com/ai/how-to-generate-ai-images-using-chatgpt-120000560.html?src=rss",
          "content": "Since March of this year, it's been possible to generate images directly within ChatGPT. Following a period where it briefly wasn't available to free users, you now don't even pay for one of OpenAI's subscriptions to use the tool. And while making images inside of ChatGPT is easy, there are some nuances worth explaining. For example, did you know you can ask ChatGPT to edit photos you've taken? It's more powerful than you might think. Here’s everything you need to know about generating AI images with ChatGPT. How to create images with ChatGPT using text prompts To begin making an image in ChatGPT, you can start by typing in the prompt bar. Igor Bonifacic for EngadgetTo begin generating images in ChatGPT, start typing in the prompt bar what you want to see. There's no need to overthink things; as long as you have some version of \"generate an image\" followed by a description of your idea, ChatGPT will do the rest. Depending on the complexity of your prompt, it may take up to two minutes for ChatGPT to complete your image request. Sometimes the process can take longer if OpenAI's servers are experiencing greater traffic than usual. How to create images with ChatGPT using existing photosYou can also upload images to ChatGPT.Igor Bonifacic for EngadgetIn addition to generating images from text prompts, ChatGPT can modify existing photos or images you upload. This is my preferred way of making images with ChatGPT; I don't need to describe the composition, I can use an existing one to guide the chatbot. To use a photo as a starting point for a new generation, follow these steps: Tap the \"+\" icon, located to the left of the prompt bar. Select Add photos & files. Select the image you want ChatGPT to edit. If uploading an image from your phone, you'll need to grant ChatGPT access to your camera roll. Write a prompt describing the changes you want. Keep in mind any photos you upload to OpenAI's servers may be used by the company to train future models. You can opt out of allowing your data to be used for training by following these steps: Open the sidebar menu. On mobile, tap the two lines on the top left of the interface. On desktop, click on the OpenAI logo.Tap your name to access account settings. Tap Data controls.Toggle off Improve the model for everyone. How to edit the images ChatGPT generatesChatGPT gives you a few different ways to modify an image to your liking. Igor Bonifacic for EngadgetIf you're unhappy with ChatGPT's output, you have two options. You can either prompt it to create an entirely new image, or edit parts of the picture it just generated. As before, you can simply write what changes you want to see in the prompt bar. OpenAI also gives users a few different shortcuts to accomplish the same task.To generate an entirely new image: On mobile, tap the two arrows icon below the image ChatGPT created. Select Try again, Add details or More concise. Alternatively, tap the image ChatGPT created and select Edit. Describe what you want ChatGPT to add, remove or replace through the prompt bar. To edit part of an existing image generation: Tap the image ChatGPT created. Tap Select. On desktop, instead click on the paintbrush icon on the top right. Use your finger to mask the section of the image you want ChatGPT to tweak. The slider on the left allows you to adjust the size of the masking brush. Describe what you want ChatGPT to add, remove or replace through the prompt bar. Like all AI systems, ChatGPT is non-deterministic, meaning even if you prompt it in the same way multiple times, it won't generate the exact same response each time. Tips to create better images with ChatGPTThe best advice I can offer is to be specific when prompting ChatGPT. The more detail you can provide when describing what you want from it, the better the results. And remember: ChatGPT can hallucinate — as you may have noticed from one of the example pictures I included above. In the image of the tortoiseshell cat, not only is the tortie not sitting on the window sill as instructed, it's sitting on a table that doesn't make much sense. So, most of all, be patient. Prompting an AI model is not exact science, and it can take a few tries before it creates the result you want. FAQsHow do you access ChatGPT?ChatGPT is available on the web, desktop and mobile. To access it on your computer, open your preferred browser and navigate to chatgpt.com. OpenAI also offers dedicated Mac and Windows apps you can download from the company's website. On iOS and Android, you'll need to download the ChatGPT app from either the App Store or Google Play before you can start using the chatbot. Since ChatGPT runs on OpenAI's servers, as long as you can access the chatbot, you'll be able to use it to create images no matter the age of your phone or computer. Can ChatGPT generate images for free? Yes, ChatGPT can generate images for free, as long as you have an OpenAI account. However, there is a daily rate cap and GPT-5 will take longer to make an image. Following March 27, 2025, OpenAI briefly limited free users to three image generations per day. The company has since relaxed that restriction, though it doesn't list a specific limit on its website. In my experience, you'll be able to generate about six to seven images every 24 hours. OpenAI's $20-per-month Plus plan offers \"expanded and faster image creation,\" while its $200-per-month Pro tier includes unlimited image generation as a perk. Can ChatGPT recreate an existing photo? No. For copyright reasons, ChatGPT can't replicate photos or exact real world events. For example, when I asked it to recreate the photo of Zinedine Zidane's iconic 2006 World Cup headbutt, ChatGPT refused. \"I can make an artistic reinterpretation inspired by the emotion or energy of that moment — for example, a stylized painting showing the tension and intensity of competition, without depicting real individuals,\" it told me. This article originally appeared on Engadget at https://www.engadget.com/ai/how-to-generate-ai-images-using-chatgpt-120000560.html?src=rss",
          "feed_position": 39,
          "image_url": "https://d29szjachogqwa.cloudfront.net/images/user-uploaded/chatgpt-how-to-3.jpg"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html",
          "published_at": "Fri, 07 Nov 2025 08:01:26 +0000",
          "title": "The best gaming handhelds for 2025",
          "standfirst": "Handheld gaming systems are having a moment. While people have been gaming on the go since the halcyon days of the Game Boy, recent years have brought an avalanche of devices that let you play all sorts of games anywhere you want. But new machines seem to arrive every week, and figuring out which ones are actually worth buying can be overwhelming. Depending on your tastes, the right handheld could be a $100 emulator or a $1,000 portable PC. To help you narrow things down, we’ve spent months researching the best handheld gaming consoles and testing several top contenders. Here are the ones we like the most right now.Editor’s note (11/7/25): A barrage of new mobile emulation handhelds have been announced since our last update, including two follow-ups to our current “best for most” pick (the Retroid Pocket 6 and the more marginally updated Retroid Pocket G2) and a new version of our “best overall” pick (the AYN Odin 3). Other competitors like Ayaneo’s KONKR Pocket Fit are also on the way, and there’s been a wave of new dual-screen models like the AYN Thor, Ayaneo Pocket DS and Anbernic RG DS. We think our current recommendations will still satisfy most shoppers, but since we’re still working to test most of these newer devices, we wanted to give a heads-up for anyone who wants the absolute latest. In the meantime, we’ve added testing notes on a few other emulation-focused handhelds as well as a couple new portable PCs like the ASUS ROG Xbox Ally X. Table of contents Best handheld gaming devices for 2025 What about the Nintendo Switch 2? Other gaming handhelds we've tested What to know about the gaming handheld market Best handheld gaming devices for 2025 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still limited. That’s OK — it’s only been a few months. But don’t feel like you must rush out and splash the cash today unless you have a serious case of Donkey Kong-induced FOMO. Other gaming handhelds we've tested The Lenovo Legion Go 2. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. Lenovo Legion Go 2 The Lenovo Legion Go 2 is a capable alternative to the ROG Xbox Ally X with a mondo-sized 8.8-inch display. That screen is the main reason to consider it, as it’s a vivid OLED panel that supports VRR and has a 144Hz native refresh rate. Like the Switch, it also comes with detachable controllers — one of which includes a useful touchpad for navigating Windows — plus a built-in kickstand for tabletop play. That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings. It’s also even more expensive, starting at $1,100 and rising to $1,350 for a config with the same Ryzen Z2 Extreme chip. It’s a lovely device if you’ve got cash to burn — and to be fair, none of these Windows handhelds are for anyone looking for “value” — but the Xbox Ally X is a better buy for most. The MSI Claw 8 AI+. Sam Rutherford for Engadget MSI Claw 8 AI+ The original MSI Claw was a flop, but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than last-gen models like the ROG Ally X and Lenovo Legion Go in our testing. (Another model is available with the Ryzen Z2 Extreme chip.) Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,100 after recent price hikes, it’s hard to justify over the ROG Xbox Ally X, which is already too expensive for most people. ASUS' handheld is lighter and easier to grip on top of that — though the Claw is thinner — and its overhauled Xbox UI, while far from perfect, is still easier to get around than MSI’s Center M hub. There's a smaller 7-inch version of this handheld for $900 as well, but we haven’t tested that one. The ModRetro Chromatic. Jeff Dunn for Engadget ModRetro Chromatic The ModRetro Chromatic is a competitor to the Analogue Pocket that can similarly play actual Game Boy cartridges via FPGA. With its premium metal frame, loud speaker, tight d-pad and beautifully bright 2.56-inch display, it’s an impressive modernization of Nintendo’s classic handheld. ModRetro also publishes a number of games specifically for the device, including a pretty great version of Tetris that comes bundled in the box. However, for many, its faithfulness to the original Game Boy probably goes too far: It requires three AA batteries for power, and unlike the Analogue Pocket it doesn’t support custom save states. It’s also designed for Game Boy and Game Boy Color games only; it can’t play any Game Boy Advance cartridges or games from other retro handhelds like Analogue’s device, nor does doesn’t support ROMs. For only $20 less than the Pocket, that makes it a tough sell, even if the hardware is arguably higher-quality. There’s also the lethal, autonomous elephant in the room: ModRetro is founded by Palmer Luckey, the idiosyncratic entrepreneur behind the Oculus Rift who has gone on to form Anduril Industries, a defense contractor that makes drones, surveillance systems and other AI-powered military tech. He has also espoused political views that many people — and this is the tamest way I can put this — may not be comfortable backing. We are not here to police where you can spend your money, and the Chromatic does much of what it wants to do well. Still, all of these handhelds are just so inessential, and no other option that we know of is as closely tied to an arms dealer. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,100, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is one of the more decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR, and that Ryzen chip is no longer the latest and greatest. The Kun is still a fine device in a vacuum, but the ROG Xbox Ally X is a better buy. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. The Retroid Pocket Classic. Jeff Dunn for Engadget Retroid Pocket Classic The Retroid Pocket Classic is another Game Boy-style vertical handheld in the vein of the Analogue Pocket, but like the other Retroid models we’ve highlighted, it’s an Android device designed to emulate games via ROM files, not genuine cartridges. (Naturally, it can also play native Android games.) It’s still far clunkier to set up and use as a result, and its overall design feels more toy-like than either the Pocket or ModRetro Chromatic. But its Snapdragon G1 Gen 2 chip is easily powerful enough to play any classic handheld system (along with most other retro games that don’t require joystick controls), while its 3.9-inch OLED display is superbly bright, sharp and colorful. The battery can last more than 10 hours when emulating lower-power systems, and Retroid sells a version with six face buttons instead of the standard four if you want to play older Sega Genesis and Saturn games in particular. The Analogue Pocket is still more premium and rewarding to use, but if you want a similar form factor and can live with the typical quirks that come with a device like this, the Classic is a good value at $129. Of the many Game Boy-style handhelds out there that solely rely on software emulation, it’s the one we’d recommend first. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Miyoo Mini Plus (left) and TrimUI Brick. Jeff Dunn for Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable, though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Since it’s from a smaller Chinese firm and isn’t available at major retailers, it can also be difficult to actually buy. It's a nice choice if you want something more compact than the Retroid Pocket Classic, but that model's roomier design, more vibrant OLED panel and longer battery life makes it worth the extra cash for most people. TrimUI Brick The TrimUI Brick is another low-cost vertical handheld that’s surprisingly well-built for an $80-ish device, thanks to its brushed metal backplate and impressive 3.2-inch IPS display. It has a weaker chip than the Retroid Pocket Classic, but it can still emulate older handheld games just fine, and its tiny frame makes it much easier to actually fit in a pocket. That said, while it has a sharper and more vivid screen than the Miyoo Mini Plus (its closest rival), the face buttons, d-pad and especially back buttons are all stiffer, and its stock UI feels similarly bootleg. (Some of the icons for different systems in the game library: “GomeBuy,” “Fanicon,” and “PloyStotion.”) You can fix the latter with custom firmware, but Retroid’s interface is easier to grok by default, and its setup process is less annoying. Most people interested in this class of device will be happier paying up for the Pocket Classic instead. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while its stronger chip is appreciated, it's still far behind the Retroid Pocket Classic. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP. That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud, which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller, so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to retail for $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Xbox Ally X. These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on Linux, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket. These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch. Getting emulators to work can be complicated, and accessing the BIOS and ROM files required to play games this way is legally murky. One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators, for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone. We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate: portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates November 2025: The ASUS ROG Xbox Ally X replaces the older ROG Ally X as our new favorite Windows gaming handheld. We’ve also added testing notes on the Lenovo Legion Go 2, ModRetro Chromatic and a couple of emulation-based handhelds in the Retroid Pocket Classic and TrimUI Brick. We’re working to test several other recent releases for our next update, including updated versions of the Retroid Pocket 5 and AYN Odin 2. August 2025: We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices, which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic, TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025: We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S, and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks. March 2025: We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo, a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips, among others. January 2025: We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo. August 2024: We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024: We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS. Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well.This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss",
          "content": "Handheld gaming systems are having a moment. While people have been gaming on the go since the halcyon days of the Game Boy, recent years have brought an avalanche of devices that let you play all sorts of games anywhere you want. But new machines seem to arrive every week, and figuring out which ones are actually worth buying can be overwhelming. Depending on your tastes, the right handheld could be a $100 emulator or a $1,000 portable PC. To help you narrow things down, we’ve spent months researching the best handheld gaming consoles and testing several top contenders. Here are the ones we like the most right now.Editor’s note (11/7/25): A barrage of new mobile emulation handhelds have been announced since our last update, including two follow-ups to our current “best for most” pick (the Retroid Pocket 6 and the more marginally updated Retroid Pocket G2) and a new version of our “best overall” pick (the AYN Odin 3). Other competitors like Ayaneo’s KONKR Pocket Fit are also on the way, and there’s been a wave of new dual-screen models like the AYN Thor, Ayaneo Pocket DS and Anbernic RG DS. We think our current recommendations will still satisfy most shoppers, but since we’re still working to test most of these newer devices, we wanted to give a heads-up for anyone who wants the absolute latest. In the meantime, we’ve added testing notes on a few other emulation-focused handhelds as well as a couple new portable PCs like the ASUS ROG Xbox Ally X. Table of contents Best handheld gaming devices for 2025 What about the Nintendo Switch 2? Other gaming handhelds we've tested What to know about the gaming handheld market Best handheld gaming devices for 2025 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still limited. That’s OK — it’s only been a few months. But don’t feel like you must rush out and splash the cash today unless you have a serious case of Donkey Kong-induced FOMO. Other gaming handhelds we've tested The Lenovo Legion Go 2. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. Lenovo Legion Go 2 The Lenovo Legion Go 2 is a capable alternative to the ROG Xbox Ally X with a mondo-sized 8.8-inch display. That screen is the main reason to consider it, as it’s a vivid OLED panel that supports VRR and has a 144Hz native refresh rate. Like the Switch, it also comes with detachable controllers — one of which includes a useful touchpad for navigating Windows — plus a built-in kickstand for tabletop play. That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings. It’s also even more expensive, starting at $1,100 and rising to $1,350 for a config with the same Ryzen Z2 Extreme chip. It’s a lovely device if you’ve got cash to burn — and to be fair, none of these Windows handhelds are for anyone looking for “value” — but the Xbox Ally X is a better buy for most. The MSI Claw 8 AI+. Sam Rutherford for Engadget MSI Claw 8 AI+ The original MSI Claw was a flop, but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than last-gen models like the ROG Ally X and Lenovo Legion Go in our testing. (Another model is available with the Ryzen Z2 Extreme chip.) Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,100 after recent price hikes, it’s hard to justify over the ROG Xbox Ally X, which is already too expensive for most people. ASUS' handheld is lighter and easier to grip on top of that — though the Claw is thinner — and its overhauled Xbox UI, while far from perfect, is still easier to get around than MSI’s Center M hub. There's a smaller 7-inch version of this handheld for $900 as well, but we haven’t tested that one. The ModRetro Chromatic. Jeff Dunn for Engadget ModRetro Chromatic The ModRetro Chromatic is a competitor to the Analogue Pocket that can similarly play actual Game Boy cartridges via FPGA. With its premium metal frame, loud speaker, tight d-pad and beautifully bright 2.56-inch display, it’s an impressive modernization of Nintendo’s classic handheld. ModRetro also publishes a number of games specifically for the device, including a pretty great version of Tetris that comes bundled in the box. However, for many, its faithfulness to the original Game Boy probably goes too far: It requires three AA batteries for power, and unlike the Analogue Pocket it doesn’t support custom save states. It’s also designed for Game Boy and Game Boy Color games only; it can’t play any Game Boy Advance cartridges or games from other retro handhelds like Analogue’s device, nor does doesn’t support ROMs. For only $20 less than the Pocket, that makes it a tough sell, even if the hardware is arguably higher-quality. There’s also the lethal, autonomous elephant in the room: ModRetro is founded by Palmer Luckey, the idiosyncratic entrepreneur behind the Oculus Rift who has gone on to form Anduril Industries, a defense contractor that makes drones, surveillance systems and other AI-powered military tech. He has also espoused political views that many people — and this is the tamest way I can put this — may not be comfortable backing. We are not here to police where you can spend your money, and the Chromatic does much of what it wants to do well. Still, all of these handhelds are just so inessential, and no other option that we know of is as closely tied to an arms dealer. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,100, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is one of the more decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR, and that Ryzen chip is no longer the latest and greatest. The Kun is still a fine device in a vacuum, but the ROG Xbox Ally X is a better buy. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. The Retroid Pocket Classic. Jeff Dunn for Engadget Retroid Pocket Classic The Retroid Pocket Classic is another Game Boy-style vertical handheld in the vein of the Analogue Pocket, but like the other Retroid models we’ve highlighted, it’s an Android device designed to emulate games via ROM files, not genuine cartridges. (Naturally, it can also play native Android games.) It’s still far clunkier to set up and use as a result, and its overall design feels more toy-like than either the Pocket or ModRetro Chromatic. But its Snapdragon G1 Gen 2 chip is easily powerful enough to play any classic handheld system (along with most other retro games that don’t require joystick controls), while its 3.9-inch OLED display is superbly bright, sharp and colorful. The battery can last more than 10 hours when emulating lower-power systems, and Retroid sells a version with six face buttons instead of the standard four if you want to play older Sega Genesis and Saturn games in particular. The Analogue Pocket is still more premium and rewarding to use, but if you want a similar form factor and can live with the typical quirks that come with a device like this, the Classic is a good value at $129. Of the many Game Boy-style handhelds out there that solely rely on software emulation, it’s the one we’d recommend first. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Miyoo Mini Plus (left) and TrimUI Brick. Jeff Dunn for Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable, though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Since it’s from a smaller Chinese firm and isn’t available at major retailers, it can also be difficult to actually buy. It's a nice choice if you want something more compact than the Retroid Pocket Classic, but that model's roomier design, more vibrant OLED panel and longer battery life makes it worth the extra cash for most people. TrimUI Brick The TrimUI Brick is another low-cost vertical handheld that’s surprisingly well-built for an $80-ish device, thanks to its brushed metal backplate and impressive 3.2-inch IPS display. It has a weaker chip than the Retroid Pocket Classic, but it can still emulate older handheld games just fine, and its tiny frame makes it much easier to actually fit in a pocket. That said, while it has a sharper and more vivid screen than the Miyoo Mini Plus (its closest rival), the face buttons, d-pad and especially back buttons are all stiffer, and its stock UI feels similarly bootleg. (Some of the icons for different systems in the game library: “GomeBuy,” “Fanicon,” and “PloyStotion.”) You can fix the latter with custom firmware, but Retroid’s interface is easier to grok by default, and its setup process is less annoying. Most people interested in this class of device will be happier paying up for the Pocket Classic instead. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while its stronger chip is appreciated, it's still far behind the Retroid Pocket Classic. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP. That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud, which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller, so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to retail for $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Xbox Ally X. These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on Linux, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket. These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch. Getting emulators to work can be complicated, and accessing the BIOS and ROM files required to play games this way is legally murky. One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators, for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone. We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate: portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates November 2025: The ASUS ROG Xbox Ally X replaces the older ROG Ally X as our new favorite Windows gaming handheld. We’ve also added testing notes on the Lenovo Legion Go 2, ModRetro Chromatic and a couple of emulation-based handhelds in the Retroid Pocket Classic and TrimUI Brick. We’re working to test several other recent releases for our next update, including updated versions of the Retroid Pocket 5 and AYN Odin 2. August 2025: We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices, which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic, TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025: We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S, and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks. March 2025: We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo, a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips, among others. January 2025: We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo. August 2024: We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024: We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS. Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well.This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss",
          "feed_position": 41,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-06/f88e8cd0-4638-11f0-bffd-78988bb5f8ab"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/data-infrastructure/ship-fast-optimize-later-top-ai-engineers-dont-care-about-cost-theyre",
          "published_at": "Fri, 07 Nov 2025 05:00:00 GMT",
          "title": "Ship fast, optimize later: top AI engineers don't care about cost — they're prioritizing deployment",
          "standfirst": "Across industries, rising compute expenses are often cited as a barrier to AI adoption — but leading companies are finding that cost is no longer the real constraint. The tougher challenges (and the ones top of mind for many tech leaders)? Latency, flexibility and capacity. At Wonder, for instance, AI adds a mere few cents per order; the food delivery and takeout company is much more concerned with cloud capacity with skyrocketing demands. Recursion, for its part, has been focused on balancing small and larger-scale training and deployment via on-premises clusters and the cloud; this has afforded the biotech company flexibility for rapid experimentation. The companies’ true in-the-wild experiences highlight a broader industry trend: For enterprises operating AI at scale, economics aren&#x27;t the key decisive factor — the conversation has shifted from how to pay for AI to how fast it can be deployed and sustained. AI leaders from the two companies recently sat down with Venturebeat’s CEO and editor-in-chief Matt Marshall as part of VB’s traveling AI Impact Series. Here’s what they shared. Wonder: Rethink what you assume about capacityWonder uses AI to power everything from recommendations to logistics — yet, as of now, reported CTO James Chen, AI adds just a few cents per order. Chen explained that the technology component of a meal order costs 14 cents, the AI adds 2 to 3 cents, although that’s “going up really rapidly” to 5 to 8 cents. Still, that seems almost immaterial compared to total operating costs. Instead, the 100% cloud-native AI company’s main concern has been capacity with growing demand. Wonder was built with “the assumption” (which proved to be incorrect) that there would be “unlimited capacity” so they could move “super fast” and wouldn’t have to worry about managing infrastructure, Chen noted. But the company has grown quite a bit over the last few years, he said; as a result, about six months ago, “we started getting little signals from the cloud providers, ‘Hey, you might need to consider going to region two,’” because they were running out of capacity for CPU or data storage at their facilities as demand grew. It was “very shocking” that they had to move to plan B earlier than they anticipated. “Obviously it&#x27;s good practice to be multi-region, but we were thinking maybe two more years down the road,” said Chen. What&#x27;s not economically feasible (yet)Wonder built its own model to maximize its conversion rate, Chen noted; the goal is to surface new restaurants to relevant customers as much as possible. These are “isolated scenarios” where models are trained over time to be “very, very efficient and very fast.” Currently, the best bet for Wonder’s use case is large models, Chen noted. But in the long term, they’d like to move to small models that are hyper-customized to individuals (via AI agents or concierges) based on their purchase history and even their clickstream. “Having these micro models is definitely the best, but right now the cost is very expensive,” Chen noted. “If you try to create one for each person, it&#x27;s just not economically feasible.”Budgeting is an art, not a scienceWonder gives its devs and data scientists as much playroom as possible to experiment, and internal teams review the costs of use to make sure nobody turned on a model and “jacked up massive compute around a huge bill,” said Chen. The company is trying different things to offload to AI and operate within margins. “But then it&#x27;s very hard to budget because you have no idea,” he said. One of the challenging things is the pace of development; when a new model comes out, “we can’t just sit there, right? We have to use it.” Budgeting for the unknown economics of a token-based system is “definitely art versus science.” A critical component in the software development lifecycle is preserving context when using large native models, he explained. When you find something that works, you can add it to your company’s “corpus of context” that can be sent with every request. That’s big and it costs money each time. “Over 50%, up to 80% of your costs is just resending the same information back into the same engine again on every request,” said Chen. In theory, the more they do should require less cost per unit. “I know when a transaction happens, I&#x27;ll pay the X cent tax for each one, but I don&#x27;t want to be limited to use the technology for all these other creative ideas.\"The &#x27;vindication moment&#x27; for RecursionRecursion, for its part, has focused on meeting broad-ranging compute needs via a hybrid infrastructure of on-premise clusters and cloud inference. When initially looking to build out its AI infrastructure, the company had to go with its own setup, as “the cloud providers didn&#x27;t have very many good offerings,” explained CTO Ben Mabey. “The vindication moment was that we needed more compute and we looked to the cloud providers and they were like, ‘Maybe in a year or so.’” The company’s first cluster in 2017 incorporated Nvidia gaming GPUs (1080s, launched in 2016); they have since added Nvidia H100s and A100s, and use a Kubernetes cluster that they run in the cloud or on-prem. Addressing the longevity question, Mabey noted: “These gaming GPUs are actually still being used today, which is crazy, right? The myth that a GPU&#x27;s life span is only three years, that&#x27;s definitely not the case. A100s are still top of the list, they&#x27;re the workhorse of the industry.” Best use cases on-prem vs cloud; cost differencesMore recently, Mabey’s team has been training a foundation model on Recursion’s image repository (which consists of petabytes of data and more than 200 pictures). This and other types of big training jobs have required a “massive cluster” and connected, multi-node setups. “When we need that fully-connected network and access to a lot of our data in a high parallel file system, we go on-prem,” he explained. On the other hand, shorter workloads run in the cloud. Recursion’s method is to “pre-empt” GPUs and Google tensor processing units (TPUs), which is the process of interrupting running GPU tasks to work on higher-priority ones. “Because we don&#x27;t care about the speed in some of these inference workloads where we&#x27;re uploading biological data, whether that&#x27;s an image or sequencing data, DNA data,” Mabey explained. “We can say, ‘Give this to us in an hour,’ and we&#x27;re fine if it kills the job.” From a cost perspective, moving large workloads on-prem is “conservatively” 10 times cheaper, Mabey noted; for a five year TCO, it&#x27;s half the cost. On the other hand, for smaller storage needs, the cloud can be “pretty competitive” cost-wise. Ultimately, Mabey urged tech leaders to step back and determine whether they’re truly willing to commit to AI; cost-effective solutions typically require multi-year buy-ins. “From a psychological perspective, I&#x27;ve seen peers of ours who will not invest in compute, and as a result they&#x27;re always paying on demand,\" said Mabey. \"Their teams use far less compute because they don&#x27;t want to run up the cloud bill. Innovation really gets hampered by people not wanting to burn money.”",
          "content": "Across industries, rising compute expenses are often cited as a barrier to AI adoption — but leading companies are finding that cost is no longer the real constraint. The tougher challenges (and the ones top of mind for many tech leaders)? Latency, flexibility and capacity. At Wonder, for instance, AI adds a mere few cents per order; the food delivery and takeout company is much more concerned with cloud capacity with skyrocketing demands. Recursion, for its part, has been focused on balancing small and larger-scale training and deployment via on-premises clusters and the cloud; this has afforded the biotech company flexibility for rapid experimentation. The companies’ true in-the-wild experiences highlight a broader industry trend: For enterprises operating AI at scale, economics aren&#x27;t the key decisive factor — the conversation has shifted from how to pay for AI to how fast it can be deployed and sustained. AI leaders from the two companies recently sat down with Venturebeat’s CEO and editor-in-chief Matt Marshall as part of VB’s traveling AI Impact Series. Here’s what they shared. Wonder: Rethink what you assume about capacityWonder uses AI to power everything from recommendations to logistics — yet, as of now, reported CTO James Chen, AI adds just a few cents per order. Chen explained that the technology component of a meal order costs 14 cents, the AI adds 2 to 3 cents, although that’s “going up really rapidly” to 5 to 8 cents. Still, that seems almost immaterial compared to total operating costs. Instead, the 100% cloud-native AI company’s main concern has been capacity with growing demand. Wonder was built with “the assumption” (which proved to be incorrect) that there would be “unlimited capacity” so they could move “super fast” and wouldn’t have to worry about managing infrastructure, Chen noted. But the company has grown quite a bit over the last few years, he said; as a result, about six months ago, “we started getting little signals from the cloud providers, ‘Hey, you might need to consider going to region two,’” because they were running out of capacity for CPU or data storage at their facilities as demand grew. It was “very shocking” that they had to move to plan B earlier than they anticipated. “Obviously it&#x27;s good practice to be multi-region, but we were thinking maybe two more years down the road,” said Chen. What&#x27;s not economically feasible (yet)Wonder built its own model to maximize its conversion rate, Chen noted; the goal is to surface new restaurants to relevant customers as much as possible. These are “isolated scenarios” where models are trained over time to be “very, very efficient and very fast.” Currently, the best bet for Wonder’s use case is large models, Chen noted. But in the long term, they’d like to move to small models that are hyper-customized to individuals (via AI agents or concierges) based on their purchase history and even their clickstream. “Having these micro models is definitely the best, but right now the cost is very expensive,” Chen noted. “If you try to create one for each person, it&#x27;s just not economically feasible.”Budgeting is an art, not a scienceWonder gives its devs and data scientists as much playroom as possible to experiment, and internal teams review the costs of use to make sure nobody turned on a model and “jacked up massive compute around a huge bill,” said Chen. The company is trying different things to offload to AI and operate within margins. “But then it&#x27;s very hard to budget because you have no idea,” he said. One of the challenging things is the pace of development; when a new model comes out, “we can’t just sit there, right? We have to use it.” Budgeting for the unknown economics of a token-based system is “definitely art versus science.” A critical component in the software development lifecycle is preserving context when using large native models, he explained. When you find something that works, you can add it to your company’s “corpus of context” that can be sent with every request. That’s big and it costs money each time. “Over 50%, up to 80% of your costs is just resending the same information back into the same engine again on every request,” said Chen. In theory, the more they do should require less cost per unit. “I know when a transaction happens, I&#x27;ll pay the X cent tax for each one, but I don&#x27;t want to be limited to use the technology for all these other creative ideas.\"The &#x27;vindication moment&#x27; for RecursionRecursion, for its part, has focused on meeting broad-ranging compute needs via a hybrid infrastructure of on-premise clusters and cloud inference. When initially looking to build out its AI infrastructure, the company had to go with its own setup, as “the cloud providers didn&#x27;t have very many good offerings,” explained CTO Ben Mabey. “The vindication moment was that we needed more compute and we looked to the cloud providers and they were like, ‘Maybe in a year or so.’” The company’s first cluster in 2017 incorporated Nvidia gaming GPUs (1080s, launched in 2016); they have since added Nvidia H100s and A100s, and use a Kubernetes cluster that they run in the cloud or on-prem. Addressing the longevity question, Mabey noted: “These gaming GPUs are actually still being used today, which is crazy, right? The myth that a GPU&#x27;s life span is only three years, that&#x27;s definitely not the case. A100s are still top of the list, they&#x27;re the workhorse of the industry.” Best use cases on-prem vs cloud; cost differencesMore recently, Mabey’s team has been training a foundation model on Recursion’s image repository (which consists of petabytes of data and more than 200 pictures). This and other types of big training jobs have required a “massive cluster” and connected, multi-node setups. “When we need that fully-connected network and access to a lot of our data in a high parallel file system, we go on-prem,” he explained. On the other hand, shorter workloads run in the cloud. Recursion’s method is to “pre-empt” GPUs and Google tensor processing units (TPUs), which is the process of interrupting running GPU tasks to work on higher-priority ones. “Because we don&#x27;t care about the speed in some of these inference workloads where we&#x27;re uploading biological data, whether that&#x27;s an image or sequencing data, DNA data,” Mabey explained. “We can say, ‘Give this to us in an hour,’ and we&#x27;re fine if it kills the job.” From a cost perspective, moving large workloads on-prem is “conservatively” 10 times cheaper, Mabey noted; for a five year TCO, it&#x27;s half the cost. On the other hand, for smaller storage needs, the cloud can be “pretty competitive” cost-wise. Ultimately, Mabey urged tech leaders to step back and determine whether they’re truly willing to commit to AI; cost-effective solutions typically require multi-year buy-ins. “From a psychological perspective, I&#x27;ve seen peers of ours who will not invest in compute, and as a result they&#x27;re always paying on demand,\" said Mabey. \"Their teams use far less compute because they don&#x27;t want to run up the cloud bill. Innovation really gets hampered by people not wanting to burn money.”",
          "feed_position": 2,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/3GLdSvkbnSK8BCy90z2vow/fd7435230ee4d83e6f66a184129ba54b/Recursor_Wonder_transformed.png?w=300&q=30"
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2023-05/953644c0-f013-11ed-8bdf-a2cfeb7310a6",
      "popularity_score": 2010.0518508333334,
      "ai_summary": [
        "The Google TV Streamer 4K is on sale for $75, a record low price.",
        "This price is available ahead of the upcoming Black Friday sales event.",
        "The streamer has a faster processor, more storage, and more memory.",
        "It features an intuitive interface and integrates with Google Home.",
        "The device comes with a remote and is a full-featured streaming device."
      ]
    },
    {
      "id": "cluster_3",
      "coverage": 1,
      "updated_at": "Sat, 08 Nov 2025 21:27:42 +0000",
      "title": "Blue Origin will ‘move heaven and Earth’ to help NASA reach the Moon faster, CEO says",
      "neutral_headline": "Blue Origin will ‘move heaven and Earth’ to help NASA reach the Moon faster, CEO says",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/11/blue-origin-will-move-heaven-and-earth-to-help-nasa-reach-the-moon-faster-ceo-says/",
          "published_at": "Sat, 08 Nov 2025 21:27:42 +0000",
          "title": "Blue Origin will ‘move heaven and Earth’ to help NASA reach the Moon faster, CEO says",
          "standfirst": "\"We have some ideas that we think could accelerate the path to the Moon.\"",
          "content": "Blue Origin stands ready to help NASA achieve its goals with regard to landing humans on the Moon as soon as possible, the company’s chief executive said Saturday in an interview with Ars. “We just want to help the US get to the Moon,” said Dave Limp, CEO of the space company founded by Jeff Bezos. “If NASA wants to go quicker, we would move heaven and Earth, pun intended, to try to get to the Moon sooner. And I think we have some good ideas.” Limp spoke on Saturday, about 24 hours ahead of the company’s second launch of the large New Glenn rocket. Carrying the ESCAPADE spacecraft for NASA, the mission has a launch window that opens at 2:45 pm ET (19:45 UTC) at Cape Canaveral Space Force Station in Florida, and runs for a little more than two hours.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/New-Glenn-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/New-Glenn-1-1152x648.jpg",
      "popularity_score": 346.73962861111113,
      "ai_summary": [
        "Blue Origin's CEO stated the company will assist NASA's lunar mission.",
        "The company aims to accelerate the timeline for reaching the Moon.",
        "Blue Origin has ideas to expedite the path to the Moon.",
        "The company is committed to supporting NASA's goals.",
        "The CEO's statement reflects a dedication to the project."
      ]
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 20:15:33 +0000",
      "title": "Researchers surprised that with AI, toxicity is harder to fake than intelligence",
      "neutral_headline": "AI Toxicity Is Harder to Fake Than Intelligence",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/11/being-too-nice-online-is-a-dead-giveaway-for-ai-bots-study-suggests/",
          "published_at": "Fri, 07 Nov 2025 20:15:33 +0000",
          "title": "Researchers surprised that with AI, toxicity is harder to fake than intelligence",
          "standfirst": "New \"computational Turing test\" reportedly catches AI pretending to be human with 80% accuracy.",
          "content": "The next time you encounter an unusually polite reply on social media, you might want to check twice. It could be an AI model trying (and failing) to blend in with the crowd. On Wednesday, researchers from the University of Zurich, University of Amsterdam, Duke University, and New York University released a study revealing that AI models remain easily distinguishable from humans in social media conversations, with overly friendly emotional tone serving as the most persistent giveaway. The research, which tested nine open-weight models across Twitter/X, Bluesky, and Reddit, found that classifiers developed by the researchers detected AI-generated replies with 70 to 80 percent accuracy. The study introduces what the authors call a “computational Turing test” to assess how closely AI models approximate human language. Instead of relying on subjective human judgment about whether text sounds authentic, the framework uses automated classifiers and linguistic analysis to identify specific features that distinguish machine-generated from human-authored content.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/frowny_bagboy-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/frowny_bagboy-1152x648.jpg",
      "popularity_score": 328,
      "ai_summary": [
        "Researchers found AI toxicity harder to fake than intelligence.",
        "A new \"computational Turing test\" was used in the study.",
        "The test reportedly identifies AI pretending to be human.",
        "The test achieved an 80% accuracy rate in detecting AI.",
        "The findings suggest a difference in AI capabilities."
      ]
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 23:30:51 +0000",
      "title": "James Watson, who helped unravel DNA’s double-helix, has died",
      "neutral_headline": "James Watson, Co-Discoverer of DNA's Double Helix, Dies",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/11/james-watson-who-helped-unravel-dnas-double-helix-has-died/",
          "published_at": "Fri, 07 Nov 2025 23:30:51 +0000",
          "title": "James Watson, who helped unravel DNA’s double-helix, has died",
          "standfirst": "His work was celebrated, but he was ostracized for racist, sexist comments.",
          "content": "James Dewey Watson, who helped reveal DNA’s double-helix structure, kicked off the Human Genome Project, and became infamous for his racist, sexist, and otherwise offensive statements, has died. He was 97. His death was confirmed to The New York Times by his son Duncan, who said Watson died on Thursday in a hospice in East Northport, New York, on Long Island. He had previously been hospitalized with an infection. Cold Spring Harbor Laboratory also confirmed his passing. Watson was born in Chicago in 1928 and attained scientific fame in 1953 at 25 years old for solving the molecular structure of DNA—the genetic blueprints for life—with his colleague Francis Crick at England’s Cavendish laboratory. Their discovery heavily relied on the work of chemist and crystallographer Rosalind Franklin at King’s College in London, whose X-ray images of DNA provided critical clues to the molecule’s twisted-ladderlike architecture. One image in particular from Franklin’s lab, Photo 51, made Watson and Crick’s discovery possible. But, she was not fully credited for her contribution. The image was given to Watson and Crick without Franklin’s knowledge or consent by Maurice Wilkins, a biophysicist and colleague of Franklin.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-1094223390-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-1094223390-1152x648.jpg",
      "popularity_score": 323,
      "ai_summary": [
        "James Watson, a key figure in DNA discovery, has passed away.",
        "His work on the double helix was widely celebrated.",
        "Watson faced ostracization due to controversial comments.",
        "He made significant contributions to the field of genetics.",
        "His legacy includes both scientific achievements and controversy."
      ]
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 19:33:20 +0000",
      "title": "Commercial spyware “Landfall” ran rampant on Samsung phones for almost a year",
      "neutral_headline": "Commercial Spyware \"Landfall\" Ran on Samsung Phones",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/11/commercial-spyware-landfall-ran-rampant-on-samsung-phones-for-almost-a-year/",
          "published_at": "Fri, 07 Nov 2025 19:33:20 +0000",
          "title": "Commercial spyware “Landfall” ran rampant on Samsung phones for almost a year",
          "standfirst": "Targeted attack could steal all of a phone's data and activate camera or mic.",
          "content": "Another day, another malware attack on smartphones. Researchers at Unit 42, the threat intelligence arm of Palo Alto Networks, have revealed a sophisticated spyware known as “Landfall” targeting Samsung Galaxy phones. The researchers say this campaign leveraged a zero-day exploit in Samsung Android software to steal a raft of personal data, and it was active for almost a year. Thankfully, the underlying vulnerability has now been patched, and the attacks were most likely targeted at specific groups. Unit 42 says that Landfall first appeared in July 2024, relying on a software flaw now catalogued as CVE-2025-21042. Samsung issued a patch for its phones in April 2025, but details of the attack have only been revealed now. Even if you were out there poking around the darker corners of the Internet in 2024 and early 2025 with a Samsung Galaxy device, it’s unlikely you’d be infected. The team believes Landfall was used in the Middle East to target individuals for surveillance. It is currently unclear who was behind the attacks.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/Samsung-Galaxy-Z-Fold-7-17-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/Samsung-Galaxy-Z-Fold-7-17-1152x648.jpg",
      "popularity_score": 303,
      "ai_summary": [
        "Commercial spyware \"Landfall\" targeted Samsung phones.",
        "The spyware operated for almost a year.",
        "The attack could steal phone data and activate camera/mic.",
        "The targeted attack posed a significant security risk.",
        "The spyware's capabilities included data theft and surveillance."
      ]
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 18:28:23 +0000",
      "title": "FBI orders domain registrar to reveal who runs mysterious Archive.is site",
      "neutral_headline": "FBI orders domain registrar to reveal who runs mysterious Archive.is site",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/11/fbi-subpoena-tries-to-unmask-mysterious-founder-of-archive-today/",
          "published_at": "Fri, 07 Nov 2025 18:28:23 +0000",
          "title": "FBI orders domain registrar to reveal who runs mysterious Archive.is site",
          "standfirst": "Tucows subpoenaed in criminal probe for info on “customer behind archive.today.\"",
          "content": "The Federal Bureau of Investigation is trying to unmask the operator of Archive.is, also known as Archive.today, a website that saves snapshots of webpages and is commonly used to bypass news paywalls. The FBI sent a subpoena to domain registrar Tucows, seeking “subscriber information on [the] customer behind archive.today” in connection with “a federal criminal investigation being conducted by the FBI.” The subpoena tells Tucows that “your company is required to furnish this information.” The subpoena is supposed to be secret, but the Archive.today X account posted the document on October 30, the same day the subpoena was issued. The X post contained a link to the PDF and the word “canary.”Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/hidden-face-1152x648-1762539099.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/hidden-face-1152x648-1762539099.jpg",
      "popularity_score": 294,
      "ai_summary": [
        "The FBI is investigating the operators of the Archive.is website.",
        "Tucows, a domain registrar, was subpoenaed in the criminal probe.",
        "The subpoena seeks information on the \"customer behind archive.today.\"",
        "The investigation is related to a criminal probe.",
        "The FBI aims to identify the individuals behind the website."
      ]
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 19:16:16 +0000",
      "title": "The government shutdown is starting to have cosmic consequences",
      "neutral_headline": "Government Shutdown Has Cosmic Consequences",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/11/faa-says-commercial-rockets-must-launch-at-night-citing-government-shutdown/",
          "published_at": "Fri, 07 Nov 2025 19:16:16 +0000",
          "title": "The government shutdown is starting to have cosmic consequences",
          "standfirst": "\"The FAA is concerned with the system's ability to maintain the current volume of operations.\"",
          "content": "The federal government shutdown, now in its 38th day, prompted the Federal Aviation Administration to issue a temporary emergency order Thursday prohibiting commercial rocket launches from occurring during “peak hours” of air traffic. The FAA also directed commercial airlines to reduce domestic flights from 40 “high impact airports” across the country in a phased approach beginning Friday. The agency said the order from the FAA’s administrator, Bryan Bedford, is aimed at addressing “safety risks and delays presented by air traffic controller staffing constraints caused by the continued lapse in appropriations.” The government considers air traffic controllers essential workers, so they remain on the job without pay until Congress passes a federal budget and President Donald Trump signs it into law. The shutdown’s effects, which affected federal workers most severely at first, are now rippling across the broader economy.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/launchstreak-f9-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/launchstreak-f9-1152x648.jpg",
      "popularity_score": 293,
      "ai_summary": [
        "The government shutdown is impacting space-related operations.",
        "The FAA is concerned about maintaining current operations volume.",
        "The shutdown is causing disruptions in various sectors.",
        "The FAA's concerns highlight the shutdown's impact.",
        "The shutdown is affecting the ability to maintain operations."
      ]
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 18:54:38 +0000",
      "title": "Higher prices, simpler streaming expected if HBO Max folds into Paramount+",
      "neutral_headline": "Higher prices, simpler streaming expected if HBO Max folds into Paramount+",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/11/higher-prices-simpler-streaming-expected-if-hbo-max-folds-into-paramount/",
          "published_at": "Fri, 07 Nov 2025 18:54:38 +0000",
          "title": "Higher prices, simpler streaming expected if HBO Max folds into Paramount+",
          "standfirst": "The end of HBO Max is \"certainly plausible.\"",
          "content": "Warner Bros. Discovery (WBD) has a ‘for sale’ sign up. And that could mean big changes for subscribers to the company’s most popular streaming service, HBO Max. After receiving unsolicited acquisition offers, WBD recently declared itself open to “strategic alternatives to maximize shareholder value.” WBD drew new attention by being open to selling its streaming business (WBD is also still open to moving forward with previously shared plans to split into a cable company and a streaming and movie studios company next year). Naturally, mergers and acquisitions talk has heated up since then, with Paramount as one of the most eager suitors. Paramount, which merged with Skydance in August, is reportedly planning to keep “much of Warner Bros. Discovery Inc. intact” if a deal happens, per a Bloomberg report that cited unnamed people familiar with the plans of David Ellison, Paramount’s CEO.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/pedro-pascal-kaitlyn-dever-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/pedro-pascal-kaitlyn-dever-1152x648.jpg",
      "popularity_score": 283,
      "ai_summary": [
        "The future of HBO Max is uncertain, with a potential merger.",
        "The merger could lead to higher prices for streaming services.",
        "A simplified streaming experience is also anticipated.",
        "The end of HBO Max is considered a plausible scenario.",
        "The merger could change the streaming landscape."
      ]
    },
    {
      "id": "cluster_96",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 16:49:53 +0000",
      "title": "Oddest ChatGPT leaks yet: Cringey chat logs found in Google analytics tool",
      "neutral_headline": "Oddest ChatGPT leaks yet: Cringey chat logs found in Google analytics tool",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/11/oddest-chatgpt-leaks-yet-cringey-chat-logs-found-in-google-analytics-tool/",
          "published_at": "Fri, 07 Nov 2025 16:49:53 +0000",
          "title": "Oddest ChatGPT leaks yet: Cringey chat logs found in Google analytics tool",
          "standfirst": "ChatGPT leaks seem to confirm OpenAI scrapes Google, expert says.",
          "content": "For months, extremely personal and sensitive ChatGPT conversations have been leaking into an unexpected destination: Google Search Console (GSC), a tool that developers typically use to monitor search traffic, not lurk private chats. Normally, when site managers access GSC performance reports, they see queries based on keywords or short phrases that Internet users type into Google to find relevant content. But starting this September, odd queries, sometimes more than 300 characters long, could also be found in GSC. Showing only user inputs, the chats appeared to be from unwitting people prompting a chatbot to help solve relationship or business problems, who likely expected those conversations would remain private. Jason Packer, owner of an analytics consulting firm called Quantable, was among the first to flag the issue in a detailed blog last month.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/chatgpt-private-chats-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/chatgpt-private-chats-1152x648.jpg",
      "popularity_score": 280,
      "ai_summary": [
        "ChatGPT leaks include cringey chat logs found in Google analytics.",
        "The leaks suggest OpenAI scrapes Google, according to an expert.",
        "The leaks confirm OpenAI's data collection practices.",
        "The leaks reveal potentially embarrassing chat logs.",
        "The leaks raise questions about data privacy."
      ]
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 18:18:07 +0000",
      "title": "Questions swirl after Trump’s GLP-1 pricing deal announcement",
      "neutral_headline": "Questions swirl after Trump’s GLP-1 pricing deal announcement",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/11/questions-swirl-after-trumps-glp-1-pricing-deal-announcement/",
          "published_at": "Fri, 07 Nov 2025 18:18:07 +0000",
          "title": "Questions swirl after Trump’s GLP-1 pricing deal announcement",
          "standfirst": "It's unclear how much savings the deal provides or how many people will benefit.",
          "content": "At a White House event Thursday, President Trump announced deals with drugmakers Novo Nordisk and Eli Lilly to offer their popular GLP-1 obesity and diabetes drugs at lower prices for some Americans, namely some on Medicare and Medicaid plans. But questions linger about the significance of the deal. According to the announcement, Medicare and state Medicaid programs will be able to purchase a month’s supply of Ozempic, Wegovy, Mounjaro, and Zepbound at $245 each for eligible patients. Eligible people on Medicare will have a $50 co-pay. The negotiated price is a significant cut from the drugs’ list prices: The list price for Ozempic is $997, Wegovy is $1,350, Mounjaro is $1,080, and Zepbound is $1,086. But, of course, purchasers rarely pay drug list prices. It’s unclear how much Medicare and Medicaid would have paid for the drugs without this deal and what the savings will be.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-2244850793-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-2244850793-1152x648.jpg",
      "popularity_score": 263,
      "ai_summary": [
        "Questions surround Trump's announcement about GLP-1 pricing.",
        "The deal's savings and beneficiaries remain unclear.",
        "The announcement has generated uncertainty.",
        "The details of the deal are not fully disclosed.",
        "The impact of the deal is yet to be determined."
      ]
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 16:19:43 +0000",
      "title": "With Skigill, the classic RPG skill tree becomes a crowded battlefield",
      "neutral_headline": "New RPG Skigill blends classic skill trees with unique combat",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/11/with-skigill-the-classic-rpg-skill-tree-becomes-a-crowded-battlefield/",
          "published_at": "Fri, 07 Nov 2025 16:19:43 +0000",
          "title": "With Skigill, the classic RPG skill tree becomes a crowded battlefield",
          "standfirst": "Vampire Survivors-esque battler sets itself apart with great weapons, unique graphics.",
          "content": "If you’ve played any number of RPGs, you probably know the skill tree as a break from the game’s core action. It’s a place to pause, take a breather, and scroll through a massive visual menu of upgrade options, considering which path of stat and ability tweaks best fits your character and your play style. With Skigill, indie developer Achromi has taken that break-time menu and transformed it into the playing field for an intriguing Vampire Survivors-style roguelike. And while the Early Access game currently lacks the kind of deep content that will keep players coming back for a long time, it’s still a clever and engaging take on the genre that I haven’t been able to put down for long. Clear the way, I need +5 armor! Like Vampire Survivors and its many imitators, Skigill is all about navigating through waves of enemies that converge somewhat mindlessly on your position. The game automatically aims and deploys weapons to carve some safe space through what can be screens full of hazardous enemies, which leave behind coins as they explode in puffs of yellow smoke.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/skigill1-1152x648-1762529873.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/skigill1-1152x648-1762529873.jpg",
      "popularity_score": 243,
      "ai_summary": [
        "Skigill features a Vampire Survivors-esque combat system with a focus on weapon variety.",
        "The game's unique graphics help it stand out from other titles in the genre.",
        "Players can customize characters using a traditional RPG skill tree.",
        "Skigill offers a fresh take on the classic RPG formula.",
        "The game's combat is fast-paced and engaging."
      ]
    },
    {
      "id": "cluster_118",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 12:30:44 +0000",
      "title": "How to trade your $214,000 cybersecurity job for a jail cell",
      "neutral_headline": "Cybersecurity job can lead to jail time due to ransomware",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/11/fbi-arrests-ransomware-clean-up-experts-for-planting-ransomware/",
          "published_at": "Fri, 07 Nov 2025 12:30:44 +0000",
          "title": "How to trade your $214,000 cybersecurity job for a jail cell",
          "standfirst": "Ransomware doesn't pay what it used to.",
          "content": "Helping companies pay ransoms to digital extortionists is kind of an odd business. On the one hand, you “negotiate” with cybercriminals and in so doing may drive down the costs of recovering from a particular ransomware incident. On the other hand, you’re helping criminals get paid, funding their operations and making further attacks more likely. And there’s always a temptation built into this kind of work. Seeing lucrative sums being whisked away through cryptocurrency exchanges and “mixing services”… Realizing from up close just how vulnerable companies are… Learning that modern ransomware can operate as a service where you essentially “rent” the code from its developers in return for a cut of the profits…Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-2216280119-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-2216280119-1152x648.jpg",
      "popularity_score": 158,
      "ai_summary": [
        "Ransomware attacks are not as lucrative as they once were.",
        "Cybersecurity professionals face legal risks related to ransomware.",
        "The article highlights the potential consequences of ransomware involvement.",
        "The financial rewards of ransomware have decreased.",
        "The risks associated with ransomware are increasing."
      ]
    },
    {
      "id": "cluster_103",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 15:23:03 +0000",
      "title": "Ford says “no exact date” to restart F-150 Lightning production",
      "neutral_headline": "Ford delays F-150 Lightning production restart, inventory high",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/11/ford-says-no-exact-date-to-restart-f-150-lightning-production/",
          "published_at": "Fri, 07 Nov 2025 15:23:03 +0000",
          "title": "Ford says “no exact date” to restart F-150 Lightning production",
          "standfirst": "The automaker says it has plenty of electric F-150 pickups in inventory, though.",
          "content": "When Ford electrified its bestselling pickup truck, it pulled out all the stops. The F-150 Lightning may look virtually identical to other versions of the pickup, but it’s smoother, faster, and obviously far, far more efficient than the ones that run on gas, diesel, or hybrid power. But the future of the country’s bestselling electric truck may be in doubt. That’s according to a report in The Wall Street Journal, which claims that Ford’s management is “in active discussions about scrapping” the Lightning. Production had already been suspended a few weeks ago due to an aluminum shortage following a destructive fire at a supplier’s factory in New York, which Ford estimates may result in as much as $2 billion in losses to the company. While Ford told Ars it doesn’t comment on speculation on its future product plans, the automaker said that “F-150 Lightning is the best-selling electric pickup truck in the US—despite new competition from CyberTruck, Chevy, GMC, Hummer and Rivian—and delivered record sales in Q3.”Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-1243051479-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-1243051479-1152x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "Ford has not set a specific date to restart F-150 Lightning production.",
        "The automaker currently has a significant inventory of electric F-150 pickups.",
        "Ford is managing its electric vehicle production carefully.",
        "The company is assessing market demand for the electric truck.",
        "Ford is adjusting its production strategy based on current conditions."
      ]
    },
    {
      "id": "cluster_109",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 14:29:51 +0000",
      "title": "Mark Zuckerberg’s illegal school drove his neighbors crazy",
      "neutral_headline": "Mark Zuckerberg's school caused issues for neighbors",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/11/mark-zuckerbergs-illegal-school-drove-his-neighbors-crazy/",
          "published_at": "Fri, 07 Nov 2025 14:29:51 +0000",
          "title": "Mark Zuckerberg’s illegal school drove his neighbors crazy",
          "standfirst": "Neighbors complained about noise, security guards, and hordes of traffic.",
          "content": "The Crescent Park neighborhood of Palo Alto, California, has some of the best real estate in the country, with a charming hodgepodge of homes ranging in style from Tudor revival to modern farmhouse and contemporary Mediterranean. It also has a gigantic compound that is home to Mark Zuckerberg, his wife Priscilla Chan, and their daughters Maxima, August, and Aurelia. Their land has expanded to include 11 previously separate properties, five of which are connected by at least one property line. The Zuckerberg compound’s expansion first became a concern for Crescent Park neighbors as early as 2016, due to fears that his purchases were driving up the market. Then, about five years later, neighbors noticed that a school appeared to be operating out of the Zuckerberg compound. This would be illegal under the area’s residential zoning code without a permit. They began a crusade to shut it down that did not end until summer 2025. WIRED obtained 1,665 pages of documents about the neighborhood dispute—including 311 records, legal filings, construction plans, and emails—through a public record request filed to the Palo Alto Department of Planning and Development Services. (Mentions of “Zuckerberg” or “the Zuckerbergs” appear to have been redacted. However, neighbors and separate public records confirm that the property in question belongs to the family. The names of the neighbors who were in touch with the city were also redacted.)Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/zuckerbergcompund-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/zuckerbergcompund-1152x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "Neighbors of Mark Zuckerberg's school complained about noise levels.",
        "Security guards and increased traffic were also sources of complaint.",
        "The school's presence created disturbances for nearby residents.",
        "The complaints highlight the impact of the school on the community.",
        "The school's operations caused disruption to the neighborhood."
      ]
    },
    {
      "id": "cluster_113",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 13:51:40 +0000",
      "title": "Rocket Report: Canada invests in sovereign launch; India flexes rocket muscles",
      "neutral_headline": "Rocket Report: Canada invests in launch; India flexes rocket muscles",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/11/rocket-report-canada-invests-in-sovereign-launch-india-flexes-rocket-muscles/",
          "published_at": "Fri, 07 Nov 2025 13:51:40 +0000",
          "title": "Rocket Report: Canada invests in sovereign launch; India flexes rocket muscles",
          "standfirst": "Europe's Ariane 6 rocket gave an environmental monitoring satellite a perfect ride to space.",
          "content": "Welcome to Edition 8.18 of the Rocket Report! NASA is getting a heck of a deal from Blue Origin for launching the agency’s ESCAPADE mission to Mars. Blue Origin is charging NASA about $20 million for the launch on the company’s heavy-lift New Glenn rocket. A dedicated ride on any other rocket capable of the job would undoubtedly cost more. But there are trade-offs. First, there’s the question of risk. The New Glenn rocket is only making its second flight, and it hasn’t been certified by NASA or the US Space Force. Second, the schedule for ESCAPADE’s launch has been at the whim of Blue Origin, which has delayed the mission several times due to issues developing New Glenn. NASA’s interplanetary missions typically have a fixed launch period, and the agency pays providers like SpaceX and United Launch Alliance a premium to ensure the launch happens when it needs to happen. New Glenn is ready, the satellites are ready, and Blue Origin has set a launch date for Sunday, November 9. The mission will depart Earth outside of the usual interplanetary launch window, so orbital dynamics wizards came up with a unique trajectory that will get the satellites to Mars in 2027.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-2224592867-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/GettyImages-2224592867-1152x648.jpg",
      "popularity_score": 133,
      "ai_summary": [
        "Canada is investing in sovereign launch capabilities.",
        "India is demonstrating its rocket technology prowess.",
        "Europe's Ariane 6 rocket successfully launched a satellite.",
        "The Ariane 6 mission delivered an environmental monitoring satellite.",
        "The report covers developments in space launch programs."
      ]
    },
    {
      "id": "cluster_105",
      "coverage": 1,
      "updated_at": "Fri, 07 Nov 2025 15:13:25 +0000",
      "title": "10,000 generations of hominins used the same stone tools to weather a changing world",
      "neutral_headline": "Stone tools used for 10,000 generations by hominins",
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/11/10000-generations-of-hominins-used-the-same-stone-tools-to-weather-a-changing-world/",
          "published_at": "Fri, 07 Nov 2025 15:13:25 +0000",
          "title": "10,000 generations of hominins used the same stone tools to weather a changing world",
          "standfirst": "This technological tradition lasted longer than Homo sapiens have even been a species.",
          "content": "At a site in Kenya, archaeologists recently unearthed layer upon layer of stone stools from deposits that span 300,000 years, and include a period of intense environmental upheaval. The oldest tools at the site date back to 2.75 million years ago. According to a recent study, the finds suggest that for hundreds of millennia, ancient hominins relied on the same stone tool technology as an anchor while the world changed around them. Oldowan choppers dated to 1.7 million years ago, from Melka Kunture, Ethiopia. Credit: By Didier Descouens - Own work, CC BY-SA 4.0, https://commons.wikimedia.org/w/index.php?curid=11291046 “An extraordinary story of cultural continuity” George Washington University archaeologist David Braun and his colleagues recently unearthed stone tools from a 2.75 million-year-old layer of Kenyan sediment at a site called Nomorotukunan. They’re classic examples of a type of tools archaeologists call Oldowan: the earliest types of sharp-edged stone tools made by hominins. The tools unearthed at Nomorotukunan are some of the oldest Olduwan tools ever found; only three other Oldowan sites in Africa date back any further than 2.6 million years ago. These hand-sized chunks of river rock, with flakes chipped off one or two sides to make sharp edges, were cutting-edge technology (not sorry) from 2.9 million years ago until about 1.7 million years ago. In technical terms, that’s what’s called a long flipping time, enough to span several hominin species and more than one genus. The last hominins to use Oldowan tools looked very different, and probably lived and behaved very differently, from the first; over this huge span of time, the stone tool technology itself changed less than the beings using it.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/1302px-Pierre_taillee_Melka_Kunture_Ethiopie_fond-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/1302px-Pierre_taillee_Melka_Kunture_Ethiopie_fond-1152x648.jpg",
      "popularity_score": 128,
      "ai_summary": [
        "Hominins used the same stone tools for 10,000 generations.",
        "This technological tradition lasted longer than Homo sapiens have existed.",
        "The tools were used to adapt to changing environmental conditions.",
        "The longevity of the tool use is a significant finding.",
        "The research highlights the resilience of early hominin populations."
      ]
    }
  ]
}